      *
      * Avtale-serier
      *
     A          R AAVTPFR                   PFILE(AAVTPF)
      *
      * Nøkkel
      *
     A          K ATFIRM
     A          K ATAARR
     A          K ATTEXT
     A          K ATNUMM
