      *
      * Avtale-serier
      *
     A                                      REF(*LIBL/AFRF)
     A          R AAVTPFR
     A            ATFIRM    R
     A            ATAARR    R
     A            ATNUMM    R
     A            ATUSER    R
     A            ATROLL    R
HOFF A            ATGRNR    R
     A            ATSAFE    R
     A            ATAVDE    R
     A            ATPROJ    R
     A            ATKKAT    R
     A            ATKUND    R
     A            ATLEVR    R
     A            ATTEXT    R
     A            ATNAVN    R
     A            ATREFR    R
     A            ATTYPE    R
     A            ATNIVA    R
     A            ATKRRA    R
     A            ATKRFO    R
     A            ATADAT    R
     A            ATSDAT    R
     A            ATTDAT    R
     A            ATCDAT    R
     A            ATODAT    R
     A            ATEDAT    R
     A            ATETIM    R
     A            ATEUSR    R
