     A*  Aktiviteter ved bygging av ny filgruppe
     A*
     A                                      UNIQUE
     A          R ABYDPFR                   PFILE(ABYDPF)
     A* Nøkkel
     A          K ABDLIN
