     A*  Aktiviteter ved bygging av ny filgruppe
     A*
     A
     A          R ABYDPFR
     A            ABDLIN         5S 0       COLHDG('Linje')
     A            ABDFDA          L         COLHDG('Ferdig.Dato')
     A            ABDFTI          T         COLHDG('Ferdig.Tid')
     A            ABDOUS        10A         COLHDG('Oppr.Av')
     A            ABDEDA          L         COLHDG('Endr.Dato')
     A            ABDETI          T         COLHDG('Endr.Tid')
     A            ABDEUS        10A         COLHDG('Endr.Av')
