      *
      * File for utskrift av DDS-spes.
      *
     A                                      REF(*LIBL/AFRF)
     A          R ADDSPFR
     A            AZF001    R
     A            AZCOL6    R
     A            AZCOL7    R
     A            AZF002    R
     A            AZFELT    R
     A            AZF003    R
     A            AZFLEN    R
     A            AZANUM    R
     A            AZF004    R
     A            AZADES    R
     A            AZF005    R
     A            AZBESK    R
     A            AZF006    R
