      *
      * Dato og klokkeslett for siste opdpatering fra ADRA
      *
     A          R ADRDPFR
     A            ADUSER        10A
      *                            XX = Fast
     A            ADDATO          L
     A            ADFRAT          T
     A            ADTILT          T
