      *
      * Elektroniske hylleforkanter
      *
     A          R AELHPFR                   PFILE(*LIBL/AELHPF)
      *
     A          K AEFILG
     A          K AEFIRM
     A          K AELAGE
