      *
      * Rutineregister - AVVIK
      *
     A          R AFAPPFR                   PFILE(AFAPPF)
      *
      * Nøkkel
      *
     A          K AFARUT
     A          K AFAFIR
     A          K AFAAVD
