      *
      * Firma-register
      *
     A                                      REF(*LIBL/AFRF)
     A          R AFIRPFR
     A            AAFFIR    R
     A            AAFNAV    R
     A            AAFAD1    R
     A            AAFAD2    R
     A            AAFSTE    R
     A            AAFTLF    R
     A            AAFFAX    R
     A            AAFBGI    R
     A            AAFFTN    R
     A            AAMVAP    R
     A            AAIBAN    R
     A            AASWIF    R
     A            AAHARK    R
     A            AAMAIL    R
6.21 A            AAWEBA    R
6.22 A            AASMST    R
6.22 A            AASMSP    R
     A            AAODAT    R
     A            AAEDAT    R
     A            AAETIM    R
     A            AAEUSR    R
