      *
      * ftp FIL-LISTE
      *
     A          R AFLFPF
     A            SRCSEQ         6S 2
     A            SRCDAT         6S 0
     A            SRCDTA       188A         TEXT('Data')
     A                                      COLHDG('Data')
