      *
      * AFLGPF Flaggfil elektroniske etiketter
      *
     A          R AUTHPF
     A            AUTHPF       512A         TEXT('Flaggfil')
     A                                      COLHDG('Flaggfil')
