      *
      * Rutineregister
      *
     A                                      REF(*LIBL/AFRF)
     A          R AFOPPFR
     A            AFPRUT    R
     A            AFPPDF    R
     A            AFPMAI    R
     A            AFPARC    R
     A            AFPPRV    R
     A            AFPLAN    R
     A            AFPEXL    R
     A            AFPXLM    R
     A            AFPJAS    R
     A            AFPLOG    R
     A            AFPODA    R
     A            AFPOTI    R
     A            AFPOUS    R
     A            AFPEDA    R
     A            AFPETI    R
     A            AFPEUS    R
