      *
      * Rutineregister
      *
     A                                      REF(*LIBL/AFRF)
     A          R AFORPFR
     A            AFRUTI    R
     A            AFTXT1    R
     A            AFTXT2    R
     A            AFMLD1    R
     A            AFMLD2    R
     A            AFMLD3    R
     A            AFFORM    R
     A            AFOUTQ    R
     A            AFACPI    R
     A            AFALIN    R
     A            AFAPOS    R
     A            AFOFLW    R
     A            AFAKOP    R
     A            AFHLDQ    R
     A            AFSAVE    R
     A            AFPRTY    R
     A            AFINST    R
     A            AFPRFI    R
     A            AFBGIR    R
     A            AFMVAK    R
     A            AFKIDK    R
     A            AFOCRK    R
     A            AFIPDS    R
     A            AFHEX1    R
     A            AFHEX2    R
     A            AFPROG    R
     A            AFCHGV    R
     A            AFTVBT    R
     A            AF0ROT    R
     A            AFSKIN    R
     A            AFSKUT    R
     A            AFPKVA    R
     A            AFDPLX    R
     A            AFARKI    R
     A            AFETIK    R
     A            AFWORK    R
     A            AFPDFA    R
