      *
      * EGENSKAPER TIL GYLDIGE PRINTERE FOR PDF UTSKRIFT
      *
     A                                      REF(*LIBL/AFRF)
     A          R AFPPPFR
     A            AFVFIL    R
     A            AFVPRT    R
     A            AFVSTD    R
     A            AFVGIR    R
     A            AFVODA    R
     A            AFVOTI    R
     A            AFVOUS    R
     A            AFVEDA    R
     A            AFVETI    R
     A            AFVEUS    R
