      *
      * GYLDIGE SKRIVERE FOR PDF UTSKRIFTER
      *
     A          R AFPRPFR                   PFILE(AFPRPF)
      *
     A          K AFSFIL
     A          K AFSPRT
