      *
      * 'PROPERTIES' FIL FOR PRINT OG ARKIV
      *
     A                                      REF(*LIBL/AFRF)
     A          R AFPSPFR
     A            AFUFIL    R
     A            AFUIDE    R
     A            AFUDSS    R
     A            AFUODA    R
     A            AFUOTI    R
     A            AFUOUS    R
     A            AFUEDA    R
     A            AFUETI    R
     A            AFUEUS    R
