     A          R AFRFR                     TEXT('Syst. Adm. FRF')
      *
      *         DetteErEnFrf    (NB!!  Denne må ikke fjernes)
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
5.01  * R5.01 101002 AMD  Lagt inn løsning for sending av filer ved
5.01  *                   hjelp av FTP
5.02  * R5.02 101002 AMD  Lagt inn løsning for sending av mail
5.03  * R5.03 101002 AMD  Lagt inn referansefil for Kidd-nummer
5.04  * R5.04 200203 AMD  Lagt inn koder for :
5.04  *                   1) Tvungen batchkjøring   (På rutine)
5.04  *                   2) Ingen papir-rotasjon   (På rutine)
5.04  *                   3) Valg av innskuff       (På rutine/printer)
5.04  *                   4) Valg av utskuff        (På rutine/printer)
5.04  * R5.04 200203 AMD  I tillegg er dette tatt med på printerstyring
5.04  *                   slik at det kan overstyre rutineregister:
5.04  *                   1) Formularhøyde
5.04  *                   2) Overflow
5.21  * R5.21 061103 AMD  Lagt inn Internasjonalt bankkontonummer og
5.21  *                   swift-kode (Bic-nummer)
5.21  *                   Fjernet postgironummer fra firma/avd-register
5.22  * R5.22 071103 AMD  Forbedringer i enhetsregister / rutineregister
5.22  *                   og skriverstyring (forslag ifølge JAF.)
5.23  * R5.23 071103 AMD  Tillegg for bruk av historisk arkiv
5.31  * R5.31 300604 AMD  Lagt inn ny database for Miljø
5.32  * R5.32 080704 AMD  Lagt inn variabel for gruppe i brukerregister
5.33  * R5.33 270804 AMD  Valg om å kunne holde spool etter utskrift
5.34  * R5.34 060904 AMD  Lagt inn e-mail adresse i firmaregister
5.35  * R5.35 100904 AMD  Nye tabeller for kontroll av moduler
5.40  * R5.40 140605 AMD  Valg om firmaopplysninger skal printes eller
      *                   ikke, er nå også lagt inn på printerstyrings-
      *                   register (fra før bare rutineregister)
      * R5.40 090606 KRK  Ny tabell for avtalearkiv
      * R5.40 090606 KRK  Ny tabell for sikkerhetsgruppe-register
5.41  * R5.41 130206 AMD  Lagt inn et nytt felt i AKIDPF-filen hvor
      *                   det kan lagres et egendefinert KIDD-nummer.
      *                   Årstall er tatt med for å skille v/like nr.
5.51  * R5.51 240107 AMD  Ny variabel i bruker-register for tilgang
5.52  * R5.52 220607 BOF  Utvidet filkopiering med Filgr. Påslag
6.10  * R6.10 130809 BSA  Innført filer for logging. Generell for alle
6.10  *                   jobber.
6.11  * R6.10 040210 BSA  Workfile med transaksjoner for integrasjon mellom
6.11  *                   RPG og Java.
5.60  * R5.60 260310 BSA  Nye filer for PDF informasjon.
5.61  * R5.60 110510 BSA  Oversikt over gyldige skrivere for PDF print. NB Fila
5.61  *                   vedlikeholdes av JAVA rutine.
5.62  * R5.60 140510 BSA  Properties file pr filgruppe for PDF print.
5.63  * R5.60 280510 BSA  Avvik fra standard
6.10  * R6.10 030610 BSA  Ryddet i PDF filene
6.12  * R6.10 160710 BSA  Egenskaper til skrivere. Brukes i PROA
6.13  * R6.10 120111 BOF  Oversikt over XML-overføring nobb
6.14  * R6.10 080611 BOF  Utvidet filkopi-reg. med sist overf.datoer
6.15  * R6.10 111111 BOF  Nytt reg. under filkopi-reg med parametre
6.16  * R6.10 180113 BOF  Utvidet xml-register
6.20  * R6.20 050511 BOF  Register med regler for validering
6.21  * R6.20 250511 BSA  Legger ut mailadresse på firmaregister
6.22  * R6.20 031111 BOF  Utvidet firmareg med fra-telefon og passord
6.23  * R6.20 270513 SST  NYTT REGISTER MED SUBS. OPPSTART ETTER IPL
6.24  * R6.20 190813 BSA  Utvidet register for nettbutikker
6.25  * R6.20 150714 bof  Utvidet XML register med div. felter
6.NU  *       210514 BOF  Nummerserieutvidelse
6.30  * R6.30 130814 BSA  Rutineregister emailadresser
6.31  * R6.30 130814 BSA  Utvider felt i AFPSPF
6.32  * R6.31 270515 BOF  Utvider KID referanse fra 6 til 8 pos
6.33  * R6.31 080219 BOF  utvidet med felt p} ANBLPF
7.00  * R7.00 100216 BSA  Menyregistre
7.01  * R7.00 090819 BKV  NX Kundetilpasninger
7.02  * R7.00 210420 SST  Nytt gen. register for ekstra felter alle register
7.03  * R7.00 071020 BOF  (SST) LAGT INN ADGANGSKONTROLL
7.04  * R7.00 171120 BOF  Ny tabell AFGRST filegrupper pr. server
7.05  * R7.00 130421 BOF  Utvidet AFGRST med kjede
7.06  * R7.00 090521 BOF  Utvidet AFGRST med miljø
      *
      *
      *
      * Koder benyttet i Ordre/Fakturering
      *
      *           AÅ = Referansefelter (Nye)
      *           AA = Referansefelter (Gml)
      *
      *           AA = Firma-register
      *           AB = Bruker-register
      *           ACH= Filkopierings-hode
      *           ACL= Filkopierings-linje
6.15  *           ACP= Filkopierings-parametre
5.20  *           ADH=FTP logg, hode
5.20  *           ADL=FTP logg, linje
      *           AE = Enheter / utkøer / skrivere
5.01  *           AF = Rutine-register
7.04  *           AFG= Filegrupper pr. server
7.04  *           AFP= PDF register
5.60  *           AFT= PDF mal register
5.61  *           AFS= Oversikt over gyldige PDF skrivere
5.62  *           AFU= Properties file for Print og Arkiv
6.12  *           AFV= Egenskaper til gyldige PDF skrivere
      *           AF = FTP-Overføringer
      *           AG = File-gruppe-register
      *           AH = Handels-register
      *           AH = Historikk nattjobb
      *           AI = Info-register
      *           AJ = Fylkes-register
6.10  *           AJS= Jobblogging - status
6.10  *           AJT= Jobblogging - transaksjoner
      *           AK = Kommune-register
5.03  *           AK = Referansefil Kiddnummer
      *           AL = Biblioteks-lister
5.02  *           AM = Mail-server-register
      *           AN = Nummer-register
      *           AOH= Nettbutikk-eier
      *           AOL= Nettbutikk
      *           AP = Poststeds-register
5.31  *           AR = Release-opplysninger      (Utgår)
5.31  *           AR = Miljø
      *           AS = System-register
      *           AT = Avtale-arkiv-register
      *           ATS= Sikkerhets-gruppe-register
      *           AU = Notat-register
      *           AV = Verdier i nattrutine
      *           AW = Arbeids-stasjoner
5.35  *           AX = Moduler
6.13  *           AXM= XML overføring kunder
      *           AZ = Utskriftsfile for DDS
      **
      **  FRF (REFERANSEFELTER)
      **
      *
     A            AÅVALG         1S 0       TEXT('Valg')
     A                                      COLHDG('Valg')
     A                                      EDTCDE(Z)
     A            AÅVALA      0001A
     A                                      COLHDG('Valg')
     A                                      TEXT('Valg')
     A            AÅNYEN      0011A
     A                                      COLHDG('Ny/Endr')
     A                                      TEXT('Ny/Endr')
     A            AÅMELD      0050A
     A                                      COLHDG('Meldingsfelt')
     A                                      TEXT('Meldingsfelt')
     A            AÅSVAR      0001A
     A                                      COLHDG('Svar')
     A                                      TEXT('Svar')
     A            AÅN070      0007S 0
     A                                      COLHDG('Antall 7,0')
     A                                      TEXT('Antall 7,0')
     A                                      EDTCDE(M)
      *
     A            AÅODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
6.10  *
6.10 A            AÅOTIM          T         TEXT('Opprette tidspunkt')
6.10 A                                      COLHDG('Oppr.tid')
6.10  *
6.10 A            AÅOUSR        10A         TEXT('Opprettet av')
6.10 A                                      COLHDG('Opprettet av')
      *
     A            AÅEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
      *
     A            AÅETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
      *
     A            AÅEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
7.03 A**  ARB    FRF (Felles arbeidsfelter)
7.03 A**
7.03 A            ZZVALG      0001A
7.03 A                                      COLHDG('Valg')
7.03 A                                      TEXT('Valg')
7.03 A            Z1VALG      0001S 0
7.03 A                                      COLHDG('Valg')
7.03 A                                      TEXT('Valg')
7.03 A                                      EDTCDE(Z)
7.03 A            ZZNYEN      0011A
7.03 A                                      COLHDG('Ny/Endr')
7.03 A                                      TEXT('Ny/Endr')
7.03 A            ZZORDN      0006S 0
7.03 A                                      EDTCDE(Z)
7.03 A                                      TEXT('Ordrenr.')
7.03 A            ZZDATO          L
7.03 A                                      COLHDG('Dato')
7.03 A                                      TEXT('Dato')
7.03 A            ZZDATOR     0006S 0
7.03 A                                      COLHDG('Dato')
7.03 A                                      TEXT('Dato')
      **
      **  Firma-register (A)
      **
     A            AAFFIR      0003S 0
     A                                      COLHDG('Firma')
     A                                      TEXT('Firma')
     A                                      EDTCDE(Z)
     A            AAFNAV      0030A
     A                                      COLHDG('Firma-navn')
     A                                      TEXT('Firma-navn')
     A            AAFAD1      0030A
     A                                      COLHDG('Adresse')
     A                                      TEXT('Adresse')
     A            AAFAD2      0030A
     A                                      COLHDG('Mellomadresse')
     A                                      TEXT('Mellomadresse')
     A            AAFSTE      0030A
     A                                      COLHDG('Poststed')
     A                                      TEXT('Poststed')
     A            AAFTLF      0011A
     A                                      COLHDG('Telefonnummer')
     A                                      TEXT('Telefonnummer')
     A            AAFFAX      0011A
     A                                      COLHDG('Telefaxnummer')
     A                                      TEXT('Telefaxnummer')
     A            AAFBGI      0011S 0
     A                                      COLHDG('Bankgiro')
     A                                      TEXT('Bankgiro')
     A                                      EDTCDE(Z)
     A            AAFFTN      0009S 0
     A                                      COLHDG('Foretaksnummer')
     A                                      TEXT('Foretaksnummer')
     A                                      EDTCDE(Z)
     A            AAMVAP      0001S 0
     A                                      COLHDG('MVA')
     A                                      TEXT('MVA')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
5.21 A            AAIBAN      0030A
5.21 A                                      COLHDG('Internasj.bankkto.nr')
5.21 A                                      TEXT('Internasj. bankkto.nr')
5.21 A            AASWIF      0030A
5.21 A                                      COLHDG('Swift' 'kode')
5.21 A                                      TEXT('Swift - kode')
      *
5.23 A            AAHARK      0001S 0
5.23 A                                      COLHDG('Hist' 'arkiv')
5.23 A                                      TEXT('Historisk arkiv')
5.23 A                                      EDTCDE(Z)
5.23 A                                      VALUES(0 1)
5.23 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
5.33 A            AAMAIL      0050A
5.33 A                                      COLHDG('E-mail')
5.33 A                                      TEXT('E-mail')
      *
6.21 A            AAWEBA      0050A
6.21 A                                      COLHDG('Webadresse')
6.21 A                                      TEXT('Webadresse')
6.22 A            AASMST      0011A
6.22 A                                      COLHDG('SMS-telefonnr')
6.22 A                                      TEXT('SMS-telefonnr')
6.22 A            AASMSP      0012A
6.22 A                                      COLHDG('SMS-passord')
6.22 A                                      TEXT('SMS-passord')
      *
5.33 A            AAODAT    R               REFFLD(AÅODAT)
5.33 A            AAEDAT    R               REFFLD(AÅEDAT)
5.33 A            AAETIM    R               REFFLD(AÅETIM)
5.33 A            AAEUSR    R               REFFLD(AÅEUSR)
      **
      **  Bruker-register (B)
      **
     A            ABUSER      0010A
     A                                      COLHDG('Bruker')
     A                                      TEXT('Bruker')
     A            ABNAVN      0030A
     A                                      COLHDG('Navn')
     A                                      TEXT('Navn')
5.51 A            ABTILG      0010A
5.51 A                                      COLHDG('Tilgang')
5.51 A                                      TEXT('Tilgang')
     A            ABLEVL      0002S 0
     A                                      COLHDG('Sikkerhetsnivå')
     A                                      TEXT('Sikkerhetsnivå')
     A                                      EDTCDE(Z)
     A                                      VALUES(00 10 20 30 40 50)
     A                                      CHKMSGID(AMB0060 *LIBL/QMFAGPL)
     A            ABTLFN      0011A
     A                                      COLHDG('Telefon')
     A                                      TEXT('Telefon')
     A            ABMENY      0010A
     A                                      COLHDG('Meny')
     A                                      TEXT('Start-Meny')
     A            ABSFIL      0003A
     A                                      COLHDG('S.fil')
     A                                      TEXT('Siste filgruppe')
     A            ABSBIB      0010A
     A                                      COLHDG('S.Bibl.')
     A                                      TEXT('Siste bibliotek')
     A            ABSFIR      0003S 0
     A                                      COLHDG('S.fir')
     A                                      TEXT('Siste firma')
     A                                      EDTCDE(Z)
     A            ABSAVD      0004S 0
     A                                      COLHDG('S.Avd')
     A                                      TEXT('Siste Avdeling')
     A                                      EDTCDE(Z)
     A            ABLAGR      0002S 0
     A                                      COLHDG('Lager')
     A                                      TEXT('Lager')
     A                                      EDTCDE(Z)
     A            ABFNAV      0030A
     A                                      COLHDG('Firma-navn')
     A                                      TEXT('Siste firma-navn')
5.31 A            ABMILJ      0003A
5.31 A                                      COLHDG('Miljø')
5.31 A                                      TEXT('Miljø')
     A            ABBFIL      0001A
     A                                      COLHDG('Filgrp')
     A                                      TEXT('Begrense til filgrp.')
     A            ABBFIR      0001A
     A                                      COLHDG('Firma')
     A                                      TEXT('Begrense til firma')
     A            ABBAVD      0001A
     A                                      COLHDG('Avd.')
     A                                      TEXT('Begrense til avd.')
     A            ABA4S3      0001A
     A                                      COLHDG('AS/S36')
     A                                      TEXT('AS/400 S/36')
     A            ABRLIB      0010A
     A                                      COLHDG('Ref.bibl.liste')
     A                                      TEXT('Ref.bibl.liste')
5.32 A            ABGRUP      0010A
5.32 A                                      COLHDG('Gruppe')
5.32 A                                      TEXT('Gruppe')
     A            ABEDAT    R               REFFLD(AÅEDAT)
     A            ABETIM    R               REFFLD(AÅETIM)
     A            ABEUSR    R               REFFLD(AÅEUSR)
      **
      **  Filkopiering-hode-register        (ACH)
      **
     A            ACHFGR         3          TEXT('Filgruppe')
     A                                      COLHDG('Filgrp.')
     A            ACHFIR         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            ACHEDA    R               REFFLD(AÅEDAT)
     A            ACHETI    R               REFFLD(AÅETIM)
     A            ACHEUS    R               REFFLD(AÅEUSR)
      **
      **  Filkopiering-linje-register       (ACL)
      **
     A            ACLFGR         3          TEXT('Filgruppe')
     A                                      COLHDG('Filgrp.')
     A            ACLFIR         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            ACLFGT         3          TEXT('Filgruppe til')
     A                                      COLHDG('Filgrp. til')
     A            ACLFIT         3S 0       TEXT('Firma til')
     A                                      COLHDG('Firma til')
     A                                      EDTCDE(Z)
     A            ACLVSO        10          TEXT('Varesortiment')
     A                                      COLHDG('Sort.')
     A            ACLPFA        10          TEXT('Påslag')
     A                                      COLHDG('Påslag')
5.52 A            ACLPFG         3          TEXT('Filgr.Påslag')
5.52 A                                      COLHDG('Filgr.Påslag')
     A            ACLVTY         1S 0       TEXT('Beholde varetype')
     A                                      COLHDG('Beholde' 'varetype')
     A                                      EDTCDE(4)
     A            ACLPKO         1S 0       TEXT('Beholde priskode')
     A                                      COLHDG('Beholde' 'priskode')
     A                                      EDTCDE(4)
     A            ACLOVS         1S 0       TEXT('Oppr. varesort')
     A                                      COLHDG('Oppr.' 'varesort')
     A                                      EDTCDE(4)
     A            ACLKLE         1S 0       TEXT('Kopier leverandørinfo.')
     A                                      COLHDG('Kopier' 'lev.info.')
     A                                      EDTCDE(4)
     A            ACLKRS         1S 0       TEXT('Kopier rab./spes.pris')
     A                                      COLHDG('Kopier' 'rab./pris.')
     A                                      EDTCDE(4)
     A            ACLKVG         1S 0       TEXT('Kopier varegrp-reg.')
     A                                      COLHDG('Kopier' 'varegrp.')
     A                                      EDTCDE(4)
     A            ACLKRG         1S 0       TEXT('Kopier rab.grp-reg.')
     A                                      COLHDG('Kopier' 'rab.grp.')
     A                                      EDTCDE(4)
     A            ACLKRK         1S 0       TEXT('Kopier rab.grp.knytn-reg.')
     A                                      COLHDG('Kopier' 'rab.grp.knytn.')
     A                                      EDTCDE(4)
     A            ACLKVS         1S 0       TEXT('Kopier varesort-reg.')
     A                                      COLHDG('Kopier' 'varesort.')
     A                                      EDTCDE(4)
6.14 A            ACLVVD    R               REFFLD(AÅEDAT)
6.14 A                                      COLHDG('vvarpf' 'dato')
6.14 A                                      TEXT('vvarpf dato')
6.14 A            ACLVVT    R               REFFLD(AÅETIM)
6.14 A                                      COLHDG('vvarpf' 'dato')
6.14 A                                      TEXT('vvarpf dato')
6.14 A            ACLVPD    R               REFFLD(AÅEDAT)
6.14 A                                      COLHDG('vvprpf' 'dato')
6.14 A                                      TEXT('vvprpf dato')
6.14 A            ACLVPT    R               REFFLD(AÅETIM)
6.14 A                                      COLHDG('vvprpf' 'dato')
6.14 A                                      TEXT('vvprpf dato')
6.14 A            ACLVED    R               REFFLD(AÅEDAT)
6.14 A                                      COLHDG('vvenpf' 'dato')
6.14 A                                      TEXT('vvenpf dato')
6.14 A            ACLVET    R               REFFLD(AÅETIM)
6.14 A                                      COLHDG('vvenpf' 'dato')
6.14 A                                      TEXT('vvenpf dato')
6.14 A            ACLVXD    R               REFFLD(AÅEDAT)
6.14 A                                      COLHDG('veanpf' 'dato')
6.14 A                                      TEXT('veanpf dato')
6.14 A            ACLVXT    R               REFFLD(AÅETIM)
6.14 A                                      COLHDG('veanpf' 'dato')
6.14 A                                      TEXT('veanpf dato')
6.14 A            ACLVTD    R               REFFLD(AÅEDAT)
6.14 A                                      COLHDG('vtilpf' 'dato')
6.14 A                                      TEXT('vtilpf dato')
6.14 A            ACLVTT    R               REFFLD(AÅETIM)
6.14 A                                      COLHDG('vtilpf' 'dato')
6.14 A                                      TEXT('vtilpf dato')
6.14 A            ACLVSD    R               REFFLD(AÅEDAT)
6.14 A                                      COLHDG('vvsopf' 'dato')
6.14 A                                      TEXT('vvsopf dato')
6.14 A            ACLVST    R               REFFLD(AÅETIM)
6.14 A                                      COLHDG('vvsopf' 'dato')
6.14 A                                      TEXT('vvsopf dato')
     A            ACLEDA    R               REFFLD(AÅEDAT)
     A            ACLETI    R               REFFLD(AÅETIM)
     A            ACLEUS    R               REFFLD(AÅEUSR)
6.15  **
6.15  **  Filkopiering-parametre-register       (ACP)
6.15  **
6.15 A            ACPFGR         3          TEXT('Filgruppe')
6.15 A                                      COLHDG('Filgrp.')
6.15 A            ACPFIR         3S 0       TEXT('Firma')
6.15 A                                      COLHDG('Firma')
6.15 A                                      EDTCDE(Z)
6.15 A            ACPFGT         3          TEXT('Filgruppe til')
6.15 A                                      COLHDG('Filgrp. til')
6.15 A            ACPFIT         3S 0       TEXT('Firma til')
6.15 A                                      COLHDG('Firma til')
6.15 A                                      EDTCDE(Z)
6.15 A            ACPTYP         1          TEXT('Parametertype')
6.15 A                                      COLHDG('Parametertype')
6.15 A                                      VALUES('L' 'V')
6.15 A            ACPLIN         4  0       TEXT('Parm.Linjenr')
6.15 A                                      COLHDG('Parm.linQenr')
6.15 A            ACPLEV         6  0       TEXT('Ikke kopier leverandør')
6.15 A                                      COLHDG('ikke kop' 'leverandør')
6.15 A            ACPVAF        15          TEXT('Ikke kopier Varenr fra')
6.15 A                                      COLHDG('ikke kop' 'Varenr fra')
6.15 A            ACPVAT        15          TEXT('Ikke kopier Varenr til')
6.15 A                                      COLHDG('ikke kop' 'Varenr til')
6.15 A            ACPEDA    R               REFFLD(AÅEDAT)
6.15 A            ACPETI    R               REFFLD(AÅETIM)
6.15 A            ACPEUS    R               REFFLD(AÅEUSR)
      **
      **  FTP logg, hode
      **
     A            ADHFIR         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A            ADHNAV        10A         TEXT('Jobbnavn')
     A                                      COLHDG('Jobb' 'navn')
     A            ADHUID          Z         TEXT('Unik ident')
     A                                      COLHDG('Unik' 'ident')
     A            ADHSTA         1A         TEXT('Status')
     A                                      COLHDG('Status')
     A            ADHKOM        80A         TEXT('Kommentar')
     A                                      COLHDG('Komm.')
     A            ADHUSR        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      **
      **  FTP logg, linjer
      **
     A            ADLFIR         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A            ADLNAV        10A         TEXT('Jobbnavn')
     A                                      COLHDG('Jobb' 'navn')
     A            ADLUID          Z         TEXT('Unik ident')
     A                                      COLHDG('Unik' 'ident')
     A            ADLLIN         5S 0       TEXT('Linjenummer')
     A                                      COLHDG('L.nr')
     A            ADLTXT       200A         TEXT('Tekst')
     A                                      COLHDG('Tekst')
      **
      **  Enhets-register Utkøer/Skrivere (E)
      **
     A            AEPRID      0010A
     A                                      COLHDG('Prt.id')
     A                                      TEXT('Printer-id.')
     A            AETILK      0001S 0
     A                                      COLHDG('Tilkobling')
     A                                      TEXT('Tilkobl.')
     A                                      EDTCDE(Z)
5.22 A                                      VALUES(0 1 2 3)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AESTRT      0001S 0
     A                                      COLHDG('Starte autom.')
     A                                      TEXT('Starte')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AEQMSG      0001S 0
     A                                      COLHDG('Meldingsalt.')
     A                                      TEXT('Mld')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AEFORM      0010A
     A                                      COLHDG('Formulartype')
     A                                      TEXT('Formular')
     A            AEOCRK      0001S 0
     A                                      COLHDG('Ocr-kode')
     A                                      TEXT('Ocr-kode')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2 3 4)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AEHEX1      0020A
     A                                      COLHDG('Styrekode' 'Start')
     A                                      TEXT('Styrekode Start')
     A            AEHEX2      0020A
     A                                      COLHDG('Styrekode' 'Slutt')
     A                                      TEXT('Styrekode Slutt')
     A            AEBESK      0030A
     A                                      COLHDG('Beskrivelse')
     A                                      TEXT('Beskrivelse')
     A            AEPLAS      0030A
     A                                      COLHDG('Plassering')
     A                                      TEXT('Plassering')
     A            AETYPE      0001S 0
     A                                      TEXT('Printer-type')
     A                                      COLHDG('Printer' 'type')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2 3 4)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
      *
5.22 A            AEIPAD        30A
5.22 A                                      COLHDG('Ip-adresse')
5.22 A                                      TEXT('Ip-adresse')
      *
5.22 A            AEPORT        10A
5.22 A                                      COLHDG('Portnr.')
5.22 A                                      TEXT('Portnr.')
      *
5.22 A            AESTYP        15A
5.22 A                                      COLHDG('Skriver' 'type')
5.22 A                                      TEXT('Skrivertype')
      *
5.22 A            AETOBJ        10A
5.22 A                                      COLHDG('Tilpasn' 'objekt')
5.22 A                                      TEXT('Tilpasningsobjekt')
      *
     A            AEEDAT    R               REFFLD(AÅEDAT)
     A            AEETIM    R               REFFLD(AÅETIM)
     A            AEEUSR    R               REFFLD(AÅEUSR)
      **
      **  Rutiner (F)
      **
     A            AFRUTI      0010A
     A                                      COLHDG('Rutine')
     A                                      TEXT('Rutine')
     A            AFTXT1      0040A
     A                                      COLHDG('Tekst 1')
     A                                      TEXT('Tekst 1')
     A            AFTXT2      0040A
     A                                      COLHDG('Tekst 2')
     A                                      TEXT('Tekst 2')
     A            AFMLD1      0040A
     A                                      COLHDG('Melding 1')
     A                                      TEXT('Melding 1')
     A            AFMLD2      0040A
     A                                      COLHDG('Melding 2')
     A                                      TEXT('Melding 2')
     A            AFMLD3      0040A
     A                                      COLHDG('Melding 3')
     A                                      TEXT('Melding 3')
     A            AFFORM      0010A
     A                                      COLHDG('Form')
     A                                      TEXT('Formular')
     A            AFOUTQ      0010A
     A                                      COLHDG('Skriver/utkø')
     A                                      TEXT('Skriver/utkø')
     A            AFACPI      0002S 0
     A                                      COLHDG('Ant.cpi')
     A                                      TEXT('Antall cpi')
     A                                      EDTCDE(Z)
     A            AFALIN      0003S 0
     A                                      COLHDG('Ant.linjer')
     A                                      TEXT('Antall linjer')
     A                                      EDTCDE(Z)
     A            AFAPOS      0003S 0
     A                                      COLHDG('Ant.posisjoner')
     A                                      TEXT('Ant. posisjoner')
     A                                      EDTCDE(Z)
     A            AFOFLW      0003S 0
     A                                      COLHDG('Linje for overflow')
     A                                      TEXT('Linje for overflow')
     A                                      EDTCDE(Z)
     A            AFAKOP      0003S 0
     A                                      COLHDG('Ant.kopier')
     A                                      TEXT('Antall kopier')
     A                                      EDTCDE(Z)
     A            AFHLDQ      0001S 0
     A                                      COLHDG('Holdes i kø')
     A                                      TEXT('Holdes i kø')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AFSAVE      0001S 0
     A                                      COLHDG('Lagres' ' etter utskr.')
     A                                      TEXT('Lagres etter utskr.')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AFPRTY      0001
     A                                      COLHDG('Prioritet')
     A                                      TEXT('Prioritet')
     A                                      VALUES(' ' '0' '1' '2' '3' '4' +
     A                                             '5' '6' '7' '8' '9')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AFINST      0001S 0
     A                                      COLHDG('Innstillingslinje')
     A                                      TEXT('Innstillingslinje')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AFPRFI      0001S 0
     A                                      COLHDG('Printe firmaoppl.')
     A                                      TEXT('Printe firmaoppl.')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AFBGIR      0001S 0
     A                                      COLHDG('Bankgiro')
     A                                      TEXT('Bankgiro')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AFMVAK      0001S 0
     A                                      COLHDG('Mva-kode')
     A                                      TEXT('Mva-kode')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AFKIDK      0001S 0
     A                                      COLHDG('Skrive Kidd')
     A                                      TEXT('Skrive Kidd')
     A                                      EDTCDE(Z)
5.41 A                                      VALUES(0 1 2 3)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AFOCRK      0001S 0
     A                                      COLHDG('Ocr-kode')
     A                                      TEXT('Ocr-kode')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2 3 4)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AFIPDS      0001S 0
     A                                      COLHDG('IPDS-kode')
     A                                      TEXT('IPDS-kode')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            AFHEX1      0020A
     A                                      COLHDG('Styrekode' 'Start')
     A                                      TEXT('Styrekode Start')
     A            AFHEX2      0020A
     A                                      COLHDG('Styrekode' 'Slutt')
     A                                      TEXT('Styrekode Slutt')
     A            AFPROG      0010A
     A                                      COLHDG('Program')
     A                                      TEXT('Program')
     A            AFCHGV      0001S 0
     A                                      COLHDG('Endre ' 'valg')
     A                                      TEXT('Endre valg')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
5.04 A            AFTVBT      0001A
5.04 A                                      COLHDG('Tvungen' 'batch')
5.04 A                                      TEXT('Tvungen batch')
5.04 A                                      VALUES(' ' '1')
5.04 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
5.04 A            AF0ROT      0001A
5.04 A                                      COLHDG('Ingen' 'rotasjon')
5.04 A                                      TEXT('Ingen rotasjon')
5.04 A                                      VALUES(' ' '1')
5.04 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
5.04 A            AFSKIN      0002S 0
5.04 A                                      COLHDG('Inn' 'Skuff')
5.04 A                                      TEXT('Inn Skuff')
5.04 A                                      EDTCDE(Z)
5.04 A            AFSKUT      0002S 0
5.04 A                                      COLHDG('Ut' 'Skuff')
5.04 A                                      TEXT('Ut Skuff')
5.04 A                                      EDTCDE(Z)
      *
5.22 A            AFPKVA        10A
5.22 A                                      COLHDG('Print' 'Kvalitet')
5.22 A                                      TEXT('Print-kvalitet')
      *
5.22 A            AFDPLX         7A
5.22 A                                      COLHDG('Duplex')
5.22 A                                      TEXT('Duplex')
      *
5.23 A            AFARKI      0001S 0
5.23 A                                      COLHDG('Arki-' 'vering')
5.23 A                                      TEXT('Arkivering')
5.23 A                                      EDTCDE(Z)
5.23 A                                      VALUES(0 1)
5.23 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
      *
5.23 A            AFETIK      0001S 0
5.23 A                                      COLHDG('Etikett' 'utskr.')
5.23 A                                      TEXT('Etikett-utskrift')
5.23 A                                      EDTCDE(Z)
5.23 A                                      VALUES(0 1)
5.23 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
      *
5.23 A            AFWORK      0001S 0
5.23 A                                      COLHDG('Work' 'flow')
5.23 A                                      TEXT('Work-flow')
5.23 A                                      EDTCDE(Z)
5.23 A                                      VALUES(0 1)
5.23 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
      *
5.23 A            AFPDFA      0001S 0
5.23 A                                      COLHDG('Pdf' 'Ark')
5.23 A                                      TEXT('Pdf-arkivering')
5.23 A                                      EDTCDE(Z)
5.23 A                                      VALUES(0 1)
5.23 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
      *
5.01  **
5.01  **  FTP-Overføringer (F)
5.01  **
5.01 A            AFFIRM         3S 0
5.01 A                                      COLHDG('Firma')
5.01 A                                      TEXT('Firma')
5.01 A                                      EDTCDE(Z)
5.01 A            AFNAVN        10A         TEXT('Overføringsnavn')
5.01 A                                      COLHDG('Overf' 'Navn')
5.01 A            AFHOST        20A         TEXT('Ip adr. / Hostnavn')
5.01 A                                      COLHDG('Ip adr.' 'Hostnavn')
5.01 A            AFUSER        10A         TEXT('Bruker på host')
5.01 A                                      COLHDG('Bruker')
5.01 A            AFPRXU        20A         TEXT('Proxy server')
5.01 A                                      COLHDG('Proxy ' 'server')
5.01 A            AFPASS        10A         TEXT('Passord på host')
5.01 A                                      COLHDG('Passord')
5.01 A            AFLOCD       100A         TEXT('Lokal bane')
5.01 A                                      COLHDG('Lokal bane')
5.01 A            AFCHDR       100A         TEXT('Bane på host')
5.01 A                                      COLHDG('Bane på host')
5.01 A            AFFILN        20A         TEXT('Filnavn')
5.01 A                                      COLHDG('Filnavn')
5.01 A            AFFILT        20A         TEXT('Filnavn etter send')
5.01 A                                      COLHDG('Filnavn etter send')
5.01 A            AFTYPE         4A         TEXT('Overføringstype')
5.01 A                                      COLHDG('Overføringstype')
5.01 A            AFBESK        50A         TEXT('Beskrivelse')
5.01 A                                      COLHDG('Beskrivelse')
5.01 A            AFKONI        10A         TEXT('Konv.tabell, inn')
5.01 A                                      COLHDG('Konv.tab.' 'inn')
5.01 A            AFKOIL        10A         TEXT('Bibl konv. inn')
5.01 A                                      COLHDG('Bibl konv' 'inn')
5.01 A            AFKONO        10A         TEXT('Konv.tabell, ut')
5.01 A                                      COLHDG('Konv tab.' 'ut')
5.01 A            AFKOOL        10A         TEXT('Bibl konv. ut')
5.01 A                                      COLHDG('Bibl konv.' 'ut')
5.01 A            AFJSCD         1A         TEXT('Lagt i jobbplan?')
5.01 A                                      COLHDG('Lagt i' 'jobbplan')
5.01 A            AFFILS         1A         TEXT('Filsystem')
5.01 A                                      COLHDG('Filsystem')
5.01 A            AFSLET         1A         TEXT('Slett når ferdig?')
5.01 A                                      COLHDG('Slett når' 'ferdig?')
5.01 A            AFBINA         1A         TEXT('Binary transfer?')
5.01 A                                      COLHDG('Binary' 'transfer?')
5.01 A            AFSTAT         1A         TEXT('Status')
5.01 A                                      COLHDG('Status')
5.01 A            AFOKTX        80A         TEXT('Ok tekst')
5.01 A                                      COLHDG('Ok tekst')
5.01 A            AFREPL         1A         TEXT('Erstatte gamle filer?')
5.01 A                                      COLHDG('Erstatte gamle' 'filer?')
5.01 A            AFBKUP       100A         TEXT('Backup av filer ved put')
5.01 A                                      COLHDG('Backup av filer' 'ved put?')
5.01 A            AFQYPS         1A         TEXT('Spørre om passord')
5.01 A                                      COLHDG('Spørre om' 'passord')
5.01 A            AFRENA        10A         TEXT('Bruke midl. etternavn')
5.01 A                                      COLHDG('Bruke midl.' 'etternavn')
5.01 A            AFXCM1        50A         TEXT('Kjøre extra kommando?')
5.01 A                                      COLHDG('Kjøre extra' 'kommando')
5.01 A            AFXCM2        50A         TEXT('Kjøre extra kommando2?')
5.01 A                                      COLHDG('Kjøre extra' 'kommando2')
5.01 A            AFXCM3        50A         TEXT('Kjøre extra kommando3?')
5.01 A                                      COLHDG('Kjøre extra' 'kommando3')
5.01 A            AFEDAT          L         TEXT('Endringsdato')
5.01 A                                      COLHDG('Endr.dat')
5.01 A            AFETIM          T         TEXT('Endringstidspunkt')
5.01 A                                      COLHDG('Endr.tid')
5.01 A            AFEUSR        10A         TEXT('Endret av')
5.01 A                                      COLHDG('Endret av')
5.01 A            AFSPAS         1A         TEXT('PASSIV/AKTIV')
5.01 A                                      COLHDG('PAS/AKT')
5.01 A            AFNENA        10A         TEXT('NYTT ETTERNAVN')
5.01 A                                      COLHDG('NY E.NAVN')
5.01 A            AFTELL         1A         TEXT('BRUK TELLER?')
5.01 A                                      COLHDG('TELLER?')
5.01 A            AFTLEN         1S 0       TEXT('TELLER LENGDE')
5.01 A                                      COLHDG('T.LEN.')
5.01 A            AFTVAL         9S 0       TEXT('TELLER VERDI')
5.01 A                                      COLHDG('T.VAL.')
5.01 A            AFLIBT         1A         TEXT('BIBL. OVERFØRING?')
5.01 A                                      COLHDG('BIB.OVRF.')
5.01 A            AFZIPL         1A         TEXT('ZIPPE BIBLIOTEK')
5.01 A                                      COLHDG('ZIP')
5.01 A            AFCUSR        10A         TEXT('OPPRETTET AV')
5.01 A                                      COLHDG('OPPR.AV')
5.01 A            AFRUNF        10A         TEXT('KJØR NY FTP')
5.01 A                                      COLHDG('RUN.FTP')
5.01 A            AFKDAT          L         TEXT('KJØRT DATO')
5.01 A                                      COLHDG('K.DATO')
5.01 A            AFKTID          T         TEXT('KJØRT TID')
5.01 A                                      COLHDG('K.TID')
      **
      **  Filegrupper (G)
      **
     A            AGFGRP      0003A
     A                                      COLHDG('Filgrp')
     A                                      TEXT('File-gruppe')
     A            AGBIBL      0010A
     A                                      COLHDG('Bibliotek')
     A                                      TEXT('Bibliotek')
     A            AGBESK      0030A
     A                                      COLHDG('Beskrivelse')
     A                                      TEXT('Beskrivelse')
     A            AGBACK      0001A
     A                                      COLHDG('U/Backup')
     A                                      TEXT('U/Backup')
      **
      **  Handelsdistrikt
      **
     A            AHDINR      0003S 0
     A                                      COLHDG('Distriktnummer')
     A                                      TEXT('Distriktnummer')
     A                                      EDTCDE(Z)
     A            AHNAVN      0030A
     A                                      COLHDG('Distrikt')
     A                                      TEXT('Distrikt')
      **
      **  Historikk-register nattrutine
      **
     A            AHDATO      0008S 0
     A                                      COLHDG('Dato')
     A                                      TEXT('Dato')
     A                                      EDTCDE(Z)
     A            AHTTID      0006S 0
     A                                      COLHDG('Tid')
     A                                      TEXT('Tid')
     A                                      EDTCDE(Z)
     A            AHTXT1      0040A
     A                                      COLHDG('Tekst 1')
     A                                      TEXT('Tekst 1')
     A            AHSNAV      0010A
     A                                      COLHDG('Systemnavn')
     A                                      TEXT('Systemnavn')
      **
      **  Info-register Bruker/System (I)
      **
     A            AIUSER      0010A
     A                                      COLHDG('Bruker')
     A                                      TEXT('Bruker')
     A            AISYST      0004A
     A                                      COLHDG('System')
     A                                      TEXT('System')
     A            AIFIRM      0003S 0
     A                                      COLHDG('Firma')
     A                                      TEXT('Firma')
     A                                      EDTCDE(Z)
     A            AIRUTI      0010A
     A                                      COLHDG('Rutine')
     A                                      TEXT('Rutine')
     A            AIFLT1      0050A
     A                                      COLHDG('Felt 1')
     A                                      TEXT('Felt 1')
     A            AIFLT2      0050A
     A                                      COLHDG('Felt 2')
     A                                      TEXT('Felt 2')
     A            AIFLT3      0050A
     A                                      COLHDG('Felt 3')
     A                                      TEXT('Felt 3')
     A            AIFLT4      0050A
     A                                      COLHDG('Felt 4')
     A                                      TEXT('Felt 4')
      **
      **  Fylkesregister
      **
     A            AJFYNR      0002S 0
     A                                      COLHDG('Fylkesnummer')
     A                                      TEXT('Fylkesnummer')
     A                                      EDTCDE(Z)
     A            AJNAVN      0030A
     A                                      COLHDG('Fylke')
     A                                      TEXT('Fylke')
      **
      **  Kommune-register
      **
     A            AKKOMN      0004S 0
     A                                      COLHDG('Kommunenummer')
     A                                      TEXT('Kommunenummer')
     A                                      EDTCDE(Z)
     A            AKNAVN      0030A
     A                                      COLHDG('Kommune')
     A                                      TEXT('Kommune')
5.03  **
5.03  **  Kidd-nummer referansefil
5.03  **
5.03 A            AKFIRM      0003S 0       TEXT('Firma')
5.03 A                                      COLHDG('Firma')
5.03 A                                      EDTCDE(Z)
5.03  *
6.32 A            AKKIDR      0008S 0       TEXT('Kidd referansenr')
5.03 A                                      COLHDG('Kidd' 'Ref')
5.03 A                                      EDTCDE(Z)
5.03  *
5.03 A            AKKSIF      0001S 0       TEXT('Kontroll-siffer')
5.03 A                                      COLHDG('Kont' 'Siff')
5.03 A                                      EDTCDE(Z)
5.03  *
5.03 A            AKKIDD      0025A         TEXT('Kiddnummer')
5.03 A                                      COLHDG('Kidd')
5.41  *
5.41 A            AKKID2      0025A         TEXT('Kiddnummer 2')
5.41 A                                      COLHDG('Kidd-2')
5.41  *
5.41 A            AKAARR      0004S 0       TEXT('Årstall')
5.41 A                                      COLHDG('År')
5.03  *
5.03 A            AKEDAT    R               REFFLD(AÅEDAT)
5.03 A            AKETIM    R               REFFLD(AÅETIM)
5.03 A            AKEUSR    R               REFFLD(AÅEUSR)
5.03  *
      **
      **  Biblioteks-lister (L)
      **
     A            ALUSER      0010A
     A                                      COLHDG('Bruker')
     A                                      TEXT('Bruker')
     A            ALPLAS      0003S 0
     A                                      COLHDG('Plass')
     A                                      TEXT('Plassering')
     A                                      EDTCDE(Z)
     A            ALBIBL      0010A
     A                                      COLHDG('Bibliotek')
     A                                      TEXT('Bibliotek')
5.02  **
5.02  **  MAILSERVER PÅ FIRMA
5.02  **
5.02 A            AMMFIR      0003S 0
5.02 A                                      COLHDG('Firma')
5.02 A                                      TEXT('Firma')
5.02 A                                      EDTCDE(Z)
5.02 A            AMMSVR        35A
5.02 A                                      COLHDG('Server')
5.02 A                                      TEXT('Mailserver')
5.02 A            AMEUSR        10A
5.02 A                                      COLHDG('Endret av')
5.02 A                                      TEXT('Endret av')
5.02 A            AMODAT          L
5.02 A                                      COLHDG('OPPR' 'DATO')
5.02 A                                      TEXT('OPPRETTET DATO')
5.02 A            AMEDAT          L
5.02 A                                      COLHDG('ENDR' 'DATO')
5.02 A                                      TEXT('ENDRET DATO')
5.02 A            AMETIM          T
5.02 A                                      COLHDG('ENDR' 'TID')
5.02 A                                      TEXT('ENDRET TID')
      **
      **  Nummer-register (N)
      **
     A            ANFIRM      0003S 0
     A                                      COLHDG('Firma')
     A                                      TEXT('Firma')
     A                                      EDTCDE(Z)
     A            ANFELL      0006A
     A                                      COLHDG('Felles-kode')
     A                                      TEXT('Felles-kode')
     A            ANTYPE      0002A
     A                                      COLHDG('Type')
     A                                      TEXT('Type')
     A            ANFAST      0010A
     A                                      COLHDG('Fast')
     A                                      TEXT('Fast')
     A            ANTXT1      0030A
     A                                      COLHDG('Tekst-1')
     A                                      TEXT('Tekst-1')
     A            ANTXT2      0030A
     A                                      COLHDG('Tekst-2')
     A                                      TEXT('Tekst-2')
     A            ANWRAP      0001A
     A                                      COLHDG('Wrap-around')
     A                                      TEXT('Wrap-around')
     A            ANÅRNU      0001A
     A                                      COLHDG('Null ved år')
     A                                      TEXT('Null ved år')
     A            ANAUTO      0001A
     A                                      COLHDG('Auto/Manuell')
     A                                      TEXT('Auto/Manuell')
6.NU A            ANLENG      0001S 0
6.NU A                                      COLHDG('8 langt num.')
6.NU A                                      TEXT('8 langt num.')
6.NU A            ANNFOM      0008S 0
     A                                      COLHDG('F.o.m.')
     A                                      TEXT('F.o.m.')
     A                                      EDTCDE(Z)
6.NU A            ANNTOM      0008S 0
     A                                      COLHDG('T.o.m.')
     A                                      TEXT('T.o.m.')
     A                                      EDTCDE(Z)
6.NU A            ANSIST      0008S 0
     A                                      COLHDG('Sist brukte')
     A                                      TEXT('Sist brukte')
     A                                      EDTCDE(Z)
      **
      **  Nettbutikk-eier                   (AOH)
      **
     A            AOHEIE        10          TEXT('Butikkeier')
     A                                      COLHDG('Butikkeier')
     A            AOHNAV        35          TEXT('Navn')
     A                                      COLHDG('Navn')
     A            AOHODA    R               REFFLD(AÅODAT)
     A            AOHEDA    R               REFFLD(AÅEDAT)
     A            AOHETI    R               REFFLD(AÅETIM)
     A            AOHEUS    R               REFFLD(AÅEUSR)
      **
      **  Nettbutikk                        (AOL)
      **
     A            AOLEIE        10          TEXT('Butikkeier')
     A                                      COLHDG('Butikkeier')
     A            AOLBUT        15          TEXT('Butikk')
     A                                      COLHDG('Butikk')
     A            AOLNAV        35          TEXT('Navn')
     A                                      COLHDG('Navn')
     A            AOLFGR         3          TEXT('Filgruppe')
     A                                      COLHDG('Filgrp.')
     A            AOLFIR         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            AOLAVD         4S 0       TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A                                      EDTCDE(Z)
     A            AOLLAG         2          TEXT('Lager')
     A                                      COLHDG('Lager')
6.24 A            AOHKOD         2S 0       TEXT('Hentes kode')
6.24 A                                      EDTCDE(Z)
6.24 A                                      COLHDG('Hentes kode')
6.24 A            AOLKOD         2S 0       TEXT('Leveres kode')
6.24 A                                      EDTCDE(Z)
6.24 A                                      COLHDG('Leveres kode')
6.33 A            AOFKOD         2S 0       TEXT('Hentes fabrikk')
6.33 A                                      EDTCDE(Z)
6.33 A                                      COLHDG('Hentes fabr.')
     A            AOLODA    R               REFFLD(AÅODAT)
     A            AOLEDA    R               REFFLD(AÅEDAT)
     A            AOLETI    R               REFFLD(AÅETIM)
     A            AOLEUS    R               REFFLD(AÅEUSR)
      **
      **  Post-steds-register
      **
     A            APPONR      0004P 0
     A                                      COLHDG('Post')
     A                                      TEXT('Postnummer')
     A                                      EDTCDE(Z)
     A            APSTED      0025A
     A                                      COLHDG('Poststed')
     A                                      TEXT('Poststed')
     A            APREST      0007A
     A                                      COLHDG('Resten')
     A                                      TEXT('Resten')
     A            APFYLK      0002P 0
     A                                      COLHDG('Fylke')
     A                                      TEXT('Fylke')
     A                                      EDTCDE(Z)
     A            APKOMM      0002P 0
     A                                      COLHDG('Kommune')
     A                                      TEXT('Kommune')
     A                                      EDTCDE(Z)
     A            APKNAV      0030A
     A                                      COLHDG('Kommunenavn')
     A                                      TEXT('Kommunenavn')
5.31  **
5.31  **  Miljø (R)
5.31  **
5.31 A            ARMILJ      0003A
5.31 A                                      COLHDG('Miljø')
5.31 A                                      TEXT('Miljø')
5.31 A            ARBESK      0030A
5.31 A                                      COLHDG('Beskrivelse')
5.31 A                                      TEXT('Beskrivelse')
5.31 A            ARVERS      0003S 0
5.31 A                                      COLHDG('Versjon')
5.31 A                                      TEXT('Versjon')
5.31 A                                      EDTCDE(Z)
5.31 A            ARODAT    R               REFFLD(AÅODAT)
5.31 A            AREDAT    R               REFFLD(AÅEDAT)
5.31 A            ARETIM    R               REFFLD(AÅETIM)
5.31 A            AREUSR    R               REFFLD(AÅEUSR)
      **
      **  System-register (S)
      **
     A            ASSYST      0010A
     A                                      COLHDG('System')
     A                                      TEXT('System')
     A            ASSKOD      0001A
     A                                      COLHDG('Kode')
     A                                      TEXT('System-kode')
     A            ASBESK      0030A
     A                                      COLHDG('Beskrivelse')
     A                                      TEXT('Beskrivelse')
     A            ASIDAT      0006S 0
     A                                      COLHDG('I.Dato')
     A                                      TEXT('I.Dato')
     A                                      EDTCDE(Y)
     A            ASKOM1      0050A
     A                                      COLHDG('Kommentarer 1')
     A                                      TEXT('Kommentarer 1')
     A            ASKOM2      0050A
     A                                      COLHDG('Kommentarer 2')
     A                                      TEXT('Kommentarer 2')
     A            ASKOM3      0050A
     A                                      COLHDG('Kommentarer 3')
     A                                      TEXT('Kommentarer 3')
     A            ASKOM4      0050A
     A                                      COLHDG('Kommentarer 4')
     A                                      TEXT('Kommentarer 4')
     A            ASPRCA      0008A
     A                                      COLHDG('Proc.AS400')
     A                                      TEXT('Prosedyre AS400')
     A            ASPRCS      0008A
     A                                      COLHDG('Proc. S/36')
     A                                      TEXT('Prosedyre S/36')
      **
      **  Avtale-arkiv-register (T)
      **
     A            ATFIRM      0003S 0
     A                                      COLHDG('Firma')
     A                                      TEXT('Firma')
     A                                      EDTCDE(Z)
     A            ATAARR      0004S 0
     A                                      COLHDG('År')
     A                                      TEXT('År')
     A                                      EDTCDE(Z)
     A            ATNUMM      0006S 0
     A                                      COLHDG('Avtalenummer')
     A                                      TEXT('Avtalenummer')
     A                                      EDTCDE(Z)
     A            ATUSER      0010A
     A                                      COLHDG('Saksbehandler')
     A                                      TEXT('Saksbehandler')
     A            ATROLL      0010A
     A                                      COLHDG('Rolle')
     A                                      TEXT('Rolle')
     A            ATGRNR      0010A
     A                                      COLHDG('Sikkerhetsgruppe')
     A                                      TEXT('Sikkerhetsgruppe')
     A            ATSAFE      0004S 0
     A                                      COLHDG('Sikkerhetskode')
     A                                      TEXT('Sikkerhetskode')
     A                                      EDTCDE(Z)
     A            ATAVDE      0004S 0
     A                                      COLHDG('Avdeling')
     A                                      TEXT('Avdeling')
     A                                      EDTCDE(Z)
     A            ATPROJ      0006S 0
     A                                      COLHDG('Prosjekt')
     A                                      TEXT('Prosjekt')
     A                                      EDTCDE(Z)
     A            ATKKAT      0002S 0
     A                                      COLHDG('Kundekategori')
     A                                      TEXT('Kundekategori')
     A                                      EDTCDE(Z)
     A            ATKUND      0006S 0
     A                                      COLHDG('Kunde')
     A                                      TEXT('Kunde')
     A                                      EDTCDE(Z)
     A            ATLEVR      0006S 0
     A                                      COLHDG('Leverandør')
     A                                      TEXT('Leverandør')
     A                                      EDTCDE(Z)
     A            ATTEXT      0040A
     A                                      COLHDG('Beskrivelse')
     A                                      TEXT('Beskrivelse')
     A            ATNAVN      0030A
     A                                      COLHDG('Navn motpart')
     A                                      TEXT('Navn motpart')
     A            ATREFR      0030A
     A                                      COLHDG('Manuell ark.refr')
     A                                      TEXT('Manuell ark.refr')
     A            ATTYPE      0020A
     A                                      COLHDG('Avtale type')
     A                                      TEXT('Avtale type')
     A            ATNIVA      0020A
     A                                      COLHDG('Avtale nivå')
     A                                      TEXT('Avtale nivå')
     A            ATKRRA      0011S 2
     A                                      COLHDG('Inntekts ramme')
     A                                      TEXT('Inntekst ramme')
     A            ATKRFO      0011S 2
     A                                      COLHDG('Inntekts forpl.')
     A                                      TEXT('Inntekst forpl.')
     A            ATADAT    R               REFFLD(AÅEDAT)
     A                                      COLHDG('Avtale dato')
     A                                      TEXT('Avtale dato')
     A            ATSDAT    R               REFFLD(AÅEDAT)
     A                                      COLHDG('Start dato')
     A                                      TEXT('Start dato')
     A            ATTDAT    R               REFFLD(AÅEDAT)
     A                                      COLHDG('Stopp dato')
     A                                      TEXT('Stopp dato')
     A            ATCDAT    R               REFFLD(AÅEDAT)
     A                                      COLHDG('Endret dato')
     A                                      TEXT('Endret dato')
     A            ATODAT    R               REFFLD(AÅEDAT)
     A                                      COLHDG('OBS dato')
     A                                      TEXT('OBS dato')
     A            ATEDAT    R               REFFLD(AÅEDAT)
     A            ATETIM    R               REFFLD(AÅETIM)
     A            ATEUSR    R               REFFLD(AÅEUSR)
      **
      **  Sikkerhets-gruppe-register
      **
     A            ATSGRN      0010A
     A                                      COLHDG('Gruppe-nummer')
     A                                      TEXT('Gruppe-nummer')
     A            ATSGRS      0010A
     A                                      COLHDG('Under-grp-nummer')
     A                                      TEXT('Under-grp-nummer')
     A            ATSGRU      0010A
     A                                      COLHDG('Bruker')
     A                                      TEXT('Bruker')
     A            ATSGRT      0030A
     A                                      COLHDG('Tekst')
     A                                      TEXT('Tekst')
      *
      * Notat                               (AU)
      *
     A            AUFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            AUSYST         4          TEXT('System')
     A                                      COLHDG('System')
     A            AUNOID        15          TEXT('Notat-id')
     A                                      COLHDG('Notat-id')
     A            AULINE         6S 0       TEXT('Linjenr')
     A                                      COLHDG('Ln')
     A                                      EDTCDE(Z)
     A            AUNOTA        40          TEXT('Notat')
     A                                      COLHDG('Notat')
     A            AUEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
     A            AUETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
     A            AUEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
      **
      **  Verdier i nattrutiner
      **
     A            AVVKEY      0001S 0
     A                                      COLHDG('Keyfelt')
     A                                      TEXT('Keyfelt')
     A            AVDATO      0006S 0
     A                                      COLHDG('Lagt opp dato')
     A                                      TEXT('Lagt opp dato')
     A            AVTTMM      0004S 0
     A                                      COLHDG('Klokkeslett')
     A                                      TEXT('Klokkeslett')
     A            AVDENS      0011A
     A                                      COLHDG('Density')
     A                                      TEXT('Density')
     A            AVRORG      0001A
     A                                      COLHDG('Reorg')
     A                                      TEXT('Reorg')
     A            AVBACK      0001A
     A                                      COLHDG('Backup')
     A                                      TEXT('Backup')
     A            AVSSBS      0001A
     A                                      COLHDG('Stoppe SBS')
     A                                      TEXT('Stoppe SBS')
     A            AVPRC1      0001A
     A                                      COLHDG('Ekstra jobber')
     A                                      TEXT('Ekstra jobber')
     A            AVPRC2      0001A
     A                                      COLHDG('EJ andre syst')
     A                                      TEXT('EJ andre syst')
     A            AVSTRT      0001A
     A                                      COLHDG('Egen startjobb')
     A                                      TEXT('Egen startjobb')
     A            AVSLUT      0001A
     A                                      COLHDG('Egen sluttjobb')
     A                                      TEXT('Egen sluttjobb')
     A            AVGENP      0001A
     A                                      COLHDG('Generere prog nå')
     A                                      TEXT('Generere prog nå')
     A            AVSAVF      0001A
     A                                      COLHDG('Savefile')
     A                                      TEXT('Savefile')
     A            AVSMAP      0001A
     A                                      COLHDG('Save mapper')
     A                                      TEXT('Save mapper')
     A            AVPRO1      0008A
     A                                      COLHDG('Program 1')
     A                                      TEXT('Program 1')
     A            AVBIB1      0010A
     A                                      COLHDG('Bibliotek 1')
     A                                      TEXT('Bibliotek 1')
     A            AVSYS1      0002A
     A                                      COLHDG('System 1')
     A                                      TEXT('System 1')
     A            AVPRO2      0008A
     A                                      COLHDG('Program 1')
     A                                      TEXT('Program 1')
     A            AVBIB2      0010A
     A                                      COLHDG('Bibliotek 1')
     A                                      TEXT('Bibliotek 1')
     A            AVSYS2      0002A
     A                                      COLHDG('System 1')
     A                                      TEXT('System 1')
     A            AVSBS1      0010A
     A                                      COLHDG('Subsystem 1')
     A                                      TEXT('Subsystem 1')
     A            AVSBS2      0010A
     A                                      COLHDG('Subsystem 2')
     A                                      TEXT('Subsystem 2')
     A            AVSBS3      0010A
     A                                      COLHDG('Subsystem 3')
     A                                      TEXT('Subsystem 3')
     A            AVSBS4      0010A
     A                                      COLHDG('Subsystem 4')
     A                                      TEXT('Subsystem 4')
     A            AVSBS5      0010A
     A                                      COLHDG('Subsystem 5')
     A                                      TEXT('Subsystem 5')
     A            AVSBS6      0010A
     A                                      COLHDG('Subsystem 6')
     A                                      TEXT('Subsystem 6')
     A            AVSBS7      0010A
     A                                      COLHDG('Subsystem 7')
     A                                      TEXT('Subsystem 7')
     A            AVSBS8      0010A
     A                                      COLHDG('Subsystem 8')
     A                                      TEXT('Subsystem 8')
     A            AVSBS9      0010A
     A                                      COLHDG('Subsystem 9')
     A                                      TEXT('Subsystem 9')
     A            AVSBS0      0010A
     A                                      COLHDG('Subsystem 10')
     A                                      TEXT('Subsystem 10')
     A            AVLIB1      0010A
     A                                      COLHDG('Library 1')
     A                                      TEXT('Library 1')
     A            AVLIB2      0010A
     A                                      COLHDG('Library 2')
     A                                      TEXT('Library 2')
     A            AVLIB3      0010A
     A                                      COLHDG('Library 3')
     A                                      TEXT('Library 3')
     A            AVLIB4      0010A
     A                                      COLHDG('Library 4')
     A                                      TEXT('Library 4')
     A            AVLIB5      0010A
     A                                      COLHDG('Library 5')
     A                                      TEXT('Library 5')
     A            AVLIB6      0010A
     A                                      COLHDG('Library 6')
     A                                      TEXT('Library 6')
     A            AVLIB7      0010A
     A                                      COLHDG('Library 7')
     A                                      TEXT('Library 7')
     A            AVLIB8      0010A
     A                                      COLHDG('Library 8')
     A                                      TEXT('Library 8')
     A            AVLIB9      0010A
     A                                      COLHDG('Library 9')
     A                                      TEXT('Library 9')
     A            AVLIB0      0010A
     A                                      COLHDG('Library 10')
     A                                      TEXT('Library 10')
6.20  *
6.20  * Validering av felter                (AVA)
6.20  *
6.20 A            AVAFIR         3S 0       TEXT('Firma')
6.20 A                                      COLHDG('Firma')
6.20 A                                      EDTCDE(Z)
6.20 A            AVAPGM        10          TEXT('Program')
6.20 A                                      COLHDG('Program')
6.20 A            AVAPTX        30          TEXT('Programnavn')
6.20 A                                      COLHDG('Programnavn')
6.20 A            AVAFLT        10          TEXT('Feltnavn')
6.20 A                                      COLHDG('Feltnavn')
6.20 A            AVAFTX        30          TEXT('Feltbeseskrivelse')
6.20 A                                      COLHDG('Feltbeskrivelse')
6.20 A            AVAVAL         1S 0       TEXT('Validering')
6.20 A                                      COLHDG('Validering')
6.20 A                                      EDTCDE(Z)
6.20 A                                      VALUES(0 1)
6.20 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.20 A            AVABES         1S 0       TEXT('Skrivebeskyttet')
6.20 A                                      COLHDG('Skrivebeskyttet')
6.20 A                                      EDTCDE(Z)
6.20 A                                      VALUES(0 1)
6.20 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.20 A            AVAEDA          L         TEXT('Endringsdato')
6.20 A                                      COLHDG('Endr.dat')
6.20 A            AVAETI          T         TEXT('Endringstidspunkt')
6.20 A                                      COLHDG('Endr.tid')
6.20 A            AVAEUS        10A         TEXT('Endret av')
6.20 A                                      COLHDG('Endret av')
6.20 A            AVAODA          L         TEXT('Oppr.dato')
6.20 A                                      COLHDG('Oppr.dat')
      **
      **  Arbeidsstasjoner (W)
      **
     A            AWWSID      0010A
     A                                      COLHDG('Arb.stasjon')
     A                                      TEXT('Arb.stasjon')
     A            AWRUTI      0010A
     A                                      COLHDG('Rutine')
     A                                      TEXT('Rutine')
     A            AWTEXT      0030A
     A                                      COLHDG('Tekst')
     A                                      TEXT('Tekst')
     A            AWOUTQ      0010A
     A                                      COLHDG('Skriver/utkø')
     A                                      TEXT('Skriver/utkø')
     A            AWFORM      0010A
     A                                      COLHDG('Form')
     A                                      TEXT('Formular')
     A            AWAKOP      0003S 0
     A                                      COLHDG('Ant.kopier')
     A                                      TEXT('Antall kopier')
     A                                      EDTCDE(Z)
5.04 A            AWALIN      0003S 0
5.04 A                                      COLHDG('Ant.linjer')
5.04 A                                      TEXT('Antall linjer')
5.04 A                                      EDTCDE(Z)
5.04 A            AWOFLW      0003S 0
5.04 A                                      COLHDG('Linje for overflow')
5.04 A                                      TEXT('Linje for overflow')
5.04 A                                      EDTCDE(Z)
5.04 A            AWSKIN      0002S 0
5.04 A                                      COLHDG('Inn' 'Skuff')
5.04 A                                      TEXT('Inn Skuff')
5.04 A                                      EDTCDE(Z)
5.04 A            AWSKUT      0002S 0
5.04 A                                      COLHDG('Ut' 'Skuff')
5.04 A                                      TEXT('Ut Skuff')
5.04 A                                      EDTCDE(Z)
      *
5.22 A            AWPKVA        10A
5.22 A                                      COLHDG('Print' 'Kvalitet')
5.22 A                                      TEXT('Print-kvalitet')
      *
5.22 A            AWDPLX         7A
5.22 A                                      COLHDG('Duplex')
5.22 A                                      TEXT('Duplex')
      *
5.40 A            AWPRFI      0001S 0
5.40 A                                      COLHDG('Printe firmaoppl.')
5.40 A                                      TEXT('Printe firmaoppl.')
5.40 A                                      EDTCDE(Z)
5.40 A                                      VALUES(0 1 2)
5.40 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
      *
     A            AWEDAT    R               REFFLD(AÅEDAT)
     A            AWETIM    R               REFFLD(AÅETIM)
     A            AWEUSR    R               REFFLD(AÅEUSR)
5.35  **
5.35  **  Moduler (X)
5.35  **
5.35 A            AXMODU      0010A
5.35 A                                      COLHDG('Modul')
5.35 A                                      TEXT('Modul')
5.35 A            AXMTXT      0030A
5.35 A                                      COLHDG('Beskrivelse')
5.35 A                                      TEXT('Beskrivelse')
5.35 A            AXODAT    R               REFFLD(AÅODAT)
5.35 A            AXEDAT    R               REFFLD(AÅEDAT)
5.35 A            AXETIM    R               REFFLD(AÅETIM)
5.35 A            AXEUSR    R               REFFLD(AÅEUSR)
6.13  **
6.13  **  XML-overføringr (XM)
6.13  **
6.13 A            AXMKUN         6S 0
6.13 A                                      TEXT('Kundenr hos ASP')
6.13 A                                      COLHDG('kundenr')
6.13 A            AXMSDA          L         TEXT('Sendt  dato')
6.13 A                                      COLHDG('Sendt' 'dato')
6.13 A            AXMBAN       100A
6.13 A                                      TEXT('Setup (bane)')
6.13 A                                      COLHDG('Setup')
6.16 A            AXMSTT          Z         TEXT('Start Timestamp')
6.16 A                                      COLHDG('Start Timestamp')
6.16 A                                      DFT('0001-01-01-00.00.00.000000')
6.16 A            AXMSLT          Z         TEXT('Slutt Timestamp')
6.16 A                                      COLHDG('Slutt Timestamp')
6.16 A                                      DFT('0001-01-01-00.00.00.000000')
6.16 A            AXMLVR        10A
6.16 A                                      TEXT('Navn på LVR')
6.16 A                                      COLHDG('LVR')
6.16 A            AXMHOS        15A
6.16 A                                      TEXT('Host ')
6.16 A                                      COLHDG('Host')
6.25 A            AXMUSR        50A
6.16 A                                      TEXT('BrukerID')
6.16 A                                      COLHDG('BrukerID')
6.25 A            AXMPSV        20A
6.16 A                                      TEXT('Passord')
6.16 A                                      COLHDG('Passord')
6.16 A            AXMAKT         1S 0
6.16 A                                      TEXT('Aktiv')
6.16 A                                      COLHDG('Aktiv')
6.25 A            AXMVER         1S 0
6.25 A                                      TEXT('Versjon')
6.25 A                                      COLHDG('Versjon')
6.25 A                                      VALUES(0 1 2 3)
6.25 A                                      EDTCDE(Z)
6.25  *                                     0 = ingen
6.25  *                                     1 = 2.6
6.25  *                                     2 = 8.0
6.25  *                                     3 = ledig
6.25 A            AXMFHO       255A         TEXT('FTP Host')
6.25 A                                      COLHDG('FTP' 'Host')
6.25 A            AXMFDI       255A         TEXT('FTP Directory')
6.25 A                                      COLHDG('FTP' 'Dir.')
6.25 A            AXMFGR        10A         TEXT('Filgruppe')
6.25 A                                      COLHDG('Filgruppe')
6.25 A            AXMXFL       200A         TEXT('XML mappe')
6.25 A                                      COLHDG('XML' 'mappe')
6.16 A            AXMSOD          L         TEXT('Sist oppd.dato')
6.16 A                                      COLHDG('Sist oppd.dato')
6.16 A                                      DFT('0001-01-01')
6.13 A            AXMODA    R               REFFLD(AÅODAT)
6.13 A            AXMOTI    R               REFFLD(AÅETIM)
6.13 A            AXMOUS    R               REFFLD(AÅEUSR)
6.13 A            AXMEDA    R               REFFLD(AÅEDAT)
6.13 A            AXMETI    R               REFFLD(AÅETIM)
6.13 A            AXMEUS    R               REFFLD(AÅEUSR)
      **
      **  File for utskrift av DDS-spesifikasjoner
      **
     A            AZF001      0005A
     A                                      COLHDG('Fri/ledig 001')
     A            AZCOL6      0001A
     A                                      COLHDG('Kolonne 6')
     A            AZCOL7      0001A
     A                                      COLHDG('Kolonne 7')
     A            AZF002      0011A
     A                                      COLHDG('Fri/ledig 002')
     A            AZFELT      0006A
     A                                      COLHDG('Felt-label')
     A            AZF003      0006A
     A                                      COLHDG('Fri/ledig 003')
     A            AZFLEN      0004A
     A                                      COLHDG('Felt-lengde')
     A            AZANUM      0001A
     A                                      COLHDG('Alfa/numerisk')
     A            AZF004      0001A
     A                                      COLHDG('Fri/ledig 004')
     A            AZADES      0001A
     A                                      COLHDG('Ant.desimaler')
     A            AZF005      0007A
     A                                      COLHDG('Fri/ledig 005')
     A            AZBESK      0030A
     A                                      COLHDG('Beskrivelse')
     A            AZF006      0020A
     A                                      COLHDG('Fri/ledig 006')
6.10  **
6.10  **  Jobblogging - statusrecord pr jobb
6.10  **
6.10 A            AJSFIR         3S 0       TEXT('Firma')
6.10 A                                      COLHDG('Firma')
6.10 A            AJSNAV        15A         TEXT('Jobbnavn')
6.10 A                                      COLHDG('Jobb' 'navn')
6.10 A            AJSSTA         2S 0       TEXT('Status jobb')
6.10 A                                      COLHDG('Status jobb')
6.10 A            AJSBES        35A         TEXT('Beskrivelse')
6.10 A                                      COLHDG('Beskrivelse')
6.10 A            AJSSKJ          Z         TEXT('Sist startet')
6.10 A                                      COLHDG('Sist startet')
6.10 A            AJSRUN         1S 0       TEXT('Jobben kjøres')
6.10 A                                      COLHDG('Jobben kjøres')
6.10 A            AJSSOK          Z         TEXT('Sist kjørt OK')
6.10 A                                      COLHDG('Sist OK')
6.10 A            AJSEPO        50A         TEXT('E-post adresse')
6.10 A                                      COLHDG('E-post')
6.10 A            AJSSEP         1A         TEXT('Sende epost')
6.10 A                                      COLHDG('Send epost')
6.10 A            AJSUSR        10A         TEXT('Ansvarlig')
6.10 A                                      COLHDG('Ansvarlig')
6.10 A            AJSSME         1A         TEXT('Sende melding')
6.10 A                                      COLHDG('Send msg')
6.10 A            AJSKEY        41A         TEXT('Sist brukte nøkkel')
6.10 A                                      COLHDG('Siste key')
6.10  *
6.10 A            AJSODA    R               REFFLD(AÅODAT)
6.10 A            AJSOTI    R               REFFLD(AÅOTIM)
6.10 A            AJSOUS    R               REFFLD(AÅOUSR)
6.10 A            AJSEDA    R               REFFLD(AÅEDAT)
6.10 A            AJSETI    R               REFFLD(AÅETIM)
6.10 A            AJSEUS    R               REFFLD(AÅEUSR)
6.10  **
6.10  **  Jobblogging - logglinjer
6.10  **
6.10 A            AJTFIR         3S 0       TEXT('Firma')
6.10 A                                      COLHDG('Firma')
6.10 A            AJTJID        41A         TEXT('Jobbidentitet unik')
6.10 A                                      COLHDG('Jobb' 'unik')
6.10 A            AJTLIN         5S 0       TEXT('Linjenummer')
6.10 A                                      COLHDG('L.nr')
6.10 A            AJTSTA         2S 0       TEXT('Linjestatus')
6.10 A                                      COLHDG('L.stat')
6.10 A            AJTTXT       200A         TEXT('Loggtekst')
6.10 A                                      COLHDG('Tekst')
6.10 A            AJTODA    R               REFFLD(AÅODAT)
6.10 A            AJTOTI    R               REFFLD(AÅOTIM)
6.10 A            AJTOUS    R               REFFLD(AÅOUSR)
6.11  **
6.11  **  Workfile for transaksjoner for integrasjoner mellom RPG og Java
6.11  **
6.11 A            ATRFIR         3S 0       TEXT('Firma')
6.11 A                                      COLHDG('Firma')
6.11 A            ATRJID        41A         TEXT('Jobbidentitet unik')
6.11 A                                      COLHDG('Jobb' 'unik')
6.11 A            ATRLIN         6S 0       TEXT('Linjenummer')
6.11 A                                      COLHDG('L.nr')
6.11 A            ATRPGM        10A         TEXT('Programnavn')
6.11 A                                      COLHDG('Pgm.navn')
6.11 A            ATRREC         2A         TEXT('Recordformat')
6.11 A                                      COLHDG('Rec.form')
6.11 A            ATRTXT      1000A         TEXT('Record')
6.11 A                                      COLHDG('Record')
6.11 A            ATRODA    R               REFFLD(AÅODAT)
6.11 A            ATROTI    R               REFFLD(AÅOTIM)
6.11 A            ATROUS    R               REFFLD(AÅOUSR)
7.04  **
7.04  **  Filegrupper pr. server     (AFG)
7.04  **
7.04 A            AFGSRV      0012A
7.04 A                                      COLHDG('Server')
7.04 A                                      TEXT('Server')
7.04 A            AFGFGR      0003A
7.04 A                                      COLHDG('Filegruppe')
7.04 A                                      TEXT('Filegruppe')
7.05 A            AFGKJD      0003A
7.05 A                                      COLHDG('Kjede')
7.05 A                                      TEXT('Kjede')
7.06 A            AFGMIL      0003A
7.06 A                                      COLHDG('Miljø')
7.06 A                                      TEXT('Miljø')
7.04 A            AFGVER      0010A
7.04 A                                      COLHDG('Versjon')
7.04 A                                      TEXT('Versjon')
7.04 A            AFGLEV      0010A
7.04 A                                      COLHDG('Level')
7.04 A                                      TEXT('Level')
7.04 A            AFGAKT         1S 0       TEXT('Aktiv')
7.04 A                                      COLHDG('Aktiv')
7.04 A                                      EDTCDE(Z)
7.04 A                                      VALUES(0 1)
7.04 A            AFGKO1         1S 0       TEXT('Kode1')
7.04 A                                      COLHDG('Kode1')
7.04 A                                      EDTCDE(Z)
7.04 A                                      VALUES(0 1)
7.04 A            AFGKO2         1S 0       TEXT('Kode2')
7.04 A                                      COLHDG('Kode2')
7.04 A                                      EDTCDE(Z)
7.04 A                                      VALUES(0 1)
7.04 A            AFGKO3         1S 0       TEXT('Kode3')
7.04 A                                      COLHDG('Kode3')
7.04 A                                      EDTCDE(Z)
7.04 A                                      VALUES(0 1)
7.04 A            AFGKO4         1S 0       TEXT('Kode4')
7.04 A                                      COLHDG('Kode4')
7.04 A                                      EDTCDE(Z)
7.04 A                                      VALUES(0 1)
7.04 A            AFGKO5         1S 0       TEXT('Kode5')
7.04 A                                      COLHDG('Kode5')
7.04 A                                      EDTCDE(Z)
7.04 A                                      VALUES(0 1)
7.04 A            AFGKOD      0010A
7.04 A                                      COLHDG('Frikode')
7.04 A                                      TEXT('Fri kode')
7.04 A            AFGODA    R               REFFLD(AÅODAT)
7.04 A            AFGEDA    R               REFFLD(AÅEDAT)
7.04 A            AFGETI    R               REFFLD(AÅETIM)
7.04 A            AFGEUS    R               REFFLD(AÅEUSR)
      **
5.60  **  PDF rutiner, parameterfile (AFP)
5.60  **
5.60 A            AFPRUT      0010A
5.60 A                                      COLHDG('Rutine')
5.60 A                                      TEXT('Rutine')
5.60 A            AFPPDF      0001S 0
5.60 A                                      COLHDG('Brukes PDF')
5.60 A                                      TEXT('Brukes PDF')
5.60 A                                      EDTCDE(Z)
5.60 A                                      VALUES(0 1)
5.60 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.12 A            AFPMAI      0001S 0
6.12 A                                      COLHDG('Sende på mail')
6.12 A                                      TEXT('Sendes på mail')
6.12 A                                      EDTCDE(Z)
6.12 A                                      VALUES(0 1)
6.12 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.12 A            AFPARC      0001S 0
6.12 A                                      COLHDG('Arkiveres')
6.12 A                                      TEXT('Arkiveres')
6.12 A                                      EDTCDE(Z)
6.12 A                                      VALUES(0 1)
6.12 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.12 A            AFPPRV      0001S 0
6.12 A                                      COLHDG('Forhåndsvisning')
6.12 A                                      TEXT('Forhåndsvisning')
6.12 A                                      EDTCDE(Z)
6.12 A                                      VALUES(0 1)
6.12 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.12 A            AFPLAN      0001S 0
6.12 A                                      COLHDG('Liggende utskr.')
6.12 A                                      TEXT('Liggende utskr.')
6.12 A                                      EDTCDE(Z)
6.12 A                                      VALUES(0 1)
6.12 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.12 A            AFPEXL      0001S 0
6.12 A                                      COLHDG('Excel')
6.12 A                                      TEXT('Excel')
6.12 A                                      EDTCDE(Z)
6.12 A                                      VALUES(0 1)
6.12 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.12 A            AFPXLM      0075A
6.12 A                                      COLHDG('XML mal')
6.12 A                                      TEXT('XML mal')
6.12 A            AFPJAS      0075A
6.12 A                                      COLHDG('Jasper mal')
6.12 A                                      TEXT('Jasper mal')
6.12 A            AFPLOG      0075A
6.12 A                                      COLHDG('Grafikk path')
6.12 A                                      TEXT('Grafikk path')
5.60 A            AFPODA    R               REFFLD(AÅODAT)
5.60 A            AFPOTI    R               REFFLD(AÅOTIM)
5.60 A            AFPOUS    R               REFFLD(AÅOUSR)
5.60 A            AFPEDA    R               REFFLD(AÅEDAT)
5.60 A            AFPETI    R               REFFLD(AÅETIM)
5.60 A            AFPEUS    R               REFFLD(AÅEUSR)
5.60  **
5.60  **  PDF rutiner tabell (AFT)
5.60  **
5.60 A            AFTRUT      0010A
5.60 A                                      COLHDG('Rutine')
5.60 A                                      TEXT('Rutine')
5.60 A            AFTJAS      0512A
5.60 A                                      COLHDG('Jasper mal')
5.60 A                                      TEXT('Jasper mal')
5.60 A            AFTXML      0512A
5.60 A                                      COLHDG('XML template')
5.60 A                                      TEXT('XML template')
5.60 A            AFTODA    R               REFFLD(AÅODAT)
5.60 A            AFTOTI    R               REFFLD(AÅOTIM)
5.60 A            AFTOUS    R               REFFLD(AÅOUSR)
5.60 A            AFTEDA    R               REFFLD(AÅEDAT)
5.60 A            AFTETI    R               REFFLD(AÅETIM)
5.60 A            AFTEUS    R               REFFLD(AÅEUSR)
5.61  **
5.61  **  Gyldige PDF skrivere (AFS)
5.61  **
5.61 A            AFSFIL      0003A
5.61 A                                      COLHDG('Filgruppe')
5.61 A                                      TEXT('Filgruppe')
5.61 A            AFSPRT      0010A
5.61 A                                      COLHDG('PRT navn')
5.61 A                                      TEXT('Skriver navn')
5.61 A            AFSBES      0050A
5.61 A                                      COLHDG('Beskrivelse')
5.61 A                                      TEXT('Beskrivelse')
5.61 A            AFSODA    R               REFFLD(AÅODAT)
5.61 A            AFSOTI    R               REFFLD(AÅOTIM)
5.61 A            AFSOUS    R               REFFLD(AÅOUSR)
5.61 A            AFSEDA    R               REFFLD(AÅEDAT)
5.61 A            AFSETI    R               REFFLD(AÅETIM)
5.61 A            AFSEUS    R               REFFLD(AÅEUSR)
5.62  **
5.62  **  Properties fil for Print og arkiv
5.62  **
5.62 A            AFUFIL      0003A
5.62 A                                      COLHDG('Filgruppe')
5.62 A                                      TEXT('Filgruppe')
5.62 A            AFUIDE      0010A
5.62 A                                      COLHDG('Ident')
5.62 A                                      TEXT('Identifikasjon')
6.31 A            AFUDSS      0200A
5.62 A                                      COLHDG('Beskrivelse')
5.62 A                                      TEXT('Beskrivelse')
5.62 A            AFUODA    R               REFFLD(AÅODAT)
5.62 A            AFUOTI    R               REFFLD(AÅOTIM)
5.62 A            AFUOUS    R               REFFLD(AÅOUSR)
5.62 A            AFUEDA    R               REFFLD(AÅEDAT)
5.62 A            AFUETI    R               REFFLD(AÅETIM)
5.62 A            AFUEUS    R               REFFLD(AÅEUSR)
5.63  **
5.63  **  PDF rutiner, parameterfile avvik (AFA)
5.63  **
5.63 A            AFARUT      0010A
5.63 A                                      COLHDG('Rutine')
5.63 A                                      TEXT('Rutine')
5.63 A            AFAFIR      0003S 0
5.63 A                                      COLHDG('Firma')
5.63 A                                      TEXT('Firma')
5.63 A                                      EDTCDE(Z)
5.63 A            AFAAVD      0004S 0
5.63 A                                      COLHDG('Avdeling')
5.63 A                                      TEXT('Avdeling')
5.60 A            AFAPDF      0001S 0
5.60 A                                      COLHDG('Brukes PDF')
5.60 A                                      TEXT('Brukes PDF')
5.60 A                                      EDTCDE(Z)
5.60 A                                      VALUES(0 1)
5.60 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.12 A            AFAMAI      0001S 0
6.12 A                                      COLHDG('Sende på mail')
6.12 A                                      TEXT('Sendes på mail')
6.12 A                                      EDTCDE(Z)
6.12 A                                      VALUES(0 1)
6.12 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.12 A            AFAARC      0001S 0
6.12 A                                      COLHDG('Arkiveres')
6.12 A                                      TEXT('Arkiveres')
6.12 A                                      EDTCDE(Z)
6.12 A                                      VALUES(0 1)
6.12 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.12 A            AFAPRV      0001S 0
6.12 A                                      COLHDG('Forhåndsvisning')
6.12 A                                      TEXT('Forhåndsvisning')
6.12 A                                      EDTCDE(Z)
6.12 A                                      VALUES(0 1)
6.12 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.12 A            AFALAN      0001S 0
6.12 A                                      COLHDG('Liggende utskr.')
6.12 A                                      TEXT('Liggende utskr.')
6.12 A                                      EDTCDE(Z)
6.12 A                                      VALUES(0 1)
6.12 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.12 A            AFAEXL      0001S 0
6.12 A                                      COLHDG('Excel')
6.12 A                                      TEXT('Excel')
6.12 A                                      EDTCDE(Z)
6.12 A                                      VALUES(0 1)
6.12 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.12 A            AFAXLM      0075A
6.12 A                                      COLHDG('XML mal')
6.12 A                                      TEXT('XML mal')
6.12 A            AFAJAS      0075A
6.12 A                                      COLHDG('Jasper mal')
6.12 A                                      TEXT('Jasper mal')
6.12 A            AFALOG      0075A
6.12 A                                      COLHDG('Grafikk path')
6.12 A                                      TEXT('Grafikk path')
5.63 A            AFAODA    R               REFFLD(AÅODAT)
5.63 A            AFAOTI    R               REFFLD(AÅOTIM)
5.63 A            AFAOUS    R               REFFLD(AÅOUSR)
5.63 A            AFAEDA    R               REFFLD(AÅEDAT)
5.63 A            AFAETI    R               REFFLD(AÅETIM)
5.63 A            AFAEUS    R               REFFLD(AÅEUSR)
6.12  **
6.12  **  Egenskaper til gyldige PDF skrivere (AFV)
6.12  **
6.12 A            AFVFIL      0003A
6.12 A                                      COLHDG('Filgruppe')
6.12 A                                      TEXT('Filgruppe')
6.12 A            AFVPRT      0010A
6.12 A                                      COLHDG('PRT navn')
6.12 A                                      TEXT('Skriver navn')
6.12 A            AFVSTD      0010A
6.11 A                                      COLHDG('Standard skuff')
6.12 A                                      TEXT('Std skuff')
6.12 A            AFVGIR      0010A
6.12 A                                      COLHDG('Giro skuff')
6.12 A                                      TEXT('Giro skuff')
6.12 A            AFVODA    R               REFFLD(AÅODAT)
6.12 A            AFVOTI    R               REFFLD(AÅOTIM)
6.12 A            AFVOUS    R               REFFLD(AÅOUSR)
6.12 A            AFVEDA    R               REFFLD(AÅEDAT)
6.12 A            AFVETI    R               REFFLD(AÅETIM)
6.12 A            AFVEUS    R               REFFLD(AÅEUSR)
6.23  **
6.23  **  SUBSYSTEMER SOM SKAL STARTES ETTER IPL   ASBSPF
6.23  **
6.23 A            AYLINJ      0003S 0
6.23 A                                      EDTCDE(Z)
6.23 A                                      COLHDG('LINJE')
6.23 A                                      TEXT('LINJE')
6.23 A            AYSUBS      0010A
6.23 A                                      COLHDG('SUBSYST')
6.23 A                                      TEXT('SUBSYST')
6.23 A            AYBIBL      0010A
6.23 A                                      COLHDG('BIBLIOTEK')
6.23 A                                      TEXT('BIBLIOTEK')
6.23 A            AYTEXT      0030A
6.23 A                                      COLHDG('BESKRIVELSE')
6.23 A                                      TEXT('BESKRIVELSE')
6.23 A            AYODAT    R               REFFLD(AÅEDAT)
6.23 A            AYOTIM    R               REFFLD(AÅETIM)
6.23 A            AYOUSR    R               REFFLD(AÅEUSR)
6.23 A            AYEDAT    R               REFFLD(AÅEDAT)
6.23 A            AYETIM    R               REFFLD(AÅETIM)
6.23 A            AYEUSR    R               REFFLD(AÅEUSR)
6.30  **
6.30  **  Rutineregister email adresser
6.30  **
6.30 A            AEMRUT      0010A
6.30 A                                      COLHDG('Rutine')
6.30 A                                      TEXT('Rutine')
6.30 A            AEMTIL      0075A
6.30 A                                      COLHDG('emailadresse')
6.30 A                                      TEXT('e-mail til')
6.30 A            AEMFRA      0075A
6.30 A                                      COLHDG('emailadresse')
6.30 A                                      TEXT('e-mail fra')
6.30 A            AEMRE1      0075A
6.30 A                                      COLHDG('emailadresse')
6.30 A                                      TEXT('e-mail xxx')
6.30 A            AEMRE2      0075A
6.30 A                                      COLHDG('emailadresse')
6.30 A                                      TEXT('e-mail xxx')
6.30 A            AEMODA    R               REFFLD(AÅODAT)
6.30 A            AEMOTI    R               REFFLD(AÅOTIM)
6.30 A            AEMOUS    R               REFFLD(AÅOUSR)
6.30 A            AEMEDA    R               REFFLD(AÅEDAT)
6.30 A            AEMETI    R               REFFLD(AÅETIM)
6.30 A            AEMEUS    R               REFFLD(AÅEUSR)
7.00  **
7.00  **  Meny pr bruker
7.00  **
7.01 A            AMUUID      0018S 0
7.01 A                                      COLHDG('UID')
7.01 A                                      TEXT('UID')
7.00 A            AMUUSR      0010A
7.00 A                                      COLHDG('Bruker')
7.00 A                                      TEXT('Bruker')
7.00 A            AMUMNU      0010A
7.00 A                                      COLHDG('Hovedmeny')
7.00 A                                      TEXT('Hovedmeny')
7.00  *
7.00 A            AMUODA    R               REFFLD(AÅODAT)
7.00 A            AMUOTI    R               REFFLD(AÅOTIM)
7.00 A            AMUOUS    R               REFFLD(AÅOUSR)
7.00 A            AMUEDA    R               REFFLD(AÅEDAT)
7.00 A            AMUETI    R               REFFLD(AÅETIM)
7.00 A            AMUEUS    R               REFFLD(AÅEUSR)
7.00  **
7.00  **  Menymenypunkter - header
7.00  **
7.01 A            AMHUID      0018S 0
7.01 A                                      COLHDG('UID')
7.01 A                                      TEXT('UID')
7.00 A            AMHMNU      0010A
7.00 A                                      COLHDG('Meny')
7.00 A                                      TEXT('Meny')
7.00 A            AMHSEQ      0003S 0
7.00 A                                      COLHDG('Sekvens')
7.00 A                                      TEXT('Sekvens')
7.00 A            AMHTXT      0050A
7.00 A                                      COLHDG('Menytekst')
7.00 A                                      TEXT('Menytekst')
7.00 A            AMHSEL      0002S 0
7.00 A                                      COLHDG('Sikkerhetsnivå')
7.00 A                                      TEXT('Sikkerhetsnivå')
7.00 A            AMHTYP      0010A
7.00 A                                      COLHDG('Menytype')
7.00 A                                      TEXT('Menytype')
7.00 A            AMHOPT      0020A
7.00 A                                      COLHDG('Menyvalg')
7.00 A                                      TEXT('Menyvalg')
7.00  *
7.00 A            AMHODA    R               REFFLD(AÅODAT)
7.00 A            AMHOTI    R               REFFLD(AÅOTIM)
7.00 A            AMHOUS    R               REFFLD(AÅOUSR)
7.00 A            AMHEDA    R               REFFLD(AÅEDAT)
7.00 A            AMHETI    R               REFFLD(AÅETIM)
7.00 A            AMHEUS    R               REFFLD(AÅEUSR)
7.00  **
7.00  **  Menypunkter - linjer
7.00  **
7.00 A            AMDOPT      0020A
7.00 A                                      COLHDG('Menyvalg')
7.00 A                                      TEXT('Menyvalg')
7.00 A            AMDPGM      0050A
7.00 A                                      COLHDG('Programkall')
7.00 A                                      TEXT('Programkall')
7.00  *
7.00 A            AMDODA    R               REFFLD(AÅODAT)
7.00 A            AMDOTI    R               REFFLD(AÅOTIM)
7.00 A            AMDOUS    R               REFFLD(AÅOUSR)
7.00 A            AMDEDA    R               REFFLD(AÅEDAT)
7.00 A            AMDETI    R               REFFLD(AÅETIM)
7.00 A            AMDEUS    R               REFFLD(AÅEUSR)
7.01  **
7.01  **  NX Kundetilpasninger AKTIST / NXTILPASSNINGER
7.01  **
7.01 A            AKTUID      0018S 0
7.01 A                                      COLHDG('UID')
7.01 A                                      TEXT('UID')
7.01 A            AKTFGP      0003A
7.01 A                                      COLHDG('Filgr')
7.01 A                                      TEXT('Filgruppe')
7.01 A            AKTFIR      0003S 0
7.01 A                                      COLHDG('Firma')
7.01 A                                      TEXT('Firma')
7.01 A            AKTLAG      0002S 0
7.01 A                                      COLHDG('Lager')
7.01 A                                      TEXT('Lager')
7.01 A            AKTNOK      0050A
7.01 A                                      COLHDG('Nøkkel')
7.01 A                                      TEXT('Nøkkel')
7.01 A            AKTVD1      0001A
7.01 A                                      COLHDG('Verdi1')
7.01 A                                      TEXT('Verdi1')
7.01 A            AKTVD2      2048A
7.01 A                                      COLHDG('Verdi2')
7.01 A                                      TEXT('Verdi2')
7.01 A            AKTKJD      0050A
7.01 A                                      COLHDG('Kjede')
7.01 A                                      TEXT('Kjede')
7.01 A            AKTSYS      0050A
7.01 A                                      COLHDG('System')
7.01 A                                      TEXT('System')
7.01 A            AKTMDL      0050A
7.01 A                                      COLHDG('Modul')
7.01 A                                      TEXT('Modul')
7.01 A            AKTETY      0050A
7.01 A                                      COLHDG('EndreType')
7.01 A                                      TEXT('EndreType')
7.01 A            AKTPRS      0050A
7.01 A                                      COLHDG('Pris')
7.01 A                                      TEXT('Pris')
7.01 A            AKTBSK      2000A
7.01 A                                      COLHDG('Beskrivelse')
7.01 A                                      TEXT('Beskrivelse')
7.01 A            AKTODA    R               REFFLD(AÅODAT)
7.01 A            AKTOTI    R               REFFLD(AÅOTIM)
7.01 A            AKTOUS    R               REFFLD(AÅOUSR)
7.01 A            AKTEDA    R               REFFLD(AÅEDAT)
7.01 A            AKTETI    R               REFFLD(AÅETIM)
7.01 A            AKTEUS    R               REFFLD(AÅEUSR)
7.01 A            SYS_START       Z
7.01 A            SYS_END         Z
7.01 A            CREATE_ID       Z
7.02  **
7.02  **  Tilleggsregister for nye felter alle register
7.02  **
7.02 A            XTFIRM    R               REFFLD(AAFFIR)
7.02 A            XTREGI        10A         TEXT('Register')
7.02 A            XTFELT        10A         TEXT('Felt')
7.02 A            XTXKEY       100A         TEXT('Nøkkel')
7.02 A            XTALFA       100A         TEXT('Alfa felt')
7.02 A            XTNUMM        15S 3       TEXT('Numerisk felt')
7.02 A            XTDATO          L         TEXT('Dato felt')
7.03 A**
7.03 A**  Rutiner    FRF (Rutine-register)
7.03 A**
7.03 A            IADFRM         3A
7.03 A                                      COLHDG('FIRMA')
7.03 A                                      TEXT('Firma')
7.03 A            IADRUT        10A
7.03 A                                      COLHDG('Rutine')
7.03 A                                      TEXT('Rutine')
7.03 A            IADRTY      0005A
7.03 A                                      COLHDG('Prog' 'Felt')
7.03 A                                      TEXT('Prog/Felt')
7.03 A            IADRTX      0050A
7.03 A                                      COLHDG('Rutine' 'Tekst')
7.03 A                                      TEXT('Rutine Beskrivelse')
7.03 A**
7.03 A**  Tilgang    FRF (Tilgangs-register)
7.03 A**
7.03 A            IADTFR         3A
7.03 A                                      COLHDG('FIRMA')
7.03 A                                      TEXT('Firma')
7.03 A            IADTKO        10A
7.03 A                                      COLHDG('Tilg.Kode')
7.03 A                                      TEXT('Tilg.Kode')
7.03 A            IADTRU        10A
7.03 A                                      COLHDG('Rutine')
7.03 A                                      TEXT('Rutine')
7.03 A            IADTXT        40A
7.03 A                                      COLHDG('BESKRIVELSE')
7.03 A                                      TEXT('BESKRIVELSE')
7.03 A            IADTSP         2A
7.03 A                                      COLHDG('Tilg.' 'Rutine')
7.03 A                                      TEXT('Tilgang Rutine')
7.03 A            IADTV1         3A
7.03 A                                      COLHDG('Sperre Valg1')
7.03 A                                      TEXT('Sperre Valg1')
7.03 A            IADTV2         3A
7.03 A                                      COLHDG('Sperre Valg2')
7.03 A                                      TEXT('Sperre Valg2')
7.03 A            IADTV3         3A
7.03 A                                      COLHDG('Sperre Valg3')
7.03 A                                      TEXT('Sperre Valg3')
7.03 A            IADTV4         3A
7.03 A                                      COLHDG('Sperre Valg4')
7.03 A                                      TEXT('Sperre Valg4')
7.03 A            IADTV5         3A
7.03 A                                      COLHDG('Sperre Valg5')
7.03 A                                      TEXT('Sperre Valg5')
7.03 A            IADTV6         3A
7.03 A                                      COLHDG('Sperre Valg6')
7.03 A                                      TEXT('Sperre Valg6')
7.03 A            IADTV7         3A
7.03 A                                      COLHDG('Sperre Valg7')
7.03 A                                      TEXT('Sperre Valg7')
7.03 A            IADTV8         3A
7.03 A                                      COLHDG('Sperre Valg8')
7.03 A                                      TEXT('Sperre Valg8')
7.03 A            IADTV9         3A
7.03 A                                      COLHDG('Sperre Valg9')
7.03 A                                      TEXT('Sperre Valg9')
7.03 A            IADVA1         1A
7.03 A                                      COLHDG('Åpne1')
7.03 A                                      TEXT('Åpne1')
7.03 A            IADVA2         1A
7.03 A                                      COLHDG('Åpne2')
7.03 A                                      TEXT('Åpne2')
7.03 A            IADVA3         1A
7.03 A                                      COLHDG('Åpne3')
7.03 A                                      TEXT('Åpne3')
7.03 A            IADVA4         1A
7.03 A                                      COLHDG('Åpne4')
7.03 A                                      TEXT('Åpne4')
7.03 A            IADVA5         1A
7.03 A                                      COLHDG('Åpne5')
7.03 A                                      TEXT('Åpne5')
7.03 A            IADVA6         1A
7.03 A                                      COLHDG('Åpne6')
7.03 A                                      TEXT('Åpne6')
7.03 A            IADVA7         1A
7.03 A                                      COLHDG('Åpne7')
7.03 A                                      TEXT('Åpne7')
7.03 A            IADVA8         1A
7.03 A                                      COLHDG('Åpne8')
7.03 A                                      TEXT('Åpne8')
7.03 A            IADVA9         1A
7.03 A                                      COLHDG('Åpne9')
7.03 A                                      TEXT('Åpne9')
7.03 A            IADTF1         3A
7.03 A                                      COLHDG('Sperre F1')
7.03 A                                      TEXT('Sperre F1')
7.03 A            IADTF2         3A
7.03 A                                      COLHDG('Sperre F2')
7.03 A                                      TEXT('Sperre F2')
7.03 A            IADTF3         3A
7.03 A                                      COLHDG('Sperre F3')
7.03 A                                      TEXT('Sperre F3')
7.03 A            IADTF4         3A
7.03 A                                      COLHDG('Sperre F4')
7.03 A                                      TEXT('Sperre F4')
7.03 A            IADTF5         3A
7.03 A                                      COLHDG('Sperre F5')
7.03 A                                      TEXT('Sperre F5')
7.03 A            IADTF6         3A
7.03 A                                      COLHDG('Sperre F6')
7.03 A                                      TEXT('Sperre F6')
7.03 A            IADTF7         3A
7.03 A                                      COLHDG('Sperre F7')
7.03 A                                      TEXT('Sperre F7')
7.03 A            IADTF8         3A
7.03 A                                      COLHDG('Sperre F8')
7.03 A                                      TEXT('Sperre F8')
7.03 A            IADTF9         3A
7.03 A                                      COLHDG('Sperre F9')
7.03 A                                      TEXT('Sperre F9')
7.03 A            IADFA1         1A
7.03 A                                      COLHDG('Åpne1')
7.03 A                                      TEXT('Åpne1')
7.03 A            IADFA2         1A
7.03 A                                      COLHDG('Åpne2')
7.03 A                                      TEXT('Åpne2')
7.03 A            IADFA3         1A
7.03 A                                      COLHDG('Åpne3')
7.03 A                                      TEXT('Åpne3')
7.03 A            IADFA4         1A
7.03 A                                      COLHDG('Åpne4')
7.03 A                                      TEXT('Åpne4')
7.03 A            IADFA5         1A
7.03 A                                      COLHDG('Åpne5')
7.03 A                                      TEXT('Åpne5')
7.03 A            IADFA6         1A
7.03 A                                      COLHDG('Åpne6')
7.03 A                                      TEXT('Åpne6')
7.03 A            IADFA7         1A
7.03 A                                      COLHDG('Åpne7')
7.03 A                                      TEXT('Åpne7')
7.03 A            IADFA8         1A
7.03 A                                      COLHDG('Åpne8')
7.03 A                                      TEXT('Åpne8')
7.03 A            IADFA9         1A
7.03 A                                      COLHDG('Åpne9')
7.03 A                                      TEXT('Åpne9')
