      *
      * LOGG FOR FTP OVERFØRING, HODE
      *
     A          R AFTHPFR
     A                                      PFILE(*LIBL/AFTHPF)
      *
      * Nøkkel
      *
     A          K ADHFIR
     A          K ADHNAV
     A          K ADHUID                    DESCEND
