      *
      * LOGG FOR FTP OVERFØRING, LINJE
      *
     A          R AFTLPFR
     A                                      PFILE(*LIBL/AFTLPF)
      *
      * Nøkkel
      *
     A          K ADLFIR
     A          K ADLNAV
     A          K ADLUID
     A          K ADLLIN
