      *
      * FTP Overføringsjobber    Index=Read
      *
     A          R AFTPPFR
     A                                      PFILE(*LIBL/AFTPPF)
      *
      * Nøkkel
      *
     A          K AFFIRM
     A          K AFHOST
     A          K AFNAVN
