      *
      * FTP Overføringer
      *
     A                                      REF(*LIBL/AFRF)
     A          R AFTPPFR
     A            AFFIRM    R
     A            AFNAVN    R
     A            AFHOST    R
     A            AFUSER    R
     A            AFPRXU    R
     A            AFPASS    R
     A            AFLOCD    R
     A            AFCHDR    R
     A            AFFILN    R
     A            AFFILT    R
     A            AFTYPE    R
     A            AFBESK    R
     A            AFKONI    R
     A            AFKOIL    R
     A            AFKONO    R
     A            AFKOOL    R
     A            AFJSCD    R
     A            AFCUSR    R
     A            AFFILS    R
     A            AFSLET    R
     A            AFBINA    R
     A            AFSTAT    R
     A            AFOKTX    R
     A            AFREPL    R
     A            AFBKUP    R
     A            AFQYPS    R
     A            AFRENA    R
     A            AFXCM1    R
     A            AFXCM2    R
     A            AFXCM3    R
     A            AFSPAS    R
     A            AFNENA    R
     A            AFTELL    R
     A            AFTLEN    R
     A            AFTVAL    R
     A            AFLIBT    R
     A            AFRUNF    R
     A            AFKDAT    R
     A            AFKTID    R
     A            AFZIPL    R
