      *
      * FTP Overføringsjobber    Index=Update
      *
     A          R AFTPPFR
     A                                      PFILE(*LIBL/AFTPPF)
      *
      * Nøkkel
      *
     A          K AFFIRM
     A          K AFNAVN
