      *
6.10  * Jobblogging - Statusrecord pr jobb
      *
     A                                      REF(*LIBL/AFRF)
     A          R AJLSPFR
     A            AJSFIR    R
     A            AJSNAV    R
     A            AJSSTA    R
     A            AJSBES    R
     A            AJSSKJ    R
     A            AJSRUN    R
     A            AJSSOK    R
     A            AJSEPO    R
     A            AJSSEP    R
     A            AJSUSR    R
     A            AJSSME    R
     A            AJSKEY    R
     A            AJSODA    R
     A            AJSOTI    R
     A            AJSOUS    R
     A            AJSEDA    R
     A            AJSETI    R
     A            AJSEUS    R
      *
