      *
6.10  * Jobblogging - loggtransaksjoner
      *
     A                                      REF(*LIBL/AFRF)
     A          R AJLTPFR
     A            AJTFIR    R
     A            AJTJID    R
     A            AJTLIN    R
     A            AJTSTA    R
     A            AJTTXT    R
     A            AJTODA    R
     A            AJTOTI    R
     A            AJTOUS    R
