      *
6.10  * WORKFILE - TRANSAKSJONER INTEGRASJONSFILE
      *
     A                                      REF(*LIBL/AFRF)
     A          R AJTRPFR
     A            ATRFIR    R
     A            ATRJID    R
     A            ATRLIN    R
     A            ATRPGM    R
     A            ATRREC    R
     A            ATRTXT    R
     A            ATRODA    R
     A            ATROTI    R
     A            ATROUS    R
