      *
      * TRANSAKSJONFILE JAVA INTEGRASJONER
      *
     A          R AJTRPFR
     A                                      PFILE(*LIBL/AJTRPF)
      *
      * Nøkkel
      *
     A          K ATRFIR
     A          K ATRJID
     A          K ATRLIN
