      *
      * Kidd-referanse-fil
      *
     A          R AKIDPFR
     A                                      PFILE(*LIBL/AKIDPF)
      *
      * Nøkkel
      *
     A          K AKFIRM
     A          K AKKIDR
