      *
      * Kidd-referanse-fil
      *
     A                                      REF(*LIBL/AFRF)
     A          R AKIDPFR
     A            AKFIRM    R
     A            AKKIDR    R
     A            AKKSIF    R
     A            AKKIDD    R
     A            AKKID2    R
     A            AKAARR    R
     A            AKEDAT    R
     A            AKETIM    R
     A            AKEUSR    R
