      *
      * KOBLING MELLOM BILAGSKODE OG OPPSLAG I ARKIV
      *
     A          R AKOBPFR
     A            ABFIRM         3S 0
     A            ABBILK         2S 0       TEXT('Bilagskode')
     A            ABYEAR         1A         TEXT('Årstall foran')
     A            ABDTYP        50A         TEXT('Dokumenttype')
     A            ABODAT          L         TEXT('Opprettet dato')
     A            ABOTIM          T         TEXT('Opprettettidspunkt')
     A            ABOUSR        10A
     A            ABEDAT          L         TEXT('Endringsdato')
     A            ABETIM          T         TEXT('Endringstidspunkt')
     A            ABEUSR        10A
      *
