      *
      * KOBLING BILAGSKODE - ARKIVOPPSLAG
      *
     A          R AKOBPFR                   PFILE(*LIBL/AKOBPF)
      *
     A          K ABFIRM
     A          K ABBILK
