      *
      * Avdelings-register
      *
     A                                      REF(*LIBL/AFRF)
     A          R AMSRPFR
     A            AMMFIR    R
     A            AMMSVR    R
     A            AMODAT    R
     A            AMEUSR    R
     A            AMEDAT    R
     A            AMETIM    R
