      *
      * Notat-register            Index=Read
      *
     A          R ANOTPFR
     A                                      PFILE(*LIBL/ANOTPF)
      *
     A          K AUFIRM
     A          K AUSYST
     A          K AUNOID
     A          K AULINE
