      *
      * Nummer-serier
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/AFRF)
     A          R ANUMPFR
     A            ANFIRM    R
     A            ANFELL    R
     A            ANTYPE    R
     A            ANFAST    R
     A            ANTXT1    R
     A            ANTXT2    R
     A            ANWRAP    R
     A            ANÅRNU    R
     A            ANAUTO    R
6.NU A            ANLENG    R
     A            ANNFOM    R
     A            ANNTOM    R
     A            ANSIST    R
