      *
      * Nummer-serier
      *
     A          R ANUMPFR                   PFILE(ANUMPF)
      *
      * Nøkkel
      *
     A          K ANFIRM
     A          K ANFELL
     A          K ANNFOM
