      *
      *  SIKKERHETS-GRUPPE-REGISTER
      *
     A                                      REF(*LIBL/AFRF)
     A          R ASGRPFR
     A            ATSGRN    R
     A            ATSGRS    R
     A            ATSGRU    R
     A            ATSGRT    R
