      *
      *  Sikkerhets-gruppe-register
      *
     A          R ASGRPFR                   PFILE(ASGRPF)
      *
      * Nøkkel
      *
     A          K ATSGRU
     A          K ATSGRN
