      *
      * Parameterfil fra SES Jeegy - ean nummer for etikett data
      *
     A          R AUTPPFR
     A            AUTHPF       512A
     A                                      COLHDG('SES Jeegy')
