      *
      * Parameterfil fra SES Jeegy - ean nummer for etikett data
      *
     A          R AUTPPFR
     A            XMLLIN      1024A         TEXT('XML-linje')
     A                                      COLHDG('XML-linje')
