      *
      * Validering av felter i program
      *
     A                                      REF(*LIBL/AFRF)
     A          R AVALPFR
     A            AVAFIR    R
     A            AVAPGM    R
     A            AVAPTX    R
     A            AVAFLT    R
     A            AVAFTX    R
     A            AVAVAL    R
     A            AVABES    R
     A            AVAEDA    R
     A            AVAETI    R
     A            AVAEUS    R
     A            AVAODA    R
