      *
      * Skjermer
      *
     A                                      REF(*LIBL/AFRF)
     A          R AWSDPFR
     A            AWWSID    R
     A            AWRUTI    R
     A            AWTEXT    R
     A            AWOUTQ    R
     A            AWFORM    R
     A            AWAKOP    R
     A            AWSKIN    R
     A            AWSKUT    R
     A            AWPKVA    R
     A            AWDPLX    R
     A            AWPRFI    R
      *
     A            AWEDAT    R
     A            AWETIM    R
     A            AWEUSR    R
