      *
      * Skjermer
      *
     A          R AWSDPFR                   PFILE(AWSDPF)
      *
      * Nøkkel
      *
     A          K AWWSID
     A          K AWRUTI
