      *
      *  Butikk-budsjett-register Index=Read
      *
     A          R BBUDPFR
     A                                      PFILE(*LIBL/BBUDPF)
      *
     A          K BUFIRM
     A          K BUAARR
     A          K BUMMND
