      *
      *  Butikk-budsjett-register Seleksjon:Periode=01
      *
     A          R BBUDPFR
     A                                      PFILE(*LIBL/BBUDPF)
      *
     A          K BUFIRM
     A          K BUAARR
     A          K BUMMND
      *
     A          S BUMMND                    COMP(EQ 01)
