      *
      *  Butikk-budsjett-register
      *
     A                                      REF(*LIBL/BFRF)
     A          R BBUDPFR
     A            BUFIRM    R
     A            BUAARR    R
     A            BUMMND    R
     A            BUTEXT    R
     A            BUVDAG    R
     A            BUKRON    R
     A            BUSALG    R
     A            BUKOST    R
