      *
      *  Butikk Dagsoppgjør    Parameter
      *
     A                                      REF(*LIBL/BFRF)
     A          R BDOPPFR
     A            BOPFIR         3S 0
     A            BOPSGR         6A
     A            BOPREC       256A
     A            BOPODA          L
     A            BOPOTI          T
     A            BOPOUS        10A
     A            BOPEDA          L
     A            BOPETI          T
     A            BOPEUS        10A
