     A          R BFRFR
      *
      *         DetteErEnFrf    (NB!!  Denne må ikke fjernes)
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
5.32  *       161204 ASK  Lagt inn mva. grunnlag i overføringsfil
      *       190405 HKO  Lagt inn ButikkHodeTekst
5.41  *       240805 AMD  Distrikt utvidet fra 2.0 til 4.0
6.10  * R6.10 080609 BSA  Oppdatert filer med sporingsinformajon. Opprettet
6.10  *                   dato, kl.slett og bruker. Endret dato, kl.slett og
6.10  *                   bruker.
6.11  * R6.11 280110 BOF  Utvidet BOVREF og BODREF
6.12  * R6.12 010210 AMD  Nye databasefelter i V6.10
6.20  * R6.20 031210 NHO  Prosjekt skal nå være alfa
6.21  * R6.20 100211 BSA  Kortregister
6.NU  * R6.30 210514 BSA  Utvidelse av nummerfelter
6.31  * R6.30 030914 ASK  Ny regnskapsoppdatering
6.32  * R6.30 120515 BKV  Lagt inn BÅLVAR
6.33  * R6.30 210619 Bsa  Nytt register for KID betaling med kort
7.00  * K00   150720 ask  Utvidet BOVFPF med timestamp for logging
      *
      *
      * -------------------------------------------------------------------
      *
      * Koder benyttet i Butikk
      *
      *           BÅ  = Diverse koder
      *
      *           BAA = Butikk-kode-register
      *           BD  = Bong-linje-register
      *           BO  = Bong-hode-register
      *           BU  = Butikk-budsjett-register
      *           BSO = Butikk-plukk-S-register
6.21  *           BR  = Kort transaksjonsregister
      *
      *           BF  = Overføringsfile økonomi
      *
      * PC-kasse:
      *
      *           BB  = ButikkBruker
      *           BK  = ButikkKasse
      *           BG  = ButikkGavekort
      *           BGK = ButikkGavekortKjøp
      *           BH  = ButikkHode
      *           BHT = ButikkHodeTekst
      *           BI  = ButikkLinje
      *           BS  = ButikkLinjeSlettet
      *           BT  = BongTekst
      *
      * iSeries-kasse:
      *
      *           BM  = Butikk-linje-register
      *           BN  = Butikk-hode-register
      *           BW  = Butikk-kasse-register
      *
      * Referansefelter                     (BÅ)
      *
     A            BÅVALG         1S 0       TEXT('Valg')
     A                                      COLHDG('Valg')
     A                                      EDTCDE(Z)
      *
     A            BÅVALA         1A         TEXT('VALG')
     A                                      COLHDG('Valg')
      *
     A            BÅNYEN        11A         TEXT('Ny/Endr')
     A                                      COLHDG('Ny/Endr')
      *
     A            BÅFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
      *
     A            BÅKASS         3A         TEXT('Kasse')
     A                                      COLHDG('Kasse')
      *
     A            BÅBONG        12A         TEXT('Bongnr')
     A                                      COLHDG('Bongnr')
      *
     A            BÅLINE         4S 0       TEXT('Linjenr')
     A                                      COLHDG('Linjenr')
     A                                      EDTCDE(Z)
      *
     A            BÅLTYP         2A         TEXT('Linje-type')
     A                                      COLHDG('Linje' 'type')
      *
     A            BÅOTYP         2A         TEXT('Ordretype')
     A                                      COLHDG('Ordre' 'type')
      *
     A            BÅLETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
      *
     A            BÅAARR         4S 0       TEXT('År')
     A                                      COLHDG('År')
     A                                      EDTCDE(Z)
      *
     A            BÅVARE        15A         TEXT('Varenr')
     A                                      COLHDG('Varenr')
      *
     A            BÅTEK1        35A         TEXT('Varetekst 1')
     A                                      COLHDG('Varetekst 1')
      *
     A            BÅTEK2        35A         TEXT('Varetekst 2')
     A                                      COLHDG('Varetekst 2')
      *
     A            BÅNOBB         8S 0       TEXT('Nobbnr')
     A                                      COLHDG('Nobbnr')
     A                                      EDTCDE(Z)
      *
     A            BÅMODN         8S 0       TEXT('Modulnr')
     A                                      COLHDG('Modulnr')
     A                                      EDTCDE(Z)
      *
     A            BÅENHE         3A         TEXT('Enhet')
     A                                      COLHDG('Enhet')
      *
     A            BÅANTA        11S 3       TEXT('Antall')
     A                                      COLHDG('Antall')
     A                                      EDTCDE(M)
      *
     A            BÅKPRI         1A         TEXT('Priskode')
     A                                      COLHDG('Pris' 'kode')
     A                                      VALUES(' ' 'N' 'T' 'F')
     A                                      CHKMSGID(BMD1400 *LIBL/QMFSHOP)
      *
     A            BÅOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogr')
     A                                      EDTCDE(Z)
      *
     A            BÅHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgr')
     A                                      EDTCDE(Z)
      *
     A            BÅUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugr')
     A                                      EDTCDE(Z)
      *
     A            BÅAVDE         4S 0       TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A                                      EDTCDE(Z)
      *
     A            BÅBAER         4S 0       TEXT('Kostnadsbærer')
     A                                      COLHDG('Kost.' 'bærer')
     A                                      EDTCDE(Z)
      *
     A            BÅLAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
      *
     A            BÅSELG         4S 0       TEXT('Selgernr')
     A                                      COLHDG('Sn')
     A                                      EDTCDE(Z)
      *
     A            BÅKAMP         5A         TEXT('Kampanje')
     A                                      COLHDG('Kamp.')
      *
     A            BÅVADM         1S 0       TEXT('VA-kode')
     A                                      COLHDG('VA' 'kode')
     A                                      EDTCDE(Z)
      *
     A            BÅBESK        35A         TEXT('Beskrivelse')
     A                                      COLHDG('Beskrivelse')
      *
     A            BÅRAB1         5S 2       TEXT('Rabatt 1')
     A                                      COLHDG('Rab.1')
     A                                      EDTCDE(M)
      *
     A            BÅRAB2         5S 2       TEXT('Rabatt 2')
     A                                      COLHDG('Rab.2')
     A                                      EDTCDE(M)
      *
     A            BÅBRR1         5S 2       TEXT('Bruksrettrabatt 1')
     A                                      COLHDG('Bruksrett' 'rab.1')
     A                                      EDTCDE(M)
      *
     A            BÅBRR2         5S 2       TEXT('Bruksrettrabatt 2')
     A                                      COLHDG('Bruksrett' 'rab.2')
     A                                      EDTCDE(M)
      *
     A            BÅORAB         5S 2       TEXT('Ordrerabatt')
     A                                      COLHDG('Ordre' 'rab.')
     A                                      EDTCDE(Z)
      *
     A            BÅKUND         6S 0       TEXT('Kundenr')
     A                                      COLHDG('Kunde')
     A                                      EDTCDE(Z)
      *
     A            BÅKPRO         6S 0       TEXT('Kundeprosjektnr')
     A                                      COLHDG('Kunde' 'prosjekt')
     A                                      EDTCDE(Z)
      *
     A            BÅRKAT         3S 0       TEXT('Rabattkategori')
     A                                      COLHDG('Rab.' 'kat.')
     A                                      EDTCDE(Z)
      *
     A            BÅVALU         3A         TEXT('Valuta')
     A                                      COLHDG('Valuta')
      *
     A            BÅKMVA         1A         TEXT('MVA-kode')
     A                                      COLHDG('MVA' 'kode')
      *
     A            BÅALME         4S 0       TEXT('Almenning')
     A                                      COLHDG('Alm.')
     A                                      EDTCDE(Z)
      *
     A            BÅBRTY         1S 0       TEXT('Bruksrett-type')
     A                                      COLHDG('Bruksrett' 'type')
     A                                      EDTCDE(Z)
      *
     A            BÅPRIV         1S 0       TEXT('Privat')
     A                                      COLHDG('Priv.')
     A                                      EDTCDE(Z)
      *
     A            BÅTREF         6S 0       TEXT('Terminal referansenr')
     A                                      COLHDG('Terminal' 'refnr')
     A                                      EDTCDE(Z)
      *
6.NU A            BÅORNR         8S 0       TEXT('Ordrenr')
     A                                      COLHDG('Ordrenr')
     A                                      EDTCDE(Z)
      *
     A            BÅORSU         2S 0       TEXT('Ordre suffix')
     A                                      COLHDG('Ordre' 'suffix')
     A                                      EDTCDE(Z)
      *
     A            BÅORLI         4S 0       TEXT('Ordre linjenr')
     A                                      COLHDG('Ordre' 'linjenr')
     A                                      EDTCDE(Z)
      *
     A            BÅBENR         6S 0       TEXT('Bestillingsnr')
     A                                      COLHDG('Best.' 'nr')
     A                                      EDTCDE(Z)
      *
     A            BÅBESU         2S 0       TEXT('Bestilling suffix')
     A                                      COLHDG('Best.' 'suffix')
     A                                      EDTCDE(Z)
      *
     A            BÅBELI         4S 0       TEXT('Bestilling linjenr')
     A                                      COLHDG('Best.' 'linjenr')
     A                                      EDTCDE(Z)
      *
     A            BÅMELD        50A         TEXT('Meldingsfelt')
     A                                      COLHDG('Meldingsfelt')
      *
     A            BÅSVAR         1A         TEXT('Svar')
     A                                      COLHDG('Svar')
      *
     A            BÅOFFL         1S 0       TEXT('Offline-salg')
     A                                      COLHDG('Offline' 'salg')
     A                                      EDTCDE(Z)
      *
     A            BÅWSID        10A         TEXT('Skjerm/kasse')
     A                                      COLHDG('Skjerm/' 'kasse')
      *
     A            BÅODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
      *
     A            BÅOTIM          T         TEXT('Opprettet tidspunkt')
     A                                      COLHDG('Oppr.' 'tid')
      *
     A            BÅOUSR        10A         TEXT('Opprettet av')
     A                                      COLHDG('Oppr. av')
      *
     A            BÅEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.' 'dato')
      *
     A            BÅETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.' 'tid')
      *
     A            BÅEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
6.32 A            BÅLVAR        20A         TEXT('Lev. varenr')
6.32 A                                      COLHDG('Lev. varenr')
      *
      * ButikkBruker                        (BB)
      *
     A            BBFIRM    R               REFFLD(BÅFIRM)
     A            BBUSER        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
     A            BBVREF        20A         TEXT('Vår referanse')
     A                                      COLHDG('Vår referanse')
     A            BBSELG    R               REFFLD(BÅSELG)
     A            BBKRET         1S 0       TEXT('Rettigheter')
     A                                      COLHDG('Rettig' 'heter')
     A                                      EDTCDE(Z)
      *                                     0=Ikke tilgang
      *                                     1=Bruker
      *                                     2=Bruker endre eget oppsett
      *                                     9=Administrator
     A            BBKOPG         1S 0       TEXT('Kassaoppjør')
     A                                      COLHDG('Kassa' 'oppgjør')
     A                                      EDTCDE(Z)
      *                                     0=Ikke kassaoppgjør
      *                                     1=Kassaoppgjør uten regnskapsoppd.
      *                                     2=Kassaoppgjør med regnskapsoppd.
     A            BBKKPR         1S 0       TEXT('Kostpris')
     A                                      COLHDG('Kostpris')
     A                                      EDTCDE(Z)
      *                                     0=Ikke se kostpris/DG
      *                                     1=Se kostpris/DG
      *                                     2=Endre kostpris/DG
     A            BBKSPR         1S 0       TEXT('Endre salgspris')
     A                                      COLHDG('Endre' 'salgspris')
     A                                      EDTCDE(Z)
     A            BBKRAB         1S 0       TEXT('Endre rabatt')
     A                                      COLHDG('Endre' 'rabatt')
     A                                      EDTCDE(Z)
     A            BBKVTX         1S 0       TEXT('Endre varetekst')
     A                                      COLHDG('Endre' 'varetekst')
     A                                      EDTCDE(Z)
     A            BBKLAG         1S 0       TEXT('Endre lager')
     A                                      COLHDG('Endre' 'lager')
     A                                      EDTCDE(Z)
     A            BBKAVD         1S 0       TEXT('Endre avdeling')
     A                                      COLHDG('Endre' 'avd.')
     A                                      EDTCDE(Z)
     A            BBKKGR         1S 0       TEXT('Overstyre kreditgrense')
     A                                      COLHDG('Overstyre' 'kred.grense')
     A                                      EDTCDE(Z)
     A            BBKKUP         1S 0       TEXT('Vise kundeposter')
     A                                      COLHDG('Vise' 'kundepost.')
     A                                      EDTCDE(Z)
     A            BBKKOP         1S 0       TEXT('Vise kostpris')
     A                                      COLHDG('Vise' 'kostpris')
     A                                      EDTCDE(Z)
      *                                     0=Nei
      *                                     1=Ja
      *                                     2=Standard (fra ButikkKasse)
     A            BBKVAD         1S 0       TEXT('Vise varedetaljer')
     A                                      COLHDG('Vise' 'varedetaljer')
     A                                      EDTCDE(Z)
      *                                     0=Nei
      *                                     1=Ja
      *                                     2=Standard (fra ButikkKasse)
     A            BBKTAS         1S 0       TEXT('Vise tastatur')
     A                                      COLHDG('Vise' 'tastatur')
     A                                      EDTCDE(Z)
      *                                     0=Nei
      *                                     1=Ja
      *                                     2=Standard (fra ButikkKasse)
     A            BBKCAN         1S 0       TEXT('Cursor antall')
     A                                      COLHDG('Cursor' 'antall')
     A                                      EDTCDE(Z)
      *                                     0=Nei
      *                                     1=Ja
      *                                     2=Standard (fra ButikkKasse)
     A            BBKBSE         1S 0       TEXT('Beholde selger')
     A                                      COLHDG('Beholde' 'selger')
     A                                      EDTCDE(Z)
      *                                     0=Nei
      *                                     1=Ja
      *                                     2=Standard (fra ButikkKasse)
     A            BBODAT    R               REFFLD(BÅODAT)
6.10 A            BBOTIM    R               REFFLD(BÅOTIM)
6.10 A            BBOUSR    R               REFFLD(BÅOUSR)
     A            BBEDAT    R               REFFLD(BÅEDAT)
     A            BBETIM    R               REFFLD(BÅETIM)
     A            BBEUSR    R               REFFLD(BÅEUSR)
      *
      * ButikkGavekort                      (BG)
      *
     A            BGFIRM    R               REFFLD(BÅFIRM)
     A            BGGAVE        12A         TEXT('Gavekortnr')
     A                                      COLHDG('Gavekortnr')
     A            BGKUND    R               REFFLD(BÅKUND)
     A            BGNAVN        35A         TEXT('Navn')
     A                                      COLHDG('Navn')
     A            BGOBEL         7S 0       TEXT('Opprinnelig beløp')
     A                                      COLHDG('Oppr.' 'beløp')
     A                                      EDTCDE(M)
     A            BGGBEL         9S 2       TEXT('Gjenstående beløp')
     A                                      COLHDG('Gjenst.' 'beløp')
     A                                      EDTCDE(M)
     A            BGBONG    R               REFFLD(BÅBONG)
     A            BGODAT    R               REFFLD(BÅODAT)
     A            BGOTIM    R               REFFLD(BÅOTIM)
6.10 A            BGOUSR    R               REFFLD(BÅOUSR)
     A            BGEDAT    R               REFFLD(BÅEDAT)
     A            BGETIM    R               REFFLD(BÅETIM)
     A            BGEUSR    R               REFFLD(BÅEUSR)
      *
      * ButikkGavekortKjøp                  (BGK)
      *
     A            BGKFIR    R               REFFLD(BÅFIRM)
     A            BGKGAV        12A         TEXT('Gavekortnr')
     A                                      COLHDG('Gavekortnr')
     A            BGKBON    R               REFFLD(BÅBONG)
     A            BGKBEL         9S 2       TEXT('Beløp')
     A                                      COLHDG('Beløp')
     A                                      EDTCDE(M)
     A            BGKODA    R               REFFLD(BÅODAT)
     A            BGKOTI    R               REFFLD(BÅOTIM)
     A            BGKOUS    R               REFFLD(BÅOUSR)
6.10 A            BGKEDA    R               REFFLD(BÅEDAT)
6.10 A            BGKETI    R               REFFLD(BÅETIM)
6.10 A            BGKEUS    R               REFFLD(BÅEUSR)
      *
      * ButikkKasse                         (BK)
      *
     A            BKFIRM    R               REFFLD(BÅFIRM)
     A            BKKASS    R               REFFLD(BÅKASS)
     A            BKBESK    R               REFFLD(BÅBESK)
     A            BKPLAS        35A         TEXT('Plassering')
     A                                      COLHDG('Plassering')
     A            BKGRUP         6A         TEXT('Gruppe')
     A                                      COLHDG('Gruppe')
     A            BKAVDE    R               REFFLD(BÅAVDE)
     A            BKBAER    R               REFFLD(BÅBAER)
     A            BKLAGE    R               REFFLD(BÅLAGE)
     A            BKLETY    R               REFFLD(BÅLETY)
     A            BKBTEL         8S 0       TEXT('Bongnr-teller')
     A                                      COLHDG('Bongnr' 'teller')
     A                                      EDTCDE(Z)
     A            BKGTEL         6S 0       TEXT('Gavekort-teller')
     A                                      COLHDG('Gavekort' 'teller')
     A                                      EDTCDE(Z)
     A            BKKFAK         1S 0       TEXT('Faktura')
     A                                      COLHDG('Faktura')
     A                                      EDTCDE(Z)
     A            BKKPAK         1S 0       TEXT('Pakkseddel')
     A                                      COLHDG('Pakkseddel')
     A                                      EDTCDE(Z)
     A            BKKHUO         1S 0       TEXT('Hurtigordre')
     A                                      COLHDG('Hurtig' 'ordre')
     A                                      EDTCDE(Z)
     A            BKKBFA         1S 0       TEXT('Betale faktura')
     A                                      COLHDG('Betale' 'faktura')
     A                                      EDTCDE(Z)
     A            BKKAVT         1S 0       TEXT('Bekrefte spesialavtale')
     A                                      COLHDG('Bekrfte' 'spes.avtale')
     A                                      EDTCDE(Z)
     A            BKKMOT         1S 0       TEXT('Bekrefte mottatt')
     A                                      COLHDG('Bekrefte' 'mottatt')
     A                                      EDTCDE(Z)
     A            BKKKRF         1S 0       TEXT('Krever kundens ref')
     A                                      COLHDG('Krever' 'kundesref')
     A                                      EDTCDE(Z)
     A            BKKTAS         1S 0       TEXT('Vise tastatur')
     A                                      COLHDG('Vise' 'tastatur')
     A                                      EDTCDE(Z)
     A            BKKKOP         1S 0       TEXT('Vise kostpris')
     A                                      COLHDG('Vise' 'kostpris')
     A                                      EDTCDE(Z)
     A            BKKSEL         1S 0       TEXT('Vise selgere')
     A                                      COLHDG('Vise' 'selgere')
     A                                      EDTCDE(Z)
     A            BKKVAD         1S 0       TEXT('Vise varedetaljer')
     A                                      COLHDG('Vise' 'varedetaljer')
     A                                      EDTCDE(Z)
     A            BKKBSE         1S 0       TEXT('Beholde selger')
     A                                      COLHDG('Beholde' 'selger')
     A                                      EDTCDE(Z)
     A            BKKCAN         1S 0       TEXT('Cursor antall')
     A                                      COLHDG('Cursor' 'antall')
     A                                      EDTCDE(Z)
     A            BKKBA4         1S 0       TEXT('A4-bong')
     A                                      COLHDG('A4' 'bong')
     A                                      EDTCDE(Z)
     A            BKKFTB         1S 0       TEXT('Fortrykt blankett')
     A                                      COLHDG('Fortrykt' 'blankett')
     A                                      EDTCDE(Z)
     A            BKANTP         1S 0       TEXT('Antall pakksedler')
     A                                      COLHDG('Ant.' 'pakks.')
     A                                      EDTCDE(Z)
     A            BKTIMO         4S 0       TEXT('Timeout sekunder')
     A                                      COLHDG('Timeout' 'sekunder')
     A                                      EDTCDE(Z)
     A            BKMACA        17A         TEXT('Klients Mac adresse')
     A                                      COLHDG('Mac' 'adresse')
     A            BKODAT    R               REFFLD(BÅODAT)
6.10 A            BKOTIM    R               REFFLD(BÅOTIM)
6.10 A            BKOUSR    R               REFFLD(BÅOUSR)
     A            BKEDAT    R               REFFLD(BÅEDAT)
     A            BKETIM    R               REFFLD(BÅETIM)
     A            BKEUSR    R               REFFLD(BÅEUSR)
      *
      * ButikkHode                          (BH)
      *
     A            BHFIRM    R               REFFLD(BÅFIRM)
     A            BHBONG    R               REFFLD(BÅBONG)
     A            BHKASS    R               REFFLD(BÅKASS)
     A***         BHOTYP    R               REFFLD(BÅOTYP)
     A            BHLETY    R               REFFLD(BÅLETY)
     A            BHAVDE    R               REFFLD(BÅAVDE)
     A            BHLAGE    R               REFFLD(BÅLAGE)
     A            BHSELG    R               REFFLD(BÅSELG)
     A            BHKUND    R               REFFLD(BÅKUND)
     A            BHKPRO    R               REFFLD(BÅKPRO)
     A            BHRKAT    R               REFFLD(BÅRKAT)
     A            BHFKUN         6S 0       TEXT('Fakturakundenr')
     A                                      COLHDG('Faktura' 'kunde')
     A                                      EDTCDE(Z)
     A            BHNAVN        35A         TEXT('Navn')
     A                                      COLHDG('Navn')
     A            BHADR1        35A         TEXT('Adresse 1')
     A                                      COLHDG('Adresse 1')
     A            BHADR2        35A         TEXT('Adresse 2')
     A                                      COLHDG('Adresse 2')
     A            BHPONR        10A         TEXT('Postnr')
     A                                      COLHDG('Postnr')
     A            BHSTED        35A         TEXT('Poststed')
     A                                      COLHDG('Poststed')
     A            BHORRA    R               REFFLD(BÅORAB)
     A            BHORBE         9S 2       TEXT('Ordrerabatt beløp')
     A                                      COLHDG('Ordrerab' 'beløp')
     A                                      EDTCDE(Z)
     A            BHVREF        20A         TEXT('Vår referanse')
     A                                      COLHDG('Vår referanse')
     A            BHDREF        20A         TEXT('Kundens referanse')
     A                                      COLHDG('Kundens referanse')
     A            BHREKV        20A         TEXT('Rekvisisjonsnr')
     A                                      COLHDG('Rekvisisjonsnr')
     A            BHLDAT          L         TEXT('Leveringsdato')
     A                                      COLHDG('Leverings' 'dato')
     A            BHLMAT         2S 0       TEXT('Leveringsmåte')
     A                                      COLHDG('Leverings' 'måte')
     A                                      EDTCDE(Z)
     A            BHLMTX        20A         TEXT('Lev. måte tekst')
     A                                      COLHDG('Lev. måte tekst')
     A            BHIFGB         1S 0       TEXT('Ikke fakturagebyr')
     A                                      COLHDG('Ikke' 'fakt.geb')
     A                                      EDTCDE(Z)
     A***         BHPROJ         6S 0       TEXT('Prosjekt')
     A***                                   COLHDG('Prosj.')
     A***                                   EDTCDE(Z)
     A***         BHAKTI         3A         TEXT('Aktivitet')
     A***                                   COLHDG('Akt')
     A            BHAVRB         2S 2       TEXT('Øreavrunding')
     A                                      COLHDG('Øre' 'avr.')
     A                                      EDTCDE(Z)
     A            BHMOTB        11S 2       TEXT('Motatt beløp')
     A                                      COLHDG('Motatt' 'beløp')
     A                                      EDTCDE(Z)
     A            BHEKSU        11S 2       TEXT('Ekstra uttak')
     A                                      COLHDG('Ekstra' 'uttak')
     A                                      EDTCDE(Z)
     A            BHBKRT        11S 2       TEXT('Betalt kort')
     A                                      COLHDG('Betalt' 'kort')
     A                                      EDTCDE(Z)
     A            BHBKNT        11S 2       TEXT('Betalt kontant')
     A                                      COLHDG('Betalt' 'kontant')
     A                                      EDTCDE(Z)
     A            BHVALU         3A         TEXT('Valuta')
     A                                      COLHDG('Valuta')
     A            BHTAUT        14A         TEXT('Terminal autentifikasjon')
     A                                      COLHDG('Terminal' 'autentifikasjon')
     A            BHTTIM        14A         TEXT('Terminal timestamp')
     A                                      COLHDG('Terminal' 'timestamp')
     A            BHKBA4         1S 0       TEXT('A4-bong')
     A                                      COLHDG('A4-bong')
     A                                      EDTCDE(Z)
     A            BHORNR    R               REFFLD(BÅORNR)
     A            BHOFFL    R               REFFLD(BÅOFFL)
     A            BHBTYP         1S 0       TEXT('Betalingstype')
     A                                      COLHDG('Bet.' 'type')
     A                                      EDTCDE(Z)
      *                                     0=Kontant
      *                                     2=Kreditt/pakkseddel
      *                                     3=Faktura
      *                                     4=Betaling
      *                                     5=Hurtigordre
      *
     A            BHODAT    R               REFFLD(BÅODAT)
     A            BHOTIM    R               REFFLD(BÅOTIM)
6.10 A            BHOUSR    R               REFFLD(BÅOUSR)
     A            BHEDAT    R               REFFLD(BÅEDAT)
     A            BHETIM    R               REFFLD(BÅETIM)
     A            BHEUSR    R               REFFLD(BÅEUSR)
      *
      * ButikkHodeTekst                     (BH)
      *
     A            BHTFIR    R               REFFLD(BÅFIRM)
     A            BHTBON    R               REFFLD(BÅBONG)
     A            BHTLIN         4S 0       TEXT('Linjenr')
     A                                      COLHDG('Linjenr')
     A                                      EDTCDE(Z)
     A            BHTTXT        70A         TEXT('Tekst')
     A                                      COLHDG('Tekst')
      *
      * ButikkLinje                         (BI)
      *
     A            BIFIRM    R               REFFLD(BÅFIRM)
     A            BIBONG    R               REFFLD(BÅBONG)
     A            BIBOLI    R               REFFLD(BÅLINE)
     A            BILETY    R               REFFLD(BÅLETY)
     A            BIVARE    R               REFFLD(BÅVARE)
     A            BITEK1    R               REFFLD(BÅTEK1)
     A            BITEK2    R               REFFLD(BÅTEK2)
     A            BIENHE    R               REFFLD(BÅENHE)
     A            BIANTA    R               REFFLD(BÅANTA)
     A            BIVALU    R               REFFLD(BÅVALU)
     A            BISAPR         9S 2       TEXT('Salgspris')
     A                                      COLHDG('Salgspris')
     A                                      EDTCDE(M)
     A            BISAIM         9S 2       TEXT('Salgspris inkl.mva')
     A                                      COLHDG('Salgspris' 'inkl.mva')
     A                                      EDTCDE(M)
     A            BISAOP         9S 2       TEXT('Salgspris opprinnelig')
     A                                      COLHDG('Salgspris' 'oppr.')
     A                                      EDTCDE(M)
     A            BIRAB1    R               REFFLD(BÅRAB1)
     A            BIRAB2    R               REFFLD(BÅRAB2)
     A            BIBRR1    R               REFFLD(BÅBRR1)
     A            BIBRR2    R               REFFLD(BÅBRR2)
     A            BIORAB    R               REFFLD(BÅORAB)
     A            BINTPR         9S 2       TEXT('Nettopris')
     A                                      COLHDG('Nettopris')
     A                                      EDTCDE(M)
     A            BINTIM         9S 2       TEXT('Nettopris inkl.mva')
     A                                      COLHDG('Nettopris' 'inkl.mva')
     A                                      EDTCDE(M)
     A            BIKOPR         9S 2       TEXT('Kostpris')
     A                                      COLHDG('Kostpris')
     A                                      EDTCDE(M)
     A            BIKOIM         9S 2       TEXT('Kostpris inkl.mva')
     A                                      COLHDG('Kostpris' 'inkl.mva')
     A                                      EDTCDE(M)
     A            BIKOOP         9S 2       TEXT('Kostpris opprinnelig')
     A                                      COLHDG('Kostpris' 'oppr.')
     A                                      EDTCDE(M)
     A            BIAVDE    R               REFFLD(BÅAVDE)
     A            BILAGE    R               REFFLD(BÅLAGE)
     A            BISELG    R               REFFLD(BÅSELG)
     A            BISERI        20A         TEXT('Serienr')
     A                                      COLHDG('Serienr')
     A            BIKOMM        70A         TEXT('Kommentar')
     A                                      COLHDG('Kommentar')
     A            BINOBB    R               REFFLD(BÅNOBB)
     A            BIMODN    R               REFFLD(BÅMODN)
     A            BIKPRI    R               REFFLD(BÅKPRI)
     A            BIKMVA    R               REFFLD(BÅKMVA)
     A            BIGMVA         5S 2       TEXT('MVA-grunnlag')
     A                                      COLHDG('MVA' 'grunnlag')
     A            BISMVA         5S 2       TEXT('MVA-stats')
     A                                      COLHDG('MVA' 'satats')
     A            BIKAMP    R               REFFLD(BÅKAMP)
     A            BIALME    R               REFFLD(BÅALME)
     A            BIBRTY    R               REFFLD(BÅBRTY)
     A            BIPRIV    R               REFFLD(BÅPRIV)
     A            BIKORD         1S 0       TEXT('Ordrerabatt kode')
     A                                      COLHDG('Ordrerabatt' 'kode')
     A                                      EDTCDE(Z)
     A            BITREF    R               REFFLD(BÅTREF)
     A            BIORNR    R               REFFLD(BÅORNR)
     A            BIORSU    R               REFFLD(BÅORSU)
     A            BIORLI    R               REFFLD(BÅORLI)
     A            BIBENR    R               REFFLD(BÅBENR)
     A            BIBESU    R               REFFLD(BÅBESU)
     A            BIBELI    R               REFFLD(BÅBELI)
     A            BIGAVE        12A         TEXT('Gavekortnr')
     A                                      COLHDG('Gavekort' 'nr.')
     A            BIGKUN         6S 0       TEXT('Gavekort kundenr')
     A                                      COLHDG('Gavekort' 'kundenr')
     A                                      EDTCDE(Z)
     A            BIGNAV        35A         TEXT('Gavekort navn')
     A                                      COLHDG('Gavekort navn')
     A            BISUMS        11S 2       TEXT('Sum salg')
     A                                      COLHDG('Sum salg')
     A            BISSIM        11S 2       TEXT('Sum salg inkl.mva')
     A                                      COLHDG('Sum salg' 'inkl.mva')
     A            BISUMR        11S 2       TEXT('Sum rabatt')
     A                                      COLHDG('Sum rabatt')
     A            BISRIM        11S 2       TEXT('Sum rabatt inkl.mva')
     A                                      COLHDG('Sum rabatt' 'inkl.mva')
     A            BISUMN        11S 2       TEXT('Sum netto')
     A                                      COLHDG('Sum netto')
     A            BISNIM        11S 2       TEXT('Sum netto inkl.mva')
     A                                      COLHDG('Sum netto' 'inkl.mva')
     A            BISUMK        11S 2       TEXT('Sum kost')
     A                                      COLHDG('Sum kost')
     A            BISKIM        11S 2       TEXT('Sum kost inkl.mva')
     A                                      COLHDG('Sum kost' 'inkl.mva')
     A            BIOVSP         1S 0       TEXT('Overstyrt salgspris')
     A                                      COLHDG('Overstyrt' 'salgspris')
     A            BIFSTA         1S 0       TEXT('Fra statistikk')
     A                                      COLHDG('Fra' 'stat.')
     A            BIODAT    R               REFFLD(BÅODAT)
     A            BIOTIM    R               REFFLD(BÅOTIM)
6.10 A            BIOUSR    R               REFFLD(BÅOUSR)
     A            BIEDAT    R               REFFLD(BÅEDAT)
     A            BIETIM    R               REFFLD(BÅETIM)
     A            BIEUSR    R               REFFLD(BÅEUSR)
      *
      * BongTekst                           (BT)
      *
     A            BTFIRM    R               REFFLD(BÅFIRM)
     A            BTBTX1        40A         TEXT('BongTekst1')
     A                                      COLHDG('BongTekst1')
     A            BTBTX2        40A         TEXT('BongTekst2')
     A                                      COLHDG('BongTekst2')
     A            BTBTX3        40A         TEXT('BongTekst3')
     A                                      COLHDG('BongTekst3')
     A            BTBTX4        40A         TEXT('BongTekst4')
     A                                      COLHDG('BongTekst4')
     A            BTBTX5        40A         TEXT('BongTekst5')
     A                                      COLHDG('BongTekst5')
     A            BTODAT    R               REFFLD(BÅODAT)
6.10 A            BTOTIM    R               REFFLD(BÅOTIM)
6.10 A            BTOUSR    R               REFFLD(BÅOUSR)
     A            BTEDAT    R               REFFLD(BÅEDAT)
     A            BTETIM    R               REFFLD(BÅETIM)
     A            BTEUSR    R               REFFLD(BÅEUSR)
      *
      * Bong-linje-register                 (BD)
      *
     A            BDFIRM    R               REFFLD(BÅFIRM)
      *
     A            BDAARR         4S 0       TEXT('År')
     A                                      COLHDG('År')
     A                                      EDTCDE(Z)
      *
     A            BDWSID        10A         TEXT('Skjerm/Kasse')
     A                                      COLHDG('Skjerm/' 'kasse')
      *
     A            BDBONG        12A         TEXT('Bongnummer')
     A                                      COLHDG('Bong-' 'nummer')
      *
     A            BDLINE         4S 0       TEXT('Linjenummer')
     A                                      COLHDG('Linje' 'nummer')
     A                                      EDTCDE(Z)
      *
     A            BDLTYP         2A         TEXT('Linje-type')
     A                                      COLHDG('Linje-' 'type')
      *
     A            BDLETY    R               REFFLD(BÅLETY)
      *
     A            BDVARE    R               REFFLD(BÅVARE)
      *
     A            BDENH1         3A         TEXT('Enhet')
     A                                      COLHDG('Enhet')
      *
     A            BDTEK1    R               REFFLD(BÅTEK1)
      *
     A            BDTEK2    R               REFFLD(BÅTEK2)
      *
     A            BDANTA        11S 3       TEXT('Antall bestilt')
     A                                      COLHDG('Antall' 'bestilt')
     A                                      EDTCDE(M)
      *
     A            BDKPRI         1A         TEXT('Priskode')
     A                                      COLHDG('Pris' 'kode')
     A                                      VALUES(' ' 'N' 'T' 'F')
     A                                      CHKMSGID(BMD1400 *LIBL/QMFSHOP)
      *
     A            BDOPPR         9S 2       TEXT('Opprinnelig pris')
     A                                      COLHDG('Oppr' 'pris')
     A                                      EDTWRD('     0 ,  ')
      *
     A            BDSAPR        10S 3       TEXT('Salgspris')
     A                                      COLHDG('Salgspris')
     A                                      EDTWRD('     0 ,   ')
      *
     A            BDKOPR         9S 2       TEXT('Kost-pris')
     A                                      COLHDG('Kost-pris')
     A                                      EDTWRD('     0 ,  ')
      *
     A            BDSELK         9S 2       TEXT('Selvkost,oppr.')
     A                                      COLHDG('Selvkost,' 'oppr.')
     A                                      EDTWRD('     0 ,  ')
      *
     A            BDRAB1         5S 2       TEXT('Linje-rabatt 1')
     A                                      COLHDG('Linje-rabatt 1')
     A                                      EDTWRD(' 0 ,  ')
     A                                      COMP(LE 100)
     A                                      CHKMSGID(BMD1100 *LIBL/QMFSHOP)
      *
6.31 A            BDRBE1        11S 2       TEXT('Rabatt1 beløp')
6.31 A                                      COLHDG('Rabatt1 beløp')
6.31 A                                      EDTCDE(M)
6.31 A            BDRBI1        11S 2       TEXT('Rabatt1 beløp Ink')
6.31 A                                      COLHDG('Rabatt1 beløp Ink')
6.31 A                                      EDTCDE(M)
      *
     A            BDRAB2         5S 2       TEXT('Linje-rabatt 2')
     A                                      COLHDG('Linje-rabatt 2')
     A                                      EDTWRD(' 0 ,  ')
     A                                      COMP(LE 100)
     A                                      CHKMSGID(BMD1100 *LIBL/QMFSHOP)
      *
6.31 A            BDRBE2        11S 2       TEXT('Rabatt2 beløp')
6.31 A                                      COLHDG('Rabatt2 beløp')
6.31 A                                      EDTCDE(M)
6.31 A            BDRBI2        11S 2       TEXT('Rabatt2 beløp Ink')
6.31 A                                      COLHDG('Rabatt2 beløp Ink')
6.31 A                                      EDTCDE(M)
      *
6.31 A            BDSUMS        12S 3       TEXT('Sum salg')
6.31 A                                      COLHDG('Sum salg')
6.31 A                                      EDTCDE(M)
      *
6.31 A            BDSUMI        12S 3       TEXT('Sum salg inkl')
6.31 A                                      COLHDG('Sum salg inkl')
6.31 A                                      EDTCDE(M)
      *
6.31 A            BDSUMO        12S 3       TEXT('Sum salg oppr')
6.31 A                                      COLHDG('Sum salg oppr')
6.31 A                                      EDTCDE(M)
      *
     A            BDSUMR        11S 2       TEXT('Sum rabatt')
     A                                      COLHDG('Sum rabatt')
     A                                      EDTCDE(M)
      *
     A            BDSUMK        11S 2       TEXT('Sum kost')
     A                                      EDTCDE(M)
     A                                      COLHDG('Sum kost')
      *
6.31 A            BDSUKI        11S 2       TEXT('Sum kost inkl')
6.31 A                                      EDTCDE(M)
6.31 A                                      COLHDG('Sum kost inkl')
      *
6.31 A            BDSUOK        11S 2       TEXT('Sum Opr kost')
6.31 A                                      EDTCDE(M)
6.31 A                                      COLHDG('Sum Opr kost')
      *
     A            BDKAMP    R               REFFLD(BÅKAMP)
     A            BDOGRP    R               REFFLD(BÅOGRP)
     A            BDHGRP    R               REFFLD(BÅHGRP)
     A            BDUGRP    R               REFFLD(BÅUGRP)
      *
     A            BDLVRE         1S 0       TEXT('Lokalt vreg')
     A                                      COLHDG('Lok' 'vreg')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BM00180 *LIBL/QMFSHOP)
     A            BDNOBB         8S 0       TEXT('Nobbnr')
     A                                      COLHDG('Nobbnr')
     A                                      EDTCDE(Z)
     A            BDLDOR         6S 0       TEXT('Leverandørnr')
     A                                      COLHDG('Lev.')
     A                                      EDTCDE(Z)
6.32 A            BDLVAR    R               REFFLD(BÅLVAR)
6.32 A                                      TEXT('Lev. varenr')
     A                                      COLHDG('Lev.varenr')
     A            BDORNR    R               REFFLD(BÅORNR)
     A            BDORSU    R               REFFLD(BÅORSU)
     A            BDORLI    R               REFFLD(BÅORLI)
     A            BDBRR1    R               REFFLD(BÅBRR1)
      *
6.31 A            BDBRB1        11S 2       TEXT('Br.rab1 beløp')
6.31 A                                      COLHDG('Br.rab1 beløp')
6.31 A                                      EDTCDE(M)
6.31 A            BDBIB1        11S 2       TEXT('Br.rab1 beløp Ink')
6.31 A                                      COLHDG('Br.rab1 beløp Ink')
6.31 A                                      EDTCDE(M)
     A            BDBRR2    R               REFFLD(BÅBRR2)
      *
6.31 A            BDBRB2        11S 2       TEXT('Br.rab2 beløp')
6.31 A                                      COLHDG('Br.rab2 beløp')
6.31 A                                      EDTCDE(M)
6.31 A            BDBIB2        11S 2       TEXT('Br.rab2 beløp Ink')
6.31 A                                      COLHDG('Br.rab2 beløp Ink')
6.31 A                                      EDTCDE(M)
     A            BDORAB    R               REFFLD(BÅORAB)
      *
6.31 A            BDORBE        11S 2       TEXT('Ordrerab beløp')
6.31 A                                      COLHDG('Ordrerab beløp')
6.31 A                                      EDTCDE(M)
6.31 A            BDORBI        11S 2       TEXT('Ordrerab beløp Ink')
6.31 A                                      COLHDG('Ordrerab beløp Ink')
6.31 A                                      EDTCDE(M)
     A            BDLAGE    R               REFFLD(BÅLAGE)
     A            BDSERI        20A         TEXT('Serienr')
     A                                      COLHDG('Serienr')
     A            BDKMVA    R               REFFLD(BÅKMVA)
      *
6.31 A            BDGMVA         9S 2       TEXT('Mva Grunnlag')
6.31 A                                      COLHDG('MVA Grunnlag')
6.31 A                                      EDTCDE(M)
6.31  *
6.31 A            BDSMVA         5S 2       TEXT('Mva Sats')
6.31 A                                      COLHDG('MVA Sats')
6.31 A                                      EDTCDE(M)
6.31  *
6.31 A            BDBMVA         9S 2       TEXT('Mva Beløp')
6.31 A                                      COLHDG('MVA Beløp')
6.31 A                                      EDTCDE(M)
6.31  *
6.31 A            BDFMVA         5S 2       TEXT('Mva Gr.lag alm.')
6.31 A                                      COLHDG('Mva Gr.lag alm.')
6.31 A                                      EDTCDE(M)
     A            BDALME    R               REFFLD(BÅALME)
     A            BDBRTY    R               REFFLD(BÅBRTY)
     A            BDPRIV    R               REFFLD(BÅPRIV)
     A            BDGAVE        12A         TEXT('Gavekortnr')
     A                                      COLHDG('Gavekortnr')
     A            BDBENR    R               REFFLD(BÅBENR)
     A            BDBESU    R               REFFLD(BÅBESU)
     A            BDBELI    R               REFFLD(BÅBELI)
     A            BDTREF    R               REFFLD(BÅTREF)
     A            BDSELG         4S 0       TEXT('Selger')
     A                                      COLHDG('Selger')
     A                                      EDTCDE(Z)
      *
     A            BDAVDE    R               REFFLD(BÅAVDE)
     A            BDODAT    R               REFFLD(BÅODAT)
     A            BDOTIM    R               REFFLD(BÅOTIM)
6.10 A            BDOUSR    R               REFFLD(BÅOUSR)
     A            BDEDAT    R               REFFLD(BÅEDAT)
     A            BDETIM    R               REFFLD(BÅETIM)
     A            BDEUSR    R               REFFLD(BÅEUSR)
      *
      * Bong-hode-register                  (BO)
      *
     A            BOFIRM    R               REFFLD(BÅFIRM)
      *
     A            BOAARR         4S 0       TEXT('År')
     A                                      COLHDG('År')
     A                                      EDTCDE(Z)
      *
     A            BOWSID        10A         TEXT('Skjerm/kasse')
     A                                      COLHDG('Skjerm/' 'kasse')
      *
     A            BOBONG        12A         TEXT('Bongnummer')
     A                                      COLHDG('Bong' 'nummer')
      *
     A            BOOTYP         2A         TEXT('Ordretype')
     A                                      COLHDG('Ordre' 'type')
      *
     A            BOLETY    R               REFFLD(BÅLETY)
      *
     A            BOLAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
      *
6.NU A            BOBINR         8S 0       TEXT('Bilagsnummer')
     A                                      COLHDG('Bilags' 'nummer')
     A                                      EDTCDE(Z)
      *
6.NU A            BOKREF         8S 0       TEXT('Kreditt-ref.')
     A                                      COLHDG('Kreditt-' 'ref.')
     A                                      EDTCDE(Z)
      *
     A            BOPERI         6S 0       TEXT('Periode')
     A                                      COLHDG('Periode')
     A                                      EDTCDE(Z)
      *
     A            BOBDAT          L         TEXT('Ordredato')
     A                                      COLHDG('Ordre' 'dato')
      *
     A            BOLDAT          L         TEXT('Leveringsdato')
     A                                      COLHDG('Leverings' 'dato')
      *
     A            BOFKDA          L         TEXT('Fakturadato')
     A                                      COLHDG('Faktura' 'dato')
      *
     A            BOFFDA          L         TEXT('Forfallsdato')
     A                                      COLHDG('Forfalls' 'dato')
      *
     A            BOBETB         2S 0       TEXT('Bet.betingelser')
     A                                      COLHDG('Bet.' 'bet.')
     A                                      EDTCDE(Z)
      *
     A            BOSELG         4S 0       TEXT('Selger')
     A                                      COLHDG('Selger')
     A                                      EDTCDE(Z)
      *
5.41 A            BODIST         4S 0       TEXT('Distrikt')
     A                                      COLHDG('Distrikt')
     A                                      EDTCDE(Z)
      *
     A            BOLMAT         2S 0       TEXT('Leveringsmåte')
     A                                      COLHDG('Lev' 'måte')
     A                                      EDTCDE(Z)
      *
     A            BOLBET         2S 0       TEXT('Leveringsbet.')
     A                                      COLHDG('Lev.' 'bet.')
     A                                      EDTCDE(Z)
      *
     A            BOVALK         3A         TEXT('Valuta')
     A                                      COLHDG('Valuta')
      *
     A            BORKAT         3S 0       TEXT('Rabatt-kategori')
     A                                      COLHDG('Rab.' 'kat.')
     A                                      EDTCDE(Z)
      *
     A            BOSPED         3S 0       TEXT('Speditør')
     A                                      COLHDG('Sped')
     A                                      EDTCDE(Z)
      *
     A            BOKJOR         2S 0       TEXT('Kjørerute')
     A                                      COLHDG('Kjøre' 'rute')
     A                                      EDTCDE(Z)
      *
     A            BOMKOD         1S 0       TEXT('Mva-kode')
     A                                      COLHDG('Mva' 'kode')
     A                                      EDTCDE(Z)
      *
     A            BOKGFA         1S 0       TEXT('Undertr. fakt.geb')
     A                                      COLHDG('Undertr.' 'fakt.geb')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BMO0600 *LIBL/QMFSHOP)
      *
     A            BOLKUN         6S 0       TEXT('Vare-adresse')
     A                                      COLHDG('Vare-' 'adresse')
     A                                      EDTCDE(Z)
      *
     A            BOKUND         6S 0       TEXT('Kundenummer')
     A                                      COLHDG('Kunde' 'nummer')
     A                                      EDTCDE(Z)
      *
     A            BOKUNA        30A         TEXT('Kunde-alfa')
     A                                      COLHDG('Kunde-alfa')
      *
     A            BONAVN        30A         TEXT('Navn')
     A                                      COLHDG('Navn')
      *
     A            BOADR1        30A         TEXT('Adresse 1')
     A                                      COLHDG('Adresse 1')
      *
     A            BOADR2        30A         TEXT('Adresse 2')
     A                                      COLHDG('Adresse 2')
      *
     A            BOSTED        30A         TEXT('Poststed')
     A                                      COLHDG('Poststed')
      *
     A            BOAVDE         4S 0       TEXT('Avd. salg overst')
     A                                      COLHDG('Avd.salg' 'overst')
     A                                      EDTCDE(Z)
      *
     A            BOKONT         6S 0       TEXT('Konto')
     A                                      COLHDG('Konto')
     A                                      EDTCDE(Z)
      *
     A            BOSPES         4S 0       TEXT('Spes')
     A                                      COLHDG('Spes')
     A                                      EDTCDE(Z)
      *
6.20 A**          BOPROJ         6S 0       TEXT('Prosjekt')
6.20 A            BOPROJ         6A         TEXT('Prosjekt')
     A                                      COLHDG('Prosj.')
6.20 A**                                    EDTCDE(Z)
      *
6.20 A*           BOAKTI         3A         TEXT('Aktivitet')
6.20 A            BOAKTI         6A         TEXT('Aktivitet')
     A                                      COLHDG('Akt')
      *
     A            BOVREF        30A         TEXT('Vår ref.')
     A                                      COLHDG('Vår ref.')
      *
     A            BODREF        30A         TEXT('Deres ref.')
     A                                      COLHDG('Deres ref.')
      *
     A            BOREKV        20A         TEXT('Kund.rekv.nr.')
     A                                      COLHDG('Kund.rekv.nr.')
      *
     A            BOLMTX        20A         TEXT('Lev. måte tekst')
     A                                      COLHDG('Lev. måte tekst')
      *
     A            BOLBTX        75A         TEXT('Lev. bet. tekst')
     A                                      COLHDG('Lev. bet. tekst')
      *
     A            BORABP         5S 2       TEXT('Rabatt i %')
     A                                      COLHDG('Rab' 'i %')
     A                                      EDTCDE(M)
     A                                      COMP(LE 100)
     A                                      CHKMSGID(BMO0610 *LIBL/QMFSHOP)
      *
6.31 A            BORABB        11S 2       TEXT('Rabatt i kr')
6.31 A                                      COLHDG('Rabatt i kr')
6.31 A                                      EDTCDE(M)
      *
6.NU A            BOORNR         8S 0       TEXT('Ordrenummer-ofak')
     A                                      COLHDG('Ordrenr' 'ofak')
     A                                      EDTCDE(Z)
      *
     A            BOORSU         2S 0       TEXT('Ordresuffix-ofak')
     A                                      COLHDG('Suffix' 'ofak')
     A                                      EDTCDE(Z)
      *
6.NU A            BOPORD         8S 0       TEXT('Ordrenummer-pris')
     A                                      COLHDG('Ordrenr' 'pris')
     A                                      EDTCDE(Z)
      *
     A            BOPSUF         2S 0       TEXT('Suffix-prisordre')
     A                                      COLHDG('Suff' 'pris')
     A                                      EDTCDE(Z)
      *
6.31 A            BOAVRB         2S 2       TEXT('Øreavrunding')
6.31 A                                      COLHDG('Øreavrunding')
6.31 A                                      EDTCDE(M)
      *
     A            BOMOTT        11S 2       TEXT('Mottatt, beløp')
     A                                      COLHDG('Mottatt, beløp')
     A                                      EDTCDE(M)
      *
     A            BOTOTX        11S 2       TEXT('KR fritt salg')
     A                                      COLHDG('KR fritt salg')
     A                                      EDTCDE(M)
      *
     A            BOTOTB        11S 2       TEXT('Total betalt')
     A                                      COLHDG('Total betalt')
     A                                      EDTCDE(M)
6.31  *
6.31 A            BORESK        11S 2       TEXT('Reskontrotoal')
6.31 A                                      COLHDG('Reskontrototal')
6.31 A                                      EDTCDE(M)
      *
     A            BOTOTS        11S 2       TEXT('Total salg')
     A                                      COLHDG('Total salg')
     A                                      EDTCDE(M)
      *
     A            BOTOTR        11S 2       TEXT('Total rabatt')
     A                                      COLHDG('Total rabatt')
     A                                      EDTCDE(M)
      *
     A            BOTOTK        11S 2       TEXT('Total kost')
     A                                      COLHDG('Total kost')
     A                                      EDTCDE(M)
      *
     A            BOKAVS         1S 0       TEXT('Avstemmingsliste')
     A                                      COLHDG('Avst.' 'liste')
     A                                      EDTCDE(Z)
      *
     A            BOKDET         1S 0       TEXT('Detaljliste')
     A                                      COLHDG('Det' 'liste')
     A                                      EDTCDE(Z)
      *
     A            BOKFRA         1S 0       TEXT('Fra Backup')
     A                                      COLHDG('Fra' 'Backup')
     A                                      EDTCDE(Z)
      *
     A            BOKPRO         6S 0       TEXT('Kundeprosjekt')
     A                                      COLHDG('Kunde' 'Prosj.')
     A                                      EDTCDE(Z)
      *
     A            BONETO         1S 0       TEXT('Netto u/rab')
     A                                      COLHDG('Netto' 'u/rab')
     A                                      EDTCDE(Z)
      *
     A            BOFATY         2S 0       TEXT('Fakturatype')
     A                                      COLHDG('Fakt.' 'type')
     A                                      EDTCDE(Z)
     A            BOKJNR         5S 0       TEXT('Rekkefølge innen rute')
     A                                      COLHDG('Innen' 'rute')
     A                                      EDTCDE(Z)
     A            BOEKSU        11S 2       TEXT('Ekstra uttak')
     A                                      COLHDG('Ekstra' 'uttak')
     A                                      EDTCDE(Z)
     A            BOBKRT        11S 2       TEXT('Betalt kort')
     A                                      COLHDG('Betalt' 'kort')
     A                                      EDTCDE(Z)
     A            BOBKNT        11S 2       TEXT('Betalt kontant')
     A                                      COLHDG('Betalt' 'kontant')
     A                                      EDTCDE(Z)
     A            BOBGKV        11S 2       TEXT('Betalt Gavekort')
     A                                      COLHDG('Betalt' 'gavekort')
     A                                      EDTCDE(Z)
     A            BOBDPO        11S 2       TEXT('Betalt depositum')
     A                                      COLHDG('Betalt' 'depositum')
     A                                      EDTCDE(Z)
      *
     A            BOTAUT        14A         TEXT('Terminal autentifikasjon')
     A                                      COLHDG('Terminal' 'autentifikasjon')
     A            BOTTIM        14A         TEXT('Terminal timestamp')
     A                                      COLHDG('Terminal' 'timestamp')
     A            BOOFFL    R               REFFLD(BÅOFFL)
     A            BODATE          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
     A            BOTIME          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
     A            BOUSER        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
6.10 A            BOEDAT    R               REFFLD(BÅEDAT)
6.10 A            BOETIM    R               REFFLD(BÅETIM)
6.10 A            BOEUSR    R               REFFLD(BÅEUSR)
      *
      * Butikk-linje-register               (BM)
      *
     A            BMFIRM    R               REFFLD(BÅFIRM)
      *
     A            BMAARR         4S 0       TEXT('År')
     A                                      COLHDG('År')
     A                                      EDTCDE(Z)
      *
     A            BMWSID        10A         TEXT('Skjerm/kasse')
     A                                      COLHDG('Skjerm/' 'kasse')
      *
6.NU A            BMNUMM         8S 0       TEXT('Bongnummer')
     A                                      COLHDG('Bongnr')
     A                                      EDTCDE(Z)
      *
     A            BMLINE         4S 0       TEXT('Linjenummer')
     A                                      COLHDG('Linje')
     A                                      EDTCDE(Z)
      *
     A            BMLTYP         2A         TEXT('Linje-type')
     A                                      COLHDG('Linje' 'type')
      *
     A            BMLETY    R               REFFLD(BÅLETY)
      *
     A            BMVARE    R               REFFLD(BÅVARE)
      *
     A            BMENH1         3A         TEXT('Enhet')
     A                                      COLHDG('Enhet')
      *
     A            BMTEK1    R               REFFLD(BÅTEK1)
      *
     A            BMTEK2    R               REFFLD(BÅTEK2)
      *
     A            BMANTA        11S 3       TEXT('Antall bestilt')
     A                                      COLHDG('Antall' 'bestilt')
     A                                      EDTWRD('      0 ,   ')
     A                                      RANGE(0  99999999)
     A                                      CHKMSGID(BMD0910 *LIBL/QMFSHOP)
      *
     A            BMKPRI         1A         TEXT('Priskode')
     A                                      COLHDG('Pris' 'kode')
     A                                      VALUES(' ' 'N' 'T' 'F')
     A                                      CHKMSGID(BMD1400 *LIBL/QMFSHOP)
      *
     A            BMOPPR         9S 2       TEXT('Opprinnelig pris')
     A                                      COLHDG('Oppr' 'pris')
     A                                      EDTWRD('     0 ,  ')
      *
     A            BMSAPR        10S 3       TEXT('Salgspris')
     A                                      COLHDG('Salgs' 'pris')
     A                                      EDTWRD('     0 ,   ')
      *
     A            BMKOPR         9S 2       TEXT('Kost-pris')
     A                                      COLHDG('Kost' 'pris')
     A                                      EDTWRD('     0 ,  ')
      *
     A            BMSELK         9S 2       TEXT('Selvkost,overstyrt')
     A                                      COLHDG('Selvkost,' 'overst.')
     A                                      EDTWRD('     0 ,  ')
      *
     A            BMRAB1         5S 2       TEXT('Linje-rabatt 1')
     A                                      COLHDG('Linje' 'rab. 1')
     A                                      EDTWRD(' 0 ,  ')
     A                                      COMP(LE 100)
     A                                      CHKMSGID(BMD1100 *LIBL/QMFSHOP)
      *
     A            BMRAB2         5S 2       TEXT('Linje-rabatt 2')
     A                                      COLHDG('Linje' 'rab. 2')
     A                                      EDTWRD(' 0 ,  ')
     A                                      COMP(LE 100)
     A                                      CHKMSGID(BMD1100 *LIBL/QMFSHOP)
      *
     A            BMSUMS        12S 3       TEXT('Sum salg')
     A                                      COLHDG('Sum salg')
     A                                      EDTWRD('       0 ,   -')
      *
     A            BMKAMP    R               REFFLD(BÅKAMP)
     A            BMOGRP    R               REFFLD(BÅOGRP)
     A            BMHGRP    R               REFFLD(BÅHGRP)
     A            BMUGRP    R               REFFLD(BÅUGRP)
      *
     A            BMLVRE         1S 0       TEXT('Lokalt vreg')
     A                                      COLHDG('Lok' 'vreg')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BM00180 *LIBL/QMFSHOP)
      *
6.NU A            BMREFN         8S 0       TEXT('Håndterminal refnr')
     A                                      COLHDG('Håndterm.' 'refnr')
     A                                      EDTCDE(Z)
      *
      * Butikk-hode-register                (BN)
      *
     A            BNFIRM    R               REFFLD(BÅFIRM)
      *
     A            BNAARR         4S 0       TEXT('År')
     A                                      COLHDG('År')
     A                                      EDTCDE(Z)
      *
     A            BNWSID        10A         TEXT('Skjerm/kasse')
     A                                      COLHDG('Skjerm/' 'kasse')
      *
6.NU A            BNNUMM         8S 0       TEXT('Bongnummer')
     A                                      COLHDG('Bongnr')
     A                                      EDTCDE(Z)
      *
     A            BNOTYP         2A         TEXT('Ordretype')
     A                                      COLHDG('Ordre' 'type')
      *
     A            BNLETY    R               REFFLD(BÅLETY)
      *
     A            BNLAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
      *
6.NU A            BNBINR         8S 0       TEXT('Bilagsnummer')
     A                                      COLHDG('Bilagsnr')
     A                                      EDTCDE(Z)
      *
6.NU A            BNKREF         8S 0       TEXT('Kreditt-ref.')
     A                                      COLHDG('Kred.' 'ref.')
     A                                      EDTCDE(Z)
      *
     A            BNBDAT          L         TEXT('Ordredato')
     A                                      COLHDG('Ordre' 'dato')
      *
     A            BNLDAT          L         TEXT('Leveringsdato')
     A                                      COLHDG('Lev.' 'dato')
      *
     A            BNFKDA          L         TEXT('Fakturadato')
     A                                      COLHDG('Fakt.' 'dato')
      *
     A            BNFFDA          L         TEXT('Forfallsdato')
     A                                      COLHDG('Forf.' 'dato')
      *
     A            BNBETB         2S 0       TEXT('Bet.betingelser')
     A                                      COLHDG('Bet.' 'bet.')
     A                                      EDTCDE(Z)
      *
     A            BNSELG         4S 0       TEXT('Selger')
     A                                      COLHDG('Selg')
     A                                      EDTCDE(Z)
      *
5.41 A            BNDIST         4S 0       TEXT('Distrikt')
     A                                      COLHDG('Dist')
     A                                      EDTCDE(Z)
      *
     A            BNLMAT         2S 0       TEXT('Leveringsmåte')
     A                                      COLHDG('Lev' 'måte')
     A                                      EDTCDE(Z)
      *
     A            BNLBET         2S 0       TEXT('Leveringsbet.')
     A                                      COLHDG('Lev.' 'bet.')
     A                                      EDTCDE(Z)
      *
     A            BNVALK         3A         TEXT('Valuta')
     A                                      COLHDG('Valuta')
      *
     A            BNRKAT         3S 0       TEXT('Rabatt-kategori')
     A                                      COLHDG('Rab.' 'kat.')
     A                                      EDTCDE(Z)
      *
     A            BNSPED         3S 0       TEXT('Speditør')
     A                                      COLHDG('Sped')
     A                                      EDTCDE(Z)
      *
     A            BNKJOR         2S 0       TEXT('Kjørerute')
     A                                      COLHDG('Kjøre' 'rute')
     A                                      EDTCDE(Z)
      *
     A            BNMKOD         1S 0       TEXT('Mva-kode')
     A                                      COLHDG('Mva' 'kode')
     A                                      EDTCDE(Z)
      *
     A            BNLKUN         6S 0       TEXT('Vare-adresse')
     A                                      COLHDG('Vare' 'adresse')
     A                                      EDTCDE(Z)
      *
     A            BNKUND         6S 0       TEXT('Kundenummer')
     A                                      COLHDG('Kunde')
     A                                      EDTCDE(Z)
      *
     A            BNKUNA        30A         TEXT('Kunde-alfa')
     A                                      COLHDG('Kunde-alfa')
      *
     A            BNNAVN        30A         TEXT('Navn')
     A                                      COLHDG('Navn')
      *
     A            BNADR1        30A         TEXT('Adresse 1')
     A                                      COLHDG('Adresse 1')
      *
     A            BNADR2        30A         TEXT('Adresse 2')
     A                                      COLHDG('Adresse 2')
      *
     A            BNSTED        30A         TEXT('Poststed')
     A                                      COLHDG('Poststed')
      *
     A            BNAVDE         4S 0       TEXT('Avd. salg overst')
     A                                      COLHDG('Avd. salg' 'overst')
     A                                      EDTCDE(Z)
      *
     A            BNKONT         6S 0       TEXT('Konto')
     A                                      COLHDG('Konto')
     A                                      EDTCDE(Z)
      *
     A            BNSPES         4S 0       TEXT('Spes')
     A                                      COLHDG('Spes')
     A                                      EDTCDE(Z)
      *
6.20 A**          BNPROJ         6S 0       TEXT('Prosjekt')
6.20 A**                                    EDTCDE(Z)
6.20 A            BNPROJ         6A         TEXT('Prosjekt')
     A                                      COLHDG('Prosj.')
      *
     A            BNAKTI         3A         TEXT('Aktivitet')
     A                                      COLHDG('Akt')
      *
     A            BNKGFA         1S 0       TEXT('Undertr. fakt.geb')
     A                                      COLHDG('Undertr.' 'fakt.geb')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BMO0600 *LIBL/QMFSHOP)
      *
     A            BNVREF        20A         TEXT('Vår ref.')
     A                                      COLHDG('Vår ref.')
      *
     A            BNDREF        20A         TEXT('Deres ref.')
     A                                      COLHDG('Deres ref.')
      *
     A            BNREKV        20A         TEXT('Kund.rekv.nr.')
     A                                      COLHDG('Kund.rekv.nr.')
      *
     A            BNLMTX        20A         TEXT('Lev. måte tekst')
     A                                      COLHDG('Lev. måte tekst')
      *
     A            BNLBTX        75A         TEXT('Lev. bet. tekst')
     A                                      COLHDG('Lev. bet. tekst')
      *
     A            BNRABP         5S 2       TEXT('Rabatt i %')
     A                                      COLHDG('Rab' 'i %')
     A                                      EDTCDE(M)
     A                                      COMP(LE 100)
     A                                      CHKMSGID(BMD1100 *LIBL/QMFSHOP)
      *
6.NU A            BNORNR         8S 0       TEXT('Ordrenummer-ofak')
     A                                      COLHDG('Ordrenr' 'ofak')
     A                                      EDTCDE(Z)
      *
     A            BNORSU         2S 0       TEXT('Ordresuffix-ofak')
     A                                      COLHDG('Suffix' 'ofak')
     A                                      EDTCDE(Z)
      *
6.NU A            BNPORD         8S 0       TEXT('Ordrenummer-pris')
     A                                      COLHDG('Ordrenr' 'pris')
     A                                      EDTCDE(Z)
      *
     A            BNPSUF         2S 0       TEXT('Suffix-prisordre')
     A                                      COLHDG('Suff' 'pris')
     A                                      EDTCDE(Z)
      *
     A            BNMOTT        11S 2       TEXT('Mottatt, beløp')
     A                                      COLHDG('Mottatt' 'beløp')
     A                                      EDTCDE(M)
      *
     A            BNTOTX        11S 2       TEXT('KR fritt salg')
     A                                      COLHDG('KR fritt salg')
     A                                      EDTCDE(M)
      *
     A            BNTOTB        11S 2       TEXT('Total betalt')
     A                                      COLHDG('Total betalt')
     A                                      EDTCDE(M)
      *
     A            BNTOTS        11S 2       TEXT('Total salg')
     A                                      COLHDG('Total salg')
     A                                      EDTCDE(M)
      *
     A            BNDATE          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            BNTIME          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
      *
     A            BNKPRO         6S 0       TEXT('Kundeprosjekt')
     A                                      COLHDG('Kunde' 'Prosj')
     A                                      EDTCDE(Z)
      *
     A            BNNETO         1S 0       TEXT('Netto u/rab')
     A                                      COLHDG('Netto' 'u/rab')
     A                                      EDTCDE(Z)
      *
      * Butikk-kode-register                (BAA)
      *
     A            BAAFIR    R               REFFLD(BÅFIRM)
      *
     A            BAAAVS         6A         TEXT('IDENT. AVST.LISTE')
     A                                      COLHDG('Ident.' 'avst.')
      *
     A            BAADET         6A         TEXT('Ident. Detaljliste')
     A                                      COLHDG('Ident.' 'detalj')
      *
     A            BAAORD         6A         TEXT('Ident. Ordre')
     A                                      COLHDG('Ident.' 'Ordre')
      *
     A            BAALST         6A         TEXT('Ident. Liste')
     A                                      COLHDG('Ident.' 'Liste')
      *
     A            BAABNR         6A         TEXT('Ident. Bilagsnr')
     A                                      COLHDG('Ident.' 'Bilagsnr')
      *
     A            BAAVAR        15A         TEXT('Varenr, Øreavrunding')
     A                                      COLHDG('Varenr' 'Øreavrunding')
      *
     A            BAAGVA        15A         TEXT('Varenr, Gavekort')
     A                                      COLHDG('Varenr' 'Gavekort')
      *
     A            BAADVA        15A         TEXT('Varenr, Depositum')
     A                                      COLHDG('Varenr' 'Depositum')
6.12  *
6.12 A            BAAIVA        15A         TEXT('Varenr, Innbetaling')
6.12 A                                      COLHDG('Varenr' 'Innbetaling')
      *
     A            BAAKUN         6S 0       TEXT('Kundenummer')
     A                                      COLHDG('Kunde' 'nummer')
     A                                      EDTCDE(Z)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(BMA0600 *LIBL/QMFSHOP)
      *
     A            BAAOPK         6S 0       TEXT('Konto Oppgjør')
     A                                      COLHDG('Konto' 'Oppgjør')
     A                                      EDTCDE(Z)
      *
     A            BAAOPS         4S 0       TEXT('Spes Oppgjør')
     A                                      COLHDG('Spes' 'Oppgjør')
     A                                      EDTCDE(Z)
      *
     A            BAASAK         6S 0       TEXT('Konto salg')
     A                                      COLHDG('Konto' 'salg')
     A                                      EDTCDE(Z)
      *
     A            BAASAS         4S 0       TEXT('Spes salg')
     A                                      COLHDG('Spes salg')
     A                                      EDTCDE(Z)
      *
     A            BAAMVA         1S 0       TEXT('Vis moms i bilde')
     A                                      COLHDG('Vise' 'moms')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BMA0610 *LIBL/QMFSHOP)
      *
     A            BAABIL         1S 0       TEXT('Kode for bilagsnr')
     A                                      COLHDG('Kode' 'bilagsnr')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BMA0620 *LIBL/QMFSHOP)
      *
     A            BAALAG         1S 0       TEXT('Oppdatering av lager')
     A                                      COLHDG('Oppdat' 'lager')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BMA0630 *LIBL/QMFOFAK)
      *
     A            BAAHOY         1S 0       TEXT('Store bokstaver')
     A                                      COLHDG('Store' 'bokst')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BMA0640 *LIBL/QMFOFAK)
      *
     A            BAAUKR         1S 0       TEXT('Utelat kred.salg')
     A                                      COLHDG('Utel.' 'k.salg')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BMA0640 *LIBL/QMFOFAK)
      *
     A            BAAOKD         2A         TEXT('Ordre-type, kont D')
     A                                      COLHDG('O-type' 'kont D')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(BMA0650 *LIBL/QMFOFAK)
      *
     A            BAAOKK         2A         TEXT('Ordre-type, kont K')
     A                                      COLHDG('O-type' 'kont K')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(BMA0650 *LIBL/QMFOFAK)
      *
     A            BAAOCD         2A         TEXT('Ordre-type, pakk D')
     A                                      COLHDG('O-type' 'pakk D')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(BMA0650 *LIBL/QMFOFAK)
      *
     A            BAAOCK         2A         TEXT('Ordre-type, pakk K')
     A                                      COLHDG('O-type' 'pakk K')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(BMA0650 *LIBL/QMFOFAK)
      *
     A            BAAOFD         2A         TEXT('Ordre-type, fakt D')
     A                                      COLHDG('O-type' 'fakt D')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(BMA0650 *LIBL/QMFOFAK)
      *
     A            BAAOFK         2A         TEXT('Ordre-type, fakt K')
     A                                      COLHDG('O-type' 'fakt K')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(BMA0650 *LIBL/QMFOFAK)
      *
     A            BAAOBD         2A         TEXT('Ordre-type, Innbet.')
     A                                      COLHDG('O-type' 'Innbet.')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(BMA0650 *LIBL/QMFOFAK)
      *
     A            BAAOBK         2A         TEXT('Ordre-type, Utbet.')
     A                                      COLHDG('O-type' 'Utbet.')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(BMA0650 *LIBL/QMFOFAK)
      *
     A            BAAOLD         2A         TEXT('Ordre-type, Plukk.')
     A                                      COLHDG('O-type' 'Plukk.')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(BMA0650 *LIBL/QMFOFAK)
      *
     A            BAALTY         2A         TEXT('Linje-type,')
     A                                      COLHDG('Linje' 'type')
      *
     A            BAATTY         2A         TEXT('Tekst-type')
     A                                      COLHDG('Tekst' 'type')
      *
     A            BAABIN         2S 0       TEXT('Bilagskode, bet.')
     A                                      COLHDG('Bilagsk' 'bet.')
     A                                      EDTCDE(Z)
      *
     A            BAABKA         2S 0       TEXT('Bilagskode, kasse')
     A                                      COLHDG('Bilagsk' 'kasse')
     A                                      EDTCDE(Z)
      *
     A            BAABNK         2S 0       TEXT('Bilagskode, bank')
     A                                      COLHDG('Bilagsk' 'bank')
     A                                      EDTCDE(Z)
      *
     A            BAABAV         2S 0       TEXT('Bilagskode, avrund')
     A                                      COLHDG('Bilagsk' 'avrund')
     A                                      EDTCDE(Z)
6.10 A            BAAODA    R               REFFLD(BÅODAT)
6.10 A            BAAOTI    R               REFFLD(BÅOTIM)
6.10 A            BAAOUS    R               REFFLD(BÅOUSR)
6.10 A            BAAEDA    R               REFFLD(BÅEDAT)
6.10 A            BAAETI    R               REFFLD(BÅETIM)
6.10 A            BAAEUS    R               REFFLD(BÅEUSR)
      *
      * Overførings-file mot økonomi        (BF)
      *
     A            BFFIRM    R               REFFLD(BÅFIRM)
      *
     A            BFPERI         4S 0       TEXT('Periode')
     A                                      COLHDG('Peri' 'ode')
     A                                      EDTCDE(Z)
      *
     A            BFBUNT         5S 0       TEXT('Bunt-nummer')
     A                                      COLHDG('Bunt' 'nr')
     A                                      EDTCDE(Z)
      *
6.NU A            BFBILN         8S 0       TEXT('Bilagsnummer')
     A                                      COLHDG('Bilag' 'nr')
     A                                      EDTCDE(Z)
      *
     A            BFBILL         4S 0       TEXT('Bilagslinje')
     A                                      COLHDG('Bilag' 'linje')
     A                                      EDTCDE(Z)
      *
     A            BFBDAT          L         TEXT('Bilagsdato')
     A                                      COLHDG('Bilags' 'dato')
      *
     A            BFFDAT          L         TEXT('Forfallsdato')
     A                                      COLHDG('Forf.' 'dato')
      *
     A            BFBILK         2S 0       TEXT('Bilags-kode')
     A                                      COLHDG('Bilag' 'kode')
     A                                      EDTCDE(Z)
      *
     A            BFTEXT        20A         TEXT('Bilags-tekst')
     A                                      COLHDG('Bilags-tekst')
      *
     A            BFDAVD         4S 0       TEXT('Debet avd')
     A                                      COLHDG('Debet' 'avd.')
     A                                      EDTCDE(Z)
      *
     A            BFDKTO         6S 0       TEXT('Debet konto')
     A                                      COLHDG('Debet' 'Konto')
     A                                      EDTCDE(Z)
      *
     A            BFDSPS         4S 0       TEXT('Debet Spes')
     A                                      COLHDG('Debet' 'Spes')
     A                                      EDTCDE(Z)
      *
     A            BFDMOM         1A         TEXT('Debet Moms')
     A                                      COLHDG('Debet' 'Moms')
      *
     A            BFBELP        10S 2       TEXT('Beløp')
     A                                      COLHDG('Beløp')
     A                                      EDTCDE(4)
5.32  *
5.32 A            BFMVAG        10S 2       TEXT('Mva. grunnl')
5.32 A                                      COLHDG('Mva' 'Grunnl')
5.32 A                                      EDTCDE(4)
      *
     A            BFCAVD         4S 0       TEXT('Kredit avd')
     A                                      COLHDG('Kred.' 'avd.')
     A                                      EDTCDE(Z)
      *
     A            BFCKTO         6S 0       TEXT('Kredit konto')
     A                                      COLHDG('Kred.' 'Konto')
     A                                      EDTCDE(Z)
      *
     A            BFCSPS         4S 0       TEXT('Kredit Spes')
     A                                      COLHDG('Kred.' 'Spes')
     A                                      EDTCDE(Z)
      *
     A            BFCMOM         1A         TEXT('Kredit Moms')
     A                                      COLHDG('Kred.' 'Moms')
      *
6.20 A**          BFPROJ         6S 0       TEXT('Prosjektnr.')
6.20 A            BFPROJ         6A         TEXT('Prosjektnr.')
     A                                      COLHDG('Prosj.' 'nr.')
6.20 A**                                    EDTCDE(Z)
      *
     A            BFAKTI         3A         TEXT('Aktivitet')
     A                                      COLHDG('Akt')
      *
6.NU A            BFKREF         8S 0       TEXT('Kreditreferanse')
     A                                      COLHDG('Kred.' 'ref.')
     A                                      EDTCDE(Z)
      *
     A            BFKUND         6S 0       TEXT('Reskontro-nummer.')
     A                                      COLHDG('Konto' 'Resk')
      *
     A            BFVALK         3A         TEXT('Valutakode')
     A                                      COLHDG('Val.' 'Kode')
      *
     A            BFVALB        11S 2       TEXT('Valutabeløp')
     A                                      COLHDG('Val.' 'Beløp')
     A                                      EDTCDE(4)
      *
     A            BFMNGK         2S 0       TEXT('Mengde Kode')
     A                                      COLHDG('Mengde' 'Kode')
     A                                      EDTCDE(Z)
      *
     A            BFMNGD         9S 2       TEXT('Mengde')
     A                                      COLHDG('Mengde')
     A                                      EDTCDE(4)
      *
     A            BFAUTX         1A         TEXT('Saldert/Krysset')
     A                                      COLHDG('Saldert')
      *
7.00 A            BFLOGG          Z         TEXT('Logg tidspunkt')
7.00 A                                      COLHDG('Loggtid')
      *
      * Butikk-budsjett-register            (BU)
      *
     A            BUFIRM    R               REFFLD(BÅFIRM)
      *
     A            BUAARR    R               REFFLD(BÅAARR)
      *
     A            BUMMND         2S 0       TEXT('Mnd')
     A                                      COLHDG('Mnd')
     A                                      EDTCDE(Z)
      *
     A            BUTEXT        30A         TEXT('Tekst')
     A                                      COLHDG('Tekst')
      *
     A            BUVDAG         2S 0       TEXT('Virkedager')
     A                                      COLHDG('Virke' 'dager')
     A                                      EDTCDE(Z)
      *
     A            BUKRON        11S 2       TEXT('Budsjett, kroner')
     A                                      COLHDG('Budsjett' 'kroner')
     A                                      EDTWRD('       0 ,  ')
      *
     A            BUSALG        11S 2       TEXT('Akkumulert beløp')
     A                                      COLHDG('Akkumulert' 'beløp')
     A                                      EDTWRD('       0 ,  ')
      *
     A            BUKOST        11S 2       TEXT('Akkumulert kost')
     A                                      COLHDG('Akkumulert' 'kost')
     A                                      EDTWRD('       0 ,  ')
      *
      * Butikk-kasse-register               (BW)
      *
     A            BWFIRM    R               REFFLD(BÅFIRM)
      *
     A            BWWSID    R               REFFLD(BÅWSID)
      *
     A            BWWSGR         6A         TEXT('Arb.st. gruppe')
     A                                      COLHDG('Arb.st.' 'gruppe')
      *
     A            BWTXT1        30A         TEXT('Tekst')
     A                                      COLHDG('Tekst')
      *
     A            BWTXT2        20A         TEXT('Plassering')
     A                                      COLHDG('Plassering')
      *
     A            BWBONG         6A         TEXT('Ident. Bongnummer')
     A                                      COLHDG('Ident.' 'Bongnr')
      *
     A            BWAVDE    R               REFFLD(BÅAVDE)
      *
     A            BWSPES         4S 0       TEXT('Spes')
     A                                      COLHDG('Spes')
     A                                      EDTCDE(Z)
      *
     A            BWLAGE    R               REFFLD(BÅLAGE)
      *
     A            BWKTYP         1S 0       TEXT('Kassetype')
     A                                      COLHDG('Kasse' 'type')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(BMW0600 *LIBL/QMFSHOP)
      *
     A            BWKVAR         1S 0       TEXT('Kode for varenummer')
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode for' 'varenr')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BMW0610 *LIBL/QMFSHOP)
      *
     A            BWKANT         1S 0       TEXT('Kode for antall')
     A                                      COLHDG('Kode for' 'antall')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BMW0620 *LIBL/QMFSHOP)
      *
     A            BWKBON         1S 0       TEXT('Type Bong')
     A                                      COLHDG('Type' 'Bong')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BMW0630 *LIBL/QMFSHOP)
      *
     A            BWKSEL         1S 0       TEXT('Kode for blk. selger')
     A                                      COLHDG('Kode blk.' 'selger')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BMW0640 *LIBL/QMFSHOP)
      *
     A            BWAKTI         1S 0       TEXT('Kode for aktiv WS')
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode for' 'aktiv WS')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BMW0650 *LIBL/QMFSHOP)
6.10 A            BWODAT    R               REFFLD(BÅODAT)
6.10 A            BWOTIM    R               REFFLD(BÅOTIM)
6.10 A            BWOUSR    R               REFFLD(BÅOUSR)
6.10 A            BWEDAT    R               REFFLD(BÅEDAT)
6.10 A            BWETIM    R               REFFLD(BÅETIM)
6.10 A            BWEUSR    R               REFFLD(BÅEUSR)
      *
      * Butikk-plukk-S-register             (BSO)
      *
     A            BSOFIR    R               REFFLD(BÅFIRM)
      *
     A            BSORCT         1A         TEXT('Recordkode')
     A                                      COLHDG('Rec' 'kode')
     A                                      VALUES('H' 'V')
     A                                      CHKMSGID(BMS0600 *LIBL/QMFSHOP)
      *
     A            BSOAAR         4S 0       TEXT('Regist. år')
     A                                      COLHDG('Regist.' 'år')
     A                                      EDTCDE(Z)
      *
     A            BSOWSD        10A         TEXT('Arbeidsstasjon')
     A                                      COLHDG('Arb.' 'stasjon')
      *
     A            BSONUM        12A         TEXT('Bongnr.')
     A                                      COLHDG('Bongnr.')
      *
     A            BSOLIN         4S 0       TEXT('Linjenummer')
     A                                      COLHDG('Linje')
     A                                      EDTCDE(Z)
      *
     A            BSOAKK         1S 0       TEXT('Akkumulatortype')
     A                                      COLHDG('Akk.' 'type')
     A                                      EDTCDE(Z)
      *
     A            BSOOTY         2A         TEXT('Ordretype')
     A                                      COLHDG('Ordre' 'type')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(BMS0610 *LIBL/QMFSHOP)
      *
     A            BSOOGR         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Over' 'gruppe')
     A                                      EDTCDE(Z)
      *
     A            BSOHGR         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hoved' 'gruppe')
     A                                      EDTCDE(Z)
      *
     A            BSOUGR         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Under' 'gruppe')
     A                                      EDTCDE(Z)
      *
     A            BSOVAR    R               REFFLD(BÅVARE)
      *
     A            BSODIV        10A         TEXT('Diverse')
     A                                      COLHDG('Diverse')
6.21  *
6.21  * Kort transaksjonsregister           (BR)
6.21  *
6.21 A            BRFIRM    R               REFFLD(BÅFIRM)
6.21  *
6.21 A            BRBONG    R               REFFLD(BÅBONG)
6.21  *
6.21 A            BRKORT        25S 0       TEXT('Kortnummer')
6.21 A                                      COLHDG('Kortnummer')
6.21 A                                      EDTCDE(Z)
6.21  *
6.21 A            BRSTRK        25S 0       TEXT('Strekkode')
6.21 A                                      COLHDG('Strekkode')
6.21 A                                      EDTCDE(Z)
6.21  *
6.21 A            BRKTYP         2S 0       TEXT('Korttype')
6.21 A                                      COLHDG('Korttype')
6.21 A                                      EDTCDE(Z)
6.21  *
6.21 A            BRKUND    R               REFFLD(BÅKUND)
6.21  *
6.21 A            BROFDA          L         TEXT('Overført  dato')
6.21 A                                      COLHDG('Overført dato')
6.21  *
6.21 A            BROFTI          T         TEXT('Overført tid')
6.21 A                                      COLHDG('Overført tid')
6.21  *
6.NU A            BRBINR         8S 0       TEXT('Fakturanummer')
6.21 A                                      COLHDG('Fakt.nr.')
6.21  *
6.21 A            BRODAT    R               REFFLD(BÅODAT)
6.21 A            BROTIM    R               REFFLD(BÅOTIM)
6.21 A            BREDAT    R               REFFLD(BÅEDAT)
6.21 A            BRETIM    R               REFFLD(BÅETIM)
6.21 A            BREUSR    R               REFFLD(BÅEUSR)
6.33  *
6.33  * Kort refereanser med KID            (BE)
6.33  *
6.33 A            BXFIRM    R               REFFLD(BÅFIRM)
6.33 A            BXAARR    R               REFFLD(BÅAARR)
6.33 A            BXBONG    R               REFFLD(BÅBONG)
6.33 A            BXKTYP         3A         TEXT('Korttype')
6.33 A                                      COLHDG('Korttype')
6.33  *
6.33 A            BXBILN         8S 0       TEXT('Bilagsnummer')
6.33 A                                      COLHDG('Bilnr')
6.33 A                                      EDTCDE(Z)
6.33  *
6.33 A            BXKIDR        25A         TEXT('Kidreferanse')
6.33 A                                      COLHDG('Kidref')
6.33  *
6.33 A            BXODAT    R               REFFLD(BÅODAT)
6.33 A            BXOTIM    R               REFFLD(BÅOTIM)
6.33 A            BXOUSR    R               REFFLD(BÅOUSR)
6.33 A            BXEDAT    R               REFFLD(BÅEDAT)
6.33 A            BXETIM    R               REFFLD(BÅETIM)
6.33 A            BXEUSR    R               REFFLD(BÅEUSR)

