      *
      *  Butikk-linje-register    Index=Update
      *
     A          R BMDTPFR
     A                                      PFILE(*LIBL/BMDTPF)
      *
     A          K BMFIRM
     A          K BMAARR
     A          K BMWSID
     A          K BMNUMM
     A          K BMLINE
