      *
      *  Butikk-linje-register
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
      *
     A                                      REF(*LIBL/BFRF)
     A          R BMDTPFR
     A            BMFIRM    R
     A            BMAARR    R
     A            BMWSID    R
     A            BMNUMM    R
     A            BMLINE    R
     A            BMLTYP    R
     A            BMLETY    R
     A            BMVARE    R
     A            BMENH1    R
     A            BMTEK1    R
     A            BMTEK2    R
     A            BMANTA    R
     A            BMKPRI    R
     A            BMOPPR    R
     A            BMSAPR    R
     A            BMKOPR    R
     A            BMSELK    R
     A            BMRAB1    R
     A            BMRAB2    R
     A            BMSUMS    R
     A            BMKAMP    R
     A            BMOGRP    R
     A            BMHGRP    R
     A            BMUGRP    R
     A            BMLVRE    R
     A            BMREFN    R
