      *
      *  Butikk-hode-register
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/BFRF)
     A          R BMHEPFR
     A            BNFIRM    R
     A            BNAARR    R
     A            BNWSID    R
     A            BNNUMM    R
     A            BNOTYP    R
     A            BNLETY    R
     A            BNLAGE    R
     A            BNBINR    R
     A            BNKREF    R
     A            BNBDAT    R
     A            BNLDAT    R
     A            BNFKDA    R
     A            BNFFDA    R
     A            BNBETB    R
     A            BNSELG    R
     A            BNDIST    R
     A            BNLMAT    R
     A            BNLBET    R
     A            BNVALK    R
     A            BNRKAT    R
     A            BNSPED    R
     A            BNKJOR    R
     A            BNMKOD    R
     A            BNLKUN    R
     A            BNKUND    R
     A            BNKUNA    R
     A            BNNAVN    R
     A            BNADR1    R
     A            BNADR2    R
     A            BNSTED    R
     A            BNAVDE    R
     A            BNKONT    R
     A            BNSPES    R
     A            BNPROJ    R
     A            BNAKTI    R
     A            BNKGFA    R
     A            BNVREF    R
     A            BNDREF    R
     A            BNREKV    R
     A            BNLMTX    R
     A            BNLBTX    R
     A            BNRABP    R
     A            BNORNR    R
     A            BNORSU    R
     A            BNPORD    R
     A            BNPSUF    R
     A            BNMOTT    R
     A            BNTOTX    R
     A            BNTOTB    R
     A            BNTOTS    R
     A            BNDATE    R
     A            BNTIME    R
     A            BNKPRO    R
     A            BNNETO    R
