      *
      *  Butikk-hode-register     Index=Update
      *
     A          R BMHEPFR
     A                                      PFILE(*LIBL/BMHEPF)
      *
     A          K BNFIRM
     A          K BNAARR
     A          K BNWSID
     A          K BNNUMM
