      *
      *  Bong-linje-register      Index=ÅR,BONG,ORDRENUMMER
      *
     A          R BODTPFR
     A                                      PFILE(*LIBL/BODTPF)
      *
     A          K BDFIRM
     A          K BDBONG
     A          K BDAARR
     A          K BDORNR
