      *
      *  Bong-linje-register      Index=Update
      *
     A                                      UNIQUE
     A          R BODTPFR                   PFILE(*LIBL/BODTPF)
      *
     A          K BDFIRM
     A          K BDAARR
     A          K BDWSID
     A          K BDBONG
     A          K BDLINE
