      *
      *  Bong-linje-register      Index=VARE
      *
     A          R BODTPFR
     A                                      PFILE(*LIBL/BODTPF)
      *
     A          K BDFIRM
     A          K BDVARE
