      *
      *  Bong-linje-register
      *
     A                                      REF(*LIBL/BFRF)
     A          R BODTPFR
     A            BDFIRM    R
     A            BDAARR    R
     A            BDWSID    R
     A            BDBONG    R
     A            BDLINE    R
     A            BDLTYP    R
     A            BDLETY    R
     A            BDVARE    R
     A            BDENH1    R
     A            BDTEK1    R
     A            BDTEK2    R
     A            BDANTA    R
     A            BDKPRI    R
     A            BDOPPR    R
     A            BDSAPR    R
     A            BDKOPR    R
     A            BDSELK    R
     A            BDRAB1    R
6.31 A            BDRBE1    R
6.31 A            BDRBI1    R
     A            BDRAB2    R
6.31 A            BDRBE2    R
6.31 A            BDRBI2    R
     A            BDSUMS    R
6.31 A            BDSUMI    R
6.31 A            BDSUMO    R
     A            BDSUMK    R
6.31 A            BDSUKI    R
6.31 A            BDSUOK    R
     A            BDKAMP    R
     A            BDOGRP    R
     A            BDHGRP    R
     A            BDUGRP    R
     A            BDLVRE    R
     A            BDNOBB    R
     A            BDLDOR    R
     A            BDLVAR    R
     A            BDORNR    R
     A            BDORSU    R
     A            BDORLI    R
     A            BDBRR1    R
6.31 A            BDBRB1    R
6.31 A            BDBIB1    R
     A            BDBRR2    R
6.31 A            BDBRB2    R
6.31 A            BDBIB2    R
     A            BDORAB    R
6.31 A            BDORBE    R
6.31 A            BDORBI    R
     A            BDLAGE    R
     A            BDSERI    R
     A            BDKMVA    R
6.31 A            BDGMVA    R
6.31 A            BDSMVA    R
6.31 A            BDBMVA    R
6.31 A            BDFMVA    R
     A            BDALME    R
     A            BDBRTY    R
     A            BDPRIV    R
     A            BDGAVE    R
     A            BDBENR    R
     A            BDBESU    R
     A            BDBELI    R
     A            BDTREF    R
     A            BDSELG    R
     A            BDAVDE    R
     A            BDODAT    R
     A            BDOTIM    R
6.10 A            BDOUSR    R
     A            BDEDAT    R
     A            BDETIM    R
     A            BDEUSR    R
