      *
      *  Bong-hode-register
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/BFRF)
     A          R BOHEPFR
     A            BOFIRM    R
     A            BOAARR    R
     A            BOWSID    R
     A            BOBONG    R
     A            BOOTYP    R
     A            BOLETY    R
     A            BOLAGE    R
     A            BOBINR    R
     A            BOKREF    R
     A            BOPERI    R
     A            BOBDAT    R
     A            BOLDAT    R
     A            BOFKDA    R
     A            BOFFDA    R
     A            BOBETB    R
     A            BOSELG    R
     A            BODIST    R
     A            BOLMAT    R
     A            BOLBET    R
     A            BOVALK    R
     A            BORKAT    R
     A            BOSPED    R
     A            BOKJOR    R
     A            BOMKOD    R
     A            BOKGFA    R
     A            BOLKUN    R
     A            BOKUND    R
     A            BOKUNA    R
     A            BONAVN    R
     A            BOADR1    R
     A            BOADR2    R
     A            BOSTED    R
     A            BOAVDE    R
     A            BOKONT    R
     A            BOSPES    R
     A            BOPROJ    R
     A            BOAKTI    R
     A            BOVREF    R
     A            BODREF    R
     A            BOREKV    R
     A            BOLMTX    R
     A            BOLBTX    R
     A            BORABP    R
     A            BORABB    R
     A            BOORNR    R
     A            BOORSU    R
     A            BOPORD    R
     A            BOPSUF    R
     A            BOAVRB    R
     A            BOMOTT    R
     A            BOTOTX    R
     A            BOTOTB    R
6.31 A            BORESK    R
     A            BOTOTS    R
     A            BOTOTR    R
     A            BOTOTK    R
     A            BOKAVS    R
     A            BOKDET    R
     A            BOKFRA    R
     A            BOKPRO    R
     A            BONETO    R
     A            BOFATY    R
     A            BOKJNR    R
     A            BOEKSU    R
     A            BOBKRT    R
     A            BOBKNT    R
     A            BOBGKV    R
     A            BOBDPO    R
     A            BOTAUT    R
     A            BOTTIM    R
     A            BOOFFL    R
     A            BODATE    R
     A            BOTIME    R
     A            BOUSER    R
6.10 A            BOEDAT    R
6.10 A            BOETIM    R
6.10 A            BOEUSR    R
