      *
      *  BONG-hode-register    Index=FKDA/OTYP/SELG
      *
     A          R BOHEPFR
     A                                      PFILE(*LIBL/BOHEPF)
      *
     A          K BOFIRM
     A          K BOSELG
     A          K BOBDAT
