      *
      *  Bong-hode-register       Index=Read
      *
     A          R BOHEPFR
     A                                      PFILE(*LIBL/BOHEPF)
      *
     A          K BOFIRM
     A          K BOLKUN
