      *
      *  Bong-hode-register       Index=Update
      *
     A                                      UNIQUE
     A          R BOHEPFR                   PFILE(*LIBL/BOHEPF)
      *
     A          K BOFIRM
     A          K BOAARR
     A          K BOWSID
     A          K BOBONG
