      *
      *  Bong-hode-register       Index=Vareadresse
      *
     A          R BOHEPFR
     A                                      PFILE(*LIBL/BOHEPF)
      *
     A          K BOFIRM
     A          K BOAARR
     A          K BOWSID
     A          K BONAVN
     A          K BOBONG
