      *
      *  Bong-hode-register       Index=Ordretype
      *
     A          R BOHEPFR
     A                                      PFILE(*LIBL/BOHEPF)
      *
     A          K BOFIRM
     A          K BOAARR
     A          K BOWSID
     A          K BOOTYP
     A          K BOBONG
