      *
      *  Bong-hode-register       Index=Bong,Ordre
      *
     A          R BOHEPFR
     A                                      PFILE(*LIBL/BOHEPF)
      *
     A          K BOFIRM
     A          K BOBONG
     A          K BOORNR
