      *
      * Kort transaksjonsregister
      *
     A          R BOKKPFR                   PFILE(*LIBL/BOKKPF)
      *
     A          K BRFIRM
     A          K BRKTYP
     A          K BRKUND
     A          K BRBINR
