      *
      *  KORT TRANSAKSJONSREGISTER
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/BFRF)
     A          R BOKKPFR
     A            BRFIRM    R
     A            BRBONG    R
     A            BRKORT    R
     A            BRSTRK    R
     A            BRKTYP    R
     A            BRKUND    R
     A            BROFDA    R
     A            BROFTI    R
     A            BRBINR    R
     A            BRODAT    R
     A            BROTIM    R
     A            BREDAT    R
     A            BRETIM    R
     A            BREUSR    R
