      *
      *  Overføringsfil til økonomisystemet
      *
8.00  * KOPI AV BOVFPF FOR OMKJØRING
      *
     A                                      REF(*LIBL/BFRF)
     A          R BOVFPFR
     A            BFFIRM    R
     A            BFPERI    R
     A            BFBUNT    R
     A            BFBILN    R
     A            BFBILL    R
     A            BFBDAT    R
     A            BFFDAT    R
     A            BFBILK    R
     A            BFTEXT    R
     A            BFDAVD    R
     A            BFDKTO    R
     A            BFDSPS    R
     A            BFDMOM    R
     A            BFBELP    R
     A            BFMVAG    R
     A            BFCAVD    R
     A            BFCKTO    R
     A            BFCSPS    R
     A            BFCMOM    R
     A            BFPROJ    R
     A            BFAKTI    R
     A            BFKREF    R
     A            BFKUND    R
     A            BFVALK    R
     A            BFVALB    R
     A            BFMNGK    R
     A            BFMNGD    R
     A            BFAUTX    R
     A            BFLOGG    R
