      *
      *  Overføringsfil til økonomisystemet Index=Read
      *
     A          R BOVFPFR
     A                                      PFILE(*LIBL/BOMKPF)
      *
     A          K BFFIRM
     A          K BFPERI
     A          K BFBILN
     A          K BFTEXT
