      *
      *  Overføringsfil til økonomisystemet Index=Read
      *  2021_12_13:  Sortere rapport på bilagsnummer og Bongnr(tekst)
     A          R BOVFPFR
     A                                      PFILE(*LIBL/BOVFPF)
      *
     A          K BFFIRM
     A          K BFBILN
