      *
      *  Butikk-plukk-S-register  Index=Ordretype+Arbeidstasjon
      *
     A          R BPSOPFR
     A                                      PFILE(*LIBL/BPSOPF)
      *
     A          K BSOFIR
     A          K BSOAAR
     A          K BSOAKK
     A          K BSOOTY
     A          K BSOWSD
     A          K BSONUM
     A          K BSOLIN
