      *
      *  Butikk-plukk-S-register  Index=Spesial
      *
     A          R BPSOPFR
     A                                      PFILE(*LIBL/BPSOPF)
      *
     A          K BSOFIR
     A          K BSOAKK
     A          K BSOOTY
     A          K BSOOGR
     A          K BSOHGR
     A          K BSOUGR
     A          K BSOVAR
     A          K BSOAAR
     A          K BSOWSD
     A          K BSONUM
     A          K BSOLIN
      *
     A          O BSOVAR                    COMP(EQ '               ')
     A          O BSODIV                    COMP(NE '          ')
     A          S                           ALL
