      *
      *  Overføringsfil til økonomisystemet Index=Read
7.01  *  180220 nho Ny nøkkel i forbindelse med brudd innen konto/avdeling
      *
     A          R BQVWPFR
     A                                      PFILE(*LIBL/BQVWPF)
      *
     A          K BFFIRM
     A          K BFBDAT
     A          K BFDBKR
     A          K BFDKTO
     A          K BFCKTO
     A          K BFBILK
7.01 A          K BFDAVD
7.01 A          K BFCAVD
     A*
