      *
      *  Bong - KID - Bilagsnummer referanse
      *
     A                                      REF(*LIBL/BFRF)
     A          R BREFPFR
     A            BXFIRM    R
     A            BXAARR    R
     A            BXBONG    R
     A            BXKTYP    R
     A            BXBILN    R
     A            BXKIDR    R
      *
     A            BXODAT    R
     A            BXOTIM    R
     A            BXOUSR    R
     A            BXEDAT    R
     A            BXETIM    R
     A            BXEUSR    R
