      *
      *  Butikk-kode-register     Index=Update
      *
     A          R BSTSPFR
     A                                      PFILE(*LIBL/BSTSPF)
      *
     A          K BAAFIR
