      *
      *  Butikk-kode-register
      *
     A                                      REF(*LIBL/BFRF)
     A          R BSTSPFR
     A            BAAFIR    R
     A            BAAAVS    R
     A            BAADET    R
     A            BAAORD    R
     A            BAALST    R
     A            BAABNR    R
     A            BAAVAR    R
     A            BAAGVA    R
     A            BAADVA    R
6.10 A            BAAIVA    R
     A            BAAKUN    R
     A            BAAOPK    R
     A            BAAOPS    R
     A            BAASAK    R
     A            BAASAS    R
     A            BAAMVA    R
     A            BAABIL    R
     A            BAALAG    R
     A            BAAHOY    R
     A            BAAOKD    R
     A            BAAOKK    R
     A            BAAOCD    R
     A            BAAOCK    R
     A            BAAOFD    R
     A            BAAOFK    R
     A            BAAOBD    R
     A            BAAOBK    R
     A            BAAOLD    R
     A            BAALTY    R
     A            BAATTY    R
     A            BAABIN    R
     A            BAABKA    R
     A            BAABNK    R
     A            BAABAV    R
     A            BAAUKR    R
6.10 A            BAAODA    R
6.10 A            BAAOTI    R
6.10 A            BAAOUS    R
6.10 A            BAAEDA    R
6.10 A            BAAETI    R
6.10 A            BAAEUS    R
