      *
      *  Butikk-kasse-register    Index=Update
      *
     A          R BWSDPFR
     A                                      PFILE(*LIBL/BWSDPF)
      *
     A          K BWFIRM
     A          K BWWSID
