      *
8.01  * Utvidet linjenummer på EDI meldinger
      *
      * EDI innkjøpsstatistikk
      *
     A          R CEDIPFR
      *
     A            CEFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
      *
     A            CEPAAR         4S 0       TEXT('Periode-år')
     A                                      COLHDG('Periode' 'år')
     A            CEPMND         2S 0       TEXT('Periode-mnd')
     A                                      COLHDG('Periode' 'Mnd')
      *
     A            CEBEDI         1S 0       TEXT('Bestilt på EDI')
     A                                      COLHDG('Best.' 'EDI')
     A            CEOEDI         1S 0       TEXT('Ordrebekr. på EDI')
     A                                      COLHDG('Ordrebekr.' 'EDI')
     A            CEPEDI         1S 0       TEXT('Pakkseddel på EDI')
     A                                      COLHDG('Pakkseddel' 'EDI')
     A            CEFEDI         1S 0       TEXT('Faktura på EDI')
     A                                      COLHDG('Fakt.' 'EDI')
      *
8.01 A            CEOEMN         8S 0       TEXT('Ordrebekr. EDI meldingsnr')
     A                                      COLHDG('Ordrebekr EDI' 'meldingsnr')
     A            CEOEMS         1A         TEXT('Ordrebekr. EDI mld.status')
     A                                      COLHDG('Ordrebekr EDI' 'mld.sts')
     A            CEOAVB         1S 0       TEXT('Ordrebekr. avvik bestilling')
     A                                      COLHDG('Ordrebekr.' 'avvik best.')
     A            CEOAVT         1S 0       TEXT('Ordrebekr. avvik totalsum')
     A                                      COLHDG('Ordrebekr.' 'avvik tot.sum')
8.01 A            CEPEMN         8S 0       TEXT('Pakkseddel EDI meldingsnr')
     A                                      COLHDG('Pakks. EDI' 'meldingsnr')
     A            CEPEMS         1A         TEXT('Pakkseddel EDI mld.status')
     A                                      COLHDG('Pakkseddel EDI' 'mld.sts')
     A            CEPAVB         1S 0       TEXT('Pakkseddel avvik bestilling')
     A                                      COLHDG('Pakkseddel' 'avvik best.')
     A            CEPAVT         1S 0       TEXT('Pakkseddel avvik totalsum')
     A                                      COLHDG('Pakkseddel' 'avvik tot.sum')
8.01 A            CEFEMN         8S 0       TEXT('Faktura EDI meldingsnr')
     A                                      COLHDG('Fakt. EDI' 'meldingsnr')
     A            CEFEMS         1A         TEXT('Faktura EDI mld.status')
     A                                      COLHDG('Fakt. EDI' 'mld.sts')
     A            CEFAVB         1S 0       TEXT('Faktura avvik bestilling')
     A                                      COLHDG('Faktura' 'avvik best.')
     A            CEFAVT         1S 0       TEXT('Faktura avvik totalsum')
     A                                      COLHDG('Faktura' 'avvik tot.sum')
      *
     A            CEKILD        20A         TEXT('Kilde')
     A                                      COLHDG('Kilde')
     A            CEINKJ        20A         TEXT('Innkjøper')
     A                                      COLHDG('Innkjøper')
     A            CESKAF         1S 0       TEXT('Skaffeordre')
     A                                      COLHDG('Skaffe' 'ordre')
     A            CEVLEV         6S 0       TEXT('Vareleverandør')
     A                                      COLHDG('Vare-' 'lev.')
     A            CEVLOR         9S 0       TEXT('Varelev. org.nr')
     A                                      COLHDG('Varelev.' 'org.nr')
     A            CEVLNA        35A         TEXT('Varelev. navn')
     A                                      COLHDG('Varelev. navn')
     A            CEVNLE         6S 0       TEXT('Varelev. Nobb deltakernr')
     A                                      COLHDG('Varelev.' 'Nobb lev.nr')
     A            CEFLEV         6S 0       TEXT('Fakturaleverandør')
     A                                      COLHDG('Fakt.' 'lev.')
     A            CEFLOR         9S 0       TEXT('Fakturalev. org.nr')
     A                                      COLHDG('Fakturalev.' 'org.nr')
     A            CEFLNA        35A         TEXT('Fakturalev. navn')
     A                                      COLHDG('Fakturalev. navn')
     A            CELADR         6S 0       TEXT('Leveringsadr.')
     A                                      COLHDG('Lev.' 'adr.')
     A            CELETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A            CEVARE        15A         TEXT('Varenummer')
     A                                      COLHDG('Varenr')
     A            CETEK1        35A         TEXT('Varetekst 1')
     A                                      COLHDG('Varetekst 1')
     A            CENOBB         8S 0       TEXT('Nobb-nummer')
     A                                      COLHDG('Nobbnr')
     A            CELVAR        15A         TEXT('Leverandørs varenr.')
     A                                      COLHDG('Lev. varenr.')
     A            CEVTYP         1A         TEXT('Varetype')
     A                                      COLHDG('VT')
     A            CELVRE         1S 0       TEXT('Lokalt vareregister')
     A                                      COLHDG('LV')
     A            CEKAVD         4S 0       TEXT('Avd. kjøp')
     A                                      COLHDG('Avd.' 'kjøp')
     A            CELAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A            CEBINR         8S 0       TEXT('Bilagsnummer')
     A                                      COLHDG('Bil.nr.')
     A            CELINE         4S 0       TEXT('Bilag linjenummer')
     A                                      COLHDG('Bilag' 'ln')
     A            CEBIDA          L         TEXT('Bilagsdato')
     A                                      COLHDG('Bil.dato')
     A            CEBTYP         2A         TEXT('Best.type')
     A                                      COLHDG('Best.' 'type')
     A            CEBENR         8S 0       TEXT('Best.nummer')
     A                                      COLHDG('Best.nr')
     A            CEBESU         6S 0       TEXT('Best.suffix')
     A                                      COLHDG('Best.' 'suf.')
     A            CEBELI         4S 0       TEXT('Best.linje')
     A                                      COLHDG('Best.' 'ln')
     A            CEBEDA          L         TEXT('Best.dato')
     A                                      COLHDG('Best.' 'dato')
     A            CEORNR         8S 0       TEXT('Ordrenr.')
     A                                      COLHDG('Ordrenr.')
     A            CEORSU         2S 0       TEXT('Ordre-suff')
     A                                      COLHDG('Ordre' 'suff.')
     A            CEORLI         4S 0       TEXT('Ordre-linje')
     A                                      COLHDG('Ordre' 'linje.')
     A            CEANTA        11S 3       TEXT('Antall')
     A                                      COLHDG('Antall')
     A            CEVENH         3A         TEXT('Enhet fra vare')
     A                                      COLHDG('Enhet' 'vare')
     A            CEBANT        11S 3       TEXT('Antall i best')
     A                                      COLHDG('Antall' 'best')
     A            CEBENH         3A         TEXT('Enhet fra best.')
     A                                      COLHDG('Enhet' 'best.')
     A            CEFAKR         1A         TEXT('Debet/Kredit')
     A                                      COLHDG('D/K')
     A            CESUMO        11S 2       TEXT('Sum opprinnlig')
     A                                      COLHDG('Sum opprinnlig')
     A            CESUMB        11S 2       TEXT('Sum brutto')
     A                                      COLHDG('Sum brutto')
     A            CESUMN        11S 2       TEXT('Sum netto')
     A                                      COLHDG('Sum netto')
     A            CESUMK        11S 2       TEXT('Sum kost')
     A                                      COLHDG('Sum kost')
     A            CERAB1        11S 2       TEXT('Sum rabatt 1')
     A                                      COLHDG('Sum rabatt 1')
     A            CERAB2        11S 2       TEXT('Sum rabatt 2')
     A                                      COLHDG('Sum rabatt 2')
     A            CERABO        11S 2       TEXT('Sum ordrerabatt')
     A                                      COLHDG('Sum ordrerabatt')
     A            CELEBO        11S 2       TEXT('Bonus fra leverandør')
     A                                      COLHDG('Lev.bonus')
     A            CEMVAK         1S 0       TEXT('Mva-kode')
     A                                      COLHDG('Mva' 'kode')
     A            CEKRES         1S 0       TEXT('Restkode')
     A                                      COLHDG('Rest' 'kode')
     A            CELDAT          L         TEXT('Ønsket leveringsdato')
     A                                      COLHDG('Ønsket ' 'lev.dato')
     A            CEMODA          L         TEXT('Bekreftet lev.dato')
     A                                      COLHDG('Bekr.' 'lev.dato')
     A            CEVIDA          L         TEXT('Virkelig lev.dato')
     A                                      COLHDG('Virk.' 'lev.dato')
     A            CEPUKE         2S 0       TEXT('Prognose uke')
     A                                      COLHDG('Uke')
     A            CEODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
      *
