      *
8.01  * 250621 bsa Utvidet linjenummer på EDI meldinger
      *
      * EDI forsendelseslogg
      *
     A          R CELGPFR
      *
     A            LOGIND         1A
     A            LOGTYP         4A
     A            LOGDAT          L
     A            LOGTID          T
8.01 A            LOGMNR         8S 0
     A            LOGREC        80A
      *
     A            CLFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A            CLPAAR         4S 0       TEXT('Periode-år')
     A                                      COLHDG('Periode' 'år')
     A            CLBENR         8S 0       TEXT('Best.nummer')
     A                                      COLHDG('Best.nr')
      *
