      *
      * EDI forsendelseslogg
      *
     A          R CELGPFR                   PFILE(*LIBL/CELGPF)
      *
     A          K LOGIND
     A          K LOGTYP
     A          K CLFIRM
     A          K CLPAAR
     A          K CLBENR
