      *
      * Internett vare og prisfil
      *
     A          R CINTPFR
     A            BM_INT       520A         TEXT('Internett')
     A                                      COLHDG('Internett')
      *
