      *
      * Kjede klasifiserings koblinger - oppslag kundekaegori
      *
     A          R CKGRPFR                   PFILE(*LIBL/CKGRPF)
      *
     A          K CKGFIR
     A          K CKGKAT
