      *
      * Kjede klasifiserings tekster
      *
     A          R CKKLPFR                   PFILE(*LIBL/CKKLPF)
      *
     A          K CKKFIR
     A          K CKKKLA
