      *
      * Kjede klasifiserings tekster
      *
     A          R CKKLPFR
     A            CKKFIR         3S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            CKKKLA         2S 0
     A                                      TEXT('Kjedeklasifisering')
     A                                      COLHDG('Kjedeklasifisering')
     A            CKKTXT        30A
     A                                      TEXT('Klasifiseringstekst')
     A                                      COLHDG('Klasifiseringstekst')
     A            CKKJKO         2A
     A                                      TEXT('Kjedekobling')
     A                                      COLHDG('Kjedekobling')
     A            CKKTYP         1A
     A                                      TEXT('Kjedetype')
     A                                      COLHDG('Kjedetype')
     A            CKKODA          L         TEXT('Opprettet dato')
     A            CKKOTI          T         TEXT('Opprettet tidspkt')
     A            CKKOUS        10A         TEXT('Opprettet av')
     A            CKKEDA          L         TEXT('Endringsdato')
     A            CKKETI          T         TEXT('Endringstidspunkt')
     A            CKKEUS        10A         TEXT('Endret av')
