      *
      * MAP verdivurdering
      *
     A          R CMAPPFR                   PFILE(*LIBL/CMAPPF)
      *
     A          K CMFIRM
     A          K CMLAGE
     A          K CMVARE
     A          K CMKDAT                    DESCEND
