      *
      * MAP verdivurdering
      *
     A          R CMAPPFR                   PFILE(*LIBL/CMAPPF)
      *
     A          K CMFIRM
     A          K CMVARE
