      *
      * Sesong varegrupper (varegrupper med sesongvarer)
      *
     A          R CSESPFR
      *
     A            CSOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogr')
     A            CSHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgr')
     A            CSUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugr')
