      *
      * Sesong varegrupper (varegrupper med sesongvarer)
      *
     A          R CSESPFR                   PFILE(*LIBL/CSESPF)
      *
     A          K CSOGRP
     A          K CSHGRP
     A          K CSUGRP
