      *
      * Readiness vareinformasjon
      *
     A          R CVARPFR
      *
     A            CVFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
      *
     A            CVVARE         8A         TEXT('Varenr')
     A                                      COLHDG('Varenr')
     A            CVNOBB         8S 0       TEXT('Nobbnr')
     A                                      COLHDG('Nobbnr')
     A            CVTEK1        35A         TEXT('Varetekst-1')
     A                                      COLHDG('Varetekst-1')
     A            CVVTYP         1A         TEXT('Varetype')
     A                                      COLHDG('Varetype')
     A            CVLDOR         6S 0       TEXT('Leverandør')
     A                                      COLHDG('Lev.nr')
     A            CVLNAV        35A         TEXT('Leverandørnavn')
     A                                      COLHDG('Leverandør')
     A            CVNLEV         6S 0       TEXT('Nobb deltakernr hovedlev')
     A                                      COLHDG('Nobb deltakernr' 'hovedlev')
     A            CVKBLE         1S 0       TEXT('Overstyrt best.lev')
     A                                      COLHDG('Best.lev')
     A*                                     1=Ja, 0=Nei
     A            CVLVAR        15A         TEXT('Lev.varenr')
     A                                      COLHDG('Lev.varenr')
     A            CVOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogr')
     A            CVHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgr')
     A            CVUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugr')
     A            CVKSES         2A         TEXT('Sesongkode')
     A                                      COLHDG('Sesong')
     A*                                     S=Vår/sommer
     A*                                     V=Høst/vinter
     A            CVIENH         3A         TEXT('Innkjøpsenhet')
     A                                      COLHDG('Innkj' 'enhet')
     A            CVLENH         3A         TEXT('Lagerenhet')
     A                                      COLHDG('Lager' 'enhet')
     A            CVOFAK        12S 6       TEXT('Omr.faktor')
     A                                      COLHDG('Omr.faktor')
     A            CVODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr. dato')
     A            CVUDAT          L         TEXT('Utgår dato')
     A                                      COLHDG('Utgår dato')
      *
     A            CVINPR         9S 2       TEXT('Innkjøpspris')
     A                                      COLHDG('Innkj.pris')
     A            CVKOPR         9S 2       TEXT('Kostpris')
     A                                      COLHDG('Kostpris')
     A            CVSAPR         9S 2       TEXT('Salgspris')
     A                                      COLHDG('Salgspris')
     A            CVSAIM         9S 2       TEXT('Salgspris inkl.mva')
     A                                      COLHDG('Salgspris' 'inkl.mva')
      *
     A            CVOM12        13S 2       TEXT('Omsetning 12 mnd')
     A                                      COLHDG('Omsetning' '12 mnd')
     A            CVAS12         9S 0       TEXT('Antall salg 12 mnd')
     A                                      COLHDG('Antall salg' '12 mnd')
     A            CVAN12        13S 3       TEXT('Antall solgt 12 mnd')
     A                                      COLHDG('Antall solgt' '12 mnd')
     A            CVAN06        13S 3       TEXT('Antall solgt 6 mnd')
     A                                      COLHDG('Antall solgt' '6 mnd')
     A            CVAF03        13S 3       TEXT('Antall solgt 3 mnd i fjor')
     A                                      COLHDG('Antall solgt' '3 mnd fjor')
     A            CVAN03        13S 3       TEXT('Antall solgt 3 mnd')
     A                                      COLHDG('Antall solgt' '3 mnd')
     A            CVAN01        13S 3       TEXT('Antall solgt 1 mnd')
     A                                      COLHDG('Antall solgt' '1 mnd')
     A            CVFDAT          L         TEXT('Første salgsdato')
     A                                      COLHDG('Første' 'salgsdato')
     A            CVSDAT          L         TEXT('Siste salgsdato')
     A                                      COLHDG('Siste' 'salgsdato')
     A            CVIDAT          L         TEXT('Siste innkjøpsdato')
     A                                      COLHDG('Siste' 'innkjøpsdato')
     A            CVFVDA          L         TEXT('Første varemottaksdato')
     A                                      COLHDG('Første' 'varemottaksdato')
     A            CVSVDA          L         TEXT('Siste varemottaksdato')
     A                                      COLHDG('Siste' 'varemottaksdato')
      *
     A            CVDA01          L         TEXT('Startdato uke 1')
     A                                      COLHDG('Startdato' 'uke 1')
     A            CVAU01        11S 3       TEXT('Antall solgt uke 1')
     A                                      COLHDG('Antall solgt' 'uke 1')
     A            CVAU02        11S 3       TEXT('Antall solgt uke 2')
     A                                      COLHDG('Antall solgt' 'uke 2')
     A            CVAU03        11S 3       TEXT('Antall solgt uke 3')
     A                                      COLHDG('Antall solgt' 'uke 3')
     A            CVAU04        11S 3       TEXT('Antall solgt uke 4')
     A                                      COLHDG('Antall solgt' 'uke 4')
     A            CVAU05        11S 3       TEXT('Antall solgt uke 5')
     A                                      COLHDG('Antall solgt' 'uke 5')
     A            CVAU06        11S 3       TEXT('Antall solgt uke 6')
     A                                      COLHDG('Antall solgt' 'uke 6')
     A            CVAU07        11S 3       TEXT('Antall solgt uke 7')
     A                                      COLHDG('Antall solgt' 'uke 7')
     A            CVAU08        11S 3       TEXT('Antall solgt uke 8')
     A                                      COLHDG('Antall solgt' 'uke 8')
     A            CVAU09        11S 3       TEXT('Antall solgt uke 9')
     A                                      COLHDG('Antall solgt' 'uke 9')
     A            CVAU10        11S 3       TEXT('Antall solgt uke 10')
     A                                      COLHDG('Antall solgt' 'uke 10')
     A            CVAU11        11S 3       TEXT('Antall solgt uke 11')
     A                                      COLHDG('Antall solgt' 'uke 11')
     A            CVAU12        11S 3       TEXT('Antall solgt uke 12')
     A                                      COLHDG('Antall solgt' 'uke 12')
     A            CVAU13        11S 3       TEXT('Antall solgt uke 13')
     A                                      COLHDG('Antall solgt' 'uke 13')
     A            CVAU14        11S 3       TEXT('Antall solgt uke 14')
     A                                      COLHDG('Antall solgt' 'uke 14')
     A            CVAU15        11S 3       TEXT('Antall solgt uke 15')
     A                                      COLHDG('Antall solgt' 'uke 15')
     A            CVAU16        11S 3       TEXT('Antall solgt uke 16')
     A                                      COLHDG('Antall solgt' 'uke 16')
     A            CVAU17        11S 3       TEXT('Antall solgt uke 17')
     A                                      COLHDG('Antall solgt' 'uke 17')
     A            CVAU18        11S 3       TEXT('Antall solgt uke 18')
     A                                      COLHDG('Antall solgt' 'uke 18')
     A            CVAU19        11S 3       TEXT('Antall solgt uke 19')
     A                                      COLHDG('Antall solgt' 'uke 19')
     A            CVAU20        11S 3       TEXT('Antall solgt uke 20')
     A                                      COLHDG('Antall solgt' 'uke 20')
     A            CVAU21        11S 3       TEXT('Antall solgt uke 21')
     A                                      COLHDG('Antall solgt' 'uke 21')
     A            CVAU22        11S 3       TEXT('Antall solgt uke 22')
     A                                      COLHDG('Antall solgt' 'uke 22')
     A            CVAU23        11S 3       TEXT('Antall solgt uke 23')
     A                                      COLHDG('Antall solgt' 'uke 23')
     A            CVAU24        11S 3       TEXT('Antall solgt uke 24')
     A                                      COLHDG('Antall solgt' 'uke 24')
     A            CVAU25        11S 3       TEXT('Antall solgt uke 25')
     A                                      COLHDG('Antall solgt' 'uke 25')
     A            CVAU26        11S 3       TEXT('Antall solgt uke 26')
     A                                      COLHDG('Antall solgt' 'uke 26')
     A            CVAU27        11S 3       TEXT('Antall solgt uke 27')
     A                                      COLHDG('Antall solgt' 'uke 27')
     A            CVAU28        11S 3       TEXT('Antall solgt uke 28')
     A                                      COLHDG('Antall solgt' 'uke 28')
     A            CVAU29        11S 3       TEXT('Antall solgt uke 29')
     A                                      COLHDG('Antall solgt' 'uke 29')
     A            CVAU30        11S 3       TEXT('Antall solgt uke 30')
     A                                      COLHDG('Antall solgt' 'uke 30')
     A            CVAU31        11S 3       TEXT('Antall solgt uke 31')
     A                                      COLHDG('Antall solgt' 'uke 31')
     A            CVAU32        11S 3       TEXT('Antall solgt uke 32')
     A                                      COLHDG('Antall solgt' 'uke 32')
     A            CVAU33        11S 3       TEXT('Antall solgt uke 33')
     A                                      COLHDG('Antall solgt' 'uke 33')
     A            CVAU34        11S 3       TEXT('Antall solgt uke 34')
     A                                      COLHDG('Antall solgt' 'uke 34')
     A            CVAU35        11S 3       TEXT('Antall solgt uke 35')
     A                                      COLHDG('Antall solgt' 'uke 35')
     A            CVAU36        11S 3       TEXT('Antall solgt uke 36')
     A                                      COLHDG('Antall solgt' 'uke 36')
     A            CVAU37        11S 3       TEXT('Antall solgt uke 37')
     A                                      COLHDG('Antall solgt' 'uke 37')
     A            CVAU38        11S 3       TEXT('Antall solgt uke 38')
     A                                      COLHDG('Antall solgt' 'uke 38')
     A            CVAU39        11S 3       TEXT('Antall solgt uke 39')
     A                                      COLHDG('Antall solgt' 'uke 39')
     A            CVAU40        11S 3       TEXT('Antall solgt uke 40')
     A                                      COLHDG('Antall solgt' 'uke 40')
     A            CVAU41        11S 3       TEXT('Antall solgt uke 41')
     A                                      COLHDG('Antall solgt' 'uke 41')
     A            CVAU42        11S 3       TEXT('Antall solgt uke 42')
     A                                      COLHDG('Antall solgt' 'uke 42')
     A            CVAU43        11S 3       TEXT('Antall solgt uke 43')
     A                                      COLHDG('Antall solgt' 'uke 43')
     A            CVAU44        11S 3       TEXT('Antall solgt uke 44')
     A                                      COLHDG('Antall solgt' 'uke 44')
     A            CVAU45        11S 3       TEXT('Antall solgt uke 45')
     A                                      COLHDG('Antall solgt' 'uke 45')
     A            CVAU46        11S 3       TEXT('Antall solgt uke 46')
     A                                      COLHDG('Antall solgt' 'uke 46')
     A            CVAU47        11S 3       TEXT('Antall solgt uke 47')
     A                                      COLHDG('Antall solgt' 'uke 47')
     A            CVAU48        11S 3       TEXT('Antall solgt uke 48')
     A                                      COLHDG('Antall solgt' 'uke 48')
     A            CVAU49        11S 3       TEXT('Antall solgt uke 49')
     A                                      COLHDG('Antall solgt' 'uke 49')
     A            CVAU50        11S 3       TEXT('Antall solgt uke 50')
     A                                      COLHDG('Antall solgt' 'uke 50')
     A            CVAU51        11S 3       TEXT('Antall solgt uke 51')
     A                                      COLHDG('Antall solgt' 'uke 51')
     A            CVAU52        11S 3       TEXT('Antall solgt uke 52')
     A                                      COLHDG('Antall solgt' 'uke 52')
      *
     A            CVLAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A            CVBEHL        11S 3       TEXT('Beholdning')
     A                                      COLHDG('Beholdning')
     A            CVOORD        11S 3       TEXT('I ordre')
     A                                      COLHDG('I ordre')
     A            CVBBES        11S 3       TEXT('I bestilling')
     A                                      COLHDG('I bestilling')
     A            CVLDAT          L         TEXT('Lagerført dato')
     A                                      COLHDG('Lagerført' 'dato')
      *
     A            CVMINI        11S 3       TEXT('Min lager')
     A                                      COLHDG('Min lager')
     A            CVMAKS        11S 3       TEXT('Max lager')
     A                                      COLHDG('Max lager')
     A            CVHMIN        11S 3       TEXT('Hyllemin')
     A                                      COLHDG('Hyllemin')
     A            CVHMAX        11S 3       TEXT('Hyllemax')
     A                                      COLHDG('Hyllemax')
     A            CVANBR        11S 3       TEXT('Anbrekk')
     A                                      COLHDG('Anbrekk')
     A            CVLTID         3S 0       TEXT('Leveringstid')
     A                                      COLHDG('Leveringstid')
     A            CVRDAT          L         TEXT('iKalk sperredato')
     A                                      COLHDG('iKalk' 'sperredato')
     A            CVTEDA          L         TEXT('Siste telledato')
     A                                      COLHDG('Siste' 'telledato')
     A            CVLOKA         8A         TEXT('Lokasjon')
     A                                      COLHDG('Lokasjon')
      *
     A            CVEVAR         8A         TEXT('Erstatter vare (gml. varenr)')
     A                                      COLHDG('Gml. varenr')
     A            CVEFID          L         TEXT('Første innkj.dato')
     A                                      COLHDG('Første' 'innkj.dato')
     A            CVESID          L         TEXT('Siste innkj.dato')
     A                                      COLHDG('Siste' 'innkj.dato.')
     A            CVEOMR        12S 6       TEXT('Omr.faktor gml.vare')
     A                                      COLHDG('Omr.faktor' 'gml.vare')
