     A*
     A*  ASBANK Koblingsfile for ADRA:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R DADRPFR
     A            DYFILG    R               REFFLD(GDHFGR)
     A            DYFIRM    R               REFFLD(RBFIRM)
     A            DYHBOK    R               REFFLD(RBKONT)
     A            DYAVDE    R               REFFLD(RBAVDE)
