     A*
     A*  ASBANK Kontoinformasjon bank, (konto+bokf.dato)
     A*
     A          R DBNKPFR                   PFILE(DBNKPF)
     A*
     A* Nøkkel
     A*
     A          K DBBKON
     A          K DBBDAT
