     A*
     A*  ASBANK Kontoinformasjon bank, (konto+løpenummer)
     A*
     A          R DBNKPFR                   PFILE(DBNKPF)
     A*
     A* Nøkkel
     A*
     A          K DBBKON
     A          K DBBDAT
     A          K DBVDAT
     A          K DBTEKS
     A          K DBREF1
     A          K DBREF2
     A          K DBREF3
     A          K DBREF4
     A          K DBREF5
     A          K DBREF6
     A          K DBBELP
