     A*
     A*  ASBANK Kontoinformasjon bank, logisk update
     A*
     A          R DBNKPFR                   PFILE(DBNKPF)
     A*
     A* Nøkkel
     A*
     A          K DBBKON
E5.00A          K DBTIST
     A* ******
     A* SELECT
     A* ******
     A* Velger kun poster som tidligere ikke er avstemt.
     A*
     A          S DBAVST                    COMP(EQ ' ')
