     A*
     A*  ASBANK Kontoinformasjon bank, fysisk file.
     A*
     A                                      REF(*LIBL/RFRF)
     A          R DBNKPFR
     A            DBSTAT    R
     A            DBBKON    R
     A            DBTIST    R
     A            DBBDAT    R
     A            DBVDAT    R
     A            DBTEKS    R
     A            DBREF1    R
     A            DBREF2    R
     A            DBREF3    R
     A            DBREF4    R
     A            DBREF5    R
     A            DBREF6    R
     A            DBBELP    R
     A            DBSALD    R
     A            DBAVST    R
