     A*
     A*  ASBANK Kontoinformasjon bank, logisk update
     A*
     A          R DBNKPFR                   PFILE(DBNKPF)
     A*
     A* Nøkkel
     A*
     A          K DBBKON
E5.00A          K DBTIST
