     A*
     A*  ASBANK Kontoinformasjon bank, (konto+løpenummer)
     A*
     A          R DDKIPFR                   PFILE(DDKIPF)
     A*
     A* Nøkkel
     A*
     A          K DCMOÅR
     A          K DCMOMN
