     A*
     A*  ASBANK Kontoinformasjon bank, fysisk file.
     A*
     A                                      REF(*LIBL/RFRF)
     A          R DDKIPFR
     A            DCSTAT    R
     A            DCBKON    R
     A            DCTIST    R
     A            DCBDAT    R
     A            DCVDAT    R
     A            DCTEKS    R
     A            DCREF1    R
     A            DCREF2    R
     A            DCREF3    R
     A            DCREF4    R
     A            DCREF5    R
     A            DCREF6    R
     A            DCBELP    R
     A            DCSALD    R
     A            DCAVST    R
     A            DCNREF    R
     A            DCAREF    R
     A            DCMOÅR    R
     A            DCMOMN    R
