     A*
     A*  ASBANK Kontoinformasjon bank, (konto+løpenummer)
     A*
     A          R DDKIPFR                   PFILE(DDKIPF)
     A*
     A* Nøkkel
     A*
     A          K DCBKON
     A          K DCBDAT
     A          K DCVDAT
     A          K DCTEKS
     A          K DCREF1
     A          K DCREF2
     A          K DCREF3
     A          K DCREF4
     A          K DCREF5
     A          K DCREF6
     A          K DCBELP
     A          K DCNREF
     A          K DCAREF
