     A*
     A*  ASBANK Kontoinformasjon mottatt dobbelt, fysisk file.
     A*
     A                                      REF(*LIBL/RFRF)
     A          R DDOBPFR
     A            DESTAT    R
     A            DEBKON    R
     A            DETIST    R
     A            DEBDAT    R
     A            DEVDAT    R
     A            DETEKS    R
     A            DEREF1    R
     A            DEREF2    R
     A            DEREF3    R
     A            DEREF4    R
     A            DEREF5    R
     A            DEREF6    R
     A            DEBELP    R
     A            DESALD    R
     A            DEAVST    R
     A            DEDATO    R
     A            DEKLOK    R
