     A*
     A*  ASBANK Kontoinformasjon mottatt dobbelt.
     A*
     A          R DDOBPFR                   PFILE(DDOBPF)
     A*
     A* Nøkkel
     A*
     A          K DEBKON
     A          K DEDATO
     A          K DEKLOK
     A          K DEBDAT
