     A*
     A*  ASBANK Kontoinformasjon mottatt dobbelt, logisk update
     A*
     A          R DDOBPFR                   PFILE(DDOBPF)
     A*
     A* Nøkkel
     A*
     A          K DEBKON
E5.00A          K DETIST
