     A*
     A*  ASBANK Faste data/Koblingsfil, logisk update
     A*
     A          R DFASPFR                   PFILE(DFASPF)
     A*
     A* Nøkkel
     A*
     A          K DAFIGR
     A          K DAFIRM
     A          K DABKON
