     A*
     A*  ASBANK Kontoinformasjon Hovedbok til avstemming
     A*
     A          R DHTRPFR                   PFILE(DHTRPF)
     A*
     A* Nøkkel
     A*
     A          K DDFIRM
     A          K DDHBOK
     A          K DDAVDE
     A          K DDSPES
     A          K DDREFR
     A          K DDBDAT
     A          K DDBELP
     A          K DDBELK
     A*
     A* Tar med poster som ikke er tatt med til avstemming tidligere,
     A* ELLER poster som er tatt med på rapporttype:
     A*     --> "A", "B"
     A*
     A          S DDRTYP                    COMP(EQ ' ')
     A          S DDRTYP                    COMP(EQ 'A')
     A          S DDRTYP                    COMP(EQ 'B')
