     A*
     A*  ASBANK Kontoinformasjon hovedbok til avstemming
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
     A*
     A                                      REF(*LIBL/RFRF)
     A          R DHTRPFR
     A            DDFIRM    R
     A            DDHBOK    R
     A            DDBDAT    R
     A            DDTIST    R
     A            DDBILN    R
     A            DDTEXT    R
     A            DDREFR    R
     A            DDBELP    R
     A            DDBELK    R
     A            DDREFA    R
     A            DDREFB    R
     A            DDAVST    R
     A            DDRTYP    R
     A            DDRAAR    R
     A            DDSPES    R
     A            DDAVDE    R
     A            DDRPER    R
     A            DDMKRY    R
     A            DDUSER    R
     A            DDDKRY    R
     A            DDTKRY    R
      * Nøkkel
     A          K DDFIRM
     A          K DDHBOK
     A          K DDAVDE
     A          K DDSPES
     A          K DDBDAT
     A          K DDTIST
     A          K DDBILN
