     A*
     A*  ASBANK Kontoinformasjon Hovedbok til avstemming
     A*
     A          R DHTRPFR                   PFILE(DHTRPF)
     A*
     A* Nøkkel
     A*
     A          K DDFIRM
     A          K DDHBOK
     A          K DDAVDE
     A          K DDSPES
     A          K DDAVST
     A          K DDRTYP
     A*
     A* Kun poster som er tatt med til avstemming tidligere,
     A* vil bli tatt med i denne "Selekten":
     A*
     A          O DDRTYP                    COMP(EQ ' ')
