     A*
     A*  ASBANK Kontoinformasjon Hovedbok til avstemming
     A*
     A          R DHTRPFR                   PFILE(DHTRPF)
     A*
     A* Nøkkel
     A*
     A          K DDFIRM
     A          K DDRAAR
     A          K DDAVDE
     A          K DDHBOK
     A          K DDSPES
     A          K DDRPER
