     A* Parameterfil for ICF-kommunikasjon
     A*
     A          R IEDATA
     A            IEKEY          2A
     A            IESACC         8A
     A            IESUID         8A
     A            IESPWD         8A
     A            IEMACC         8A
     A            IEMUID         8A
     A            IESMSG         8A
     A            IEMMSG         8A
     A            IENITR        80A
     A            IEPART         3A
     A* Key-felt (IE)
     A          K IEKEY
