     A*  DIRREM - Remittering til bank
     A*
     A                                      REF(*LIBL/RFRF)
     A          R DIRREMFR
     A            GDQREM    R
