     A*
     A*  ASBANK Kontoinformasjon Bank til avstemming
     A*
     A                                      REF(*LIBL/RFRF)
     A          R DKTRPFR
     A            DCFIRM    R
     A            DCBKON    R
     A            DCTIST    R
     A            DCBDAT    R
     A            DCVDAT    R
     A            DCTEKS    R
     A            DCBBSR    R
     A            DCREFR    R
     A            DCBELP    R
     A            DCBELK    R
     A            DCSALD    R
     A            DCREFA    R
     A            DCREFB    R
     A            DCREFC    R
     A            DCREFD    R
     A            DCAVST    R
     A            DCRTYP    R
     A            DCMKRY    R
     A            DCUSER    R
     A            DCDKRY    R
     A            DCTKRY    R
      * Nøkkel
     A          K DCFIRM
     A          K DCBKON
     A          K DCTIST
