     A*
     A*  ASBANK Kontoinformasjon Bank til avstemming
     A*
     A          R DKTRPFR                   PFILE(DKTRPF)
     A*
     A* Nøkkel
     A*
     A          K DCFIRM
     A          K DCBKON
     A          K DCBDAT
     A          K DCBELP
     A          K DCBELK
     A*
     A* Tar med poster som ikke er tatt med til avstemming tidligere,
     A* ELLER poster som er tatt med på rapporttype:
     A*     --> "J" (MANUELLE LISTER)
     A*
     A          S DCRTYP                    COMP(EQ ' ')
     A          S DCRTYP                    COMP(EQ 'J')
