     A*
     A*  ASBANK Kontoinformasjon Bank til avstemming
     A*
     A          R DKTRPFR                   PFILE(DKTRPF)
      * Nøkkel
     A          K DCFIRM
     A          K DCBKON
     A          K DCTIST
