6.13  * R6.13 110603 NHO  Ny fil i forb. med sporingsref og avkr. ref. ttet
6.13  *                                                                tt og
     A*
     A          R DSTRPFR                   PFILE(DSTRPF)
     A*
     A* Nøkkel
     A*
     A          K DSFIRM
     A          K DSSPOR
     A          K DSAVKR
