      *
      * Kreditering av bonus - parameterliste
      *
     A          R EBKRPFR
     A            EBKFIR         3S 0       TEXT('Firma')
     A            EBKBOT         2A         TEXT('Bonustype')
     A            EBKPFR         4S 0       TEXT('Fra periode')
     A            EBKPTI         4S 0       TEXT('Til periode')
     A            EBKOTY         2A         TEXT('Ordretype')
     A            EBKVAR         8A         TEXT('Varenummer')
     A            EBKTX1        70A         TEXT('Tekst 1')
     A            EBKTX2        70A         TEXT('Tekst 2')
     A            EBKTX3        70A         TEXT('Tekst 3')
     A            EBKTX4        70A         TEXT('Tekst 4')
     A            EBKSKD          L         TEXT('Siste kjøredato')
     A            EBKSKT          T         TEXT('Siste kjøretidspkt')
     A            EBKEDA          L         TEXT('Endringsdato')
     A            EBKETI          T         TEXT('Endringstidspunkt')
     A            EBKEUS        10A
      *
