      *
      * EDI bestilling linje - kopi
      *
     A          R EDDTPFR                   PFILE(*LIBL/EDDTPF)
      *
     A          K EDFIRM
     A          K EDONUM
     A          K EDOSUF
     A          K EDOLIN
