      *
      * EDI Bestilling linje - kopi
      *
     A          R EDDTPFR                   PFILE(*LIBL/EDDTPF)
      *
     A          K EDFIRM
     A          K EDFSYS
     A          K EDTELL
     A          K EDLDOR
     A          K EDLDAT
     A          K EDLINE
