      *
      * EDI Bestilling hode - kopi tillegg
      *
     A          R EDH2PFR                   PFILE(*LIBL/EDH2PF)
      *
     A          K E2FIRM
     A          K E2FSYS
     A          K E2TELL
