      *
      * Ekstern ordre-hode
      *
     A                                      REF(*LIBL/FFRF)
     A          R EDHEPFR
     A            EOFIRM    R
     A            EOFSYS    R
     A            EOTELL    R
     A            EONREF    R
     A            EOFRSP    R
     A            EOLAGE    R
     A            EOAVDE    R
     A            EOUSER    R
     A            EOLDOR    R
     A            EOKUND    R
     A            EOKNAV    R
     A            EOKPRO    R
     A            EOPNAV    R
     A            EONAVN    R
     A            EOADR1    R
     A            EOADR2    R
     A            EOPONR    R
     A            EOSTED    R
     A            EOLETY    R
     A            EOLDAT    R
     A            EODREF    R
     A            EOREKV    R
     A            EOUNAV    R
     A            EOUTLF    R
     A            EOUMOB    R
     A            EOUFAX    R
     A            EOUMAI    R
     A            EOMELD    R
     A            EONUMM    R
     A            EOSUFF    R
     A            EOLMAT    R
     A            EOBDAT    R
     A            EOIVGL    R
     A            EOSUGL    R
     A            EOBYGL    R
     A            EODPGL    R
     A            EOODAT    R
     A            EOOTIM    R
     A            EOOUSR    R
     A            EOEDAT    R
     A            EOETIM    R
     A            EOEUSR    R
