      *
      * EDI Bestilling hode - kopi
      *
     A          R EDHEPFR                   PFILE(*LIBL/EDHEPF)
      *
     A          K EOFIRM
     A          K EOFSYS
     A          K EOTELL
     A          K EOLDOR
     A          K EOLDAT
