      *
      * Ekstern ordre-linje tekstlinjer
      *
     A                                      REF(*LIBL/FFRF)
     A          R EDTXPFR
     A            ETFIRM    R
     A            ETFSYS    R
     A            ETTELL    R
     A            ETLINE    R
     A            ETTLIN    R
     A            ETONUM    R
     A            ETOSUF    R
     A            ETOLIN    R
     A            ETNREF    R
     A            ETLDOR    R
     A            ETNLIN    R
     A            ETLDAT    R
     A            ETTYPE    R
     A            ETTEK1    R
     A            ETODAT    R
     A            ETOTIM    R
     A            ETOUSR    R
     A            ETEDAT    R
     A            ETETIM    R
     A            ETEUSR    R
