      *
      * EDI bestilling linje - kopi
      *
     A          R EDTXPFR                   PFILE(*LIBL/EDTXPF)
      *
     A          K ETFIRM
     A          K ETFSYS
     A          K ETTELL
     A          K ETLDOR
     A          K ETLDAT
     A          K ETLINE
     A          K ETTYPE
     A          K ETTLIN
