     A*  Posteringer - Kunder, Logisk file for update
     A*
     A                                      UNIQUE
     A          R ELF4PFR                   PFILE(ELF4PF)
     A* Nøkkel
     A          K E4TYPE
     A          K E4TEXT
