      *
      * EDI FAKTURA LOGG
      *
6.30  * UTVIDET MED FLERE FELTER GRUNNET FEILHÅNDTERING
8.01  * Utvidet løpenumemrserie på EDI meldinger
      *
     A          R ELOGPFR
     A            XLFIRM      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            XLFAAR      0004S 0
     A                                      TEXT('Faktura år')
     A                                      COLHDG('Faktura år')
     A            XLTYPE      0004A
     A                                      TEXT('Type')
     A                                      COLHDG('Type')
     A            XLLEAN      0013S 0
     A                                      TEXT('EAN-leverandør')
     A                                      COLHDG('EAN-leverand.')
     A            XLREFN      0035A
     A                                      TEXT('Referansenummer')
     A                                      COLHDG('Referansenummer')
     A            XLLEVN      0006S 0
     A                                      TEXT('Leverandørnummer')
     A                                      COLHDG('Lever.')
     A            XLMDA1          L
     A                                      TEXT('Mot1.dato')
     A                                      COLHDG('Mot1.dato')
     A            XLMTI1          T
     A                                      TEXT('Mot1.tid')
     A                                      COLHDG('Mot1.tid')
     A            XLMDA2          L
     A                                      TEXT('Mot2.dato')
     A                                      COLHDG('Mot2.dato')
     A            XLMTI2          T
     A                                      TEXT('Mot2.tid')
     A                                      COLHDG('Mot2.tid')
     A            XLMDA3          L
     A                                      TEXT('Mot3.dato')
     A                                      COLHDG('Mot3.dato')
     A            XLMTI3          T
     A                                      TEXT('Mot3.tid')
     A                                      COLHDG('Mot3.tid')
     A            XLMOTT      0001S 0
     A                                      TEXT('Mottatt (LWERPF)')
     A                                      COLHDG('Mottatt (LWERPF)')
     A            XLSPLI      0001S 0
     A                                      TEXT('Splittet (LWEFPF)')
     A                                      COLHDG('Splittet (LWEFPF)')
     A            XLOVRF      0001S 0
     A                                      TEXT('Overført (LEDIPF)')
     A                                      COLHDG('Overført (LEDIPF)')
     A            XLOPDA      0001S 0
     A                                      TEXT('Oppdatert')
     A                                      COLHDG('Oppdatert')
8.01 A            XLMNUM      0008S 0
     A                                      TEXT('EDI-løpenummer')
     A                                      COLHDG('EDI-løpenummer')
6.30 A            XLNUMM      0008S 0
6.30 A                                      TEXT('Meldingsnr')
6.30 A                                      COLHDG('Meldingsnr')
6.30 A            XLSPES      0001S 0
6.30 A                                      TEXT('Spesialkode')
6.30 A                                      COLHDG('Såesialkode')
6.30 A            XLSTAT      0002A
6.30 A                                      TEXT('Status')
6.30 A                                      COLHDG('Status')
6.30 A            XLEROR      0002A
6.30 A                                      TEXT('Årsakskode')
6.30 A                                      COLHDG('Årsakskode')
6.30 A            XLMERK      0128A
6.30 A                                      TEXT('Beskrivelse')
6.30 A                                      COLHDG('Beskrivelse')
6.30 A            XLGODD          L
6.30 A                                      TEXT('Godkjent dato')
6.30 A                                      COLHDG('Godkjent dato')
6.30 A                                      DFT('0001-01-01')
6.30 A            XLGODT          T
6.30 A                                      TEXT('Godkjent tid')
6.30 A                                      COLHDG('Godkjent tid')
6.30 A                                      DFT('00.00.00')
6.30 A            XLGODU      0010A
6.30 A                                      TEXT('Godkjent av')
6.30 A                                      COLHDG('Godkjent av')
6.30 A            XLAVSD          L
6.30 A                                      TEXT('Avslått dato')
6.30 A                                      COLHDG('Avslått av')
6.30 A                                      DFT('0001-01-01')
6.30 A            XLAVST          T
6.30 A                                      TEXT('Avslått tid')
6.30 A                                      COLHDG('Avslått tid')
6.30 A                                      DFT('00.00.00')
6.30 A            XLAVSU      0010A
6.30 A                                      TEXT('Avslått av')
6.30 A                                      COLHDG('Avslått av')
6.30 A            XLSKRD          L
6.30 A                                      TEXT('Utskrevet dato')
6.30 A                                      COLHDG('Utskrevet tid')
6.30 A                                      DFT('0001-01-01')
6.30 A            XLSKRT          T
6.30 A                                      TEXT('Utskrevet tid')
6.30 A                                      COLHDG('Utskrevet tid')
6.30 A                                      DFT('00.00.00')
6.30 A            XLSKRU      0010A
6.30 A                                      TEXT('Utskrevet av')
6.30 A                                      COLHDG('Utskrevet av')
6.30 A            XLODAT          L
6.30 A                                      TEXT('Opprettet dato')
6.30 A                                      COLHDG('Opprettet dato')
6.30 A                                      DFT('0001-01-01')
6.30 A            XLOTIM          T
6.30 A                                      TEXT('Opprettet tid')
6.30 A                                      COLHDG('Opprettet tid')
6.30 A                                      DFT('00.00.00')
6.30 A            XLOUSR      0010A
6.30 A                                      TEXT('Opprettet av')
6.30 A                                      COLHDG('Opprettet av')
