      *
      * EDI FAKTURA LOGG                INDEX=LEV.EANNR,FAKTURANR
      *
     A          R ELOGPFR
     A                                      PFILE(*LIBL/ELOGPF)
     A          K XLFIRM
     A          K XLFAAR
     A          K XLTYPE
     A          K XLLEAN
     A          K XLREFN
