      *
      * EDI FAKTURA LOGG                INDEX=EDI-LØPERNR
      *
     A          R ELOGPFR
     A                                      PFILE(*LIBL/ELOGPF)
     A          K XLFIRM
     A          K XLFAAR
     A          K XLTYPE
     A          K XLMNUM
