      *
      * EDI FAKTURA LOGG                INDEX=LEVNR,FAKTURANR
      *
     A          R ELOGPFR
     A                                      PFILE(*LIBL/ELOGPF)
     A          K XLFIRM
     A          K XLFAAR
     A          K XLTYPE
     A          K XLLEVN
     A          K XLREFN
