      *
      * Prosentsatser pr. bonusgruppe pr. år
      *
     A          R EPPSPFR
     A            EPFIRM         3S 0
     A            EPAARR         4S 0
     A            EPMERK         4A
     A            EPPROS         3S 1
     A            EPBESK        35A
     A            EPEDAT          L         TEXT('Endringsdato')
     A            EPETIM          T         TEXT('Endringstidspunkt')
     A            EPEUSR        10A
      *
