      *
      * Prosentsatser pr. bonusgruppe pr. år + merke
      *
     A          R EPPSPFR                   PFILE(*LIBL/EPPSPF)
      *
     A          K EPFIRM
     A          K EPAARR
     A          K EPBESK
