      *
      * Tar vare på eksternt prosjektnummer fra EDI til byggdok.
      *
     A          R FBDEPFR
     A            FBDFIR         3S 0       TEXT('Firma')
     A            FBDONU         8S 0       TEXT('Ordrenummer')
     A            FBDEPR        35A         TEXT('Eksternt prosjektnummer')
     A            FBDAAR         4S 0       TEXT('År')
      *
     A            FBDEUS        10A         TEXT('Endret av')
     A            FBDEDA          L         TEXT('Endret dato')
     A            FBDETI          T         TEXT('Endret tidspkt.')
     A            FBDOUS        10A         TEXT('Opprettet av')
     A            FBDODA          L         TEXT('Opprettetdato')
     A            FBDOTI          T         TEXT('Opprettettidspunkt')
      *
