      *
      * ByggDok
      *
     A          R FBDOPFR                   PFILE(*LIBL/FBDOPF)
      *
     A          K FWBFIR
     A          K FWBNUM
