      *
      *  ByggDok oppsamlingsfil
      *
     A                                      REF(*LIBL/FFRF)
     A          R FBDOPFR
      *
     A            FWBFIR    R
     A            FWBKUN    R
     A            FWBKPR    R
6.2Æ A            FWBNUM    R
6.2Æ A            FWBNAV    R
6.2Æ A            FWBPER    R
6.2Æ A            FWBMAI    R
6.2Æ A            FWBFTN    R
     A            FWBTMS    R
     A            FWBNOB    R
     A            FWBOVF    R
6.38 A            FWCOVF    R
     A            FWBODA    R
     A            FWBOTI    R
     A            FWBOUS    R
     A            FWBEDA    R
     A            FWBETI    R
     A            FWBEUS    R
