      *
      *  Ordre-slettet                     Index=numm/suff/aar
      *
     A          R FDELPFR                   PFILE(*LIBL/FDELPF)
      *
     A          K FYFIRM
     A          K FYNUMM
     A          K FYSUFF
     A          K FYAARR                    DESCEND
