      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
6.21  * R6.20 250511 AMD  Nye felter i FDELPF Slik at denne får med alt
      *                   fra FOHEPF
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
      *  Ordre-slettet
      *
     A                                      REF(*LIBL/FFRF)
     A          R FDELPFR
     A            FYFIRM    R
     A            FYAARR    R
     A            FYNUMM    R
     A            FYSUFF    R
6.21 A            FYLINE    R
     A            FYOTYP    R
6.21 A            FYLETY    R
6.21 A            FYLAGE    R
6.21 A            FYBINR    R
6.21 A            FYKREF    R
     A            FYBDAT    R
6.21 A            FYLDAT    R
6.21 A            FYPDAT    R
6.21 A            FYPADA    R
6.21 A            FYFKDA    R
6.21 A            FYFFDA    R
6.21 A            FYBETB    R
     A            FYSELG    R
6.21 A            FYDIST    R
6.21 A            FYLMAT    R
6.21 A            FYLBET    R
     A            FYVALK    R
6.21 A            FYRKAT    R
6.21 A            FYSPED    R
6.21 A            FYKJOR    R
6.21 A            FYKJNR    R
6.21 A            FYLASS    R
6.21 A            FYMKOD    R
     A            FYLKUN    R
     A            FYKUND    R
6.21 A            FYLDOR    R
     A            FYKUNA    R
     A            FYNAVN    R
     A            FYADR1    R
     A            FYADR2    R
     A            FYSTED    R
6.21 A            FYAVDE    R
6.21 A            FYKONT    R
6.21 A            FYSPES    R
6.21 A            FYPROJ    R
6.21 A            FYAKTI    R
6.21 A            FYKOBK    R
6.21 A            FYKGFA    R
6.21 A            FYKGEK    R
6.21 A            FYKGFR    R
6.21 A            FYKSOB    R
6.21 A            FYKTXT    R
6.21 A            FYKFAK    R
6.21 A            FYNETO    R
6.21 A            FYKSPR    R
     A            FYVREF    R
     A            FYDREF    R
     A            FYREKV    R
6.21 A            FYLMTX    R
6.21 A            FYLBTX    R
6.21 A            FYRABP    R
6.21 A            FYPASL    R
6.21 A            FYPASK    R
6.21 A            FYPORD    R
6.21 A            FYPSUF    R
6.21 A            FYKOLI    R
6.21 A            FYKONR    R
6.21 A            FYTOTX    R
     A            FYTOTS    R
     A            FYTOTR    R
     A            FYTOTK    R
6.21 A            FYBRRA    R
6.21 A            FYUSKR    R
6.21 A            FYKODE    R
6.21 A            FYUTSK    R
6.21 A            FYPAKS    R
6.21 A            FYITYP    R
6.21 A            FYKOWS    R
6.21 A            FYKOUS    R
6.21 A            FYKODA    R
6.21 A            FYKOTI    R
6.21 A            FYBIND    R
6.21 A            FYTDAT    R
6.21 A            FYDDAT    R
6.21 A            FYREST    R
6.21 A            FYADAT    R
6.21 A            FYEDIH    R
6.21 A            FYKPRO    R
6.21 A            FYBKUN    R
6.21 A            FYKKUN    R
6.21 A            FYOLAG    R
6.21 A            FYNREF    R
6.21 A            FYFSYS    R
6.21 A            FYBENR    R
6.21 A            FYBSUF    R
6.21 A            FYMOBI    R
6.21 A            FYKBNR    R
6.21 A            FYDEPO    R
6.21 A            FYDEPB    R
6.21 A            FYDEPT    R
6.21 A            FYFATY    R
6.21 A            FYBONG    R
6.21 A            FYPLSE    R
6.21 A            FYINF1    R
6.21 A            FYINF2    R
6.21 A            FYMERK    R
6.21 A            FYLAOK    R
6.21 A            FYSTIM    R
6.21 A            FYUPRO    R
     A            FYTYPE    R
     A            FYPRTK    R
     A            FYKOM1    R
     A            FYKOM2    R
     A            FYWSID    R
     A            FYUSER    R
     A            FYDATE    R
     A            FYTIME    R
6.10 A            FYODAT    R
6.10 A            FYOTIM    R
6.10 A            FYOUSR    R
6.10 A            FYEDAT    R
6.10 A            FYETIM    R
6.10 A            FYEUSR    R
