      *
      *  Ordre-slettet
      *
     A                                      UNIQUE
     A          R FDELPFR                   PFILE(*LIBL/FDELPF)
      *
     A          K FYFIRM
     A          K FYAARR
     A          K FYNUMM
     A          K FYSUFF
