      *
      *  Ordre-slettet
      *
     A          R FDELPFR                   PFILE(*LIBL/FDELPF)
      *
     A          K FYFIRM
     A          K FYLKUN
