      *
      *  Ordre-slettet-linjer
      *
     A          R FDESPFR                   PFILE(*LIBL/FDESPF)
      *
     A          K FSFIRM
     A          K FSNUMM
     A          K FSSUFF
     A          K FSLINE
     A          K FSVARE
