      *
      * EHF Varekatalog - sendes Logiq
      *
     A          R FEHFPFR
     A            EF_RAD      2200A         TEXT('EHF VAREKATALOG')
     A                                      COLHDG('EHF KATALOG')
