      *
      * Enhet-konvertering
      *
     A                                      REF(*LIBL/FFRF)
     A          R FENKPFR
     A            FEFIRM    R
     A            FEENHF    R
     A            FEENHT    R
