      * Fraktdokument header
      *
     A          R FFAFPFR                   PFILE(FFAFPF)
      * Nøkkel
     A          K FFAFIR
     A          K FFADNO
