      * Fraktdokument detaljer
      *
     A          R FFCDPFR                   PFILE(FFCDPF)
      * Nøkkel
     A          K FFCFIR
     A          K FFCDNO
     A          K FFCKTK
