     A          R FFRFR                     TEXT('ASOFAK SYS/400')
      *
      *         DetteErEnFrf    (NB!!  Denne må ikke fjernes)
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
3.34  * R3.34 080601 AMD  Differensiert moms, 24 og 12 %
4.01  * R4.01 190302 AMD  Endring fra Spes til kostnadsbærer
5.01  * R5.01 060502 AMD  Kontroll på at pakkseddel skrives kun en gang
5.02  * R5.02 100502 AMD  Lagt inn bildevariant på behandlingskode 1 +
      *                   ny fil for definering av bilde-alternativer
5.03  * R5.03 150502 AMD  Lagt inn standard kode for avslutningsvalg :
5.03  *                   0-Felles  1-direkte  2-jobbkø
5.04  * R5.04 290502 AMD  Lagt inn ny tabell for strukturvarer
5.05  * R5.05 120902 AMD  Lagt inn bestillingsnr. i historisk fakt.reg.
5.06  * R5.06 031002 AMD  Lagt inn ordretype for nett-ordre
5.07  * R5.07 031002 AMD  Lagt inn ordrenummer fra nett-butikken
5.08  * R5.08 031002 AMD  Lagt inn Kidd-nummer og kidd-referanse
5.09  * R5.09 031002 AMD  Lagt inn WSID USER DATE og TIME
5.10  * R5.10 141102 AMD  Oppdatering av lager ved pakkseddel
5.20  * R5.20 141003 AMD  Kontohenvisning med leveringstype
5.21  * R5.21 291003 AMD  Valgene fra F1-bildet i ordreregistering kan
5.21  *                   nå lagres på brukerprofilen
5.22  * R5.22 311003 MHA  Legge til felt for Fra System i mottakssystem
5.22  *                   Endret NREF-felt fra 6 num til 15 alfa.
5.23  * R5.23 041103 AMD  Nye databasefelter lagt inn for Best.nr/suff
5.23  *                   og linje + kundens best.nr/linje
5.23  *                   + kundens mobilnummer + kontohenv. i sodtpf
5.24  * R5.24 071103 AMD  Korreksjoner til versjon V5.20 fra HKO
5.25  * R5.25 071103 AMD  Lagt på lager i fil for automatiske etiketter
5.31  *       091203 HKO  Lagt inn bruksrett-knytning
5.31  *       101203 HKO  Utvidet ordre-linje med Almenningsinfo.
5.31  *       151203 HKO  Utvidet kundeprosjekt med privat
5.31  *       181203 AMD  Utvidet hist fakt reg med almenningsrabatt
5.31  *       181203 AMD  Lagt inn mva. grunnlag i overføringsfil
      *       191203 HKO  Lagt inn omr.faktor til nominell i varereg.
      *       100504 HKO  Endret editeringskode på påslag-linje og
      *                   lagt inn dekning (DG)
5.32  *       080904 AMD  Lagt inn ordretype for nummerserie (overstyr)
5.33  * R5.33 290304 GRO  Lagt inn leveringstype i Lev. Varereg.
5.33  *       010704 GRO  Lagt til filer for kort- / fakturaavtaler mm
5.33  *                   Endret sorteringfeltlengde i FPSOPF
5.34  *       140904 ASK  Lagt inn pakke- og lengdespesifikasjon
5.35  * R5.35 150904 AMD  Nye felter lagt inn i database
5.36  * R5.36 170904 AMD  Nye felter lagt inn i database
5.37  * R5.37 071004 AMD  Lagt inn depositum og gavekort +
5.37  *                   kundens prosjektnummer + fakturatype + bongnr
5.38  * R5.38 251004 GRO  Utg. fakturalogg
      *       301104 HKO  Lagt inn prissammenligningsenhet på
      *                   undergruppe og vare
5.39  * R5.39 210405 GRO  Feltbasert vare/prisfil
5.39  *                   Fakturatype-register
5.41  * R5.41 070705 AMD  Lagt inn varians
5.42  * R5.42 200705 KOB  Endret SODIST og FODIST fra 2 til 4 pos
      *       010805 HKO  Erstattet linjenr med individuell rekkefølge
      *                   på salgsenhet, innkjøpsenhet og prisbokenhet.
      *                   Flyttet vekt og voluminformasjon fra vare til
      *                   vare-enhet.
      *                   Erstattet nettovekt og bruttovekt med vekt
      *                   Endret lengde, bredde og høydeangivelse fra
      *                   m til mm i leverandør-vare
      *                   Endret lengdeangivelse fra m til mm i
      *                   lengdespesifikasjon-linje
      *       080805 HKO  Fjernet nettovekt og bruttovekt fra ordre-
      *                   hode og faktura-hode
      *       110805 HKO  Lagt inn bonuskunde og opprettet dato i
      *                   kundeprosjekt
      *       230905 HKO  Lagt inn mijlømerke-kode og nobbpris i vare
5.45  * R5.45 131006 AMD  Ny fil for innhenting av scannede pakksedler
5.50  *       191005 HKO  Lagt inn bonustabeller
5.51  *       191005 AMD  Lagt inn oppfølgingsdato og tekst på tilbud
      *                   + utvidet lagerplass fra 6 til 8 posisjoner
      *                   + 5 ordretyper for styring av plukklister
      *                   + kode for styring av Nobbnr/Eget varenr.
      *                   + kode for restordre
5.52  *       241005 HKO  Utvidet ordre-hode med informasjonsfelter,
      *                   til plukking dato, til plukking tidspunkt og
      *                   til plukking selgernr
5.53  *       241105 AMD  Utvidet Statusrecord med ny informasjon
      *                   - Antall dager til oppfølgings-dato
      *                   - Antall dager til utgår-dato
      *                   - Vise spesialavtale som pop-up ?
5.53  *       241105 AMD  Utvidet Ordrehode med Akseptdato
      *                   + fjernet kode for aksept/utgår
      *       310106 HKO  Utvidet ordre informasjonskode med valg for
      *                   å styre informasjonsflyt og kjørekontor
5.54  *       310106 AMD  Lagt inn kode for om kjørekontor benyttes
      *                   samt fjernet igjen ordretyper for kjørekontor
      *       030406 HKO  Utvidet ekstern ordre-kode-register
5.55  *       031006 BOF  Lagt inn abc-kode på lagerregister
      *       230506 HKO  Lagt inn plakat-tabell
      *       260606 HKO  Utvidet kunde distribusjonsliste med
      *                   leveringstype og opprettet-dato
5.56  *       020307 AMD  Lagt inn ny kode for antall tellinger (VLAGPF)
5.57  *       060307 AMD  Lagt inn KIDD-informasjon i FOVFPF-filen
5.58  *       090307 AMD  Lagt inn nye filer for logging av ordreforløp
5.59  *       230307 AMD  Utvidet sorteringsbegrep for å kunne dekke
      *                   brudd på både navn og adresse 1
      *       300307 AMD  Lagt inn kode for styring av etikettutskrift
      *       040407 AMD  Lagt inn klokkeslett for salg
5.60  *       030108 BOF  Utvidet ordre-detalje med eannr. og innkj.pris
5.61  *       070108 BOF  Utvidet Loggfil m/årstall
5.62  *       170108 BOF  Utvidet lagerreg. med elektr.etikett kode
5.63  *       210108 AMD  Lagt inn løsning for kontroll av bruksrettsrab.
5.64  *       010208 BOF  Utvidet ordrehode med depositum-felter
5.65  *       140208 AMD  Ny databasefil for slettede ordrelinjer
5.66  *       200508 AMD  Ny databasefil for depositum + endr. FSTSPF
5.67  *       080808 BOF  Utvidet VLAGPF med låsing av abckode
5.70  * PRGR  011008 BOF  Utvidet  FRABPF, FPRIPF, VTILPF, FODTPF      F
5.70  *                   og VVPRPF med prisgruppe/VLAGPF med VLVTYP
6.10  * R6.10 080609 BSA  Oppdatert filer med sporingsinformajon. Opprettet
6.10  *                   dato, kl.slett og bruker. Endret dato, kl.slett og
6.10  *                   bruker.
6.11  * R6.10 260609 BOF  Utvidet vare-enhet med ean-nr og pakningsklasse
6.12  * R6.10 260609 BOF  Utvidet ean-nr fra 13 til 14 pos.
6.13  *       100709 AMD  Lagt inn påslags-prosent for Mestergruppen
6.14  *       250809 BSA  Utvidet referanseregsitrene fra 20 til 30 posisjoner.
6.11  * R6.10 280809 ASK  Lagt inn egen abc-kode for syklisk telling   se
6.11  * R6.10 020909 ASK  Lagt inn to alternative lagerplasser pr.lagerse
6.13  * R6.10 030909 BOF  Utvidet vare med kjede-sortiment
6.14  * R6.10 170909 BOF  Utvidet Ordrelinje med skaffevareinfo mm.
6.15  * R6.10 240909 BSA  Endert strukturregisteret. Hoved/struktur vare er
6.15  *                   satt tilbake til 15 siffer. Lagt til tre nye felter.
6.16  * R6.10 240909 BOF  Dannet vare-enhet-prisgiver /utvdidet varepris
6.17  * R6.17 250909 AMD  Lagt inn ny tabell for kobling av mva-koder
6.18  * R6.10 021009 BSA  Ny tabell for språktekster på vare
6.19  * R6.10 081009 BSA  Arbeidsregister ved utskrift av plukkliste
6.20  * R6.10 131009 BSA  Nye filer for fraktbrev håndtering.
6.21  * R6.10 301009 AMD  Lagt inn momsprosent i SODTPF
6.22  * R6.10 280110 AMD  Lagt inn eannummer
6.23  * R6.10 150310 BSA  Utvidet VETIPF med sist brukte pris og sist utskrevet
6.23  *                   GTIN nummer. Utvidet VFASPF antall dagers horisont
6.23  *                   for automatiske etiketter.
6.24  * R6.10 120510 AMD  Lagt på kode for styring av print v/faktura
6.25  * R6.10 160610 BOF  Utvidet fakturalogg med kunde ean-f.
6.26  * R6.10 120810 AMD  Lagt på kode for kontroll mot beholdning
6.27  * R6.10 101010 NHO  Endret prosjekt fra nummerisk til alfa(PROJ)
      *                   Samt nye felter i FOVFPF OG FOHEPE
6.28  * R6.20 021110 BOF  Utvidet varesort. med lager og fra-til dato
6.28  * R6.20 171110 BOF  Utvidet ordre med merk felt
6.29  * R6.20 260111 BOF  Tatt inn endringer fra mpsppf til vlagpf
6.2A  * R6.20 130211 BOF  Utvidet status med obl.lev.dato + lag.beh.sjekk mm
6.2B  * R6.20 220211 BSA  Kortkode på ordrehodet overføres statistikk
6.2C  * R6.20 070311 BOF  Utvidet status med sjekk skaffe.vare + søk skaffev.
6.2D  * R6.20 110311 NHO  Utvidet VUGRPF, sjekk om vare tilhører under-
      *                   gruppe/transp., vises da i ordrereg som info.
6.2E  * R6.20 210311 bof  Utvidet vare-pris med leverandør - fler prisg.lev.
6.2F  * R6.20 080411 bsa  Arbeidsfil for temporær lagring av endringer ved
6.2F  *                   synkronisering mellom bestilling og ordre.
6.2G  * R6.20 170411 BOF  Utvidet tilbud med levrandør og varegrupper
6.2H  * R6.20 020511 BOF  Utvidet ordre med pakkseddeldato
6.2I  * R6.20 080511 BOF  Utvidet ordre med for om lev.adr. settes som kundens
6.2J  * R6.20 260411 AMD  Flere muligheter rundt kredit-alternativer
6.2K  * R6.20 250511 AMD  Nye felter i FDELPF Slik at denne får med alt
6.2L  * R6.20 310511 BSA  Legger ut innkjøpspris på tilbuds fila (VTILPF)
6.2M  * R6.20 310511 BOF  Utvidet med med nytt valg 2 posisjoner
6.2N  * R6.20 230911 BSA  Utvidet bonustyperegister
6.2O  * R6.20 031111 BOF  Utvidet status-reg og sortiment
6.2P  * R6.20 071111 BSA  Styrer om ordre oppdateres fra bestilling
6.2P  *                   NB REVERSERT - KODE ER LEDIG. FAAK02
      * R6.20 071111 BOF  Styrer om ordre skal splittes hvis flere lager
6.2R  * R6.20 201211 BOF  Utvidet hist.fakt/ med pakks.dato og lev.dato
6.2X  * R6.10 140112 BOF  Ny fil for BygDok-uthenting + merke på kundeprosj.
6.2x  *                   I 6.10 løses dette med 1 - 1 fil FKP2PF
6.2Y  * R6.20 300312 BSA  Setter defaultverdi for å unngå at dd/tid settes
6.2Y  *                   som verdi, der hvor nye tidsfelter legges til i
6.2Y  *                   allerede eksisterende filer.
6.2Z  * R6.20 230412 bof  FAAK01 - Styrer om SMS skal sendes i varemottak
6.2X  *                   (valgt kode OFAK fordi det er var forhåndsdef.felter)
6.2Y  * R6.20 090612 bof  Reservert et par koder på Brukerregister
6.2Æ  * R6.20 300712 bof  Utvidet ByggDok filen
6.2Ø  * R6.20 300812 bof  Lager-nytt endret dato/av (faste data)
6.2Ø  *                   Kundeprosjekt - byggdok
6.2Å  * R6.10 261012 BOF  Sideregister for ordretype (sys sammen i 6.30)
6.30  * R6.30 050214 BSA  Utvidet erstatningsvareregister pga BM pakke
6.31  * R6.30 050214 BOF  Tatt i bruk FBKO16 i forb. BM pakke
6.32  * R6.30 070214 BOF  Utvidet ordre-info med felt oppf. tilbud-selger
6.NU  * R6.30 210514 BSA  Utvidelse av nummerfelter
6.33  * R6.30 080814 BOF  Utvidet lev.varnr ihht. nobb (fra 15-> 20)
6.34  * R6.30 190814 BOF  Utvidet vare-pris med innkjøpspris 2
6.35  * R6.30 100914 BKV  Utvidet kundeprosjekt
6.36  * R6.30 110914 BSA  Utvidet ordrehodet med kontaktperson
6.37  * R6.30 201014 BOF  Utvidet kundeprosjekt med cobuilder parm
6.38  * R6.30 221014 BKV  Utvidet ByggDok Oppsamfil med cobuilder overført
6.39  * R6.30 241014 BKV  Utvidet kundeprosjket. Frikoblet kunde overst.
6.3A  * R6.30 270515 BOF  Utvidet KIDreferanse fra 6 til 8 (7 til 9)
6.3B  * R6.30 260615 BOF  2 koder på FUSRPF, reservert bruk
6.3C  * R6.30 291116 BOF  Utvidet mva kobl.tab mva. for utenlandsk kode
6.3D  * R6.30 191017 BOF  Tatt i bruk kode FAAK05
6.3E  * R6.30 150318 bkv  Flere koder
6.3F  * R6.30 180318 BOF  Utvidet med kundeklubb-fil (lik tilbudpris)
6.3G  * R6.30 100918 BOF  Utvidet med vare-leverandør i EVR (tralast)
7.11  * R7.00 040419 BKV  Sidetabell ordrehode nobb frakt
7.12  * R6.30 150517 SST  utvidet med Konto for utgiftsbilag på k.pro.
7.12  * R6.30 ????17 SST  utvidet med Konto for svinn på kundeprosjekt
7.12  * R6.30 290917 SST  utvidet med underpro.+ fakturakunde på k.pro.
7.13  * R6.30 310119 ASK  Utvidet filer for eksternordre(NOHEPF/NODTPF)
7.14  * R6.30 300120 BKV  Slette register for FLOGPF - FSLOPF
      *
------*--------------------------------------------------------------------
******* FORTSETT ETTER 6.3B, DETTE GJELDER FOR 6.40 ******
6.40  * R6.40 011216 BOF  Utvidet med koder for Forskuddsbetaling.
7.f1  * R7.10 300920 bsa  Utvidet tilleggsregister med fargevalg på ordre.
7.01  * R6.20 190614 BSA  Kopi av EDI info ved inngående EDI bestilling
7.10  * R7.00 050419 Bsa  Logg for elektrroniske hylleforkanter
7.f2  * R7.10 011216 BOF  Utvidet med koder for Forskuddsbetaling.
7.f2  * R7.10 061216 BOF  Utvidet med kode i depositum
7.f2  * R7.10 240117 BOF  Utvidet med felter for Fordelt redus. salg
      *
______*_________________________________________________________________________
VERSJ *Uts   Dato Usr Referanse Beskrivelse
______*_________________________________________________________________________
7.15  *K00 270420 SST NXS-3871  Lagt til Fakturatype i FGEBPF
7.16  *K00 030620 BOF NXS-1195  Utvidet med parm inkl skaff/tilb i FKDIPF
7.17  *K00 150720 ask  Utvidet FOVFPF med timestamp for logging
7.18  * R6.40 010617 BOF  Utvidet med prisgruppe Gruppe
      *
8.01  *K000 270921 bsa    Utvidet EDI meldingsnummer fra 6 til 8 siffer
8.02  *K000 281021 bsa    Utvidet EDI meldingsnummer fra 6 til 8 siffer
8.02  *K000               Uteglemt felt.
8.03  *PRG2 080622 bof    Utvidet  prisgruppe fra 1 til 2 posisjoner
8.04  *K00  121121 bof    Nytt felt prisgruppe tilbud i VPGRPF, sydd inn fra BMH
8.05  *K00  301221 bof    Nytt felt kostpris2 VPKOP2 FDKOP2, sydd inn fra BMH
8.06  *K000 221223 BSA    Utvidet med tabell VPFOST, Prisforslag
8.06  *K000               080222 BOF - Merket 8.03 i FFRF i NXCLOUD
8.07  *K000 091222 BOF    Utvidet med tabell VTKOST, Koblingstab.tilbud
      *
      *
      *
      *
      * Koder benyttet i Ordre/Fakturering
      *
      *           FÅ  = Diverse koder
      *
      *           FAA = Ofak-kode-register
      *           FAJ = Ofak-jobb-status-register
      *           FB  = Ofak-bruker-register
      *           FC  = Pris-recordformat-register
      *           FD  = Ordre-linje-register
      *           FE  = Enhet konvertering-register
      *           FF  = Felles trans-fil for overføring Økonomi
6.20  *           FFA = Fraktkokument hode
6.20  *           FFB = Fraktdokument inngående ordrenummer
6.20  *           FFC = Fraktdokument kolliinfomasjon
6.20  *           FFD = Fraktdokument ordrelinjer
      *           FG  = Gebyr-register
      *           FH  = Kunde distribusjonsliste
      *           FI  = Håndterminal ordre register
5.39  *           FIU = Feltbasert vare/prisfil
      *           FJ  = Fast ordretekst-register
      *           FKP = Utplukk-param-register
      *           FKL = Utplukk-linje-register
      *           FK1 = Plukk-1-linje-register
      *           FK2 = Plukk-2-linje-register
      *           FKS = Plukk-S-linje-register
      *           FL  = Kundeprosjekt-register
      *           FLS = Kundeprosjekt-søketekst-register
5.33  *           FM  = Kort/fakturaavtale-register
5.39  *           FMT = Fakturatype-register
5.33  *           FN  = Kort/fakt-trans-register
5.38  *           FNU = Utgående fakturalogg
      *           FO  = Ordre-hode-register
7.11  *           FO2 = Ordre-hode-register - SIDEREGISTER
      *           FP  = Spesialpris-register
      *           FPN = Spesialpris notat-register
      *           FR  = Rabattmatrise-register
5.34  *           FS  = Pakke-spesifikasjon
      *           FT  = Ordre-tekst-register
5.58  *           FU  = Ordre-Logg-koder
5.34  *           FV  = Lengde-spesifikasjon
      *           FW  = Leverandør vareregister
6.2x  *           FWB = ByggDok oppsamlingsregister
5.45  *           FX  = Fil for scanning av pakksedler
      *           FY  = Ordre-slettet-register
      *           FZ  = Eksternt scanne-register
      *
5.50  *           EK  = Kunde bonus
5.50  *           EKE = Kunde bonuselment
5.50  *           EL  = Leverandør bonus
5.50  *           ELE = Leverandør bonuselment
      *
      *           KD  = Ordre-linje-register (Fra kalkyle)
      *           KO  = Ordre-hode-register  (Fra kalkyle)
      *           KP  = Parameterfile        (Fra kalkyle)
      *           KW  = Arbeids- file        (Fra kalkyle)
      *
      *           ND  = Ekstern ordre-linje-register
5.22  *           NK  = Ekstern ordre-kode-register
      *           NO  = Ekstern ordre-hode-register
      *
      *           SD  = Faktura-linje-register
      *           SO  = Faktura-hode-register
5.66  *           SK  = Depositum-register
      *
5.02  *           VAB = Bilde-alternativer
      *           VAE = Enhets-register
      *           VAI = Ordre informasjonskode-register
5.58  *           VAJ = Ordre Logg-koder
      *           VAK = Kontohenvisnings-register
      *           VAL = Linjetype-register
      *           VAO = Ordretype-register
6.2Å  *           VA1 = ORDRETYPE-REGISTER - SIDEREGISTER
      *           VAP = Priskode-beskrivelse
5.50  *           VAT = Bonustype
      *           VAV = Varetype-register
      *
5.31  *           VB  = Bruksrett-knytning
      *           VC  = Varesortiments-hode-register
      *           VD  = Varesortiments-linje-register
      *           VE  = Vare-enhets-register
6.16  *           VEP = Vare-enhets-prisgiver-register
      *           VFH = Alternativ hovedgruppe-register
      *           VFU = Alternativ undergruppe-register
      *           VGO = Overgruppe-register
      *           VGH = Hovedgruppe-register
      *           VGU = Undergruppe-register
      *
      *           VH  = Historisk-Lagerbok-register
      *           VL  = Lager-register
      *
      *           VI  = Påslags-hode-register
      *           VJ  = Påslags-linje-register
      *
      *           VK  = Varegruppeknytning
5.24  ***         VM  = Modul
      *           VM  = Etikettutskrift
      *           VN  = Faste tekster på etiketter
      *           VP  = Vare-pris-register
5.70  *           VPG = Prisgruppe register
8.06  *           VPF = Prisforslag
      *           VR  = Vare-plakat
      *           VS  = Søketekst-register
      *           VT  = Tilbudspris-register
8.07  *           VTO = Tilbud koblingstab rab.kat/kund.kat
5.04  *           VU  = Struktur-varer
      *           VV  = Vare-register
      *           VVA = Alternativ vare
6.3g  *           VVL = Vare-leverandør (VVLEPF)
6.3g  * UTGÅR     VVL = Språktekster til vare  IKKE TATT i BRUK
      *           VVS = Vare-søketekst-register
      *           VWA = Arbeidsregister
      *           VWB = Arbeidsregister
6.19  *           VWC = Arbeidsregister plukkliste
      *           VWP = Parameterregister
      *           VX  = Ean-nummer-register
      *           VY  = Leveringstype-register
6.2F  *           WF  = Arbeidsregister for endringer best/ordre
      *
      *
      * Referansefelter                     (FÅ)
      *
     A            FÅFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
      *
     A            FÅLAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
      *
     A            FÅJANE         1S 0       TEXT('Ja/Nei')
     A                                      COLHDG('Ja/Nei')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      EDTCDE(Z)
      *
     A            FÅKPRO         6S 0       TEXT('Kundeprosjektnr')
     A                                      COLHDG('Kunde' 'prosjekt')
     A                                      EDTCDE(Z)
      *
     A            FÅKUND         6S 0       TEXT('Kundenr')
     A                                      COLHDG('Kunde')
     A                                      EDTCDE(Z)
      *
     A            FÅLDOR         6S 0       TEXT('Leverandørnr')
     A                                      COLHDG('Lev.')
     A                                      EDTCDE(Z)
      *
     A            FÅNYEN        11A         TEXT('Ny/Endr')
     A                                      COLHDG('Ny/Endr')
      *
     A            FÅPKOD         1A         TEXT('Priskode')
     A                                      COLHDG('Pr.kod')
      *
     A            FÅRFMT        10A         TEXT('Recordfromat')
     A                                      COLHDG('Rec.fmt.')
      *
     A            FÅSVAR         1S 0       TEXT('Svar')
     A                                      COLHDG('Svar')
     A                                      EDTCDE(Z)
      *
7.xx A            FÅSVA2         1S 0       TEXT('Svar')
7.xx A                                      COLHDG('Svar')
7.xx A                                      EDTCDE(1)
      *
     A            FÅVALA         1A         TEXT('Valg')
     A                                      COLHDG('Valg')
      *
     A            FÅVALG         1S 0       TEXT('Valg')
     A                                      COLHDG('Valg')
     A                                      EDTCDE(Z)
6.2m A            FÅVAL2         2S 0       TEXT('Valg')
6.2m A                                      COLHDG('Valg')
6.2m A                                      EDTCDE(Z)
5.70  *
8.03 A            FÅPRGR         2A         TEXT('Prisgruppe')
5.70 A                                      COLHDG('Pg')
      *
     A            FÅOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogr')
     A                                      EDTCDE(Z)
      *
     A            FÅHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgr')
     A                                      EDTCDE(Z)
      *
     A            FÅUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugr')
     A                                      EDTCDE(Z)
      *
     A            FÅAHGR         2S 0       TEXT('Alt. hovedgruppe stat.')
     A                                      COLHDG('Alt.' 'hgr.' 'stat.')
     A                                      EDTCDE(Z)
      *
     A            FÅAUGR         3S 0       TEXT('Alt. undergruppe stat.')
     A                                      COLHDG('Alt.' 'ugr.' 'stat.')
     A                                      EDTCDE(Z)
      *
5.24 A            FÅMODN         8S 0       TEXT('Modulnr')
5.24 A                                      COLHDG('Modulnr')
5.24 A                                      EDTCDE(Z)
      *
     A            FÅVARE        15A         TEXT('Varenr')
     A                                      COLHDG('Varenr')
      *
6.12 A            FÅEANN        14S 0       TEXT('Ean-nr')
     A                                      COLHDG('EAN-nr')
     A                                      EDTCDE(Z)
6.11 A            FÅPKLA         1A         TEXT('Pakningsklasse')
6.11 A                                      COLHDG('Pakn.klasse')
      *
     A            FÅNOBB         8S 0       TEXT('Nobbnr')
     A                                      COLHDG('Nobbnr')
     A                                      EDTCDE(Z)
      *
6.33 A            FÅLVAR        20A         TEXT('Lev. varenr')
     A                                      COLHDG('Lev.varenr')
      *
     A            FÅTEK1        35A         TEXT('Varetekst 1')
     A                                      COLHDG('Varetekst 1')
      *
     A            FÅTEK2        35A         TEXT('Varetekst 2')
     A                                      COLHDG('Varetekst 2')
      *
     A            FÅTEK3        35A         TEXT('Varetekst 3')
     A                                      COLHDG('Varetekst 3')
      *
     A            FÅTEK4        35A         TEXT('Varetekst 4')
     A                                      COLHDG('Varetekst 4')
      *
     A            FÅKPRI         1A         TEXT('Priskode')
     A                                      COLHDG('Pris' 'kode')
      *
     A            FÅVTYP         1A         TEXT('Varetype')
     A                                      COLHDG('Vare' 'type')
      *
     A            FÅLETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
      *
5.50 A            FÅBOTY         2A         TEXT('Bonustype')
5.50 A                                      COLHDG('Bonus' 'type')
      *
5.31 A            FÅBRTY         1S 0       TEXT('Bruksrett-type')
5.31 A                                      COLHDG('Bruksrett' 'type')
5.31 A                                      EDTCDE(Z)
5.31  *
5.31 A            FÅPRIV         1S 0       TEXT('Privat')
5.31 A                                      COLHDG('Priv.')
5.31 A                                      EDTCDE(Z)
5.31 A                                      VALUES(0 1)
5.31 A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
5.31  *
     A            FÅENHE         3A         TEXT('Enhet')
     A                                      COLHDG('Enhet')
      *
     A            FÅANTA        11S 3       TEXT('Antall')
     A                                      COLHDG('Antall')
     A                                      EDTCDE(M)
      *
     A            FÅKHEV         4A         TEXT('Kontohenvisning')
     A                                      COLHDG('Konto' 'henv.')
      *
5.24 A            FÅKKAT         4S 0       TEXT('Kundekategori')
5.24 A                                      COLHDG('Kunde' 'kat.')
5.24 A                                      EDTCDE(Z)
      *
     A            FÅRKAT         3S 0       TEXT('Rabattkategori')
     A                                      COLHDG('Rab.' 'kat.')
     A                                      EDTCDE(Z)
      *
5.31 A            FÅALME         4S 0       TEXT('Almenning')
5.31 A                                      COLHDG('Alm.')
5.31 A                                      EDTCDE(Z)
5.31  *
     A            FÅLENG         6S 0       TEXT('Lengde i mm')
     A                                      COLHDG('Lengde' 'mm')
     A                                      EDTCDE(4)
      *
     A            FÅBRED         6S 0       TEXT('Bredde i mm')
     A                                      COLHDG('Bredde' 'mm')
     A                                      EDTCDE(4)
      *
     A            FÅHOYD         6S 0       TEXT('Høyde i mm')
     A                                      COLHDG('Høyde' 'mm')
     A                                      EDTCDE(4)
      *
     A            FÅVEKT         9S 3       TEXT('Vekt i kg')
     A                                      COLHDG('Vekt' 'kg')
     A                                      EDTCDE(4)
      *
     A            FÅVOLU         9S 5       TEXT('Volum i m3')
     A                                      COLHDG('Volum' 'm3')
     A                                      EDTCDE(4)
      *
     A            FÅBESK        35A         TEXT('Beskrivelse')
     A                                      COLHDG('Beskrivelse')
      *
     A            FÅBESK_30     30A         TEXT('Beskrivelse')
     A                                      COLHDG('Beskr')
      *
     A            FÅBESK_5       5A         TEXT('Beskrivelse')
     A                                      COLHDG('Beskr')
      *
6.NU A            FÅNUMM         8S 0       TEXT('Ordrenr')
     A                                      COLHDG('Ordrenr')
     A                                      EDTCDE(Z)
      *
     A            FÅSUFF         2S 0       TEXT('Suffix')
     A                                      COLHDG('Suff')
     A                                      EDTCDE(Z)
      *
     A            FÅLINE         4S 0       TEXT('Linjenr')
     A                                      COLHDG('Linje')
     A                                      EDTCDE(Z)
      *
     A            FÅOTYP         2A         TEXT('Ordre-type')
     A                                      COLHDG('Ordre' 'type')
      *
     A            FÅSELG         4S 0       TEXT('Selgernr')
     A                                      COLHDG('Sn')
     A                                      EDTCDE(Z)
      *
     A            FÅKAMP         5A         TEXT('Kampanje')
     A                                      COLHDG('Kamp.')
      *
     A            FÅUSER        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FÅTAPE        10A         TEXT('Tape')
     A                                      COLHDG('Tape')
      *
     A            FÅVSOR        10A         TEXT('Varesortiment')
     A                                      COLHDG('Sort.')
      *
     A            FÅPASL        10A         TEXT('Påslag')
     A                                      COLHDG('Påslag')
6.13  *
6.13 A            FÅPSLM         4S 2       TEXT('Påslag Mestergrp.')
6.13 A                                      COLHDG('Påslag' 'Mgr.')
6.13 A                                      EDTCDE(4)
      *
     A            FÅPRAN         4A         TEXT('Produktansv')
     A                                      COLHDG('Produktansv.')
      *
5.24 A            FÅCRDO         1S 0       TEXT('Cross docking')
5.24 A                                      COLHDG('Cross' 'docking')
5.24 A                                      EDTCDE(Z)
      *
5.22 A            FÅFSYS         3A         TEXT('Eksternt system')
5.22 A                                      COLHDG('Ekst.' 'sys.')
      *
     A            FÅNREF        15A         TEXT('Eksternt referansenr')
     A                                      COLHDG('Ekst.' 'ref.')
      *
     A            FÅLDAT          L         TEXT('Leveringsdato')
     A                                      COLHDG('Lev.' 'dato')
      *
     A            FÅODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
      *
     A            FÅOTIM          T         TEXT('Opprettet tidspunkt')
     A                                      COLHDG('Oppr.tid')
6.10  *
6.10 A            FÅOUSR        10A         TEXT('Opprettet av')
6.10 A                                      COLHDG('Oppr. av')
      *
     A            FÅEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
      *
     A            FÅETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
      *
     A            FÅEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
6.27  *
6.27 A            FÅPROJ         6A         TEXT('Prosjekt-nr')
6.27 A                                      COLHDG('Prosj.')
6.27 A            FÅUPRO         6A         TEXT('U.Prosjekt')
6.27 A                                      COLHDG('U.proj')
6.27 A            FÅARBO         6A         TEXT('Arb.ordre')
6.27 A                                      COLHDG('A.ordre')
6.27 A            FÅAKTI         6A         TEXT('Aktivietet')
6.27 A                                      COLHDG('Akt.')
6.27  *
      *
      * Ofak-kode-register                  (FAA)
      *
     A            FAAFIR    R               REFFLD(FÅFIRM)
      *
     A            FAAORK         6A
     A                                      COLHDG('Ident. ORDRE')
     A                                      TEXT('Ident. ORDRE')
     A            FAAFAK         6A
     A                                      COLHDG('Ident. Faktura/Kred.')
     A                                      TEXT('Ident. Faktura/Kred.')
     A            FAADEL         6A
     A                                      COLHDG('Ident. slettet ordre')
     A                                      TEXT('Ident. slettet ordre')
     A            FAALSM         6A
     A                                      COLHDG('Ident. LISTE')
     A                                      TEXT('Ident. LISTE')
     A            FAABND         1A
     A                                      COLHDG('Ordremerking')
     A                                      TEXT('Ordremerking')
     A                                      VALUES('J' 'N' 'X')
     A                                      CHKMSGID(FMA0100 *LIBL/QMFOFAK)
     A            FAAOTY         2A
     A                                      COLHDG('Ordre-type')
     A                                      TEXT('Ordre-type')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMA0600 *LIBL/QMFOFAK)
     A            FAALTY         2A
     A                                      COLHDG('Linje-type')
     A                                      TEXT('Linje-type')
     A            FAATTY         2A
     A                                      COLHDG('Tekst-type')
     A                                      TEXT('Tekst-type')
     A            FAAMVA         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Vis moms')
     A                                      TEXT('Vis moms')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
     A            FAALAG         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Oppdatering lager')
     A                                      TEXT('Oppdatering av lager')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
     A            FAAHLA         2S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedlager')
     A                                      TEXT('Hovedlager')
     A            FAAHOY         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Store bokstaver')
     A                                      TEXT('Store bokstaver')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
     A            FAAMAN         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Man. ordreserie')
     A                                      TEXT('Man. ordreserie')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
     A            FAANXT         1S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kontroll neste OT')
     A                                      COLHDG('Kontr.' 'neste')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.26 A            FAABEH         1S 0
6.26 A                                      EDTCDE(Z)
6.26 A                                      TEXT('Kontroll beholdning')
6.26 A                                      COLHDG('Kontr.' 'behold')
6.26 A                                      VALUES(0 1 2 3)
6.26 A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2a  *                                     0 = ingen sjekk
6.2a  *                                     1 = sjekk, men kommer videre
6.2a  *                                     2 = sjekk, ikke videre
6.2a  *                                     3 = sjekk kasse, kommer videre'
     A            FAAKUN         6S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kundenummer, Tilbud')
     A                                      TEXT('Kundenummer, Tilbud')
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMA0610 *LIBL/QMFOFAK)
     A            FAAKNR         6S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kundenummer, Opprett')
     A                                      TEXT('Kundenummer, Opprett')
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMA0610 *LIBL/QMFOFAK)
     A            FAAVNR        15A
     A                                      COLHDG('Varenr, Øreavrunding')
     A                                      TEXT('Varenr, Øreavrunding')
     A            FAABIL         2S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagskode, avrund')
     A                                      TEXT('Bilagskode, avrund')
     A            FAADES         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Antall desimaler')
     A                                      TEXT('Antall desimaler')
     A            FAAGRN         6S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Grense for rabatt')
     A                                      TEXT('Grense for rabatt')
     A            FAASAK         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Spesifiser kost i HB')
     A                                      TEXT('Spesifiser kost i HB')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
     A            FAASA1         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Spesifiser rab1 i HB')
     A                                      TEXT('Spesifiser rab1 i HB')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
     A            FAASA2         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Spesifiser rab2 i HB')
     A                                      TEXT('Spesifiser rab2 i HB')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
     A            FAASAO         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Spesifiser orab i HB')
     A                                      TEXT('Spesifiser orab i HB')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
     A            FAAKHV         4A
     A                                      COLHDG('Kontohenvisning')
     A                                      TEXT('Kontohenvisning')
     A                                      COMP(NE '    ')
     A                                      CHKMSGID(FMA0620 *LIBL/QMFOFAK)
     A            FAAOT1         2A
     A                                      COLHDG('Ordre-type, TILBUD')
     A                                      TEXT('Ordre-type, TILBUD')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMA0600 *LIBL/QMFOFAK)
     A            FAAOT2         2A
     A                                      COLHDG('Ordre-type, ORDRE')
     A                                      TEXT('Ordre-type, ORDRE')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMA0600 *LIBL/QMFOFAK)
     A            FAAOT3         2A
     A                                      COLHDG('Ordre-type, PAKKS')
     A                                      TEXT('Ordre-type, PAKKS')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMA0600 *LIBL/QMFOFAK)
     A            FAAOT4         2A
     A                                      COLHDG('Ordre-type, FAKT')
     A                                      TEXT('Ordre-type, FAKT')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMA0600 *LIBL/QMFOFAK)
     A            FAAOT5         2A
     A                                      COLHDG('Ordre-type, KREDN')
     A                                      TEXT('Ordre-type, KREDN')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMA0600 *LIBL/QMFOFAK)
     A            FAAOT6         2A
     A                                      COLHDG('Ordre-type, PRISORDR')
     A                                      TEXT('Ordre-type, PRISORDRE')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMA0600 *LIBL/QMFOFAK)
     A            FAAOT7         2A
     A                                      COLHDG('Ordre-type, BEST.')
     A                                      TEXT('Ordre-type, BEST.')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMA0600 *LIBL/QMFOFAK)
5.06 A            FAAOT8         2A
5.06 A                                      COLHDG('Ordre-type, Nett.ord')
5.06 A                                      TEXT('Ordre-type, Nett.ord')
5.06 A                                      COMP(NE '  ')
5.06 A                                      CHKMSGID(FMA0600 *LIBL/QMFOFAK)
5.51 A            FAANOB         1S 0
5.51 A                                      COLHDG('Nobb, Eget varenr')
5.51 A                                      TEXT('Nobb, Eget varenr')
5.51 A                                      VALUES(0 1)
5.51 A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
     A            FAARK1         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-1')
     A                                      TEXT('Rabatt-alternativ-1')
     A            FAARK2         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-2')
     A                                      TEXT('Rabatt-alternativ-2')
     A            FAARK3         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-3')
     A                                      TEXT('Rabatt-alternativ-3')
     A            FAARK4         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-4')
     A                                      TEXT('Rabatt-alternativ-4')
     A            FAARK5         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-5')
     A                                      TEXT('Rabatt-alternativ-5')
     A            FAARK6         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-6')
     A                                      TEXT('Rabatt-alternativ-6')
     A            FAARK7         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-7')
     A                                      TEXT('Rabatt-alternativ-7')
     A            FAARK8         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-8')
     A                                      TEXT('Rabatt-alternativ-8')
     A            FAAGR0         7S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Beløpsgrense avr.-0')
     A                                      TEXT('Beløpsgrense avr.-0')
     A            FAAGR1         7S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Beløpsgrense avr.-1')
     A                                      TEXT('Beløpsgrense avr.-1')
     A            FAAGR2         7S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Beløpsgrense avr.-2')
     A                                      TEXT('Beløpsgrense avr.-2')
     A            FAAGR3         7S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Beløpsgrense avr.-3')
     A                                      TEXT('Beløpsgrense avr.-3')
     A            FAAGR4         7S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Beløpsgrense avr.-4')
     A                                      TEXT('Beløpsgrense avr.-4')
     A            FAABL1         5S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Avrundes til -1')
     A                                      TEXT('Avrundes til -1')
     A            FAABL2         5S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Avrundes til -2')
     A                                      TEXT('Avrundes til -2')
     A            FAABL3         5S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Avrundes til -3')
     A                                      TEXT('Avrundes til -3')
     A            FAABL4         5S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Avrundes til -4')
     A                                      TEXT('Avrundes til -4')
     A            FAABL5         5S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Avrundes til -5')
     A                                      TEXT('Avrundes til -5')
     A            FAAINK         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Benyttes innkjøp')
     A                                      TEXT('Benyttes innkjøp')
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(FMA0120 *LIBL/QMFOFAK)
     A            FAAKOS         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Benyttes kostpris')
     A                                      TEXT('Benyttes kostpris')
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(FMA0120 *LIBL/QMFOFAK)
     A            FAAEMV         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Benyttes eks.mva')
     A                                      TEXT('Benyttes eks.mva.')
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(FMA0120 *LIBL/QMFOFAK)
     A            FAAIMV         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Benyttes inkl.mva')
     A                                      TEXT('Benyttes inkl.mva.')
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(FMA0120 *LIBL/QMFOFAK)
      *
5.53 A            FAAOPF         3S 0
5.53 A                                      EDTCDE(Z)
5.53 A                                      COLHDG('Dager' 'til oppf.')
5.53 A                                      TEXT('Dager til oppf.')
5.53 A            FAAUTG         3S 0
5.53 A                                      EDTCDE(Z)
5.53 A                                      COLHDG('Dager til' 'utgår')
5.53 A                                      TEXT('Dager til utgår')
5.53 A            FAAPOP         1S 0
5.53 A                                      EDTCDE(Z)
5.53 A                                      COLHDG('Spes avt' 'popup')
5.53 A                                      TEXT('Spes. avt popup')
5.54 A            FAAKJK         1S 0
5.54 A                                      EDTCDE(Z)
5.54 A                                      COLHDG('Kjøre' 'kontor')
5.54 A                                      TEXT('Kjøreordrekontor')
5.70 A            FAAVTY    R               REFFLD(FÅVTYP)
5.70 A                                      COLHDG('Std.' 'varetype')
5.70 A                                      TEXT('Std. varetype')
6.2C A            FAALBE         1S 0
6.2C A                                      COLHDG('Sjekk''skaffevare')
6.2C A                                      TEXT('Sjek skaffevare')
6.2C A                                      VALUES(0 1 2 3)
6.2C A                                      EDTCDE(Z)
6.2C A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2a  *                                     0 = ingen sjekk
6.2a  *                                     1 = sjekk, men kommer videre
6.2a  *                                     2 = sjekk, ikke videre
6.2a  *                                     3 = sjekk, mail sendes
6.2a A            FAALDS         1S 0
6.2a A                                      COLHDG('Sjekk''lev.dato')
6.2a A                                      TEXT('Sjek lev.dato')
6.2A A                                      VALUES(0 1)
6.2A A                                      EDTCDE(Z)
6.2A A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2a  *                                     0 = ikke krav om sjekk
6.2a  *                                     1 = krav at utfylt
6.2a A            FAAFSL         1S 0
6.2a A                                      COLHDG('Farge''Sent.l.v')
6.2a A                                      TEXT('Farge sent.l.vare')
6.2A A                                      VALUES(0 1)
6.2A A                                      EDTCDE(Z)
6.2A A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2a  *                                     1 = ja
6.2a  *                                     0 = nei
6.2a A            FAABFS         1S 0
6.2a A                                      COLHDG('Best.''/Best.for')
6.2a A                                      TEXT('Best/Bestf.for')
6.2A A                                      VALUES(0 1 2)
6.2A A                                      EDTCDE(Z)
6.2A A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2a  *                                     0 = Bestilling
6.2a  *                                     1 = Bestillingsforslag
6.2a  *                                     2 = Begge deler styre på otyp
6.2C A            FAASSV         1S 0
6.2C A                                      COLHDG('Skaffv.''i varesøk')
6.2C A                                      TEXT('Skaffev.i varesøk')
6.2C A                                      VALUES(0 1)
6.2C A                                      EDTCDE(Z)
6.2A A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2C  *                                     0 = ja
6.2C  *                                     1 = nei
6.2C A            FAAMSA         1S 0
6.2C A                                      COLHDG('Mobilnr''saksbeh.')
6.2C A                                      TEXT('Mobilnr i saksbeh.txt')
6.2C A                                      VALUES(0 1)
6.2C A                                      EDTCDE(Z)
6.2A A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2C  *                                     1 = ja
6.2C  *                                     0 = nei
6.2O A            FAAVIS         1S 0
6.2O A                                      COLHDG('Poster til' 'Visma')
6.2O A                                      TEXT('Poster til Visma')
6.2O A                                      VALUES(0 1)
6.2O A                                      EDTCDE(Z)
6.2O A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2O  *                                     1 = ja
6.2O  *                                     0 = nei
6.2Z A            FAAK01         1S 0
6.2Z A                                      COLHDG('Sende SMS Varem.')
6.2Z A                                      TEXT('Sende SMS Varemot.')
6.2Z A                                      VALUES(0 1)
6.2Z A                                      EDTCDE(Z)
6.2Z A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2Z  *                                     1 = ja
6.2Z  *                                     0 = nei
6.2P A            FAAK02         1S 0
6.2P A                                      COLHDG('Splitte ordre')
6.2P A                                      TEXT('Splitte ordre')
6.2P A                                      VALUES(0 1)
6.2P A                                      EDTCDE(Z)
6.2P A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2P  *                                     1 = ja
6.2P  *                                     0 = nei
6.2O A            FAAK03         1S 0
6.2O A                                      COLHDG('Valg Øk-system')
6.2O A                                      TEXT('Valg''Øk.system del 1')
6.2O A                                      VALUES(0 1 2 3 4 5 6 7 8 9)
6.2P A                                      EDTCDE(Z)
6.2O A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2O  *                                     0 = standard
6.2O  *                                     1 = nei
6.2O A            FAAK04         1S 0
6.2O A                                      COLHDG('Oppdater NX ØK')
6.2O A                                      TEXT('Oppdater NX ØK')
6.2O A                                      VALUES(0 1)
6.2O A                                      EDTCDE(Z)
6.2O A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2O  *                                     1 = ja
6.2O  *                                     0 = nei
6.2O A            FAAK05         1S 0
6.3d A                                      COLHDG('Hindre vis tilb.pris')
6.3d A                                      TEXT('Ikkevis tilb.')
6.2O A                                      VALUES(0 1)
6.2O A                                      EDTCDE(Z)
6.2O A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2O  *                                     1 = ja
6.2O  *                                     0 = nei
6.2O A            FAAK06         1S 0
6.2O A                                      COLHDG('Ledig')
6.2O A                                      TEXT('Ledig')
6.2O A                                      VALUES(0 1)
6.2O A                                      EDTCDE(Z)
6.2O A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2O  *                                     1 = ja
6.2O  *                                     0 = nei
6.2O A            FAAK07         1S 0
6.2O A                                      COLHDG('Ledig')
6.2O A                                      TEXT('Ledig')
6.2O A                                      VALUES(0 1)
6.2O A                                      EDTCDE(Z)
6.2O A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2O  *                                     1 = ja
6.2O  *                                     0 = nei
6.2O A            FAAK08         1S 0
6.2O A                                      COLHDG('Valg Øk-system')
6.2O A                                      TEXT('Valg''Øk.system del 2')
6.2O A                                      VALUES(0 1 2 3)
6.2O A                                      EDTCDE(Z)
6.2O A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2O  *                                     1 = ja
6.2O  *                                     0 = nei
6.2O A            FAAK09         1S 0
6.2O A                                      COLHDG('Ledig')
6.2O A                                      TEXT('Ledig')
6.2O A                                      VALUES(0 1)
6.2O A                                      EDTCDE(Z)
6.2O A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2O  *                                     1 = ja
6.2O  *                                     0 = nei
6.2O A            FAAK10         1S 0
6.2O A                                      COLHDG('Ledig')
6.2O A                                      TEXT('Ledig')
6.2O A                                      VALUES(0 1)
6.2O A                                      EDTCDE(Z)
6.2O A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
6.2O  *                                     1 = ja
6.2O  *                                     0 = nei
      *
     A            FAANOD         6S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Nobb deltakernr')
     A                                      TEXT('Nobb deltakernr')
      *
     A            FAAK98         2A         TEXT('Kode 98')
     A                                      COLHDG('Kode' '98')
     A            FAAPRT         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Droppe' 'firmaoppl.')
     A                                      TEXT('Droppe firmaoppl.')
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(FMA0120 *LIBL/QMFOFAX)
6.40  * feltene legges i side-tabell- sy sammen i 6.40 *
6.40 A            FAAK11         1S 0
6.40 A                                      EDTCDE(Z)
6.40 A                                      COLHDG('Bruk' 'Forskuddsbet')
6.40 A                                      TEXT('Bruk forskuddsbet')
6.40 A                                      VALUES(0 1)
6.40 A                                      CHKMSGID(FMA0120 *LIBL/QMFOFAX)
6.40 A
6.40 A            FAAK12         1S 0
6.40 A                                      EDTCDE(Z)
6.40 A                                      COLHDG('Krav' 'Dep. Kont.O.')
6.40 A                                      TEXT('Krav dep. Kont.O.')
6.40 A                                      VALUES(0 1)
6.40 A                                      CHKMSGID(FMA0120 *LIBL/QMFOFAX)
6.40 A            FAAK13         1S 0
6.40 A                                      EDTCDE(Z)
6.40 A                                      COLHDG('BMC-kund' 'ik.hurt.')
6.40 A                                      TEXT('BMC-kund ik.hurt.')
6.40 A                                      VALUES(0 1)
6.40 A                                      CHKMSGID(FMA0120 *LIBL/QMFOFAX)
6.40 A            FAAK14         1S 0
6.40 A                                      EDTCDE(Z)
6.40 A                                      COLHDG('avd.krav' 'v/hurt.o')
6.40 A                                      TEXT('avd.krav v/hurt.o')
6.40 A                                      VALUES(0 1)
6.40 A                                      CHKMSGID(FMA0120 *LIBL/QMFOFAX)
6.40 A            FAAK15         1S 0
6.40 A                                      EDTCDE(Z)
6.40 A                                      COLHDG('spes.avt' 'v/hurt.o')
6.40 A                                      TEXT('avd.krav v/hurt.o')
6.40 A                                      VALUES(0 1)
6.40 A                                      CHKMSGID(FMA0120 *LIBL/QMFOFAX)
6.40 A            FAAMAP         4S 1
6.40 A                                      EDTCDE(Z)
6.40 A                                      COLHDG('Minimum' 'andel%')
6.40 A                                      TEXT('Minimum andel %')
6.40 A            FAAKBS        11S 2
6.40 A                                      EDTCDE(Z)
6.40 A                                      COLHDG('Krav' 'beløp')
6.40 A                                      TEXT('Krav størr enn bel')
6.40 A            FAATJP         4S 1
6.40 A                                      EDTCDE(Z)
6.40 A                                      COLHDG('Tillatt''just%')
6.40 A                                      TEXT('Tillatt just%')
6.40 A            FAATJB        11S 2
6.40 A                                      EDTCDE(Z)
6.40 A                                      COLHDG('Tillatt''j.bel')
6.40 A                                      TEXT('Tillatt just bel.')
6.40 A            FAAFBK         2S 0
6.40 A                                      EDTCDE(Z)
6.40 A                                      COLHDG('Bil.kod''Fors/del')
6.40 A                                      TEXT('Bil.kod Forsk/del')
7.f1 A            FAAPRN         1A
7.f1 A                                      COLHDG('Fargev ikke bet. dep')
7.f1 A                                      TEXT('Fargev ikke bet. dep')
7.f1 A            FAAPRP         1A
7.f1 A                                      COLHDG('Fargev bet. dep.')
7.f1 A                                      TEXT('Fargev bet. dep')
6.40  *
6.10 A            FAAODA    R               REFFLD(FÅODAT)
6.10 A            FAAOTI    R               REFFLD(FÅOTIM)
6.10 A            FAAOUS    R               REFFLD(FÅOUSR)
6.10 A            FAAEDA    R               REFFLD(FÅEDAT)
6.10 A            FAAETI    R               REFFLD(FÅETIM)
6.10 A            FAAEUS    R               REFFLD(FÅEUSR)
      *
      * Ofak-jobb-status-register           (FAJ)
      *
     A            FAJFIR    R               REFFLD(FÅFIRM)
      *
     A            FAJB01    R               REFFLD(FÅJANE)
     A                                      TEXT('Ofak Fakturering')
     A                                      COLHDG('Ofak' 'Fakt')
      *
     A            FAJB02    R               REFFLD(FÅJANE)
     A                                      TEXT('Ofak Journal')
     A                                      COLHDG('Ofak' 'Journ')
      *
     A            FAJB03    R               REFFLD(FÅJANE)
     A                                      TEXT('Butikk Oppgjør')
     A                                      COLHDG('Butikk' 'Oppgjør')
      *
     A            FAJB04    R               REFFLD(FÅJANE)
     A                                      TEXT('Butikk Journal')
     A                                      COLHDG('Butikk' 'Journ')
      *
     A            FAJB05    R               REFFLD(FÅJANE)
     A                                      TEXT('Ledig')
     A                                      COLHDG('Ledig')
      *
     A            FAJB06    R               REFFLD(FÅJANE)
     A                                      TEXT('Ledig')
     A                                      COLHDG('Ledig')
      *
     A            FAJB07    R               REFFLD(FÅJANE)
     A                                      TEXT('Ledig')
     A                                      COLHDG('Ledig')
      *
     A            FAJB08    R               REFFLD(FÅJANE)
     A                                      TEXT('Ledig')
     A                                      COLHDG('Ledig')
      *
     A            FAJB09    R               REFFLD(FÅJANE)
     A                                      TEXT('Ledig')
     A                                      COLHDG('Ledig')
      *
     A            FAJB10    R               REFFLD(FÅJANE)
     A                                      TEXT('Ledig')
     A                                      COLHDG('Ledig')
      *
     A            FAWS01        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arb.stasj.')
      *
     A            FAWS02        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arb.stasj.')
      *
     A            FAWS03        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arb.stasj.')
      *
     A            FAWS04        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arb.stasj.')
      *
     A            FAWS05        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arb.stasj.')
      *
     A            FAWS06        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arb.stasj.')
      *
     A            FAWS07        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arb.stasj.')
      *
     A            FAWS08        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arb.stasj.')
      *
     A            FAWS09        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arb.stasj.')
      *
     A            FAWS10        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arb.stasj.')
      *
     A            FAUS01        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FAUS02        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FAUS03        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FAUS04        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FAUS05        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FAUS06        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FAUS07        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FAUS08        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FAUS09        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FAUS10        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FADA01          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            FADA02          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            FADA03          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            FADA04          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            FADA05          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            FADA06          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            FADA07          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            FADA08          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            FADA09          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            FADA10          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            FATI01          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
      *
     A            FATI02          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
      *
     A            FATI03          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
      *
     A            FATI04          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
      *
     A            FATI05          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
      *
     A            FATI06          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
      *
     A            FATI07          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
      *
     A            FATI08          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
      *
     A            FATI09          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
      *
     A            FATI10          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
6.10 A            FAJODA    R               REFFLD(FÅODAT)
6.10 A            FAJOTI    R               REFFLD(FÅOTIM)
6.10 A            FAJOUS    R               REFFLD(FÅOUSR)
6.10 A            FAJEDA    R               REFFLD(FÅEDAT)
6.10 A            FAJETI    R               REFFLD(FÅETIM)
6.10 A            FAJEUS    R               REFFLD(FÅEUSR)
      *
      * Ofak-bruker-register                (FB)
      *
     A            FBFIRM    R               REFFLD(FÅFIRM)
     A            FBUSER    R               REFFLD(FÅUSER)
     A            FBVREF        20A         TEXT('Vår referanse')
     A                                      COLHDG('Vår referanse')
      *
     A            FBSELG    R               REFFLD(FÅSELG)
     A            FBBIND         1A         TEXT('Ordremerking')
     A                                      COLHDG('Ordre' 'merk.')
     A                                      VALUES('J' 'N' 'X')
     A                                      CHKMSGID(FMB0100 *LIBL/QMFOFAK)
      *
     A            FBOTYP    R               REFFLD(FÅOTYP)
     A            FBKO98         2A         TEXT('Kode 98')
      *
     A            FBCORD         1S 0       TEXT('Cursor ved ordre')
     A                                      COLHDG('Cursor' 'ved' 'ordre')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMB0110 *LIBL/QMFOFAK)
      *
     A            FBVISE         1S 0       TEXT('Vis bilde automatisk')
     A                                      COLHDG('Vis' 'bilde' 'aut.')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2 3)
     A                                      CHKMSGID(FMB0120 *LIBL/QMFOFAK)
      *
     A            FBKO01    R               REFFLD(FÅJANE)
     A                                      TEXT('Vise kostpris')
     A                                      COLHDG('Vise' 'kp')
      *
     A            FBKO02    R               REFFLD(FÅJANE)
     A                                      TEXT('Skjule/åpne kp')
     A                                      COLHDG('Skjule/' 'åpne kp')
      *
     A            FBKO03    R               REFFLD(FÅJANE)
     A                                      TEXT('Frigi låst ordre')
     A                                      COLHDG('Frigi' 'låst' 'ordre')
      *
     A            FBKO04    R               REFFLD(FÅJANE)
     A                                      TEXT('Slette pakks.')
     A                                      COLHDG('Slette' 'pakks.')
      *
     A            FBKO05    R               REFFLD(FÅJANE)
     A                                      TEXT('Vise bilde')
     A                                      COLHDG('Vise' 'bilde')
      *
     A            FBKO06    R               REFFLD(FÅJANE)
     A                                      TEXT('Oppheve ordre')
     A                                      COLHDG('Opphev' 'ordre')
      *
     A            FBKO07    R               REFFLD(FÅJANE)
     A                                      TEXT('Endre pakkseddel')
     A                                      COLHDG('Endr.' 'pakks.')
      *
     A            FBKO08    R               REFFLD(FÅJANE)
     A                                      TEXT('Kjøre fakturering')
     A                                      COLHDG('Kjøre' 'fakt.')
      *
     A            FBKO09    R               REFFLD(FÅJANE)
     A                                      TEXT('Oppheve pakkseddel')
     A                                      COLHDG('Opphev' 'Pakks')
      *
     A            FBKO10    R               REFFLD(FÅJANE)
     A                                      TEXT('Nettbutikkbruker')
     A                                      COLHDG('Nettbut' 'bruker')
      *
     A            FBKO11    R               REFFLD(FÅJANE)
     A                                      TEXT('Oppdatere regnskap')
     A                                      COLHDG('Oppdat' 'regnsk')
      *
     A            FBKO12    R               REFFLD(FÅJANE)
     A                                      TEXT('Avsatt 12')
     A                                      COLHDG('Avsatt 12')
6.2J A                                      VALUES(0 1 2)
6.2J A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
6.2J A                                      EDTCDE(Z)
      *
     A            FBKO13    R               REFFLD(FÅJANE)
     A                                      TEXT('Avsatt 13')
     A                                      COLHDG('Avsatt 13')
      *
     A            FBKO14    R               REFFLD(FÅJANE)
6.2y A                                      TEXT('Valg F8 tillatt')
6.2y A                                      COLHDG('F8 Tillatt')
      *
     A            FBKO15    R               REFFLD(FÅJANE)
6.2y A                                      TEXT('Valg 50 tillatt')
6.2y A                                      COLHDG('Valg 50 tillatt')
      *
6.31 A            FBKO16    R               REFFLD(FÅJANE)
6.31 A                                      TEXT('Tilbudsoppfølgning')
6.31 A                                      COLHDG('Tilbudsoppfølg')
6.31 A                                      VALUES(0 1 2 3 4 5 6 7)
      *
6.35 A            FBKO17    R               REFFLD(FÅJANE)
6.35 A                                      TEXT('Valg F6 tillatt')
6.35 A                                      COLHDG('F6 Tillatt')
6.40  *
6.40 A            FBKO18    R               REFFLD(FÅJANE)
6.40 A                                      TEXT('BM Tillatt Dep.bet')
6.40 A                                      COLHDG('BM Till.Dep.bet')
      *
6.3b A            FBKO19    R               REFFLD(FÅJANE)
6.3b A                                      TEXT('MGR - vedl.rab.matrise')
6.3b A                                      COLHDG('MGR - ved.rab.mat')
6.3b  *
6.3b A            FBKO20    R               REFFLD(FÅJANE)
6.3b A                                      TEXT('MGR - vedl.kunde felter')
6.3b A                                      COLHDG('MGR - ved.kund felt')
5.21  *
5.21 A            FBUTLA    R               REFFLD(FÅVALA)
5.21 A                                      COLHDG('Save' 'Utelate')
5.21 A            FBOTY1    R               REFFLD(FÅOTYP)
5.21 A                                      COLHDG('Save' 'Otype 1')
5.21 A            FBOTY2    R               REFFLD(FÅOTYP)
5.21 A                                      COLHDG('Save' 'Otype 2')
5.21 A            FBOTY3    R               REFFLD(FÅOTYP)
5.21 A                                      COLHDG('Save' 'Otype 3')
5.21 A            FBITYP    R               REFFLD(FÅOTYP)
5.21 A                                      COLHDG('Save' 'Infotype')
5.21 A            FBUSE2    R               REFFLD(FÅUSER)
5.21 A                                      COLHDG('Save' 'Bruker')
5.21 A            FBKUND    R               REFFLD(FÅKUND)
5.21 A                                      COLHDG('Save' 'Kunde')
5.21 A            FBBENR         6S 0
5.21 A                                      COLHDG('Save' 'Best.nr')
5.21 A            FBSEL2         4S 0
5.21 A                                      COLHDG('Save' 'Selger')
5.21 A            FBAVDE         4S 0
5.21 A                                      COLHDG('Save' 'Avdeling')
5.21 A            FBLAGE         2S 0
5.21 A                                      COLHDG('Save' 'Lager')
5.21 A            FBREKV        20A
5.21 A                                      COLHDG('Save' 'Rekvisisjon')
5.21 A            FBBELP         9S 0
5.21 A                                      COLHDG('Save' 'Beløp')
5.21 A            FBVALG    R               REFFLD(FÅVALA)
5.21 A                                      COLHDG('Save' 'Valg')
5.21 A            FBLMAT         2S 0
5.21 A                                      COLHDG('Save' 'Lev.måte')
5.21 A            FBOANM    R               REFFLD(FÅOTYP)
5.21 A                                      COLHDG('Save' 'anmerkn')
6.10 A            FBODAT    R               REFFLD(FÅODAT)
6.10 A            FBOTIM    R               REFFLD(FÅOTIM)
6.10 A            FBOUSR    R               REFFLD(FÅOUSR)
6.10 A            FBEDAT    R               REFFLD(FÅEDAT)
6.10 A            FBETIM    R               REFFLD(FÅETIM)
6.10 A            FBEUSR    R               REFFLD(FÅEUSR)
      *
      * Pris-recordformat-register          (FC)
      *
     A            FCFIRM    R               REFFLD(FÅFIRM)
     A            FCRFMT    R               REFFLD(FÅRFMT)
     A            FCBESK    R               REFFLD(FÅBESK_30)
6.10 A            FCODAT    R               REFFLD(FÅODAT)
6.10 A            FCOTIM    R               REFFLD(FÅOTIM)
6.10 A            FCOUSR    R               REFFLD(FÅOUSR)
     A            FCEDAT    R               REFFLD(FÅEDAT)
     A            FCETIM    R               REFFLD(FÅETIM)
     A            FCEUSR    R               REFFLD(FÅEUSR)
      *
      * Ordre-linje-register                (FD)
      *
     A            FDFIRM    R               REFFLD(FÅFIRM)
      *
     A            FDNUMM    R               REFFLD(FÅNUMM)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMD0600 *LIBL/QMFOFAK)
      *
     A            FDSUFF    R               REFFLD(FÅSUFF)
      *
     A            FDLINE    R               REFFLD(FÅLINE)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMD0610 *LIBL/QMFOFAK)
      *
     A            FDOTYP    R               REFFLD(FÅOTYP)
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMD0620 *LIBL/QMFOFAK)
      *
     A            FDLTYP         2A         TEXT('Linje-type')
     A                                      COLHDG('Linje-type')
      *
     A            FDLETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
      *
     A            FDVARE    R               REFFLD(FÅVARE)
     A            FDENH1    R               REFFLD(FÅENHE)
     A            FDLAGE    R               REFFLD(FÅLAGE)
      *
     A            FDKAKK         1S 0       TEXT('Kode, akk.type')
     A                                      COLHDG('Kode,' 'akk.type')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2 3)
     A                                      CHKMSGID(FMD0100 *LIBL/QMFOFAK)
      *
     A            FDKPRI         1A         TEXT('Kode, pris')
     A                                      COLHDG('Kode' 'pris')
6.3E A                                      VALUES(' ' 'N' 'T' 'F' 'A' 'B')
     A                                      CHKMSGID(FMD0110 *LIBL/QMFOFAK)
      *
     A            FDKGEB         1S 0       TEXT('Kode, gebyr/rest')
     A                                      COLHDG('Kode' 'gebyr/rest')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMD0130 *LIBL/QMFOFAK)
      *
     A            FDLASS         2S 0       TEXT('Kode, lass-nr')
     A                                      COLHDG('Kode' 'lass-nr')
     A                                      EDTCDE(Z)
      *
     A            FDKUND    R               REFFLD(FÅKUND)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMD0630 *LIBL/QMFOFAK)
      *
6.NU A            FDBENR         8S 0       TEXT('Bestillings-nr')
     A                                      COLHDG('Best' 'nr.')
     A                                      EDTCDE(Z)
5.05  *
5.05 A            FDBSUF         2S 0       TEXT('Bestillings-suff')
5.05 A                                      COLHDG('Best' 'suff.')
5.05 A                                      EDTCDE(Z)
5.23  *
5.23 A            FDBLIN         4S 0       TEXT('Bestillings-linje')
5.23 A                                      COLHDG('Best' 'linje')
5.23 A                                      EDTCDE(Z)
      *
     A            FDLDOR         6S 0       TEXT('Leverandør-nr')
     A                                      COLHDG('Levd.' 'nr.')
     A                                      EDTCDE(Z)
      *
     A            FDLDAT    R               REFFLD(FÅLDAT)
      *
     A            FDAVDE         4S 0       TEXT('Avdeling')
     A                                      COLHDG('Avd')
     A                                      EDTCDE(Z)
      *
     A            FDKONT         6S 0       TEXT('Kontonummer')
     A                                      COLHDG('Konto' 'nr.')
     A                                      EDTCDE(Z)
      *
4.01 A            FDSPES         4S 0       TEXT('Spesifikasjon')
     A                                      COLHDG('Spes')
     A                                      EDTCDE(Z)
      *
6.26 A            FDPROJ    R               REFFLD(FÅPROJ)
      *
5.31 A            FDALME    R               REFFLD(FÅALME)
5.31 A            FDBRTY    R               REFFLD(FÅBRTY)
5.31 A            FDPRIV    R               REFFLD(FÅPRIV)
5.31  *
6.27 A            FDAKTI    R               REFFLD(FÅAKTI)
      *
6.33 A            FDLVAR    R               REFFLD(FÅLVAR)
     A                                      TEXT('Lev.dør. varenr.')
     A                                      COLHDG('Levd' 'varenr.')
      *
     A            FDNOBB    R               REFFLD(FÅNOBB)
      *
     A            FDTEK1    R               REFFLD(FÅTEK1)
     A            FDTEK2    R               REFFLD(FÅTEK2)
      *
     A            FDANTA    R               REFFLD(FÅANTA)
     A                                      COMP(LT 99999999)
     A                                      CHKMSGID(FMD0640 *LIBL/QMFOFAK)
      *
     A            FDANTB        11S 3       TEXT('Antall bestilt')
     A                                      COLHDG('Ant' 'best')
     A                                      EDTCDE(M)
     A                                      COMP(LT 99999999)
     A                                      CHKMSGID(FMD0640 *LIBL/QMFOFAK)
      *
     A            FDANTC        11S 3       TEXT('Antall innkommet')
     A                                      COLHDG('Ant' 'innkommet')
     A                                      EDTCDE(M)
     A                                      COMP(LT 99999999)
     A                                      CHKMSGID(FMD0640 *LIBL/QMFOFAK)
      *
     A            FDOPPR         9S 2       TEXT('Opprinnelig pris')
     A                                      COLHDG('Oppr.' 'pris')
     A                                      EDTWRD('     0 ,  ')
      *
     A            FDSAPR         9S 2       TEXT('Salgspris')
     A                                      COLHDG('Salgspris')
     A                                      EDTWRD('     0 ,  ')
      *
     A            FDKOPR         9S 2       TEXT('Kost-pris')
     A                                      COLHDG('Kostpris')
     A                                      EDTWRD('     0 ,  ')
      *
     A            FDINPR         9S 2       TEXT('Innkjøpspris')
     A                                      COLHDG('Innk.pris')
     A                                      EDTWRD('     0 ,  ')
      *
     A            FDRAB1         5S 2       TEXT('Linje-rabatt 1')
     A                                      COLHDG('Linje' 'rab.1')
     A                                      EDTCDE(Z)
     A                                      COMP(LE 100)
     A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
      *
     A            FDRAB2         5S 2       TEXT('Linje-rabatt 2')
     A                                      COLHDG('Linje' 'rab.2')
     A                                      EDTCDE(Z)
     A                                      COMP(LE 100)
     A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
      *
     A            FDRAB3         5S 2       TEXT('Linje-rabatt 3')
     A                                      COLHDG('Linje' 'rab.3')
     A                                      EDTCDE(Z)
     A                                      COMP(LE 100)
     A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
      *
     A            FDRAB4         5S 2       TEXT('Linje-rabatt 4')
     A                                      COLHDG('Linje' 'rab.4')
     A                                      EDTCDE(Z)
     A                                      COMP(LE 100)
     A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
      *
     A            FDRAB5         5S 2       TEXT('Linje-rabatt 5')
     A                                      COLHDG('Linje' 'rab.5')
     A                                      EDTCDE(Z)
     A                                      COMP(LE 100)
     A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
      *
5.31 A            FDBRR1         5S 2       TEXT('Bruksrettrabatt 1')
5.31 A                                      COLHDG('Bruksrett' 'rab.1')
5.31 A                                      EDTCDE(Z)
5.31 A                                      COMP(LE 100)
5.31 A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
5.31  *
5.31 A            FDBRR2         5S 2       TEXT('Bruksrettrabatt 2')
5.31 A                                      COLHDG('Bruksrett' 'rab.2')
5.31 A                                      EDTCDE(Z)
5.31 A                                      COMP(LE 100)
5.31 A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
5.31  *
     A            FDPASL         5S 2       TEXT('Påslag')
     A                                      COLHDG('Påslag')
     A***                                   EDTCDE(Z)
     A                                      EDTWRD(' 0 ,  ')
     A                                      COMP(LT 999)
     A                                      CHKMSGID(FMD0660 *LIBL/QMFOFAK)
6.13  *
6.13 A            FDPSLM    R               REFFLD(FÅPSLM)
      *
     A            FDRKR1        11S 2       TEXT('Rab.1 Kr.')
     A                                      COLHDG('Rab.1 Kr.')
     A                                      EDTCDE(M)
      *
     A            FDRKR2        11S 2       TEXT('Rab.2 Kr.')
     A                                      COLHDG('Rab.2 Kr.')
     A                                      EDTCDE(M)
      *
     A            FDSUMS        11S 2       TEXT('Sum salg')
     A                                      COLHDG('Sum salg')
     A                                      EDTCDE(M)
      *
     A            FDSUMR        11S 2       TEXT('Sum rabatt')
     A                                      COLHDG('Sum rabatt')
     A                                      EDTCDE(M)
      *
     A            FDSUMK        11S 2       TEXT('Sum kost')
     A                                      COLHDG('Sum kost')
     A                                      EDTCDE(M)
      *
5.35 A            FDBBON        11S 2       TEXT('Beregn. bonus')
5.35 A                                      COLHDG('Beregn bonus')
5.35 A                                      EDTCDE(M)
      *
5.31 A            FDOMVA         1A         TEXT('Økonomi MVA-kode')
5.31 A                                      COLHDG('OKON' 'MVA')
5.31  *
     A            FDLVRE         1S 0       TEXT('Lokalt vreg')
     A                                      COLHDG('Lok' 'vreg')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
      *
     A            FDOLAG         1S 0       TEXT('Kode, oppd. lager')
     A                                      COLHDG('Kode, oppd. lager')
     A                                      EDTCDE(Z)
      *
     A            FDOGRP    R               REFFLD(FÅOGRP)
     A            FDHGRP    R               REFFLD(FÅHGRP)
     A            FDUGRP    R               REFFLD(FÅUGRP)
      *
5.37 A            FDGAVE        12A         TEXT('Gavekortnr')
5.37 A                                      COLHDG('Gavekortnr')
5.41  *
5.41 A            FDVARI       140A         TEXT('Varians')
5.41 A                                      COLHDG('Varians')
      *
     A            FDEDIH         6S 0       TEXT('Edi-hode')
     A                                      COLHDG('Edi' 'hode')
     A                                      EDTCDE(Z)
      *
     A            FDEDIL         6S 0       TEXT('Edi-linje')
     A                                      COLHDG('Edi' 'linje')
     A                                      EDTCDE(Z)
      *
     A            FDKAMP    R               REFFLD(FÅKAMP)
5.23  *
5.23 A            FDKBNR        15A         TEXT('Kundens best.nr')
5.23 A                                      COLHDG('Kundens' 'best.nr')
5.23  *
5.23 A            FDKBLI         6S 0       TEXT('Kundens best.linje')
5.23 A                                      COLHDG('Kundens' 'best.linje')
5.23  *
5.60 A            FDEANN    R               REFFLD(FÅEANN)
5.70  *
5.70 A            FDPRGR    R               REFFLD(FÅPRGR)
5.70  *
5.70 A            FDOPRG         1S 0       TEXT('Kode, Overst. prisgr')
5.70 A                                      COLHDG('Kode, Overst.prgr')
6.14 A                                      EDTCDE(Z)
6.14  * skaffevareinfo
6.14 A            FDBLDO    R               REFFLD(FÅLDOR)
6.14 A                                      COLHDG('Bet.leverandør')
6.14 A                                      TEXT('Bet.leverandør')
6.14 A                                      EDTCDE(Z)
6.14 A            FDBOGR    R               REFFLD(FÅOGRP)
6.14 A                                      COLHDG('Bet.Overgruppe')
6.14 A                                      TEXT('Bet.Ogrp.')
6.14 A                                      EDTCDE(Z)
6.14 A            FDBHGR    R               REFFLD(FÅHGRP)
6.14 A                                      COLHDG('Bet.Hovedgruppe')
6.14 A                                      TEXT('Bet.Hgrp.')
6.14 A                                      EDTCDE(Z)
6.14 A            FDBUGR    R               REFFLD(FÅUGRP)
6.14 A                                      COLHDG('Bet.Undergruppe')
6.14 A                                      TEXT('Bet.Ugrp.')
6.14 A                                      EDTCDE(Z)
6.14 A            FDBMOD    R               REFFLD(FÅMODN)
6.14 A                                      COLHDG('Bet.Modul')
6.14 A                                      TEXT('Bet.Modul')
6.14 A                                      EDTCDE(Z)
6.14 A            FDBVAR    R               REFFLD(FÅVARE)
6.14 A                                      COLHDG('Bet.Vare')
6.14 A                                      TEXT('Bet.Vare')
6.14 A            FDBVTY    R               REFFLD(FÅVTYP)
6.14 A                                      COLHDG('Bet.Vtyp')
6.14 A                                      TEXT('Bet.Vtyp')
6.14 A            FDBLET    R               REFFLD(FÅLETY)
6.14 A                                      COLHDG('Bet.Ltyp')
6.14 A                                      TEXT('Bet.Ltyp')
6.14 A                                      EDTCDE(Z)
6.14 A            FDBBET        35A
6.14 A                                      COLHDG('Betingelse')
6.14 A                                      TEXT('Betingelse')
6.14 A            FDBNTP         9S 2
6.14 A                                      COLHDG('Bet.Netttopris')
6.14 A                                      TEXT('Bet.Nettopris')
6.14 A            FDBIFA         8S 6
6.14 A                                      COLHDG('Bet.Innkj.faktor')
6.14 A                                      TEXT('Bet.Innkjøpfaktor')
      * skaffevare påslag
6.14 A            FDPOGR    R               REFFLD(FÅOGRP)
6.14 A                                      COLHDG('Pås.Overgruppe')
6.14 A                                      TEXT('Pås.Ogrp.')
6.14 A                                      EDTCDE(Z)
6.14 A            FDPHGR    R               REFFLD(FÅHGRP)
6.14 A                                      COLHDG('Bet.Hovedgruppe')
6.14 A                                      TEXT('Bet.Hgrp.')
6.14 A                                      EDTCDE(Z)
6.14 A            FDPUGR    R               REFFLD(FÅUGRP)
6.14 A                                      COLHDG('Pås.Undergruppe')
6.14 A                                      TEXT('Pås.Ugrp.')
6.14 A                                      EDTCDE(Z)
6.14 A            FDPLDO    R               REFFLD(FÅLDOR)
6.14 A                                      COLHDG('Pås.leverandør')
6.14 A                                      TEXT('Pås.leverandør')
6.14 A                                      EDTCDE(Z)
6.14 A            FDPMOD    R               REFFLD(FÅMODN)
6.14 A                                      COLHDG('Pås.Modul')
6.14 A                                      TEXT('Pås.Modul')
6.14 A                                      EDTCDE(Z)
6.14 A            FDPVAR    R               REFFLD(FÅVARE)
6.14 A                                      COLHDG('Pås.Vare')
6.14 A                                      TEXT('Pås.Vare')
6.14 A            FDPKPR    R               REFFLD(FÅKPRI)
6.14 A                                      COLHDG('Pås.Kpr.')
6.14 A                                      TEXT('Pås.Kpr.')
6.14 A            FDPVTY    R               REFFLD(FÅVTYP)
6.14 A                                      COLHDG('Pås.Vtyp')
6.14 A                                      TEXT('Pås.Vtyp')
6.14 A            FDPLET    R               REFFLD(FÅLETY)
6.14 A                                      COLHDG('Pås.Ltyp')
6.14 A                                      TEXT('Bet.Ltyp')
6.14 A            FDPKFA         8S 6
6.14 A                                      COLHDG('Pås.Kost.fakt')
6.14 A                                      TEXT('Pås.Kost.fakt')
6.14 A            FDPKBE         7S 2
6.14 A                                      COLHDG('Pås.Kost.bel.')
6.14 A                                      TEXT('Pås.Kost.bel.')
6.14 A            FDPSFA         7S 2
6.14 A                                      COLHDG('Pås.Salg.fakt')
6.14 A                                      TEXT('Pås.Salg.fakt')
6.14 A            FDNOPR         9S 2
6.14 A                                      COLHDG('Nobb pris')
6.14 A                                      TEXT('Nobb pris')
6.14 A            FDPEN1    R               REFFLD(FÅENHE)
6.14 A            FDPEN2    R               REFFLD(FÅENHE)
6.14 A            FDPEN3    R               REFFLD(FÅENHE)
6.14 A            FDOFP1        12S 6
6.14 A                                      COLHDG('Omregn.fakt1')
6.14 A                                      TEXT('Omregn.fakt1')
6.14 A            FDOFP2        12S 6
6.14 A                                      COLHDG('Omregn.fakt2')
6.14 A                                      TEXT('Omregn.fakt2')
6.14 A            FDOFP3        12S 6
6.14 A                                      COLHDG('Omregn.fakt2')
6.14 A                                      TEXT('Omregn.fakt2')
6.14 A            FDOFV2        12S 6
6.14 A                                      COLHDG('Omregn.faktV')
6.14 A                                      TEXT('Omregn.faktV')
6.14 A            FDOFV3        12S 6
6.14 A                                      COLHDG('Omregn.faktV')
6.14 A                                      TEXT('Omregn.faktV')
6.24  *
6.24 A            FDPRTX         1A         TEXT('Print')
6.24 A                                      COLHDG('Print')
8.05 A            FDKOP2         9S 2       TEXT('Kostpris 2')
8.05 A                                      COLHDG('Kost pris 2')
8.05 A                                      EDTWRD('     0 ,  ')
      *
     A            FDSTIM          T         TEXT('Salg kl.')
     A                                      COLHDG('Salg' 'kl.')
5.09  *
5.09 A            FDWSID        10A         TEXT('Arbeidstasjon')
5.09 A                                      COLHDG('Arbeidstasjon')
5.09  *
5.09 A            FDUSER        10A         TEXT('Bruker-ID')
5.09 A                                      COLHDG('Bruker-ID')
5.09  *
5.09 A            FDDATE          L         TEXT('Dato slettet')
5.09 A                                      COLHDG('Dato slettet')
5.09  *
5.09 A            FDTIME          T         TEXT('Klokkeslett')
5.09 A                                      COLHDG('Klokken')
6.10 A            FDODAT    R               REFFLD(FÅODAT)
6.10 A            FDOTIM    R               REFFLD(FÅOTIM)
6.10 A            FDOOUS    R               REFFLD(FÅOUSR)
6.10 A            FDEDAT    R               REFFLD(FÅEDAT)
6.10 A            FDETIM    R               REFFLD(FÅETIM)
6.10 A            FDEUSR    R               REFFLD(FÅEUSR)
      *
      * Enhet konvertering-register         (FE)
      *
     A            FEFIRM    R               REFFLD(FÅFIRM)
     A            FEENHF         3A         TEXT('Enhet fra')
     A                                      COLHDG('Enh' 'fra')
     A            FEENHT         3A         TEXT('Enhet til')
     A                                      COLHDG('Enh' 'til')
      *
      * Felles trans.fil mot økonomi        (FF)
      *
     A            FFFIRM    R               REFFLD(FÅFIRM)
      *
     A            FFPERI         4S 0       TEXT('Periode')
     A                                      COLHDG('Peri' 'ode')
     A                                      EDTCDE(Z)
      *
     A            FFBUNT         5S 0       TEXT('Bunt-nummer')
     A                                      COLHDG('Bunt' 'nr')
     A                                      EDTCDE(Z)
      *
6.NU A            FFBILN         8S 0       TEXT('Bilagsnummer')
     A                                      COLHDG('Bilag' 'nr')
     A                                      EDTCDE(Z)
      *
     A            FFBILL         4S 0       TEXT('Bilagslinje')
     A                                      COLHDG('Bilag' 'linje')
     A                                      EDTCDE(Z)
      *
     A            FFBDAT          L         TEXT('Bilagsdato')
     A                                      COLHDG('Bilags' 'dato')
      *
     A            FFFDAT          L         TEXT('Forfallsdato')
     A                                      COLHDG('Forf.' 'dato')
      *
     A            FFBILK         2S 0       TEXT('Bilags-kode')
     A                                      COLHDG('Bilag' 'kode')
     A                                      EDTCDE(Z)
      *
     A            FFTEXT        20A         TEXT('Bilags-tekst')
     A                                      COLHDG('Bilags-tekst')
      *
     A            FFDAVD         4S 0       TEXT('Debet avd')
     A                                      COLHDG('Debet' 'avd.')
     A                                      EDTCDE(Z)
      *
     A            FFDKTO         6S 0       TEXT('Debet konto')
     A                                      COLHDG('Debet' 'Konto')
     A                                      EDTCDE(Z)
      *
4.01 A            FFDSPS         4S 0       TEXT('Debet Spes')
     A                                      COLHDG('Debet' 'Spes')
     A                                      EDTCDE(Z)
      *
     A            FFDMOM         1A         TEXT('Debet Moms')
     A                                      COLHDG('Debet' 'Moms')
      *
     A            FFBELP        10S 2       TEXT('Beløp')
     A                                      COLHDG('Beløp')
     A                                      EDTCDE(4)
5.31  *
5.31 A            FFMVAG        10S 2       TEXT('Mva. grunnl')
5.31 A                                      COLHDG('Mva' 'Grunnl')
5.31 A                                      EDTCDE(4)
      *
     A            FFCAVD         4S 0       TEXT('Kredit avd')
     A                                      COLHDG('Kred.' 'avd.')
     A                                      EDTCDE(Z)
      *
     A            FFCKTO         6S 0       TEXT('Kredit konto')
     A                                      COLHDG('Kred.' 'Konto')
     A                                      EDTCDE(Z)
      *
4.01 A            FFCSPS         4S 0       TEXT('Kredit Spes')
     A                                      COLHDG('Kred.' 'Spes')
     A                                      EDTCDE(Z)
      *
     A            FFCMOM         1A         TEXT('Kredit Moms')
     A                                      COLHDG('Kred.' 'Moms')
      *
6.26 A            FFPROJ    R               REFFLD(FÅPROJ)
      *
      *
6.NU A            FFKREF         8S 0       TEXT('Kreditreferanse')
     A                                      COLHDG('Kred.' 'ref.')
     A                                      EDTCDE(Z)
      *
     A            FFKUND         6S 0       TEXT('Reskontro-nummer.')
     A                                      COLHDG('Konto' 'Resk')
      *
5.57 A            FFKIDI      0025A
5.57 A                                      COLHDG('Kundeident')
5.57  *
6.3a A            FFKIDR      0008S 0       TEXT('Kidd referansenr')
5.57 A                                      COLHDG('Kidd' 'Ref')
5.57 A                                      EDTCDE(Z)
5.57  *
5.57 A            FFKSIF      0001S 0       TEXT('Kontroll-siffer')
5.57 A                                      COLHDG('Kont' 'Siff')
5.57 A                                      EDTCDE(Z)
5.57  *
5.57 A            FFKID2      0025A         TEXT('Kiddnummer 2')
5.57 A                                      COLHDG('Kidd-2')
      *
     A            FFVALK         3A         TEXT('Valutakode')
     A                                      COLHDG('Val.' 'Kode')
      *
     A            FFVALB        11S 2       TEXT('Valutabeløp')
     A                                      COLHDG('Val.' 'Beløp')
     A                                      EDTCDE(4)
      *
     A            FFMNGK         2S 0       TEXT('Mengde Kode')
     A                                      COLHDG('Mengde' 'Kode')
     A                                      EDTCDE(Z)
      *
     A            FFMNGD         9S 2       TEXT('Mengde')
     A                                      COLHDG('Mengde')
     A                                      EDTCDE(4)
      *
     A            FFAUTX         1A         TEXT('Saldert/Krysset')
     A                                      COLHDG('Saldert')
6.27 A            FFUPRO    R               REFFLD(FÅUPRO)
6.27 A            FFAKTI    R               REFFLD(FÅAKTI)
6.27 A            FFARBO    R               REFFLD(FÅARBO)
7.17 A            FFLOGG          Z         TEXT('Logg tidspunkt')
7.17 A                                      COLHDG('Loggtid')
      *
      * Gebyr-register                      (FG)
      *
     A            FGFIRM    R               REFFLD(FÅFIRM)
      *
     A            FGOTYP    R               REFFLD(FÅOTYP)
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMG0600 *LIBL/QMFOFAK)
      *
5.24 A            FGKKAT    R               REFFLD(FÅKKAT)
7.15 A            FGFTYP         2S 0       TEXT('Fakturatype')
7.15 A                                      COLHDG('Fakt' 'Typ.')
7.15 A                                      EDTCDE(Z)
      *
     A            FGLINE         2S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Løpenummer')
     A                                      TEXT('Løpenummer')
     A            FGTEXT        30A
     A                                      COLHDG('Tekst')
     A                                      TEXT('Tekst')
     A            FGTYPE         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Type')
     A                                      TEXT('Type')
     A            FGLTYP         2A
     A                                      COLHDG('Linjetype')
     A                                      TEXT('Linjetype')
     A            FGVARE    R               REFFLD(FÅVARE)
     A            FGGREN         9S 2
     A                                      EDTWRD('     0 ,  ')
     A                                      COLHDG('Beløpsgrense')
     A                                      TEXT('Beløpsgrense')
     A            FGBELP         9S 2
     A                                      EDTWRD('     0 ,  ')
     A                                      COLHDG('Gebyrbeløp')
     A                                      TEXT('Gebyrbeløp')
     A            FGSATS         5S 2
     A                                      EDTWRD(' 0 ,  ')
     A                                      COLHDG('Gebyr %-sats')
     A                                      TEXT('Gebyr %-sats')
6.10 A            FGODAT    R               REFFLD(FÅODAT)
6.10 A            FGOTIM    R               REFFLD(FÅOTIM)
6.10 A            FGOUSR    R               REFFLD(FÅOUSR)
6.10 A            FGEDAT    R               REFFLD(FÅEDAT)
6.10 A            FGETIM    R               REFFLD(FÅETIM)
6.10 A            FGEUSR    R               REFFLD(FÅEUSR)
      *
      * Kunde distribusjonsliste            (FH)
      *
     A            FHFIRM    R               REFFLD(FÅFIRM)
     A            FHKUND    R               REFFLD(FÅKUND)
     A            FHKPRO    R               REFFLD(FÅKPRO)
     A            FHPBOK    R               REFFLD(FÅJANE)
     A                                      TEXT('Prisbok')
     A                                      COLHDG('Prisbok')
     A            FHPFIL    R               REFFLD(FÅJANE)
     A                                      TEXT('Prisfil')
     A                                      COLHDG('Prisfil')
     A            FHVSOR    R               REFFLD(FÅVSOR)
     A            FHVSOS    R               REFFLD(FÅVSOR)
     A                                      TEXT('Varesortiment ekst.spørr')
     A                                      COLHDG('Sort' 'spørr.')
     A            FHLETY    R               REFFLD(FÅLETY)
     A            FHRFMT    R               REFFLD(FÅRFMT)
     A            FHENDR    R               REFFLD(FÅJANE)
     A                                      TEXT('Kun endringer')
     A                                      COLHDG('Endr')
     A            FHDATO          L         TEXT('Prisfil prisdato')
     A                                      COLHDG('Fil' 'p-dato')
     A            FHBTIS          Z         TEXT('Prisbok timestamp')
     A                                      COLHDG('P-bok' 't-stamp')
     A            FHFTIS          Z         TEXT('Prisfil timestamp')
     A                                      COLHDG('Fil' 't-stamp')
7 16 A            FHSVAL    R               REFFLD(FÅJANE)
7.16 A                                      TEXT('Valg Skaffevare')
7.16 A            FHTVAL    R               REFFLD(FÅJANE)
7.16 A                                      TEXT('Valg Tilbudpris')
     A            FHODAT    R               REFFLD(FÅODAT)
6.10 A            FHOTIM    R               REFFLD(FÅOTIM)
6.10 A            FHOUSR    R               REFFLD(FÅOUSR)
     A            FHEDAT    R               REFFLD(FÅEDAT)
     A            FHETIM    R               REFFLD(FÅETIM)
     A            FHEUSR    R               REFFLD(FÅEUSR)
      *
      * Håndterminal ordreregister          (FI)
      *
     A            FIFIRM    R               REFFLD(FÅFIRM)
     A            FIKUND    R               REFFLD(FÅKUND)
     A            FIREFN         6S 0       TEXT('Refnr')
     A                                      COLHDG('Refnr')
     A                                      EDTCDE(Z)
     A            FIVARE         8S 0
     A                                      COLHDG('Varenr')
     A                                      TEXT('Varenr')
     A            FIENH1    R               REFFLD(FÅENHE)
     A            FIANTA    R               REFFLD(FÅANTA)
      *
     A            FIDATO          L         TEXT('Transdato')
     A                                      COLHDG('Trans' 'dato')
     A            FITIME          T         TEXT('Tidspunkt')
     A                                      COLHDG('Klokken')
     A            FISTAT         1A         TEXT('Status')
     A                                      COLHDG('Status')
5.39  *
5.39  * Feltbasert vare/prisfil             (FIU)
5.39  *
5.39  *
5.39 A            FIUFIR    R               REFFLD(FÅFIRM)
5.39 A            FIUKUN    R               REFFLD(FÅKUND)
5.39 A            FIUSOR    R               REFFLD(FÅVSOR)
5.39 A            FIUVAR    R               REFFLD(FÅVARE)
5.39 A            FIUBES    R               REFFLD(FÅBESK)
5.39 A            FIUNOB    R               REFFLD(FÅNOBB)
5.39 A            FIUTE1    R               REFFLD(FÅTEK1)
5.39 A            FIUTE2    R               REFFLD(FÅTEK2)
5.39 A            FIUENH    R               REFFLD(FÅENHE)
5.39 A            FIUSAP         9S 2       TEXT('Salgspris')
5.39 A                                      COLHDG('Salgspris')
5.39 A                                      EDTCDE(4)
5.39  *
5.39 A            FIURA1         5S 2       TEXT('Rabatt-1')
5.39 A                                      COLHDG('Rab-1')
5.39 A                                      EDTCDE(4)
5.39  *
5.39 A            FIURA2         5S 2       TEXT('Rabatt-2')
5.39 A                                      COLHDG('Rab-2')
5.39 A                                      EDTCDE(4)
5.39 A            FIUKPR    R               REFFLD(FÅKPRI)
5.39 A            FIUDAT          L         TEXT('Gen. dato')
5.39 A                                      COLHDG('Gen.' 'dato')
5.39 A            FIUTIM          T         TEXT('Gen. tid')
5.39 A                                      COLHDG('Gen.' 'tid')
5.39 A            FIUUSR    R               REFFLD(FÅUSER)
      *
      * Fast ordretekst-register            (FJ)
      *
     A            FJFIRM    R               REFFLD(FÅFIRM)
      *
6.NU A            FJNUMM         8A
     A                                      COLHDG('Tekst-kode')
     A                                      TEXT('Tekst-kode')
     A                                      COMP(NE '      ')
     A                                      CHKMSGID(FMJ0600 *LIBL/QMFOFAK)
     A            FJREFX        30A
     A                                      COLHDG('Referanse')
     A                                      TEXT('Referanse')
     A            FJSL01        70A
     A                                      COLHDG('Tekst-01')
     A                                      TEXT('Tekst-01')
     A            FJSL02        70A
     A                                      COLHDG('Tekst-02')
     A                                      TEXT('Tekst-02')
     A            FJSL03        70A
     A                                      COLHDG('Tekst-03')
     A                                      TEXT('Tekst-03')
     A            FJSL04        70A
     A                                      COLHDG('Tekst-04')
     A                                      TEXT('Tekst-04')
     A            FJSL05        70A
     A                                      COLHDG('Tekst-05')
     A                                      TEXT('Tekst-05')
     A            FJSL06        70A
     A                                      COLHDG('Tekst-06')
     A                                      TEXT('Tekst-06')
     A            FJSL07        70A
     A                                      COLHDG('Tekst-07')
     A                                      TEXT('Tekst-07')
     A            FJSL08        70A
     A                                      COLHDG('Tekst-08')
     A                                      TEXT('Tekst-08')
     A            FJSL09        70A
     A                                      COLHDG('Tekst-09')
     A                                      TEXT('Tekst-09')
     A            FJSL10        70A
     A                                      COLHDG('Tekst-10')
     A                                      TEXT('Tekst-10')
     A            FJSL11        70A
     A                                      COLHDG('Tekst-11')
     A                                      TEXT('Tekst-11')
     A            FJSL12        70A
     A                                      COLHDG('Tekst-12')
     A                                      TEXT('Tekst-12')
     A            FJSL13        70A
     A                                      COLHDG('Tekst-13')
     A                                      TEXT('Tekst-13')
     A            FJSL14        70A
     A                                      COLHDG('Tekst-14')
     A                                      TEXT('Tekst-14')
     A            FJSL15        70A
     A                                      COLHDG('Tekst-15')
     A                                      TEXT('Tekst-15')
     A            FJSL16        70A
     A                                      COLHDG('Tekst-16')
     A                                      TEXT('Tekst-16')
     A            FJSL17        70A
     A                                      COLHDG('Tekst-17')
     A                                      TEXT('Tekst-17')
     A            FJSL18        70A
     A                                      COLHDG('Tekst-18')
     A                                      TEXT('Tekst-18')
6.24  *
6.24 A            FJPRTX         1A         TEXT('Print')
6.24 A                                      COLHDG('Print')
6.24  *
6.10 A            FJODAT    R               REFFLD(FÅODAT)
6.10 A            FJOTIM    R               REFFLD(FÅOTIM)
6.10 A            FJOUSR    R               REFFLD(FÅOUSR)
6.10 A            FJEDAT    R               REFFLD(FÅEDAT)
6.10 A            FJETIM    R               REFFLD(FÅETIM)
6.10 A            FJEUSR    R               REFFLD(FÅEUSR)
      *
      * Utplukk-param-register              (FKP)
      *
     A            FKPFIR    R               REFFLD(FÅFIRM)
      *
6.NU A            FKPONR         8S 0       TEXT('Ordrenr')
     A                                      COLHDG('Ordrenr')
     A                                      EDTCDE(Z)
      *
     A            FKPSUF    R               REFFLD(FÅSUFF)
      *
     A            FKPOTY         2A         TEXT('Ordretype')
     A                                      COLHDG('OT')
      *
     A            FKPLAG         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
      *
     A            FKPWSD        10A         TEXT('Arbeids-stasjon')
     A                                      COLHDG('Arbeids' 'stasjon')
      *
     A            FKPUSR        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FKPALT         1S 0       TEXT('Alternativ')
     A                                      COLHDG('Alt')
     A                                      EDTCDE(Z)
      *
     A            FKPDIR         1S 0       TEXT('Direkte ut')
     A                                      COLHDG('Dir' 'ut')
     A                                      EDTCDE(Z)
      *
     A            FKPRES         1S 0       TEXT('Restet')
     A                                      COLHDG('Rest')
     A                                      EDTCDE(Z)
      *
     A            FKPTXT         1S 0       TEXT('Fast tekst')
     A                                      COLHDG('Fast' 'tekst')
     A                                      EDTCDE(Z)
      *
     A            FKPKOL        11S 3       TEXT('Kolli')
     A                                      COLHDG('Kolli')
     A                                      EDTCDE(M)
      *
     A            FKPNET        11S 3       TEXT('Netto vekt')
     A                                      COLHDG('Netto vekt')
     A                                      EDTCDE(M)
      *
     A            FKPBRU        11S 3       TEXT('Brutto vekt')
     A                                      COLHDG('Brutto vekt')
     A                                      EDTCDE(M)
      *
     A            FKPLMT        20A         TEXT('Lev. måte tekst')
     A                                      COLHDG('Lev. måte tekst')
      *
     A            FKPFPR         9S 2       TEXT('Frakt pris')
     A                                      COLHDG('Frakt pris')
     A                                      EDTCDE(M)
      *
     A            FKPFTE        30A         TEXT('Frakt tekst')
     A                                      COLHDG('Frakt tekst')
      *
     A            FKPEPR         9S 2       TEXT('Emball.pris')
     A                                      COLHDG('Emball.pris')
     A                                      EDTCDE(M)
      *
     A            FKPETE        30A         TEXT('Emb.tekst')
     A                                      COLHDG('Emb.tekst')
      *
      * Utplukk-linje-register              (FKL)
      *
     A            FKLFIR    R               REFFLD(FÅFIRM)
      *
6.NU A            FKLONR         8S 0       TEXT('Ordrenr')
     A                                      COLHDG('Ordrenr')
     A                                      EDTCDE(Z)
      *
     A            FKLSUF    R               REFFLD(FÅSUFF)
      *
     A            FKLLIN         4S 0       TEXT('Linjenummer')
     A                                      COLHDG('Linje')
     A                                      EDTCDE(Z)
      *
     A            FKLANT        11S 3       TEXT('Antall')
     A                                      COLHDG('Antall')
     A                                      EDTCDE(M)
      *
     A            FKLKOD         1A         TEXT('Utplukkskode')
     A                                      COLHDG('Utpl.kd.')
      *
      * Plukk-1-linje-register              (FK1)
      *
     A            FK1FIR    R               REFFLD(FÅFIRM)
      *
     A            FK1WSD        10A         TEXT('Arbeids-stasjon')
     A                                      COLHDG('Arbeids' 'stasjon')
      *
     A            FK1USR        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FK1LST         6S 0       TEXT('Listenr')
     A                                      COLHDG('Listenr')
     A                                      EDTCDE(Z)
      *
     A            FK1UTQ        10A         TEXT('Printer-Outq')
     A                                      COLHDG('Printer' 'Outq')
      *
     A            FK1OTY         2A         TEXT('Ordretype')
     A                                      COLHDG('OT')
      *
6.NU A            FK1ONR         8S 0       TEXT('Ordrenummer')
     A                                      COLHDG('Ordre' 'nr')
      *
     A            FK1SUF    R               REFFLD(FÅSUFF)
      *
     A            FK1VG0         1S 0       TEXT('Direkte/Jobbkø')
     A                                      COLHDG('Dir' 'JQ')
      *
     A            FK1VG1         1S 0       TEXT('Variant')
     A                                      COLHDG('Var')
      *
     A            FK1VG2         1S 0       TEXT('Valg-skjerm')
     A                                      COLHDG('Valg' 'skjerm')
      *
     A            FK1VG3         1S 0       TEXT('Valg-Bruker')
     A                                      COLHDG('Valg' 'Bruker')
      *
     A            FK1PER         6S 0       TEXT('Periode')
     A                                      COLHDG('Periode')
     A                                      EDTCDE(Z)
      *
     A            FK1DAT          L         TEXT('Fakt.dato')
     A                                      COLHDG('Fakt.' 'dato')
      *
      * Plukk-2-linje-register              (FK2)
      *
     A            FK2FIR    R               REFFLD(FÅFIRM)
      *
     A            FK2WSD        10A         TEXT('Arbeids-stasjon')
     A                                      COLHDG('Arbeids' 'stasjon')
      *
     A            FK2USR        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FK2LST         6S 0       TEXT('Listenr')
     A                                      COLHDG('Listenr')
     A                                      EDTCDE(Z)
      *
     A            FK2UTQ        10A         TEXT('Printer-Outq')
     A                                      COLHDG('Printer' 'Outq')
      *
     A            FK2OTY         2A         TEXT('Ordretype')
     A                                      COLHDG('OT')
      *
6.NU A            FK2ONR         8S 0       TEXT('Ordrenummer')
     A                                      COLHDG('Ordre' 'nr.')
      *
     A            FK2SUF    R               REFFLD(FÅSUFF)
      *
     A            FK2VG0         1S 0       TEXT('Direkte/Jobbkø')
     A                                      COLHDG('Dir' 'Jq')
      *
     A            FK2VG1         1S 0       TEXT('Variant')
     A                                      COLHDG('Var')
      *
     A            FK2VG2         1S 0       TEXT('Valg-skjerm')
     A                                      COLHDG('Valg' 'skjerm')
      *
     A            FK2VG3         1S 0       TEXT('Valg-Bruker')
     A                                      COLHDG('Valg' 'Bruker')
      *
     A            FK2PER         6S 0       TEXT('Periode')
     A                                      COLHDG('Periode')
     A                                      EDTCDE(Z)
      *
     A            FK2DAT          L         TEXT('Fakt.dato')
     A                                      COLHDG('Fakt.' 'dato')
      *
      * Plukk-S-linje-register              (FKS)
      *
     A            FKSFIR    R               REFFLD(FÅFIRM)
      *
6.NU A            FKSONR         8S 0       TEXT('Ordrenr')
     A                                      COLHDG('Ordre')
     A                                      EDTCDE(Z)
      *
     A            FKSSUF    R               REFFLD(FÅSUFF)
      *
     A            FKSTLL         2S 0       TEXT('Teller')
     A                                      COLHDG('Teller')
     A                                      EDTCDE(Z)
      *
     A            FKSLIN         4S 0       TEXT('Linjenummer')
     A                                      COLHDG('Linje')
     A                                      EDTCDE(Z)
      *
     A            FKSKOD         1A         TEXT('Type-kode')
     A                                      COLHDG('Type' 'kode')
     A                                      VALUES('H' 'K' 'T' 'V' 'R')
     A                                      CHKMSGID(FMK0100 *LIBL/QMFOFAK)
      *
     A            FKSOTY         2A         TEXT('Ordretype')
     A                                      COLHDG('OT')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMK0600 *LIBL/QMFOFAK)
      *
     A            FKSALT         1S 0       TEXT('Alternativ')
     A                                      COLHDG('Alt')
     A                                      EDTCDE(Z)
      *
6.NU A            FKSSRT       114A         TEXT('Sortering')
     A                                      COLHDG('Sortering')
      *
     A            FKSANT        11S 3       TEXT('Antall plukket')
     A                                      COLHDG('Antall' 'plukket')
     A                                      EDTCDE(M)
      *
     A            FKSDIV        10A         TEXT('Diverse')
     A                                      COLHDG('Diverse')
      *
      * Kundeprosjekt-register              (FL)
      *
     A            FLFIRM    R               REFFLD(FÅFIRM)
     A            FLKUND    R               REFFLD(FÅKUND)
     A            FLKPRO    R               REFFLD(FÅKPRO)
     A            FLSELG    R               REFFLD(FÅSELG)
      *
     A            FLFDAT          L         TEXT('Fra-dato')
     A                                      COLHDG('Fra-dato')
      *
     A            FLTDAT          L         TEXT('Til-dato')
     A                                      COLHDG('Til-dato')
      *
     A            FLNAVN        30A         TEXT('Navn')
     A                                      COLHDG('Navn')
      *
     A            FLADR1        30A         TEXT('Adresse 1')
     A                                      COLHDG('Adresse 1')
      *
     A            FLADR2        30A         TEXT('Adresse 2')
     A                                      COLHDG('Adresse 2')
      *
     A            FLPONR         4S 0       TEXT('Postnummer')
     A                                      COLHDG('Postnr')
     A                                      EDTCDE(Z)
      *
     A            FLKPRS        30A         TEXT('Kontaktperson')
     A                                      COLHDG('Kontaktperson')
      *
     A            FLTLFA        15A         TEXT('Telefon arbeid')
     A                                      COLHDG('Tlf. arb.')
      *
     A            FLTLFP        15A         TEXT('Telefon privat')
     A                                      COLHDG('Tlf. priv.')
      *
     A            FLTLFM        15A         TEXT('Mobiltelefon')
     A                                      COLHDG('Mobiltelefon')
      *
     A            FLMAIL        50A         TEXT('E-mail adresse')
     A                                      COLHDG('E-mail')
      *
5.37 A            FLEPRO        15A         TEXT('Eksternt prosj.nr.')
5.37 A                                      COLHDG('Ekst.' 'prosjnr')
      *
5.37 A            FLFATY         2S 0       TEXT('Fakturatype')
5.37 A                                      COLHDG('Fakt.' 'type')
5.37 A                                      EDTCDE(Z)
      *
     A            FLKJOR         2S 0       TEXT('Kjørerute')
     A                                      COLHDG('Kjøre' 'rute')
     A                                      EDTCDE(Z)
      *
     A            FLKJNR         5S 0       TEXT('Rekkefølge innen rute')
     A                                      COLHDG('Innen' 'rute')
     A                                      EDTCDE(Z)
      *
     A            FLBOKU         6S 0       TEXT('Kundenr bonuskunde')
     A                                      COLHDG('Kunde' 'bonus')
     A                                      EDTCDE(Z)
      *
     A            FLORKA    R               REFFLD(FÅRKAT)
     A                                      TEXT('Overstyrt rabattkat.')
     A                                      COLHDG('Overstyrt' 'rabattkat.')
      *
     A            FLOKUN    R               REFFLD(FÅKUND)
     A                                      TEXT('Overstyrt kunde')
     A                                      COLHDG('Overstyrt' 'kunde')
      *
     A            FLOKPR    R               REFFLD(FÅKPRO)
     A                                      TEXT('Overstyrt prosjektnr')
     A                                      COLHDG('Overstyrt' 'prosjektnr')
      *
     A            FLOPDA          L         TEXT('Overstyrt prisdato')
     A                                      COLHDG('Overstyrt' 'prisdato')
      *
5.31 A            FLPRIV    R               REFFLD(FÅPRIV)
      *
6.26 A            FLPROJ    R               REFFLD(FÅPROJ)
6.2Ø A            FLBDOK    R               REFFLD(FÅJANE)
6.2Ø A                                      TEXT('ByggDok Innsamling')
6.2Ø A                                      COLHDG('ByggDok' 'Innsaml.')
6.37 A            FLCOBU    R               REFFLD(FÅJANE)
6.37 A                                      TEXT('Cobuilder Innsamling')
6.37 A                                      COLHDG('Cobuild' 'Innsaml.')
6.35 A            FLMKOD      0001S 0
6.35 A                                      EDTCDE(Z)
6.35 A                                      VALUES(0 1)
6.35 A                                      CHKMSGID(RMK0070 *LIBL/QMFOKON)
6.35 A                                      TEXT('MVA-beregning')
6.35 A                                      COLHDG('MVA' 'kod')
6.35 A            FLBETB      0002S 0
6.35 A                                      EDTCDE(Z)
6.35 A                                      TEXT('Betalingsbetingelse')
6.35 A                                      COLHDG('Bet' 'bet')
6.35 A            FLPRPA      0001S 0
6.35 A                                      EDTCDE(Z)
6.35 A                                      VALUES(0 1)
6.35 A                                      CHKMSGID(RMK0170 *LIBL/QMFOKON)
6.35 A                                      TEXT('Pris/Pakkseddel')
6.35 A                                      COLHDG('Pr' 'pa')
6.35 A            FLNETO      0001S 0
6.35 A                                      VALUES(0 1)
6.35 A                                      CHKMSGID(RMK0171 *LIBL/QMFOKON)
6.35 A                                      TEXT('Pris på faktura')
6.35 A                                      COLHDG('Pris' 'fakt')
6.35 A            FLEKGB      0001S 0
6.35 A                                      EDTCDE(Z)
6.35 A                                      VALUES(0 1)
6.35 A                                      CHKMSGID(RMK0210 *LIBL/QMFOKON)
6.35 A                                      TEXT('Ekspedisjonsgebyr')
6.35 A                                      COLHDG('Ek' 'gb')
6.35 A            FLSEKV      0002S 0
6.35 A                                      EDTCDE(Z)
6.35 A                                      VALUES(00 01 07 14 30)
6.35 A                                      CHKMSGID(RMK0260 *LIBL/QMFOKON)
6.35 A                                      TEXT('Fakturasekvens')
6.35 A                                      COLHDG('Fa' 'se')
6.35 A            FLSAMF      0001S 0
6.35 A                                      EDTCDE(Z)
6.35 A                                      VALUES(0 1 2 3 4)
6.35 A                                      CHKMSGID(RMK0190 *LIBL/QMFOKON)
6.35 A                                      TEXT('Samlefaktura')
6.35 A                                      COLHDG('Sa' 'fa')
6.35 A            FLFAGB      0001S 0
6.35 A                                      EDTCDE(Z)
6.35 A                                      VALUES(0 1)
6.35 A                                      CHKMSGID(RMK0200 *LIBL/QMFOKON)
6.35 A                                      TEXT('Fakturagebyr')
6.35 A                                      COLHDG('Fa' 'ge')
6.39 A            FLFKUN    R               REFFLD(FÅJANE)
6.39 A                                      TEXT('Frikob. kunde overst')
6.39 A                                      COLHDG('Frikob' 'Kund')
      *
      *  Sidetabell FKP2PF
7.12 A            FLKTOU         5S 0       TEXT('Kto.Utg.bil')
7.12 A                                      COLHDG('Kto.Utg.Bil')
7.12 A                                      EDTCDE(Z)
7.12 A            FLKTSD         5S 0       TEXT('Kto.SvinnDeb')
7.12 A                                      COLHDG('Kto.SvinnDeb')
7.12 A                                      EDTCDE(Z)
7.12 A            FLKTSC         5S 0       TEXT('Kto.SvinnCre')
7.12 A                                      COLHDG('Kto.SvinnCre')
7.12 A                                      EDTCDE(Z)
7.12 A            FLUPRO    R               REFFLD(FÅUPRO)
7.12 A            FLKUNF    R               REFFLD(FÅKUND)
      *
     A            FLODAT    R               REFFLD(FÅODAT)
6.10 A            FLOTIM    R               REFFLD(FÅOTIM)
6.10 A            FLOUSR    R               REFFLD(FÅOUSR)
     A            FLEDAT    R               REFFLD(FÅEDAT)
     A            FLETIM    R               REFFLD(FÅETIM)
     A            FLEUSR    R               REFFLD(FÅEUSR)
      *
      * Kundeprosjekt-søketekst-register    (FLS)
      *
      *
      * Kundeprosjekt-søketekst-register    (FLS)
      *
     A            FLSFIR    R               REFFLD(FÅFIRM)
     A            FLSKUN    R               REFFLD(FÅKUND)
     A            FLSKPR    R               REFFLD(FÅKPRO)
     A            FLSTEK       200          TEXT('Søketekst')
     A                                      COLHDG('Søketekst')
6.10 A            FLSODA    R               REFFLD(FÅODAT)
6.10 A            FLSOTI    R               REFFLD(FÅOTIM)
6.10 A            FLSOUS    R               REFFLD(FÅOUSR)
6.10 A            FLSEDA    R               REFFLD(FÅEDAT)
6.10 A            FLSETI    R               REFFLD(FÅETIM)
6.10 A            FLSEUS    R               REFFLD(FÅEUSR)
5.33  *
5.33  * Kort/fakturaavtale-register         (FM)
5.33  *
5.33 A            FMFIRM    R               REFFLD(FÅFIRM)
5.33 A            FMKUND    R               REFFLD(FÅKUND)
5.33 A            FMKPRO    R               REFFLD(FÅKPRO)
5.33  *
5.33 A            FMKFTP         2S 0       TEXT('Kort/fakt. type')
5.33 A                                      COLHDG('Kort/fakt' 'type')
5.33 A                                      EDTCDE(Z)
5.33  *
5.33 A            FMKTSQ         4S 0       TEXT('Kort/fakt. type sekv.')
5.33 A                                      COLHDG('Kort/fakt' 'type/sekv')
5.33 A                                      EDTCDE(Z)
5.33  *           Koder pr. kort/fakt.type etter behov :
5.33  *           01=VISA Purchasing/ClearPark
5.33  *           02=Europay Purchasing/ClearPark
5.33  *
5.33 A            FMKRNR        16S 0       TEXT('Kortnummer')
5.33 A                                      COLHDG('Kortnummer')
5.33 A                                      EDTCDE(Z)
5.33 A            FMEXPD         4S 0       TEXT('Kort exp.date')
5.33 A                                      COLHDG('Kort' 'exp.date')
5.33 A                                      EDTCDE(Z)
5.33  *
5.33 A            FMOBLG    R               REFFLD(FÅJANE)
5.33 A                                      TEXT('Avtale obligatorisk')
5.33 A                                      VALUES(0 1)
5.33 A                                      COLHDG('Avtale' 'obl.')
5.33  *
5.33 A            FMHLDR        30A         TEXT('Navn på kort')
5.33 A                                      COLHDG('Navn' 'kort')
5.33  *
5.33 A            FMENVN        30A         TEXT('Etternavn')
5.33 A                                      COLHDG('Etternavn')
5.33  *
5.33 A            FMFNVN        30A         TEXT('Fornavn')
5.33 A                                      COLHDG('Fornavn')
5.33  *
5.33 A            FMADR1        30A         TEXT('Adresse 1')
5.33 A                                      COLHDG('Adresse 1')
5.33  *
5.33 A            FMADR2        30A         TEXT('Adresse 2')
5.33 A                                      COLHDG('Adresse 2')
5.33  *
5.33 A            FMPONR         4S 0       TEXT('Postnummer')
5.33 A                                      COLHDG('Postnr')
5.33 A                                      EDTCDE(Z)
5.33  *
5.33 A            FMSTED        30A         TEXT('Poststed')
5.33 A                                      COLHDG('Poststed')
5.33  *
5.33 A            FMTLFA        15A         TEXT('Telefon arbeid')
5.33 A                                      COLHDG('Tlf. arb.')
5.33  *
5.33 A            FMTLFP        15A         TEXT('Telefon privat')
5.33 A                                      COLHDG('Tlf. priv.')
5.33  *
5.33 A            FMTLFM        15A         TEXT('Mobiltelefon')
5.33 A                                      COLHDG('Mobiltelefon')
5.33  *
5.33 A            FMMAIL        50A         TEXT('E-mail adresse')
5.33 A                                      COLHDG('E-mail')
5.33  *
5.33 A            FMEDAT    R               REFFLD(FÅEDAT)
5.33 A            FMETIM    R               REFFLD(FÅETIM)
5.33 A            FMEUSR    R               REFFLD(FÅEUSR)
5.39  *
5.39  * Fakturatype-register         (FMT)
5.39  *
5.39 A            FMTFIR    R               REFFLD(FÅFIRM)
5.39 A            FMTFAT         2S 0       TEXT('Fakturatype')
5.39 A                                      COLHDG('Fakt.' 'type')
5.39 A                                      EDTCDE(Z)
5.39 A            FMTBES        20A         TEXT('Beskrivelse')
5.39 A                                      COLHDG('Besk.')
5.39 A            FMTUTS    R               REFFLD(FÅJANE)
5.39 A                                      TEXT('Undertrykk utskr.')
5.39 A                                      COLHDG('Undertr' 'utsk')
5.39 A            FMTTES    R               REFFLD(FÅJANE)
5.39 A                                      TEXT('Testindikator')
5.39 A                                      COLHDG('Test' 'ind.')
5.39  *
5.39 A            FMTEDA    R               REFFLD(FÅEDAT)
5.39 A            FMTETI    R               REFFLD(FÅETIM)
5.39 A            FMTEUS    R               REFFLD(FÅEUSR)
5.33  *
5.33  *
5.33  * Kort/fakt-trans-registerter         (FN)
5.33  *
5.33 A            FNFIRM    R               REFFLD(FÅFIRM)
5.33 A            FNNUMM    R               REFFLD(FÅNUMM)
5.33 A                                      COMP(NE 0)
5.33 A                                      CHKMSGID(FMO0600 *LIBL/QMFOFAK)
5.33 A            FNSUFF    R               REFFLD(FÅSUFF)
5.33  *
5.33 A            FNKFTP         2S 0       TEXT('Kort/fakt. type')
5.33 A                                      COLHDG('Kort/fakt' 'type')
5.33 A                                      EDTCDE(Z)
5.33 A            FNKTSQ         4S 0       TEXT('Kort/fakt. type sekv.')
5.33 A                                      COLHDG('Kort/fakt' 'type/sekv')
5.33 A                                      EDTCDE(Z)
5.33 A            FNKUND    R               REFFLD(FÅKUND)
5.33 A            FNKPRO    R               REFFLD(FÅKPRO)
5.33  *
5.33 A            FNAARR         4S 0       TEXT('År')
5.33 A                                      COLHDG('År')
5.33 A                                      EDTCDE(Z)
6.NU A            FNBINR         8S 0       TEXT('Fakturanummer')
5.33 A                                      COLHDG('Fakt' 'nr')
5.33 A                                      EDTCDE(Z)
5.33 A            FNJOUR         5S 0       TEXT('Kjøringsnr.')
5.33 A                                      COLHDG('Kjøringsnr.')
5.33 A                                      EDTCDE(Z)
5.33 A            FNKDAT          L         TEXT('Kjøringsdato')
5.33 A                                      COLHDG('Kjørt' 'dato')
5.33 A            FNKTIM          T         TEXT('Kjørt kl.')
5.33 A                                      COLHDG('Kjørt' 'kl')
5.33  *
5.33 A            FNEDAT    R               REFFLD(FÅEDAT)
5.33 A            FNETIM    R               REFFLD(FÅETIM)
5.33 A            FNEUSR    R               REFFLD(FÅEUSR)
5.38  *
5.38  * Utgående fakturalogg                (FNU)
5.38  *
5.38 A            FNUFIR    R               REFFLD(FÅFIRM)
5.38  *
5.38 A            FNUAAR         4S 0       TEXT('År')
5.38 A                                      COLHDG('År')
5.38 A                                      EDTCDE(Z)
5.38  *
6.NU A            FNUBIN         8S 0       TEXT('Fakturanummer')
5.38 A                                      COLHDG('Fakt' 'nr')
5.38 A                                      EDTCDE(Z)
5.38 A            FNUFAT         2S 0       TEXT('Fakturatype')
5.38 A                                      COLHDG('Fakt.' 'type')
5.38 A                                      EDTCDE(Z)
6.25 A            FNUEAF      0013S 0
6.25 A                                      COLHDG('Kund.' 'Ean.f')
6.25 A                                      TEXT('Kund. Ean.f')
5.38 A            FNUKUN    R               REFFLD(FÅKUND)
5.38 A            FNUKDA          L         TEXT('Kjørt dato')
5.38 A                                      COLHDG('Kjørt' 'stasj.')
5.38 A            FNUKTI          T         TEXT('Kjørt tidspkt.')
5.38 A                                      COLHDG('Kjørt' 'tidsp.')
5.38 A            FNUKWS        10A         TEXT('Kjørt arb.stasj.')
5.38 A                                      COLHDG('Kjørt' 'stasj.')
5.38 A            FNUTEL         2S 0       TEXT('Ant. kjøringer')
5.38 A                                      COLHDG('Ant.' 'kjørt')
5.38 A                                      EDTCDE(Z)
5.38 A            FNUODA    R               REFFLD(FÅODAT)
5.38 A            FNUOTI    R               REFFLD(FÅOTIM)
5.38 A            FNUWSI        10A         TEXT('Oppr. arb.stasj.')
5.38 A                                      COLHDG('Oppr.' 'stasj.')
5.38 A            FNUEDA    R               REFFLD(FÅEDAT)
5.38 A            FNUETI    R               REFFLD(FÅETIM)
5.38 A            FNUEUS    R               REFFLD(FÅEUSR)
      *
      * Ordre-hode-register                 (FO)
      *
     A            FOFIRM    R               REFFLD(FÅFIRM)
      *
     A            FONUMM    R               REFFLD(FÅNUMM)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMO0600 *LIBL/QMFOFAK)
      *
     A            FOSUFF    R               REFFLD(FÅSUFF)
      *
     A            FOLINE    R               REFFLD(FÅLINE)
      *
     A            FOOTYP    R               REFFLD(FÅOTYP)
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMO0610 *LIBL/QMFOFAK)
      *
     A            FOLETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
      *
     A            FOLAGE    R               REFFLD(FÅLAGE)
      *
6.NU A            FOBINR         8S 0       TEXT('Bilagsnummer')
     A                                      COLHDG('Bilag' 'nr')
     A                                      EDTCDE(Z)
      *
6.NU A            FOKREF         8S 0       TEXT('Kreditt-ref.')
     A                                      COLHDG('Kred' 'ref.')
     A                                      EDTCDE(Z)
      *
     A            FOBDAT          L         TEXT('Ordredato')
     A                                      COLHDG('Ordre' 'dato')
      *
     A            FOLDAT    R               REFFLD(FÅLDAT)
      *
     A            FOPDAT          L         TEXT('Planlagt lev.')
     A                                      COLHDG('Planl.' 'lev.')
6.2H  *
6.2H A            FOPADA          L         TEXT('Pakkseddel''dato')
6.2H A                                      COLHDG('Pakks.' 'dato')
6.2H A                                      DFT('0001-01-01')
      *
     A            FOFKDA          L         TEXT('Fakturadato')
     A                                      COLHDG('Fakt' 'dato')
      *
     A            FOFFDA          L         TEXT('Forfallsdato')
     A                                      COLHDG('Forf' 'dato')
      *
     A            FOBETB         2S 0       TEXT('Bet.betingelser')
     A                                      COLHDG('Bet.' 'bet.')
     A                                      EDTCDE(Z)
      *
     A            FOSELG    R               REFFLD(FÅSELG)
      *
5.42 A            FODIST         4S 0       TEXT('Distrikt')
     A                                      COLHDG('Distr')
     A                                      EDTCDE(Z)
      *
     A            FOLMAT         2S 0       TEXT('Leveringsmåte')
     A                                      COLHDG('Lev' 'måte')
     A                                      EDTCDE(Z)
      *
     A            FOLBET         2S 0       TEXT('Leveringsbet.')
     A                                      COLHDG('Lev' 'bet.')
     A                                      EDTCDE(Z)
      *
     A            FOVALK         3A         TEXT('Valuta')
     A                                      COLHDG('Valuta')
      *
     A            FORKAT         3S 0       TEXT('Rabatt-kategori')
     A                                      COLHDG('Rab' 'kat')
     A                                      EDTCDE(Z)
      *
     A            FOSPED         3S 0       TEXT('Speditor')
     A                                      COLHDG('Sped')
     A                                      EDTCDE(Z)
      *
     A            FOKJOR         2S 0       TEXT('Kjørerute')
     A                                      COLHDG('Kjøre' 'rute')
     A                                      EDTCDE(Z)
      *
     A            FOKJNR         5S 0       TEXT('Rekkefølge innen rute')
     A                                      COLHDG('Innen' 'rute')
     A                                      EDTCDE(Z)
      *
     A            FOLASS         2S 0       TEXT('Kode, lass-nr')
     A                                      COLHDG('Kode' 'lass-nr')
     A                                      EDTCDE(Z)
      *
     A            FOMKOD         1S 0       TEXT('Mva-kode')
     A                                      COLHDG('Mva' 'kode')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMO0100 *LIBL/QMFOFAK)
      *
     A            FOLKUN         6S 0       TEXT('Vare-adresse')
     A                                      COLHDG('Vare' 'adr')
     A                                      EDTCDE(Z)
      *
     A            FOKUND    R               REFFLD(FÅKUND)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMO0630 *LIBL/QMFOFAK)
      *
     A            FOLDOR         6S 0       TEXT('Leverandørnummer')
     A                                      COLHDG('Lev' 'dør')
     A                                      EDTCDE(Z)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMO0640 *LIBL/QMFOFAK)
      *
     A            FOKUNA        30A         TEXT('Kunde-navn')
     A                                      COLHDG('Kunde-navn')
      *
     A            FONAVN        30A         TEXT('Navn')
     A                                      COLHDG('Navn')
      *
     A            FOADR1        30A         TEXT('Adresse 1')
     A                                      COLHDG('Adresse 1')
      *
     A            FOADR2        30A         TEXT('Adresse 2')
     A                                      COLHDG('Adresse 2')
      *
     A            FOSTED        30A         TEXT('Poststed')
     A                                      COLHDG('Poststed')
      *
     A            FOAVDE         4S 0       TEXT('Avd. salg overst')
     A                                      COLHDG('Avd')
     A                                      EDTCDE(Z)
      *
     A            FOKONT         6S 0       TEXT('Konto')
     A                                      COLHDG('Konto')
     A                                      EDTCDE(Z)
      *
4.01 A            FOSPES         4S 0       TEXT('Spes')
     A                                      COLHDG('Spes')
     A                                      EDTCDE(Z)
      *
6.26 A            FOPROJ    R               REFFLD(FÅPROJ)
      *
6.27 A            FOAKTI    R               REFFLD(FÅAKTI)
      *
     A            FOKOBK         1S 0       TEXT('Obekr. kreves')
     A                                      COLHDG('Obekr.' 'kreves')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMO0100 *LIBL/QMFOFAK)
      *
     A            FOKGFA         1S 0       TEXT('Undertr. fakt.ge')
     A                                      COLHDG('Undertr' 'fakt.ge')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMO0100 *LIBL/QMFOFAK)
      *
     A            FOKGEK         1S 0       TEXT('Undertr. eks. ge')
     A                                      COLHDG('Undertr.' 'eks.ge')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMO0100 *LIBL/QMFOFAK)
      *
     A            FOKGFR         1S 0       TEXT('Undertr. frakt.g')
     A                                      COLHDG('Undertr.' 'frakt.g')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMO0100 *LIBL/QMFOFAK)
      *
     A            FOKSOB         1S 0       TEXT('Utskr.ordrebekr.')
     A                                      COLHDG('Utskr.' 'obekr.')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMO0100 *LIBL/QMFOFAK)
      *
     A            FOKTXT         1S 0       TEXT('Tekst utskrift')
     A                                      COLHDG('Tekst' 'utskr')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMO0100 *LIBL/QMFOFAK)
      *
     A            FOKFAK         1S 0       TEXT('Faktura kjørt?')
     A                                      COLHDG('Fakt' 'kjørt?')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMO0100 *LIBL/QMFOFAK)
      *
     A            FONETO         1S 0       TEXT('Netto u/rab')
     A                                      COLHDG('Netto' 'u/rab')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMO0100 *LIBL/QMFOFAK)
      *
     A            FOKSPR         1S 0       TEXT('Sperret f.vedl.')
     A                                      COLHDG('Sperret' 'f.vedl.')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMO0100 *LIBL/QMFOFAK)
      *
6.14 A            FOVREF        30A         TEXT('Vår ref.')
     A                                      COLHDG('Vår ref.')
      *
6.14 A            FODREF        30A         TEXT('Deres ref.')
     A                                      COLHDG('Deres ref.')
6.36  *
6.36 A            FOKPNR      0006S 0       TEXT('Kontaktpersonnr.')
6.36 A                                      COLHDG('Kontaktp.nr.')
6.36 A                                      EDTCDE(Z)
      *
     A            FOREKV        20A         TEXT('Kund.rekv.nr.')
     A                                      COLHDG('Kund.rekv.nr.')
      *
     A            FOLMTX        20A         TEXT('Lev. måte tekst')
     A                                      COLHDG('Lev. måte tekst')
      *
     A            FOLBTX        75A         TEXT('Lev. bet. tekst')
     A                                      COLHDG('Lev. bet. tekst')
      *
     A            FORABP         5S 2       TEXT('Rabatt i %')
     A                                      COLHDG('Rab' 'i %')
     A                                      EDTCDE(M)
      *
     A            FOPASL         5S 2       TEXT('Beregn påslag %')
     A                                      COLHDG('Påslag %')
     A                                      EDTCDE(M)
      *
     A            FOPASK         1A         TEXT('Påslag/Ønsket DB')
     A                                      COLHDG('Påslag' 'Ønsket DB')
     A                                      VALUES('P' 'R' ' ')
     A                                      CHKMSGID(FMO0110 *LIBL/QMFOFAK)
      *
6.NU A            FOPORD         8S 0       TEXT('Prisordrenummer')
     A                                      COLHDG('Pris' 'ordrenr')
     A                                      EDTCDE(Z)
      *
     A            FOPSUF    R               REFFLD(FÅSUFF)
     A                                      TEXT('Suffix-prisordre')
     A                                      COLHDG('Suffix' 'prisordre')
      *
     A            FOKOLI        11S 3       TEXT('Kolli')
     A                                      EDTCDE(M)
     A                                      COLHDG('Kolli')
      *
     A            FOKONR        11S 2       TEXT('Kontant-rabatt')
     A                                      COLHDG('Kont' 'rab')
     A                                      EDTCDE(M)
      *
     A            FOTOTX        11S 2       TEXT('KR fritt salg')
     A                                      COLHDG('KR fritt salg')
     A                                      EDTCDE(M)
      *
     A            FOTOTS        11S 2       TEXT('Total salg')
     A                                      COLHDG('Total salg')
     A                                      EDTCDE(M)
      *
     A            FOTOTR        11S 2       TEXT('Total rabatt')
     A                                      COLHDG('Total rabatt')
     A                                      EDTCDE(M)
      *
     A            FOTOTK        11S 2       TEXT('Total kost')
     A                                      COLHDG('Total kost')
     A                                      EDTCDE(M)
5.63  *
5.63 A            FOBRRA        11S 2       TEXT('Bruksr.rab.')
5.63 A                                      COLHDG('Bruksr.rab.')
5.63 A                                      EDTCDE(M)
      *
     A            FOUSKR        10A         TEXT('Bruker gir Kreditt')
     A                                      COLHDG('Bruker' 'Kreditt')
      *
     A            FOKODE         1S 0       TEXT('Behandling pågår')
     A                                      COLHDG('Behandl' 'pågår')
     A                                      EDTCDE(Z)
      *
     A            FOUTSK         1S 0       TEXT('Kode for utskrift')
     A                                      COLHDG('Kode' 'utskrift')
     A                                      EDTCDE(Z)
5.01  *
5.01 A            FOPAKS         1S 0       TEXT('Pakkseddel skrevet')
5.01 A                                      COLHDG('Pakks' 'skrevet')
5.01 A                                      EDTCDE(Z)
      *
      *
     A            FOITYP    R               REFFLD(FÅOTYP)
     A                                      TEXT('Info-type')
     A                                      COLHDG('Info' 'type')
      *
     A            FOKOWS        10A         TEXT('Behandl. WS')
     A                                      COLHDG('Behandl. WS')
      *
     A            FOKOUS        10A         TEXT('Behandl. bruker')
     A                                      COLHDG('Behandl.' 'bruker')
      *
     A            FOKODA          L         TEXT('Behandl. dato')
     A                                      COLHDG('Behandl.' 'dato')
      *
     A            FOKOTI          T         TEXT('Behandl. kl')
     A                                      COLHDG('Behandl.' 'kl')
      *
     A            FOBIND         1A         TEXT('Binding til skjerm')
     A                                      COLHDG('Binding' 'skjerm')
     A                                      VALUES(' ' 'N' 'J' 'X')
     A                                      CHKMSGID(FMO0120 *LIBL/QMFOFAK)
      *
     A            FOTDAT          L         TEXT('Utgår dato')
     A                                      COLHDG('Utgår' 'dato')
      *
5.51 A            FODDAT          L         TEXT('Oppfølgingsdato')
5.51 A                                      COLHDG('Oppf.' 'dato')
5.51  *
5.51 A            FOREST         1S 0       TEXT('Restordre')
5.51 A                                      COLHDG('Rest' 'ordre')
5.51 A                                      EDTCDE(Z)
5.53 A            FOADAT          L         TEXT('Akseptdato')
5.53 A                                      COLHDG('Aksept' 'dato')
      *
8.01 A            FOEDIH         8S 0       TEXT('Edi-hode')
     A                                      COLHDG('Edi-hode')
     A                                      EDTCDE(Z)
      *
     A            FOKPRO    R               REFFLD(FÅKPRO)
      *
     A            FOBKUN         6S 0       TEXT('Kunde/bestiller')
     A                                      COLHDG('Kunde' 'bestiller')
     A                                      EDTCDE(Z)
      *
     A            FOKKUN         6S 0       TEXT('Kunde/kjøper')
     A                                      COLHDG('Kunde' 'kjøper')
     A                                      EDTCDE(Z)
5.10  *
5.10 A            FOOLAG         1S 0
5.10 A                                      EDTCDE(Z)
5.10 A                                      COLHDG('Kode, oppd. lager')
5.10 A                                      TEXT('Kode, oppd. lager')
5.07  *
5.07 A            FONREF    R               REFFLD(FÅNREF)
5.22 A            FOFSYS    R               REFFLD(FÅFSYS)
5.23  *
6.NU A            FOBENR         8S 0       TEXT('Bestillings-nr')
5.23 A                                      COLHDG('Best' 'nr.')
5.23 A                                      EDTCDE(Z)
5.23  *
5.23 A            FOBSUF         2S 0       TEXT('Bestillings-suffix')
5.23 A                                      COLHDG('Best' 'suffix')
5.23 A                                      EDTCDE(Z)
5.23  *
5.23 A            FOMOBI        15A         TEXT('Kundens mobilnr')
5.23 A                                      COLHDG('Kundens' 'mobil')
5.23  *
5.23 A            FOKBNR        15A         TEXT('Kundens best.nr')
5.23 A                                      COLHDG('Kundens' 'best.nr')
      *
5.37 A            FODEPO        11S 2       TEXT('Krav til Depositum')
5.37 A                                      COLHDG('Krav' 'Depositum')
5.37 A                                      EDTCDE(M)
      *
5.64 A            FODEPB        11S 2       TEXT('Betalt Depositum')
5.64 A                                      COLHDG('Betalt' 'Depositum')
5.64 A                                      EDTCDE(M)
      *
5.64 A            FODEPT        11S 2       TEXT('Trukket Depositum på fakt')
5.64 A                                      COLHDG('Trukket' 'Depositum')
5.64 A                                      EDTCDE(M)
      *
5.37 A            FOFATY         2S 0       TEXT('Fakturatype')
5.37 A                                      COLHDG('Fakt.' 'type')
5.37 A                                      EDTCDE(Z)
      *
5.37 A            FOBONG        12A         TEXT('Bongnr')
5.37 A                                      COLHDG('Bongnr')
      *
     A            FOPLSE         4S 0       TEXT('Plukkes av selgernr')
     A                                      COLHDG('Pl. av' 'Sn')
     A                                      EDTCDE(Z)
      *
5.52 A            FOINF1        12A         TEXT('Informasjon-1')
5.52 A                                      COLHDG('Info-1')
      *
5.52 A            FOINF2        40A         TEXT('Informasjon-2')
5.52 A                                      COLHDG('Info-2')
      *
6.28 A            FOMERK         1S 0
6.28 A                                      EDTCDE(Z)
6.28 A                                      VALUES(0 1)
6.28 A                                      CHKMSGID(FMO0100 *LIBL/QMFOFAK)
6.28 A                                      COLHDG('Merk til' ' sjåfør')
6.28 A                                      TEXT('Merk til sjåfør')
6.2i A            FOLAOK         1S 0       TEXT('Leveringsadresse OK')
6.2i A                                      COLHDG('Lev.adr' 'OK')
6.2i A                                      EDTCDE(Z)
6.2i A                                      VALUES(0 1)
6.2i A                                      CHKMSGID(FMO0100 *LIBL/QMFOFAK)
      *
     A            FOSTIM          T         TEXT('Salg kl.')
     A                                      COLHDG('Salg' 'kl.')
6.27  *
6.27 A            FOUPRO    R               REFFLD(FÅUPRO)
      *
     A            FOWSID        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arb.stasj.')
      *
     A            FOUSER        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FODATE          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            FOTIME          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
6.10 A            FOOOUS    R               REFFLD(FÅOUSR)
6.10 A            FOEDAT    R               REFFLD(FÅEDAT)
6.10 A            FOETIM    R               REFFLD(FÅETIM)
6.10 A            FOEUSR    R               REFFLD(FÅEUSR)
7.11  *
7.11  * Ordre-hode-register  SIDEREGISTER   (FO)
7.11  *
7.11 A            FO2FIR    R               REFFLD(FÅFIRM)
7.11  *
7.11 A            FO2NUM    R               REFFLD(FÅNUMM)
7.11 A                                      COMP(NE 0)
7.11 A                                      CHKMSGID(FMO0600 *LIBL/QMFOFAK)
7.11  *
7.11 A            FO2SUF    R               REFFLD(FÅSUFF)
7.11  *
7.11 A            FO2NBF    R               REFFLD(FÅSVA2)
7.11 A            FO2USE        10A         TEXT('Bruker')
7.11 A                                      COLHDG('Bruker')
7.11  *
7.11 A            FO2DAT          L         TEXT('Dato opprettet')
7.11 A                                      COLHDG('Dato' 'opprettet')
7.11  *
7.11 A            FO2TIM          T         TEXT('Klokkeslett')
7.11 A                                      COLHDG('Klokken')
7.11 A            FO2OOU    R               REFFLD(FÅOUSR)
7.11 A            FO2EDA    R               REFFLD(FÅEDAT)
7.11 A            FO2ETI    R               REFFLD(FÅETIM)
7.11 A            FO2EUS    R               REFFLD(FÅEUSR)
      *
      *
      * Spesialpris                         (FP)
      *
     A            FPFIRM    R               REFFLD(FÅFIRM)
5.70 A            FPPRGR    R               REFFLD(FÅPRGR)
     A            FPRKAT    R               REFFLD(FÅRKAT)
5.24 A            FPKKAT    R               REFFLD(FÅKKAT)
     A            FPKUND    R               REFFLD(FÅKUND)
     A            FPKPRO    R               REFFLD(FÅKPRO)
     A            FPVARE    R               REFFLD(FÅVARE)
     A            FPENHE    R               REFFLD(FÅENHE)
     A            FPLETY    R               REFFLD(FÅLETY)
      *
     A            FPFDAT          L         TEXT('Fra-dato')
     A                                      COLHDG('Fra-dato')
      *
     A            FPTDAT          L         TEXT('Til-dato')
     A                                      COLHDG('Til-dato')
      *
     A            FPSAPR         9S 2       TEXT('Salgspris')
     A                                      COLHDG('Salgspris')
     A                                      EDTCDE(4)
      *
     A            FPRAB1         5S 2       TEXT('Rabatt-1')
     A                                      COLHDG('Rab-1')
     A                                      EDTCDE(4)
      *
     A            FPRAB2         5S 2       TEXT('Rabatt-2')
     A                                      COLHDG('Rab-2')
     A                                      EDTCDE(4)
      *
     A            FPKOPR         9S 2       TEXT('Kostpris')
     A                                      COLHDG('Kostpris')
     A                                      EDTCDE(4)
      *
     A            FPNUMM    R               REFFLD(FÅNUMM)
6.10 A            FPODAT    R               REFFLD(FÅODAT)
6.10 A            FPOTIM    R               REFFLD(FÅOTIM)
6.10 A            FPOUSR    R               REFFLD(FÅOUSR)
     A            FPEDAT    R               REFFLD(FÅEDAT)
     A            FPETIM    R               REFFLD(FÅETIM)
     A            FPEUSR    R               REFFLD(FÅEUSR)
      *
      * Spesialpris notat                   (FPN)
      *
     A            FPNFIR    R               REFFLD(FÅFIRM)
     A            FPNKUN    R               REFFLD(FÅKUND)
     A            FPNKPR    R               REFFLD(FÅKPRO)
     A            FPNVAR    R               REFFLD(FÅVARE)
     A            FPNNO1        20A         TEXT('Notat-1')
     A                                      COLHDG('Notat-1')
     A            FPNNO2        20A         TEXT('Notat-2')
     A                                      COLHDG('Notat-2')
     A            FPNNO3        20A         TEXT('Notat-3')
     A                                      COLHDG('Notat-3')
     A            FPNNO4        20A         TEXT('Notat-4')
     A                                      COLHDG('Notat-4')
     A            FPNNO5        20A         TEXT('Notat-5')
     A                                      COLHDG('Notat-5')
     A            FPNODA    R               REFFLD(FÅODAT)
6.10 A            FPNOTI    R               REFFLD(FÅOTIM)
6.10 A            FPNOUS    R               REFFLD(FÅOUSR)
     A            FPNEDA    R               REFFLD(FÅEDAT)
     A            FPNETI    R               REFFLD(FÅETIM)
     A            FPNEUS    R               REFFLD(FÅEUSR)
      *
      * Rabattmatrise                       (FR)
      *
     A            FRFIRM    R               REFFLD(FÅFIRM)
5.70 A            FRPRGR    R               REFFLD(FÅPRGR)
     A            FRRKAT    R               REFFLD(FÅRKAT)
5.24 A            FRKKAT    R               REFFLD(FÅKKAT)
     A            FRKUND    R               REFFLD(FÅKUND)
     A            FRKPRO    R               REFFLD(FÅKPRO)
     A            FROGRP    R               REFFLD(FÅOGRP)
     A            FRHGRP    R               REFFLD(FÅHGRP)
     A            FRUGRP    R               REFFLD(FÅUGRP)
     A            FRLDOR    R               REFFLD(FÅLDOR)
     A            FRMODN    R               REFFLD(FÅMODN)
     A            FRVARE    R               REFFLD(FÅVARE)
     A            FRENHE    R               REFFLD(FÅENHE)
     A            FRLETY    R               REFFLD(FÅLETY)
      *
     A            FRNOTA         5A         TEXT('Notat')
     A                                      COLHDG('Notat')
6.13  *
6.13 A            FRPSLM    R               REFFLD(FÅPSLM)
      *
     A            FRRAB1         4S 2       TEXT('Rabatt-1')
     A                                      COLHDG('Rab-1')
     A                                      EDTCDE(4)
      *
     A            FRRA1D         4S 2       TEXT('Rabatt-1 datostyrt')
     A                                      COLHDG('Rab-1' 'datostyrt')
     A                                      EDTCDE(4)
      *
     A            FRRA1F          L         TEXT('Rabatt-1 fra-dato')
     A                                      COLHDG('Rab-1' 'fra-dato')
      *
     A            FRRA1T          L         TEXT('Rabatt-1 til-dato')
     A                                      COLHDG('Rab-1' 'til-dato')
      *
     A            FRRAB2         4S 2       TEXT('Rabatt-2')
     A                                      COLHDG('Rab-2')
     A                                      EDTCDE(4)
      *
     A            FRRA2D         4S 2       TEXT('Rabatt-2 datostyrt')
     A                                      COLHDG('Rab-2' 'datostyrt')
     A                                      EDTCDE(4)
      *
     A            FRRA2F          L         TEXT('Rabatt-2 fra-dato')
     A                                      COLHDG('Rab-2' 'fra-dato')
      *
     A            FRRA2T          L         TEXT('Rabatt-2 til-dato')
     A                                      COLHDG('Rab-2' 'til-dato')
      *
     A            FRRABN         4S 2       TEXT('Rabatt-N')
     A                                      COLHDG('Rab-N')
     A                                      EDTCDE(4)
      *
     A            FRRAND         4S 2       TEXT('Rabatt-N datostyrt')
     A                                      COLHDG('Rab-N' 'datostyrt')
     A                                      EDTCDE(4)
      *
     A            FRRANF          L         TEXT('Rabatt-N fra-dato')
     A                                      COLHDG('Rab-N' 'fra-dato')
      *
     A            FRRANT          L         TEXT('Rabatt-N til-dato')
     A                                      COLHDG('Rab-N' 'til-dato')
      *
     A            FRRABB         4S 2       TEXT('Rabatt-B')
     A                                      COLHDG('Rab-B')
     A                                      EDTCDE(4)
      *
     A            FRRABD         4S 2       TEXT('Rabatt-B datostyrt')
     A                                      COLHDG('Rab-B' 'datostyrt')
     A                                      EDTCDE(4)
      *
     A            FRRBUF          L         TEXT('Rabatt-B fra-dato')
     A                                      COLHDG('Rab-B' 'fra-dato')
      *
     A            FRRBUT          L         TEXT('Rabatt-B til-dato')
     A                                      COLHDG('Rab-B' 'til-dato')
      *
     A            FRRABT         4S 2       TEXT('Rabatt-T')
     A                                      COLHDG('Rab-T')
     A                                      EDTCDE(4)
      *
     A            FRRATD         4S 2       TEXT('Rabatt-T datostyrt')
     A                                      COLHDG('Rab-T' 'datostyrt')
     A                                      EDTCDE(4)
      *
     A            FRRATF          L         TEXT('Rabatt-T fra-dato')
     A                                      COLHDG('Rab-T' 'fra-dato')
      *
     A            FRRATT          L         TEXT('Rabatt-T til-dato')
     A                                      COLHDG('Rab-T' 'til-dato')
      *
     A            FRDEKN         5S 2       TEXT('Dekningsgrad')
     A                                      COLHDG('DG')
     A                                      EDTCDE(4)
      *
     A            FRDEKD         5S 2       TEXT('Dekningsgrad datostyrt')
     A                                      COLHDG('DG' 'datostyrt')
     A                                      EDTCDE(4)
      *
     A            FRDEKF          L         TEXT('Dekningsgrad fra-dato')
     A                                      COLHDG('DG' 'fra-dato')
      *
     A            FRDEKT          L         TEXT('Dekningrad til-dato')
     A                                      COLHDG('DG' 'til-dato')
      *
     A            FRODAT    R               REFFLD(FÅODAT)
6.10 A            FROTIM    R               REFFLD(FÅOTIM)
6.10 A            FROUSR    R               REFFLD(FÅOUSR)
     A            FREDAT    R               REFFLD(FÅEDAT)
     A            FRETIM    R               REFFLD(FÅETIM)
     A            FREUSR    R               REFFLD(FÅEUSR)
5.34  *
5.34  * Pakkespefikasjon linje                (FP)
5.34  *
5.34 A            FSFIRM    R               REFFLD(FÅFIRM)
5.34  *
5.34 A            FSNUMM    R               REFFLD(FÅNUMM)
5.34 A                                      COMP(NE 0)
5.34 A                                      CHKMSGID(FMD0600 *LIBL/QMFOFAK)
5.34  *
5.34 A            FSSUFF    R               REFFLD(FÅSUFF)
5.34  *
5.34 A            FSLINE    R               REFFLD(FÅLINE)
5.34 A                                      COMP(NE 0)
5.34 A                                      CHKMSGID(FMD0610 *LIBL/QMFOFAK)
5.34  *
5.34 A            FSPAKK         6S 0       TEXT('Pakkenr')
5.34 A                                      COLHDG('Pakkenr')
5.34 A                                      EDTCDE(Z)
5.34  *
5.34 A            FSLENG         6S 1       TEXT('Lengde i lm')
5.34 A                                      COLHDG('Lengde' 'lm')
5.34  *
5.34 A            FSDELT         1          TEXT('Delt.')
5.34 A                                      COLHDG('Delt.')
6.10 A            FSOUSR    R               REFFLD(FÅOUSR)
5.65  *
5.65  * Ordre-slettet-linje-register        (FS)
5.65  *
5.65  * De 4 neste variabler brukes om
5.65  * igjen  da  det  er  trangt med
5.65  * ledige bokstaver. De er derfor
5.65  * definert ovenfor under  pakke-
5.65  * spesifikasjon linje, og er
5.65  * stjernet ut her.
5.65  *
5.65 A*           FSFIRM    R  Def/Over     REFFLD(FÅFIRM)
5.65  *                        Def/Over
5.65 A*           FSNUMM    R  Def/Over     REFFLD(FÅNUMM)
5.65 A*                        Def/Over     COMP(NE 0)
5.65 A*                        Def/Over     CHKMSGID(FMD0600 *LIBL/QMFOFAK)
5.65  *                        Def/Over
5.65 A*           FSSUFF    R  Def/Over     REFFLD(FÅSUFF)
5.65  *                        Def/Over
5.65 A*           FSLINE    R  Def/Over     REFFLD(FÅLINE)
5.65 A*                        Def/Over     COMP(NE 0)
5.65 A*                        Def/Over     CHKMSGID(FMD0610 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSOTYP    R               REFFLD(FÅOTYP)
5.65 A                                      COMP(NE '  ')
5.65 A                                      CHKMSGID(FMD0620 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSLTYP         2A         TEXT('Linje-type')
5.65 A                                      COLHDG('Linje-type')
5.65  *
5.65 A            FSLETY         1S 0       TEXT('Leveringstype')
5.65 A                                      COLHDG('Lev.' 'type')
5.65 A                                      EDTCDE(Z)
5.65  *
5.65 A            FSVARE    R               REFFLD(FÅVARE)
5.65 A            FSENH1    R               REFFLD(FÅENHE)
5.65 A            FSLAGE    R               REFFLD(FÅLAGE)
5.65  *
5.65 A            FSKAKK         1S 0       TEXT('Kode, akk.type')
5.65 A                                      COLHDG('Kode,' 'akk.type')
5.65 A                                      EDTCDE(Z)
5.65 A                                      VALUES(0 1 2 3)
5.65 A                                      CHKMSGID(FMD0100 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSKPRI         1A         TEXT('Kode, pris')
5.65 A                                      COLHDG('Kode' 'pris')
5.65 A                                      VALUES(' ' 'N' 'T' 'F')
5.65 A                                      CHKMSGID(FMD0110 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSKGEB         1S 0       TEXT('Kode, gebyr/rest')
5.65 A                                      COLHDG('Kode' 'gebyr/rest')
5.65 A                                      EDTCDE(Z)
5.65 A                                      VALUES(0 1)
5.65 A                                      CHKMSGID(FMD0130 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSLASS         2S 0       TEXT('Kode, lass-nr')
5.65 A                                      COLHDG('Kode' 'lass-nr')
5.65 A                                      EDTCDE(Z)
5.65  *
5.65 A            FSKUND    R               REFFLD(FÅKUND)
5.65 A                                      COMP(NE 0)
5.65 A                                      CHKMSGID(FMD0630 *LIBL/QMFOFAK)
5.65  *
6.NU A            FSBENR         8S 0       TEXT('Bestillings-nr')
5.65 A                                      COLHDG('Best' 'nr.')
5.65 A                                      EDTCDE(Z)
5.65  *
5.65 A            FSBSUF         2S 0       TEXT('Bestillings-suff')
5.65 A                                      COLHDG('Best' 'suff.')
5.65 A                                      EDTCDE(Z)
5.65  *
5.65 A            FSBLIN         4S 0       TEXT('Bestillings-linje')
5.65 A                                      COLHDG('Best' 'linje')
5.65 A                                      EDTCDE(Z)
5.65  *
5.65 A            FSLDOR         6S 0       TEXT('Leverandør-nr')
5.65 A                                      COLHDG('Levd.' 'nr.')
5.65 A                                      EDTCDE(Z)
5.65  *
5.65 A            FSLDAT    R               REFFLD(FÅLDAT)
5.65  *
5.65 A            FSAVDE         4S 0       TEXT('Avdeling')
5.65 A                                      COLHDG('Avd')
5.65 A                                      EDTCDE(Z)
5.65  *
5.65 A            FSKONT         6S 0       TEXT('Kontonummer')
5.65 A                                      COLHDG('Konto' 'nr.')
5.65 A                                      EDTCDE(Z)
5.65  *
5.65 A            FSSPES         4S 0       TEXT('Spesifikasjon')
5.65 A                                      COLHDG('Spes')
5.65 A                                      EDTCDE(Z)
5.65  *
6.26 A            FSPROJ    R               REFFLD(FÅPROJ)
5.65  *
5.65 A            FSALME    R               REFFLD(FÅALME)
5.65 A            FSBRTY    R               REFFLD(FÅBRTY)
5.65 A            FSPRIV    R               REFFLD(FÅPRIV)
5.65  *
6.27 A            FSAKTI    R               REFFLD(FÅAKTI)
5.65  *
6.33 A            FSLVAR    R               REFFLD(FÅLVAR)
5.65 A                                      TEXT('Lev.dør. varenr.')
5.65 A                                      COLHDG('Levd' 'varenr.')
5.65  *
5.65 A            FSNOBB    R               REFFLD(FÅNOBB)
5.65  *
5.65 A            FSTEK1    R               REFFLD(FÅTEK1)
5.65 A            FSTEK2    R               REFFLD(FÅTEK2)
5.65  *
5.65 A            FSANTA    R               REFFLD(FÅANTA)
5.65 A                                      COMP(LT 99999999)
5.65 A                                      CHKMSGID(FMD0640 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSANTB        11S 3       TEXT('Antall bestilt')
5.65 A                                      COLHDG('Ant' 'best')
5.65 A                                      EDTCDE(M)
5.65 A                                      COMP(LT 99999999)
5.65 A                                      CHKMSGID(FMD0640 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSANTC        11S 3       TEXT('Antall innkommet')
5.65 A                                      COLHDG('Ant' 'innkommet')
5.65 A                                      EDTCDE(M)
5.65 A                                      COMP(LT 99999999)
5.65 A                                      CHKMSGID(FMD0640 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSOPPR         9S 2       TEXT('Opprinnelig pris')
5.65 A                                      COLHDG('Oppr.' 'pris')
5.65 A                                      EDTWRD('     0 ,  ')
5.65  *
5.65 A            FSSAPR         9S 2       TEXT('Salgspris')
5.65 A                                      COLHDG('Salgspris')
5.65 A                                      EDTWRD('     0 ,  ')
5.65  *
5.65 A            FSKOPR         9S 2       TEXT('Kost-pris')
5.65 A                                      COLHDG('Kostpris')
5.65 A                                      EDTWRD('     0 ,  ')
5.65  *
5.65 A            FSINPR         9S 2       TEXT('Innkjøpspris')
5.65 A                                      COLHDG('Innk.pris')
5.65 A                                      EDTWRD('     0 ,  ')
5.65  *
5.65 A            FSRAB1         5S 2       TEXT('Linje-rabatt 1')
5.65 A                                      COLHDG('Linje' 'rab.1')
5.65 A                                      EDTCDE(Z)
5.65 A                                      COMP(LE 100)
5.65 A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSRAB2         5S 2       TEXT('Linje-rabatt 2')
5.65 A                                      COLHDG('Linje' 'rab.2')
5.65 A                                      EDTCDE(Z)
5.65 A                                      COMP(LE 100)
5.65 A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSRAB3         5S 2       TEXT('Linje-rabatt 3')
5.65 A                                      COLHDG('Linje' 'rab.3')
5.65 A                                      EDTCDE(Z)
5.65 A                                      COMP(LE 100)
5.65 A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSRAB4         5S 2       TEXT('Linje-rabatt 4')
5.65 A                                      COLHDG('Linje' 'rab.4')
5.65 A                                      EDTCDE(Z)
5.65 A                                      COMP(LE 100)
5.65 A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSRAB5         5S 2       TEXT('Linje-rabatt 5')
5.65 A                                      COLHDG('Linje' 'rab.5')
5.65 A                                      EDTCDE(Z)
5.65 A                                      COMP(LE 100)
5.65 A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSBRR1         5S 2       TEXT('Bruksrettrabatt 1')
5.65 A                                      COLHDG('Bruksrett' 'rab.1')
5.65 A                                      EDTCDE(Z)
5.65 A                                      COMP(LE 100)
5.65 A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSBRR2         5S 2       TEXT('Bruksrettrabatt 2')
5.65 A                                      COLHDG('Bruksrett' 'rab.2')
5.65 A                                      EDTCDE(Z)
5.65 A                                      COMP(LE 100)
5.65 A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSPASL         5S 2       TEXT('Påslag')
5.65 A                                      COLHDG('Påslag')
5.65 A***                                   EDTCDE(Z)
5.65 A                                      EDTWRD(' 0 ,  ')
5.65 A                                      COMP(LT 999)
5.65 A                                      CHKMSGID(FMD0660 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSRKR1        11S 2       TEXT('Rab.1 Kr.')
5.65 A                                      COLHDG('Rab.1 Kr.')
5.65 A                                      EDTCDE(M)
5.65  *
5.65 A            FSRKR2        11S 2       TEXT('Rab.2 Kr.')
5.65 A                                      COLHDG('Rab.2 Kr.')
5.65 A                                      EDTCDE(M)
5.65  *
5.65 A            FSSUMS        11S 2       TEXT('Sum salg')
5.65 A                                      COLHDG('Sum salg')
5.65 A                                      EDTCDE(M)
5.65  *
5.65 A            FSSUMR        11S 2       TEXT('Sum rabatt')
5.65 A                                      COLHDG('Sum rabatt')
5.65 A                                      EDTCDE(M)
5.65  *
5.65 A            FSSUMK        11S 2       TEXT('Sum kost')
5.65 A                                      COLHDG('Sum kost')
5.65 A                                      EDTCDE(M)
5.65  *
5.65 A            FSBBON        11S 2       TEXT('Beregn. bonus')
5.65 A                                      COLHDG('Beregn bonus')
5.65 A                                      EDTCDE(M)
5.65  *
5.65 A            FSOMVA         1A         TEXT('Økonomi MVA-kode')
5.65 A                                      COLHDG('OKON' 'MVA')
5.65  *
5.65 A            FSLVRE         1S 0       TEXT('Lokalt vreg')
5.65 A                                      COLHDG('Lok' 'vreg')
5.65 A                                      EDTCDE(Z)
5.65 A                                      VALUES(0 1)
5.65 A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
5.65  *
5.65 A            FSOLAG         1S 0       TEXT('Kode, oppd. lager')
5.65 A                                      COLHDG('Kode, oppd. lager')
5.65 A                                      EDTCDE(Z)
5.65  *
5.65 A            FSOGRP    R               REFFLD(FÅOGRP)
5.65 A            FSHGRP    R               REFFLD(FÅHGRP)
5.65 A            FSUGRP    R               REFFLD(FÅUGRP)
5.65  *
5.65 A            FSGAVE        12A         TEXT('Gavekortnr')
5.65 A                                      COLHDG('Gavekortnr')
5.65  *
5.65 A            FSVARI       140A         TEXT('Varians')
5.65 A                                      COLHDG('Varians')
5.65  *
5.65 A            FSEDIH         6S 0       TEXT('Edi-hode')
5.65 A                                      COLHDG('Edi' 'hode')
5.65 A                                      EDTCDE(Z)
5.65  *
5.65 A            FSEDIL         6S 0       TEXT('Edi-linje')
5.65 A                                      COLHDG('Edi' 'linje')
5.65 A                                      EDTCDE(Z)
5.65  *
5.65 A            FSKAMP    R               REFFLD(FÅKAMP)
5.65  *
5.65 A            FSKBNR        15A         TEXT('Kundens best.nr')
5.65 A                                      COLHDG('Kundens' 'best.nr')
5.65  *
5.65 A            FSKBLI         6S 0       TEXT('Kundens best.linje')
5.65 A                                      COLHDG('Kundens' 'best.linje')
5.65  *
5.65 A            FSEANN    R               REFFLD(FÅEANN)
5.70  *
5.70 A            FSPRGR    R               REFFLD(FÅPRGR)
6.24  *
6.24 A            FSPRTX         1A         TEXT('Print')
6.24 A                                      COLHDG('Print')
5.65  *
5.65 A            FSSTIM          T         TEXT('Salg kl.')
5.65 A                                      COLHDG('Salg' 'kl.')
5.65  *
5.65 A            FSWSID        10A         TEXT('Arbeidstasjon')
5.65 A                                      COLHDG('Arbeidstasjon')
5.65  *
5.65 A            FSUSER        10A         TEXT('Bruker-ID')
5.65 A                                      COLHDG('Bruker-ID')
5.65  *
5.65 A            FSDATE          L         TEXT('Dato slettet')
5.65 A                                      COLHDG('Dato slettet')
5.65  *
5.65 A            FSTIME          T         TEXT('Klokkeslett')
5.65 A                                      COLHDG('Klokken')
6.10 A            FSODAT    R               REFFLD(FÅODAT)
6.10 A            FSOTIM    R               REFFLD(FÅOTIM)
6.10 A            FSOOUS    R               REFFLD(FÅOUSR)
6.10 A            FSEDAT    R               REFFLD(FÅEDAT)
6.10 A            FSETIM    R               REFFLD(FÅETIM)
6.10 A            FSEUSR    R               REFFLD(FÅEUSR)
5.65  *
5.65  * Variabler ut over det som ligger
5.65  * i FODTPF
5.65  *
5.65 A            FSSPGM        10A         TEXT('Slettet-Pgm')
5.65 A                                      COLHDG('Slettet-Pgm')
5.65  *
5.65 A            FSSLWS        10A         TEXT('Slettet-WS')
5.65 A                                      COLHDG('Slettet-WS')
5.65  *
5.65 A            FSSLUS        10A         TEXT('Slettet-User')
5.65 A                                      COLHDG('Slettet-User')
5.65  *
5.65 A            FSSLDA          L         TEXT('Slettet-dato')
5.65 A                                      COLHDG('Slettet-dato')
5.65  *
5.65 A            FSSLTI          T         TEXT('Klokkeslett')
5.65 A                                      COLHDG('Klokken')
      *
      * Ordre-tekst-register                (FT)
      *
     A            FTFIRM    R               REFFLD(FÅFIRM)
      *
     A            FTNUMM    R               REFFLD(FÅNUMM)
      *
     A            FTSUFF    R               REFFLD(FÅSUFF)
      *
     A            FTLINE    R               REFFLD(FÅLINE)
      *
     A            FTTYPE         2A         TEXT('Tekst-type')
     A                                      COLHDG('Tekst' 'type')
      *
     A            FTTEXT        70A         TEXT('Tekst')
     A                                      COLHDG('Tekst')
6.24  *
6.24 A            FTPRTX         1A         TEXT('Print')
6.24 A                                      COLHDG('Print')
6.24  *
6.10 A            FTODAT    R               REFFLD(FÅODAT)
6.10 A            FTOTIM    R               REFFLD(FÅOTIM)
6.10 A            FTOUSR    R               REFFLD(FÅOUSR)
6.10 A            FTEDAT    R               REFFLD(FÅEDAT)
6.10 A            FTETIM    R               REFFLD(FÅETIM)
6.10 A            FTEUSR    R               REFFLD(FÅEUSR)
5.58  *
5.58  * Logg-file for ordreforløp           (FT)
5.58  *
5.58 A            FUFIRM    R               REFFLD(FÅFIRM)
5.58  *
5.33 A            FUAARR         4S 0       TEXT('År')
5.33 A                                      COLHDG('År')
5.33 A                                      EDTCDE(Z)
5.58  *
5.58 A            FUNUMM    R               REFFLD(FÅNUMM)
5.58  *
5.58 A            FUSUFF    R               REFFLD(FÅSUFF)
5.58  *
5.58 A            FUKODE         1A         TEXT('Logg-kode')
5.58 A                                      COLHDG('Logg' 'kode')
5.58  *
5.58  *                                     Logg koden er som følger:
5.58  *                                     1 = Ordre bekreftet
5.58  *                                     2 = Klar for plukking
5.58  *                                     4 = Under plukking
5.58  *                                     6 = Ferdig plukket
5.58  *                                     8 = Restet / dellevert
5.58  *
5.58 A            FUDATE          L         TEXT('Dato logget')
5.58 A                                      COLHDG('Dato logget')
5.58  *
5.58 A            FUTIME          T         TEXT('Klokkeslett')
5.58 A                                      COLHDG('Klokken')
5.58  *
5.58 A            FUWSID        10A         TEXT('Arbeidstasjon')
5.58 A                                      COLHDG('Arbeidstasjon')
5.58  *
5.58 A            FUUSER        10A         TEXT('Bruker-ID')
5.58 A                                      COLHDG('Bruker-ID')
6.10 A            FUODAT    R               REFFLD(FÅODAT)
6.10 A            FUOTIM    R               REFFLD(FÅOTIM)
6.10 A            FUOUSR    R               REFFLD(FÅOUSR)
6.10 A            FUEDAT    R               REFFLD(FÅEDAT)
6.10 A            FUETIM    R               REFFLD(FÅETIM)
6.10 A            FUEUSR    R               REFFLD(FÅEUSR)
5.34  *
5.34  * Lengdespesifikasjon linje           (FV)
5.34  *
5.34 A            FVFIRM    R               REFFLD(FÅFIRM)
5.34  *
5.34 A            FVNUMM    R               REFFLD(FÅNUMM)
5.34 A                                      COMP(NE 0)
5.34 A                                      CHKMSGID(FMD0600 *LIBL/QMFOFAK)
5.34  *
5.34 A            FVSUFF    R               REFFLD(FÅSUFF)
5.34  *
5.34 A            FVLINE    R               REFFLD(FÅLINE)
5.34 A                                      COMP(NE 0)
5.34 A                                      CHKMSGID(FMD0610 *LIBL/QMFOFAK)
5.34  *
5.34 A            FVLPNR         4S 0       TEXT('Løpenr.')
5.34 A                                      COLHDG('Løpenr.')
5.34 A                                      EDTCDE(Z)
5.34  *
5.34 A            FVLENG    R               REFFLD(FÅLENG)
5.34  *
5.34 A            FVANTA    R               REFFLD(FÅANTA)
5.34 A                                      COMP(LT 99999999)
5.34 A                                      CHKMSGID(FMD0640 *LIBL/QMFOFAK)
6.10 A            FVODAT    R               REFFLD(FÅODAT)
6.10 A            FVOTIM    R               REFFLD(FÅOTIM)
6.10 A            FVOUSR    R               REFFLD(FÅOUSR)
6.10 A            FVEDAT    R               REFFLD(FÅEDAT)
6.10 A            FVETIM    R               REFFLD(FÅETIM)
6.10 A            FVEUSR    R               REFFLD(FÅEUSR)
      *
      * Ordre-slettet-register              (FY)
      *
     A            FYFIRM    R               REFFLD(FÅFIRM)
      *
     A            FYAARR         4S 0       TEXT('År')
     A                                      COLHDG('År')
     A                                      EDTCDE(Z)
      *
     A            FYNUMM    R               REFFLD(FÅNUMM)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMY0600 *LIBL/QMFOFAK)
      *
     A            FYSUFF    R               REFFLD(FÅSUFF)
6.2K  *
6.2K A            FYLINE    R               REFFLD(FÅLINE)
      *
     A            FYOTYP    R               REFFLD(FÅOTYP)
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMY0610 *LIBL/QMFOFAK)
6.2K  *
6.2K A            FYLETY         1S 0       TEXT('Leveringstype')
6.2K A                                      COLHDG('Lev.' 'type')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYLAGE    R               REFFLD(FÅLAGE)
6.2K  *
6.NU A            FYBINR         8S 0       TEXT('Bilagsnummer')
6.2K A                                      COLHDG('Bilag' 'nr')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.NU A            FYKREF         8S 0       TEXT('Kreditt-ref.')
6.2K A                                      COLHDG('Kred' 'ref.')
6.2K A                                      EDTCDE(Z)
      *
     A            FYBDAT          L         TEXT('Ordredato')
     A                                      COLHDG('Ordre' 'dato')
6.2K  *
6.2K A            FYLDAT    R               REFFLD(FÅLDAT)
6.2Y A                                      DFT('0001-01-01')
6.2K  *
6.2K A            FYPDAT          L         TEXT('Planlagt lev.')
6.2K A                                      COLHDG('Planl.' 'lev.')
6.2Y A                                      DFT('0001-01-01')
6.2K  *
6.2K A            FYPADA          L         TEXT('Pakkseddel''dato')
6.2K A                                      COLHDG('Pakks.' 'dato')
6.2Y A                                      DFT('0001-01-01')
6.2K  *
6.2K A            FYFKDA          L         TEXT('Fakturadato')
6.2K A                                      COLHDG('Fakt' 'dato')
6.2Y A                                      DFT('0001-01-01')
6.2K  *
6.2K A            FYFFDA          L         TEXT('Forfallsdato')
6.2K A                                      COLHDG('Forf' 'dato')
6.2Y A                                      DFT('0001-01-01')
6.2K  *
6.2K A            FYBETB         2S 0       TEXT('Bet.betingelser')
6.2K A                                      COLHDG('Bet.' 'bet.')
6.2K A                                      EDTCDE(Z)
      *
     A            FYSELG    R               REFFLD(FÅSELG)
6.2K  *
6.2K A            FYDIST         4S 0       TEXT('Distrikt')
6.2K A                                      COLHDG('Distr')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYLMAT         2S 0       TEXT('Leveringsmåte')
6.2K A                                      COLHDG('Lev' 'måte')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYLBET         2S 0       TEXT('Leveringsbet.')
6.2K A                                      COLHDG('Lev' 'bet.')
6.2K A                                      EDTCDE(Z)
      *
     A            FYVALK         3A         TEXT('Valuta')
     A                                      COLHDG('Valuta')
6.2K  *
6.2K A            FYRKAT         3S 0       TEXT('Rabatt-kategori')
6.2K A                                      COLHDG('Rab' 'kat')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYSPED         3S 0       TEXT('Speditor')
6.2K A                                      COLHDG('Sped')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYKJOR         2S 0       TEXT('Kjørerute')
6.2K A                                      COLHDG('Kjøre' 'rute')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYKJNR         5S 0       TEXT('Rekkefølge innen rute')
6.2K A                                      COLHDG('Innen' 'rute')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYLASS         2S 0       TEXT('Kode, lass-nr')
6.2K A                                      COLHDG('Kode' 'lass-nr')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYMKOD         1S 0       TEXT('Mva-kode')
6.2K A                                      COLHDG('Mva-kode')
6.2K A                                      EDTCDE(Z)
6.2K A                                      VALUES(0 1)
6.2K A                                      CHKMSGID(FMY0100 *LIBL/QMFOFAK)
      *
     A            FYLKUN         6S 0       TEXT('Vare-adresse')
     A                                      COLHDG('Vare' 'adresse')
     A                                      EDTCDE(Z)
      *
     A            FYKUND    R               REFFLD(FÅKUND)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMY0630 *LIBL/QMFOFAK)
6.2K  *
6.2K A            FYLDOR         6S 0       TEXT('Leverandørnummer')
6.2K A                                      COLHDG('Lev' 'dør')
6.2K A                                      EDTCDE(Z)
      *
     A            FYKUNA        30A         TEXT('Kunde-navn')
     A                                      COLHDG('Kunde-navn')
      *
     A            FYNAVN        30A         TEXT('Navn')
     A                                      COLHDG('Navn')
      *
     A            FYADR1        30A         TEXT('Adresse 1')
     A                                      COLHDG('Adresse 1')
      *
     A            FYADR2        30A         TEXT('Adresse 2')
     A                                      COLHDG('Adresse 2')
      *
     A            FYSTED        30A         TEXT('Poststed')
     A                                      COLHDG('Poststed')
6.2K  *
6.2K A            FYAVDE         4S 0       TEXT('Avd. salg overst')
6.2K A                                      COLHDG('Avd')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYKONT         6S 0       TEXT('Konto')
6.2K A                                      COLHDG('Konto')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYSPES         4S 0       TEXT('Spes')
6.2K A                                      COLHDG('Spes')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYPROJ    R               REFFLD(FÅPROJ)
6.2K  *
6.2K A            FYAKTI    R               REFFLD(FÅAKTI)
6.2K  *
6.2K A            FYKOBK         1S 0       TEXT('Obekr. kreves')
6.2K A                                      COLHDG('Obekr.' 'kreves')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYKGFA         1S 0       TEXT('Undertr. fakt.ge')
6.2K A                                      COLHDG('Undertr' 'fakt.ge')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYKGEK         1S 0       TEXT('Undertr. eks. ge')
6.2K A                                      COLHDG('Undertr.' 'eks.ge')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYKGFR         1S 0       TEXT('Undertr. frakt.g')
6.2K A                                      COLHDG('Undertr.' 'frakt.g')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYKSOB         1S 0       TEXT('Utskr.ordrebekr.')
6.2K A                                      COLHDG('Utskr.' 'obekr.')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYKTXT         1S 0       TEXT('Tekst utskrift')
6.2K A                                      COLHDG('Tekst' 'utskr')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYKFAK         1S 0       TEXT('Faktura kjørt?')
6.2K A                                      COLHDG('Fakt' 'kjørt?')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYNETO         1S 0       TEXT('Netto u/rab')
6.2K A                                      COLHDG('Netto' 'u/rab')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYKSPR         1S 0       TEXT('Sperret f.vedl.')
6.2K A                                      COLHDG('Sperret' 'f.vedl.')
6.2K A                                      EDTCDE(Z)
      *
6.14 A            FYVREF        30A         TEXT('Vår ref.')
     A                                      COLHDG('Vår ref.')
      *
6.14 A            FYDREF        30A         TEXT('Deres ref.')
     A                                      COLHDG('Deres ref.')
      *
     A            FYREKV        20A         TEXT('Kund.rekv.nr.')
     A                                      COLHDG('Kund.rekv.nr.')
6.2K  *
6.2K A            FYLMTX        20A         TEXT('Lev. måte tekst')
6.2K A                                      COLHDG('Lev. måte tekst')
6.2K  *
6.2K A            FYLBTX        75A         TEXT('Lev. bet. tekst')
6.2K A                                      COLHDG('Lev. bet. tekst')
6.2K  *
6.2K A            FYRABP         5S 2       TEXT('Rabatt i %')
6.2K A                                      COLHDG('Rab' 'i %')
6.2K A                                      EDTCDE(M)
6.2K  *
6.2K A            FYPASL         5S 2       TEXT('Beregn påslag %')
6.2K A                                      COLHDG('Påslag %')
6.2K A                                      EDTCDE(M)
6.2K  *
6.2K A            FYPASK         1A         TEXT('Påslag/Ønsket DB')
6.2K A                                      COLHDG('Påslag' 'Ønsket DB')
6.2K A                                      VALUES('P' 'R' ' ')
6.2K A                                      CHKMSGID(FMO0110 *LIBL/QMFOFAK)
6.2K  *
6.NU A            FYPORD         8S 0       TEXT('Prisordrenummer')
6.2K A                                      COLHDG('Pris' 'ordrenr')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYPSUF    R               REFFLD(FÅSUFF)
6.2K A                                      TEXT('Suffix-prisordre')
6.2K A                                      COLHDG('Suffix' 'prisordre')
6.2K  *
6.2K A            FYKOLI        11S 3       TEXT('Kolli')
6.2K A                                      EDTCDE(M)
6.2K A                                      COLHDG('Kolli')
6.2K  *
6.2K A            FYKONR        11S 2       TEXT('Kontant-rabatt')
6.2K A                                      COLHDG('Kont' 'rab')
6.2K A                                      EDTCDE(M)
6.2K  *
6.2K A            FYTOTX        11S 2       TEXT('KR fritt salg')
6.2K A                                      COLHDG('KR fritt salg')
6.2K A                                      EDTCDE(M)
      *
     A            FYTOTS        11S 2       TEXT('Kund.rekv.nr')
     A                                      EDTCDE(M)
     A                                      COLHDG('Total salg')
      *
     A            FYTOTR        11S 2       TEXT('Total rabatt')
     A                                      COLHDG('Total rabatt')
     A                                      EDTCDE(M)
      *
     A            FYTOTK        11S 2       TEXT('Total kost')
     A                                      COLHDG('Total kost')
     A                                      EDTCDE(M)
6.2K  *
6.2K A            FYBRRA        11S 2       TEXT('Bruksr.rab.')
6.2K A                                      COLHDG('Bruksr.rab.')
6.2K A                                      EDTCDE(M)
6.2K  *
6.2K A            FYUSKR        10A         TEXT('Bruker gir Kreditt')
6.2K A                                      COLHDG('Bruker' 'Kreditt')
6.2K  *
6.2K A            FYKODE         1S 0       TEXT('Behandling pågår')
6.2K A                                      COLHDG('Behandl' 'pågår')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYUTSK         1S 0       TEXT('Kode for utskrift')
6.2K A                                      COLHDG('Kode' 'utskrift')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYPAKS         1S 0       TEXT('Pakkseddel skrevet')
6.2K A                                      COLHDG('Pakks' 'skrevet')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K  *
6.2K A            FYITYP    R               REFFLD(FÅOTYP)
6.2K A                                      TEXT('Info-type')
6.2K A                                      COLHDG('Info' 'type')
6.2K  *
6.2K A            FYKOWS        10A         TEXT('Behandl. WS')
6.2K A                                      COLHDG('Behandl. WS')
6.2K  *
6.2K A            FYKOUS        10A         TEXT('Behandl. bruker')
6.2K A                                      COLHDG('Behandl.' 'bruker')
6.2K  *
6.2K A            FYKODA          L         TEXT('Behandl. dato')
6.2K A                                      COLHDG('Behandl.' 'dato')
6.2Y A                                      DFT('0001-01-01')
6.2K  *
6.2K A            FYKOTI          T         TEXT('Behandl. kl')
6.2K A                                      COLHDG('Behandl.' 'kl')
6.2Y A                                      DFT('00.00.00')
6.2K  *
6.2K A            FYBIND         1A         TEXT('Binding til skjerm')
6.2K A                                      COLHDG('Binding' 'skjerm')
6.2K  *
6.2K A            FYTDAT          L         TEXT('Utgår dato')
6.2K A                                      COLHDG('Utgår' 'dato')
6.2Y A                                      DFT('0001-01-01')
6.2K  *
6.2K A            FYDDAT          L         TEXT('Oppfølgingsdato')
6.2K A                                      COLHDG('Oppf.' 'dato')
6.2Y A                                      DFT('0001-01-01')
6.2K  *
6.2K A            FYREST         1S 0       TEXT('Restordre')
6.2K A                                      COLHDG('Rest' 'ordre')
6.2K A                                      EDTCDE(Z)
6.2K A            FYADAT          L         TEXT('Akseptdato')
6.2K A                                      COLHDG('Aksept' 'dato')
6.2Y A                                      DFT('0001-01-01')
6.2K  *
6.2K A            FYEDIH         6S 0       TEXT('Edi-hode')
6.2K A                                      COLHDG('Edi-hode')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYKPRO    R               REFFLD(FÅKPRO)
6.2K  *
6.2K A            FYBKUN         6S 0       TEXT('Kunde/bestiller')
6.2K A                                      COLHDG('Kunde' 'bestiller')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYKKUN         6S 0       TEXT('Kunde/kjøper')
6.2K A                                      COLHDG('Kunde' 'kjøper')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYOLAG         1S 0
6.2K A                                      EDTCDE(Z)
6.2K A                                      COLHDG('Kode, oppd. lager')
6.2K A                                      TEXT('Kode, oppd. lager')
6.2K  *
6.2K A            FYNREF    R               REFFLD(FÅNREF)
6.2K A            FYFSYS    R               REFFLD(FÅFSYS)
6.2K  *
6.NU A            FYBENR         8S 0       TEXT('Bestillings-nr')
6.2K A                                      COLHDG('Best' 'nr.')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYBSUF         2S 0       TEXT('Bestillings-suffix')
6.2K A                                      COLHDG('Best' 'suffix')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYMOBI        15A         TEXT('Kundens mobilnr')
6.2K A                                      COLHDG('Kundens' 'mobil')
6.2K  *
6.2K A            FYKBNR        15A         TEXT('Kundens best.nr')
6.2K A                                      COLHDG('Kundens' 'best.nr')
6.2K  *
6.2K A            FYDEPO        11S 2       TEXT('Krav til Depositum')
6.2K A                                      COLHDG('Krav' 'Depositum')
6.2K A                                      EDTCDE(M)
6.2K  *
6.2K A            FYDEPB        11S 2       TEXT('Betalt Depositum')
6.2K A                                      COLHDG('Betalt' 'Depositum')
6.2K A                                      EDTCDE(M)
6.2K  *
6.2K A            FYDEPT        11S 2       TEXT('Trukket Depositum på fakt')
6.2K A                                      COLHDG('Trukket' 'Depositum')
6.2K A                                      EDTCDE(M)
6.2K  *
6.2K A            FYFATY         2S 0       TEXT('Fakturatype')
6.2K A                                      COLHDG('Fakt.' 'type')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYBONG        12A         TEXT('Bongnr')
6.2K A                                      COLHDG('Bongnr')
6.2K  *
6.2K A            FYPLSE         4S 0       TEXT('Plukkes av selgernr')
6.2K A                                      COLHDG('Pl. av' 'Sn')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYINF1        12A         TEXT('Informasjon-1')
6.2K A                                      COLHDG('Info-1')
6.2K  *
6.2K A            FYINF2        40A         TEXT('Informasjon-2')
6.2K A                                      COLHDG('Info-2')
6.2K  *
6.2K A            FYMERK         1S 0
6.2K A                                      EDTCDE(Z)
6.2K A                                      COLHDG('Merk til' ' sjåfør')
6.2K A                                      TEXT('Merk til sjåfør')
6.2K A            FYLAOK         1S 0       TEXT('Leveringsadresse OK')
6.2K A                                      COLHDG('Lev.adr' 'OK')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            FYSTIM          T         TEXT('Salg kl.')
6.2K A                                      COLHDG('Salg' 'kl.')
6.2Y A                                      DFT('00.00.00')
6.2K  *
6.2K A            FYUPRO    R               REFFLD(FÅUPRO)
      *
     A            FYTYPE         4A         TEXT('Type sletting')
     A                                      COLHDG('Type' 'sletting')
      *
     A            FYPRTK         1S 0       TEXT('Kode, Utskrift')
     A                                      COLHDG('Kode' 'Utskrift')
     A                                      EDTCDE(Z)
      *
     A            FYKOM1        30A         TEXT('Kommentar 1')
     A                                      COLHDG('Kommentar 1')
      *
     A            FYKOM2        30A         TEXT('Kommentar 2')
     A                                      COLHDG('Kommentar 2')
      *
     A            FYWSID        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arbeidstasjon')
      *
     A            FYUSER        10A         TEXT('Bruker-ID')
     A                                      COLHDG('Bruker-ID')
      *
     A            FYDATE          L         TEXT('Dato slettet')
     A                                      COLHDG('Dato slettet')
      *
     A            FYTIME          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
6.10 A            FYODAT    R               REFFLD(FÅODAT)
6.10 A            FYOTIM    R               REFFLD(FÅOTIM)
6.10 A            FYOUSR    R               REFFLD(FÅOUSR)
6.10 A            FYEDAT    R               REFFLD(FÅEDAT)
6.10 A            FYETIM    R               REFFLD(FÅETIM)
6.10 A            FYEUSR    R               REFFLD(FÅEUSR)
      *
      * Eksternt scanne-register            (FZ)
      *
     A            FZEANN        14A         TEXT('EAN-nummer')
     A                                      COLHDG('EAN-nr')
6.33 A            FZLVAR    R               REFFLD(FÅLVAR)
     A                                      TEXT('Lev. varenr')
     A                                      COLHDG('Lev. varenr')
     A            FZVARE         8A         TEXT('Varenr')
     A                                      COLHDG('Varenr')
     A            FZTEK1        30A         TEXT('Varetekst-1')
     A                                      COLHDG('Varetekst-1')
     A            FZENH1         3A         TEXT('Enhet-1')
     A                                      COLHDG('Enh-1')
     A            FZS1IM        11A         TEXT('Salgspris-1 inkl.mva')
     A                                      COLHDG('Salgspris-1' 'inkl.mva')
     A            FZENH2         3A         TEXT('Enhet-2')
     A                                      COLHDG('Enh-2')
     A            FZS2IM        11A         TEXT('Salgspris-2 inkl.mva')
     A                                      COLHDG('Salgspris-2' 'inkl.mva')
     A            FZENH3         3A         TEXT('Enhet-3')
     A                                      COLHDG('Enh-3')
     A            FZS3IM        11A         TEXT('Salgspris-3 inkl.mva')
     A                                      COLHDG('Salgspris-3' 'inkl.mva')
6.10 A            FZODAT    R               REFFLD(FÅODAT)
6.10 A            FZOTIM    R               REFFLD(FÅOTIM)
6.10 A            FZOUSR    R               REFFLD(FÅOUSR)
6.10 A            FZEDAT    R               REFFLD(FÅEDAT)
6.10 A            FZETIM    R               REFFLD(FÅETIM)
6.10 A            FZEUSR    R               REFFLD(FÅEUSR)
      *
      * Leverandør vareregister             (FW)
      *
     A            FWFIRM    R               REFFLD(FÅFIRM)
     A            FWLDOR    R               REFFLD(FÅLDOR)
     A            FWLINE         6S 0       TEXT('Linjenr')
     A                                      COLHDG('Ln')
     A            FWEKOD         1A         TEXT('Endringskode')
     A                                      COLHDG('Kode')
      *                                     X - Første gangs nyinnlegg.
      *                                     N - Ny vare
      *                                     E - Endret vare
      *                                     S - Slettet vare
      *                                     P - Varer plukket hos lev.
     A            FWTEK1        35A         TEXT('Varetekst-1')
     A                                      COLHDG('Varetekst-1')
     A            FWTEK2        35A         TEXT('Varetekst-2')
     A                                      COLHDG('Varetekst-2')
     A            FWLVAR    R               REFFLD(FÅLVAR)
     A            FWEANN    R               REFFLD(FÅEANN)
     A            FWNOBB    R               REFFLD(FÅNOBB)
     A            FWENHE    R               REFFLD(FÅENHE)
     A            FWINPR         9S 2       TEXT('Innkjøpspris')
     A                                      COLHDG('Innkj.pris')
     A                                      EDTCDE(M)
     A            FWSAPR         9S 2       TEXT('Salgspris')
     A                                      COLHDG('Salgspris')
     A                                      EDTCDE(M)
     A            FWDATO          L         TEXT('Endringsdato')
     A                                      COLHDG('Dato')
     A            FWVGRP        10          TEXT('Varegruppe')
     A                                      COLHDG('Varegruppe')
     A            FWOGRP    R               REFFLD(FÅOGRP)
     A            FWHGRP    R               REFFLD(FÅHGRP)
     A            FWUGRP    R               REFFLD(FÅUGRP)
     A            FWLENG    R               REFFLD(FÅLENG)
     A            FWBRED    R               REFFLD(FÅBRED)
     A            FWHOYD    R               REFFLD(FÅHOYD)
     A            FWVEKT    R               REFFLD(FÅVEKT)
     A            FWVOLU    R               REFFLD(FÅVOLU)
     A            FWANTA        12S 6       TEXT('Antall')
     A                                      COLHDG('Antall')
     A                                      EDTCDE(4)
     A            FWBMEN        11S 3       TEXT('Bestillingsmengde')
     A                                      COLHDG('Best.mengde')
     A                                      EDTCDE(4)
5.24 A            FWCRDO    R               REFFLD(FÅCRDO)
     A            FWUDAT          L         TEXT('Utgått dato')
     A                                      COLHDG('Dato' 'utgått')
     A            FWLVAE        15A         TEXT('Erstatningsnr')
     A                                      COLHDG('Erstatningsnr')
     A            FWTVAR        15A         TEXT('Tildelt varenr')
     A                                      COLHDG('Tildelt' 'varenr')
     A            FWHKOD         1S 0       TEXT('Holde-kode')
     A                                      COLHDG('Holde' 'kode')
     A                                      EDTCDE(Z)
5.33 A            FWLETY         1S 0       TEXT('Leveringstype')
5.33 A                                      COLHDG('Lev.' 'type')
5.33 A                                      EDTCDE(Z)
6.10 A            FWODAT    R               REFFLD(FÅODAT)
6.10 A            FWOTIM    R               REFFLD(FÅOTIM)
6.10 A            FWOUSR    R               REFFLD(FÅOUSR)
6.10 A            FWEDAT    R               REFFLD(FÅEDAT)
6.10 A            FWETIM    R               REFFLD(FÅETIM)
6.10 A            FWEUSR    R               REFFLD(FÅEUSR)
6.2X  *
6.2X  * ByggDok Oppsamlingsregister         (FWB)
6.2X  *
6.2X A            FWBFIR    R               REFFLD(FÅFIRM)
6.2X A            FWBKUN    R               REFFLD(FÅKUND)
6.2X A            FWBKPR    R               REFFLD(FÅKPRO)
6.2Æ A            FWBNUM        15A         TEXT('Onr/Bongnr')
6.2Æ A                                      COLHDG('Onr/Bongnr')
6.2Æ A            FWBNAV        30A         TEXT('Kundenavn')
6.2Æ A                                      COLHDG('Kundenavn')
6.2Æ A            FWBPER        30A         TEXT('Kontaktperson')
6.2Æ A                                      COLHDG('Kontaktperson')
6.2Æ A            FWBMAI        50A         TEXT('Mail-adr')
6.2Æ A                                      COLHDG('Mail-adr')
6.2Æ A            FWBFTN         9S 0       TEXT('Foretaksnr')
6.2Æ A                                      COLHDG('Foretaksnr')
6.2Æ A                                      EDTCDE(Z)
6.2X A            FWBTMS        26A         TEXT('Timestamp')
6.2X A                                      COLHDG('Timestamp')
6.2X A            FWBNOB    R               REFFLD(FÅNOBB)
6.2X A            FWBOVF    R               REFFLD(FÅJANE)
6.2X A                                      TEXT('Overført')
6.2X A                                      COLHDG('Overført')
6.38 A            FWCOVF    R               REFFLD(FÅJANE)
6.38 A                                      TEXT('Overført Cobuilder')
6.38 A                                      COLHDG('Overført Cobuilder')
6.2X A            FWBODA    R               REFFLD(FÅODAT)
6.2X A            FWBOTI    R               REFFLD(FÅOTIM)
6.2X A            FWBOUS    R               REFFLD(FÅOUSR)
6.2X A            FWBEDA    R               REFFLD(FÅEDAT)
6.2X A            FWBETI    R               REFFLD(FÅETIM)
6.2X A            FWBEUS    R               REFFLD(FÅEUSR)
5.45  *
5.45  * Fil for scanning av pakksedler      (FX)
5.45  *
5.45 A            FXFIRM    R               REFFLD(FÅFIRM)
5.45  *
5.45 A            FXNUMM    R               REFFLD(FÅNUMM)
5.45 A                                      COMP(NE 0)
5.45 A                                      CHKMSGID(FMD0600 *LIBL/QMFOFAK)
5.45  *
5.45 A            FXSUFF    R               REFFLD(FÅSUFF)
5.45  *
5.45 A            FXKODE         2A
5.45  *
5.45 A            FXODAT    R               REFFLD(FÅODAT)
6.10 A            FXOTIM    R               REFFLD(FÅOTIM)
6.10 A            FXOUSR    R               REFFLD(FÅOUSR)
5.45 A            FXEDAT    R               REFFLD(FÅEDAT)
5.45 A            FXETIM    R               REFFLD(FÅETIM)
5.45 A            FXEUSR    R               REFFLD(FÅEUSR)
      *
5.50  * Kunde bonus                         (EK)
      *
5.50 A            EKFIRM    R               REFFLD(FÅFIRM)
5.50 A            EKBKUN         6S 0       TEXT('Bonuskunde')
5.50 A                                      COLHDG('Bonus' 'kunde')
5.50 A                                      EDTCDE(Z)
5.50 A            EKRKAT    R               REFFLD(FÅRKAT)
5.50 A            EKKUND    R               REFFLD(FÅKUND)
5.50 A            EKKPRO    R               REFFLD(FÅKPRO)
5.50 A            EKOGRP    R               REFFLD(FÅOGRP)
5.50 A            EKHGRP    R               REFFLD(FÅHGRP)
5.50 A            EKUGRP    R               REFFLD(FÅUGRP)
5.50 A            EKLDOR    R               REFFLD(FÅLDOR)
5.50 A            EKMODN    R               REFFLD(FÅMODN)
5.50 A            EKVARE    R               REFFLD(FÅVARE)
5.50 A            EKENHE    R               REFFLD(FÅENHE)
5.50 A            EKLETY    R               REFFLD(FÅLETY)
5.50 A            EKBOTY    R               REFFLD(FÅBOTY)
5.50 A            EKFDAT          L         TEXT('Fra-dato')
5.50 A                                      COLHDG('Fra-dato')
5.50 A            EKTDAT          L         TEXT('Til-dato')
5.50 A                                      COLHDG('Til-dato')
5.50 A            EKMERK        50A         TEXT('Merknad')
5.50 A                                      COLHDG('Merknad')
5.50 A            EKBGRU        11S 2       TEXT('Bonusgrunnlag')
5.50 A                                      COLHDG('Bonusgrunnlag')
5.50 A                                      EDTCDE(4)
5.50 A            EKSBON         9S 0       TEXT('Sum bonus')
5.50 A                                      COLHDG('Sum bonus')
5.50 A                                      EDTCDE(4)
5.50 A            EKBDAT          L         TEXT('Beregnet dato')
5.50 A                                      COLHDG('Beregnet' 'dato')
5.50 A            EKBTIM          T         TEXT('Beregnet tidspunkt')
5.50 A                                      COLHDG('Beregnet' 'tid')
5.50 A            EKODAT    R               REFFLD(FÅODAT)
5.50 A            EKOTIM    R               REFFLD(FÅOTIM)
6.10 A            EKOUSR    R               REFFLD(FÅOUSR)
5.50 A            EKEDAT    R               REFFLD(FÅEDAT)
5.50 A            EKETIM    R               REFFLD(FÅETIM)
5.50 A            EKEUSR    R               REFFLD(FÅEUSR)
      *
5.50  * Kunde bonuselement                 (EKE)
      *
5.50 A            EKEFIR    R               REFFLD(FÅFIRM)
5.50 A            EKEBKU         6S 0       TEXT('Bonuskunde')
5.50 A                                      COLHDG('Bonus' 'kunde')
5.50 A                                      EDTCDE(Z)
5.50 A            EKERKA    R               REFFLD(FÅRKAT)
5.50 A            EKEKUN    R               REFFLD(FÅKUND)
5.50 A            EKEKPR    R               REFFLD(FÅKPRO)
5.50 A            EKEOGR    R               REFFLD(FÅOGRP)
5.50 A            EKEHGR    R               REFFLD(FÅHGRP)
5.50 A            EKEUGR    R               REFFLD(FÅUGRP)
5.50 A            EKELDO    R               REFFLD(FÅLDOR)
5.50 A            EKEMOD    R               REFFLD(FÅMODN)
5.50 A            EKEVAR    R               REFFLD(FÅVARE)
5.50 A            EKEENH    R               REFFLD(FÅENHE)
5.50 A            EKELET    R               REFFLD(FÅLETY)
5.50 A            EKEBOT    R               REFFLD(FÅBOTY)
5.50 A            EKEFDA          L         TEXT('Fra-dato')
5.50 A                                      COLHDG('Fra-dato')
5.50 A            EKETDA          L         TEXT('Til-dato')
5.50 A                                      COLHDG('Til-dato')
5.50 A            EKEBGF         9S 0       TEXT('Beløpsgrense fra')
5.50 A                                      COLHDG('Beløpsgrense' 'fra')
5.50 A                                      EDTCDE(Z)
5.50 A            EKEBGT         9S 0       TEXT('Beløpsgrense til')
5.50 A                                      COLHDG('Beløpsgrense' 'til')
5.50 A                                      EDTCDE(Z)
5.50 A            EKEBPR         5S 2       TEXT('Bonusprosent')
5.50 A                                      COLHDG('Bonus' '%')
5.50 A                                      EDTCDE(4)
5.50 A            EKEKTB         1S 0       TEXT('Kalkuler tilbake')
5.50 A                                      COLHDG('Kalk.' 'tilbake')
5.50 A                                      EDTCDE(Z)
5.50 A*                                     1=Ja, 0=Nei
5.50 A            EKEMRK        50A         TEXT('Merknad')
5.50 A                                      COLHDG('Merknad')
5.50 A            EKESBO         9S 0       TEXT('Sum bonus')
5.50 A                                      COLHDG('Sum bonus')
5.50 A                                      EDTCDE(4)
5.50 A            EKEBDA          L         TEXT('Beregnet dato')
5.50 A                                      COLHDG('Beregnet' 'dato')
5.50 A            EKEBTI          T         TEXT('Beregnet tidspunkt')
5.50 A                                      COLHDG('Beregnet' 'tid')
5.50 A            EKEODA    R               REFFLD(FÅODAT)
5.50 A            EKEOTI    R               REFFLD(FÅOTIM)
6.10 A            EKEOUS    R               REFFLD(FÅOUSR)
5.50 A            EKEEDA    R               REFFLD(FÅEDAT)
5.50 A            EKEETI    R               REFFLD(FÅETIM)
5.50 A            EKEEUS    R               REFFLD(FÅEUSR)
      *
5.50  * Leverandør bonus                    (EL)
      *
5.50 A            ELFIRM    R               REFFLD(FÅFIRM)
5.50 A            ELBLEV         6S 0       TEXT('Bonusleverandør')
5.50 A                                      COLHDG('Bonus' 'leverandør')
5.50 A                                      EDTCDE(Z)
5.50 A            ELLDOR    R               REFFLD(FÅLDOR)
5.50 A            ELOGRP    R               REFFLD(FÅOGRP)
5.50 A            ELHGRP    R               REFFLD(FÅHGRP)
5.50 A            ELUGRP    R               REFFLD(FÅUGRP)
5.50 A            ELMODN    R               REFFLD(FÅMODN)
5.50 A            ELVARE    R               REFFLD(FÅVARE)
5.50 A            ELENHE    R               REFFLD(FÅENHE)
5.50 A            ELLETY    R               REFFLD(FÅLETY)
5.50 A            ELBOTY    R               REFFLD(FÅBOTY)
5.50 A            ELFDAT          L         TEXT('Fra-dato')
5.50 A                                      COLHDG('Fra-dato')
5.50 A            ELTDAT          L         TEXT('Til-dato')
5.50 A                                      COLHDG('Til-dato')
5.50 A            ELPBGR         1S 0       TEXT('Prosjektbegrensning')
5.50 A                                      COLHDG('Prosjekt' 'begr.')
5.50 A                                      EDTCDE(Z)
5.50 A            ELMERK        50A         TEXT('Merknad')
5.50 A                                      COLHDG('Merknad')
5.50 A            ELBGRU        11S 2       TEXT('Bonusgrunnlag')
5.50 A                                      COLHDG('Bonusgrunnlag')
5.50 A                                      EDTCDE(4)
5.50 A            ELSBON         9S 0       TEXT('Sum bonus')
5.50 A                                      COLHDG('Sum bonus')
5.50 A                                      EDTCDE(4)
5.50 A            ELBDAT          L         TEXT('Beregnet dato')
5.50 A                                      COLHDG('Beregnet' 'dato')
5.50 A            ELBTIM          T         TEXT('Beregnet tidspunkt')
5.50 A                                      COLHDG('Beregnet' 'tid')
5.50 A            ELODAT    R               REFFLD(FÅODAT)
5.50 A            ELOTIM    R               REFFLD(FÅOTIM)
6.10 A            ELOUSR    R               REFFLD(FÅOUSR)
5.50 A            ELEDAT    R               REFFLD(FÅEDAT)
5.50 A            ELETIM    R               REFFLD(FÅETIM)
5.50 A            ELEUSR    R               REFFLD(FÅEUSR)
      *
5.50  * Leverandør bonuselement             (EKE)
      *
5.50 A            ELEFIR    R               REFFLD(FÅFIRM)
5.50 A            ELEBLE         6S 0       TEXT('Bonusleverandør')
5.50 A                                      COLHDG('Bonus' 'lev.')
5.50 A                                      EDTCDE(Z)
5.50 A            ELELDO    R               REFFLD(FÅLDOR)
5.50 A            ELEOGR    R               REFFLD(FÅOGRP)
5.50 A            ELEHGR    R               REFFLD(FÅHGRP)
5.50 A            ELEUGR    R               REFFLD(FÅUGRP)
5.50 A            ELEMOD    R               REFFLD(FÅMODN)
5.50 A            ELEVAR    R               REFFLD(FÅVARE)
5.50 A            ELEENH    R               REFFLD(FÅENHE)
5.50 A            ELELET    R               REFFLD(FÅLETY)
5.50 A            ELEBOT    R               REFFLD(FÅBOTY)
5.50 A            ELEFDA          L         TEXT('Fra-dato')
5.50 A                                      COLHDG('Fra-dato')
5.50 A            ELETDA          L         TEXT('Til-dato')
5.50 A                                      COLHDG('Til-dato')
5.50 A            ELEBGF         9S 0       TEXT('Beløpsgrense fra')
5.50 A                                      COLHDG('Beløpsgrense' 'fra')
5.50 A                                      EDTCDE(Z)
5.50 A            ELEBGT         9S 0       TEXT('Beløpsgrense til')
5.50 A                                      COLHDG('Beløpsgrense' 'til')
5.50 A                                      EDTCDE(Z)
5.50 A            ELEBPR         5S 2       TEXT('Bonusprosent')
5.50 A                                      COLHDG('Bonus' '%')
5.50 A                                      EDTCDE(4)
5.50 A            ELEBBE         9S 2       TEXT('Bonusbeløp')
5.50 A                                      COLHDG('Bonus' 'beløp')
5.50 A                                      EDTCDE(4)
5.50 A            ELEBEN         3A         TEXT('Bonusenhet')
5.50 A                                      COLHDG('Bonus' 'enhet')
5.50 A            ELEKTB         1S 0       TEXT('Kalkuler tilbake')
5.50 A                                      COLHDG('Kalk.' 'tilbake')
5.50 A                                      EDTCDE(Z)
5.50 A*                                     1=Ja, 0=Nei
5.50 A            ELEMRK        50A         TEXT('Merknad')
5.50 A                                      COLHDG('Merknad')
5.50 A            ELESBO         9S 0       TEXT('Sum bonus')
5.50 A                                      COLHDG('Sum bonus')
5.50 A                                      EDTCDE(4)
5.50 A            ELEBDA          L         TEXT('Beregnet dato')
5.50 A                                      COLHDG('Beregnet' 'dato')
5.50 A            ELEBTI          T         TEXT('Beregnet tidspunkt')
5.50 A                                      COLHDG('Beregnet' 'tid')
5.50 A            ELEODA    R               REFFLD(FÅODAT)
5.50 A            ELEOTI    R               REFFLD(FÅOTIM)
6.10 A            ELEOUS    R               REFFLD(FÅOUSR)
5.50 A            ELEEDA    R               REFFLD(FÅEDAT)
5.50 A            ELEETI    R               REFFLD(FÅETIM)
5.50 A            ELEEUS    R               REFFLD(FÅEUSR)
      *
      * Ordre-linje-register fra ekstern database (KD)
      *
     A            KDFIRM    R               REFFLD(FÅFIRM)
      *
     A            KDNUMM    R               REFFLD(FÅNUMM)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMD0600 *LIBL/QMFOFAK)
      *
     A            KDLINE    R               REFFLD(FÅLINE)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMD0610 *LIBL/QMFOFAK)
      *
     A            KDOTYP    R               REFFLD(FÅOTYP)
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMD0620 *LIBL/QMFOFAK)
      *
     A            KDLTYP         2A         TEXT('Linje-type')
     A                                      COLHDG('Linje-type')
      *
     A            KDLETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
      *
     A            KDVARE    R               REFFLD(FÅVARE)
     A            KDENH1    R               REFFLD(FÅENHE)
      *
     A            KDLASS         2S 0       TEXT('Kode, lass-nr')
     A                                      COLHDG('Kode' 'lass-nr')
     A                                      EDTCDE(Z)
      *
6.27 A            KDPROJ    R               REFFLD(FÅPROJ)
      *
6.27 A            KDAKTI    R               REFFLD(FÅAKTI)
      *
     A            KDTEK1    R               REFFLD(FÅTEK1)
     A            KDTEK2    R               REFFLD(FÅTEK2)
     A            KDTEK3    R               REFFLD(FÅTEK3)
     A            KDTEK4    R               REFFLD(FÅTEK4)
      *
     A            KDANTA    R               REFFLD(FÅANTA)
     A                                      COMP(LT 99999999)
     A                                      CHKMSGID(FMD0640 *LIBL/QMFOFAK)
      *
     A            KDSAPR         9S 2       TEXT('Salgspris')
     A                                      COLHDG('Salgspris')
     A                                      EDTWRD('     0 ,  ')
      *
     A            KDKOPR         9S 2       TEXT('Kost-pris')
     A                                      COLHDG('Kostpris')
     A                                      EDTWRD('     0 ,  ')
      *
     A            KDRAB1         5S 2       TEXT('Linje-rabatt 1')
     A                                      COLHDG('Linje' 'rab.1')
     A                                      EDTCDE(Z)
     A                                      COMP(LE 100)
     A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
      *
     A            KDRAB2         5S 2       TEXT('Linje-rabatt 2')
     A                                      COLHDG('Linje' 'rab.2')
     A                                      EDTCDE(Z)
     A                                      COMP(LE 100)
     A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
      *
     A            KDKNTO    R               REFFLD(FÅVALA)
     A                                      TEXT('Kode Netto priset')
     A                                      COLHDG('Kode' 'Nto')
      *
     A            KDKKLP    R               REFFLD(FÅVALA)
     A                                      TEXT('Pris fra kalkyle')
     A                                      COLHDG('Kode' 'Kalk')
      *
     A            KDKKLR    R               REFFLD(FÅVALA)
     A                                      TEXT('Rab. fra kalkyle')
     A                                      COLHDG('Kode' 'Rab.')
      *
     A            KDKTXT    R               REFFLD(FÅVALA)
     A                                      TEXT('Text fra kalkyle')
     A                                      COLHDG('Kode' 'text')
      *
     A            KDKHLP    R               REFFLD(FÅVALA)
     A                                      TEXT('Hjelpefelt')
     A                                      COLHDG('Kode' 'hjelp')
      *
      * Ordre-hode-register fra ekstern database (KO)
      *
     A            KOFIRM    R               REFFLD(FÅFIRM)
      *
     A            KONUMM    R               REFFLD(FÅNUMM)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMO0600 *LIBL/QMFOFAK)
      *
     A            KOLINE    R               REFFLD(FÅLINE)
      *
     A            KOOTYP    R               REFFLD(FÅOTYP)
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(FMO0610 *LIBL/QMFOFAK)
      *
     A            KOLETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
      *
     A            KOBDAT          L         TEXT('Ordredato')
     A                                      COLHDG('Ordre' 'dato')
      *
     A            KOLDAT    R               REFFLD(FÅLDAT)
      *
     A            KOSELG    R               REFFLD(FÅSELG)
      *
     A            KOLMAT         2S 0       TEXT('Leveringsmåte')
     A                                      COLHDG('Lev' 'måte')
     A                                      EDTCDE(Z)
      *
     A            KORKAT         3S 0       TEXT('Rabatt-kategori')
     A                                      COLHDG('Rab' 'kat')
     A                                      EDTCDE(Z)
      *
     A            KOKUND    R               REFFLD(FÅKUND)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(FMO0630 *LIBL/QMFOFAK)
      *
     A            KOKPRO         6S 0       TEXT('Kundeprosjekt')
     A                                      COLHDG('Kunde' 'prosj')
     A                                      EDTCDE(Z)
      *
     A            KONAVN        30A         TEXT('Navn')
     A                                      COLHDG('Navn')
      *
     A            KOADR1        30A         TEXT('Adresse 1')
     A                                      COLHDG('Adresse 1')
      *
     A            KOADR2        30A         TEXT('Adresse 2')
     A                                      COLHDG('Adresse 2')
      *
     A            KOSTED        30A         TEXT('Poststed')
     A                                      COLHDG('Poststed')
      *
6.27 A            KOPROJ    R               REFFLD(FÅPROJ)
      *
6.27 A            KOAKTI    R               REFFLD(FÅAKTI)
      *
     A            KOVREF        20A         TEXT('Vår ref.')
     A                                      COLHDG('Vår ref.')
      *
     A            KODREF        20A         TEXT('Deres ref.')
     A                                      COLHDG('Deres ref.')
      *
     A            KOREKV        20A         TEXT('Kund.rekv.nr.')
     A                                      COLHDG('Kund.rekv.nr.')
      *
     A            KOKNTR        11S 2       TEXT('Kontroll sum')
     A                                      COLHDG('Kontroll sum')
     A                                      EDTCDE(M)
      *
     A            KODATE          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            KOTIME          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
      *
      * Parameter-fil ved ekstern database (KP)
      *
     A            KPFIRM    R               REFFLD(FÅFIRM)
      *
     A            KPKUND    R               REFFLD(FÅKUND)
      *
     A            KPKPRO    R               REFFLD(FÅKPRO)
     A                                      TEXT('Kundeprosjekt')
     A                                      COLHDG('Kunde' 'prosj')
      *
     A            KPOTYP    R               REFFLD(FÅOTYP)
     A                                      TEXT('Ordretype')
     A                                      COLHDG('OT')
      *
     A            KPKORR    R               REFFLD(FÅJANE)
     A                                      TEXT('Korreksjonsprogr.')
     A                                      COLHDG('Korr' 'Prog')
      *
     A            KPOFAK    R               REFFLD(FÅJANE)
     A                                      TEXT('Pris fra ASOFAK')
     A                                      COLHDG('Pris' 'Ofak')
      *
     A            KPODAT    R               REFFLD(FÅJANE)
     A                                      TEXT('O.dato fra kalkyle')
     A                                      COLHDG('Dato' 'Kalkyle')
      *
     A            KPPRIS         9S 2       TEXT('Kontroll Pris')
     A                                      COLHDG('Kontroll' 'Pris')
      *
      * Arbeids-fil ved ekstern database (KW)
      *
     A            KWIRAD      1600A         TEXT('Ordrerader')
     A                                      COLHDG('Ordrerader')
      *
      * ------------------------------------
      *
      * Ekstern ordre linje                 (ND)
      *
     A            NDFIRM    R               REFFLD(FÅFIRM)
5.22 A            NDFSYS    R               REFFLD(FÅFSYS)
5.22 A            NDTELL         6S 0       TEXT('Teller')
5.22 A                                      COLHDG('Teller')
5.22 A                                      EDTCDE(Z)
     A            NDLINE    R               REFFLD(FÅLINE)
     A            NDNREF    R               REFFLD(FÅNREF)
     A            NDVARE    R               REFFLD(FÅVARE)
     A            NDTEK1    R               REFFLD(FÅTEK1)
     A            NDTEK2    R               REFFLD(FÅTEK2)
     A            NDANTA    R               REFFLD(FÅANTA)
     A            NDENHE    R               REFFLD(FÅENHE)
     A            NDNTPR         9S 2       TEXT('Netto salgspris')
     A                                      COLHDG('Netto' 'salgspris')
     A                                      EDTCDE(M)
     A            NDLETY    R               REFFLD(FÅLETY)
     A            NDLDAT    R               REFFLD(FÅLDAT)
     A            NDMELD        70A         TEXT('Melding')
     A                                      COLHDG('Melding')
7.13 A            NDLASS         2S 0       TEXT('Lassnummer')
7.13 A                                      COLHDG('Lassnummer')
7.13 A            NDLVNR        20A         TEXT('Lev.vnr')
7.13 A                                      COLHDG('Lev.vnr')
7.13 A            NDKPRI         9S 2       TEXT('Kostpris')
7.13 A                                      COLHDG('Kostpris')
7.13 A            NDRAB1         5S 2       TEXT('Rabatt1')
7.13 A                                      COLHDG('Rabatt1')
7.13 A            NDRAB2         5S 2       TEXT('Rabatt2')
7.13 A                                      COLHDG('Rabatt2')
7.13 A            NDKAMP         5A         TEXT('Kampanjekode')
7.13 A                                      COLHDG('Kampanjekode')
     A            NDODAT    R               REFFLD(FÅODAT)
6.10 A            NDOTIM    R               REFFLD(FÅOTIM)
6.10 A            NDOUSR    R               REFFLD(FÅOUSR)
     A            NDEDAT    R               REFFLD(FÅEDAT)
     A            NDETIM    R               REFFLD(FÅETIM)
     A            NDEUSR    R               REFFLD(FÅEUSR)
5.22  *
5.22  * Ekstern ordre kode                  (NK)
5.22  *
5.22 A            NKFIRM    R               REFFLD(FÅFIRM)
5.22 A            NKKODE         3A         TEXT('Ekstern kode')
5.22 A                                      COLHDG('Ekst.' 'kode')
5.22 A            NKBESK    R               REFFLD(FÅBESK_30)
5.22 A            NKPGMC        10A         TEXT('Call program')
5.22 A                                      COLHDG('Call' 'prog.')
5.22 A            NKTELN         6A         TEXT('Teller navn')
5.22 A                                      COLHDG('Tell.' 'navn')
     A            NKMANU         1S 0       TEXT('Manuell innlesing')
     A                                      COLHDG('Manuell' 'innl.')
     A                                      EDTCDE(Z)
      *                                     0=Nei
      *                                     1=Ja
     A            NKFORM         1S 0       TEXT('Format')
     A                                      COLHDG('Format')
     A                                      EDTCDE(Z)
      *                                     0=ASCII
      *                                     1=ANSII
     A            NKZIPP         1S 0       TEXT('Zip')
     A                                      COLHDG('Zip')
     A                                      EDTCDE(Z)
      *                                     0=Nei
      *                                     1=Ja
     A            NKFTPN        10A         TEXT('FTP-navn')
     A                                      COLHDG('FTP-navn')
     A            NKMAPP        50A         TEXT('Mappe')
     A                                      COLHDG('Mappe')
     A            NKLINK        50A         TEXT('WEB-adresse')
     A                                      COLHDG('WEB-adresse')
     A            NKFILE        50A         TEXT('Fil')
     A                                      COLHDG('Fil')
     A            NKKPRS        35A         TEXT('Kontaktperson')
     A                                      COLHDG('Kontaktperson')
     A            NKTLFN        15A         TEXT('Telefon')
     A                                      COLHDG('Tlf.')
     A            NKMOBI        15A         TEXT('Mobiltelefon')
     A                                      COLHDG('Mobil')
     A            NKMAIL        50A         TEXT('E-mail adresse')
     A                                      COLHDG('E-mail')
5.22 A            NKODAT    R               REFFLD(FÅODAT)
5.22 A            NKOTIM    R               REFFLD(FÅOTIM)
6.10 A            NKOUSR    R               REFFLD(FÅOUSR)
5.22 A            NKEDAT    R               REFFLD(FÅEDAT)
5.22 A            NKETIM    R               REFFLD(FÅETIM)
5.22 A            NKEUSR    R               REFFLD(FÅEUSR)
      *
      * Ekstern ordre hode                  (NO)
      *
     A            NOFIRM    R               REFFLD(FÅFIRM)
5.22 A            NOFSYS    R               REFFLD(FÅFSYS)
5.22  *
5.22 A            NOTELL         6S 0       TEXT('Teller')
5.22 A                                      COLHDG('Teller')
5.22 A                                      EDTCDE(Z)
      *
     A            NONREF    R               REFFLD(FÅNREF)
      *
5.22 A            NOFRSP         1S 0       TEXT('Forespørsel')
5.22 A                                      COLHDG('Fore' 'spørsel')
5.22 A                                      EDTCDE(Z)
      *
     A            NOLAGE    R               REFFLD(FÅLAGE)
     A            NOAVDE         4S 0       TEXT('AVDELING')
     A                                      COLHDG('AVD.')
     A                                      EDTCDE(Z)
     A            NOUSER    R               REFFLD(FÅUSER)
     A            NOKUND    R               REFFLD(FÅKUND)
      *
     A            NOKNAV        35          TEXT('Kundenavn')
     A                                      COLHDG('Kundenavn')
      *
     A            NOKPRO    R               REFFLD(FÅKPRO)
      *
     A            NOPNAV        35          TEXT('Kundeprosjektnavn')
     A                                      COLHDG('Kundeprosjektnavn')
      *
     A            NONAVN        30A         TEXT('Navn')
     A                                      COLHDG('Navn')
      *
     A            NOADR1        30A         TEXT('Adresse 1')
     A                                      COLHDG('Adresse 1')
      *
     A            NOADR2        30A         TEXT('Adresse 2')
     A                                      COLHDG('Adresse 2')
      *
     A            NOPONR        15A         TEXT('Postnr')
     A                                      COLHDG('Postnr')
      *
     A            NOSTED        30A         TEXT('Poststed')
     A                                      COLHDG('Poststed')
      *
     A            NOLETY    R               REFFLD(FÅLETY)
     A            NOLDAT    R               REFFLD(FÅLDAT)
      *
     A            NODREF        20A         TEXT('Deres ref.')
     A                                      COLHDG('Deres ref.')
      *
     A            NOREKV        20A         TEXT('Kund.rekv.nr.')
     A                                      COLHDG('Kund.rekv.nr.')
      *
     A            NOUNAV        30A         TEXT('Brukernavn')
     A                                      COLHDG('Brukernavn')
      *
     A            NOUTLF        15A         TEXT('Bruker telefon')
     A                                      COLHDG('Bruker' 'telefon')
      *
     A            NOUMOB        15A         TEXT('Bruker mobil')
     A                                      COLHDG('Bruker' 'mobil')
      *
     A            NOUFAX        15A         TEXT('Bruker fax')
     A                                      COLHDG('Bruker' 'fax')
      *
     A            NOUMAI        50A         TEXT('Bruker email')
     A                                      COLHDG('Bruker' 'email')
      *
     A            NOMELD       256A         TEXT('Melding')
     A                                      COLHDG('Melding')
      *
     A            NONUMM    R               REFFLD(FÅNUMM)
      *
     A            NOLMAT         2S 0       TEXT('Leveringsmåte')
     A                                      COLHDG('Lev' 'måte')
     A                                      EDTCDE(Z)
      *
     A            NOBDAT          L         TEXT('Ordredato')
     A                                      COLHDG('Ordre' 'dato')
7.13 A            NOLASS         2S 0       TEXT('Lassnummer')
7.13 A                                      COLHDG('Lassnummer')
7.13  *
7.13 A            NOFRI1        30A         TEXT('Friref1')
7.13 A                                      COLHDG('Friref1')
7.13 A            NOFRI2        30A         TEXT('Friref2')
7.13 A                                      COLHDG('Friref2')
7.13 A            NOFRI3        30A         TEXT('Friref3')
7.13 A                                      COLHDG('Friref3')
      *
     A            NOODAT    R               REFFLD(FÅODAT)
     A            NOOTIM    R               REFFLD(FÅOTIM)
6.10 A            NOOUSR    R               REFFLD(FÅOUSR)
     A            NOEDAT    R               REFFLD(FÅEDAT)
     A            NOETIM    R               REFFLD(FÅETIM)
     A            NOEUSR    R               REFFLD(FÅEUSR)
      *
      * Faktura-linje-register              (SD)
      *
     A            SDFIRM    R               REFFLD(FÅFIRM)
      *
     A            SDAARR         4S 0       TEXT('År')
     A                                      COLHDG('År')
     A                                      EDTCDE(Z)
      *
6.NU A            SDBINR         8S 0       TEXT('Fakturanummer')
     A                                      COLHDG('Fakt' 'nr')
     A                                      EDTCDE(Z)
      *
     A            SDNUMM    R               REFFLD(FÅNUMM)
      *
     A            SDSUFF    R               REFFLD(FÅSUFF)
      *
     A            SDKTXT         1S 0       TEXT('Tekstkode')
     A                                      COLHDG('TK')
     A                                      EDTCDE(Z)
      *
     A            SDLINE    R               REFFLD(FÅLINE)
      *
     A            SDEXTR         1S 0       TEXT('Generert ekstralinje')
     A                                      COLHDG('Gen' 'ex.lin')
     A                                      EDTCDE(Z)
      *
     A            SDKVIS         1S 0       TEXT('Vise alle opplysn')
     A                                      COLHDG('Vis')
     A                                      EDTCDE(Z)
      *
     A            SDOTYP    R               REFFLD(FÅOTYP)
      *
     A            SDLTYP         2A         TEXT('Linje-type')
     A                                      COLHDG('Linje' 'type')
      *
     A            SDLETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
      *
     A            SDVARE    R               REFFLD(FÅVARE)
6.22 A            SDEANN    R               REFFLD(FÅEANN)
     A            SDENH1    R               REFFLD(FÅENHE)
     A            SDLAGE    R               REFFLD(FÅLAGE)
      *
     A            SDAVDE         4S 0       TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A                                      EDTCDE(Z)
      *
     A            SDKONT         6S 0       TEXT('Kontonummer')
     A                                      COLHDG('Konto')
     A                                      EDTCDE(Z)
      *
4.01 A            SDSPES         4S 0       TEXT('Spesifikasjon')
     A                                      COLHDG('Spes')
     A                                      EDTCDE(Z)
      *
6.27 A            SDPROJ    R               REFFLD(FÅPROJ)
      *
6.27 A            SDAKTI    R               REFFLD(FÅAKTI)
      *
5.31 A            SDALME    R               REFFLD(FÅALME)
5.31 A            SDBRTY    R               REFFLD(FÅBRTY)
5.31 A            SDPRIV    R               REFFLD(FÅPRIV)
5.31  *
     A            SDTEK1    R               REFFLD(FÅTEK1)
     A            SDTEK2    R               REFFLD(FÅTEK2)
     A            SDTEK3    R               REFFLD(FÅTEK3)
      *
     A            SDANTA        11S 3       TEXT('Antall bestilt')
     A                                      COLHDG('Ant.' 'best.')
     A                                      EDTCDE(M)
      *
     A            SDOPPR         9S 2       TEXT('Opprinnelig pris')
     A                                      COLHDG('Oppr.' 'pris')
     A                                      EDTCDE(Z)
      *
     A            SDSAPR         9S 2       TEXT('Salgspris')
     A                                      COLHDG('Salgs' 'pris')
     A                                      EDTCDE(Z)
      *
     A            SDKOPR         9S 2       TEXT('Kost-pris')
     A                                      COLHDG('Kost' 'pris')
     A                                      EDTCDE(Z)
      *
     A            SDRAB1         5S 2       TEXT('Linje-rabatt 1')
     A                                      COLHDG('Lin' 'rab.1')
     A                                      EDTCDE(Z)
      *
     A            SDRAB2         5S 2       TEXT('Linje-rabatt 2')
     A                                      COLHDG('Lin' 'rab.2')
     A                                      EDTCDE(Z)
      *
5.31 A            SDBRR1         5S 2       TEXT('Bruksrettrabatt 1')
5.31 A                                      COLHDG('Bruksrett' 'rab.1')
5.31 A                                      EDTCDE(Z)
5.31 A                                      COMP(LE 100)
5.31 A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
5.31  *
5.31 A            SDBRR2         5S 2       TEXT('Bruksrettrabatt 2')
5.31 A                                      COLHDG('Bruksrett' 'rab.2')
5.31 A                                      EDTCDE(Z)
5.31 A                                      COMP(LE 100)
5.31 A                                      CHKMSGID(FMD0650 *LIBL/QMFOFAK)
5.31  *
     A            SDPASL         5S 2       TEXT('Påslag')
     A                                      COLHDG('Påslag')
     A                                      EDTCDE(Z)
6.13  *
6.13 A            SDPSLM    R               REFFLD(FÅPSLM)
6.13  *
6.13 A            SDPSKM        11S 2       TEXT('Påslag Kr. Mgr')
6.13 A                                      COLHDG('Påslag' 'Kr.')
6.13 A                                      EDTCDE(M)
      *
     A            SDSALG        11S 2       TEXT('Salg')
     A                                      COLHDG('Salg')
     A                                      EDTCDE(M)
      *
     A            SDRKR1        11S 2       TEXT('Rabatt 1')
     A                                      COLHDG('Rabatt 1')
     A                                      EDTCDE(M)
      *
     A            SDRKR2        11S 2       TEXT('Rabatt 2')
     A                                      COLHDG('Rabatt 2')
     A                                      EDTCDE(M)
5.31  *
5.31 A            SDBRK1        11S 2       TEXT('Bruksrett Rab 1')
5.31 A                                      COLHDG('Bruksrett' 'Rab 1')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SDBRK2        11S 2       TEXT('Bruksrett Rab 2')
5.31 A                                      COLHDG('Bruksrett' 'Rab 2')
5.31 A                                      EDTCDE(M)
      *
     A            SDRKRO        11S 2       TEXT('Ordrerab.')
     A                                      COLHDG('Ordrerab.')
     A                                      EDTCDE(M)
      *
     A            SDKOST        11S 2       TEXT('Kostpris')
     A                                      COLHDG('Kostpris')
     A                                      EDTCDE(M)
      *
5.35 A            SDBBON        11S 2       TEXT('Beregn. bonus')
5.35 A                                      COLHDG('Beregn bonus')
5.35 A                                      EDTCDE(M)
      *
7.f2 A            SDFOSA        11S 2       TEXT('Fordelt red.salg')
7.f2 A                                      COLHDG('Ford.red.salg')
7.f2 A                                      EDTCDE(M)
      *
     A            SDKPRI         1A         TEXT('Kode, nettopris')
     A                                      COLHDG('Kode' 'nettopris')
      *
     A            SDKMVA         1S 0       TEXT('Mva-kode')
     A                                      COLHDG('Mva' 'kode')
     A                                      EDTCDE(Z)
      *
5.31 A            SDOMVA         1A         TEXT('Økonomi MVA-kode')
5.31 A                                      COLHDG('OKON' 'MVA')
5.31  *
6.21 A            SDMPRO      0004S 2
6.21 A                                      EDTCDE(K)
6.21 A                                      COLHDG('Merverdiavgift')
6.21  *
     A            SDKORD         1S 0       TEXT('Kode ordrerab.')
     A                                      COLHDG('Kode' 'ordrerab.')
     A                                      EDTCDE(Z)
      *
     A            SDLVRE         1S 0       TEXT('Lokalt vreg')
     A                                      COLHDG('Lok' 'vreg')
     A                                      EDTCDE(Z)
      *
     A            SDOGRP    R               REFFLD(FÅOGRP)
     A            SDHGRP    R               REFFLD(FÅHGRP)
     A            SDUGRP    R               REFFLD(FÅUGRP)
6.2R  *
6.2R A            SDLDAT          L         TEXT('Leveringsdato')
6.2R A                                      COLHDG('Lev.dato')
6.2Y A                                      DFT('0001-01-01')
      *
5.37 A            SDGAVE        12A         TEXT('Gavekortnr')
5.37 A                                      COLHDG('Gavekortnr')
      *
8.02 A            SDEDIH         8S 0       TEXT('Edi-hode')
     A                                      COLHDG('Edi' 'hode')
     A                                      EDTCDE(Z)
      *
     A            SDEDIL         6S 0       TEXT('Edi-linje')
     A                                      COLHDG('Edi' 'linje')
     A                                      EDTCDE(Z)
5.05  *
6.NU A            SDBENR         8S 0       TEXT('Bestillings-nr')
5.05 A                                      COLHDG('Best' 'nr.')
5.05 A                                      EDTCDE(Z)
5.05  *
5.05 A            SDBSUF         2S 0       TEXT('Bestillings-suff')
5.05 A                                      COLHDG('Best' 'suff.')
5.05 A                                      EDTCDE(Z)
5.23  *
5.23 A            SDBLIN         4S 0       TEXT('Bestillings-linje')
5.23 A                                      COLHDG('Best' 'linje')
5.23 A                                      EDTCDE(Z)
5.23  *
5.23 A            SDKBNR        15A         TEXT('Kundens best.nr')
5.23 A                                      COLHDG('Kundens' 'best.nr')
5.23  *
5.23 A            SDKBLI         6S 0       TEXT('Kundens best.linje')
5.23 A                                      COLHDG('Kundens' 'best.linje')
5.23  *
5.23 A            SDKHEV    R               REFFLD(FÅKHEV)
5.70  *
5.70 A            SDPRGR    R               REFFLD(FÅPRGR)
5.70  *
5.70 A            SDOPRG         1S 0       TEXT('Kode, Overst. prisgr')
5.70 A                                      COLHDG('Kode, Overst.prgr')
5.70 A                                      EDTCDE(Z)
6.24  *
6.24 A            SDPRTX         1A         TEXT('Print')
6.24 A                                      COLHDG('Print')
5.09  *
5.09 A            SDWSID        10A         TEXT('Arbeidstasjon')
5.09 A                                      COLHDG('Arbeidstasjon')
5.09  *
5.09 A            SDUSER        10A         TEXT('Bruker-ID')
5.09 A                                      COLHDG('Bruker-ID')
5.09  *
5.09 A            SDDATE          L         TEXT('Dato slettet')
5.09 A                                      COLHDG('Dato slettet')
5.09  *
5.09 A            SDTIME          T         TEXT('Klokkeslett')
5.09 A                                      COLHDG('Klokken')
6.10 A            SDODAT    R               REFFLD(FÅODAT)
6.10 A            SDOTIM    R               REFFLD(FÅOTIM)
6.10 A            SDOUSR    R               REFFLD(FÅOUSR)
6.10 A            SDEDAT    R               REFFLD(FÅEDAT)
6.10 A            SDETIM    R               REFFLD(FÅETIM)
6.10 A            SDEUSR    R               REFFLD(FÅEUSR)
5.66  *
5.66  * Ordre-depositum-register            (SK)
5.66  *
      *
5.66 A            SKFIRM    R               REFFLD(FÅFIRM)
      *
5.66 A            SKNUMM    R               REFFLD(FÅNUMM)
      *
5.66 A            SKKUND    R               REFFLD(FÅKUND)
5.66 A                                      COMP(NE 0)
5.66 A                                      CHKMSGID(FMD0630 *LIBL/QMFOFAK)
      *
7.f2 A            SKTELL    R               REFFLD(FÅSUFF)
7.f2 A                                      COLHDG('Teller')
7.f2 A                                      TEXT('Teller 00=gjeldende')
      *
5.66 A            SKDEPO        11S 2       TEXT('Krav til Depositum')
5.66 A                                      COLHDG('Krav' 'Depositum')
5.66 A                                      EDTCDE(M)
      *
5.66 A            SKDEPB        11S 2       TEXT('Betalt Depositum')
5.66 A                                      COLHDG('Betalt' 'Depositum')
5.66 A                                      EDTCDE(M)
      *
5.66 A            SKDEPT        11S 2       TEXT('Trukket Depositum på fakt')
5.66 A                                      COLHDG('Trukket' 'Depositum')
5.66 A                                      EDTCDE(M)
      *
7.f2 A            SK100P    R               REFFLD(FÅJANE)
7.f2 A                                      TEXT('100% forhåndsbetaling')
7.f2 A                                      COLHDG('100%' 'Forhåndsbet')
      *
7.f2 A            SKDEPP         7S 4
7.f2 A                                      TEXT('Depositum %')
7.f2 A                                      COLHDG('Depositum''prosent')
7.f2 A                                      EDTCDE(M)
      *
7.f2 A            SKTOTU        11S 2
7.f2 A                                      TEXT('Ordretotal u/mva')
7.f2 A                                      COLHDG('Ord.tot u/mva')
7.f2 A                                      EDTCDE(M)
      *
7.f2 A            SKFOSA        11S 2       TEXT('Fordelt red.salg')
7.f2 A                                      COLHDG('Ford.red.salg')
7.f2 A                                      EDTCDE(M)
      *
7.f2 A            SKFOSI        11S 2       TEXT('F.red.salgImva')
7.f2 A                                      COLHDG('F.red.salgImva')
7.f2 A                                      EDTCDE(M)
      *
7.f2 A            SKENDM    R               REFFLD(FÅJANE)
7.f2 A                                      TEXT('Endret manuelt')
7.f2 A                                      COLHDG('Endret manuelt')
      *
7.f2 A            SKITYP         1A
7.f2 A                                      TEXT('Innbet.type')
7.f2 A                                      COLHDG('Innbet.type')
7.f2  * M = manuelt
7.f2  * X = xxxxxxx
      *
7.f2 A            SKKREV    R               REFFLD(FÅJANE)
7.f2 A                                      TEXT('Krev innbet.f.b')
7.f2 A                                      COLHDG('Krev innbet.')
      *
7.f2 A            SKIUPD    R               REFFLD(FÅJANE)
7.f2 A                                      TEXT('Ikke oppd.v/innb')
7.f2 A                                      COLHDG('Ik.oppd.v/inb')
      *
7.f2 A            SKKIDR    R               REFFLD(FFKIDR)
7.f2 A                                      TEXT('Kidd referansenr')
7.f2 A                                      COLHDG('Kidd' 'Ref')
7.f2 A                                      EDTCDE(Z)
7.f2 A            SKKSIF    R               REFFLD(FFKSIF)
7.f2 A                                      COLHDG('Kont' 'Siff')
7.f2 A                                      EDTCDE(Z)
7.f2 A            SKKIDI    R               REFFLD(FFKIDI)
7.f2 A                                      COLHDG('Kundeident')
      *
5.66 A            SKWSID        10A         TEXT('Arbeidstasjon')
5.66 A                                      COLHDG('Arbeidstasjon')
      *
5.66 A            SKUSER        10A         TEXT('Bruker-ID')
5.66 A                                      COLHDG('Bruker-ID')
      *
5.66 A            SKDATE          L         TEXT('Dato slettet')
5.66 A                                      COLHDG('Dato slettet')
      *
5.66 A            SKTIME          T         TEXT('Klokkeslett')
5.66 A                                      COLHDG('Klokken')
6.10 A            SKODAT    R               REFFLD(FÅODAT)
6.10 A            SKOTIM    R               REFFLD(FÅOTIM)
6.10 A            SKOUSR    R               REFFLD(FÅOUSR)
6.10 A            SKEDAT    R               REFFLD(FÅEDAT)
6.10 A            SKETIM    R               REFFLD(FÅETIM)
6.10 A            SKEUSR    R               REFFLD(FÅEUSR)
      *
      * Faktura-hode-register               (SO)
      *
     A            SOFIRM    R               REFFLD(FÅFIRM)
      *
     A            SOAARR         4S 0       TEXT('År')
     A                                      COLHDG('År')
     A                                      EDTCDE(Z)
      *
6.NU A            SOBINR         8S 0       TEXT('Fakturanummer')
     A                                      COLHDG('Fakt' 'nr')
     A                                      EDTCDE(Z)
      *
     A            SONUMM    R               REFFLD(FÅNUMM)
      *
     A            SOSUFF    R               REFFLD(FÅSUFF)
      *
     A            SOOTYP    R               REFFLD(FÅOTYP)
      *
     A            SOLETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
      *
     A            SOLAGE    R               REFFLD(FÅLAGE)
      *
6.NU A            SOKREF         8S 0       TEXT('Kreditt-ref.')
     A                                      COLHDG('Kred.' 'ref.')
     A                                      EDTCDE(Z)
      *
     A            SOBDAT          L         TEXT('Ordredato')
     A                                      COLHDG('Ordredato')
      *
     A            SOLDAT    R               REFFLD(FÅLDAT)
      *
     A            SOPDAT          L         TEXT('Planlagt lev.')
     A                                      COLHDG('Planl.' 'lev.')
6.2R  *
6.2R A            SOPADA          L         TEXT('Pakkseddel dato')
6.2R A                                      COLHDG('Pakks.dato')
6.2Y A                                      DFT('0001-01-01')
      *
     A            SOFKDA          L         TEXT('Fakturadato')
     A                                      COLHDG('Fakt.' 'dato')
      *
     A            SOFFDA          L         TEXT('Forfallsdato')
     A                                      COLHDG('Forf.' 'dato')
      *
     A            SOBETB         2S 0       TEXT('Bet.betingelser')
     A                                      COLHDG('Bet.' 'bet.')
     A                                      EDTCDE(Z)
      *
     A            SOSELG    R               REFFLD(FÅSELG)
      *
5.42 A            SODIST         4S 0       TEXT('Distrikt')
     A                                      COLHDG('Distr')
     A                                      EDTCDE(Z)
      *
     A            SOLMAT         2S 0       TEXT('Leveringsmåte')
     A                                      COLHDG('Lev.' 'måte')
     A                                      EDTCDE(Z)
      *
     A            SOLBET         2S 0       TEXT('Leveringsbet.')
     A                                      COLHDG('Lev.' 'bet.')
     A                                      EDTCDE(Z)
      *
     A            SOVALK         3A         TEXT('Valuta')
     A                                      COLHDG('Valuta')
      *
     A            SORKAT         3S 0       TEXT('Rabatt-kategori')
     A                                      COLHDG('Rab.' 'kat.')
     A                                      EDTCDE(Z)
      *
     A            SOSPED         3S 0       TEXT('Speditør')
     A                                      COLHDG('Sped.')
     A                                      EDTCDE(Z)
      *
     A            SOKJOR         2S 0       TEXT('Kjørerute')
     A                                      COLHDG('Kjøre' 'rute')
     A                                      EDTCDE(Z)
      *
     A            SOMKOD         1S 0       TEXT('Mva-kode')
     A                                      COLHDG('Mva' 'kode')
     A                                      EDTCDE(Z)
      *
     A            SOLKUN         6S 0       TEXT('Vare-adresse')
     A                                      COLHDG('Vare' 'adresse')
     A                                      EDTCDE(Z)
      *
     A            SOKUND         6S 0       TEXT('Kundenummer')
     A                                      COLHDG('Kunde')
     A                                      EDTCDE(Z)
      *
     A            SOKUNA        30A         TEXT('Kunde-alfa')
     A                                      COLHDG('Kunde-alfa')
      *
     A            SONAVN        30A         TEXT('Navn')
     A                                      COLHDG('Navn')
      *
     A            SOADR1        30A         TEXT('Adresse 1')
     A                                      COLHDG('Adresse 1')
      *
     A            SOADR2        30A         TEXT('Adresse 2')
     A                                      COLHDG('Adresse 2')
      *
     A            SOSTED        30A         TEXT('Poststed')
     A                                      COLHDG('Poststed')
      *
     A            SOAVDE         4S 0       TEXT('Avd. salg overst')
     A                                      COLHDG('Avd.')
     A                                      EDTCDE(Z)
      *
     A            SOKONT         6S 0       TEXT('Konto')
     A                                      COLHDG('Konto')
     A                                      EDTCDE(Z)
      *
4.01 A            SOSPES         4S 0       TEXT('Spes')
     A                                      COLHDG('Spes')
     A                                      EDTCDE(Z)
      *
6.27 A            SOPROJ    R               REFFLD(FÅPROJ)
6.27 A            SOUPRO    R               REFFLD(FÅUPRO)
      *
6.27 A            SOAKTI    R               REFFLD(FÅAKTI)
      *
6.14 A            SOVREF        30A         TEXT('Vår ref.')
     A                                      COLHDG('Vår ref.')
      *
6.14 A            SODREF        30A         TEXT('Deres ref.')
     A                                      COLHDG('Deres ref.')
6.36  *
6.36 A            SOKPNR      0006S 0       TEXT('Kontaktpersonnr.')
6.36 A                                      COLHDG('Kontaktp.nr.')
6.36 A                                      EDTCDE(Z)
      *
     A            SOREKV        20A         TEXT('Kund.rekv.nr.')
     A                                      COLHDG('Kund.rekv.nr.')
      *
     A            SOLMTX        20A         TEXT('Lev. måte tekst')
     A                                      COLHDG('Lev. måte tekst')
      *
     A            SOLBTX        75A         TEXT('Lev. bet. tekst')
     A                                      COLHDG('Lev. bet. tekst')
      *
     A            SORABP         5S 2       TEXT('Rabatt i %')
     A                                      COLHDG('Rab. i %')
     A                                      EDTCDE(M)
      *
     A            SOPASL         5S 2       TEXT('Beregn påslag %')
     A                                      COLHDG('% påslag')
     A                                      EDTCDE(M)
      *
     A            SOPASK         1A         TEXT('Påslag/Ønsket DB')
     A                                      COLHDG('Påslag' 'Ønsket DB')
      *
     A            SOKOLI        11S 3       TEXT('Kolli')
     A                                      COLHDG('Kolli')
     A                                      EDTCDE(M)
      *
     A            SOSALP        11S 2       TEXT('Salg plikt')
     A                                      COLHDG('Salg plikt')
     A                                      EDTCDE(M)
3.34  *
3.34 A            SOSALH        11S 2       TEXT('Salg 1/2 mva')
3.34 A                                      COLHDG('Salg 1/2 mva')
3.34 A                                      EDTCDE(M)
      *
     A            SOSALF        11S 2       TEXT('Salg fritt')
     A                                      COLHDG('Salg fritt')
     A                                      EDTCDE(M)
      *
     A            SORK1P        11S 2       TEXT('Rab.1 plikt')
     A                                      COLHDG('Rab.1 plikt')
     A                                      EDTCDE(M)
3.34  *
3.34 A            SORK1H        11S 2       TEXT('Rab.1 1/2 mva')
3.34 A                                      COLHDG('Rab.1 1/2 mva')
3.34 A                                      EDTCDE(M)
      *
     A            SORK1F        11S 2       TEXT('Rab.1 fritt')
     A                                      COLHDG('Rab.1 fritt')
     A                                      EDTCDE(M)
      *
     A            SORK2P        11S 2       TEXT('Rab.2 plikt')
     A                                      COLHDG('Rab.2 plikt')
     A                                      EDTCDE(M)
3.34  *
3.34 A            SORK2H        11S 2       TEXT('Rab.2 1/2 mva')
3.34 A                                      COLHDG('Rab.2 1/2 mva')
3.34 A                                      EDTCDE(M)
      *
     A            SORK2F        11S 2       TEXT('Rab.2 fritt')
     A                                      COLHDG('Rab.2 fritt')
     A                                      EDTCDE(M)
6.13  *
6.13 A            SOPSKP        11S 2       TEXT('Påslag Plikt')
6.13 A                                      COLHDG('Påslag' 'Plikt')
6.13 A                                      EDTCDE(M)
6.13  *
6.13 A            SOPSKH        11S 2       TEXT('Påslag Halv')
6.13 A                                      COLHDG('Påslag' 'halv')
6.13 A                                      EDTCDE(M)
6.13  *
6.13 A            SOPSKF        11S 2       TEXT('Påslag Fritt')
6.13 A                                      COLHDG('Påslag' 'Fritt')
6.13 A                                      EDTCDE(M)
5.31  *
5.31 A            SORB1P        11S 2       TEXT('Alm Rab.1 plikt')
5.31 A                                      COLHDG('Alm Rab.1 plikt')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SORB1H        11S 2       TEXT('Alm Rab.1 1/2 mva')
5.31 A                                      COLHDG('Alm Rab.1 1/2 mva')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SORB1F        11S 2       TEXT('Alm Rab.1 fritt')
5.31 A                                      COLHDG('Alm Rab.1 fritt')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SORB2P        11S 2       TEXT('Alm Rab.2 plikt')
5.31 A                                      COLHDG('Alm Rab.2 plikt')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SORB2H        11S 2       TEXT('Alm Rab.2 1/2 mva')
5.31 A                                      COLHDG('Alm Rab.2 1/2 mva')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SORB2F        11S 2       TEXT('Alm Rab.2 fritt')
5.31 A                                      COLHDG('Alm Rab.2 fritt')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SOGR1P        11S 2       TEXT('Br.rabgr1 plikt')
5.31 A                                      COLHDG('Br.rabgr1 plikt')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SOGR1H        11S 2       TEXT('Br.rabgr1 1/2')
5.31 A                                      COLHDG('Br.rabgr1 1/2')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SOGR1F        11S 2       TEXT('Br.rabgr1 fritt')
5.31 A                                      COLHDG('Br.rabgr1 fritt')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SOGR2P        11S 2       TEXT('Br.rabgr2 plikt')
5.31 A                                      COLHDG('Br.rabgr2 plikt')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SOGR2H        11S 2       TEXT('Br.rabgr2 1/2')
5.31 A                                      COLHDG('Br.rabgr2 1/2')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SOGR2F        11S 2       TEXT('Br.rabgr2 fritt')
5.31 A                                      COLHDG('Br.rabgr2 fritt')
5.31 A                                      EDTCDE(M)
      *
     A            SORBGP        11S 2       TEXT('Rabgr plikt')
     A                                      COLHDG('Rabgr plikt')
     A                                      EDTCDE(M)
3.34  *
3.34 A            SORBGH        11S 2       TEXT('Rabgr 1/2 mva')
3.34 A                                      COLHDG('Rabgr 1/2 mva')
3.34 A                                      EDTCDE(M)
      *
     A            SORBGF        11S 2       TEXT('Rabgr fritt')
     A                                      COLHDG('Rabgr fritt')
     A                                      EDTCDE(M)
      *
     A            SORKOP        11S 2       TEXT('Orab plikt')
     A                                      COLHDG('Orab plikt')
     A                                      EDTCDE(M)
3.34  *
3.34 A            SORKOH        11S 2       TEXT('Orab 1/2 mva')
3.34 A                                      COLHDG('Orab 1/2 mva')
3.34 A                                      EDTCDE(M)
      *
     A            SORKOF        11S 2       TEXT('Orab fritt')
     A                                      COLHDG('Orab fritt')
     A                                      EDTCDE(M)
      *
     A            SOKSTP        11S 2       TEXT('Kostp plikt')
     A                                      COLHDG('Kostp plikt')
     A                                      EDTCDE(M)
3.34  *
3.34 A            SOKSTH        11S 2       TEXT('Kostp 1/2 mva')
3.34 A                                      COLHDG('Kostp 1/2 mva')
3.34 A                                      EDTCDE(M)
      *
     A            SOKSTF        11S 2       TEXT('Kostp fritt')
     A                                      COLHDG('Kostp fritt')
     A                                      EDTCDE(M)
5.31  *
5.31 A            SOMVGF        11S 2       TEXT('Mva.grunnl fritt')
5.31 A                                      COLHDG('Mva.grunnl fritt')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SOMVGP        11S 2       TEXT('Mva.grunnl plikt')
5.31 A                                      COLHDG('Mva.grunnl plikt')
5.31 A                                      EDTCDE(M)
5.31  *
5.31 A            SOMVGH        11S 2       TEXT('Mva.grunnl 1/2')
5.31 A                                      COLHDG('Mva.grunnl 1/2')
5.31 A                                      EDTCDE(M)
      *
     A            SOFSUM        11S 2       TEXT('Fakturasum')
     A                                      COLHDG('Fakturasum')
     A                                      EDTCDE(M)
      *
     A            SOKPRO    R               REFFLD(FÅKPRO)
      *
     A            SOBKUN         6S 0       TEXT('Kunde/bestiller')
     A                                      COLHDG('Kunde' 'best.')
     A                                      EDTCDE(Z)
      *
     A            SOKKUN         6S 0       TEXT('Kunde/kjøper')
     A                                      COLHDG('Kunde' 'kjøper')
     A                                      EDTCDE(Z)
      *
     A            SONETO         1S 0       TEXT('Netto u/rab')
     A                                      COLHDG('Netto' 'u/rab')
     A                                      EDTCDE(Z)
      *
     A            SOUTSK         1S 0       TEXT('Kode for utskrift')
     A                                      COLHDG('Kode' 'utskrift')
     A                                      EDTCDE(Z)
      *
     A            SOUSKR        10A         TEXT('Bruker gir Kreditt')
     A                                      COLHDG('Bruker' 'Kreditt')
      *
     A            SOJOUR    R               REFFLD(FÅJANE)
     A                                      TEXT('Journal kjørt')
     A                                      COLHDG('Journal' 'kjørt')
      *
     A            SOSHOP    R               REFFLD(FÅJANE)
     A                                      TEXT('Fakt fra Shop')
     A                                      COLHDG('Shop')
      *
8.01 A            SOEDIH         8S 0       TEXT('Edi-hode')
     A                                      COLHDG('Edi-hode')
     A                                      EDTCDE(Z)
5.07  *
5.07 A            SONREF    R               REFFLD(FÅNREF)
5.22 A            SOFSYS    R               REFFLD(FÅFSYS)
5.08  *
5.08 A            SOKIDD        25A         TEXT('Kiddnummer')
5.08 A                                      COLHDG('Kidd' 'nr.')
5.08  *
6.3a A            SOKIDR         9S 0       TEXT('Kiddreferanse')
5.08 A                                      COLHDG('Kidd' 'referanse')
5.08 A                                      EDTCDE(Z)
5.23  *
6.NU A            SOBENR         8S 0       TEXT('Bestillings-nr')
5.23 A                                      COLHDG('Best' 'nr.')
5.23 A                                      EDTCDE(Z)
5.23  *
5.23 A            SOBSUF         2S 0       TEXT('Bestillings-suffix')
5.23 A                                      COLHDG('Best' 'suffix')
5.23 A                                      EDTCDE(Z)
5.23  *
5.23 A            SOMOBI        15A         TEXT('Kundens mobilnr')
5.23 A                                      COLHDG('Kundens' 'mobil')
5.23  *
5.23 A            SOKBNR        15A         TEXT('Kundens best.nr')
5.23 A                                      COLHDG('Kundens' 'best.nr')
      *
6.22 A            SOINF1        12A         TEXT('Informasjon-1')
6.22 A                                      COLHDG('Info-1')
6.22  *
6.22 A            SOINF2        40A         TEXT('Informasjon-2')
6.22 A                                      COLHDG('Info-2')
      *
5.37 A            SODEPO        11S 2       TEXT('Krav til Depositum')
5.37 A                                      COLHDG('Krav' 'Depositum')
5.37 A                                      EDTCDE(M)
      *
5.64 A            SODEPB        11S 2       TEXT('Betalt Depositum')
5.64 A                                      COLHDG('Betalt' 'Depositum')
5.64 A                                      EDTCDE(M)
      *
5.64 A            SODEPT        11S 2       TEXT('Trukket Depositum på fakt')
5.64 A                                      COLHDG('Trukket' 'Depositum')
5.64 A                                      EDTCDE(M)
      *
7.f2 A            SOFOSA        11S 2       TEXT('Fordelt red.salg')
7.f2 A                                      COLHDG('Ford.red.salg')
7.f2 A                                      EDTCDE(M)
      *
7.f2 A            SOFOSI        11S 2       TEXT('F.red.salgImva')
7.f2 A                                      COLHDG('F.red.salgImva')
7.f2 A                                      EDTCDE(M)
      *
5.37 A            SOFATY         2S 0       TEXT('Fakturatype')
5.37 A                                      COLHDG('Fakt.' 'type')
5.37 A                                      EDTCDE(Z)
      *
5.37 A            SOBONG        12A         TEXT('Bongnr')
5.37 A                                      COLHDG('Bongnr')
      *
6.2B A            SOPSUF    R               REFFLD(FÅSUFF)
6.2B A                                      TEXT('Suffix-prisordre')
6.2B A                                      COLHDG('Suffix' 'prisordre')
      *
     A            SOWSID        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arbeidstasjon')
      *
     A            SOUSER        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            SODATE          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            SOTIME          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
6.10 A            SOOUSR    R               REFFLD(FÅOUSR)
6.10 A            SOEDAT    R               REFFLD(FÅEDAT)
6.10 A            SOETIM    R               REFFLD(FÅETIM)
6.10 A            SOEUSR    R               REFFLD(FÅEUSR)
5.02  *
5.02  * Bilde-alternativer                  (VAB)
5.02  *
5.02 A            VABFIR    R               REFFLD(FÅFIRM)
5.02 A            VABALT         1S 0       TEXT('Bilde-alternativ')
5.02 A                                      COLHDG('Bilde' 'alt.')
5.02  *
5.02 A            VABTX1        20          TEXT('Tekst 1')
5.02 A                                      COLHDG('Tekst' '1')
5.02  *
5.02 A            VABTX2        20          TEXT('Tekst 2')
5.02 A                                      COLHDG('Tekst' '2')
5.02  *
6.10 A            VABODA    R               REFFLD(FÅODAT)
6.10 A            VABOTI    R               REFFLD(FÅOTIM)
6.10 A            VABOUS    R               REFFLD(FÅOUSR)
5.02 A            VABEDA    R               REFFLD(FÅEDAT)
5.02 A            VABETI    R               REFFLD(FÅETIM)
5.02 A            VABEUS    R               REFFLD(FÅEUSR)
      *
      * Enhets-register                     (VY)
      *
     A            VAEFIR    R               REFFLD(FÅFIRM)
     A            VAEENH    R               REFFLD(FÅENHE)
     A            VAETXT    R               REFFLD(FÅBESK)
6.10 A            VAEODA    R               REFFLD(FÅODAT)
6.10 A            VAEOTI    R               REFFLD(FÅOTIM)
6.10 A            VAEOUS    R               REFFLD(FÅOUSR)
     A            VAEEDA    R               REFFLD(FÅEDAT)
     A            VAEETI    R               REFFLD(FÅETIM)
     A            VAEEUS    R               REFFLD(FÅEUSR)
      *
      * Ordre informasjonskode              (VAI)
      *
     A            VAIFIR    R               REFFLD(FÅFIRM)
     A            VAITYP    R               REFFLD(FÅOTYP)
     A            VAITXT    R               REFFLD(FÅBESK)
     A            VAIUSR    R               REFFLD(FÅVALA)
     A                                      TEXT('Kontroll mot bruker')
     A                                      COLHDG('Bruker' 'Kontr.')
     A            VAIFAK    R               REFFLD(FÅVALA)
     A                                      TEXT('Stopp v/fakt.')
     A                                      COLHDG('Stopp')
     A            VAISEL    R               REFFLD(FÅVALA)
     A                                      TEXT('Følges opp av selger')
     A                                      COLHDG('Følges' 'opp')
     A            VAIFRG    R               REFFLD(FÅVALA)
     A                                      TEXT('Fargekode')
     A                                      COLHDG('Farge')
6.32 A            VAISTI    R               REFFLD(FÅVALA)
6.32 A                                      TEXT('Tilbud opp av selger')
6.32 A                                      COLHDG('Tilbud' 'oppf.')
6.10 A            VAIODA    R               REFFLD(FÅODAT)
6.10 A            VAIOTI    R               REFFLD(FÅOTIM)
6.10 A            VAIOUS    R               REFFLD(FÅOUSR)
     A            VAIEDA    R               REFFLD(FÅEDAT)
     A            VAIETI    R               REFFLD(FÅETIM)
     A            VAIEUS    R               REFFLD(FÅEUSR)
5.58  *
5.58  * Ordre Logg-koder                    (VAJ)
5.58  *
5.58 A            VAJFIR    R               REFFLD(FÅFIRM)
5.58 A            VAJTYP         1A
5.58 A            VAJTXT        20A
5.58 A            VAJSEL    R               REFFLD(FÅVALA)
5.58 A                                      TEXT('Følges opp av selger')
5.58 A                                      COLHDG('Følges' 'opp')
5.58 A            VAJKJO    R               REFFLD(FÅVALA)
5.58 A                                      TEXT('Kjørekontorløsning')
5.58 A                                      COLHDG('Kjøre' 'kontor')
6.10 A            VAJODA    R               REFFLD(FÅODAT)
6.10 A            VAJOTI    R               REFFLD(FÅOTIM)
6.10 A            VAJOUS    R               REFFLD(FÅOUSR)
5.58 A            VAJEDA    R               REFFLD(FÅEDAT)
5.58 A            VAJETI    R               REFFLD(FÅETIM)
5.58 A            VAJEUS    R               REFFLD(FÅEUSR)
      *
      * Kontohenvisnings-register           (VAK)
      *
     A            VAKFIR    R               REFFLD(FÅFIRM)
     A            VAKKOD    R               REFFLD(FÅKHEV)
5.20 A            VAKLTY    R               REFFLD(FÅLETY)
      *
     A            VAKOTY         2A         TEXT('Ordretype')
     A                                      COLHDG('Ordre' 'type')
      *
     A            VAKTXT        30A         TEXT('Tekst')
     A                                      COLHDG('Tekst')
      *
     A            VAKAV1         4S 0       TEXT('Avd-salg')
     A                                      COLHDG('Avd-salg')
     A                                      EDTCDE(Z)
      *
     A            VAKKO1         6S 0       TEXT('Konto-salg')
     A                                      COLHDG('Konto-salg')
     A                                      EDTCDE(Z)
      *
4.01 A            VAKSP1         4S 0       TEXT('Spes-salg')
     A                                      COLHDG('Spes-salg')
     A                                      EDTCDE(Z)
      *
     A            VAKAV2         4S 0       TEXT('Avd-salg fritt')
     A                                      COLHDG('Avd-salg' 'fritt')
     A                                      EDTCDE(Z)
      *
     A            VAKKO2         6S 0       TEXT('Konto-salg fritt')
     A                                      COLHDG('Konto-salg' 'fritt')
     A                                      EDTCDE(Z)
      *
4.01 A            VAKSP2         4S 0       TEXT('Spes-salg fritt')
     A                                      COLHDG('Spes-salg' 'fritt')
     A                                      EDTCDE(Z)
      *
     A            VAKAV3         4S 0       TEXT('Avd-kost')
     A                                      COLHDG('Avd-kost')
     A                                      EDTCDE(Z)
      *
     A            VAKKO3         6S 0       TEXT('Konto-kost')
     A                                      COLHDG('Konto-kost')
     A                                      EDTCDE(Z)
      *
4.01 A            VAKSP3         4S 0       TEXT('Spes-kost')
     A                                      COLHDG('Spes-kost')
     A                                      EDTCDE(Z)
      *
     A            VAKAV4         4S 0       TEXT('Avd-innkjøp')
     A                                      COLHDG('Avd' 'innkjøp')
     A                                      EDTCDE(Z)
      *
     A            VAKKO4         6S 0       TEXT('Konto-innkjøp')
     A                                      COLHDG('Konto' 'innkjøp')
     A                                      EDTCDE(Z)
      *
4.01 A            VAKSP4         4S 0       TEXT('Spes-innkjøp')
     A                                      COLHDG('Spes' 'innkjøp')
     A                                      EDTCDE(Z)
      *
     A            VAKAV5         4S 0       TEXT('Avd-rabatt1')
     A                                      COLHDG('Avd' 'rabatt1')
     A                                      EDTCDE(Z)
      *
     A            VAKKO5         6S 0       TEXT('Konto-rabatt1')
     A                                      COLHDG('Konto' 'rabatt1')
     A                                      EDTCDE(Z)
      *
4.01 A            VAKSP5         4S 0       TEXT('Spes-rabatt1')
     A                                      COLHDG('Spes' 'rabatt1')
     A                                      EDTCDE(Z)
      *
     A            VAKAV6         4S 0       TEXT('Avd-rabatt2')
     A                                      COLHDG('Avd' 'rabatt2')
     A                                      EDTCDE(Z)
      *
     A            VAKKO6         6S 0       TEXT('Konto-rabatt2')
     A                                      COLHDG('Konto' 'rabatt2')
     A                                      EDTCDE(Z)
      *
4.01 A            VAKSP6         4S 0       TEXT('Spes-rabatt2')
     A                                      COLHDG('Spes' 'rabatt2')
     A                                      EDTCDE(Z)
      *
     A            VAKAV7         4S 0       TEXT('Avd-rabatt3')
     A                                      COLHDG('Avd' 'rabatt3')
     A                                      EDTCDE(Z)
      *
     A            VAKKO7         6S 0       TEXT('Konto-rabatt3')
     A                                      COLHDG('Konto' 'rabatt3')
     A                                      EDTCDE(Z)
      *
4.01 A            VAKSP7         4S 0       TEXT('Spes-rabatt3')
     A                                      COLHDG('Spes' 'rabatt3')
     A                                      EDTCDE(Z)
      *
     A            VAKAV8         4S 0       TEXT('Avd-Beh.endr.')
     A                                      COLHDG('Avd' 'Beh.endr')
     A                                      EDTCDE(Z)
      *
     A            VAKKO8         6S 0       TEXT('Konto-Beh.endr.')
     A                                      COLHDG('Konto' 'Beh.endr')
     A                                      EDTCDE(Z)
      *
4.01 A            VAKSP8         4S 0       TEXT('Spes-Beh.endr.')
     A                                      COLHDG('Spes' 'Beh.endr')
     A                                      EDTCDE(Z)
      *
6.10 A            VAKODA    R               REFFLD(FÅODAT)
6.10 A            VAKOTI    R               REFFLD(FÅOTIM)
6.10 A            VAKOUS    R               REFFLD(FÅOUSR)
6.10 A            VAKEDA    R               REFFLD(FÅEDAT)
6.10 A            VAKETI    R               REFFLD(FÅETIM)
6.10 A            VAKEUS    R               REFFLD(FÅEUSR)
      *
      * Linjetype-register                  (VAL)
      *
     A            VALFIR    R               REFFLD(FÅFIRM)
      *
     A            VALTYP         2A
     A                                      COLHDG('Linjetype')
     A                                      TEXT('Linjetype')
     A            VALTXT        30A
     A                                      COLHDG('Linjetekst')
     A                                      TEXT('Linjetekst')
     A            VALKTX         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Linjetypekode')
     A                                      TEXT('Linjetypekode')
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VALPBB         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, pris er beløp')
     A                                      TEXT('Kode, pris er beløp')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VALLAG         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, oppd. lager')
     A                                      TEXT('Kode, oppd. lager')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VALOKO         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, oppd. økon')
     A                                      TEXT('Kode, oppd. økon')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VALSTA         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, oppd. stat')
     A                                      TEXT('Kode, oppd. stat')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VALKRE         1A
     A                                      COLHDG('Kode, fortegn')
     A                                      TEXT('Kode, fortegn')
     A                                      VALUES(' ' '-')
     A                                      CHKMSGID(VMA0110 *LIBL/QMFVEDL)
      *
     A            VALO01    R               REFFLD(FÅOTYP)
     A                                      COLHDG('Ikke på otype 01')
     A                                      TEXT('Ikke på otype 01')
      *
     A            VALO02    R               REFFLD(FÅOTYP)
     A                                      COLHDG('Ikke på otype 02')
     A                                      TEXT('Ikke på otype 02')
      *
     A            VALO03    R               REFFLD(FÅOTYP)
     A                                      COLHDG('Ikke på otype 03')
     A                                      TEXT('Ikke på otype 03')
      *
     A            VALO04    R               REFFLD(FÅOTYP)
     A                                      COLHDG('Ikke på otype 04')
     A                                      TEXT('Ikke på otype 04')
      *
6.10 A            VALODA    R               REFFLD(FÅODAT)
6.10 A            VALOTI    R               REFFLD(FÅOTIM)
6.10 A            VALOUS    R               REFFLD(FÅOUSR)
6.10 A            VALEDA    R               REFFLD(FÅEDAT)
6.10 A            VALETI    R               REFFLD(FÅETIM)
6.10 A            VALEUS    R               REFFLD(FÅEUSR)
6.17  *
6.17  * Koblingstabell for mva              (VAM)
6.17  *
6.17 A            VAMFIR    R               REFFLD(FÅFIRM)
6.17 A            VAMKOD         1S 0
6.17 A            VAMKOF         1A
6.17 A            VAMKLA         1A
6.3c A            VAMKUO         1A
6.3c A                                      COLHDG('mvakode utl.ordr')
6.3c A                                      TEXT('mvakode utl.ordr')
6.3c A            VAMKUI         1A
6.3c A                                      COLHDG('mvakode utl.innk')
6.3c A                                      TEXT('mvakode utl.innk')
6.17 A            VAMTXT    R               REFFLD(FÅBESK)
6.17 A            VAMODA    R               REFFLD(FÅODAT)
6.17 A            VAMOTI    R               REFFLD(FÅOTIM)
6.17 A            VAMOUS    R               REFFLD(FÅOUSR)
6.17 A            VAMEDA    R               REFFLD(FÅEDAT)
6.17 A            VAMETI    R               REFFLD(FÅETIM)
6.17 A            VAMEUS    R               REFFLD(FÅEUSR)
      *
      *
      * Ordretype-register                  (VAO)
      *
     A            VAOFIR    R               REFFLD(FÅFIRM)
     A            VAOTYP    R               REFFLD(FÅOTYP)
     A            VAOTXT        30A
     A                                      COLHDG('Ordretekst')
     A                                      TEXT('Ordretekst')
     A            VAOSYS         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, system')
     A                                      TEXT('Kode, system')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VAOAKK         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, akkumulator')
     A                                      TEXT('Kode, akkumulator')
     A                                      VALUES(0 1 2 3 4 5)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
5.02 A            VAOBLD         1S 0
5.02 A                                      EDTCDE(Z)
5.02 A                                      COLHDG('Kode' 'bilde')
5.02 A                                      TEXT('Kode, bildevariant')
5.02 A                                      VALUES(0 1 2 3 4 5)
5.02 A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
5.03 A            VAOFDJ         1S 0
5.03 A                                      EDTCDE(Z)
5.03 A                                      COLHDG('Kode' 'Fel/dir/jq')
5.03 A                                      TEXT('Kode, Fel/dir/jq')
5.03 A                                      VALUES(0 1 2)
5.03 A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VAOOGR         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, Ordregrl.')
     A                                      TEXT('Kode, Ordregrl.')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VAOBOO         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode Bevar Org.Ordre')
     A                                      TEXT('Kode, Bevar Org.Ordre')
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VAOSKA         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, skaffeordre')
     A                                      TEXT('Kode, skaffeordre')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VAOSAM         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, samle opp')
     A                                      TEXT('Kode, samle opp')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VAOLAG         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, oppd. lager')
     A                                      TEXT('Kode, oppd. lager')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VAOOKO         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, oppd. økon')
     A                                      TEXT('Kode, oppd. økon')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VAOSTA         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, oppd. stat')
     A                                      TEXT('Kode, oppd. stat')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VAOPRO         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, oppd. prosj.')
     A                                      TEXT('Kode, oppd. prosj.')
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VAOBUT         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, vise i butikk')
     A                                      TEXT('Kode, vise i butikk')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
     A            VAOKRE         1A
     A                                      COLHDG('Kode, fortegn')
     A                                      TEXT('Kode, fortegn')
     A                                      VALUES(' ' '-')
     A                                      CHKMSGID(VMA0110 *LIBL/QMFVEDL)
     A            VAOBIL         2S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagskode')
     A                                      TEXT('Bilagskode')
5.32 A            VAONUM         2A
5.32 A                                      COLHDG('OT nummerserie')
5.32 A                                      TEXT('OT nummerserie')
5.40 A            VAOMOT         2A
5.40 A                                      COLHDG('OT motsvar syst')
5.40 A                                      TEXT('OT motsvar syst')
     A            VAONXT         2A
     A                                      COLHDG('Neste ordretype')
     A                                      TEXT('Neste ordretype')
     A            VAON01         2A
     A                                      TEXT('Neste Ot.01')
     A                                      COLHDG('Neste' 'Ot 01')
     A            VAON02         2A
     A                                      TEXT('Neste Ot.02')
     A                                      COLHDG('Neste' 'Ot 02')
     A            VAON03         2A
     A                                      TEXT('Neste Ot.03')
     A                                      COLHDG('Neste' 'Ot 03')
     A            VAON04         2A
     A                                      TEXT('Neste Ot.04')
     A                                      COLHDG('Neste' 'Ot 04')
     A            VAON05         2A
     A                                      TEXT('Neste Ot.05')
     A                                      COLHDG('Neste' 'Ot 05')
     A            VAON06         2A
     A                                      TEXT('Neste Ot.06')
     A                                      COLHDG('Neste' 'Ot 06')
     A            VAORUT        10A
     A                                      COLHDG('Rutine, Ordre/fakt.')
     A                                      TEXT('Rutine, Ordre/fakt.')
     A            VAORUB        10A
     A                                      COLHDG('Rutine, Butikk')
     A                                      TEXT('Rutine, Butikk')
      *
6.10 A            VAOODA    R               REFFLD(FÅODAT)
6.10 A            VAOOTI    R               REFFLD(FÅOTIM)
6.10 A            VAOOUS    R               REFFLD(FÅOUSR)
6.10 A            VAOEDA    R               REFFLD(FÅEDAT)
6.10 A            VAOETI    R               REFFLD(FÅETIM)
6.10 A            VAOEUS    R               REFFLD(FÅEUSR)
6.2Å  *
6.2Å  * Ordretype-register                  (VA1)
6.2Å  *
6.2Å A            VA1FIR    R               REFFLD(FÅFIRM)
6.2Å A            VA1TYP    R               REFFLD(FÅOTYP)
6.2Å A            VA1INT         1S 0
6.2Å A                                      EDTCDE(Z)
6.2Å A                                      COLHDG('Intern ordre')
6.2Å A                                      TEXT('Intern ordre')
6.2Å A                                      VALUES(0 1)
6.2Å A                                      CHKMSGID(VMA0100 *LIBL/QMFVEDL)
6.2Å A            VA1ODA    R               REFFLD(FÅODAT)
6.2Å A            VA1OTI    R               REFFLD(FÅOTIM)
6.2Å A            VA1OUS    R               REFFLD(FÅOUSR)
6.2Å A            VA1EDA    R               REFFLD(FÅEDAT)
6.2Å A            VA1ETI    R               REFFLD(FÅETIM)
6.2Å A            VA1EUS    R               REFFLD(FÅEUSR)
      *
      * Priskode beskrivelse                (VAP)
      *
     A            VAPFIR    R               REFFLD(FÅFIRM)
     A            VAPKOD    R               REFFLD(FÅPKOD)
     A            VAPTXT    R               REFFLD(FÅBESK_5)
6.10 A            VAPODA    R               REFFLD(FÅODAT)
6.10 A            VAPOTI    R               REFFLD(FÅOTIM)
6.10 A            VAPOUS    R               REFFLD(FÅOUSR)
     A            VAPEDA    R               REFFLD(FÅEDAT)
     A            VAPETI    R               REFFLD(FÅETIM)
     A            VAPUSR    R               REFFLD(FÅEUSR)
      *
      * Bonustype                           (VAT)
      *
5.50 A            VATFIR    R               REFFLD(FÅFIRM)
5.50 A            VATBOT    R               REFFLD(FÅBOTY)
5.50 A            VATBES    R               REFFLD(FÅBESK)
6.2N A            VATSUM         1S 0       TEXT('Summeringsnivå')
6.2N A                                      COLHDG('Summeringsnivå')
6.2N A                                      VALUES(0 1)
6.2N A                                      EDTCDE(Z)
6.2N A            VATRED         5S 2       TEXT('Reduksjonssats')
6.2N A                                      COLHDG('Reduseres med')
6.2N A                                      EDTCDE(Z)
6.2N A                                      COMP(LE 100)
6.2N A            VATBB1    R               REFFLD(FÅBOTY)
6.2N A                                      TEXT('Beregnes med')
6.2N A                                      COLHDG('Beregnes med')
6.2N A            VATBB2    R               REFFLD(FÅBOTY)
6.2N A                                      TEXT('Beregnes med')
6.2N A                                      COLHDG('Beregnes med')
5.50 A            VATODA    R               REFFLD(FÅODAT)
5.50 A            VATEDA    R               REFFLD(FÅEDAT)
5.50 A            VATETI    R               REFFLD(FÅETIM)
5.50 A            VATEUS    R               REFFLD(FÅEUSR)
      *
      * Varetype-register                   (VAV)
      *
     A            VAVFIR    R               REFFLD(FÅFIRM)
     A            VAVTYP    R               REFFLD(FÅVTYP)
     A            VAVTXT    R               REFFLD(FÅBESK)
6.10 A            VAVODA    R               REFFLD(FÅODAT)
6.10 A            VAVOTI    R               REFFLD(FÅOTIM)
6.10 A            VAVOUS    R               REFFLD(FÅOUSR)
     A            VAVEDA    R               REFFLD(FÅEDAT)
     A            VAVETI    R               REFFLD(FÅETIM)
     A            VAVEUS    R               REFFLD(FÅEUSR)
      *
      * Påslag-hode-register                (VI)
      *
     A            VIFIRM    R               REFFLD(FÅFIRM)
     A            VIPASL    R               REFFLD(FÅPASL)
     A            VIBESK    R               REFFLD(FÅBESK)
6.10 A            VIODAT    R               REFFLD(FÅODAT)
6.10 A            VIOTIM    R               REFFLD(FÅOTIM)
6.10 A            VIOUSR    R               REFFLD(FÅOUSR)
     A            VIEDAT    R               REFFLD(FÅEDAT)
     A            VIETIM    R               REFFLD(FÅETIM)
     A            VIEUSR    R               REFFLD(FÅEUSR)
      *
      * Påslags-linje-register              (VJ)
      *
     A            VJFIRM    R               REFFLD(FÅFIRM)
     A            VJPASL    R               REFFLD(FÅPASL)
7.14 A            VJPRGR    R               REFFLD(FÅPRGR)
     A            VJLDOR    R               REFFLD(FÅLDOR)
     A            VJOGRP    R               REFFLD(FÅOGRP)
     A            VJHGRP    R               REFFLD(FÅHGRP)
     A            VJUGRP    R               REFFLD(FÅUGRP)
     A            VJKPRI    R               REFFLD(FÅKPRI)
     A            VJVARE    R               REFFLD(FÅVARE)
     A            VJLETY    R               REFFLD(FÅLETY)
     A            VJINPA         5S 2       TEXT('Innkjøpspris-påslag')
     A                                      COLHDG('Innkj.pris' 'påslag')
5.24 A                                      EDTCDE(M)
     A            VJINBE         7S 2       TEXT('Innkjøpspris-beløp')
     A                                      COLHDG('Innkj.pris' 'beløp')
5.24 A                                      EDTCDE(M)
     A            VJKOPA         5S 2       TEXT('Kostpris-påslag')
     A                                      COLHDG('Kostpris' 'påslag')
5.24 A                                      EDTCDE(M)
     A            VJKOBE         7S 2       TEXT('Kostpris-beløp')
     A                                      COLHDG('Kostpris' 'beløp')
5.24 A                                      EDTCDE(M)
     A            VJSAPA         5S 2       TEXT('Salgspris-påslag')
     A                                      COLHDG('Salgspris' 'påslag')
5.24 A                                      EDTCDE(M)
     A            VJSABE         7S 2       TEXT('Salgspris-beløp')
     A                                      COLHDG('Salgspris' 'beløp')
5.24 A                                      EDTCDE(M)
5.24 A            VJSAPR         9S 2       TEXT('Salgspris')
5.24 A                                      COLHDG('Salgspris')
5.24 A                                      EDTCDE(4)
     A            VJDEKN         5S 2       TEXT('Dekning')
     A                                      COLHDG('DG')
     A                                      EDTCDE(4)
5.24 A            VJODAT    R               REFFLD(FÅODAT)
6.10 A            VJOTIM    R               REFFLD(FÅOTIM)
6.10 A            VJOUSR    R               REFFLD(FÅOUSR)
     A            VJEDAT    R               REFFLD(FÅEDAT)
     A            VJETIM    R               REFFLD(FÅETIM)
     A            VJEUSR    R               REFFLD(FÅEUSR)
      *
      * Varesortiment-hode                  (VC)
      *
     A            VCFIRM    R               REFFLD(FÅFIRM)
     A            VCVSOR    R               REFFLD(FÅVSOR)
6.28 A            VCLAGE    R               REFFLD(FÅLAGE)
     A            VCBESK    R               REFFLD(FÅBESK)
     A            VCTYPE         1A         TEXT('Type')
     A                                      COLHDG('Type')
      *                                     V = Vareliste
      *                                     H = Handleliste Nettbutikk
6.28  *                                     C = Sentrallagervarer
6.28  *                                     P = Periode varer
6.28 A            VCFDAT    R               REFFLD(FÅODAT)
6.28 A                                      COLHDG('Fra''dato')
6.2Y A                                      DFT('0001-01-01')
6.28 A            VCTDAT    R               REFFLD(FÅODAT)
6.28 A                                      COLHDG('Til''dato')
6.2Y A                                      DFT('0001-01-01')
6.2o A            VCFUKE         2S 0
6.2o A                                      COLHDG('Fra''uke')
6.2o A            VCTUKE         2S 0
6.2o A                                      COLHDG('Til''uke')
5.24 A            VCODAT    R               REFFLD(FÅODAT)
6.10 A            VCOTIM    R               REFFLD(FÅOTIM)
6.10 A            VCOUSR    R               REFFLD(FÅOUSR)
     A            VCEDAT    R               REFFLD(FÅEDAT)
     A            VCETIM    R               REFFLD(FÅETIM)
     A            VCEUSR    R               REFFLD(FÅEUSR)
      *
      * Varesortiment-linje                 (VD)
      *
     A            VDFIRM    R               REFFLD(FÅFIRM)
     A            VDVSOR    R               REFFLD(FÅVSOR)
6.28 A            VDLAGE    R               REFFLD(FÅLAGE)
5.24 A            VDLDOR    R               REFFLD(FÅLDOR)
     A            VDOGRP    R               REFFLD(FÅOGRP)
     A            VDHGRP    R               REFFLD(FÅHGRP)
     A            VDUGRP    R               REFFLD(FÅUGRP)
5.24 A            VDMODN    R               REFFLD(FÅMODN)
     A            VDVARE    R               REFFLD(FÅVARE)
5.24 A            VDODAT    R               REFFLD(FÅODAT)
6.10 A            VDOTIM    R               REFFLD(FÅOTIM)
6.10 A            VDOUSR    R               REFFLD(FÅOUSR)
     A            VDEDAT    R               REFFLD(FÅEDAT)
     A            VDETIM    R               REFFLD(FÅETIM)
     A            VDEUSR    R               REFFLD(FÅEUSR)
      *
      * Vare-enhets-register                (VE)
      *
     A            VEFIRM    R               REFFLD(FÅFIRM)
     A            VEVARE    R               REFFLD(FÅVARE)
     A            VEENHE    R               REFFLD(FÅENHE)
     A            VESAEN         1S 0       TEXT('Salgs-enhet rekkefølge')
     A                                      COLHDG('Salgs' 'enh')
     A                                      EDTCDE(3)
     A            VEINEN         1S 0       TEXT('Innkjøps-enhet rekkefølge')
     A                                      COLHDG('Innkj.' 'enh')
     A                                      EDTCDE(3)
     A            VEPBEN         1S 0       TEXT('Prisbok-enhet rekkefølge')
     A                                      COLHDG('Pb' 'enh')
     A                                      EDTCDE(3)
     A            VEOMRE        12S 6       TEXT('Omr.faktor')
     A                                      COLHDG('Omr.faktor')
     A                                      EDTCDE(4)
     A            VELENG    R               REFFLD(FÅLENG)
     A            VEBRED    R               REFFLD(FÅBRED)
     A            VEHOYD    R               REFFLD(FÅHOYD)
     A            VEVEKT    R               REFFLD(FÅVEKT)
     A            VEVOLU    R               REFFLD(FÅVOLU)
     A            VEODAT    R               REFFLD(FÅODAT)
6.10 A            VEOTIM    R               REFFLD(FÅOTIM)
6.10 A            VEOUSR    R               REFFLD(FÅOUSR)
     A            VEEDAT    R               REFFLD(FÅEDAT)
     A            VEETIM    R               REFFLD(FÅETIM)
     A            VEEUSR    R               REFFLD(FÅEUSR)
6.16  *
6.16  * Vare-enhets-prisgiver-register      (VEP)
6.16  *
6.16 A            VEPFIR    R               REFFLD(FÅFIRM)
6.16 A            VEPVAR    R               REFFLD(FÅVARE)
6.16 A            VEPENH    R               REFFLD(FÅENHE)
6.16 A            VEPLDO    R               REFFLD(FÅLDOR)
6.16 A            VEPGTI    R               REFFLD(FÅEANN)
6.16 A            VEPKLA    R               REFFLD(FÅPKLA)
6.16 A            VEPBES         1S 0       TEXT('Bestillbar')
6.16 A                                      COLHDG('Best.' 'bar')
6.16 A                                      EDTCDE(Z)
6.16 A            VEPODA    R               REFFLD(FÅODAT)
6.16 A            VEPOTI    R               REFFLD(FÅOTIM)
6.16 A            VEPOUS    R               REFFLD(FÅOUSR)
6.16 A            VEPEDA    R               REFFLD(FÅEDAT)
6.16 A            VEPETI    R               REFFLD(FÅETIM)
6.16 A            VEPEUS    R               REFFLD(FÅEUSR)
      *
      * Alternativ hovedgruppe-register     (VFH)
      *
     A            VFHFIR    R               REFFLD(FÅFIRM)
     A            VFHHGR    R               REFFLD(FÅHGRP)
      *
     A            VFHTXT        35A         TEXT('Gruppetekst')
     A                                      COLHDG('Gruppetekst')
      *
6.10 A            VFHODA    R               REFFLD(FÅODAT)
6.10 A            VFHOTI    R               REFFLD(FÅOTIM)
6.10 A            VFHOUS    R               REFFLD(FÅOUSR)
     A            VFHEDA    R               REFFLD(FÅEDAT)
     A            VFHETI    R               REFFLD(FÅETIM)
     A            VFHEUS    R               REFFLD(FÅEUSR)
      *
      * Alternativ undergruppe-register     (VFU)
      *
     A            VFUFIR    R               REFFLD(FÅFIRM)
     A            VFUHGR    R               REFFLD(FÅHGRP)
     A            VFUUGR    R               REFFLD(FÅUGRP)
      *
     A            VFUTXT        35A         TEXT('Gruppetekst')
     A                                      COLHDG('Gruppetekst')
      *
6.10 A            VFUODA    R               REFFLD(FÅODAT)
6.10 A            VFUOTI    R               REFFLD(FÅOTIM)
6.10 A            VFUOUS    R               REFFLD(FÅOUSR)
     A            VFUEDA    R               REFFLD(FÅEDAT)
     A            VFUETI    R               REFFLD(FÅETIM)
     A            VFUEUS    R               REFFLD(FÅEUSR)
      *
      * Overgruppe-register                 (VGO)
      *
     A            VGOFIR    R               REFFLD(FÅFIRM)
     A            VGOOGR    R               REFFLD(FÅOGRP)
      *
     A            VGOTXT        35A         TEXT('Gruppetekst')
     A                                      COLHDG('Gruppetekst')
      *
     A            VGOPRA    R               REFFLD(FÅPRAN)
     A            VGOKHV    R               REFFLD(FÅKHEV)
6.10 A            VGOODA    R               REFFLD(FÅODAT)
6.10 A            VGOOTI    R               REFFLD(FÅOTIM)
6.10 A            VGOOUS    R               REFFLD(FÅOUSR)
     A            VGOEDA    R               REFFLD(FÅEDAT)
     A            VGOETI    R               REFFLD(FÅETIM)
     A            VGOEUS    R               REFFLD(FÅEUSR)
      *
      * Hovedgruppe-register                (VGH)
      *
     A            VGHFIR    R               REFFLD(FÅFIRM)
     A            VGHOGR    R               REFFLD(FÅOGRP)
     A            VGHHGR    R               REFFLD(FÅHGRP)
      *
     A            VGHTXT        35A         TEXT('Gruppetekst')
     A                                      COLHDG('Gruppetekst')
      *
     A            VGHPRA    R               REFFLD(FÅPRAN)
     A            VGHKHV    R               REFFLD(FÅKHEV)
      *
     A            VGHENS         3A         TEXT('Statistikkenhet')
     A                                      COLHDG('Stat.' 'enhet')
      *
     A            VGHENL         3A         TEXT('Lagerenhet')
     A                                      COLHDG('Lager' 'enhet')
      *
     A            VGHENP         3A         TEXT('Prisbokenhet')
     A                                      COLHDG('Prisbok' 'enhet')
      *
6.10 A            VGHODA    R               REFFLD(FÅODAT)
6.10 A            VGHOTI    R               REFFLD(FÅOTIM)
6.10 A            VGHOUS    R               REFFLD(FÅOUSR)
     A            VGHEDA    R               REFFLD(FÅEDAT)
     A            VGHETI    R               REFFLD(FÅETIM)
     A            VGHEUS    R               REFFLD(FÅEUSR)
      *
      * Undergruppe-register                (VGU)
      *
     A            VGUFIR    R               REFFLD(FÅFIRM)
     A            VGUOGR    R               REFFLD(FÅOGRP)
     A            VGUHGR    R               REFFLD(FÅHGRP)
     A            VGUUGR    R               REFFLD(FÅUGRP)
      *
     A            VGUTXT        35A         TEXT('Gruppetekst')
     A                                      COLHDG('Gruppetekst')
      *
     A            VGUKHV    R               REFFLD(FÅKHEV)
      *
     A            VGUENS         3A         TEXT('Statistikkenhet')
     A                                      COLHDG('Stat.' 'enhet')
      *
     A            VGUENL         3A         TEXT('Lagerenhet')
     A                                      COLHDG('Lager' 'enhet')
      *
     A            VGUENP         3A         TEXT('Prisbokenhet')
     A                                      COLHDG('Prisbok' 'enhet')
      *
     A            VGUEP1         3A         TEXT('Prissammenlignings-enhet1')
     A                                      COLHDG('Prissammenlign.' 'enhet 1')
      *
     A            VGUEP2         3A         TEXT('Prissammenlignings-enhet2')
     A                                      COLHDG('Prissammenlign.' 'enhet 2')
      *
     A            VGUDEK         5S 2       TEXT('Dekningsgrad')
     A                                      COLHDG('DG')
     A                                      EDTCDE(4)
      *
     A            VGUPRA    R               REFFLD(FÅPRAN)
      *
     A            VGUAKT         1S 0       TEXT('Ugr=Aktivitet')
     A                                      COLHDG('Ugr=Aktivitet')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
      *
     A            VGUAVR         1S 0       TEXT('Ikke avrunding')
     A                                      COLHDG('Ikke' 'avr.')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
      *
     A            VGULAG         1S 0       TEXT('Ikke lageroppdatering')
     A                                      COLHDG('Ikke' 'lager' 'oppd.')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
      *
     A            VGUSTS         5S 2       TEXT('Sats påslag')
     A                                      COLHDG('Sats' 'påslag')
     A                                      EDTCDE(4)
      *
5.35 A            VGUFRI        10A         TEXT('Fritt 10 alfa')
5.35 A                                      COLHDG('Fritt' '10 alfa')
      *
     A            VGUVAR    R               REFFLD(FÅVARE)
6.10 A            VGUODA    R               REFFLD(FÅODAT)
6.10 A            VGUOTI    R               REFFLD(FÅOTIM)
6.10 A            VGUOUS    R               REFFLD(FÅOUSR)
      *
6.2D A            VGUTRA         1S 0       TEXT('Utra=Undgr/Transp.')
6.2D A                                      COLHDG('Utra=Undgr/Transp')
6.2D A                                      EDTCDE(Z)
6.2D A                                      VALUES(0 1)
6.2D A                                      CHKMSGID(FMA0110 *LIBL/QMFOFAK)
     A            VGUEDA    R               REFFLD(FÅEDAT)
     A            VGUETI    R               REFFLD(FÅETIM)
     A            VGUEUS    R               REFFLD(FÅEUSR)
      *
      *
      * Historisk-lagerbok-register         (VH)
      *
     A            VHFIRM    R               REFFLD(FÅFIRM)
      *
     A            VHVARE    R               REFFLD(FÅVARE)
     A            VHLAGE    R               REFFLD(FÅLAGE)
     A            VHDATO          L
     A                                      COLHDG('Dato')
     A                                      TEXT('Dato')
     A            VHTIME          T
     A                                      COLHDG('Klokkeslett')
     A                                      TEXT('Klokkeslett')
     A            VHSEKV         6S 0       TEXT('Sekvens tid')
     A                                      COLHDG('Sekvens' 'tid'     )
     A            VHUSER    R               REFFLD(FÅEUSR)
     A                                      COLHDG('Bruker-id')
     A                                      TEXT('Bruker-id')
     A            VHSYST         1A
     A                                      COLHDG('System Lag/Fak/B')
     A                                      TEXT('System Lag/Fak/B')
     A                                      VALUES(' ' 'F' 'L' 'B')
     A                                      CHKMSGID(VMH0010 *LIBL/QMFVEDL)
     A            VHKODE         2A
     A                                      COLHDG('Kode (Ordre-type')
     A                                      TEXT('Kode (Ordre-type')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(VMH0020 *LIBL/QMFVEDL)
     A            VHTYPE         1A
     A                                      COLHDG('Type I=Inn/U=Ut')
     A                                      TEXT('Type I=Inn/U=Ut')
     A                                      VALUES('I' 'U')
     A                                      CHKMSGID(VMH0030 *LIBL/QMFVEDL)
     A            VHREFR        20A
     A                                      COLHDG('Referanse-felt')
     A                                      TEXT('Referanse-felt')
6.NU A            VHONUM         8S 0       TEXT('Ordre/Best')
     A                                      COLHDG('Ordre/Best')
     A            VHOLIN         4S 0       TEXT('Linjenr')
     A                                      COLHDG('Linjenr')
     A            VHBANR        20A
     A                                      COLHDG('Batch nummer')
     A                                      TEXT('Batch nummer')
     A            VHBEHL        11S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Beholdning-etter')
     A                                      TEXT('Beholdning-etter')
     A            VHANTA    R               REFFLD(FÅANTA)
     A            VHENHL         3A         TEXT('Lagerenhet')
     A                                      COLHDG('Lager' 'enhet')
     A            VHKPRI         9S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Kostpris')
     A                                      TEXT('Kostpris')
6.10 A            VHODAT    R               REFFLD(FÅODAT)
6.10 A            VHOTIM    R               REFFLD(FÅOTIM)
6.10 A            VHOUSR    R               REFFLD(FÅOUSR)
6.10 A            VHEDAT    R               REFFLD(FÅEDAT)
6.10 A            VHETIM    R               REFFLD(FÅETIM)
6.10 A            VHEUSR    R               REFFLD(FÅEUSR)
      *
      * Varegruppeknytning                  (JG)
      *
     A            VKFIRM    R               REFFLD(FÅFIRM)
     A            VKOGRP    R               REFFLD(FÅOGRP)
     A            VKHGRP    R               REFFLD(FÅHGRP)
     A            VKUGRP    R               REFFLD(FÅUGRP)
     A            VKLDOR    R               REFFLD(FÅLDOR)
     A            VKAHGR    R               REFFLD(FÅAHGR)
     A            VKAUGR    R               REFFLD(FÅAUGR)
     A            VKODAT    R               REFFLD(FÅODAT)
6.10 A            VKOTIM    R               REFFLD(FÅOTIM)
6.10 A            VKOUSR    R               REFFLD(FÅOUSR)
     A            VKEDAT    R               REFFLD(FÅEDAT)
     A            VKETIM    R               REFFLD(FÅETIM)
     A            VKEUSR    R               REFFLD(FÅEUSR)
      *
      * Etikettregister (Autom. etiketter)  (VM)
      *
     A            VMFIRM    R               REFFLD(FÅFIRM)
5.25 A            VMLAGE    R               REFFLD(FÅLAGE)
     A            VMVARE    R               REFFLD(FÅVARE)
     A            VMENHE    R               REFFLD(FÅENHE)
      *
     A            VMETYP         1S 0       TEXT('Etikett-type')
     A                                      COLHDG('Etikett' 'type')
      *
     A            VMETPR         1S 0       TEXT('Etikett-pris')
     A                                      COLHDG('Etikett' 'Pris')
      *
     A            VMFEN1         1S 0       TEXT('Etikett fra enhet1')
     A                                      COLHDG('Etikett' 'fra enh1')
      *
     A            VMFEN2         1S 0       TEXT('Etikett fra enhet2')
     A                                      COLHDG('Etikett' 'fra enh2')
      *
     A            VMSDAT          L         TEXT('Dato siste etikett')
     A                                      COLHDG('Dato siste' 'etikett')
      *
     A            VMTDAT          L         TEXT('Dato tilbud')
     A                                      COLHDG('Dato ' 'tilbud')
6.23  *
6.23 A            VMSAPR         9S 2       TEXT('Sist brukt pris')
6.23 A                                      COLHDG('Sist brukte pris')
6.23 A                                      EDTWRD('     0 ,  ')
6.23  *
6.23 A            VMGTIN        14S         TEXT('GTIN nummer')
6.23 A                                      COLHDG('GTIN nummer')
6.23 A                                      EDTCDE(Z)
6.10 A            VMODAT    R               REFFLD(FÅODAT)
6.10 A            VMOTIM    R               REFFLD(FÅOTIM)
6.10 A            VMOUSR    R               REFFLD(FÅOUSR)
6.10 A            VMEDAT    R               REFFLD(FÅEDAT)
6.10 A            VMETIM    R               REFFLD(FÅETIM)
6.10 A            VMEUSR    R               REFFLD(FÅEUSR)
      *
      * Fast tekst på etiketter             (VN)
      *
     A            VNFIRM    R               REFFLD(FÅFIRM)
      *
     A            VNVTXT        15A         TEXT('Firma-tekst')
     A                                      COLHDG('Firma-tekst')
      *
     A            VNFAS1        15A         TEXT('Fast-tekst-1')
     A                                      COLHDG('Fast-tekst-1')
      *
     A            VNFAS2        15A         TEXT('Fast-tekst-2')
     A                                      COLHDG('Fast-tekst-2')
      *
     A            VNFAS3        15A         TEXT('Fast-tekst-3')
     A                                      COLHDG('Fast-tekst-3')
      *
     A            VNFAS4        15A         TEXT('Fast-tekst-4')
     A                                      COLHDG('Fast-tekst-4')
      *
     A            VNSKTY         1S 0       TEXT('Skrivertype')
     A                                      COLHDG('Skriver' 'type')
     A                                      VALUES(0 1 2)
      *
     A            VNETYP         1S 0       TEXT('Etikettype')
     A                                      COLHDG('Etikett' 'type')
      *
     A            VNMOTK         1S 0       TEXT('Etikett Varemottak')
     A                                      COLHDG('Etikett' 'Varemot')
      *
     A            VNSORT         1S 0       TEXT('Sortering')
     A                                      COLHDG('Sortering')
6.23  *
6.23 A            VNPHOR         3S 0       TEXT('Prishorisont')
6.23 A                                      COLHDG('Prishorisont')
6.10 A            VNODAT    R               REFFLD(FÅODAT)
6.10 A            VNOTIM    R               REFFLD(FÅOTIM)
6.10 A            VNOUSR    R               REFFLD(FÅOUSR)
6.10 A            VNEDAT    R               REFFLD(FÅEDAT)
6.10 A            VNETIM    R               REFFLD(FÅETIM)
6.10 A            VNEUSR    R               REFFLD(FÅEUSR)
7.00  *
7.00  * Etikettregister (Autom. etiketter)  (VM)
7.00  *
7.00 A            VELFIR    R               REFFLD(FÅFIRM)
7.00 A            VELAGE    R               REFFLD(FÅLAGE)
7.00 A            VELVAR    R               REFFLD(FÅVARE)
7.00 A            VELENH    R               REFFLD(FÅENHE)
7.00  *
7.00 A            VELTYP         1A         TEXT('Etikett-type')
7.00 A                                      COLHDG('Etikett' 'type')
7.00  *
7.00 A            VELDAT          L         TEXT('Dato siste etikett')
7.00 A                                      COLHDG('Dato siste' 'etikett')
7.00 A            VELTIM          T         TEXT('Tid siste etikett')
7.00 A                                      COLHDG('Tid siste' 'etikett')
7.00  *
7.00 A            VELSAP         9S 2       TEXT('Sist brukt pris')
7.00 A                                      COLHDG('Sist brukte pris')
7.00 A                                      EDTWRD('     0 ,  ')
7.00  *
7.00 A            VELGTI        15A         TEXT('GTIN nummer')
7.00 A                                      COLHDG('GTIN nummer')
7.00  *
7.00 A            VELODA    R               REFFLD(FÅODAT)
7.00 A            VELOTI    R               REFFLD(FÅOTIM)
7.00 A            VELOUS    R               REFFLD(FÅOUSR)
7.00 A            VELEDA    R               REFFLD(FÅEDAT)
7.00 A            VELETI    R               REFFLD(FÅETIM)
7.00 A            VELEUS    R               REFFLD(FÅEUSR)
5.31  *
5.31  * Bruksrett-knytning                  (VB)
5.31  *
5.31 A            VBFIRM    R               REFFLD(FÅFIRM)
5.31 A            VBALME    R               REFFLD(FÅALME)
5.31 A            VBOGRP    R               REFFLD(FÅOGRP)
5.31 A            VBHGRP    R               REFFLD(FÅHGRP)
5.31 A            VBUGRP    R               REFFLD(FÅUGRP)
5.31 A            VBMODN    R               REFFLD(FÅMODN)
5.31 A            VBVARE    R               REFFLD(FÅVARE)
5.31 A            VBBRTY    R               REFFLD(FÅBRTY)
5.31 A            VBODAT    R               REFFLD(FÅODAT)
5.31 A            VBEDAT    R               REFFLD(FÅEDAT)
5.31 A            VBETIM    R               REFFLD(FÅETIM)
5.31 A            VBEUSR    R               REFFLD(FÅEUSR)
      *
      * Vare-pris-register                  (VP)
      *
     A            VPFIRM    R               REFFLD(FÅFIRM)
     A            VPVARE    R               REFFLD(FÅVARE)
6.2e A            VPLDOR    R               REFFLD(FÅLDOR)
5.70 A            VPPRGR    R               REFFLD(FÅPRGR)
     A            VPENHE    R               REFFLD(FÅENHE)
     A            VPLETY    R               REFFLD(FÅLETY)
      *
     A            VPPDAT          L         TEXT('Prisdato')
     A                                      COLHDG('Prisdato')
      *
     A            VPSAPR         9S 2       TEXT('Salgspris')
     A                                      COLHDG('Salgspris')
     A                                      EDTCDE(4)
      *
     A            VPKOPR         9S 2       TEXT('Kostpris')
     A                                      COLHDG('Kostpris')
     A                                      EDTCDE(4)
      *
     A            VPINPR         9S 2       TEXT('Innkjøpspris')
     A                                      COLHDG('Innkj.pris')
     A                                      EDTCDE(4)
6.34  *
6.34 A            VPINP2         9S 2       TEXT('Innkjøpspris 2')
6.34 A                                      COLHDG('Innkj.pris 2')
6.34 A                                      EDTCDE(4)
      *
     A            VPBUPR         9S 2       TEXT('Butikkpris')
     A                                      COLHDG('Butikkpris')
     A                                      EDTCDE(4)
      *
6.16 A            VPNOPR         9S 2       TEXT('Nobb pris')
6.16 A                                      COLHDG('Nobb pris')
6.16 A                                      EDTCDE(4)
6.2d A            VPNLEV    R               REFFLD(FÅLDOR)
6.16 A                                      TEXT('nobb Prisgiver')
6.16 A                                      COLHDG('Prisgiver')
6.2D A            VPLVAR    R               REFFLD(FÅLVAR)
8.05 A            VPKOP2         9S 2       TEXT('Kostpris 2')
8.05 A                                      COLHDG('Kost pris 2')
8.05 A                                      EDTCDE(4)
      *
6.10 A            VPODAT    R               REFFLD(FÅODAT)
6.10 A            VPOTIM    R               REFFLD(FÅOTIM)
6.10 A            VPOUSR    R               REFFLD(FÅOUSR)
     A            VPEDAT    R               REFFLD(FÅEDAT)
     A            VPETIM    R               REFFLD(FÅETIM)
     A            VPEUSR    R               REFFLD(FÅEUSR)
5.70  *
5.70  * Prisgruppe regsister                (VPG)
5.70  *
5.70 A            VPGFIR    R               REFFLD(FÅFIRM)
5.70 A            VPGLAG    R               REFFLD(FÅLAGE)
5.70 A            VPGAVD         4S 0       TEXT('Avdeling')
5.70 A                                      COLHDG('Avdeling')
5.70 A            VPGPRG    R               REFFLD(FÅPRGR)
8.05 A            VPGPRT    R               REFFLD(FÅPRGR)
8.05 A                                      TEXT('PrGr Tilbud')
8.05 A                                      COLHDG('Prisgr' 'Tilbud')
5.70 A            VPGEDA    R               REFFLD(FÅEDAT)
5.70 A            VPGETI    R               REFFLD(FÅETIM)
5.70 A            VPGEUS    R               REFFLD(FÅEUSR)
8.06  **
8.06  **  Prisforslag
8.06  **
8.06 A            VPFFIR      0003S 0
8.06 A                                      COLHDG('Firma')
8.06 A                                      TEXT('Firma')
8.06 A            VPFVAR      0015A
8.06 A                                      COLHDG('Vare')
8.06 A                                      TEXT('Vare')
8.06 A            VPFPRG    R               REFFLD(FÅPRGR)
8.06 A                                      COLHDG('Prisgr.')
8.06 A                                      TEXT('Prisgruppe')
8.06 A            VPFFDA    R               REFFLD(FÅEDAT)
8.06 A                                      COLHDG('Fra Dato')
8.06 A                                      TEXT('Fra Dato')
8.06 A            VPFTDA    R               REFFLD(FÅEDAT)
8.06 A                                      COLHDG('Til Dato')
8.06 A                                      TEXT('Til Dato')
8.06 A            VPFSKO      0010A
8.06 A                                      COLHDG('Sortimenkode')
8.06 A                                      TEXT('Sortimentkode')
8.06 A            VPFEN1      0003A
8.06 A                                      COLHDG('Enhet1')
8.06 A                                      TEXT('Enhet1')
8.06 A            VPFIN1      0009S 2
8.06 A                                      COLHDG('Innkj.pris1')
8.06 A                                      TEXT('Innkj.pris1')
8.06 A            VPFKO1      0009S 2
8.06 A                                      COLHDG('Kost.pris1')
8.06 A                                      TEXT('Kost.pris1')
8.06 A            VPFOR1      0009S 2
8.06 A                                      COLHDG('Prisforslag1')
8.06 A                                      TEXT('Prisforslag1')
8.06 A            VPFEN2      0003A
8.06 A                                      COLHDG('Enhet 2')
8.06 A                                      TEXT('Sortimentkode')
8.06 A            VPFIN2      0009S 2
8.06 A                                      COLHDG('Innkj.pris2')
8.06 A                                      TEXT('Innkj.pris2')
8.06 A            VPFKO2      0009S 2
8.06 A                                      COLHDG('Kost.pris2')
8.06 A                                      TEXT('Kost.pris2')
8.06 A            VPFOR2      0009S 2
8.06 A                                      COLHDG('Prisforslag2')
8.06 A                                      TEXT('Prisforslag2')
8.06 A            VPFEN3      0003A
8.06 A                                      COLHDG('Enhet 3')
8.06 A                                      TEXT('Enhet 3')
8.06 A            VPFIN3      0009S 2
8.06 A                                      COLHDG('Innkj.pris3')
8.06 A                                      TEXT('Innkj.pris3')
8.06 A            VPFKO3      0009S 2
8.06 A                                      COLHDG('Kost.pris3')
8.06 A                                      TEXT('Kost.pris3')
8.06 A            VPFOR3      0009S 2
8.06 A                                      COLHDG('Prisforslag3')
8.06 A                                      TEXT('Prisforslag3')
8.06 A            VPFVER      0015S 0
8.06 A                                      COLHDG('Solveversjon')
8.06 A                                      TEXT('Solveversjon')
8.06 A            VPFFID      0015S 0
8.06 A                                      COLHDG('X-TABELL IDn')
8.06 A                                      TEXT('X-TABELL -ID')
8.06 A            VPFTMS          Z         TEXT('Solve timestmp')
8.06 A                                      COLHDG('Solve timest')
8.06 A            VPFODA    R               REFFLD(FÅEDAT)
8.06 A            VPFOTI    R               REFFLD(FÅETIM)
8.06 A            VPFEDA    R               REFFLD(FÅEDAT)
8.06 A            VPFETI    R               REFFLD(FÅETIM)
8.06 A            VPFEUS    R               REFFLD(FÅEUSR)
      *
      * Vare-plakat                         (VR)
      *
     A            VRFIRM    R               REFFLD(FÅFIRM)
     A            VRVARE    R               REFFLD(FÅVARE)
     A            VRTYPE         5A         TEXT('Plakattype')
     A                                      COLHDG('Plakattype')
     A            VRFORM         2A         TEXT('Format')
     A                                      COLHDG('Format')
      *                                     A3
      *                                     A4
      *                                     A5
      *                                     A6
     A            VRPNAV        35A         TEXT('Produsentnavn')
     A                                      COLHDG('Produsentnavn')
     A            VRMERK        35A         TEXT('Merke')
     A                                      COLHDG('Merke')
     A            VRTEK1        35A         TEXT('Produkttekst 1')
     A                                      COLHDG('Produkttekst 1')
     A            VRTEK2        35A         TEXT('Produkttekst 2')
     A                                      COLHDG('Produkttekst 2')
     A            VRTEK3        35A         TEXT('Produkttekst 3')
     A                                      COLHDG('Produkttekst 3')
     A            VRTEK4        35A         TEXT('Produkttekst 4')
     A                                      COLHDG('Produkttekst 4')
     A            VRTEK5        35A         TEXT('Produkttekst 5')
     A                                      COLHDG('Produkttekst 5')
     A            VRTEK6        35A         TEXT('Produkttekst 6')
     A                                      COLHDG('Produkttekst 6')
     A            VRBES1        35A         TEXT('Beskrivelse 1')
     A                                      COLHDG('Beskrivelse 1')
     A            VRBES2        35A         TEXT('Beskrivelse 2')
     A                                      COLHDG('Beskrivelse 2')
     A            VRBES3        35A         TEXT('Beskrivelse 3')
     A                                      COLHDG('Beskrivelse 3')
     A            VRENHE         3A         TEXT('Enhet')
     A                                      COLHDG('Enh')
     A            VRPRIS         9S 2       TEXT('Plakatpris')
     A                                      COLHDG('Plakatpris')
     A                                      EDTCDE(4)
     A            VRODAT    R               REFFLD(FÅEDAT)
     A            VREDAT    R               REFFLD(FÅEDAT)
     A            VRETIM    R               REFFLD(FÅETIM)
     A            VREUSR    R               REFFLD(FÅEUSR)
      *
      * Søketekst-register                  (VS)
      *
     A            VSFIRM    R               REFFLD(FÅFIRM)
     A            VSVARE    R               REFFLD(FÅVARE)
     A            VSSTEK        35A         TEXT('Søketekst')
     A                                      COLHDG('Søketekst')
      *
      * Tilbudspris-register                (VT)
      *
     A            VTFIRM    R               REFFLD(FÅFIRM)
6.2g A            VTOGRP    R               REFFLD(FÅOGRP)
6.2g A            VTHGRP    R               REFFLD(FÅHGRP)
6.2g A            VTUGRP    R               REFFLD(FÅUGRP)
6.2g A            VTLDOR    R               REFFLD(FÅLDOR)
     A            VTVARE    R               REFFLD(FÅVARE)
5.70 A            VTPRGR    R               REFFLD(FÅPRGR)
     A            VTLETY    R               REFFLD(FÅLETY)
      *
     A            VTFDAT          L         TEXT('Fra-dato')
     A                                      COLHDG('Fra-dato')
      *
     A            VTFTIM          T         TEXT('Fra-tid')
     A                                      COLHDG('Fra-tid')
      *
     A            VTTDAT          L         TEXT('Til-dato')
     A                                      COLHDG('Til-dato')
      *
     A            VTTTIM          T         TEXT('Til-tid')
     A                                      COLHDG('Til-tid')
      *
     A            VTKAMP    R               REFFLD(FÅKAMP)
      *
     A            VTENH1         3          TEXT('Enhet-1')
     A                                      COLHDG('Enh-1')
      *
     A            VTTIP1         9S 2       TEXT('Tilbudspris enhet-1')
     A                                      COLHDG('Tilb.pris' 'enhet-1')
     A                                      EDTCDE(4)
      *
     A            VTKOP1         9S 2       TEXT('Kostpris enhet-1')
     A                                      COLHDG('Kostpris' 'enhet-1')
     A                                      EDTCDE(4)
      *
     A            VTPRO1         4S 2       TEXT('Prosentsats  enhet-1')
     A                                      COLHDG('Pros.sats' 'enhet-1')
     A                                      EDTCDE(4)
      *
     A            VTENH2         3          TEXT('Enhet-2')
     A                                      COLHDG('Enh-2')
      *
     A            VTTIP2         9S 2       TEXT('Tilbudspris enhet-2')
     A                                      COLHDG('Tilb.pris' 'enhet-2')
     A                                      EDTCDE(4)
      *
     A            VTKOP2         9S 2       TEXT('Kostpris enhet-2')
     A                                      COLHDG('Kostpris' 'enhet-2')
     A                                      EDTCDE(4)
      *
     A            VTENH3         3          TEXT('Enhet-3')
     A                                      COLHDG('Enh-3')
      *
     A            VTTIP3         9S 2       TEXT('Tilbudspris enhet-3')
     A                                      COLHDG('Tilb.pris' 'enhet-3')
     A                                      EDTCDE(4)
      *
     A            VTKOP3         9S 2       TEXT('Kostpris enhet-3')
     A                                      COLHDG('Kostpris' 'enhet-3')
     A                                      EDTCDE(4)
6.2L  *
6.2L A            VTINP1      0009S 2
6.2L A                                      EDTCDE(4)
6.2L A                                      COLHDG('Innkjøpspris' 'enhet-1')
6.2L A                                      TEXT('Innkjøpspris enhet-1')
6.2L  *
6.2L A            VTINP2      0009S 2
6.2L A                                      EDTCDE(4)
6.2L A                                      COLHDG('Innkjøpspris' 'enhet-2')
6.2L A                                      TEXT('Innkjøpspris enhet-2')
6.2L  *
6.2L A            VTINP3      0009S 2
6.2L A                                      EDTCDE(4)
6.2L A                                      COLHDG('Innkjøpspris' 'enhet-3')
6.2L A                                      TEXT('Innkjøpspris enhet-3')
      *
      *
6.10 A            VTODAT    R               REFFLD(FÅODAT)
6.10 A            VTOTIM    R               REFFLD(FÅOTIM)
6.10 A            VTOUSR    R               REFFLD(FÅOUSR)
     A            VTEDAT    R               REFFLD(FÅEDAT)
     A            VTETIM    R               REFFLD(FÅETIM)
     A            VTEUSR    R               REFFLD(FÅEUSR)
6.3F  *
6.3F  * Kundeklubb-register                (VTK)
6.3F  *
6.3F A            VTKFIR    R               REFFLD(FÅFIRM)
6.3F A            VTKOGR    R               REFFLD(FÅOGRP)
6.3F A            VTKHGR    R               REFFLD(FÅHGRP)
6.3F A            VTKUGR    R               REFFLD(FÅUGRP)
6.3F A            VTKLDO    R               REFFLD(FÅLDOR)
6.3F A            VTKVAR    R               REFFLD(FÅVARE)
6.3F A            VTKPRG    R               REFFLD(FÅPRGR)
6.3F A            VTKLET    R               REFFLD(FÅLETY)
6.3F  *
6.3F A            VTKFDA          L         TEXT('Fra-dato')
6.3F A                                      COLHDG('Fra-dato')
6.3F  *
6.3F A            VTKFTI          T         TEXT('Fra-tid')
6.3F A                                      COLHDG('Fra-tid')
6.3F  *
6.3F A            VTKTDA          L         TEXT('Til-dato')
6.3F A                                      COLHDG('Til-dato')
6.3F  *
6.3F A            VTKTTI          T         TEXT('Til-tid')
6.3F A                                      COLHDG('Til-tid')
6.3F  *
6.3F A            VTKKAM    R               REFFLD(FÅKAMP)
6.3F  *
6.3F A            VTKEN1         3          TEXT('Enhet-1')
6.3F A                                      COLHDG('Enh-1')
6.3F  *
6.3F A            VTKTI1         9S 2       TEXT('Tilbudspris enhet-1')
6.3F A                                      COLHDG('Tilb.pris' 'enhet-1')
6.3F A                                      EDTCDE(4)
6.3F  *
6.3F A            VTKKO1         9S 2       TEXT('Kostpris enhet-1')
6.3F A                                      COLHDG('Kostpris' 'enhet-1')
6.3F A                                      EDTCDE(4)
6.3F  *
6.3F A            VTKPR1         4S 2       TEXT('Prosentsats  enhet-1')
6.3F A                                      COLHDG('Pros.sats' 'enhet-1')
6.3F A                                      EDTCDE(4)
6.3F  *
6.3F A            VTKEN2         3          TEXT('Enhet-2')
6.3F A                                      COLHDG('Enh-2')
6.3F  *
6.3F A            VTKTI2         9S 2       TEXT('Tilbudspris enhet-2')
6.3F A                                      COLHDG('Tilb.pris' 'enhet-2')
6.3F A                                      EDTCDE(4)
6.3F  *
6.3F A            VTKKO2         9S 2       TEXT('Kostpris enhet-2')
6.3F A                                      COLHDG('Kostpris' 'enhet-2')
6.3F A                                      EDTCDE(4)
6.3F  *
6.3F A            VTKEN3         3          TEXT('Enhet-3')
6.3F A                                      COLHDG('Enh-3')
6.3F  *
6.3F A            VTKTI3         9S 2       TEXT('Tilbudspris enhet-3')
6.3F A                                      COLHDG('Tilb.pris' 'enhet-3')
6.3F A                                      EDTCDE(4)
6.3F  *
6.3F A            VTKKO3         9S 2       TEXT('Kostpris enhet-3')
6.3F A                                      COLHDG('Kostpris' 'enhet-3')
6.3F A                                      EDTCDE(4)
6.3F  *
6.3F A            VTKIN1      0009S 2
6.3F A                                      EDTCDE(4)
6.3F A                                      COLHDG('Innkjøpspris' 'enhet-1')
6.3F A                                      TEXT('Innkjøpspris enhet-1')
6.3F  *
6.3F A            VTKIN2      0009S 2
6.3F A                                      EDTCDE(4)
6.3F A                                      COLHDG('Innkjøpspris' 'enhet-2')
6.3F A                                      TEXT('Innkjøpspris enhet-2')
6.3F  *
6.3F A            VTKIN3      0009S 2
6.3F A                                      EDTCDE(4)
6.3F A                                      COLHDG('Innkjøpspris' 'enhet-3')
6.3F A                                      TEXT('Innkjøpspris enhet-3')
6.3F  *
6.3F  *
6.3F A            VTKODA    R               REFFLD(FÅODAT)
6.3F A            VTKOTI    R               REFFLD(FÅOTIM)
6.3F A            VTKOUS    R               REFFLD(FÅOUSR)
6.3F A            VTKEDA    R               REFFLD(FÅEDAT)
6.3F A            VTKETI    R               REFFLD(FÅETIM)
6.3F A            VTKEUS    R               REFFLD(FÅEUSR)
8.07  *
8.07  * Tilbud koblingstabell rabkat/kundkat (VTO)
8.07  *
8.07 A            VTOFIR    R               REFFLD(FÅFIRM)
8.07 A            VTOKAM    R               REFFLD(FÅKAMP)
8.07 A            VTOKKA    R               REFFLD(FÅKKAT)
8.07 A            VTORKA    R               REFFLD(FÅRKAT)
8.07 A            VTOODA    R               REFFLD(FÅODAT)
8.07 A            VTOOTI    R               REFFLD(FÅOTIM)
8.07 A            VTOOUS    R               REFFLD(FÅOUSR)
8.07 A            VTOEDA    R               REFFLD(FÅEDAT)
8.07 A            VTOETI    R               REFFLD(FÅETIM)
8.07 A            VTOEUS    R               REFFLD(FÅEUSR)
5.04  *
5.04  * Struktur-varer                      (VU)
5.04  *
5.04 A            VUFIRM    R               REFFLD(FÅFIRM)
6.15 A            VUVARE        15A         TEXT('Hovedvare')
5.04 A                                      COLHDG('Hoved' 'vare')
6.15 A**                                    EDTCDE(Z)
6.15 A            VUVARS        15A         TEXT('Strukturvare')
5.04 A                                      COLHDG('Struktur' 'vare')
6.15 A**                                    EDTCDE(Z)
5.04 A            VUBESK    R               REFFLD(FÅBESK)
5.04 A            VUANTA    R               REFFLD(FÅANTA)
5.04 A                                      COMP(LT 99999999)
5.04 A                                      CHKMSGID(FMD0640 *LIBL/QMFOFAK)
6.15 A            VUENHE         3A         TEXT('Enhet')
6.15 A                                      COLHDG('Enhet')
6.15 A            VUKSTR         1A         TEXT('Konstuksjonsvare')
6.15 A                                      COLHDG('Kons.vare')
6.15 A            VUAVAR        15A         TEXT('Alternativ vare')
6.15 A                                      COLHDG('Alt.' 'vare')
5.04 A            VUODAT    R               REFFLD(FÅODAT)
6.10 A            VUOTIM    R               REFFLD(FÅOTIM)
6.10 A            VUOUSR    R               REFFLD(FÅOUSR)
5.04 A            VUEDAT    R               REFFLD(FÅEDAT)
5.04 A            VUETIM    R               REFFLD(FÅETIM)
5.04 A            VUEUSR    R               REFFLD(FÅEUSR)
      *
      * Vare-register                       (VV)
      *
     A            VVFIRM    R               REFFLD(FÅFIRM)
     A            VVVARE    R               REFFLD(FÅVARE)
     A            VVOGRP    R               REFFLD(FÅOGRP)
     A            VVHGRP    R               REFFLD(FÅHGRP)
     A            VVUGRP    R               REFFLD(FÅUGRP)
     A            VVTEK1    R               REFFLD(FÅTEK1)
     A            VVTEK2    R               REFFLD(FÅTEK2)
     A            VVLDOR    R               REFFLD(FÅLDOR)
     A            VVLVAR    R               REFFLD(FÅLVAR)
     A            VVNOBB    R               REFFLD(FÅNOBB)
5.24 A            VVNMOD    R               REFFLD(FÅMODN)
      *
     A            VVNLEV         6S 0       TEXT('Nobb prisgiv.')
     A                                      COLHDG('Nobb' 'prisgiv.')
     A                                      EDTCDE(Z)
      *
     A            VVKPRI    R               REFFLD(FÅKPRI)
     A            VVVTYP    R               REFFLD(FÅVTYP)
     A            VVKHEV    R               REFFLD(FÅKHEV)
     A            VVPRAN    R               REFFLD(FÅPRAN)
      *
     A            VVENHE         3A         TEXT('Basisenhet')
     A                                      COLHDG('Basis' 'enhet')
      *
     A            VVAHGR    R               REFFLD(FÅAHGR)
     A            VVAUGR    R               REFFLD(FÅAUGR)
      *
     A            VVAVAR        15A         TEXT('Alt. varenr')
     A                                      COLHDG('Alt. varenr')
      *
     A            VVDESI         1S 0       TEXT('Antall desimaler')
     A                                      COLHDG('Ant.' 'des.')
     A                                      EDTCDE(Z)
      *
     A            VVKFRI         5A         TEXT('Frie koder')
     A                                      COLHDG('Frie' 'koder')
      *
     A            VVFAKO         9S 2       TEXT('Fri faktor')
     A                                      COLHDG('Fri' 'faktor')
     A                                      EDTCDE(M)
      *
     A            VVKJUS         1S 0       TEXT('Prisjusteringskode')
     A                                      COLHDG('Prisjust.' 'kode')
     A                                      EDTCDE(3)
      *
     A            VVKPDI         1S 0       TEXT('Prisdistr.kode')
     A                                      COLHDG('Prisdistr.' 'kode')
     A                                      EDTCDE(3)
      *
     A            VVKBON         1S 0       TEXT('Bonuskode')
     A                                      COLHDG('Bonus' 'kode')
     A                                      EDTCDE(3)
      *
     A            VVKORD         1S 0       TEXT('Ordrerabattkode')
     A                                      COLHDG('Ordrerab.' 'kode')
     A                                      EDTCDE(3)
      *
     A            VVKENH         1A         TEXT('Enhetskode')
     A                                      COLHDG('Enhets' 'kode')
5.50 A***                                   Fjernet fra vedl.program
      *
     A            VVKMVA         1S 0       TEXT('Mva-kode')
     A                                      COLHDG('Mva' 'kode')
     A                                      EDTCDE(3)
      *
     A            VVKRES         1S 0       TEXT('Restkode')
     A                                      COLHDG('Rest' 'kode')
     A                                      EDTCDE(3)
      *
     A            VVKSTR         2S 0       TEXT('Strukturkode')
     A                                      COLHDG('Struktur' 'kode')
     A                                      EDTCDE(3)
      *
     A            VVKABC         2A         TEXT('ABC-kode')
     A                                      COLHDG('ABC' 'kode')
      *
     A            VVLABC         1S 0       TEXT('Lås ABC-kode')
     A                                      COLHDG('Lås' 'ABC')
     A                                      EDTCDE(3)
      *
     A            VVKPME         1A         TEXT('Mengde til prosj')
     A                                      COLHDG('Mengde til prosj')
5.50 A***                                   Fjernet fra vedl.program
      *
     A            VVKETI         1S 0       TEXT('Etikettkode')
     A                                      COLHDG('Etikett' 'kode')
     A                                      EDTCDE(3)
      *
     A            VVKMIL         1A         TEXT('Miljømerke-kode')
     A                                      COLHDG('Miljø' 'kode')
      *
     A            VVDEKN         5S 2       TEXT('Dekningsgrad')
     A                                      COLHDG('DG')
     A                                      EDTCDE(M)
      *
     A            VVNOPR         9S 2       TEXT('Nobb-pris')
     A                                      COLHDG('Nobb-pris')
     A                                      EDTCDE(4)
      *
     A            VVOMRN        12S 6       TEXT('Omr.faktor nominell')
     A                                      COLHDG('Omr.faktor' 'nominell')
     A                                      EDTCDE(4)
      *
     A            VVMINI        11S 3       TEXT('Minimumsbeh.')
     A                                      COLHDG('Min.' 'beholdn.')
     A                                      EDTCDE(M)
      *
     A            VVMAKS        11S 3       TEXT('Maksimumsbeh.')
     A                                      COLHDG('Maks.' 'beholdn.')
     A                                      EDTCDE(M)
      *
     A            VVPLAS         6A         TEXT('Lagerplass')
     A                                      COLHDG('Lager' 'plass')
      *
     A            VVLTID         3S 0       TEXT('Leveringstid')
     A                                      COLHDG('Lev.' 'tid')
     A                                      EDTCDE(Z)
      *
     A            VVBPUN        11S 3       TEXT('Bestillingspunkt')
     A                                      COLHDG('Best.' 'punkt')
     A                                      EDTCDE(M)
      *
     A            VVBMEN        11S 3       TEXT('Best. mengde')
     A                                      COLHDG('Best.' 'mengde')
     A                                      EDTCDE(M)
      *
     A            VVANBR        11S 3       TEXT('Anbrekk')
     A                                      COLHDG('Anbrekk')
     A                                      EDTCDE(M)
      *
     A            VVSIKL        11S 3       TEXT('Sikkerhetslager')
     A                                      COLHDG('Sikk.' 'lager')
     A                                      EDTCDE(M)
      *
     A            VVGODJ         1S 0       TEXT('Godkj. innkjøp')
     A                                      COLHDG('Godkj.' 'innkjøp')
     A                                      EDTCDE(3)
      *
5.24 A            VVCRDO    R               REFFLD(FÅCRDO)
      *
     A            VVENHS         3A         TEXT('Statistikkenhet')
     A                                      COLHDG('Stat.' 'enhet')
      *
     A            VVENHL         3A         TEXT('Lagerenhet')
     A                                      COLHDG('Lager' 'enhet')
      *
     A            VVENPS         3A         TEXT('Prissammenlignings-enhet1')
     A                                      COLHDG('Prissammenlign.' 'enhet 1')
      *
6.13 A            VVSORT        10A         TEXT('Kjedesortiment')
6.13 A                                      COLHDG('Kjede' 'Sortiment')
      *
5.24 A            VVNUDA          L         TEXT('Nobb utgår dato')
5.24 A                                      COLHDG('Nobb' 'utgår' 'dato')
      *
     A            VVUDAT          L         TEXT('Utgår dato')
     A                                      COLHDG('Utgår' 'dato')
      *
5.24 A            VVODAT    R               REFFLD(FÅODAT)
6.10 A            VVOTIM    R               REFFLD(FÅOTIM)
6.10 A            VVOUSR    R               REFFLD(FÅOUSR)
     A            VVEDAT    R               REFFLD(FÅEDAT)
     A            VVETIM    R               REFFLD(FÅETIM)
     A            VVEUSR    R               REFFLD(FÅEUSR)
6.18  *
6.18  * Språktekster på varer               (VVT)
6.18  *
6.18 A            VVTFIR    R               REFFLD(FÅFIRM)
6.18 A            VVTVAR    R               REFFLD(FÅVARE)
6.18 A            VVTSPR         1S 0       TEXT('Språkkode')
6.18 A                                      COLHDG('Språkkode')
6.18 A                                      EDTCDE(Z)
6.18 A            VVTTE1    R               REFFLD(FÅTEK1)
6.18 A            VVTTE2    R               REFFLD(FÅTEK2)
6.18 A            VVTODA    R               REFFLD(FÅODAT)
6.18 A            VVTOTI    R               REFFLD(FÅOTIM)
6.18 A            VVTOUS    R               REFFLD(FÅOUSR)
6.18 A            VVTEDA    R               REFFLD(FÅEDAT)
6.18 A            VVTETI    R               REFFLD(FÅETIM)
6.18 A            VVTEUS    R               REFFLD(FÅEUSR)
      *
      * Alternativ vare                     (VVA)
      *
     A            VVAFIR    R               REFFLD(FÅFIRM)
     A            VVANOB    R               REFFLD(FÅNOBB)
     A            VVAAVA    R               REFFLD(FÅVARE)
     A            VVAODA    R               REFFLD(FÅODAT)
6.10 A            VVAOTI    R               REFFLD(FÅOTIM)
6.10 A            VVAOUS    R               REFFLD(FÅOUSR)
     A            VVAEDA    R               REFFLD(FÅEDAT)
     A            VVAETI    R               REFFLD(FÅETIM)
     A            VVAEUS    R               REFFLD(FÅEUSR)
6.3g  *
6.3g  * Vare-leverandør                     (VVL)
6.3g  *
6.3g A            VVLFIR    R               REFFLD(FÅFIRM)
6.3g A            VVLVNR    R               REFFLD(FÅVARE)
6.3g A            VVLLDO    R               REFFLD(FÅLDOR)
6.3g A            VVLNOB    R               REFFLD(FÅNOBB)
6.3g A            VVLLVA    R               REFFLD(FÅLVAR)
6.3g A            VVLMOD    R               REFFLD(FÅMODN)
6.3g A            VVLNLE    R               REFFLD(FÅLDOR)
6.3g A            VVLUDA    R               REFFLD(FÅODAT)
6.3g A            VVLODA    R               REFFLD(FÅODAT)
6.3g A            VVLOTI    R               REFFLD(FÅOTIM)
6.3g A            VVLOUS    R               REFFLD(FÅOUSR)
6.3g A            VVLEDA    R               REFFLD(FÅEDAT)
6.3g A            VVLETI    R               REFFLD(FÅETIM)
6.3g A            VVLEUS    R               REFFLD(FÅEUSR)
      *
      * Vare-søketekst-register             (VVS)
      *
     A            VVSFIR    R               REFFLD(FÅFIRM)
     A            VVSVAR    R               REFFLD(FÅVARE)
     A            VVSOGR    R               REFFLD(FÅOGRP)
     A            VVSHGR    R               REFFLD(FÅHGRP)
     A            VVSUGR    R               REFFLD(FÅUGRP)
6.3G A            VVSTEK       400          TEXT('Søketekst')
6.3G A                                      COLHDG('Søketekst')
      *
      * Vare-erstatnings-register            (VVE)
      *
     A            VVEFIR    R               REFFLD(FÅFIRM)
     A            VVENVR    R               REFFLD(FÅVARE)
     A                                      TEXT('Nytt varenr')
     A                                      COLHDG('Nytt varenr')
     A            VVEGVR    R               REFFLD(FÅVARE)
     A                                      TEXT('Gammelt varenr')
     A                                      COLHDG('Gml. varenr')
     A            VVEGTX    R               REFFLD(FÅTEK1)
     A                                      TEXT('Gammelt varetekst')
     A                                      COLHDG('Gml. varetekst')
6.30 A            VVFIDT    R               REFFLD(FÅODAT)
6.30 A                                      TEXT('Første innkjøpsdato')
6.30 A                                      COLHDG('Første innkj.dto')
6.30 A                                      DFT('0001-01-01')
6.30 A            VVSIDT    R               REFFLD(FÅODAT)
6.30 A                                      TEXT('Siste innkjøpsdato')
6.30 A                                      COLHDG('Siste innkj.dto')
6.30 A                                      DFT('0001-01-01')
6.30 A            VVOMRE        12S 6       TEXT('Omr.faktor')
6.30 A                                      COLHDG('Omr.faktor')
6.30 A                                      EDTCDE(4)
6.30 A            VVANTB         6S 0       TEXT('Antall på best.forslag')
6.30 A                                      COLHDG('Ant besfor.')
6.30 A                                      EDTCDE(Z)
      *
     A            VVEODA    R               REFFLD(FÅODAT)
6.10 A            VVEOTI    R               REFFLD(FÅOTIM)
6.10 A            VVEOUS    R               REFFLD(FÅOUSR)
     A            VVEEDA    R               REFFLD(FÅEDAT)
     A            VVEETI    R               REFFLD(FÅETIM)
     A            VVEEUS    R               REFFLD(FÅEUSR)
      *
      * Ean-nummer-register                 (VX)
      *
     A            VXFIRM    R               REFFLD(FÅFIRM)
     A            VXEANN    R               REFFLD(FÅEANN)
     A            VXVARE    R               REFFLD(FÅVARE)
     A            VXENHE    R               REFFLD(FÅENHE)
      *
     A            VXTIME          Z         TEXT('Opprettet tidspunkt')
     A                                      COLHDG('Opprettet' 'tidspunkt')
      *
6.10 A            VXODAT    R               REFFLD(FÅODAT)
6.10 A            VXOTIM    R               REFFLD(FÅOTIM)
6.10 A            VXOUSR    R               REFFLD(FÅOUSR)
     A            VXEDAT    R               REFFLD(FÅEDAT)
     A            VXETIM    R               REFFLD(FÅETIM)
     A            VXEUSR    R               REFFLD(FÅEUSR)
      *
      * Leveringstype-register              (VY)
      *
     A            VYFIRM    R               REFFLD(FÅFIRM)
     A            VYLETY    R               REFFLD(FÅLETY)
     A            VYBESK    R               REFFLD(FÅBESK)
6.10 A            VYODAT    R               REFFLD(FÅODAT)
6.10 A            VYOTIM    R               REFFLD(FÅOTIM)
6.10 A            VYOUSR    R               REFFLD(FÅOUSR)
     A            VYEDAT    R               REFFLD(FÅEDAT)
     A            VYETIM    R               REFFLD(FÅETIM)
     A            VYEUSR    R               REFFLD(FÅEUSR)
      *
      * Lager-register                      (VL)
      *
     A            VLFIRM    R               REFFLD(FÅFIRM)
      *
     A            VLVARE    R               REFFLD(FÅVARE)
     A            VLLAGE    R               REFFLD(FÅLAGE)
      *
5.51 A            VLPLAS         8A         TEXT('Lagerplass')
     A                                      COLHDG('Lagerpl.')
      *
6.10 A            VLPLA1         8A         TEXT('Alt.lagerpl.1')
     A                                      COLHDG('Alt.pl.1')
      *
6.10 A            VLPLA2         8A         TEXT('Alt.lagerpl.2')
     A                                      COLHDG('Alt.pl.2')
      *
     A            VLENHL         3A         TEXT('Lagerenhet')
     A                                      COLHDG('Lager' 'enhet')
5.56  *
5.56 A            VLATEL         3S 0       TEXT('Antall tellinger')
5.56 A                                      COLHDG('Antall tell.')
5.56 A                                      EDTCDE(Z)
      *
     A            VLPAKK        11S 3       TEXT('I Pakkseddel HIÅ')
     A                                      COLHDG('I Pakks. HIÅ')
     A                                      EDTCDE(M)
      *
     A            VLOORD        11S 3       TEXT('I Ordre      HIÅ')
     A                                      COLHDG('I Ordre  HIÅ')
     A                                      EDTCDE(M)
      *
     A            VLORES        11S 3       TEXT('I Ordre rest HIÅ')
     A                                      COLHDG('I rest   HIÅ')
     A                                      EDTCDE(M)
      *
     A            VLBBES        11S 3       TEXT('I Bestilling HIÅ')
     A                                      COLHDG('I Best.  HIÅ')
     A                                      EDTCDE(M)
      *
     A            VLBRES        11S 3       TEXT('I Bestilling res')
     A                                      COLHDG('I Best.  res')
     A                                      EDTCDE(M)
      *
     A            VLINNG        11S 3       TEXT('Inngang      HIÅ')
     A                                      COLHDG('Inngang  HIÅ')
     A                                      EDTCDE(M)
      *
     A            VLUTTA        11S 3       TEXT('Uttak        HIÅ')
     A                                      COLHDG('Uttak    HIÅ')
     A                                      EDTCDE(M)
      *
     A            VLJUST        11S 3       TEXT('Justering    HIÅ')
     A                                      COLHDG('Just.    HIÅ')
     A                                      EDTCDE(M)
      *
     A            VLTELL        11S 3       TEXT('Telle avvik  HIÅ')
     A                                      COLHDG('Telleavv.HIÅ')
     A                                      EDTCDE(M)
      *
     A            VLSALG        11S 3       TEXT('Salg         HIÅ')
     A                                      COLHDG('Salg     HIÅ')
     A                                      EDTCDE(M)
      *
     A            VLRETU        11S 3       TEXT('Retur        HIÅ')
     A                                      COLHDG('Retur    HIÅ')
     A                                      EDTCDE(M)
      *
     A            VLB101        11S 3       TEXT('Antall, pr. 1/1')
     A                                      COLHDG('Antall' 'pr. 1/1')
     A                                      EDTCDE(M)
      *
     A            VLBEHL        11S 3       TEXT('Beholdning   HIÅ')
     A                                      COLHDG('Beholdn. HIÅ')
     A                                      EDTCDE(M)
      *
     A            VLBEVE        11S 3       TEXT('Bevegelse ant.IÅ')
     A                                      COLHDG('Bev.  ant.IÅ')
     A                                      EDTCDE(M)
      *
     A            VLKPNY         9S 2       TEXT('Bergn. kostpris')
     A                                      COLHDG('Bergn.' 'kostpris')
     A                                      EDTCDE(M)
      *
     A            VLKPGJ         9S 2       TEXT('Gj.sn. kostpris')
     A                                      COLHDG('Gj.sn.' 'kostpris')
     A                                      EDTCDE(M)
      *
     A            VLMINI        11S 3       TEXT('Minimumsbeh.')
     A                                      COLHDG('Min.' 'beholdn.')
     A                                      EDTCDE(M)
      *
     A            VLMINL        11S 3       TEXT('Minimumsbeh. Lev.')
     A                                      COLHDG('Min.' 'beh. lev.')
     A                                      EDTCDE(M)
      *
     A            VLMAKS        11S 3       TEXT('Maksimumsbeh.')
     A                                      COLHDG('Maks.' 'beholdn.')
     A                                      EDTCDE(M)
      *
     A            VLLTID         3S 0       TEXT('Leveringstid')
     A                                      COLHDG('Lev.' 'tid')
     A                                      EDTCDE(Z)
      *
     A            VLBPUN        11S 3       TEXT('Bestillingspunkt')
     A                                      COLHDG('Best.' 'punkt')
     A                                      EDTCDE(M)
      *
     A            VLBMIN        11S 3       TEXT('Minimumsbest.')
     A                                      COLHDG('Min.' 'best.')
     A                                      EDTCDE(M)
      *
     A            VLBMEN        11S 3       TEXT('Best. mengde')
     A                                      COLHDG('Best.' 'mengde'    )
     A                                      EDTCDE(M)
      *
     A            VLSIKL        11S 3       TEXT('Sikkerhetslager')
     A                                      COLHDG('Sikkerhets' 'lager')
     A                                      EDTCDE(M)
      *
     A            VLGJLH         5S 2       TEXT('Gjnnomløpshatighet')
     A                                      COLHDG('Gjennomløps' 'hastighet')
     A                                      EDTCDE(M)
      *
     A            VLTRDA          L         TEXT('Siste trans.dato')
     A                                      COLHDG('Siste' 'trans.dato')
      *
     A            VLOPDA          L         TEXT('Siste oppt.dato')
     A                                      COLHDG('Siste' 'oppt.dato')
      *
     A            VLSDAT          L         TEXT('Siste salgsdato')
     A                                      COLHDG('Siste' 'salgsdato')
      *
5.55 A            VLKABC         2A         TEXT('ABC-kode')
5.55 A                                      COLHDG('ABC' 'kode')
5.67  *
5.67 A            VLLABC         1S 0       TEXT('Lås ABC-kode')
5.67 A                                      COLHDG('Lås' 'ABC')
     A                                      EDTCDE(3)
      *
6.10 A            VLTABC         2A         TEXT('ABC-telle')
6.10 A                                      COLHDG('ABC' 'telle')
      *
5.62 A            VLEETK         1S 0       TEXT('Elektronisk Etikett')
5.62 A                                      COLHDG('Elektr' 'Etikett')
      *
6.62 A            VLPDAT    R               REFFLD(FÅODAT)
5.62 A                                      TEXT('Oppdatert fra prognose')
5.62 A                                      COLHDG('Oppd.' 'Prognose')
5.70  *
5.70 A            VLVTYP    R               REFFLD(FÅVTYP)
6.29 A            VLSTDA    R               REFFLD(FÅODAT)
6.29 A                                      TEXT('Sperret til dato')
6.29 A                                      COLHDG('Sperret''Til dato')
6.2Y A                                      DFT('0001-01-01')
6.29 A            VLUDAT    R               REFFLD(FÅODAT)
6.29 A                                      TEXT('Utgått dato')
6.29 A                                      COLHDG('Utg.''dato')
6.29 A                                      DFT('0001-01-01')
6.29 A            VLBLDO    R               REFFLD(FÅLDOR)
6.29 A                                      TEXT('Bestillings leverandør')
6.29 A                                      COLHDG('Best.''Leverandør')
6.2Ø A            VLFEDA    R               REFFLD(FÅODAT)
6.2Ø A                                      DFT('0001-01-01')
6.2Ø A                                      TEXT('Faste data endr.dato')
6.2Ø A                                      COLHDG('Faste''endr.dato')
6.2Ø A            VLFETI    R               REFFLD(FÅOTIM)
6.2Ø A            VLFEUS    R               REFFLD(FÅOUSR)
6.2Ø A                                      TEXT('Faste data endr.av')
6.2Ø A                                      COLHDG('Faste''endr.av')
     A            VLODAT    R               REFFLD(FÅODAT)
6.10 A            VLOTIM    R               REFFLD(FÅOTIM)
6.10 A            VLOUSR    R               REFFLD(FÅOUSR)
     A            VLEDAT    R               REFFLD(FÅEDAT)
     A            VLETIM    R               REFFLD(FÅETIM)
     A            VLEUSR    R               REFFLD(FÅEUSR)
      *
      * Parameterregister                   (VW)
      *
     A            VWPFIR    R               REFFLD(FÅFIRM)
      *
     A            VWPREC       252A
     A                                      COLHDG('Fast = BLANK  ......')
6.10 A            VWPODA    R               REFFLD(FÅODAT)
6.10 A            VWPOTI    R               REFFLD(FÅOTIM)
6.10 A            VWPOUS    R               REFFLD(FÅOUSR)
6.10 A            VWPEDA    R               REFFLD(FÅEDAT)
6.10 A            VWPETI    R               REFFLD(FÅETIM)
6.10 A            VWPEUS    R               REFFLD(FÅEUSR)
      *
      * Arbeidsregister etiketter           (VWA)
      *
     A            VWAREC       447A         TEXT('Record')
     A                                      COLHDG('Record')
     A            VWAFIR    R               REFFLD(FÅFIRM)
     A            VWAANT         4  0
      *                     vaanta                          Antall etiketter
     A            VWATXT        15A
      *                     vattxt                          Tekst fra fastreg.
     A            VWATVA         6A
      *                     vatvar                          Varenr. (Fast tekst)
     A            VWAPRI         7A
      *                     vatpri                          Pris (Fast tekst)
     A            VWAENH         5A
      *                     vatenh                          Enhet (Fast tekst)
     A            VWADAT          L         TEXT('Prisendringsdato')
     A                                      COLHDG('Endr.dat')
     A            VWALAG    R               REFFLD(FÅLAGE)
     A            VWANOB    R               REFFLD(FÅNOBB)
     A            VWAVAR    R               REFFLD(FÅVARE)
     A            VWAEAN    R               REFFLD(FÅEANN)
     A            VWALVA    R               REFFLD(FÅLVAR)
     A            VWATK1    R               REFFLD(FÅTEK1)
     A            VWATK2    R               REFFLD(FÅTEK2)
     A            VWAEN1    R               REFFLD(FÅENHE)
     A            VWAPR1    R               REFFLD(FPSAPR)
      *                     vapri1                          Pris salgsenhet 1
     A            VWAEN2    R               REFFLD(FÅENHE)
     A            VWAPR2    R               REFFLD(FPSAPR)
      *                     vapri2                          Pris salgsenhet 2
     A            VWABSK    R               REFFLD(FÅBESK_5)
      *                     vabesk                          Tekst priskode
     A            VWABPU    R               REFFLD(VLBPUN)
      *                     vabpun                          Bestillingspunkt
     A            VWABME    R               REFFLD(VLBMEN)
      *                     vabmen                          Bestillingsmengde
     A            VWAHYL         1  0
      *                     vahyle                          Type etikett
     A            VWAVKO         1  0
      *                     valvko                          Skriv i div. felt
     A            VWAPLS    R               REFFLD(VLPLAS)
      *                     vaplas                          Lagerplass
     A            VWAETY         1S 0       TEXT('Etikettype')
     A                                      COLHDG('Etikett' 'type')
     A            VWAMIN    R               REFFLD(VLMINL)
      *                     vamini                          Minimumsbeholdn.(L)
     A            VWAMAX    R               REFFLD(VLMAKS)
      *                     vamaks                          Maksimumbeholdn.(L)
     A            VWAVTY    R               REFFLD(FÅVTYP)
      *                     vavtyp                          Varetype
     A            VWAEIN    R               REFFLD(FÅENHE)
     A                                      TEXT('Bestillingsenhet')
     A                                      COLHDG('Best.enhet')
      *                     vaenin                          Bestillingsenhet
     A            VWAPSPE   R               REFFLD(FÅENHE)
     A                                      TEXT('Sammenligningsenhet')
     A                                      COLHDG('Smnlign.enhet')
      *                     vaenps                          Sammenligningsenhet
     A            VWAPSP    R               REFFLD(FPSAPR)
     A                                      TEXT('Pris sammenligning')
     A                                      COLHDG('Pris smnlign')
      *                     vapspr                          Pris sammenligning
     A            VWAKEY        64A         TEXT('Key')
     A                                      COLHDG('Key')
5.36  *
5.36  * Arbeidsregister                     (VWB)
5.36  *
5.36 A            VWBFIR    R               REFFLD(FÅFIRM)
5.36 A            VWBVAR    R               REFFLD(FÅVARE)
5.36 A            VWBOGR    R               REFFLD(FÅOGRP)
5.36 A            VWBHGR    R               REFFLD(FÅHGRP)
5.36 A            VWBUGR    R               REFFLD(FÅUGRP)
5.36 A            VWBTK1    R               REFFLD(FÅTEK1)
5.36 A            VWBENH    R               REFFLD(FÅENHE)
5.36 A            VWBANT        11S 3       TEXT('Antall')
5.36 A                                      COLHDG('Antall')
5.36 A            VWBAOL        11S 0       TEXT('Antall ordrelinjer')
5.36 A                                      COLHDG('Antall''Ordrelinjer')
5.36 A            VWBSMB        11S 2       TEXT('Sum brutto')
5.36 A                                      COLHDG('Sum brutto')
5.36 A            VWBSMR        11S 2       TEXT('Sum rabatt')
5.36 A                                      COLHDG('Sum rabatt')
5.36 A            VWBSMN        11S 2       TEXT('Sum netto')
5.36 A                                      COLHDG('Sum netto')
6.19  *
6.19  * Arbeidsregister ved plukkliste      (VWB)
6.19  *
6.19 A            VWCFIR    R               REFFLD(FÅFIRM)
6.19 A            VWCNUM    R               REFFLD(FÅNUMM)
6.19 A            VWCSUF    R               REFFLD(FÅSUFF)
6.19 A            VWCLIN    R               REFFLD(FÅLINE)
6.19 A            VWCVAR    R               REFFLD(FÅVARE)
6.19 A            VWCTE1    R               REFFLD(FÅTEK1)
6.19 A            VWCTE2    R               REFFLD(FÅTEK2)
6.19 A            VWCENH    R               REFFLD(FÅENHE)
6.19  *
6.19 A            VWCANT        11S 3       TEXT('Antall restet')
6.19 A                                      COLHDG('Ant' 'rest')
6.19 A                                      COMP(LT 99999999)
6.19 A                                      CHKMSGID(FMD0640 *LIBL/QMFOFAK)
6.19  *
6.19 A            VWCANB        11S 3       TEXT('Antall bestilt')
6.19 A                                      COLHDG('Ant' 'best')
6.19 A                                      EDTCDE(M)
6.19 A                                      COMP(LT 99999999)
6.19 A                                      CHKMSGID(FMD0640 *LIBL/QMFOFAK)
6.19 A            VWCLAG    R               REFFLD(FÅLAGE)
6.19 A            VWCPLA         8A         TEXT('Lagerplass')
     A                                      COLHDG('Lagerpl.')
      *
6.20 *
6.20  * Fraktdokument hode                  (FFA)
6.20  *
6.20 A            FFAFIR    R               REFFLD(FÅFIRM)
6.20 A            FFALAG    R               REFFLD(FÅLAGE)
6.20 A            FFADNO        10  0       TEXT('Fraktdokument nummer')
6.20 A                                      COLHDG('Fraktdok.nr.')
6.20 A                                      EDTCDE(Z)
6.20 A            FFASTA         1A         TEXT('Status')
6.20 A                                      COLHDG('Status')
6.20 A            FFATID        17A         TEXT('Transport ID')
6.20 A                                      COLHDG('Trans.ID')
6.20 A            FFADNR         3A         TEXT('Dokument nummer')
6.20 A                                      COLHDG('Dok.nr.')
6.20 A            FFASPE         3S 0       TEXT('Speditør')
6.20 A                                      COLHDG('Sped.')
6.20 A                                      EDTCDE(Z)
6.20 A            FFAKJR         2S 0       TEXT('Kjørerute')
6.20 A                                      COLHDG('Kjøre' 'rute')
6.20 A                                      EDTCDE(Z)
6.20 A            FFADIS         4S 0       TEXT('Distrikt')
6.20 A                                      COLHDG('Distr')
6.20 A                                      EDTCDE(Z)
6.20 A            FFALTY    R               REFFLD(FÅLETY)
6.20 A            FFALMA         2S 0       TEXT('Leveringsmåte')
6.20 A                                      COLHDG('Lev.' 'måte')
6.20 A                                      EDTCDE(Z)
6.20 A            FFALBE         2S 0       TEXT('Leveringsbet.')
6.20 A                                      COLHDG('Lev.' 'bet.')
6.20 A                                      EDTCDE(Z)
6.20 A            FFALDA    R               REFFLD(FÅLDAT)
6.20 A            FFALTI         4S 0       TEXT('Leverings tidspunkt')
6.20 A                                      COLHDG('Lev. tid')
6.20 A                                      EDTCDE(Z)
6.20 A            FFAFDA          L         TEXT('Forsendelsesdato')
6.20 A                                      COLHDG('Fors' 'dato')
6.20 A            FFABEB         2S 0       TEXT('Bet.betingelser')
6.20 A                                      COLHDG('Bet.' 'bet.')
6.20 A                                      EDTCDE(Z)
6.20 A            FFAMRE        30A         TEXT('Mottakers ref.')
6.20 A                                      COLHDG('Mot.' 'ref.')
6.20 A            FFAARE        30A         TEXT('Avsenders ref.')
6.20 A                                      COLHDG('Avs.' 'ref.')
      *
6.20 A            FFAKUN         6S 0       TEXT('Kundenummer')
6.20 A                                      COLHDG('Knr')
6.20 A                                      EDTCDE(Z)
6.20 A            FFANVN        30A         TEXT('Kundenavn')
6.20 A                                      COLHDG('K.navn')
6.20 A            FFAAD1        30A         TEXT('Adresse 1')
6.20 A                                      COLHDG('Adresse 1')
6.20 A            FFAAD2        30A         TEXT('Adresse 2')
6.20 A                                      COLHDG('Adresse 2')
6.20 A            FFASTD        30A         TEXT('Poststed')
6.20 A                                      COLHDG('Poststed')
6.20 A            FFALND         2A         TEXT('Landkode')
6.20 A                                      COLHDG('Land')
6.20 A            FFATLF        16A         TEXT('Telefonnummer')
6.20 A                                      COLHDG('Tlf.nr.')
6.20 A            FFAKSP        10A         TEXT('Mot. kundenr. hos sped')
6.20 A                                      COLHDG('Mot. knr. sped')
6.20 A            FFALKU         6S 0       TEXT('Leveres kundenummer')
6.20 A                                      COLHDG('Lev.knr.')
6.20 A                                      EDTCDE(Z)
6.20 A            FFALNV        30A         TEXT('Leveres kundenavn')
6.20 A                                      COLHDG('Lev. K.navn')
6.20 A            FFALA1        30A         TEXT('Adresse 1')
6.20 A                                      COLHDG('Adresse 1')
6.20 A            FFALA2        30A         TEXT('Adresse 2')
6.20 A                                      COLHDG('Adresse 2')
6.20 A            FFALST        30A         TEXT('Poststed')
6.20 A                                      COLHDG('Poststed')
6.20 A            FFALLN         2A         TEXT('Landkode')
6.20 A                                      COLHDG('Land')
6.20 A            FFALTF        16A         TEXT('Telefonnummer')
6.20 A                                      COLHDG('Tlf.nr.')
6.20 A            FFAFIN        30A         TEXT('Firmanavn')
6.20 A                                      COLHDG('Firmanavn')
6.20 A            FFAFA1        30A         TEXT('Firma adresse 1')
6.20 A                                      COLHDG('Firm adr1')
6.20 A            FFAFA2        30A         TEXT('Firma adresse 2')
6.20 A                                      COLHDG('Firm adr 2')
6.20 A            FFAFST        30A         TEXT('Firma poststed')
6.20 A                                      COLHDG('Firma pstd')
6.20 A            FFAFLN         2A         TEXT('Firma landkode')
6.20 A                                      COLHDG('firma land')
6.20 A            FFAFTF        16A         TEXT('Firma telefonnummer')
6.20 A                                      COLHDG('Firma tlf.nr.')
6.20 A            FFAVKN        10A         TEXT('Vårt kundenr. hos lev')
6.20 A                                      COLHDG('Vårt knr. hos sped')
6.20 A            FFAANS        10A         TEXT('Ansvarlig')
6.20 A                                      COLHDG('Ansvarlig')
6.20 A            FFAMBE         1S 0       TEXT('Mottaker betaler')
6.20 A                                      COLHDG('Mot.bet.')
6.20 A                                      EDTCDE(Z)
      *
6.20 A            FFAODA    R               REFFLD(FÅODAT)
6.20 A            FFAOTI    R               REFFLD(FÅOTIM)
6.20 A            FFAOUS    R               REFFLD(FÅOUSR)
6.20 A            FFAEDA    R               REFFLD(FÅEDAT)
6.20 A            FFAETI    R               REFFLD(FÅETIM)
6.20 A            FFAEUS    R               REFFLD(FÅEUSR)
6.20 *
6.20  * Fraktdokument ordre                 (FFB)
6.20  *
6.20 A            FFBFIR    R               REFFLD(FÅFIRM)
6.20 A            FFBDNO        10  0       TEXT('Fraktdokument nummer')
6.20 A                                      COLHDG('Fraktdok.nr.')
6.20 A                                      EDTCDE(Z)
6.20 A            FFBNUM    R               REFFLD(FÅNUMM)
6.20 A                                      COMP(NE 0)
6.20 A                                      CHKMSGID(FMO0600 *LIBL/QMFOFAK)
6.20 A            FFBSUF    R               REFFLD(FÅSUFF)
6.20 A            FFBOTY    R               REFFLD(FÅOTYP)
6.20 A                                      COMP(NE '  ')
6.20 A                                      CHKMSGID(FMO0610 *LIBL/QMFOFAK)
6.20 A            FFBLAG    R               REFFLD(FÅLAGE)
6.20 A            FFBSTA         1A         TEXT('Status')
6.20 A                                      COLHDG('Status')
6.20 A            FFBSPE         3S 0       TEXT('Speditør')
6.20 A                                      COLHDG('Sped.')
6.20 A                                      EDTCDE(Z)
6.20 A            FFBKJR         2S 0       TEXT('Kjørerute')
6.20 A                                      COLHDG('Kjøre' 'rute')
6.20 A                                      EDTCDE(Z)
6.20 A            FFBDIS         4S 0       TEXT('Distrikt')
6.20 A                                      COLHDG('Distr')
6.20 A                                      EDTCDE(Z)
6.20 A            FFBLTY    R               REFFLD(FÅLETY)
6.20 A            FFBLMA         2S 0       TEXT('Leveringsmåte')
6.20 A                                      COLHDG('Lev' 'måte')
6.20 A                                      EDTCDE(Z)
6.20 A            FFBKUN         6S 0       TEXT('Kundenummer')
6.20 A                                      COLHDG('Kunde')
6.20 A                                      EDTCDE(Z)
6.20 A            FFBKNA        30A         TEXT('Kundenavn')
6.20 A                                      COLHDG('Kundenavn')
6.20 A            FFBLDA    R               REFFLD(FÅLDAT)
6.20 A            FFBVRF        30A         TEXT('Vår ref.')
6.20 A                                      COLHDG('Vår ref.')
6.20 A            FFBDRF        30A         TEXT('Deres ref.')
6.20 A                                      COLHDG('Deres ref.')
6.20 A            FFBRKV        20A         TEXT('Kund.ordrenr.')
6.20 A                                      COLHDG('Kund.ordrenr.')
6.20 A            FFBANT        15  6       TEXT('Antall')
6.20 A                                      COLHDG('Antall')
6.20 A            FFBBVK         9  3       TEXT('Bruttovekt')
6.20 A                                      COLHDG('Brt.vekt')
6.20 A            FFBNVK         9  3       TEXT('Nettovekt')
6.20 A                                      COLHDG('Nto.vekt')
6.20 A            FFBVOL    R               REFFLD(FÅVOLU)
6.20 A            FFBAKO         4S 0       TEXT('Antall kolli')
6.20 A                                      COLHDG('Kolli')
6.20 A                                      EDTCDE(Z)
6.20 A            FFBKTY        20A         TEXT('Kollitype')
6.20 A                                      COLHDG('Kollitype')
      *
6.20 A            FFBODA    R               REFFLD(FÅODAT)
6.20 A            FFBOTI    R               REFFLD(FÅOTIM)
6.20 A            FFBOUS    R               REFFLD(FÅOUSR)
6.20 A            FFBEDA    R               REFFLD(FÅEDAT)
6.20 A            FFBETI    R               REFFLD(FÅETIM)
6.20 A            FFBEUS    R               REFFLD(FÅEUSR)
6.20 *
6.20  * Fraktdokument summer pr. fraktbrev  (FFC)
6.20  *
6.20 A            FFCFIR    R               REFFLD(FÅFIRM)
6.20 A            FFCDNO        10  0       TEXT('Fraktdokument nummer')
6.20 A                                      COLHDG('Fraktdok.nr.')
6.20 A                                      EDTCDE(Z)
6.20 A            FFCLNR         3S 0       TEXT('Linjenummer')
6.20 A                                      COLHDG('L.nr.')
6.20 A                                      EDTCDE(Z)
6.20 A            FFCLAG    R               REFFLD(FÅLAGE)
6.20 A            FFCANT        15  6       TEXT('Antall')
6.20 A                                      COLHDG('Antall')
6.20 A            FFCBVK         9  3       TEXT('Bruttovekt')
6.20 A                                      COLHDG('Brt.vekt')
6.20 A            FFCNVK         9  3       TEXT('Nettovekt')
6.20 A                                      COLHDG('Nto.vekt')
6.20 A            FFCVOL    R               REFFLD(FÅVOLU)
6.20 A            FFCAKO         4S 0       TEXT('Antall kolli')
6.20 A                                      COLHDG('Kolli')
6.20 A                                      EDTCDE(Z)
6.20 A            FFCKTK         3A         TEXT('Kollitype kode')
6.20 A                                      COLHDG('K.type kode')
6.20 A            FFCKTY        20A         TEXT('Kollitype')
6.20 A                                      COLHDG('Kollitype')
6.20 A            FFCTXT        30A         TEXT('Fritekst')
6.20 A                                      COLHDG('Fritekst')
      *
6.20 A            FFCODA    R               REFFLD(FÅODAT)
6.20 A            FFCOTI    R               REFFLD(FÅOTIM)
6.20 A            FFCOUS    R               REFFLD(FÅOUSR)
6.20 A            FFCEDA    R               REFFLD(FÅEDAT)
6.20 A            FFCETI    R               REFFLD(FÅETIM)
6.20 A            FFCEUS    R               REFFLD(FÅEUSR)
6.20 *
6.20  * Fraktdokument ordrelinjer (FFD)
6.20  *
6.20 A            FFDFIR    R               REFFLD(FÅFIRM)
6.20 A            FFDDNO        10  0       TEXT('Fraktdokument nummer')
6.20 A                                      COLHDG('Fraktdok.nr.')
6.20 A                                      EDTCDE(Z)
6.20 A            FFDNUM    R               REFFLD(FÅNUMM)
6.20 A                                      COMP(NE 0)
6.20 A                                      CHKMSGID(FMO0600 *LIBL/QMFOFAK)
6.20 A            FFDSUF    R               REFFLD(FÅSUFF)
6.20 A            FFDLNR         3S 0       TEXT('Linjenummer')
6.20 A                                      COLHDG('L.nr.')
6.20 A                                      EDTCDE(Z)
6.20 A            FFDVAR    R               REFFLD(FÅVARE)
6.20 A            FFDENH    R               REFFLD(FÅENHE)
6.20 A            FFDNOB    R               REFFLD(FÅNOBB)
6.20 A            FFDTE1    R               REFFLD(FÅTEK1)
6.20 A            FFDTE2    R               REFFLD(FÅTEK2)
6.20 A            FFDLAG    R               REFFLD(FÅLAGE)
6.20 A            FFDANT        15  6       TEXT('Antall')
6.20 A                                      COLHDG('Antall')
6.20 A            FFDBVK         9  3       TEXT('Bruttovekt')
6.20 A                                      COLHDG('Brt.vekt')
6.20 A            FFDNVK         9  3       TEXT('Nettovekt')
6.20 A                                      COLHDG('Nto.vekt')
6.20 A            FFDVOL    R               REFFLD(FÅVOLU)
6.20 A            FFDAKO         4S 0       TEXT('Antall kolli')
6.20 A                                      COLHDG('Kolli')
6.20 A                                      EDTCDE(Z)
6.20 A            FFDKTK         3A         TEXT('Kollitype kode')
6.20 A                                      COLHDG('K.type kode')
6.20 A            FFDKTY        20A         TEXT('Kollitype')
6.20 A                                      COLHDG('Kollitype')
      *
6.20 A            FFDODA    R               REFFLD(FÅODAT)
6.20 A            FFDOTI    R               REFFLD(FÅOTIM)
6.20 A            FFDOUS    R               REFFLD(FÅOUSR)
6.20 A            FFDEDA    R               REFFLD(FÅEDAT)
6.20 A            FFDETI    R               REFFLD(FÅETIM)
6.20 A            FFDEUS    R               REFFLD(FÅEUSR)
6.2F  *
6.2F  * Arbeidsregister                     (WF)
6.2F  *
6.2F A            WFFIRM    R               REFFLD(FÅFIRM)
6.2F  *
6.2F A            WFNUMM    R               REFFLD(FÅNUMM)
6.2F A                                      COMP(NE 0)
6.2F A                                      CHKMSGID(FMO0600 *LIBL/QMFOFAK)
6.2F  *
6.2F A            WFSUFF    R               REFFLD(FÅSUFF)
6.2F  *
6.2F A            WFLINE    R               REFFLD(FÅLINE)
6.2F  *
6.2F A            WFTYPE         3A         TEXT('Endringstypede')
6.2F  *
6.2F A            WFVARE    R               REFFLD(FÅVARE)
6.2F A            WFTEK1    R               REFFLD(FÅTEK1)
6.2F A            WFENHE    R               REFFLD(FÅENHE)
6.2F  *
6.2F A            WFANTA    R               REFFLD(FÅANTA)
6.2F  *
6.2F A            WFSAPR         9S 2       TEXT('Salgspris')
6.2F A                                      COLHDG('Salgspris')
6.2F A                                      EDTWRD('     0 ,  ')
6.2F  *
6.2F A            WFSUMS        11S 2       TEXT('Sum')
6.2F A                                      COLHDG('Sum')
6.2F A                                      EDTCDE(M)
6.2F A            WFBNUM    R               REFFLD(FÅNUMM)
6.2F  *
6.2F A            WFODAT    R               REFFLD(FÅODAT)
6.2F A            WFOTIM    R               REFFLD(FÅOTIM)
6.2F A            WFOUSR    R               REFFLD(FÅOUSR)
6.2F A            WFEDAT    R               REFFLD(FÅEDAT)
6.2F A            WFETIM    R               REFFLD(FÅETIM)
6.2F A            WFEUSR    R               REFFLD(FÅEUSR)
7.01  *
7.01  * EDI kopi av ordrehodet (bestilling) (EO)
7.01  *
7.01 A            EOFIRM    R               REFFLD(FÅFIRM)
7.01 A            EOFSYS    R               REFFLD(FÅFSYS)
7.01  *
7.01 A            EOTELL         6S 0       TEXT('Teller')
7.01 A                                      COLHDG('Teller')
7.01 A                                      EDTCDE(Z)
7.01  *
7.01 A            EONREF    R               REFFLD(FÅNREF)
7.01  *
7.01 A            EOFRSP         1S 0       TEXT('Forespørsel')
7.01 A                                      COLHDG('Fore' 'spørsel')
7.01 A                                      EDTCDE(Z)
7.01  *
7.01 A            EOLAGE    R               REFFLD(FÅLAGE)
7.01 A            EOAVDE         4S 0       TEXT('AVDELING')
7.01 A                                      COLHDG('AVD.')
7.01 A                                      EDTCDE(Z)
7.01 A            EOUSER    R               REFFLD(FÅUSER)
7.01 A            EOLDOR    R               REFFLD(FÅLDOR)
7.01 A            EOKUND    R               REFFLD(FÅKUND)
7.01  *
7.01 A            EOKNAV        35          TEXT('Kundenavn')
7.01 A                                      COLHDG('Kundenavn')
7.01  *
7.01 A            EOKPRO    R               REFFLD(FÅKPRO)
7.01  *
7.01 A            EOPNAV        35          TEXT('Kundeprosjektnavn')
7.01 A                                      COLHDG('Kundeprosjektnavn')
7.01  *
7.01 A            EONAVN        30A         TEXT('Navn')
7.01 A                                      COLHDG('Navn')
7.01  *
7.01 A            EOADR1        30A         TEXT('Adresse 1')
7.01 A                                      COLHDG('Adresse 1')
7.01  *
7.01 A            EOADR2        30A         TEXT('Adresse 2')
7.01 A                                      COLHDG('Adresse 2')
7.01  *
7.01 A            EOPONR        15A         TEXT('Postnr')
7.01 A                                      COLHDG('Postnr')
7.01  *
7.01 A            EOSTED        30A         TEXT('Poststed')
7.01 A                                      COLHDG('Poststed')
7.01  *
7.01 A            EOLETY    R               REFFLD(FÅLETY)
7.01 A            EOLDAT    R               REFFLD(FÅLDAT)
7.01  *
7.01 A            EODREF        20A         TEXT('Deres ref.')
7.01 A                                      COLHDG('Deres ref.')
7.01  *
7.01 A            EOREKV        70A         TEXT('Kund.rekv.nr.')
7.01 A                                      COLHDG('Kund.rekv.nr.')
7.01  *
7.01 A            EOUNAV        30A         TEXT('Brukernavn')
7.01 A                                      COLHDG('Brukernavn')
7.01  *
7.01 A            EOUTLF        15A         TEXT('Bruker telefon')
7.01 A                                      COLHDG('Bruker' 'telefon')
7.01  *
7.01 A            EOUMOB        15A         TEXT('Bruker mobil')
7.01 A                                      COLHDG('Bruker' 'mobil')
7.01  *
7.01 A            EOUFAX        15A         TEXT('Bruker fax')
7.01 A                                      COLHDG('Bruker' 'fax')
7.01  *
7.01 A            EOUMAI        50A         TEXT('Bruker email')
7.01 A                                      COLHDG('Bruker' 'email')
7.01  *
7.01 A            EOMELD       256A         TEXT('Melding')
7.01 A                                      COLHDG('Melding')
7.01  *
7.01 A            EONUMM    R               REFFLD(FÅNUMM)
7.01  *
7.01 A            EOSUFF    R               REFFLD(FÅSUFF)
7.01  *
7.01 A            EOLMAT         2S 0       TEXT('Leveringsmåte')
7.01 A                                      COLHDG('Lev' 'måte')
7.01 A                                      EDTCDE(Z)
7.01  *
7.01 A            EOBDAT          L         TEXT('Ordredato')
7.01 A                                      COLHDG('Ordre' 'dato')
7.01  *
7.01 A            EOIVGL        13  0       TEXT('GLN nr IV')
7.01 A                                      COLHDG('GLN nr IV')
7.01  *
7.01 A            EOSUGL        13  0       TEXT('GLN nr SU')
7.01 A                                      COLHDG('GLN nr SU')
7.01  *
7.01 A            EOBYGL        13  0       TEXT('GLN nr BY')
7.01 A                                      COLHDG('GLN nr BY')
7.01  *
7.01 A            EODPGL        13  0       TEXT('GLN nr DP')
7.01 A                                      COLHDG('GLN nr DP')
7.01  *
7.01 A            EOODAT    R               REFFLD(FÅODAT)
7.01 A            EOOTIM    R               REFFLD(FÅOTIM)
7.01 A            EOOUSR    R               REFFLD(FÅOUSR)
7.01 A            EOEDAT    R               REFFLD(FÅEDAT)
7.01 A            EOETIM    R               REFFLD(FÅETIM)
7.01 A            EOEUSR    R               REFFLD(FÅEUSR)
7.01  *
7.01  * EDI kopi av ordrelinje (bestilling) (ED)
7.01  *
7.01 A            EDFIRM    R               REFFLD(FÅFIRM)
7.01 A            EDFSYS    R               REFFLD(FÅFSYS)
7.01 A            EDTELL         6S 0       TEXT('Teller')
7.01 A                                      COLHDG('Teller')
7.01 A                                      EDTCDE(Z)
7.01 A            EDLINE    R               REFFLD(FÅLINE)
7.01 A            EDONUM    R               REFFLD(FÅNUMM)
7.01 A            EDOSUF    R               REFFLD(FÅSUFF)
7.01 A            EDOLIN    R               REFFLD(FÅLINE)
7.01 A            EDNREF    R               REFFLD(FÅNREF)
7.01 A            EDLDOR    R               REFFLD(FÅLDOR)
7.01 A            EDNLIN         6S 0       TEXT('Ekstern linjeref')
7.01 A            EDLVAR        15A         TEXT('Lev.dør. varenr.')
7.01 A                                      COLHDG('Levd' 'varenr.')
7.01 A            EDNOBB    R               REFFLD(FÅNOBB)
7.01 A            EDGTIN    R               REFFLD(FÅEANN)
7.01 A            EDVARE    R               REFFLD(FÅVARE)
7.01 A            EDTEK1    R               REFFLD(FÅTEK1)
7.01 A            EDTEK2    R               REFFLD(FÅTEK2)
7.01 A            EDANTA    R               REFFLD(FÅANTA)
7.01 A            EDENHE    R               REFFLD(FÅENHE)
7.01 A            EDNTPR         9S 2       TEXT('Netto salgspris')
7.01 A                                      COLHDG('Netto' 'salgspris')
7.01 A                                      EDTCDE(M)
7.01 A            EDLETY    R               REFFLD(FÅLETY)
7.01 A            EDLDAT    R               REFFLD(FÅLDAT)
7.01 A            EDMELD        70A         TEXT('Melding')
7.01 A                                      COLHDG('Melding')
7.01 A            EDODAT    R               REFFLD(FÅODAT)
7.01 A            EDOTIM    R               REFFLD(FÅOTIM)
7.01 A            EDOUSR    R               REFFLD(FÅOUSR)
7.01 A            EDEDAT    R               REFFLD(FÅEDAT)
7.01 A            EDETIM    R               REFFLD(FÅETIM)
7.01 A            EDEUSR    R               REFFLD(FÅEUSR)
7.01  *
7.01  * EDI kopi av tekstlinjer (bestilling) (ED)
7.01  *
7.01 A            ETFIRM    R               REFFLD(FÅFIRM)
7.01 A            ETFSYS    R               REFFLD(FÅFSYS)
7.01 A            ETTELL         6S 0       TEXT('Teller')
7.01 A                                      COLHDG('Teller')
7.01 A                                      EDTCDE(Z)
7.01 A            ETLINE    R               REFFLD(FÅLINE)
7.01 A            ETTLIN    R               REFFLD(FÅLINE)
7.01 A            ETONUM    R               REFFLD(FÅNUMM)
7.01 A            ETOSUF    R               REFFLD(FÅSUFF)
7.01 A            ETOLIN    R               REFFLD(FÅLINE)
7.01 A            ETNREF    R               REFFLD(FÅNREF)
7.01 A            ETLDOR    R               REFFLD(FÅLDOR)
7.01 A            ETNLIN         6S 0       TEXT('Ekstern linjeref')
7.01 A            ETLDAT    R               REFFLD(FÅLDAT)
7.01 A            ETTYPE         1A
7.01 A            ETTEK1        70A
7.01 A            ETODAT    R               REFFLD(FÅODAT)
7.01 A            ETOTIM    R               REFFLD(FÅOTIM)
7.01 A            ETOUSR    R               REFFLD(FÅOUSR)
7.01 A            ETEDAT    R               REFFLD(FÅEDAT)
7.01 A            ETETIM    R               REFFLD(FÅETIM)
7.01 A            ETEUSR    R               REFFLD(FÅEUSR)
      *
7.14  *
7.14  * Slettet Logg-file for ordreforløp      (FUS)
7.14  *
7.14 A            FUSFIR    R               REFFLD(FÅFIRM)
7.14  *
7.14 A            FUSAAR         4S 0       TEXT('År')
7.14 A                                      COLHDG('År')
7.14 A                                      EDTCDE(Z)
7.14  *
7.14 A            FUSNUM    R               REFFLD(FÅNUMM)
7.14  *
7.14 A            FUSSUF    R               REFFLD(FÅSUFF)
7.14  *
7.14 A            FUSKOD         1A         TEXT('Logg-kode')
7.14 A                                      COLHDG('Logg' 'kode')
7.14  *
7.14  *                                     Logg koden er som følger:
7.14  *                                     1 = Ordre bekreftet
7.14  *                                     2 = Klar for plukking
7.14  *                                     4 = Under plukking
7.14  *                                     6 = Ferdig plukket
7.14  *                                     8 = Restet / dellevert
7.14  *
7.14 A            FUSDAT          L         TEXT('Dato logget')
7.14 A                                      COLHDG('Dato logget')
7.14  *
7.14 A            FUSTIM          T         TEXT('Klokkeslett')
7.14 A                                      COLHDG('Klokken')
7.14  *
7.14 A            FUSWSI        10A         TEXT('Arbeidstasjon')
7.14 A                                      COLHDG('Arbeidstasjon')
7.14  *
7.14 A            FUSUSE        10A         TEXT('Bruker-ID')
7.14 A                                      COLHDG('Bruker-ID')
7.14 A            FUSODA    R               REFFLD(FÅODAT)
7.14 A            FUSOTI    R               REFFLD(FÅOTIM)
7.14 A            FUSOUS    R               REFFLD(FÅOUSR)
7.14 A            FUSEDA    R               REFFLD(FÅEDAT)
7.14 A            FUSETI    R               REFFLD(FÅETIM)
7.14 A            FUSEUS    R               REFFLD(FÅEUSR)
7.14 A            FUSSDA    R               REFFLD(FÅEDAT)
7.14 A            FUSSTI    R               REFFLD(FÅETIM)
7.14 A            FUSSUS    R               REFFLD(FÅEUSR)
