      *
      *  Fast-ordretekst
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/FFRF)
     A          R FFTXPFR
     A            FJFIRM    R
     A            FJNUMM    R
     A            FJREFX    R
     A            FJSL01    R
     A            FJSL02    R
     A            FJSL03    R
     A            FJSL04    R
     A            FJSL05    R
     A            FJSL06    R
     A            FJSL07    R
     A            FJSL08    R
     A            FJSL09    R
     A            FJSL10    R
     A            FJSL11    R
     A            FJSL12    R
     A            FJSL13    R
     A            FJSL14    R
     A            FJSL15    R
     A            FJSL16    R
     A            FJSL17    R
     A            FJSL18    R
6.24 A            FJPRTX    R
6.10 A            FJODAT    R
6.10 A            FJOTIM    R
6.10 A            FJOUSR    R
6.10 A            FJEDAT    R
6.10 A            FJETIM    R
6.10 A            FJEUSR    R
