      *
      *  Fast-ordretekst
      *
     A                                      UNIQUE
     A          R FFTXPFR                   PFILE(*LIBL/FFTXPF)
      *
     A          K FJFIRM
     A          K FJNUMM
