      *
      *  Gebyr
      * ________________________________________________________________________
      *K00-200420               START FOR VERSJON K00
7.00  *K00 131020 SST NXS-5513  Utvide nøkkel med fakturatype
      *
     A                                      REF(*LIBL/FFRF)
     A          R FGEBPFR
     A            FGFIRM    R
     A            FGOTYP    R
     A            FGKKAT    R
7.00 A            FGFTYP    R
     A            FGLINE    R
     A            FGTEXT    R
     A            FGTYPE    R
     A            FGLTYP    R
     A            FGVARE    R
     A            FGGREN    R
     A            FGBELP    R
     A            FGSATS    R
6.10 A            FGODAT    R
6.10 A            FGOTIM    R
6.10 A            FGOUSR    R
6.10 A            FGEDAT    R
6.10 A            FGETIM    R
6.10 A            FGEUSR    R
