      *
      *  Gebyr
      *
     A          R FGEBPFR                   PFILE(*LIBL/FGEBPF)
      *
     A          K FGFIRM
     A          K FGVARE
