      *
      *  Gebyr
      *
     A          R FGEBPFR                   PFILE(*LIBL/FGEBPF)
      *
     A          K FGFIRM
     A          K FGOTYP
     A          K FGKKAT
     A          K FGFTYP
     A          K FGLINE
