      *
      * Byggdata prisfil
      *
     A          R FIBDPFR
     A            BD_RAD       261A         TEXT('BYGGDATA')
     A                                      COLHDG('BYGGDATA')
