      *
      * Byggoffice prisfil
      *
     A          R FIBOPFR
     A            BO_RAD       167A         TEXT('BYGGOFFICE')
     A                                      COLHDG('BYGGOFFICE')
