      *
      * Bygg Data Systemer prisfil (BA-KALK)
      *
     A          R FIBSPFR
     A            BS_RAD      0210A         TEXT('Bygg Data Systemer')
     A                                      COLHDG('Bygg Data Systemer')
