      *
      * Byggoffice IBX Catalogue
      *
     A          R FIBXPFR
     A            BX_RAD      1200A         TEXT('IBX CATALOGUE')
     A                                      COLHDG('IBX CATALOGUE')
