      *
      * Byggdata prisfil (utvidet)
      *
     A          R FIBYPFR
     A            BY_RAD       239A         TEXT('BYGGDATA utvidet')
     A                                      COLHDG('BYGGDATA utvidet')
