      *
      * Byggdata prisfil VARIANT 2
      *
     A          R FIBZPFR
     A            BZ_RAD       230A         TEXT('BYGGDATA')
     A                                      COLHDG('BYGGDATA')
