      *
      * HS-Faktura, vareinformasjon prisfil
      *
     A          R FIH1PFR
     A            H1_RAD       131A         TEXT('HS-Faktura')
     A                                      COLHDG('HK-Faktura')
