      *
      * Holte Prosjekt (Anbud98) (Samme som LA-Lund)
      *
     A          R FIHPPFR
     A            HP_RAD      0158A         TEXT('Holte Prosjekt')
     A                                      COLHDG('Holte Prosjekt')
