      *
      * Logiq varekatalog, vare- og prisinformasjon
      *
     A          R FILQPFR
     A            LQ_RAD       800A         TEXT('Logiq varekatalog')
     A                                      COLHDG('Logiq' 'varekatalog')
