      *
      * Nobb integrasjonsfil-format
      *
     A          R FINIPFR
     A            NI_RAD       252A         TEXT('NOBB integrasjon')
     A                                      COLHDG('NOBB integrasjon')
