      *
      * Nettopp Norge
      *
     A          R FINNPFR
     A            NN_RAD      0189A         TEXT('Nettopp Norge')
     A                                      COLHDG('Nettopp Norge')
