      *
      * Nobb pris-recordformat
      *
     A          R FINOPFR
     A            NOBB_RAD      74A         TEXT('NOBB')
     A                                      COLHDG('NOBB')
