      *
      * EDIFACT PRICAT prisfil
      *
     A          R FIPRPFR
     A            PR_RAD       400A         TEXT('EDI PRICAT')
     A                                      COLHDG('EDI PRICAT')
