      *
      * Vare/prisfil for eksport
      *
     A                                      REF(*LIBL/FFRF)
     A          R FIPXPFR
     A            FIUFIR    R
     A            FIUKUN    R
     A            FIUSOR    R
     A            FIUVAR    R
     A            FIUBES    R
     A            FIUNOB    R
     A            FIUTE1    R
     A            FIUTE2    R
     A            FIUENH    R
     A            FIUSAP    R
     A            FIURA1    R
     A            FIURA2    R
     A            FIUKPR    R
     A            FIUDAT    R
     A            FIUTIM    R
     A            FIUUSR    R
