      *
      * Vare/prisfil for eksport
      *
     A          R FIPXPFR                   PFILE(*LIBL/FIPXPF)
      *
     A          K FIUFIR
     A          K FIUKUN
     A          K FIUSOR
     A          K FIUVAR
