      *
      * Regneark
      *
     A          R FIRAPFR
     A            RA_RAD      0302A         TEXT('Regneark')
     A                                      COLHDG('Regneark')
