      *
      * System Konult prisfil (SALGSSUPPORT)
      *
     A          R FISKPFR
     A            SK_RAD      0161A         TEXT('System Konsult')
     A                                      COLHDG('System Konsult')
