      *
      *  Jobb status igangkjøring
      *
     A                                      UNIQUE
     A          R FJOBPFR                   PFILE(*LIBL/FJOBPF)
      *
     A          K FAJFIR
