      *
      *  Jobb status igangkjøring
      *
     A                                      REF(*LIBL/FFRF)
     A          R FJOBPFR
     A            FAJFIR    R
     A            FAJB01    R
     A            FAJB02    R
     A            FAJB03    R
     A            FAJB04    R
     A            FAJB05    R
     A            FAJB06    R
     A            FAJB07    R
     A            FAJB08    R
     A            FAJB09    R
     A            FAJB10    R
      *
     A            FAWS01    R
     A            FAWS02    R
     A            FAWS03    R
     A            FAWS04    R
     A            FAWS05    R
     A            FAWS06    R
     A            FAWS07    R
     A            FAWS08    R
     A            FAWS09    R
     A            FAWS10    R
      *
     A            FAUS01    R
     A            FAUS02    R
     A            FAUS03    R
     A            FAUS04    R
     A            FAUS05    R
     A            FAUS06    R
     A            FAUS07    R
     A            FAUS08    R
     A            FAUS09    R
     A            FAUS10    R
      *
     A            FADA01    R
     A            FADA02    R
     A            FADA03    R
     A            FADA04    R
     A            FADA05    R
     A            FADA06    R
     A            FADA07    R
     A            FADA08    R
     A            FADA09    R
     A            FADA10    R
      *
     A            FATI01    R
     A            FATI02    R
     A            FATI03    R
     A            FATI04    R
     A            FATI05    R
     A            FATI06    R
     A            FATI07    R
     A            FATI08    R
     A            FATI09    R
     A            FATI10    R
6.10 A            FAJODA    R
6.10 A            FAJOTI    R
6.10 A            FAJOUS    R
6.10 A            FAJEDA    R
6.10 A            FAJETI    R
6.10 A            FAJEUS    R
      *
