      *
      * Kunde distribusjonsliste
      *
     A                                      UNIQUE
     A          R FKDIPFR                   PFILE(*LIBL/FKDIPF)
      *
     A          K FHFIRM
     A          K FHKUND
     A          K FHKPRO
