      *
      * Kunde distribusjonsliste
7.16  *K00 030620 BOF NXS-1195  Utvidet med parm inkl skaff/tilb i FKDIPF
      *
     A                                      REF(*LIBL/FFRF)
     A          R FKDIPFR
     A            FHFIRM    R
     A            FHKUND    R
     A            FHKPRO    R
     A            FHPBOK    R
     A            FHPFIL    R
     A            FHVSOR    R
     A            FHVSOS    R
     A            FHLETY    R
     A            FHRFMT    R
     A            FHENDR    R
     A            FHDATO    R
     A            FHBTIS    R
     A            FHFTIS    R
7.16 A            FHSVAL    R
7.16 A            FHTVAL    R
     A            FHODAT    R
6.10 A            FHOTIM    R
6.10 A            FHOUSR    R
     A            FHEDAT    R
     A            FHETIM    R
     A            FHEUSR    R
