      *
      * Kunde distribusjonsliste
      *
     A          R FKDIPFR                   PFILE(*LIBL/FKDIPF)
      *
     A          K FHFIRM
     A          K FHFTIS                    DESCEND
     A          K FHKUND
     A          K FHKPRO
