      *
      * Kundeprosjekt matrikkelinfo
      *
     A*                                     REF(*LIBL/FFRF)
     A          R FKMAPFR
     A            FLMFIR         3S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            FLMKUN         6S 0
     A                                      TEXT('Kundenr')
     A                                      COLHDG('Kundenr')
     A            FLMKPR         6S 0
     A                                      TEXT('Kundeprosjekt')
     A                                      COLHDG('Kundeprosjekt')
     A            FLBONR        20A
     A                                      TEXT('Boligmappenr')
     A                                      COLHDG('Boligmappenr')
     A            FLMKOM         4S 0
     A                                      TEXT('Kommunenr')
     A                                      COLHDG('Kommunenr')
     A            FLMGDN         5S 0
     A                                      TEXT('Gårdsnummer')
     A                                      COLHDG('Gårdsnummer')
     A            FLMBRN         5S 0
     A                                      TEXT('Bruksnummer')
     A                                      COLHDG('Bruksnummer')
     A            FLMFEN         5S 0
     A                                      TEXT('Festenummer')
     A                                      COLHDG('Festenummer')
     A            FLMSEN         5S 0
     A                                      TEXT('Seksjonsnummer')
     A                                      COLHDG('Seksjonsnummer')
     A            FLMBEN         5A
     A                                      TEXT('Bruksenhetsnummer')
     A                                      COLHDG('Bruksenhetsnummer')
