      *
      * Kundeprosjekt matrikkelinfo
      *
     A                                      UNIQUE
     A          R FKMAPFR                   PFILE(*LIBL/FKMAPF)
      *
     A          K FLMFIR
     A          K FLMKUN
     A          K FLMKPR
