      *
      * Kundeprosjekt  m/ByggDok
      *
     A          R FKP2PFR                   PFILE(*LIBL/FKP2PF)
      *
     A          K FLFIRM
     A          K FLKUND
     A          K FLKPRO
