      *
      * Kundeprosjekt
      *
     A                                      REF(*LIBL/FFRF)
     A          R FKPRPFR
     A            FLFIRM    R
     A            FLKUND    R
     A            FLKPRO    R
     A            FLSELG    R
     A            FLFDAT    R
     A            FLTDAT    R
     A            FLNAVN    R
     A            FLADR1    R
     A            FLADR2    R
     A            FLPONR    R
     A            FLKPRS    R
     A            FLTLFA    R
     A            FLTLFP    R
     A            FLTLFM    R
     A            FLMAIL    R
     A            FLEPRO    R
     A            FLFATY    R
     A            FLKJOR    R
     A            FLKJNR    R
     A            FLBOKU    R
     A            FLORKA    R
     A            FLOKUN    R
     A            FLOKPR    R
     A            FLOPDA    R
     A            FLPRIV    R
     A            FLPROJ    R
6.2Ø A            FLBDOK    R
6.37 A            FLCOBU    R
6.35 A            FLMKOD    R
6.35 A            FLBETB    R
6.35 A            FLPRPA    R
6.35 A            FLNETO    R
6.35 A            FLEKGB    R
6.35 A            FLSEKV    R
6.35 A            FLSAMF    R
6.35 A            FLFAGB    R
6.39 A            FLFKUN    R
     A            FLODAT    R
6.10 A            FLOTIM    R
6.10 A            FLOUSR    R
     A            FLEDAT    R
     A            FLETIM    R
     A            FLEUSR    R
