      *
      * Kundeprosjekt
      *
     A          R FKPRPFR                   PFILE(*LIBL/FKPRPF)
      *
     A          K FLFIRM
     A          K FLNAVN
     A          K FLKUND
     A          K FLKPRO
