      *
      * Kundeprosjekt-søketekst
      *
     A                                      REF(*LIBL/FFRF)
     A          R FKPSPFR
     A            FLSFIR    R
     A            FLSKUN    R
     A            FLSKPR    R
     A            FLSTEK    R
6.10 A            FLSODA    R
6.10 A            FLSOTI    R
6.10 A            FLSOUS    R
6.10 A            FLSEDA    R
6.10 A            FLSETI    R
6.10 A            FLSEUS    R
