      *
      * Kundeprosjekt-søketekst
      *
     A          R FKPSPFR                   PFILE(*LIBL/FKPSPF)
      *
     A          K FLSFIR    R
     A          K FLSKUN    R
     A          K FLSKPR    R
