      *
      * Kundeprosjekt - %ytelse
      *
     A          R FKPXPFR                   PFILE(*LIBL/FKPXPF)
      *
     A          K FXFIRM
     A          K FXKUND
     A          K FXKPRO
