      *
      *  Fil for logging av ordreforløp
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/FFRF)
     A          R FLOGPFR
     A            FUFIRM    R
     A            FUAARR    R
     A            FUNUMM    R
     A            FUSUFF    R
     A            FUKODE    R
     A            FUDATE    R
     A            FUTIME    R
     A            FUUSER    R
     A            FUWSID    R
6.10 A            FUODAT    R
6.10 A            FUOTIM    R
6.10 A            FUOUSR    R
6.10 A            FUEDAT    R
6.10 A            FUETIM    R
6.10 A            FUEUSR    R
