      *
      * Fil for logging av ordreforløp
      * 090512 BOF - Fjernet uniqe indeks
      *
     A          R FLOGPFR                   PFILE(*LIBL/FLOGPF)
      *
     A          K FUFIRM
     A          K FUAARR
     A          K FUNUMM
     A          K FUSUFF
     A          K FUKODE
     A          K FUDATE
     A          K FUTIME
