      *
      * Fil for logging av ordreforløp
      *
     A          R FLOGPFR                   PFILE(*LIBL/FLOGPF)
      *
     A          K FUFIRM
     A          K FUAARR
     A          K FUNUMM
     A          K FUDATE
     A          K FUTIME
