      *
      * Leverandør vareregister
      *
     A          R FLVAPFR                   PFILE(*LIBL/FLVAPF)
      *
     A          K FWFIRM
     A          K FWLDOR
     A          K FWTEK1
     A          K FWLVAR
