      *
      * Leverandør vareregister
      *
     A                                      REF(*LIBL/FFRF)
     A          R FLVAPFR
     A            FWFIRM    R
     A            FWLDOR    R
     A            FWLINE    R
     A            FWEKOD    R
     A            FWTEK1    R
     A            FWTEK2    R
     A            FWLVAR    R
     A            FWEANN    R
     A            FWNOBB    R
     A            FWENHE    R
     A            FWLETY    R
     A            FWINPR    R
     A            FWSAPR    R
     A            FWDATO    R
     A            FWVGRP    R
     A            FWOGRP    R
     A            FWHGRP    R
     A            FWUGRP    R
     A            FWLENG    R
     A            FWBRED    R
     A            FWHOYD    R
     A            FWVEKT    R
     A            FWVOLU    R
     A            FWANTA    R
     A            FWBMEN    R
     A            FWCRDO    R
     A            FWUDAT    R
     A            FWLVAE    R
     A            FWTVAR    R
     A            FWHKOD    R
6.10 A            FWODAT    R
6.10 A            FWOTIM    R
6.10 A            FWOUSR    R
6.10 A            FWEDAT    R
6.10 A            FWETIM    R
6.10 A            FWEUSR    R
