      *
      * Leverandør vareregister - arbeidsfil
      *
     A          R FLVWPFR
     A            FWIRAD       800A         TEXT('Varer/priser')
     A                                      COLHDG('Varer/priser')
