      *
      *  Fakturatype-register
      *
     A                                      REF(*LIBL/FFRF)
     A          R FMFTPFR
     A            FMTFIR    R
     A            FMTFAT    R
     A            FMTBES    R
     A            FMTUTS    R
     A            FMTTES    R
     A            FMTEDA    R
     A            FMTETI    R
     A            FMTEUS    R
