      *
      * Internett Montor eksportfil
      *
     A          R FMINPFR
     A            MO_INT        80A         TEXT('Internett')
     A                                      COLHDG('Internett')
      *
