      *
      * Internett Montor eksportfil - prisfil
      *
     A          R FMIPPFR
     A            MO_INT        80A         TEXT('Internett')
     A                                      COLHDG('Internett')
      *
