      *
      * Kort/fakturaavtale-register
      *
     A          R FMKAPFR                   PFILE(*LIBL/FMKAPF)
      *
     A          K FMFIRM
     A          K FMKRNR
     A          K FMKUND
     A          K FMKPRO
