      *
      *  Kort/fakturaavtale-register
      *
     A          R FMKAPFR                   PFILE(*LIBL/FMKAPF)
      *
     A          K FMFIRM
     A          K FMKUND
     A          K FMKPRO
     A          K FMKFTP
     A          K FMKTSQ
