      *
      * Arbeidsfil for Autofakt-format
      *
     A          R FNAUPFR
     A            FNAULN      1024A         TEXT('Autofakt-lin.')
     A                                      COLHDG('Autof.' 'linje')
