      *
      * Arbeidsfil for ClearPark faktura (VISA/Europay)
      *
     A          R FNCPPFR
     A            FNCPLN      1024A         TEXT('Fakt.linje')
     A                                      COLHDG('Fakt.linje')
