      *
      * Arbeidsfil for Logiq fellesformat / eCards
      *
     A          R FNECPFR
     A            FNECLN      1024A         TEXT('eCard.linje')
     A                                      COLHDG('eCard' 'linje')
