      *
      * Arbeidsfil for Logiq fellesformat / EDI
      *
     A          R FNEDPFR
     A            FNEDLN      1024A         TEXT('EDI linje')
     A                                      COLHDG('EDI' 'linje')
