      *
      * Arbeidsfil for Logiq fellesformat / eFaktura
      *
     A          R FNEFPFR
     A            FNEFLN      1024A         TEXT('eFakt.linje')
     A                                      COLHDG('eFakt.' 'linje')
