      *
      * Arbeidsfil for Logiq fellesformat / eMail
      *
     A          R FNEMPFR
     A            FNEMLN      1024A         TEXT('eMail linje')
     A                                      COLHDG('eMail' 'linje')
