      *
      * Arbeidsfil for Logiq fellesformat / ePrint
      *
     A          R FNEPPFR
     A            FNEPLN      1024A         TEXT('ePrint linje')
     A                                      COLHDG('ePrint' 'linje')
