      *
      *  Faktura-logg / utg.fakt.-register
      *
     A                                      UNIQUE
     A          R FNUFPFR                   PFILE(*LIBL/FNUFPF)
      *
     A          K FNUFIR
     A          K FNUAAR
     A          K FNUBIN
