      *
      *  Faktura-logg / utg.fakt.-register
      *
     A          R FNUFPFR                   PFILE(*LIBL/FNUFPF)
      *
     A          K FNUFIR
     A          K FNUFAT
     A          K FNUKDA
     A          K FNUKUN
     A          K FNUAAR
     A          K FNUBIN
