      *
      *  Ordre-linje, sidereg
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
7.00  * R7.00 200819 NHO  Retur, sats
      *
      *
     A
     A          R FOD2PFR
      *
     A            FD2FIR         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            FD2NUM         8S 0       TEXT('Ordrenr')
     A                                      COLHDG('Ordrenr')
     A                                      EDTCDE(Z)
      *
     A            FD2SUF         2S 0       TEXT('Suffix')
     A                                      COLHDG('Suff')
     A                                      EDTCDE(Z)
      *
     A            FD2LIN         4S 0       TEXT('Linjenr')
     A                                      COLHDG('Linje')
     A                                      EDTCDE(Z)
      *
     A            FD2SAT         5S 2
     A                                      EDTWRD(' 0 ,  ')
     A                                      COLHDG('Gebyr %-sats')
     A                                      TEXT('Gebyr %-sats')
      *
     A            FD2KOD         1A
     A                                      COLHDG('Returkode')
     A                                      TEXT('Returkode')
      *
     A            FD2RTX        30A         TEXT('Returtekst')
     A                                      COLHDG('Returtekst')
      *
     A            FD2ORS        60A         TEXT('Årsak')
     A                                      COLHDG('Årsak')
      *
     A            FD2BER         1S 0       TEXT('Beregn 0/1')
     A                                      COLHDG('Beregn 0/1')
     A                                      EDTCDE(Z)
      *
     A            FD2USE        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FD2DAT          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
      *
     A            FD2TIM          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
     A            FD2OOU        10A         TEXT('Opprettet av')
     A                                      COLHDG('Oppr. av')
      *
     A            FD2EDA          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
      *
     A            FD2ETI          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
      *
     A            FD2EUS        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')

