      *
      *  Ordre-linje
      *
     A          R FOD2PFR                   PFILE(*LIBL/FOD2PF)
      *
     A          K FD2FIR
     A          K FD2NUM
     A          K FD2SUF
     A          K FD2LIN
