      *
      *  Ordre-linje
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
8.01  *       210322 BOF  utvidet med kostpris 2.
      *
     A                                      REF(*LIBL/FFRF)
     A          R FODTPFR
     A            FDFIRM    R
     A            FDNUMM    R
     A            FDSUFF    R
     A            FDLINE    R
     A            FDOTYP    R
     A            FDLTYP    R
     A            FDLETY    R
     A            FDVARE    R
     A            FDENH1    R
     A            FDLAGE    R
     A            FDKAKK    R
     A            FDKPRI    R
     A            FDKGEB    R
     A            FDLASS    R
     A            FDKUND    R
     A            FDBENR    R
     A            FDBSUF    R
     A            FDBLIN    R
     A            FDLDOR    R
     A            FDLDAT    R
     A            FDAVDE    R
     A            FDKONT    R
     A            FDSPES    R
     A            FDPROJ    R
     A            FDALME    R
     A            FDBRTY    R
     A            FDPRIV    R
     A            FDAKTI    R
     A            FDLVAR    R
     A            FDNOBB    R
     A            FDTEK1    R
     A            FDTEK2    R
     A            FDANTA    R
     A            FDANTB    R
     A            FDANTC    R
     A            FDOPPR    R
     A            FDSAPR    R
     A            FDKOPR    R
     A            FDINPR    R
     A            FDRAB1    R
     A            FDRAB2    R
     A            FDRAB3    R
     A            FDRAB4    R
     A            FDRAB5    R
     A            FDBRR1    R
     A            FDBRR2    R
     A            FDPASL    R
6.13 A            FDPSLM    R
     A            FDRKR1    R
     A            FDRKR2    R
     A            FDSUMS    R
     A            FDSUMR    R
     A            FDSUMK    R
     A            FDBBON    R
     A            FDOMVA    R
     A            FDLVRE    R
     A            FDOLAG    R
     A            FDOGRP    R
     A            FDHGRP    R
     A            FDUGRP    R
     A            FDGAVE    R
     A            FDVARI    R
     A            FDEDIH    R
     A            FDEDIL    R
     A            FDKAMP    R
     A            FDKBNR    R
     A            FDKBLI    R
     A            FDEANN    R
     A            FDPRGR    R
     A            FDOPRG    R
6.14 A            FDBLDO    R
6.14 A            FDBOGR    R
6.14 A            FDBHGR    R
6.14 A            FDBUGR    R
6.14 A            FDBMOD    R
6.14 A            FDBVAR    R
6.14 A            FDBVTY    R
6.14 A            FDBLET    R
6.14 A            FDBBET    R
6.14 A            FDBNTP    R
6.14 A            FDBIFA    R
6.14 A            FDPOGR    R
6.14 A            FDPHGR    R
6.14 A            FDPUGR    R
6.14 A            FDPLDO    R
6.14 A            FDPMOD    R
6.14 A            FDPVAR    R
6.14 A            FDPKPR    R
6.14 A            FDPVTY    R
6.14 A            FDPLET    R
6.14 A            FDPKFA    R
6.14 A            FDPKBE    R
6.14 A            FDPSFA    R
6.14 A            FDNOPR    R
6.14 A            FDPEN1    R
6.14 A            FDPEN2    R
6.14 A            FDPEN3    R
6.14 A            FDOFP1    R
6.14 A            FDOFP2    R
6.14 A            FDOFP3    R
6.14 A            FDOFV2    R
6.14 A            FDOFV3    R
6.24 A            FDPRTX    R
8.01 A            FDKOP2    R
     A            FDSTIM    R
     A            FDWSID    R
     A            FDUSER    R
     A            FDDATE    R
     A            FDTIME    R
6.10 A            FDODAT    R
6.10 A            FDOTIM    R
6.10 A            FDOOUS    R
6.10 A            FDEDAT    R
6.10 A            FDETIM    R
6.10 A            FDEUSR    R
