      *
      *  Ordre-linje
      *
     A          R FODTPFR                   PFILE(*LIBL/FODTPF)
      *
     A          K FDFIRM
     A          K FDVARE
     A          K FDNUMM
     A          K FDSUFF
     A          K FDENH1
