      *
      *  Ordre-linje
      *
     A          R FODTPFR                   PFILE(*LIBL/FODTPF)
      *
     A          K FDFIRM
     A          K FDPROJ
     A          K FDVARE
     A          K FDLINE
