      *
      *  Overføringsfil til økonomisystemet
      *
     A                                      REF(*LIBL/FFRF)
     A          R FOFFUTR
     A            FFFIRM    R
     A            FFPERI    R
     A            FFBUNT    R
     A            FFBILN    R
     A            FFBILL    R
     A            FFBDAT    R
     A            FFFDAT    R
     A            FFBILK    R
     A            FFTEXT    R
     A            FFDAVD    R
     A            FFDKTO    R
     A            FFDSPS    R
     A            FFDMOM    R
     A            FFBELP    R
5.32 A            FFMVAG    R
     A            FFCAVD    R
     A            FFCKTO    R
     A            FFCSPS    R
     A            FFCMOM    R
     A            FFPROJ    R
     A            FFAKTI    R
     A            FFKREF    R
     A            FFKUND    R
     A            FFVALK    R
     A            FFVALB    R
     A            FFMNGK    R
     A            FFMNGD    R
     A            FFAUTX    R
