      *
      *  Ordre-hode
      *
     A          R FOH2PFR                   PFILE(*LIBL/FOH2PF)
      *
     A          K FO2FIR
     A          K FO2NUM
     A          K FO2SUF
