      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *  Ordre-hode
      *
     A                                      REF(*LIBL/FFRF)
     A          R FOHETRR
     A            FOFIRM    R
     A            FONUMM    R
     A            FOSUFF    R
     A            FOLINE    R
     A            FOOTYP    R
     A            FOLETY    R
     A            FOLAGE    R
     A            FOBINR    R
     A            FOKREF    R
     A            FOBDAT    R
     A            FOLDAT    R
     A            FOPDAT    R
     A            FOPADA    R
     A            FOFKDA    R
     A            FOFFDA    R
     A            FOBETB    R
     A            FOSELG    R
     A            FODIST    R
     A            FOLMAT    R
     A            FOLBET    R
     A            FOVALK    R
     A            FORKAT    R
     A            FOSPED    R
     A            FOKJOR    R
     A            FOKJNR    R
     A            FOLASS    R
     A            FOMKOD    R
     A            FOLKUN    R
     A            FOKUND    R
     A            FOLDOR    R
     A            FOKUNA    R
     A            FONAVN    R
     A            FOADR1    R
     A            FOADR2    R
     A            FOSTED    R
     A            FOAVDE    R
     A            FOKONT    R
     A            FOSPES    R
     A            FOPROJ    R
     A            FOAKTI    R
     A            FOKOBK    R
     A            FOKGFA    R
     A            FOKGEK    R
     A            FOKGFR    R
     A            FOKSOB    R
     A            FOKTXT    R
     A            FOKFAK    R
     A            FONETO    R
     A            FOKSPR    R
     A            FOVREF    R
     A            FODREF    R
     A            FOKPNR    R
     A            FOREKV    R
     A            FOLMTX    R
     A            FOLBTX    R
     A            FORABP    R
     A            FOPASL    R
     A            FOPASK    R
     A            FOPORD    R
     A            FOPSUF    R
     A            FOKOLI    R
     A            FOKONR    R
     A            FOTOTX    R
     A            FOTOTS    R
     A            FOTOTR    R
     A            FOTOTK    R
     A            FOBRRA    R
     A            FOUSKR    R
     A            FOKODE    R
     A            FOUTSK    R
     A            FOPAKS    R
     A            FOITYP    R
     A            FOKOWS    R
     A            FOKOUS    R
     A            FOKODA    R
     A            FOKOTI    R
     A            FOBIND    R
     A            FOTDAT    R
     A            FODDAT    R
     A            FOREST    R
     A            FOADAT    R
     A            FOEDIH    R
     A            FOKPRO    R
     A            FOBKUN    R
     A            FOKKUN    R
     A            FOOLAG    R
     A            FONREF    R
     A            FOFSYS    R
     A            FOBENR    R
     A            FOBSUF    R
     A            FOMOBI    R
     A            FOKBNR    R
     A            FODEPO    R
     A            FODEPB    R
     A            FODEPT    R
     A            FOFATY    R
     A            FOBONG    R
     A            FOPLSE    R
     A            FOINF1    R
     A            FOINF2    R
     A            FOMERK    R
     A            FOLAOK    R
     A            FOSTIM    R
     A            FOUPRO    R
     A            FOWSID    R
     A            FOUSER    R
     A            FODATE    R
     A            FOTIME    R
     A            FOOOUS    R
     A            FOEDAT    R
     A            FOETIM    R
     A            FOEUSR    R
