      *
      *  Ordre-hode
      *
     A          R FOHEPFR                   PFILE(*LIBL/FOHEPF)
      *
     A          K FOFIRM
     A          K FOLDAT
     A          K FOKJOR
     A          K FOKJNR
     A          K FOKUND
