      *
      *  Ordre-hode
      *
     A          R FOHEPFR                   PFILE(*LIBL/FOHEPF)
      *
     A          K FOFIRM
     A          K FONAVN
     A          K FONUMM
     A          K FOSUFF
