      *
      *  Ordre-hode
      *
     A          R FOHETRR                   PFILE(*LIBL/FOHETR)
      *
     A          K FOFIRM
     A          K FONUMM
     A          K FOSUFF
