      *
      *  Ordre-hode
      *
     A          R FOHEPFR                   PFILE(*LIBL/FOHEPF)
      *
     A          K FOFIRM
     A          K FOKJOR
     A          K FOKJNR
     A          K FOPDAT
     A          K FOOTYP
     A          K FONUMM
     A          K FOSUFF
