      *
      * Ordre-hode
      *
     A          R FOHEPFR                   PFILE(*LIBL/FOHEPF)
      *
     A          K FOFIRM
     A          K FOPLSE
     A          K FOLDAT
     A          K FOOTYP
     A          K FOKJOR
     A          K FOKJNR
     A          K FONUMM
     A          K FOSUFF
