      *
      *  Faktura-hode
      *
     A          R FOHEPFR                   PFILE(*LIBL/FOHEPF)
      *
     A          K FOFIRM
     A          K FOSELG
     A          K FOBDAT
