      *
      *  Ordre-tekst
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/FFRF)
     A          R FOTXPFR
     A            FTFIRM    R
     A            FTNUMM    R
     A            FTSUFF    R
     A            FTLINE    R
     A            FTTYPE    R
     A            FTTEXT    R
6.24 A            FTPRTX    R
6.10 A            FTODAT    R
6.10 A            FTOTIM    R
6.10 A            FTOUSR    R
6.10 A            FTEDAT    R
6.10 A            FTETIM    R
6.10 A            FTEUSR    R
