      *
      *  Ordre-tekst
      *
     A          R FOTXPFR                   PFILE(*LIBL/FOTXPF)
      *
     A          K FTFIRM
     A          K FTNUMM
     A          K FTSUFF
     A          K FTLINE
