      *
      *  Overføringsfil til økonomisystemet Index=Read
      *
     A          R FOVFPFR
     A                                      PFILE(*LIBL/FOVFPF)
      *
     A          K FFFIRM
     A          K FFPERI
