      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
6.20  * R6.20 101010 NHO  Nye felter i forbilndelse med prosjekt
6.NU  * R6.20 220514 BOF  UTVIDELSE NUMMERSERIE
7.17  * K00   150720 ASK  LOGGING av TRANSER
      *
     A                                      REF(*LIBL/FFRF)
     A          R FOVFPFR
     A            FFFIRM    R
     A            FFPERI    R
     A            FFBUNT    R
     A            FFBILN    R
     A            FFBILL    R
     A            FFBDAT    R
     A            FFFDAT    R
     A            FFBILK    R
     A            FFTEXT    R
     A            FFDAVD    R
     A            FFDKTO    R
     A            FFDSPS    R
     A            FFDMOM    R
     A            FFBELP    R
     A            FFMVAG    R
     A            FFCAVD    R
     A            FFCKTO    R
     A            FFCSPS    R
     A            FFCMOM    R
     A            FFPROJ    R
     A            FFAKTI    R
     A            FFKREF    R
     A            FFKUND    R
     A            FFKIDI    R
     A            FFKIDR    R
     A            FFKSIF    R
     A            FFKID2    R
     A            FFVALK    R
     A            FFVALB    R
     A            FFMNGK    R
     A            FFMNGD    R
     A            FFAUTX    R
6.20 A            FFUPRO    R
6.20 A            FFARBO    R
7.17 A            FFLOGG    R
