      *
      *  Overføringsfil til økonomisystemet Index=Read
7.01  *  140220 Ny sortering vedr kreditavdeling/debetavdeling
     A          R FOVIPFR
     A                                      PFILE(*LIBL/FOVIPF)
      *
     A          K FFFIRM
     A          K FFPERI
     A          K FFBILN
     A          K FFDKTO
     A          K FFCKTO
7.01 A          K FFCAVD
7.01 A          K FFDAVD
