      *
      *  Overføringsfil til økonomisystemet Index=Read
      *
     A          R FOVUPFR
     A                                      PFILE(*LIBL/FOVUPF)
      *
     A          K FFFIRM
     A          K FFBILN
