      *
      *  Restede ordrelinjer ved utskrift av plukkliste
      *
     A                                      UNIQUE
     A          R FOWPPFR                   PFILE(*LIBL/FOWPPF)
      *
     A          K VWCFIR
     A          K VWCNUM
     A          K VWCSUF
     A          K VWCLIN
     A          K VWCVAR
