      *
      *  Restede ordrelinjer ved utskrift av plukkliste
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/FFRF)
     A          R FOWPPFR
     A            VWCFIR    R
     A            VWCNUM    R
     A            VWCSUF    R
     A            VWCLIN    R
     A            VWCVAR    R
     A            VWCTE1    R
     A            VWCTE2    R
     A            VWCENH    R
     A            VWCANT    R
     A            VWCANB    R
     A            VWCLAG    R
     A            VWCPLA    R
