      *
      *  Restede ordrelinjer ved utskrift av plukkliste
      *
     A          R FOWPPFR                   PFILE(*LIBL/FOWPPF)
      *
     A          K VWCFIR
     A          K VWCNUM
     A          K VWCSUF
