      *
      *  Utplukk-linje
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/FFRF)
     A          R FPLLPFR
     A            FKLFIR    R
     A            FKLONR    R
     A            FKLSUF    R
     A            FKLLIN    R
     A            FKLANT    R
     A            FKLKOD    R
