      *
      *  Utplukk-linje
      *
     A                                      UNIQUE
     A          R FPLLPFR                   PFILE(*LIBL/FPLLPF)
      *
     A          K FKLFIR
     A          K FKLONR
     A          K FKLSUF
     A          K FKLLIN
