      *
      *  Utplukk-param
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/FFRF)
     A          R FPLOPFR
     A            FKPFIR    R
     A            FKPONR    R
     A            FKPSUF    R
     A            FKPOTY    R
     A            FKPLAG    R
     A            FKPWSD    R
     A            FKPUSR    R
     A            FKPALT    R
     A            FKPDIR    R
     A            FKPRES    R
     A            FKPTXT    R
     A            FKPKOL    R
     A            FKPNET    R
     A            FKPBRU    R
     A            FKPLMT    R
     A            FKPFPR    R
     A            FKPFTE    R
     A            FKPEPR    R
     A            FKPETE    R
