      *
      *  Utplukk-param
      *
     A          R FPLOPFR                   PFILE(*LIBL/FPLOPF)
      *
     A          K FKPFIR
     A          K FKPONR
     A          K FKPSUF
