      *
      *  Plukk-1-linje
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/FFRF)
     A          R FPM1PFR
     A            FK1FIR    R
     A            FK1WSD    R
     A            FK1USR    R
     A            FK1LST    R
     A            FK1UTQ    R
     A            FK1OTY    R
     A            FK1ONR    R
     A            FK1SUF    R
     A            FK1VG0    R
     A            FK1VG1    R
     A            FK1VG2    R
     A            FK1VG3    R
     A            FK1PER    R
     A            FK1DAT    R
