      *
      *  Plukk-1-linje
      *
     A          R FPM1PFR                   PFILE(*LIBL/FPM1PF)
      *
     A          K FK1FIR
     A          K FK1WSD
     A          K FK1USR
     A          K FK1LST
