      *
      *  Plukk-2-linje
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/FFRF)
     A          R FPM2PFR
     A            FK2FIR    R
     A            FK2WSD    R
     A            FK2USR    R
     A            FK2LST    R
     A            FK2UTQ    R
     A            FK2OTY    R
     A            FK2ONR    R
     A            FK2SUF    R
     A            FK2VG0    R
     A            FK2VG1    R
     A            FK2VG2    R
     A            FK2VG3    R
     A            FK2PER    R
     A            FK2DAT    R
