      *
      * Pris recordformat
      *
     A                                      UNIQUE
     A          R FPRCPFR                   PFILE(*LIBL/FPRCPF)
      *
     A          K FCFIRM
     A          K FCRFMT
