      *
      * Spesialpris
      *
     A          R FPRIPFR                   PFILE(*LIBL/FPRIPF)
      *
     A          K FPFIRM
     A          K FPKUND
     A          K FPKPRO
     A          K FPVARE
     A          K FPPRGR
     A          K FPENHE
     A          K FPLETY
