      *
      * Spesialpris notat
      *
     A                                      REF(*LIBL/FFRF)
     A          R FPRNPFR
     A            FPNFIR    R
     A            FPNKUN    R
     A            FPNKPR    R
     A            FPNVAR    R
     A            FPNNO1    R
     A            FPNNO2    R
     A            FPNNO3    R
     A            FPNNO4    R
     A            FPNNO5    R
     A            FPNODA    R
6.10 A            FPNOTI    R
6.10 A            FPNOUS    R
     A            FPNEDA    R
     A            FPNETI    R
     A            FPNEUS    R
