      *
      * Spesialpris notat
      *
     A          R FPRNPFR                   PFILE(*LIBL/FPRNPF)
      *
     A          K FPNFIR
     A          K FPNVAR
     A          K FPNKUN
     A          K FPNKPR
