      *
      * Spesialpris work
      *
     A          R FPRWPFR                   PFILE(*LIBL/FPRWPF)
      *
     A          K FPFIRM
     A          K FPTEK1
     A          K FPVARE
     A          K FPENHE
     A          K FPLETY
