      *
      *  Plukk-S-linje
      *
     A                                      UNIQUE
     A          R FPSOPFR                   PFILE(*LIBL/FPSOPF)
      *
     A          K FKSFIR
     A          K FKSONR
     A          K FKSSUF
     A          K FKSTLL
     A          K FKSLIN
