      *
      *  Plukk-S-linje
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/FFRF)
     A          R FPSOPFR
     A            FKSFIR    R
     A            FKSONR    R
     A            FKSSUF    R
     A            FKSTLL    R
     A            FKSLIN    R
     A            FKSKOD    R
     A            FKSOTY    R
     A            FKSALT    R
     A            FKSSRT    R
     A            FKSANT    R
     A            FKSDIV    R
