      *
      *  Overføringsfil til økonomisystemet Index=Read
      *
     A          R FQFWPFR
     A                                      PFILE(*LIBL/FQFWPF)
      *
     A          K FFFIRM
     A          K FFBDAT
     A          K FFDBKR
     A          K FFDKTO
     A          K FFCKTO
     A          K FFBILK
     A*
