      *
      * Rabattmatrise
      *
     A          R FRABPFR                   PFILE(*LIBL/FRABPF)
      *
     A          K FRFIRM
     A          K FRKUND
     A          K FRKPRO
     A          K FROGRP
     A          K FRHGRP
     A          K FRUGRP
     A          K FRLDOR
     A          K FRMODN
     A          K FRVARE
     A          K FRPRGR
     A          K FRENHE
     A          K FRLETY
