      *
      * Rabattmatrise
      *
     A                                      REF(*LIBL/FFRF)
     A          R FRABPFR
     A            FRFIRM    R
     A            FRPRGR    R
     A            FRRKAT    R
     A            FRKKAT    R
     A            FRKUND    R
     A            FRKPRO    R
     A            FROGRP    R
     A            FRHGRP    R
     A            FRUGRP    R
     A            FRLDOR    R
     A            FRMODN    R
     A            FRVARE    R
     A            FRENHE    R
     A            FRLETY    R
     A            FRNOTA    R
6.13 A            FRPSLM    R
     A            FRRAB1    R
     A            FRRA1D    R
     A            FRRA1F    R
     A            FRRA1T    R
     A            FRRAB2    R
     A            FRRA2D    R
     A            FRRA2F    R
     A            FRRA2T    R
     A            FRRABN    R
     A            FRRAND    R
     A            FRRANF    R
     A            FRRANT    R
     A            FRRABB    R
     A            FRRABD    R
     A            FRRBUF    R
     A            FRRBUT    R
     A            FRRABT    R
     A            FRRATD    R
     A            FRRATF    R
     A            FRRATT    R
     A            FRDEKN    R
     A            FRDEKD    R
     A            FRDEKF    R
     A            FRDEKT    R
     A            FRODAT    R
6.10 A            FROTIM    R
6.10 A            FROUSR    R
     A            FREDAT    R
     A            FRETIM    R
     A            FREUSR    R
