      *
      * Rabattmatrise work
      *
     A                                      UNIQUE
     A          R FRAWPFR                   PFILE(*LIBL/FRAWPF)
      *
     A          K FRFIRM
     A          K FRPRGR
     A          K FRRKAT
     A          K FRKKAT
     A          K FRKUND
     A          K FRKPRO
     A          K FROGRP
     A          K FRHGRP
     A          K FRUGRP
     A          K FRLDOR
     A          K FRMODN
     A          K FRVARE
     A          K FRENHE
     A          K FRLETY
