      *
      *  Scannede pakksedler
      *
     A          R FSCNPFR                   PFILE(*LIBL/FSCNPF)
      *
     A          K FXFIRM
     A          K FXNUMM
     A          K FXSUFF
