      *
      *  Scannede pakksedler
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/FFRF)
     A          R FSCNPFR
     A            FXFIRM    R
     A            FXNUMM    R
     A            FXSUFF    R
     A            FXKODE    R
     A            FXODAT    R
6.10 A            FXOTIM    R
6.10 A            FXOUSR    R
     A            FXEDAT    R
     A            FXETIM    R
     A            FXEUSR    R
