      *
      * Fil for slettet logging av ordreforløp
      * 090512 BOF - Fjernet uniqe indeks
      *
     A          R FSLOPFR                   PFILE(*LIBL/FSLOPF)
      *
     A          K FUSFIR
     A          K FUSAAR
     A          K FUSNUM
     A          K FUSSUF
     A          K FUSKOD
     A          K FUSDAT
     A          K FUSTIM
