      *
      *  Pskkespesifikasjon linje
      *
     A          R FSPSPFR                   PFILE(*LIBL/FSPSPF)
      *
     A          K FSFIRM
     A          K FSNUMM
     A          K FSSUFF
     A          K FSLINE
     A          K FSPAKK
