      *
      *  Pakkespesifikasjon linje
      *
     A                                      REF(*LIBL/FFRF)
     A          R FSPSPFR
     A            FSFIRM    R
     A            FSNUMM    R
     A            FSSUFF    R
     A            FSLINE    R
     A            FSPAKK    R
     A            FSLENG    R
     A            FSDELT    R
6.10 A            FSODAT    R
6.10 A            FSOTIM    R
6.10 A            FSOUSR    R
6.10 A            FSEDAT    R
6.10 A            FSETIM    R
6.10 A            FSEUSR    R
