      *
      *  Ofak-kode
      *
     A                                      REF(*LIBL/FFRF)
     A          R FSTSPFR
     A            FAAFIR    R
     A            FAAORK    R
     A            FAAFAK    R
     A            FAADEL    R
     A            FAALSM    R
     A            FAABND    R
     A            FAAOTY    R
     A            FAALTY    R
     A            FAATTY    R
     A            FAAMVA    R
     A            FAALAG    R
     A            FAAHLA    R
     A            FAAHOY    R
     A            FAAMAN    R
     A            FAANXT    R
     A            FAABEH    R
     A            FAAKUN    R
     A            FAAKNR    R
     A            FAAVNR    R
     A            FAABIL    R
     A            FAADES    R
     A            FAAGRN    R
     A            FAASAK    R
     A            FAASA1    R
     A            FAASA2    R
     A            FAASAO    R
     A            FAAKHV    R
     A            FAAOT1    R
     A            FAAOT2    R
     A            FAAOT3    R
     A            FAAOT4    R
     A            FAAOT5    R
     A            FAAOT6    R
     A            FAAOT7    R
     A            FAAOT8    R
     A            FAAKJK    R
     A            FAANOB    R
     A            FAARK1    R
     A            FAARK2    R
     A            FAARK3    R
     A            FAARK4    R
     A            FAARK5    R
     A            FAARK6    R
     A            FAARK7    R
     A            FAARK8    R
     A            FAAGR0    R
     A            FAAGR1    R
     A            FAAGR2    R
     A            FAAGR3    R
     A            FAAGR4    R
     A            FAABL1    R
     A            FAABL2    R
     A            FAABL3    R
     A            FAABL4    R
     A            FAABL5    R
     A            FAAINK    R
     A            FAAKOS    R
     A            FAAEMV    R
     A            FAAIMV    R
     A            FAAOPF    R
     A            FAAUTG    R
     A            FAAPOP    R
     A            FAAVTY    R
     A            FAANOD    R
     A            FAAK98    R
     A            FAAPRT    R
6.2A A            FAALBE    R
6.2A A            FAALDS    R
6.2A A            FAAFSL    R
6.2A A            FAABFS    R
6.2C A            FAASSV    R
6.2C A            FAAMSA    R
6.2O A            FAAVIS    R
6.2O A            FAAK01    R
6.2O A            FAAK02    R
6.2O A            FAAK03    R
6.2O A            FAAK04    R
6.2O A            FAAK05    R
6.2O A            FAAK06    R
6.2O A            FAAK07    R
6.2O A            FAAK08    R
6.2O A            FAAK09    R
6.2O A            FAAK10    R
6.10 A            FAAODA    R
6.10 A            FAAOTI    R
6.10 A            FAAOUS    R
6.10 A            FAAEDA    R
6.10 A            FAAETI    R
6.10 A            FAAEUS    R
