      *
      *  Ofak-bruker
      *
     A**                                    UNIQUE
     A          R FUSRPFR                   PFILE(*LIBL/FUSRPF)
      *
     A          K FBFIRM
     A          K FBSELG
