      *
      * Lengdespesifikasjon linje
      *
     A                                      UNIQUE
     A          R FVLSPFR                   PFILE(*LIBL/FVLSPF)
      *
     A          K FVFIRM
     A          K FVNUMM
     A          K FVSUFF
     A          K FVLINE
     A          K FVLPNR
