      *
      * Lengdespesifikasjon linje
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/FFRF)
     A          R FVLSPFR
     A            FVFIRM    R
     A            FVNUMM    R
     A            FVSUFF    R
     A            FVLINE    R
     A            FVLPNR    R
     A            FVLENG    R
     A            FVANTA    R
6.10 A            FVODAT    R
6.10 A            FVOTIM    R
6.10 A            FVOUSR    R
6.10 A            FVEDAT    R
6.10 A            FVETIM    R
6.10 A            FVEUSR    R
