      *
      *  Arbeidsfile for synkronisering av bestilling/ordre
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/FFRF)
     A          R FWBOPFR
     A            WFFIRM    R
     A            WFNUMM    R
     A            WFSUFF    R
     A            WFLINE    R
     A            WFTYPE    R
     A            WFVARE    R
     A            WFTEK1    R
     A            WFENHE    R
     A            WFANTA    R
     A            WFSAPR    R
     A            WFSUMS    R
     A            WFBNUM    R
      *
     A            WFODAT    R
     A            WFOTIM    R
     A            WFOUSR    R
     A            WFEDAT    R
     A            WFETIM    R
     A            WFEUSR    R
      *
