      *
      * ARBEIDSREGISTER
      *
     A                                      UNIQUE
     A          R FWBOPFR                   PFILE(*LIBL/FWBOPF)
      *
     A          K WFFIRM
     A          K WFNUMM
     A          K WFSUFF
     A          K WFLINE
     A          K WFTYPE
