      *
      *  Faktura arbeidsfile - for gen. Autofakt-format
      *
     A          R FWFAPFR
     A                                      PFILE(*LIBL/FWFAPF)
      *
     A          K RECNO
