      *
      * Varegruppe-konvertering
      *
     A          R FXVGPFR                   PFILE(*LIBL/FXVGPF)
      *
     A          K FXFIRM
     A          K FXKODE
     A          K FXVGRP
