     A*  Returfile eksterne transaksjoner
     A*
     A          R GATRPFR                   PFILE(GATRPF)
     A* Nøkkel
     A          K GBGIRO
     A          K GBTYPE
     A          K GBOPPD
