     A*  Avtaleregister
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GAVTPFR
     A            GCSTAT    R
     A            GCBGIR    R
     A            GCPGIR    R
     A            GCDATO    R
     A            GCKOMM    R
     A            GCFILG    R
     A            GCFIRM    R
     A            GCLØPN    R
     A            GCAVTN    R
     A            GCSKTO    R
     A            GCSKOD    R
     A            GCSLOK    R
     A            GCBANK    R
     A            GCHKON    R
     A            GCAVDE    R
     A            GCSPES    R
