     A*  Kopi av Returer fra banken.
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GBTRPFR
     A            GFRECO    R
     A            GFGIRO    R
     A            GFLØPN    R
     A            GFTYPE    R
     A            GFTELL    R
     A            GFOPPD    R
     A            GFDATO    R
     A            GFKLOK    R
     A            GFFGRP    R
     A            GFFIRM    R
     A* Nøkkel
     A          K GFGIRO
     A          K GFLØPN
