     A*  Returfile eksterne transaksjoner
     A*
     A          R GBTRPFR                   PFILE(GBTRPF)
     A* Nøkkel
     A          K GFGIRO
     A          K GFLØPN
     A          K GFTYPE
     A          K GFTELL
