     A*  Returfile eksterne transaksjoner
     A*
     A          R GBTRPFR                   PFILE(GBTRPF)
     A* Nøkkel
     A          K GFFGRP
     A          K GFFIRM
     A          K GFTYPE
     A          K GFDATO
