      *
      *  EDI-meldinger betingelser/grenseverdier for omregning
      *
     A                                      REF(*LIBL/MFRF)
     A          R GEDGPFR
     A            GGFIRM    R
     A            GGSTAT    R
     A            GGNBEL    R
     A            GGOBEL    R
      *
     A            GGMAI1    R
     A            GGMAI2    R
     A            GGMAI3    R
     A            GGTXT1    R
     A            GGTXT2    R
     A            GGTXT3    R
      *
     A            GGKK01    R
     A            GGKK02    R
     A            GGKK03    R
     A            GGKK04    R
     A            GGKK05    R
     A            GGKK06    R
     A            GGKK07    R
     A            GGKK08    R
     A            GGKK09    R
     A            GGKK10    R
     A            GGKK11    R
     A            GGKK12    R
     A            GGKK13    R
     A            GGKK14    R
     A            GGKK15    R
     A            GGKK16    R
     A            GGKK17    R
     A            GGKK18    R
     A            GGKK19    R
     A            GGKK20    R
     A            GGKK21    R
     A            GGKK22    R
     A            GGKK23    R
     A            GGKK24    R
     A            GGKK25    R
      *
     A            GGLK01    R
     A            GGLK02    R
     A            GGLK03    R
     A            GGLK04    R
     A            GGLK05    R
     A            GGLK06    R
     A            GGLK07    R
     A            GGLK08    R
     A            GGLK09    R
     A            GGLK10    R
      *
     A            GGFDAT    R
     A            GGFTID    R
     A            GGUDAT    R
     A            GGUTID    R
     A            GGSDAT    R
     A            GGSTID    R
      *
     A            GGODAT    R
     A            GGOTIM    R
     A            GGOUSR    R
     A            GGEDAT    R
     A            GGETIM    R
     A            GGEUSR    R
