      *
      *  EDI-meldinger omregnet              Index=Update
      *
     A**                                    UNIQUE
     A          R GEDGPFR
     A                                      PFILE(*LIBL/GEDGPF)
      *
     A          K GGFIRM
      *
