      *
      *  EDI-retur PK1                 Index=Bestilling,linje
      *
     A          R GEDIPFR
     A                                      PFILE(*LIBL/GEDIPF)
      *
     A          K GIFIRM
     A          K GITYPE
     A          K GIMNUM
     A          K GIMLIN
