      *
      *  EDI-retur meldinger - PK1
      *
     A                                      REF(*LIBL/MFRF)
     A          R GEDIPFR
     A            GIFIRM    R
     A            GIKODE    R
     A            GITYPE    R
     A            GIMNUM    R
     A            GIMLIN    R
     A            GIMDAT    R
     A            GIMTID    R
     A            GINUMM    R
     A            GISUFF    R
     A            GILINE    R
     A            GILDOR    R
     A            GIKUND    R
     A            GIMELD    R
     A            GISTAT    R
     A            GIODAT    R
     A            GIOTIM    R
     A            GIOUSR    R
     A            GIEDAT    R
     A            GIETIM    R
     A            GIEUSR    R
