      *
      *  EDI-retur PK1                       Index=Read
      *
     A          R GEDIPFR
     A                                      PFILE(*LIBL/GEDIPF)
      *
     A          K GIFIRM
     A          K GIMNUM
     A          K GIMLIN
