      *
      *  EDI-retur PK1                 Index=Dato,bestilling,linje
      *
     A          R GEDIPFR
     A                                      PFILE(*LIBL/GEDIPF)
      *
     A          K GIFIRM
     A          K GITYPE
     A          K GINUMM
     A          K GISUFF
     A          K GILINE
     A          K GIMNUM
     A          K GIMLIN
