      *
      *  EDI-retur PK1                 Index=Meldingsnummer,bestilling, suffix
      *
     A          R GEDIPFR
     A                                      PFILE(*LIBL/GEDIPF)
      *
     A          K GIFIRM
     A          K GIMNUM
     A          K GINUMM
     A          K GISUFF
