      *
      *  EDI-meldinger omregnet              Index=Update
      *
     A**                                    UNIQUE
     A          R GEDLPFR
     A                                      PFILE(*LIBL/GEDLPF)
      *
     A          K GLFIRM
     A          K GLTYPE
     A          K GLMNUM
     A          K GLMLIN
