      *
      * GE Money Bank Spesifikasjon
      *
     A          R GEMONBPFR
     A            GEMONB       400A         TEXT('GE Money Bank Spec')
     A                                      COLHDG('GE MB Spec')
