     A*  Koderegister - Statusopplysninger Betalingsformidling
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GFASPFR
     A            GEFSTA    R
     A            GEFFIR    R
     A            GEFFIN    R
     A            GEFUBF    R
     A            GEFOPE    R
     A            GEFPWD    R
     A            GEFDIV    R
     A            GEFEFS    R
     A            GEFFOS    R
     A            GEFFO2    R
     A            GEFDAT    R
     A            GEFTIM    R
     A            GEFDAS    R
     A            GEFDDA    R
     A            GEFBAN    R
     A            GEFSBF    R
     A            GEFKOM    R
     A            GEFSAM    R
     A            GEFLON    R
     A            GEFIFS    R
     A* Nøkkel
     A          K GEFFIR
