     A*  Koderegister - Status Betalingsformidling, Logisk file for update
     A*
     A          R GFASPFR                   PFILE(GFASPF)
     A* Nøkkel
     A          K GEFFIR
