     A*  GINKPF - INKASSORETURER
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GINKPFR
     A            GDQINK    R
