     A*  Kopi av utbetalingsforslag
     A*
     A          R GKBFPFR                   PFILE(GKBFPF)
     A* Nøkkel
     A          K GKFIRM
     A          K GKOPDA
