     A*  GKTOPF - Returer fra Kontoavst. lest inn via kommunikasjon:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GKTOPFR
     A            GDQKTO    R
