     A*  GKTUPF - Returer fra Kontoavstemming - Records blir lagret
     A*  for å kunne behandles ved et ev. senere tidspunkt.
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GKTUPFR
     A            GDQKTO    R
