     A*  Lønn
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GLONPFR
     A            GLFIRM         3  0
     A                                      TEXT('Firma........')
     A            GLLONR         5  0
     A                                      TEXT('Lønnsnummer..')
     A            GLDATO    R               REFFLD(ROBDAT)
     A            GLNAVN        25
     A                                      TEXT('Navn.........')
     A            GLADRE        25
     A                                      TEXT('Gateadresse..')
     A            GLPONR    R               REFFLD(RLPONR)
     A                                      TEXT('Postnummer...')
     A            GLPOST        16
     A                                      TEXT('Poststed.....')
     A            GLBKTO    R               REFFLD(RLBGIR)
     A                                      TEXT('Kontonummer..')
     A            GLBELØ    R               REFFLD(ROBELØ)
     A                                      TEXT('Beløp........')
     A            GLSTAT         1
     A                                      TEXT('Statuskode...')
     A            GLTEXT        21
     A                                      TEXT('Teksfelt.....')
