     A*  GOCRPF - Returer fra OCR og BBS lest inn via kommunikasjon:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GOCRPFR
     A            GDQOCR    R
