     A*  GORTPF - OCR-returer valgt ut til oppdatering:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GORTPFR
     A            GDQOCO    R
     A            GDQOFI    R
