     A*  GPCFPF - NAVNSETTING AV FILER TIL/FRA BANKEN
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GPCFPFR
     A            GDFFGR    R
     A            GDFFIR    R
     A            GDFREM    R
     A            GDFMOT    R
     A            GDFAVR    R
     A            GDFOCR    R
     A            GDFKTO    R
     A            GDFINK    R
     A            GDFTFF    R
      * Nøkkel
     A          K GDFFGR
     A          K GDFFIR
