     A*  GRETPF - Samlefile for returer lest inn via kommunikasjon:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GRETPFR
     A            GDQRET    R
