     A*  GSEPPF - Splitter SEPA file for lesing til GATRPF
     A*
     A          R GSEPPFR
     A            GSQSEP      0160A         COLHDG('HELE RECORDEN')
     A
