     A*  GTGIPF - Returer fra Telegiro lest inn via kommunikasjon:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GTGIPFR
     A            GDQTGI    R
