     A*  Telegiro, returfile.
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GTRTPFR
     A            GDQBET    R
     A            GDQFGR    R
     A            GDQFIR    R
     A            GDQDAT    R
     A            GDQTIM    R
