     A*  Telegiro, returfile
     A*
     A          R GTRTPFR                   PFILE(GTRTPF)
     A* Nøkkel
     A          K GDQFGR
     A          K GDQFIR
