     A*  BETFOR00-Identifikasjonstransaksjon-Innenlands
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GU00PFR
     A            GDHHID    R
     A            GDHVER    R
     A            GDHRET    R
     A            GDHRID    R
     A            GDHTRD    R
     A            GDHTRS    R
     A            GDHTRK    R
     A            GDHBRU    R
     A            GDHANT    R
     A            GDHB00    R
     A            GDHFOR    R
     A            GDHDIV    R
     A            GDHSKF    R
     A            GDHRE1    R
     A            GDHPRO    R
     A            GDHPWD    R
     A            GDHRVE    R
     A            GDHNPW    R
     A            GDHOPN    R
     A            GDHSIB    R
     A            GDHSID    R
     A            GDHSIN    R
     A            GDHSIH    R
     A            GDHRE2    R
     A            GDHAEB    R
     A            GDHRE3    R
     A*
     A            GDHFGR    R
     A            GDHFIR    R
     A            GDHUBF    R
     A* Nøkkel
