     A*  BETFOR00
     A*
     A          R GU00PFR                   PFILE(GU00PF)
     A* Nøkkel
     A          K GDHFGR
     A          K GDHFIR
     A          K GDHRID
     A          K GDHUBF
