     A*  BETFOR01
     A*
     A          R GU01PFR                   PFILE(GU01PF)
     A* Nøkkel
     A          K GDAFGR
     A          K GDAFIR
     A          K GDARID
     A          K GDAUBF
     A          K GDATEL
