      *  BETFOR01-Overførselstransaksjon-Utenlands
      *
     A                                      REF(*LIBL/RFRF)
      *
     A          R GU01PFR
      *
     A            GDAHID    R
     A            GDAVER    R
     A            GDARET    R
     A            GDARID    R
     A            GDATRD    R
     A            GDATRS    R
     A            GDATRK    R
     A            GDABRU    R
     A            GDAANT    R
     A            GDAB01    R
     A            GDAFOR    R
     A            GDAKTO    R
     A            GDASKF    R
     A            GDAREF    R
     A            GDABET    R
     A            GDAVAL    R
     A            GDAEG1    R
     A            GDAFGR    R
     A            GDAEG2    R
     A            GDAFIR    R
     A            GDALEV    R
     A            GDABEV    R
     A            GDAFAV    R
     A            GDAOUT    R
     A            GDAONO    R
     A            GDAVAA    R
     A            GDAHAS    R
     A            GDAAVT    R
     A            GDATNR    R
     A            GDATKU    R
     A            GDASJE    R
     A            GDARE1    R
     A            GDAREK    R
     A            GDARE2    R
     A            GDABBE    R
     A            GDAOBE    R
     A            GDARE3    R
     A            GDAEFF    R
     A            GDAAVM    R
     A            GDASLE    R
     A            GDASBP    R
     A            GDAVKO    R
     A            GDAPRO    R
     A            GDAKMN    R
     A            GDARE4    R
     A*
     A            GDAUBF    R
     A            GDATEL    R
