      *  BETFOR02-Bankforbindelse-Utenlands
      *
     A                                      REF(*LIBL/RFRF)
      *
     A          R GU02PFR
      *
     A            GDBHID    R
     A            GDBVER    R
     A            GDBRET    R
     A            GDBRID    R
     A            GDBTRD    R
     A            GDBTRS    R
     A            GDBTRK    R
     A            GDBBRU    R
     A            GDBANT    R
     A            GDBB02    R
     A            GDBFOR    R
     A            GDBKTO    R
     A            GDBSKF    R
     A            GDBREF    R
     A            GDBSWI    R
     A            GDBBNA    R
     A            GDBBA1    R
     A            GDBBA2    R
     A            GDBBA3    R
     A            GDBSRB    R
     A            GDBMLK    R
     A            GDBRE1    R
     A*
     A            GDBFGR    R
     A            GDBFIR    R
     A            GDBUBF    R
     A            GDBTEL    R
      *
