      *  BETFOR03-Mottakertransaksjons Utenlands
      *
     A                                      REF(*LIBL/RFRF)
      *
     A          R GU03PFR
      *
     A            GDCHID    R
     A            GDCVER    R
     A            GDCRET    R
     A            GDCRID    R
     A            GDCTRD    R
     A            GDCTRS    R
     A            GDCTRK    R
     A            GDCBRU    R
     A            GDCANT    R
     A            GDCB03    R
     A            GDCFOR    R
     A            GDCKTO    R
     A            GDCSKF    R
     A            GDCREF    R
     A            GDCMKO    R
     A            GDCMNA    R
     A            GDCMA1    R
     A            GDCMA2    R
     A            GDCMA3    R
     A            GDCMLA    R
     A            GDCTTX    R
     A            GDCTLA    R
     A            GDCTTN    R
     A            GDCATT    R
     A            GDCRE1    R
     A*
     A            GDCFGR    R
     A            GDCFIR    R
     A            GDCUBF    R
     A            GDCTEL    R
