     A*  BETFOR03
     A*
     A          R GU03PFR                   PFILE(GU03PF)
     A* Nøkkel
     A          K GDCFGR
     A          K GDCFIR
     A          K GDCRID
     A          K GDCUBF
     A          K GDCTEL
