      *  BETFOR04-Overførselstransaksjon  Utenlands
      *
     A                                      REF(*LIBL/RFRF)
      *
     A          R GU04PFR
     A            GDDHID    R
     A            GDDVER    R
     A            GDDRET    R
     A            GDDRID    R
     A            GDDTRD    R
     A            GDDTRS    R
     A            GDDTRK    R
     A            GDDBRU    R
     A            GDDANT    R
     A            GDDB04    R
     A            GDDFOR    R
     A            GDDKTO    R
     A            GDDSKF    R
     A            GDDREF    R
     A            GDDMT1    R
     A            GDDMBT    R
     A            GDDMT2    R
     A            GDDMBD    R
     A            GDDEVA    R
     A            GDDEBH    R
     A            GDDFGR    R
     A            GDDFIR    R
     A            GDDUBF    R
     A            GDDBFL    R
      *
     A            GDDEG1    R
     A            GDDEBL    R
     A            GDDBEL    R
     A            GDDDBK    R
     A            GDDBAK    R
     A            GDDBGJ    R
     A            GDDTEK    R
     A            GDDRE1    R
     A            GDDRE2    R
     A            GDDVIP    R
     A            GDDRE3    R
     A            GDDRE4    R
     A            GDDLØP    R
     A            GDDRE5    R
     A            GDDTEL    R
