     A*  BETFOR04
     A*
     A          R GU04PFR                   PFILE(GU04PF)
     A* Nøkkel
     A          K GDDFGR
     A          K GDDFIR
     A          K GDDRID
     A          K GDDUBF
     A          K GDDBFL
