     A*  BETFOR21-Overførselstransaksjon-Innenlands
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GU21PFR
     A            GDJHID    R
     A            GDJVER    R
     A            GDJRET    R
     A            GDJRID    R
     A            GDJTRD    R
     A            GDJTRS    R
     A            GDJTRK    R
     A            GDJBRU    R
     A            GDJANT    R
     A            GDJB21    R
     A            GDJFOR    R
     A            GDJKTO    R
     A            GDJSKF    R
     A            GDJREF    R
     A            GDJBET    R
      *
     A            GDJKOD    R
     A            GDJEG1    R
     A            GDJFGR    R
     A            GDJEG2    R
     A            GDJFIR    R
     A            GDJLEV    R
      *
     A            GDJRE1    R
     A            GDJMOK    R
     A            GDJMON    R
     A            GDJAD1    R
     A            GDJAD2    R
     A            GDJPNR    R
     A            GDJPOS    R
     A            GDJBEG    R
     A            GDJTKO    R
     A            GDJTTY    R
     A            GDJSLE    R
     A            GDJTOT    R
     A            GDJRE2    R
     A            GDJVAD    R
     A            GDJRE3    R
     A*
     A            GDJUBF    R
     A            GDJTEL    R
