     A*  BETFOR23-Fakturatransaksjon-Innenlands
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GU23PFR
     A            GDLHID    R
     A            GDLVER    R
     A            GDLRET    R
     A            GDLRID    R
     A            GDLTRD    R
     A            GDLTRS    R
     A            GDLTRK    R
     A            GDLBRU    R
     A            GDLANT    R
     A            GDLB23    R
     A            GDLFOR    R
     A            GDLKTO    R
     A            GDLSKF    R
     A            GDLREF    R
     A            GDLMF1    R
     A            GDLKID    R
     A            GDLRAB    R
     A            GDLBDA    R
     A            GDLFGR    R
     A            GDLFIR    R
     A            GDLUBF    R
     A            GDLBFL    R
     A            GDLEG1    R
     A            GDLBEL    R
     A            GDLDBK    R
     A            GDLRE1    R
     A            GDLLØP    R
     A            GDLRE2    R
     A*
     A            GDLTEL    R
