     A*  Utbetalingsforslag - Leverandører
     A*
     A          R GABFPFR                   PFILE(GUBFPF)
     A* Nøkkel
     A          K GAFIRM
     A          K GABFNR
     A          K GANAVN
     A          K GAFDAT
     A          K GAVALK
     A          K GAKIDS
     A          K GABELØ
     A          K GABDAT
     A          K GATIST
     A*
     A          S GAREKO                    COMP(EQ 'F')
     A* ******
     A* SELECT
     A* ******
     A* Velger kun poster med returkode "F", d.v.s. poster i forslaget
     A* hvor det er mottatt feilretur i fra banken.  Filen brukes
     A* bl.a. i prgram GL105R for å gjøre det mulig å kun overføre
     A* på nytt poster hvor det er mottatt feilretur.
