     A*  Utbetalingsforslag - Leverandører
     A*
     A          R GABFPFR                   PFILE(GUBFPF)
     A* Nøkkel
     A          K GAFIRM
     A          K GABFNR
     A          K GABFLI
