     A*  Utbetalingsforslag - Leverandører
     A*
     A          R GABFPFR                   PFILE(GUBFPF)
     A* Nøkkel
     A          K GAFIRM
     A          K GABFNR
     A          K GALEVR
     A          K GAFDAT
     A          K GAVALK
     A          K GAKIDS
     A          K GABELØ
     A          K GABDAT
     A          K GATIST
