     A*  Utbetalingsforslag - Leverandører
     A*
     A          R GABFPFR                   PFILE(GUBFPF)
     A* Nøkkel
     A          K GAFIRM
     A          K GAFDAT
     A          K GALEVR
     A          K GABELØ
     A*
