     A*  Deklarasjonskoder
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GUDKPFR
     A            GDRDEC    R
     A            GDRTX1    R
     A            GDRTX2    R
     A* Nøkkel
     A          K GDRDEC
