     A*  1. gangs retur fra bank - Lønn:
     A*
     A          R GUL1PFR                   PFILE(GUL1PF)
     A* Nøkkel
     A          K GDSFIR
     A          K GDSUBF
     A          K GDSBFL
     A*
