     A*  1. gangs retur fra bank - lønn
     A*
     A          R GUL1PFR                   PFILE(GUL1PF)
     A* Nøkkel
     A          K GDSFIR
     A          K GDSFOR
     A          K GDSLON
     A          K GDSUBF
     A          K GDSBFL
