     A*  1. gangs retur fra Bank - Lønn:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GUL1PFR
     A            GDSFIR    R
     A            GDSFOR    R
     A            GDSLON    R
     A            GDSNAV    R
     A            GDSREF    R
     A            GDSBEL    R
     A            GDSTKI    R
     A            GDSUBF    R
     A            GDSBFL    R
     A            GDSOPP    R
     A*
     A* Nøkkel
     A          K GDSFIR
     A          K GDSFOR
     A          K GDSLON
     A          K GDSUBF
     A          K GDSBFL
