     A*  2. gangs retur fra Bank - Lønn:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GUL2PFR
     A            GDTFIR    R
     A            GDTFOR    R
     A            GDTLON    R
     A            GDTNAV    R
     A            GDTREF    R
     A            GDTBEL    R
     A            GDTTKI    R
     A            GDTUBF    R
     A            GDTBFL    R
     A            GDTOPP    R
     A*
     A* Nøkkel
     A          K GDTFIR
     A          K GDTFOR
     A          K GDTLON
     A          K GDTUBF
     A          K GDTBFL
