     A*  Feilretur fra Bank.
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GULFPFR
     A**
     A            GDVFIR    R
     A            GDVTRK    R
     A            GDVRET    R
     A            GDVFOR    R
     A            GDVLON    R
     A            GDVNAV    R
     A            GDVUBF    R
     A            GDVBFL    R
     A            GDVOPP    R
     A* Nøkkel
     A          K GDVFIR
