     A*  1. gangs retur fra bank.
     A*
     A          R GUR1PFR                   PFILE(GUR1PF)
     A* Nøkkel
     A          K GDNFIR
     A          K GDNUBF
     A          K GDNBFL
     A*
