     A*  1. gangs retur fra bank.
     A*
     A          R GUR1PFR                   PFILE(GUR1PF)
     A* Nøkkel
     A          K GDNFIR
     A          K GDNFOR
     A          K GDNVAL
     A          K GDNLEV
     A          K GDNUBF
     A          K GDNBFL
     A*
     A          O GDNVAL                    COMP(EQ '   ')
     A* ****
     A* OMIT
     A* ****
     A* Velger kun poster med valutakode, d.v.s. utenlands.
