     A*  2. gangs retur fra bank.
     A*
     A          R GUR2PFR                   PFILE(GUR2PF)
     A* Nøkkel
     A          K GDOFIR
     A          K GDOFOR
     A          K GDOVAL
     A          K GDOLEV
     A          K GDOUBF
     A          K GDOBFL
     A*
     A          O GDOVAL                    COMP(EQ '   ')
     A* ****
     A* OMIT
     A* ****
     A* Velger kun poster med valutakode, d.v.s. utenlands.
