     A*  Feilretur fra Bank.
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GURFPFR
     A            GDPFIR    R
     A            GDPTRK    R
     A            GDPRET    R
     A            GDPFOR    R
     A            GDPLEV    R
     A            GDPBNR    R
     A            GDPUBF    R
     A            GDPBFL    R
     A            GDPOPP    R
     A*
     A* Nøkkel
     A          K GDPFIR
