     A*  Kvitteringsfile for mottaksretur fra bank
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GURMPFR
     A            GDMFGR    R
     A            GDMFIR    R
     A            GDMUBF    R
     A            GDMRKO    R
     A            GDMRID    R
     A            GDMDAT    R
     A            GDMTIM    R
     A            GDMTXT    R
