     A*  Kvitteringsfile for mottaksretur fra bank
     A*
     A          R GURMPFR                   PFILE(GURMPF)
     A* Nøkkel
     A          K GDMFGR
     A          K GDMFIR
     A          K GDMUBF
     A          K GDMRKO
     A          K GDMRID
     A          K GDMDAT
     A          K GDMTIM
