     A*  Sekvensteller
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GUSTPFR
     A            GDUFOR    R
     A            GDUSB1    R
     A            GDUSB2    R
     A            GDUDAT    R
     A            GDUTIM    R
     A* Nøkkel
     A          K GDUFOR
