     A*  GWSEPF - Vasker innhold i XML file
     A*
     A          R GWSEPFR
     A            GWSXML      1024A         COLHDG('HELE RECORDEN')
     A
