     A*  Overstyring av GU00PF - BETFOR00:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GU00PFR
     A            GDHDE0    R
     A            GDHRID    R
     A            GDHDE1    R
     A            GDHTRS    R
     A            GDHDE2    R
     A            GDHSKF    R
     A            GDHDE3    R
     A            GDHFGR    R
     A            GDHFIR    R
     A            GDHUBF    R
     A* Nøkkel
     A          K GDHFGR
     A          K GDHFIR
     A          K GDHRID
     A          K GDHUBF
