     A*  Overstyring av GU01L1 - BETFOR01:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GU01PFR
     A            GDADE0    R
     A            GDARID    R
     A            GDADE1    R
     A            GDATRS    R
     A            GDADE2    R
     A            GDASKF    R
     A            GDADE3    R
     A            GDAFGR    R
     A            GDADE4    R
     A            GDAFIR    R
     A            GDADE5    R
     A            GDAUBF    R
     A            GDATEL    R
     A* Nøkkel
     A          K GDAFGR
     A          K GDAFIR
     A          K GDARID
     A          K GDAUBF
     A          K GDATEL
