     A*  Overstyring av GU03PF - BETFOR03:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GU03PFR
     A            GDCDE0    R
     A            GDCRID    R
     A            GDCDE1    R
     A            GDCTRS    R
     A            GDCDE2    R
     A            GDCSKF    R
     A            GDCDE3    R
     A            GDCFGR    R
     A            GDCFIR    R
     A            GDCUBF    R
     A            GDCTEL    R
     A* Nøkkel
     A          K GDCFGR
     A          K GDCFIR
     A          K GDCRID
     A          K GDCUBF
     A          K GDCTEL
