     A*  Overstyring av GU04PF - BETFOR04:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GU04PFR
     A            GDDDE0    R
     A            GDDRID    R
     A            GDDDE1    R
     A            GDDTRS    R
     A            GDDDE2    R
     A            GDDSKF    R
     A            GDDDE3    R
     A            GDDFGR    R
     A            GDDFIR    R
     A            GDDUBF    R
     A            GDDBFL    R
     A            GDDDE4    R
     A            GDDTEL    R
     A* Nøkkel
     A          K GDDFGR
     A          K GDDFIR
     A          K GDDRID
     A          K GDDUBF
     A          K GDDTEL
