     A*  Overstyring av GU21PF - BETFOR21:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GU21PFR
     A            GDJDE0    R
     A            GDJRID    R
     A            GDJDE1    R
     A            GDJTRS    R
     A            GDJDE2    R
     A            GDJSKF    R
     A            GDJDE3    R
     A            GDJFGR    R
     A            GDJDE4    R
     A            GDJFIR    R
     A            GDJDE5    R
     A            GDJUBF    R
     A            GDJTEL    R
     A* Nøkkel
     A          K GDJFGR
     A          K GDJFIR
     A          K GDJRID
     A          K GDJUBF
     A          K GDJTEL
