     A*  Overstyring av GU22PF - BETFOR22:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GU22PFR
     A            GDKDE0    R
     A            GDKRID    R
     A            GDKDE1    R
     A            GDKTRS    R
     A            GDKDE2    R
     A            GDKSKF    R
     A            GDKDE3    R
     A            GDKUBF    R
     A            GDKDE4    R
     A            GDKFGR    R
     A            GDKFIR    R
     A            GDKTEL    R
     A* Nøkkel
     A          K GDKFGR
     A          K GDKFIR
     A          K GDKRID
     A          K GDKUBF
     A          K GDKTEL
