     A*  Overstyring av GU99PF - BETFOR99:
     A*
     A                                      REF(*LIBL/RFRF)
     A          R GU99PFR
     A            GDZDE0    R
     A            GDZRID    R
     A            GDZDE1    R
     A            GDZTRS    R
     A            GDZDE2    R
     A            GDZSKF    R
     A            GDZDE3    R
     A            GDZATR    R
     A            GDZDE4    R
     A            GDZFGR    R
     A            GDZFIR    R
     A            GDZUBF    R
     A            GDZTOT    R
     A            GDZIUK    R
     A* Nøkkel
     A          K GDZFGR
     A          K GDZFIR
     A          K GDZUBF
     A          K GDZRID
