      *
      * Kunderegister for ekstern scanning
      *
     A                                      REF(*LIBL/LFRF)
     A          R HBKUPFR
     A            HKINFO    R
      *
     A          K HKINFO
