      *
      * Håndterminalfil
      *
     A                                      REF(*LIBL/LFRF)
     A          R HBTRPFR
     A            HOINFO    R
