      *
      * Vare-/prisregister for ekstern scanning av vare
      *
     A                                      REF(*LIBL/LFRF)
     A          R HBVAPFR
     A            HVINFO    R
      *
     A          K HVINFO
