      *
      * Vare/eannr-register for ekstern scanning av vare
      *
     A                                      REF(*LIBL/LFRF)
     A          R HBVEPFR
     A            HEINFO    R
      *
     A          K HEINFO
