      *
      * Håndterminal ordre-linje
      *
     A                                      REF(*LIBL/LFRF)
     A          R HODTPFR
     A            HDFIRM    R
     A            HDREFN    R
     A            HDVARE    R
     A            HDENHE    R
     A            HDANTA    R
     A            HDDATO    R
     A            HDTIME    R
