      *
      * Håndterminal ordre-linje            Index=Read
      *
     A          R HODTPFR
     A                                      PFILE(*LIBL/HODTPF)
      *
     A          K HDFIRM
     A          K HDVARE
