      *
      * Håndterminal ordre-hode             Index=KUND/REFN
      *
     A          R HOHEPFR
     A                                      PFILE(*LIBL/HOHEPF)
      *
     A          K HOFIRM
     A          K HOKUND
     A          K HOREFN
