      *
      * Håndterminal ordre-hode
      *
     A                                      REF(*LIBL/LFRF)
     A          R HOHEPFR
     A            HOFIRM    R
     A            HOREFN    R
6.20 A            HOAVDE    R
6.20 A            HOLAGE    R
     A            HOKUND    R
     A            HOKPRO    R
     A            HOSELG    R
     A            HONAVN    R
     A            HODREF    R
     A            HOREKV    R
     A            HODATO    R
     A            HOTIME    R
     A            HOSTAT    R
