      *
      * Temporær håndterminalfil
      *
     A          R HOHXPFR
     A            HXFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            HXREFN         8S 0       TEXT('Referansenr')
     A                                      COLHDG('Referansenr')
     A                                      EDTCDE(Z)
     A            HXAVDE         4S 0       TEXT('Avdeling')
     A                                      COLHDG('Avdeling')
     A                                      EDTCDE(Z)
     A            HXLAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
      *
     A            HXEODA          L         TEXT('Dato opprettet')
     A                                      COLHDG('Dato' 'opprettet')
     A            HXEOTI          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
     A            HXEOUS        10A         TEXT('Opprettet av')
     A                                      COLHDG('Oppr. av')
      *
     A            HXEEDA          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
     A            HXEETI          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
     A            HXEEUS        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
