      *
      * Temporær håndterminalfil            Index
      *
     A                                      UNIQUE
     A          R HOHXPFR
     A                                      PFILE(*LIBL/HOHXPF)
      *
     A          K HXFIRM
     A          K HXREFN
