      *
      * Radioterminal trans                 Index=Update
      *
     A                                      UNIQUE
     A          R HRTRPFR
     A                                      PFILE(*LIBL/HRTRPF)
      *
     A          K HRFIRM
     A          K HRKODE
     A          K HRTIMS
     A          K HRVARE
     A          K HRENHE
