      *
      * Radioterminal trans                 Index=DATO/TIME
      *
     A          R HRTRPFR
     A                                      PFILE(*LIBL/HRTRPF)
      *
     A          K HRFIRM
     A          K HRKODE
     A          K HRTIMS
     A          K HRDATO
     A          K HRTIME
