      *
      * Radioterminal trans
      *
     A                                      REF(*LIBL/LFRF)
     A          R HRTRPFR
     A            HRFIRM    R
     A            HRKODE    R
     A            HRTIMS    R
     A            HRVARE    R
     A            HRENHE    R
     A            HRANTA    R
     A            HRSAIM    R
     A            HREANN    R
     A            HREKOD    R
     A            HRSTAT    R
     A            HRDATO    R
     A            HRTIME    R
