      *
      * Radioterminal trans                 Index=DATO/TIME desc.
      *
     A          R HRTRPFR
     A                                      PFILE(*LIBL/HRTRPF)
      *
     A          K HRFIRM
     A          K HRKODE
     A          K HRTIMS
     A          K HRDATO                    DESCEND
     A          K HRTIME                    DESCEND
