     A*
     A*  Rutine-regsiter
     A*
     A                                      REF(*LIBL/IADFRF)
     A          R IADTPFR
     A            IADTFR    R
     A            IADTKO    R
     A            IADTRU    R
     A            IADTXT    R
     A            IADTSP    R
     A            IADTV1    R
     A            IADTV2    R
     A            IADTV3    R
     A            IADTV4    R
     A            IADTV5    R
     A            IADTV6    R
     A            IADTV7    R
     A            IADTV8    R
     A            IADTV9    R
     A            IADVA1    R
     A            IADVA2    R
     A            IADVA3    R
     A            IADVA4    R
     A            IADVA5    R
     A            IADVA6    R
     A            IADVA7    R
     A            IADVA8    R
     A            IADVA9    R
     A            IADTF1    R
     A            IADTF2    R
     A            IADTF3    R
     A            IADTF4    R
     A            IADTF5    R
     A            IADTF6    R
     A            IADTF7    R
     A            IADTF8    R
     A            IADTF9    R
     A            IADFA1    R
     A            IADFA2    R
     A            IADFA3    R
     A            IADFA4    R
     A            IADFA5    R
     A            IADFA6    R
     A            IADFA7    R
     A            IADFA8    R
     A            IADFA9    R
