     A*
     A*  Rutine-regsiter
     A*
     A          R IADTPFR                   PFILE(IADTPF)
     A*
     A* Nøkkel
     A*
     A          K IADTFR
     A          K IADTKO
     A          K IADTRU
