     A*
     A*  Tillgangs-regsiter
     A*
     A          R IADTPFR                   PFILE(IADTPF)
     A*
     A* Nøkkel
     A*
     A          K IADTFR
     A          K IADTRU
     A          K IADTKO
