     A*
     A*  LØNARTER, logisk update
     A*
     A          R ILARPFR                   PFILE(ILARPF)
     A*
     A* Nøkkel
     A*
     A          K ILAKLI
     A          K ILAART
