     A*
     A*  ASSERV   LØNNS KALENDER
     A*
     A          R ILKAPFR                   PFILE(ILKAPF)
     A*
     A* Nøkkel
     A*
     A          K ILKPER
