     A*
     A*  Lønnstranser fra registrering lønn og fravær
     A*
     A                                      REF(*LIBL/RFRF)
     A          R ILKAPFR
     A            ILKPER    R
     A            ILKFDA    R
     A            ILKTDA    R
     A            ILKOKP    R
     A            ILKPSP    R
     A            ILKODA    R
     A            ILKEDA    R
     A            ILKETI    R
     A            ILKUSR    R
      *
