     A*
     A*  Lønnstaker
     A*
     A                                      REF(*LIBL/RFRF)
     A          R ILONPFR
     A            ILRTYP    R
     A            ILRKLI    R
     A            ILRLNR    R
     A            ILRNAV    R
     A            ILRADR    R
     A            ILRAD2    R
     A            ILRPNR    R
     A            ILRSTE    R
     A            ILRAVD    R
     A            ILRLTY    R
     A            ILRMOB    R
     A            ILREPO    R
     A            ILRUSR    R
     A            ILRPWD    R
      *
     A            ILRODA    R
     A            ILROTI    R
     A            ILROAV    R
     A            ILREDA    R
     A            ILRETI    R
     A            ILREAV    R
      *
