     A*
     A*  LØNSTAGER, logisk
     A*
     A          R ILONPFR                   PFILE(ILONPF)
     A*
     A* Nøkkel
     A*
     A          K ILRKLI
     A          K ILRNAV
     A          K ILRLNR
