      *
      *  LØNNSREG.                Index=Read
      *
     A          R ILTRPFR                   PFILE(*LIBL/ILTRPF)
     A          K ILTKLI
     A          K ILTLNR
     A          K ILTPER
     A          K ILTKDA
     A          K ILTLIN
