     A*
     A*  Lønnstranser fra registrering lønn og fravær
     A*
     A                                      REF(*LIBL/RFRF)
     A          R ILTRPFR
     A            ILTKLI    R
     A            ILTLIN    R
     A            ILTLNR    R
     A            ILTAVD    R
     A            ILTONR    R
     A            ILTOAV    R
     A            ILTLTY    R
      *
     A            ILTART    R
     A            ILTANT    R
     A            ILTSAT    R
     A            ILTBEL    R
     A            ILTTXT    R
     A            ILTFDA    R
     A            ILTTDA    R
     A            ILTAVS    R
      *
     A            ILTPK     R
     A            ILTUSR    R
     A            ILTOVL    R
     A            ILTOLD    R
     A            ILTOLT    R
     A            ILTOLU    R
     A            ILTOVO    R
     A            ILTOVF    R
     A            ILTOFD    R
     A            ILTOFT    R
     A            ILTOFU    R
     A            ILTOVR    R
     A            ILTORD    R
     A            ILTORT    R
     A            ILTORU    R
     A            ILTATT    R
     A            ILTAT2    R
     A            ILTPER    R
     A            ILTLFK    R
     A            ILTKDA    R
     A            ILTATA    R
     A            ILTAA2    R
     A            ILTSLT    R
     A            ILTSLR    R
     A            ILTHTT    R
     A            ILTAD1    R
     A            ILTAD2    R
     A            ILTAK1    R
     A            ILTAK2    R
     A            ILTRAV    R
     A            ILTRDA    R
     A            ILTRKL    R
     A            ILTHML    R
     A            ILTFEL    R
     A            ILTSPR    R
      *
