     A*
     A* ILTRPF/L8, Brukes i akkord, må ikke gjøres om eller brukes til noe annet
     A*
     A          R ILTRPFR                   PFILE(ILTRPF)
     A*
     A* Nøkkel
     A*
     A          K ILTKLI
     A          K ILTPER
     A          K ILTONR
     A          K ILTART
