     A*
     A*  ASSERV, ILTRLA, Ny 14.11.06 for bruk ved oppdat fra HM
     A*
     A          R ILTRPFR                   PFILE(ILTRPF)
     A*
     A* Nøkkel
     A*
     A          K ILTONR
     A          K ILTHML
