     A*
     A*  ABB_LON  ILTRPF/L1, NUMERISK INPUT
     A*
     A          R ILTRPFR                   PFILE(ILTRPF)
     A*
     A* Nøkkel
     A*
5.31 A          K ILTUSR
     A          K ILTKLI
     A          K ILTPER
     A          K ILTLIN
