     A*
     A*  ASSERV, ILTRLC, Ny 21.02.07 for tilldeling av sporingsnr.
     A*
     A          R ILTRPFR                   PFILE(ILTRPF)
     A*
     A* Nøkkel
     A*
     A          K ILTSPR
