     A*
     A*  ABB_LON  ILTRPF/LU, logisk update
     A*
     A          R ILTRPFR                   PFILE(ILTRPF)
     A*
     A* Nøkkel
     A*
     A          K ILTUSR
     A          K ILTKLI
     A          K ILTPER
     A          K ILTLIN
