      *
      *  LØNNSREG                 Index=Read
      *
     A          R ILTRPFR                   PFILE(*LIBL/ILTRPF)
     A          K ILTPER
     A          K ILTLIN
