     A*
     A*  ASSERV, ILTRLB, Ny 07.02.07 for bruk ved Uttrekk til oppdatering
     A*
     A          R ILTRPFR                   PFILE(ILTRPF)
     A*
     A* Nøkkel
     A*
     A          K ILTPER
     A          K ILTONR
     A          K ILTART
     A          K ILTLNR
     A          K ILTLIN
     A          O ILTOVO                    COMP(EQ 'J')
     A          O ILTATT                    COMP(EQ ' ')
     A          O ILTONR                    COMP(EQ ' ')
