     A*
     A*  ASSERV, ILTRLD, Ny 12.11.07 for att. via timeliste(Elektro)
     A*
     A          R ILTRPFR                   PFILE(ILTRPF)
     A*
     A* Nøkkel
     A*
     A          K ILTPER
     A          K ILTLNR
     A          K ILTART
     A          K ILTLIN
