      *
      *  LØNNSREG.                Index=Read
      *
     A          R ILTRPFR                   PFILE(*LIBL/ILTRPF)
     A          K ILTKLI
     A          K ILTONR
     A          K ILTPER
     A          K ILTKDA
     A          K ILTLIN
     A          O ILTATT                    COMP(NE '   ')
