      *
      * Betingelse
      *
     A          R JBETPFR                   PFILE(*LIBL/JBETPF)
      *
     A          K JPFIRM
     A          K JPLDOR
     A          K JPHGRP
     A          K JPOGRP
     A          K JPUGRP
     A          K JPMODN
     A          K JPVARE
     A          K JPVTYP
     A          K JPLETY
     A          K JPRSTS
     A          K JPLINE
6.3X A          K JPPRGR
