      *
      * Betingelse EXPORT
      *
     A                                      REF(*LIBL/JFRF)
     A          R JBEYPFR
     A            JPFIRM    R
     A            JPLDOR    R
6.3X A            JPPRGR         2A
     A            JPOGRP    R
     A            JPHGRP    R
     A            JPUGRP    R
     A            JPMODN    R
     A            JPVARE    R
     A            JPVTYP    R
     A            JPLETY    R
     A            JPRSTS    R
     A            JPLINE    R
     A            JPBETI    R
     A            JPFDAT    R
     A            JPTDAT    R
     A            JPDATO    R
     A            JPAKTI    R
     A            JPODAT    R
     A            JPEDAT    R
     A            JPETIM    R
     A            JPEUSR    R
