      *
      * Frakt Betingelse
      *
     A          R JFBEPFR                   PFILE(*LIBL/JFBEPF)
      *
     A          K JPFFIR
     A          K JPFLDO
     A          K JPFOGR
     A          K JPFHGR
     A          K JPFUGR
     A          K JPFMOD
     A          K JPFVAR
     A          K JPFVTY
     A          K JPFLET
