      *
      * Frakt Betingelse
      *
     A          R JFBEPFR                   PFILE(*LIBL/JFBEPF)
      *
     A          K JPFBFI
     A          K JPFBLO
     A          K JPFBPG
     A          K JPFBOG
     A          K JPFBHG
     A          K JPFBUG
     A          K JPFBMO
     A          K JPFBVA
     A          K JPFBVT
     A          K JPFBKE
     A          K JPFBRS
     A          K JPFBLI
     A          K JPFBBE
