      *
      * Frakt Betingelse
      *
     A          R JFBEPFR                   PFILE(*LIBL/JFBEPF)
      *
     A          K JPFFIR
     A          K JPFLDO
     A          K JPFMOD
6.3X A          K JPFVAR
     A          K JPFPRG
     A          K JPFVTY
     A          K JPFLET
