      *
      * Frakt Betingelse  EKSPORT
      *
     A                                      REF(*LIBL/JFRF)
     A          R JFBUPFR
     A            JPFFIR    R
     A            JPFLDO    R
     A            JPFPRG         2A
     A            JPFOGR    R
     A            JPFHGR    R
     A            JPFUGR    R
     A            JPFMOD    R
     A            JPFVAR    R
     A            JPFVTY    R
     A            JPFLET    R
     A            JPFFDA    R
     A            JPFTDA    R
     A            JPFKRT    R
     A            JPFPRT    R
     A            JPFTON    R
     A            JPFKUB    R
      * Knytning mot betinglese
     A            JPFBFI    R
     A            JPFBLO    R
     A            JPFBPG    R
     A            JPFBOG    R
     A            JPFBHG    R
     A            JPFBUG    R
     A            JPFBMO    R
     A            JPFBVA    R
     A            JPFBVT    R
     A            JPFBKE    R
     A            JPFBRS    R
     A            JPFBLI    R
     A            JPFBBE    R
     A            JPFODA    R
     A            JPFEDA    R
     A            JPFETI    R
     A            JPFEUS    R
