      *
      * Forpakning
      *
     A          R JFORPFR                   PFILE(*LIBL/JFORPF)
      *
     A          K JZFIRM
     A          K JZHGRP
     A          K JZOGRP
     A          K JZUGRP
     A          K JZLDOR
     A          K JZVARE
