      *
      * Forpaking
      *
     A          R JFORPFR                   PFILE(*LIBL/JFORPF)
      *
     A          K JZFIRM
     A          K JZOGRP
     A          K JZHGRP
     A          K JZUGRP
     A          K JZLDOR
     A          K JZMODN
     A          K JZVARE
