6.40  *
6.40  * Kampanje-hode
6.40  *
6.40 A          R JKAHPFR                   PFILE(*LIBL/JKAHPF)
6.40  *
6.40 A          K JMFIRM
6.40 A          K JMPRGR
6.40 A          K JMKAMP
