      *
      * Kampanje-hode
      *
     A          R JKAHPFR                   PFILE(*LIBL/JKAHPF)
      *
     A          K JMFIRM
     A          K JMFDAT
     A          K JMKAMP
6.40 A          K JMPRGR
