      *
      * Kampanje-vare
      *
     A          R JKAVPFR                   PFILE(*LIBL/JKAVPF)
      *
     A          K JMVFIR
     A          K JMVKAM
6.40 A          K JMVPRG
     A          K JMVVAR
