      *
      * Kampanje-vare
      *
     A                                      REF(*LIBL/JFRF)
     A          R JKAVPFR
     A            JMVFIR    R
     A            JMVKAM    R
6.40 A            JMVPRG    R
     A            JMVVAR    R
     A            JMVLDO    R
     A            JMVKAI    R
     A            JMVKPR    R
     A            JMVKAA    R
     A            JMVKAU    R
     A            JMVANS    R
6.37 A            JMVIDF    R
6.37 A            JMVIDT    R
6.3C A            JMVLAS    R
6.3C A            JMVODA    R
     A            JMVEDA    R
     A            JMVETI    R
     A            JMVEUS    R
