      *
      * Leverandør
      *
     A                                      REF(*LIBL/JFRF)
     A          R JLE9PFR
     A            JLXLDO         6S 0
     A            JLXAUT         1S 0
     A                                      VALUES(0 1)
     A            JLXODA          L
     A            JLXEDA          L
     A            JLXETI          T
     A            JLXEUS        10
