      *
      * Leverandør
      *
     A                                      REF(*LIBL/JFRF)
     A          R JLEVPFR
     A            JLLDOR    R
     A            JLNAVN    R
     A            JLADR1    R
     A            JLADR2    R
     A            JLPONR    R
     A            JLSTED    R
     A            JLTLFN    R
     A            JLMOBN    R
     A            JLFAXN    R
     A            JLFAXO    R
     A            JLMAIL    R
     A            JLURLA    R
     A            JLKPRS    R
     A            JLKTLF    R
     A            JLKMOB    R
     A            JLKFAX    R
     A            JLKMAI    R
     A            JLORGN    R
     A            JLEANL    R
     A            JLVALU    R
     A            JLLAND    R
     A            JLDTYP    R
     A            JLKVAV    R
     A            JLKMOD    R
     A            JLKKAL    R
     A            JLFKAL    R
     A            JLGRPK    R
     A            JLMMRK    R
     A            JLBGIR    R
     A            JLPGIR    R
     A            JLENUM    R
     A            JLRSTS    R
     A            JLPRIO    R
6.11 A            JLNODA    R
6.11 A            JLNEDA    R
6.11 A            JLNSDA    R
     A            JLODAT    R
     A            JLEDAT    R
     A            JLETIM    R
     A            JLEUSR    R
