      *
      * Match
      *
     A          R JMATPFR                   PFILE(*LIBL/JMATPF)
      *
     A          K JOFIRM
     A          K JOTEK1
