      *
      * Match
      *
     A          R JMATPFR                   PFILE(*LIBL/JMATPF)
      *
     A          K JOFIRM
     A          K JOVKOD
     A          K JOLDO2
     A          K JOOGRP
     A          K JOHGRP
     A          K JOUGRP
     A          K JOTEK1
     A          K JOVAR1
