      *
      * Match
      *
     A                                      REF(*LIBL/JFRF)
     A          R JMATPFR
     A            JOFIRM    R
     A            JOVAR1    R
     A            JOOGRP    R
     A            JOHGRP    R
     A            JOUGRP    R
     A            JOTEK1    R
     A            JOTEK2    R
     A            JOLDOR    R
     A            JOLVAR    R
     A            JOEANN    R
     A            JONOBB    R
     A            JOLDO2    R
     A            JOVAR2    R
     A            JOKODE    R
     A            JOVKOD    R
