      *
      * Påslag
      *
     A          R JPFAPFR                   PFILE(*LIBL/JPFAPF)
      *
     A          K JCFIRM
     A          K JCLDOR
     A          K JCOGRP
     A          K JCHGRP
     A          K JCUGRP
     A          K JCMODN
     A          K JCVARE
     A          K JCPRGR
     A          K JCKPRI
     A          K JCVTYP
     A          K JCLETY
