      *
      * Rabattelement
      *
     A          R JRAWPFR                   PFILE(*LIBL/JRAWPF)
      *
     A          K JPEFIR
     A          K JPELDO
6.3X A          K JPEPRG
     A          K JPEOGR
     A          K JPEHGR
     A          K JPEUGR
     A          K JPEMOD
     A          K JPEVAR
     A          K JPEVTY
     A          K JPELET
     A          K JPEBRS
     A          K JPEBLI
     A          K JPERST
     A          K JPELIN
