      *
      * Rabattelement
      *
     A                                      REF(*LIBL/JFRF)
     A          R JRAYPFR
     A            JPEFIR    R
     A            JPELDO    R
     A            JPEPRG         2A
     A            JPEOGR    R
     A            JPEHGR    R
     A            JPEUGR    R
     A            JPEMOD    R
     A            JPEVAR    R
     A            JPEVTY    R
     A            JPELET    R
     A            JPEBRS    R
     A            JPEBLI    R
     A            JPERST    R
     A            JPELIN    R
     A            JPERAE    R
     A            JPEREG    R
     A            JPEVER    R
     A            JPEFDA    R
     A            JPETDA    R
     A            JPEAKT    R
     A            JPEODA    R
     A            JPEEDA    R
     A            JPEETI    R
     A            JPEEUS    R
