      *
      * Rapportør vare
      *
     A                                      REF(*LIBL/JFRF)
     A          R JRXAPFR
     A            JRXRAD      1024A         TEXT('Vare/pris')
