      *
      * Vare-detalj
      *
     A          R JVDTPFR                   PFILE(*LIBL/JVDTPF)
      *
     A          K JVDFIR
     A          K JVDVAR
