      *
      * VARE-FRIGRITT PR. FILGRUPPE
      *
     A          R JVFFPFR                   PFILE(*LIBL/JVFFPF)
      *
     A          K JVFFGR
     A          K JVFVAR
