      *
      * Vare-frigritt pr. filgruppe
      *
     A          R JVFFPFR                   PFILE(*LIBL/JVFFPF)
      *
     A          K JVFFGR
     A          K JVFVAR
