      *
      * Logistikk vareknytning hode
      *
     A          R JVKHPFR                   PFILE(*LIBL/JVKHPF)
      *
     A          K JVKFIR
     A          K JVKVNR
