      *
      * Logistikk vareknytning linje
      *
     A                                      UNIQUE
     A          R JVKLPFR                   PFILE(*LIBL/JVKLPF)
      *
     A          K JVQFIR
     A          K JVQVNR
     A          K JVQUNO
     A          K JVQLDO
