      *
      * Arbeidsfil/matche nobb.no mot VA
      *
     A          R JWRMPFR
     A            JWDA80        80A         TEXT('Data')
     A                                      COLHDG('Data')
