      *
      *  Lagertelling-batch-register            Index=Read
      *
     A          R LBC1PFR
     A                                      PFILE(*LIBL/LBC1PF)
      *
     A          K L1FIRM
     A          K L1BATC
