      *
      *  Lagertelling-batch-register - filtrerinmgstabell
      *
     A                                      REF(*LIBL/LFRF)
     A          R LBC1PFR
     A            L1FIRM    R
     A            L1BATC    R
     A            L1LAGE    R
     A            L1ODAT    R
     A            L1OTIM    R
     A            L1OUSR    R
     A            L1EDAT    R
     A            L1ETIM    R
     A            L1EUSR    R
