      *
      *  Lagertelling-batch-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R LBCHPFR
     A            LCFIRM    R
     A            LCBATC    R
     A            LCBDAT    R
     A            LCBTIM    R
     A            LCEDAT    R
     A            LCETIM    R
     A            LCSPER    R
     A            LCANTB    R
     A            LCAHTE    R
     A            LCANSV    R
     A            LCNUMM    R
     A            LCLOPE    R
     A            LCSTEL    R
6.10 A            LCODAT    R
6.10 A            LCOTIM    R
6.10 A            LCOUSR    R
6.10 A            LCEEDA    R
6.10 A            LCEETI    R
6.10 A            LCEUSR    R
