      *
      * Lagertelling-bunt-linje-register    Index=Update
      *
     A          R LBDTPFR
     A                                      PFILE(*LIBL/LBDTPF)
      *
     A          K LVFIRM
     A          K LVVARE
