      *
      *  Lagertelling-bunt-linje-register        Index=Update
      *
     A          R LBDTPFR
     A                                      PFILE(*LIBL/LBDTPF)
      *
     A          K LVFIRM
     A          K LVBATC
     A          K LVNUMM
     A          K LVVARE
     A          K LVLINE
