      *
      *  Lagertelling-bunt-linje-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R LBDTPFR
     A            LVFIRM    R
     A            LVBATC    R
     A            LVNUMM    R
     A            LVLINE    R
     A            LVTLIN    R
     A            LVDLOP    R
     A            LVOGRP    R
     A            LVHGRP    R
     A            LVUGRP    R
     A            LVVARE    R
     A            LVLAGE    R
     A            LVPLAS    R
     A            LVTEK1    R
     A            LVENH1    R
     A            LVANTT    R
     A            LVSPNY    R
     A            LVKPNY    R
6.20 A            LVTIMS    R
6.10 A            LVODAT    R
6.10 A            LVOTIM    R
6.10 A            LVOUSR    R
6.10 A            LVEDAT    R
6.10 A            LVETIM    R
6.10 A            LVEUSR    R
