      *
      * EDI meldinger - status
      *
     A          R LBEDPFR                   PFILE(*LIBL/LBEDPF)
      *
     A          K XBFIRM
     A          K XBTYPE
     A          K XBAARR
     A          K XBNUMM
     A          K XBREFN
