      *
      *  Logger innkommende EDI medlinger
      *
8.01  * Utvidet meldingsnummer til 8 posisjoner.
      *
      *
     A          R LBEDPFR
     A            XBFIRM         3S 0       TEXT('Firmakode')
     A            XBTYPE         4A         TEXT('Meldingstype')
     A            XBAARR         4S 0       TEXT('År')
     A            XBNUMM         8S 0       TEXT('Bestillingsnummer')
     A            XBREFN        35A         TEXT('Referanse')
     A            XBSTAT         1A         TEXT('Statusr')
8.01 A            XBMELD         8S 0       TEXT('EDI meldingsnummer')
     A            XBLDOR         6S 0       TEXT('Leverandørnummer')
     A            XBTEXT        78A         TEXT('Beskrivelse')
      *
     A            XBODAT          L         TEXT('Opprettet dato')
     A            XBOTIM          T         TEXT('Opprettet tidspkt')
     A            XBOUSR        10A         TEXT('Opprettet av')
     A            XBEDAT          L         TEXT('Endret dato')
     A            XBETIM          T         TEXT('Endret tidspkt')
     A            XBEUSR        10A         TEXT('Endret av')
