      *
      *  Lagertelling-bunt-hode-register        Index=Type
      *
     A          R LBHEPFR
     A                                      PFILE(*LIBL/LBHEPF)
      *
     A          K LUFIRM
     A          K LUBATC
     A          K LUTYPE
     A          K LUNUMM
