      *
      *  Lagertelling-bunt-hode-register        Index=Update
      *
     A                                      UNIQUE
     A          R LBHEPFR
     A                                      PFILE(*LIBL/LBHEPF)
      *
     A          K LUFIRM
     A          K LUBATC
     A          K LUNUMM
