      *
      *  Lagertelling-bunt-hode-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R LBHEPFR
     A            LUFIRM    R
     A            LUBATC    R
     A            LUNUMM    R
     A            LUTNUM    R
     A            LULAGE    R
     A            LUTYPE    R
     A            LUTEXT    R
     A            LUOPER    R
     A            LUDATO    R
     A            LUTIME    R
     A            LUSDAT    R
     A            LUODAT    R
     A            LUWSID    R
     A            LUUSER    R
     A            LUSKOD    R
     A            LUKODE    R
6.10 A            LUEDAT    R
6.10 A            LUETIM    R
6.10 A            LUEUSR    R
