      *
      *  Bestillings-slettet                Index=Bestnr/år
      *
     A          R LDELPFR
     A                                      PFILE(*LIBL/LDELPF)
      *
     A          K LYFIRM
     A          K LYNUMM
     A          K LYSUFF
     A          K LYAARR                    DESCEND
