      *
      *  Bestilling-slettet-register
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/LFRF)
     A          R LDELPFR
     A            LYFIRM    R
     A            LYAARR    R
     A            LYNUMM    R
     A            LYSUFF    R
     A            LYOTYP    R
     A            LYBDAT    R
     A            LYINNK    R
     A            LYVALK    R
     A            LYMKOD    R
     A            LYLELE    R
     A            LYLDOR    R
     A            LYLENA    R
     A            LYNAVN    R
     A            LYADR1    R
     A            LYADR2    R
     A            LYSTED    R
     A            LYVREF    R
     A            LYDREF    R
     A            LYREKV    R
     A            LYTOTI    R
     A            LYTOTR    R
     A            LYTOTK    R
     A            LYORNR    R
     A            LYORSU    R
     A            LYWSID    R
     A            LYUSER    R
     A            LYDATE    R
     A            LYTIME    R
     A            LYTYPE    R
     A            LYPRTK    R
     A            LYKOM1    R
     A            LYKOM2    R
6.10 A            LYEDAT    R
6.10 A            LYETIM    R
6.10 A            LYEUSR    R
