      *
      *  Bestillings-slettet               Index=Read
      *
     A          R LDELPFR
     A                                      PFILE(*LIBL/LDELPF)
      *
     A          K LYFIRM
     A          K LYAARR
     A          K LYNUMM
     A          K LYSUFF
