      *
      *  Bestillings-slettet
      *
     A          R LDELPFR                   PFILE(*LIBL/LDELPF)
      *
     A          K LYFIRM
     A          K LYAARR
     A          K LYLENA
     A          K LYNUMM
     A          K LYSUFF
