7.01  *
7.01  *  Bestillings-linje-slettet-register
7.01  *
7.01 A                                      REF(*LIBL/LFRF)
7.01 A          R LDESPFR
7.01 A            LRFIRM    R
8.01 A            LRAARR    R               REFFLD(LYAARR)
7.01 A            LRNUMM    R
7.01 A            LRSUFF    R
7.01 A            LRLINE    R
7.01 A            LROTYP    R
7.01 A            LRLTYP    R
7.01 A            LRLETY    R
7.01 A            LRVARE    R
7.01 A            LRENH1    R
7.01 A            LRLAGE    R
7.01 A            LRLDOR    R
7.01 A            LRLDAT    R
7.01 A            LRAVDE    R
7.01 A            LRKONT    R
7.01 A            LRSPES    R
7.01 A            LRPROJ    R
7.01 A            LRAKTI    R
7.01 A            LRLVAR    R
7.01 A            LRNOBB    R
7.01 A            LREANN    R
7.01 A            LRORNU    R
7.01 A            LRORSU    R
7.01 A            LRORLI    R
7.01 A            LRTEK1    R
7.01 A            LRTEK2    R
7.01 A            LRANTA    R
7.01 A            LRIPNY    R
7.01 A            LRKPNY    R
7.01 A            LRRAB1    R
7.01 A            LRRAB2    R
7.01 A            LRSUMI    R
7.01 A            LRSUMR    R
7.01 A            LRSUMK    R
7.01 A            LROMVA    R
7.01 A            LRLVRE    R
7.01 A            LROGRP    R
7.01 A            LRHGRP    R
7.01 A            LRUGRP    R
7.01 A            LRKPLJ    R
7.01 A            LRVARI    R
7.01 A            LRSLDA    R
7.01 A            LRSLTI    R
7.01 A            LRSPGM    R
7.01 A            LRSLWS    R
7.01 A            LRSLUS    R
7.01 A            LRODAT    R
7.01 A            LROTIM    R
7.01 A            LROUSR    R
7.01 A            LREDAT    R
7.01 A            LRETIM    R
7.01 A            LREUSR    R
