      *
      *  EDI-retur samlefile           Index=Dato,bestilling,linje
      *
     A          R LEDIPFR
     A                                      PFILE(*LIBL/LEDIPF)
      *
     A          K LIFIRM
     A          K LIKODE
     A          K LITYPE
     A          K LIMNUM
     A          K LIMLIN
