      *
      *  EDI-retur samlefile           Index=Meldingsnummer,bestilling, suffix
      *
     A          R LEDIPFR
     A                                      PFILE(*LIBL/LEDIPF)
      *
     A          K LIFIRM
     A          K LIMNUM
     A          K LINUMM
     A          K LISUFF
