      *
      *  EDI-retur samlefile                 Index=Read
      *
     A          R LEDIPFR
     A                                      PFILE(*LIBL/LEDIPF)
      *
     A          K LIFIRM
     A          K LITYPE
     A          K LIMNUM
     A          K LIMLIN
