      *
      *  Spesialbehandling EDI meldinger        Index=Read
      *
     A          R LEKOPFR
     A                                      PFILE(*LIBL/LEKOPF)
      *
     A          K LEKFIR
7.01 A          K LEKMTY
     A          K LEKTYP
     A          K LEKID1
     A          K LEKID2
     A          K LEKKOD
