      *
      * EDI Spesialbehandling
      *
     A          R LEKOPFR
     A            LEKFIR         3S 0       TEXT('Firma')
     A            LEKMTY         1A         TEXT('Meldingstype')
     A            LEKTYP         1A         TEXT('Type')
     A            LEKID1        10A         TEXT('Identitet 1')
     A            LEKID2        10A         TEXT('Identitet 2')
     A            LEKKOD         1A         TEXT('Kode')
     A            LEKBES        35A         TEXT('Beskrivelse')
     A            LEKODA          L         TEXT('Opprettet dato')
     A            LEKOTI          T         TEXT('Opprettet tidspkt')
     A            LEKOUS        10A         TEXT('Opprettet av')
     A            LEKEDA          L         TEXT('Endringsdato')
     A            LEKETI          T         TEXT('Endringstidspunkt')
     A            LEKEUS        10A         TEXT('Endret av')
