      *
      *  Bestilling-forslag-linje-register  Index=Forslag/vare/linje
      *
     A          R LFDTPFR
     A                                      PFILE(*LIBL/LFDTPF)
      *
     A          K LFFIRM
     A          K LFNUMM
     A          K LFVARE
     A          K LFLINE
