      *
      *  Bestillings-forslag-linje-register     Index=hgr-ugr-varenr
      *
     A          R LFDTPFR
     A                                      PFILE(*LIBL/LFDTPF)
      *
     A          K LFFIRM
     A          K LFVARE
     A          K LFLINE
