      *
      *  Bestillings-forslag-linje-register     Index=ordrenr,suff, linje
      *
     A          R LFDTPFR
     A                                      PFILE(*LIBL/LFDTPF)
      *
     A          K LFFIRM
     A          K LFORNR
     A          K LFORSU
     A          K LFORLI
