      *
      *  Bestillings-forslag-linje-register     Index=forsl-lev-vare
      *
     A          R LFDTPFR
     A                                      PFILE(*LIBL/LFDTPF)
      *
     A          K LFFIRM
     A          K LFNUMM
     A          K LFVLEV
