      *
      *  Bestillings-forslag-linje-register
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/LFRF)
     A          R LFDTPFR
     A            LFFIRM    R
     A            LFNUMM    R
     A            LFLINE    R
     A            LFLTYP    R
     A            LFLAGE    R
     A            LFOGRP    R
     A            LFHGRP    R
     A            LFUGRP    R
     A            LFLVAR    R
     A            LFVARE    R
     A            LFENH1    R
     A            LFTEK1    R
     A            LFTEK2    R
     A            LFANTA    R
     A            LFSTAT    R
     A            LFLDOR    R
     A            LFVEKT    R
     A            LFLBEL    R
     A            LFVLEV    R
6.20 A            LFORNR    R
6.20 A            LFORSU    R
6.20 A            LFORLI    R
6.20 A            LFLETY    R
6.20 A            LFLDAT    R
6.10 A            LFODAT    R
6.10 A            LFOTIM    R
6.10 A            LFOUSR    R
6.10 A            LFEDAT    R
6.10 A            LFETIM    R
6.10 A            LFEUSR    R
