      *
      *  Bestillings-forslag-hode-register      Index=Update
      *
     A          R LFHEPFR
     A                                      PFILE(*LIBL/LFHEPF)
      *
     A          K LHFIRM
     A          K LHNUMM
