      *
      *  Bestillings-forslag-hode-register
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/LFRF)
     A          R LFHEPFR
     A            LHFIRM    R
     A            LHNUMM    R
     A            LHOTYP    R
     A            LHLAGE    R
     A            LHAVDE    R
     A            LHBDAT    R
     A            LHLDAT    R
     A            LHWSID    R
     A            LHUSER    R
     A            LHOVRF    R
     A            LHDATE    R
     A            LHTIME    R
     A            LHSELG    R
     A            LHLSOR    R
     A            LHSTAT    R
     A            LHLDOR    R
     A            LHVEKT    R
     A            LHTBEL    R
     A            LHOPPR    R
     A            LHSATS    R
     A            LHLNUM    R
     A            LHBNUM    R
6.20 A            LHORNR    R
6.20 A            LHORSU    R
6.20 A            LHLETY    R
6.10 A            LHOUSR    R
6.10 A            LHEDAT    R
6.10 A            LHETIM    R
6.10 A            LHEUSR    R
