      *
      *  Bestillings-forslag-hode-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R LFHSPFR
     A            LHFIRM    R
     A            LHNUMM    R
     A            LHOTYP    R
     A            LHLAGE    R
     A            LHAVDE    R
     A            LHBDAT    R
     A            LHLDAT    R
     A            LHWSID    R
     A            LHUSER    R
     A            LHOVRF    R
     A            LHDATE    R
     A            LHTIME    R
     A            LHSELG    R
     A            LHLSOR    R
     A            LHSTAT    R
     A            LHLDOR    R
     A            LHVEKT    R
     A            LHTBEL    R
     A            LHOPPR    R
     A            LHSATS    R
     A            LHLNUM    R
     A            LHBNUM    R
6.20 A            LHORNR    R
6.20 A            LHORSU    R
6.20 A            LHLETY    R
6.10 A            LHOUSR    R
6.10 A            LHEDAT    R
6.10 A            LHETIM    R
6.10 A            LHEUSR    R
      *
     A            LHSDAT          L         TEXT('Slettet dato')
     A                                      COLHDG('Slettet' 'dato')
     A            LHSTIM          T         TEXT('Slettet tidspunkt')
     A                                      COLHDG('Slettet' 'tid')
     A            LHSUSR        10A         TEXT('Slettet av')
     A                                      COLHDG('Slettet av')
     A            LHSWSI        10A         TEXT('Arbeidsstasjon')
     A                                      COLHDG('Arb.stasjom')
     A            LHSTED        20A         TEXT('Slettet fra')
     A                                      COLHDG('Slettet fra')
