      *
     A          R LFRFR                     TEXT('ASLAGR for AS/400')
      *         DetteErEnFrf    (NB!!  Denne må ikke fjernes)
      *  Koder benyttet i BESTILLING/INNKJØP/LAGER
      *
      *           LÅ = Diverse koder
      *
      *           LAA = Lager-kode-register                   - LSTSPF
      *           LAE = Toleransegrenser/avrunding EDI        - LTOEPF
6.27  *           LAF = Synktronisering ordre/bestilling      - LSBOPF
      *
      *           LB  = Bestilling-bruker-register            - LUSRPF
      *           LC  = Lagertelling-Batch-register           - LBCHPF
      *           LD  = Bestilling-linje-register             - LODTPF
      *           LE  = Lagertelling-Telle-register           - LTELPF
      *           LF  = Bestilling-forslag-linje-register     - LFDTPF
      *           LG  = Overføringsfil til økonomi            - LOVFPF
      *           LH  = Bestilling-forslag-hode-register      - LFHEPF
      *           LI  = Samlefil for EDI-retur meldinger      - LEDIPF
      *           LJ  = Fast bestillingtekst-register         - LFTXPF
      *           LKP = Utplukk-param-register                - LPLOPF
      *           LKL = Utplukk-linje-register                - LPLLPF
      *           LK1 = Plukk-1-linje-register                - LPM1PF
      *           LK2 = Plukk-2-linje-register                - LPM2PF
      *           LKS = Plukk-S-linje-register                - LPSOPF
      *           LM  = Bestilling logg-register              - LLOGPF
      *           LN  = Bestilling logg-kode-register         - LLOKPF
      *           LO  = Bestilling-hode-register              - LOHEPF
      *           LP  = Leverandør-distribusjons-liste        - LLDIPF
      *           LQ  = Lager-transaksjones-hode              - LLHEPF
 7.01 *           LR  = Bestilling linje slettet              - LDESPF
      *           LS  = Lager-transaksjones-linjer            - LLDTPF
      *           LT  = Bestilling-tekst-register             - LOTXPF
      *           LU  = Lagertelling-Bunt-hode-register       - LBHEPF
      *           LV  = Lagertelling-Bunt-linje-register      - LBDTPF
      *           LW  = Lager-utskrift-hjelpe-register        - LSORPF
      *           LY  = Bestilling-slettet-register           - LDELPF
      *           LZ  = Lager-telling-hjelpe-register         - LPSTPF
      *
      *           HD  = Håndterminal ordre-linje              - HODTPF
      *           HO  = Håndterminal ordre-hode               - HOHEPF
      *           HR  = Radioterminal trans                   - HRTRPF
      *
      *           HV  = Håndterminal vareinformasjon          - HBVAPF
      *           HE  = Håndterminal ean-nummer               - HBVEPF
      *           HL  = Håndterminal leverandørens varenummer - HBVLPF
      *           HK  = Håndterminal kundeinformasjon         - HBKUPF
      *           HB  = Håndterminal bestillingstranser       - HBBEPF
      *           HT  = Håndterminal telletranser             - HBTEPF
      *
      *           SL  = Inng_faktura-linje-register           - SIDTPF
      *           SH  = Inng_faktura-hode-register            - SIHEPF
      *
      *           ML  = Arbeidsregister lager                 - LWA1PF
      *           MH  = Arbeidsregister historisk lagerbok    - LWA3PF
      *           MW  = Arbeidsregister ABC-analyse           - LWA2PF
      *           MWO = Arbeidsregister Overvåking            - LWO1PF
      *           MV  = Arbeidsregister varemottake           - LWVAPF
      *           MK  = Arbeidsregister plukkliste            - LWPLPF
      *           MY  = Arbeidsregister Håndterm. Bestilling  - LWHBPF
      *
      *           MT  = Pakketreregister                      - MTPAPF
      *           MU  = Pakkeregister  historikk              - MUPAPF
      *
      *           MA  = ABC-Parameter-sumnivå                 - MABCPF
      *           MB  = ABC-Detaljer                          - MABDPF
      *           MC  = Parameter leveringstid                - MLTIPF
      *           MM  = Matrise Best.mengde/Sikkerhetstid     - MMATPF
      *           MN  = Prognose parameter                    - MPRPPF
      *           MO  = Prognose                              - MPROPF
      *           MOS = Prognose Sperre                       - MPSPPF
      *           MQ  = Prognose - store avvik innkjøpsparm   - MPRAPF
      *           MR  = Prognose pr. uke                      - MPRUPF
      *           MS  = Syklisk telling                       - MSTPPF
      *           MP  = Parameter bestillingsforslag          - MPPAPF
      *           MJ  = Logistikkpunkt                        - MJLOPF
      *           MD  = Lagerlokasjon                         - MDLOPF
      *           MF  = Håndholdt telletranser                - MTHHPF
      *
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
6.10  * R6.10 080609 BSA  Oppdatert filer med sporingsinformajon. Opprettet
6.10  *                   dato, kl.slett og bruker. Endret dato, kl.slett og
6.10  *                   bruker.
6.11  * R6.10 260609 BOF  Utvide eann fra 13 til 14 pos
6.12  * R6.12 250809 BSA  Utvidet referansefeltene fra 20 til 30 posisjoner
6.13  * R6.13 040909 BOF  Utvidet med kjedesortiment på status og best.f.parm
6.14  * R6.14 280110 AMD  Utvidet med eannummer + koder                f.parm
6.20  * R6.20 080710 NHO  Nye Prosjekt register
6.21  * R6.20 021110 BOF  Utvidet MPSPPF med utg.dato og leverandør
6.21  * R6.20 251110 BOF  Utvidet LLDIPF med ordretype
6.22  * R6.20 131210 BOF  Div. utvidelser i forb. med Finnmarksprosjektet
6.23  * R6.20 150211 BOF  Utvidet lager status reg. med krav om lev.dato utfylt
6.24  * R6.20 240311 BSA  Utvidet register for tolleransegrenser.
6.25  * R6.20 290311 BOF  Utvidet kodereg. kode brukerstyring EDI
6.26  * R6.20 290311 BOF  Utvidet bruker med generelle felter
6.27  * R6.20 250411 BSA  Ny parameterfile for synkronisering ordre/bestilling
6.28  * R6.20 130511 BSA  Legger nye felter inn i MPPAPF med styring av
6.28  *                   ekstrajobb.
6.29  * R6.20 190511 BSA  Legger på nye felter i LOHEPF og SIHEPF
6.2a  * R6.20 210312 BSA  Legger på nye felt for datostyring av automatisk
6.2a  *                   synkronisering mellom ordre/bestilling. (ref 6.27)
6.2B  * R6.20 300312 BSA  Setter defaultverdi for å unngå at dd/tid settes
6.2B  *                   som verdi, der hvor nye tidsfelter legges til i
6.2B  *                   allerede eksisterende filer.
6.2C  * R6.20 240912 BOF  Utvidelse i forb. med NEB
6.30  * R6.30 260214 BOF  Utvidet hist.inng.fakt med virk.leveringsdato
6.NU  * R6.30 210514 BSA  Utvidelse av nummerfelter
6.31  * R6.30 010914 BSA  Nytt register
6.32  * R6.30 150914 BSA  Legger ut mva info på bestilling/historikk
6.33  * R6.30 220914 BSA  Utvidet bestillingshodet med kontaktperson
6.34  * R6.30 120515 BKV  Utvidet lvar til 20 tegn
6.35  * R6.30 140915 SST  Utvidet HOREFN og HDREFN til 8.0
6.36  * R6.30 150316 BOF  Reservert LBKO15 til kundespesifikk styring.
6.36  *                   I tillegg reservert kode fra MGR som skal i std.
6.37  * R6.30 231116 BSA  Flere gyldige verdier i mva kode
6.38  * R6.30 030118 BOF  Utvidet ord.nr+best.nr på statistikkfiler
6.39  * R6.30 260418 BSA  Sidetabell for tellebatch
7.00  * K00   150720 ask  Utvidet FOVFPF med timestamp for logging
      *
7.nx  * K00   131120 bsa  Endringer relatert ti One Nexstep
      *
8.01  * K00   140521 bsa  Utvidet nummer på LEDI.
8.02  * 800   090222 ask  Lagt inn kode for opprinnelse på LWHBPF (BlueRidge)
8.03  * 800   060422 bsa  Lagt inn kode for ekstern ref på LWHBPF (BlueRidge)
      *
      * -------------------------------------------------------------------
      * Referansefelter
      *
     A            LÅFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
      *
     A            LÅJANE         1S 0       TEXT('Ja/Nei')
     A                                      COLHDG('Ja/Nei')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A                                      EDTCDE(Z)
      *
     A            LÅKPRO         6S 0       TEXT('Kundeprosjektnr')
     A                                      COLHDG('Kunde' 'prosjekt')
     A                                      EDTCDE(Z)
      *
     A            LÅKUND         6S 0       TEXT('Kundenr')
     A                                      COLHDG('Kunde')
     A                                      EDTCDE(Z)
      *
     A            LÅLDOR         6S 0       TEXT('Leverandørnr')
     A                                      COLHDG('Lev.')
     A                                      EDTCDE(Z)
      *
     A            LÅNYEN        11A         TEXT('Ny/Endr')
     A                                      COLHDG('Ny/Endr')
      *
     A            LÅPKOD         1A         TEXT('Priskode')
     A                                      COLHDG('Pr.kod')
      *
     A            LÅRFMT        10A         TEXT('Recordfromat')
     A                                      COLHDG('Rec.fmt.')
      *
     A            LÅSVAR         1S 0       TEXT('Svar')
     A                                      COLHDG('Svar')
     A                                      EDTCDE(Z)
      *
     A            LÅVALA         1A         TEXT('Valg')
     A                                      COLHDG('Valg')
      *
     A            LÅVALG         1S 0       TEXT('Valg')
     A                                      COLHDG('Valg')
     A                                      EDTCDE(Z)
      *
     A            LÅOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogr')
     A                                      EDTCDE(Z)
      *
     A            LÅHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgr')
     A                                      EDTCDE(Z)
      *
     A            LÅUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugr')
     A                                      EDTCDE(Z)
      *
     A            LÅPRAN         4A         TEXT('Produktansv')
     A                                      COLHDG('Produktansv.')
      *
     A            LÅMAIL      0050A
     A                                      COLHDG('E-Mail')
     A                                      TEXT('E-Mail')
      *
     A            LÅVARE        15A         TEXT('Varenr')
     A                                      COLHDG('Varenr')
      *
6.11 A            LÅEANN        14S 0       TEXT('Ean-nr')
     A                                      COLHDG('EAN-nr')
     A                                      EDTCDE(Z)
      *
     A            LÅNOBB         8S 0       TEXT('Nobbnr')
     A                                      COLHDG('Nobbnr')
     A                                      EDTCDE(Z)
      *
6.34 A            LÅLVAR        20A         TEXT('Lev. varenr')
     A                                      COLHDG('Lev.varenr')
      *
     A            LÅTEK1        35A         TEXT('Varetekst 1')
     A                                      COLHDG('Varetekst 1')
      *
     A            LÅTEK2        35A         TEXT('Varetekst 2')
     A                                      COLHDG('Varetekst 2')
      *
     A            LÅTEK3        35A         TEXT('Varetekst 3')
     A                                      COLHDG('Varetekst 3')
      *
     A            LÅKPRI         1A         TEXT('Priskode')
     A                                      COLHDG('Pris' 'kode')
      *
     A            LÅVTYP         1A         TEXT('Varetype')
     A                                      COLHDG('Vare' 'type')
      *
     A            LÅLETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
      *
     A            LÅENHE         3A         TEXT('Enhet')
     A                                      COLHDG('Enhet')
      *
     A            LÅKHEV         4A         TEXT('Kontohenvisning')
     A                                      COLHDG('Konto' 'henv.')
      *
     A            LÅLAGE      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lager')
     A                                      TEXT('Lager')
      *
     A            LÅPLAS      0008A
     A                                      COLHDG('Lagerpl.')
     A                                      TEXT('Lagerplass')
      *
     A            LÅBATC      0010A
     A                                      COLHDG('Batch')
     A                                      TEXT('Batchnummer')
      *
     A            LÅAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avd.')
     A                                      TEXT('Avdeling')
      *
     A            LÅKONT      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A                                      TEXT('Kontonummer')
      *
     A            LÅSPES      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Spes')
     A                                      TEXT('Spesifikasjon')
      *
6.20 A**          LÅPROJ      0006S 0
6.20 A            LÅPROJ      0006A
     A                                      COLHDG('Prosj')
     A                                      TEXT('Prosjekt')
      *
6.20 A**          LÅAKTI      0003A
6.20 A            LÅAKTI      0006A
     A                                      COLHDG('Akt')
     A                                      TEXT('Aktivitet')
      *
6.20 A            LÅUPRO         6A         TEXT('U.Prosjekt')
6.20 A                                      COLHDG('U.proj')
6.20 A            LÅARBO         6A         TEXT('Arb.ordre')
6.20 A                                      COLHDG('A.ordre')
6.20  *
     A            LÅRKAT         3S 0       TEXT('Rabattkategori')
     A                                      COLHDG('Rab.' 'kat.')
     A                                      EDTCDE(Z)
      *
     A            LÅRGRP         7S 0       TEXT('Rabattgruppe')
     A                                      COLHDG('Rgr')
     A                                      EDTCDE(Z)
      *
     A            LÅBESK        35A         TEXT('Beskrivelse')
     A                                      COLHDG('Beskrivelse')
      *
     A            LÅBESK_5       5A         TEXT('Beskrivelse')
     A                                      COLHDG('Beskr')
      *
6.NU A            LÅNUMM         8S 0       TEXT('Bestillingsnr.')
     A                                      COLHDG('Best.nr')
     A                                      EDTCDE(Z)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(LMD0600 *LIBL/QMFLAGR)
      *
     A            LÅSUFF         2S 0       TEXT('Suffix')
     A                                      COLHDG('Suff')
     A                                      EDTCDE(Z)
      *
     A            LÅLINE         4S 0       TEXT('Linjenr')
     A                                      COLHDG('Linje')
     A                                      EDTCDE(Z)
      *
     A            LÅOTYP         2A         TEXT('Ordre-type')
     A                                      COLHDG('Ordre' 'type')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(LRO0020 *LIBL/QMFLAGR)
      *
     A            LÅLTYP      0002A         TEXT('Linje-type')
     A                                      COLHDG('Linje' 'type')
      *
     A            LÅSELG         4S 0       TEXT('Selgernr')
     A                                      COLHDG('Sn')
     A                                      EDTCDE(Z)
      *
     A            LÅKAMP         5A         TEXT('Kampanje')
     A                                      COLHDG('Kamp.')
      *
     A            LÅBESK_30     30A         TEXT('Beskrivelse')
     A                                      COLHDG('Beskr')
      *
     A            LÅLADR         6S 0       TEXT('Leveringsadr.')
     A                                      COLHDG('Leveringsadr.')
     A                                      EDTCDE(Z)
      *
     A            LÅUSER        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            LÅNOID          Z         TEXT('Notat-id')
     A                                      COLHDG('Notat-id')
      *
     A            LÅVSOR        10A         TEXT('Varesortiment')
     A                                      COLHDG('Sort.')
      *
     A            LÅANTA        11S 3       TEXT('Antall')
     A                                      COLHDG('Antall')
     A                                      EDTCDE(M)
      *
     A            LÅVEKT      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Vekt')
     A                                      TEXT('Vekt')
     A            LÅDATR      0006S 0
     A                                      COLHDG('Dato')
     A                                      TEXT('Dato')
      *
     A            LÅODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
6.10  *
6.10 A            LÅOTIM          T         TEXT('Opprettet tidspkt')
6.10 A                                      COLHDG('Oppr.tid')
6.10  *
6.10 A            LÅOUSR        10A         TEXT('Opprettet av')
6.10 A                                      COLHDG('Oppr. av')
      *
     A            LÅEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
      *
     A            LÅETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
      *
     A            LÅEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
      *
      *  Lager-kode-register                (LAA)
      *
     A            LAAFIR    R               REFFLD(LÅFIRM)
     A            LAABRK      0006A
     A                                      COLHDG('Ident. BESTILLING')
     A                                      TEXT('Ident. BESTILLING')
     A            LAABIN      0006A
     A                                      COLHDG('Ident. Bilagsnummer')
     A                                      TEXT('Ident. Bilagsnummer' )
     A            LAABIC      0006A
     A                                      COLHDG('Ident. Bilag.lager')
     A                                      TEXT('Ident. Bilag.lager' )
     A            LAAFOR      0006A
     A                                      COLHDG('Ident. FORSLAG')
     A                                      TEXT('Ident. FORSLAG')
     A            LAADEL      0006A
     A                                      COLHDG('Ident. slettet best.')
     A                                      TEXT('Ident. slettet best.')
     A            LAALSM      0006A
     A                                      COLHDG('Ident. LISTE')
     A                                      TEXT('Ident. LISTE')
     A            LAABAT      0006A
     A                                      COLHDG('Ident. Batchnummer')
     A                                      TEXT('Ident. Batchnummer')
     A            LAABUN      0006A
     A                                      COLHDG('Ident. Lagerbuntnr')
     A                                      TEXT('Ident. Lagerbuntnr')
     A            LAATEL      0006A
     A                                      COLHDG('Ident. Telle-listenr')
     A                                      TEXT('Ident. Telle-listenr')
     A            LAATBU      0006A
     A                                      COLHDG('Ident. Telle-buntnr')
     A                                      TEXT('Ident. Telle-buntnr')
     A            LAABND      0001A
     A                                      COLHDG('Best.merking')
     A                                      TEXT('Best.merking')
     A                                      VALUES('J' 'N' 'X')
     A                                      CHKMSGID(LRA0020 *LIBL/QMFLAGR)
     A            LAAOTY    R               REFFLD(LÅOTYP)
     A            LAALTY    R               REFFLD(LÅLTYP)
     A            LAATTY      0002A
     A                                      COLHDG('Tekst-type')
     A                                      TEXT('Tekst-type')
     A            LAAMVA      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Vis moms')
     A                                      TEXT('Vis moms')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LAAENL      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Enh oppdat. av lager')
     A                                      TEXT('Enh oppdat av lager')
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LAAENS      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Enh oppdat av stat.')
     A                                      TEXT('Enh oppdat av stat.')
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LAALAG      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Oppdatering lager')
     A                                      TEXT('Oppdatering av lager')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LAAHLA      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedlager')
     A                                      TEXT('Hovedlager')
     A            LAAHOY      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Store bokstaver')
     A                                      TEXT('Store bokstaver')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LAATYK      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Sjekk ordretype')
     A                                      TEXT('Sjekk ordretype')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LAALIK      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kostpris, Justering')
     A                                      TEXT('Kostpris, Justering')
     A            LAAOVF      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Overføring Økonomi')
     A                                      TEXT('Overføring økonomi')
     A            LAALEV      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Leverandør, Forslag')
     A                                      TEXT('Leverandør, Forslag')
     A                                      COMP(NE 0)
     A                                      CHKMSGID(LRA0040 *LIBL/QMFLAGR)
     A            LAALNR      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Leverandør, Opprett')
     A                                      TEXT('Leverandør, Opprett')
     A                                      COMP(NE 0)
     A                                      CHKMSGID(LRA0040 *LIBL/QMFLAGR)
     A            LAAVNR    R               REFFLD(LÅVARE)
     A                                      COLHDG('Varenr, Øreavrunding')
     A                                      TEXT('Varenr, Øreavrunding')
     A            LAABIL      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagskode, avrund')
     A                                      TEXT('Bilagskode, avrund')
     A            LAABIF      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagskode, Fakovf')
     A                                      TEXT('Bilagskode, Fakovf')
     A            LAABIK      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagskode, avrund')
     A                                      TEXT('Bilagskode, avrund')
     A            LAADES      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Antall desimaler')
     A                                      TEXT('Antall desimaler')
     A            LAASAK      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Spesifiser kost i HB')
     A                                      TEXT('Spesifiser kost i HB')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LAASA1      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Spesifiser rab1 i HB')
     A                                      TEXT('Spesifiser rab1 i HB')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LAASA2      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Spesifiser rab2 i HB')
     A                                      TEXT('Spesifiser rab2 i HB')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LAASAO      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Spesifiser orab i HB')
     A                                      TEXT('Spesifiser orab i HB')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LAAKHV         4A         TEXT('Kontohenvisning')
     A                                      COLHDG('Konto' 'henv.')
     A                                      COMP(NE '    ')
     A                                      CHKMSGID(LM00011 *LIBL/QMFLAGR)
     A            LAAOT1      0002A
     A                                      COLHDG('Ordre-type, FORSLAG')
     A                                      TEXT('Ordre-type, FORSLAG')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(LM00011 *LIBL/QMFLAGR)
     A            LAAOT2      0002A
     A                                      COLHDG('Ordre-type, BEST.')
     A                                      TEXT('Ordre-type, BEST.')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(LM00011 *LIBL/QMFLAGR)
     A            LAAOT3      0002A
     A                                      COLHDG('Ordre-type, PAKKS')
     A                                      TEXT('Ordre-type, PAKKS')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(LM00011 *LIBL/QMFLAGR)
     A            LAAOT4      0002A
     A                                      COLHDG('Ordre-type, FAKT')
     A                                      TEXT('Ordre-type, FAKT')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(LM00011 *LIBL/QMFLAGR)
     A            LAAOT5      0002A
     A                                      COLHDG('Ordre-type, KREDN')
     A                                      TEXT('Ordre-type, KREDN')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(LM00011 *LIBL/QMFLAGR)
     A            LAARK1      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-1')
     A                                      TEXT('Rabatt-alternativ-1')
     A            LAARK2      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-2')
     A                                      TEXT('Rabatt-alternativ-2')
     A            LAARK3      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-3')
     A                                      TEXT('Rabatt-alternativ-3')
     A            LAARK4      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-4')
     A                                      TEXT('Rabatt-alternativ-4')
     A            LAARK5      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-5')
     A                                      TEXT('Rabatt-alternativ-5')
     A            LAARK6      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-6')
     A                                      TEXT('Rabatt-alternativ-6')
     A            LAARK7      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-7')
     A                                      TEXT('Rabatt-alternativ-7')
     A            LAARK8      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-alternativ-8')
     A                                      TEXT('Rabatt-alternativ-8')
     A            LAAADA          L
     A                                      COLHDG('Siste dato, akk opp')
     A                                      TEXT('Siste dato, akk.opp')
     A            LAAOTM      0002A
     A                                      COLHDG('Otyp mottat fakt.')
     A                                      TEXT('Otyp mottat fakt.')
     A            LAAEFO      0002A
     A                                      COLHDG('Otyp EDI fakt.')
     A                                      TEXT('Otyp EDI fakt.')
     A            LAAEAU      0001A
     A                                      COLHDG('EDI autohent')
     A                                      TEXT('EDI autohent')
     A            LAAEOP      0001A
     A                                      COLHDG('EDI oppdat')
     A                                      TEXT('EDI oppdat')
     A            LAAEOM      0001A
     A                                      COLHDG('EDI obkr mail')
     A                                      TEXT('EDI obkr mail')
     A            LAABST      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Best.f bruke sts.k')
     A                                      TEXT('Best.f. bruke statuskode')
     A            LAAABE      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Auto best.')
     A                                      TEXT('Auto best.')
6.13 A            LAAKSO      0010A
6.13 A                                      COLHDG('Kjede' 'Sortiment')
6.13 A                                      TEXT('KjedeSortiment')
6.23 A            LAALDS         1S 0
6.23 A                                      COLHDG('Sjekk''lev.dato')
6.23 A                                      TEXT('Sjek lev.dato')
6.23 A                                      EDTCDE(Z)
6.23 A                                      VALUES(0 1)
6.23  *                                     0 = ikke krav om sjekk
6.23  *                                     1 = krav at utfylt
6.25 A            LAAEDS         1S 0
6.25 A                                      COLHDG('Sperre''EDI')
6.25 A                                      TEXT('Sperre EDI')
6.25 A                                      EDTCDE(Z)
6.25 A                                      VALUES(0 1)
6.25  *                                     0 = ikke krav om sjekk
6.25  *                                     1 = krav at utfylt
6.10 A            LAAODA    R               REFFLD(LÅODAT)
6.10 A            LAAOTI    R               REFFLD(LÅOTIM)
6.10 A            LAAOUS    R               REFFLD(LÅOUSR)
6.10 A            LAAEDA    R               REFFLD(LÅEDAT)
6.10 A            LAAETI    R               REFFLD(LÅETIM)
6.10 A            LAAEUS    R               REFFLD(LÅEUSR)
      *
      *  Toleransegrenser EDI               (LAE)
      *
     A            LAEFIR    R               REFFLD(LÅFIRM)
     A            LAETG0         7S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Toler.' 'gr.-0')
     A                                      TEXT('Toleransegr. -0')
     A            LAETG1         7S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Toler.' 'gr.-1')
     A                                      TEXT('Toleransegr. -1')
     A            LAETG2         7S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Toler.' 'gr.-2')
     A                                      TEXT('Toleransegr. -2')
     A            LAETG3         7S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Toler.' 'gr.-3')
     A                                      TEXT('Toleransegr. -3')
     A            LAETG4         7S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Toler.' 'gr.-4')
     A                                      TEXT('Toleransegr. -4')
     A            LAEAV1         5S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Avvik-1')
     A                                      TEXT('Avvik aksept. -1')
     A            LAEAV2         5S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Avvik-2')
     A                                      TEXT('Avvik aksept. -2')
     A            LAEAV3         5S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Avvik-3')
     A                                      TEXT('Avvik aksept. -3')
     A            LAEAV4         5S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Avvik-4')
     A                                      TEXT('Avvik aksept. -4')
     A            LAEAV5         5S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Avvik-5')
     A                                      TEXT('Avvik aksept. -5')
6.24 A            LAEFOB      0001A
6.24 A                                      COLHDG('Forenklet best kontr')
6.24 A                                      TEXT('FOB')
6.24 A                                      VALUES('J' 'N')
6.24 A            LAEODA    R               REFFLD(LÅODAT)
6.2B A                                      DFT('0001-01-01')
6.24 A            LAEOTI    R               REFFLD(LÅOTIM)
6.2B A                                      DFT('00.00.00')
6.24 A            LAEOUS    R               REFFLD(LÅOUSR)
6.24 A            LAEEDA    R               REFFLD(LÅEDAT)
6.2B A                                      DFT('0001-01-01')
6.24 A            LAEETI    R               REFFLD(LÅETIM)
6.2B A                                      DFT('00.00.00')
6.24 A            LAEEUS    R               REFFLD(LÅEUSR)
      *
      *  Bestilling-bruker-register         (LB)
      *
     A            LBFIRM    R               REFFLD(LÅFIRM)
     A            LBUSER    R               REFFLD(LÅUSER)
     A            LBBIND      0001A
     A                                      COLHDG('Merking')
     A                                      TEXT('Merking')
     A                                      VALUES('J' 'N' 'X')
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LBOTYP    R               REFFLD(LÅOTYP)
     A            LBCBES      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Cursor ved best.')
     A                                      TEXT('Cursor ved best.')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LBVISE      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Vis bilde automatisk')
     A                                      TEXT('Vis bilde automatisk')
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LBKO01    R               REFFLD(LÅJANE)
     A            LBKO02    R               REFFLD(LÅJANE)
     A            LBKO03    R               REFFLD(LÅJANE)
     A            LBKO04    R               REFFLD(LÅJANE)
6.14 A            LBKO05    R               REFFLD(LÅJANE)
     A                                      COLHDG('EDI tillat OBKR')
     A                                      TEXT('EDI tillat OBKR')
6.14 A            LBKO06    R               REFFLD(LÅJANE)
     A                                      COLHDG('EDI tillat FAKT')
     A                                      TEXT('EDI tillat FAKT')
6.14 A            LBKO07    R               REFFLD(LÅJANE)
     A                                      COLHDG('EDI tillat PAKK')
     A                                      TEXT('EDI tillat PAKK')
6.14 A            LBKO08    R               REFFLD(LÅJANE)
     A                                      COLHDG('EDI tillat ORDR')
     A                                      TEXT('EDI tillat ORDR')
6.14 A            LBKO09    R               REFFLD(LÅJANE)
     A                                      TEXT('ledig')
6.14 A            LBKO10    R               REFFLD(LÅJANE)
     A                                      TEXT('ledig')
6.36 A            LBKO11    R               REFFLD(LÅJANE)
6.36 A                                      TEXT('MGR-spes.inni std')
6.26 A            LBKO12    R               REFFLD(LÅJANE)
6.26 A                                      TEXT('ledig')
6.26 A            LBKO13    R               REFFLD(LÅJANE)
6.26 A                                      TEXT('ledig')
6.26 A            LBKO14    R               REFFLD(LÅJANE)
6.26 A                                      TEXT('ledig')
6.36  * Denne koden skal ikke brukes i std., bruk hvis kundespesfikke
6.36  * styringer.
6.36 A            LBKO15    R               REFFLD(LÅJANE)
6.36 A                                      TEXT('Generell kundespes')
     A            LBTANS      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Telleansvarlig')
     A                                      TEXT('Telleansvarlig')
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LBBOTY    R               REFFLD(LÅOTYP)
     A                                      COLHDG('Blav. BF Otyp')
     A                                      TEXT('Blavalg best.f Ordretype')
     A            LBBSTS         1A
     A                                      COLHDG('Blav. BF Stat')
     A                                      TEXT('Blavalg best.f Status')
     A            LBBSLG    R               REFFLD(LÅSELG)
     A                                      COLHDG('Blav. BF Selger')
     A                                      TEXT('Blavalg best.f Selger')
     A            LBBLEV    R               REFFLD(LÅLDOR)
     A                                      COLHDG('Blav. BF Lev.')
     A                                      TEXT('Blavalg best.f Leverandør')
     A            LBFLOW      0010A
     A                                      COLHDG('Workflow')
     A                                      TEXT('Workflow')
     A            LBCTRL      0003A
     A                                      COLHDG('Workflow Control')
     A                                      TEXT('Workflow Control')
6.10 A            LBODAT    R               REFFLD(LÅODAT)
6.10 A            LBOTIM    R               REFFLD(LÅOTIM)
6.10 A            LBOUSR    R               REFFLD(LÅOUSR)
6.10 A            LBEDAT    R               REFFLD(LÅEDAT)
6.10 A            LBETIM    R               REFFLD(LÅETIM)
6.10 A            LBEUSR    R               REFFLD(LÅEUSR)
      *
      *  Lagertelling-batch-register        (LC)
      *
     A            LCFIRM    R               REFFLD(LÅFIRM)
     A            LCBATC    R               REFFLD(LÅBATC)
     A            LCBDAT          L
     A                                      COLHDG('Start dato')
     A                                      TEXT('Start dato')
     A            LCBTIM          T
     A                                      COLHDG('Start kl.')
     A                                      TEXT('Start kl.')
     A            LCEDAT          L
     A                                      COLHDG('Slutt dato')
     A                                      TEXT('Slutt dato')
     A            LCETIM          T
     A                                      COLHDG('Slutt kl.')
     A                                      TEXT('Slutt kl.')
     A            LCSPER      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Sperret')
     A                                      TEXT('Sperret')
     A            LCANTB      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Antall bunter')
     A                                      TEXT('Antall bunter')
     A            LCAHTE      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Antall i Handterm')
     A                                      TEXT('Antall i Handterm')
     A            LCANSV      0030A
     A                                      COLHDG('Ansvarlig')
     A                                      TEXT('Ansvarlig')
     A            LCNUMM      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Telle-liste-nr')
     A                                      TEXT('Telle-liste-nr')
     A            LCLOPE      0006A
     A                                      COLHDG('Ident. LØPENR')
     A                                      TEXT('Ident. LØPENR')
     A            LCSTEL      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Syklist' 'telling')
     A                                      TEXT('Syklist telling')
6.10 A            LCODAT    R               REFFLD(LÅODAT)
6.10 A            LCOTIM    R               REFFLD(LÅOTIM)
6.10 A            LCOUSR    R               REFFLD(LÅOUSR)
6.10 A            LCEEDA    R               REFFLD(LÅEDAT)
6.10 A            LCEETI    R               REFFLD(LÅETIM)
6.10 A            LCEUSR    R               REFFLD(LÅEUSR)
      *
      *  Bestilling-linje-register          (LD)
      *
     A            LDFIRM    R               REFFLD(LÅFIRM)
     A            LDNUMM    R               REFFLD(LÅNUMM)
     A            LDSUFF    R               REFFLD(LÅSUFF)
     A            LDLINE    R               REFFLD(LÅLINE)
     A            LDOTYP    R               REFFLD(LÅOTYP)
     A            LDLTYP    R               REFFLD(LÅLTYP)
     A            LDLETY    R               REFFLD(LÅLETY)
     A            LDVARE    R               REFFLD(LÅVARE)
     A            LDENH1    R               REFFLD(LÅENHE)
     A            LDLAGE    R               REFFLD(LÅLAGE)
     A            LDLDOR    R               REFFLD(LÅLDOR)
     A            LDLDAT          L
     A                                      COLHDG('Leveringsdato')
     A                                      TEXT('Leveringsdato')
     A            LDAVDE    R               REFFLD(LÅAVDE)
     A            LDKONT    R               REFFLD(LÅKONT)
     A            LDSPES    R               REFFLD(LÅSPES)
     A            LDPROJ    R               REFFLD(LÅPROJ)
     A            LDAKTI    R               REFFLD(LÅAKTI)
6.NU A            LDORNU      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ordrenummer')
     A                                      TEXT('Ordrenummer')
     A            LDORSU    R               REFFLD(LÅSUFF)
     A            LDORLI    R               REFFLD(LÅLINE)
     A            LDLVAR    R               REFFLD(LÅLVAR)
     A            LDNOBB    R               REFFLD(LÅNOBB)
6.14 A            LDEANN    R               REFFLD(LÅEANN)
     A            LDTEK1    R               REFFLD(LÅTEK1)
     A            LDTEK2    R               REFFLD(LÅTEK2)
     A            LDANTA      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall')
     A                                      TEXT('Antall')
     A                                      COMP(LT 99999999)
     A                                      CHKMSGID(LRD0090 *LIBL/QMFLAGR)
     A            LDIPNY      0009S 2
     A                                      EDTWRD('     0 ,  ')
     A                                      COLHDG('Innkjøpspris')
     A                                      TEXT('Innkjøpspris')
     A            LDKPNY      0009S 2
     A                                      EDTWRD('     0 ,  ')
     A                                      COLHDG('Kost-pris')
     A                                      TEXT('Kost-pris')
     A            LDRAB1      0005S 2
     A                                      EDTCDE(Z)
     A                                      COLHDG('Linje-rabatt 1')
     A                                      TEXT('Linje-rabatt 1')
     A                                      COMP(LE 100)
     A                                      CHKMSGID(LRD0100 *LIBL/QMFLAGR)
     A            LDRAB2      0005S 2
     A                                      EDTCDE(Z)
     A                                      COLHDG('Linje-rabatt 2')
     A                                      TEXT('Linje-rabatt 2')
     A                                      COMP(LE 100)
     A                                      CHKMSGID(LRD0100 *LIBL/QMFLAGR)
     A            LDSUMI      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Sum kjøp')
     A                                      TEXT('Sum kjøp')
     A            LDSUMR      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Sum rabatt')
     A                                      TEXT('Sum rabatt')
     A            LDSUMK      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Sum kost')
     A                                      TEXT('Sum kost')
6.32 A            LDOMVA         1A         TEXT('Økonomi MVA-kode')
6.32 A                                      COLHDG('OKON' 'MVA')
6.32  *
     A            LDLVRE      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lokalt vreg')
     A                                      TEXT('Lokalt vreg')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LDVARI       140A         TEXT('Varians')
     A                                      COLHDG('Varians')
     A            LDOGRP    R               REFFLD(LÅOGRP)
     A            LDHGRP    R               REFFLD(LÅHGRP)
     A            LDUGRP    R               REFFLD(LÅUGRP)
     A            LDKPLJ      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kostpr.just linje')
     A                                      TEXT('Kostpr.just linje')
6.10 A            LDODAT    R               REFFLD(LÅODAT)
6.10 A            LDOTIM    R               REFFLD(LÅOTIM)
6.10 A            LDOUSR    R               REFFLD(LÅOUSR)
6.10 A            LDEDAT    R               REFFLD(LÅEDAT)
6.10 A            LDETIM    R               REFFLD(LÅETIM)
6.10 A            LDEUSR    R               REFFLD(LÅEUSR)
      *
      *  Lagertelling-telle-register        (LE)
      *
     A            LEFIRM    R               REFFLD(LÅFIRM)
     A            LEBATC    R               REFFLD(LÅBATC)
     A            LENUMM      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Telle-liste-nr')
     A                                      TEXT('Telle-liste-nr')
     A            LESUFF      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Telle-liste-sub')
     A                                      TEXT('Telle-liste-sub')
     A            LELINE      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Linjenummer')
     A                                      TEXT('Linjenummer')
     A            LEDLOP      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Løpenr-diversevarer')
     A                                      TEXT('Løpenr-diversevarer')
     A            LEOGRP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Overgruppe')
     A                                      TEXT('Overgruppe')
     A            LEHGRP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedgruppe')
     A                                      TEXT('Hovedgruppe')
     A            LEUGRP      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Undergruppe')
     A                                      TEXT('Undergruppe')
     A            LEVARE    R               REFFLD(LÅVARE)
     A            LELAGE    R               REFFLD(LÅLAGE)
     A            LEPLAS    R               REFFLD(LÅPLAS)
     A            LETEK1    R               REFFLD(LÅTEK1)
     A            LEENH1    R               REFFLD(LÅENHE)
     A            LEANTT      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall, tellet')
     A                                      TEXT('Antall, tellet')
     A                                      COMP(LT 99999999)
     A                                      CHKMSGID(LRD0090 *LIBL/QMFLAGR)
     A            LEANTL      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall, i lager')
     A                                      TEXT('Antall, i lager')
     A                                      COMP(LT 99999999)
     A                                      CHKMSGID(LRD0090 *LIBL/QMFLAGR)
     A            LEANTB      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall, i bunt')
     A                                      TEXT('Antall, i bunt')
     A                                      COMP(LT 99999999)
     A                                      CHKMSGID(LRD0090 *LIBL/QMFLAGR)
     A            LESPNY      0009S 2
     A                                      EDTWRD('     0 ,  ')
     A                                      COLHDG('Salgspris')
     A                                      TEXT('Salgspris')
     A            LEKPNY      0009S 2
     A                                      EDTWRD('     0 ,  ')
     A                                      COLHDG('Kostpris')
     A                                      TEXT('Kostpris')
6.22 A            LETIMS          Z         TEXT('Timestamp')
6.22 A                                      COLHDG('Timestamp')
6.2B A                                      DFT('0001-01-01-00.00.00.000000')
6.12 A            LEODAT    R               REFFLD(LÅODAT)
6.12 A            LEOTIM    R               REFFLD(LÅOTIM)
6.12 A            LEOUSR    R               REFFLD(LÅOUSR)
6.12 A            LEEDAT    R               REFFLD(LÅEDAT)
6.12 A            LEETIM    R               REFFLD(LÅETIM)
6.12 A            LEEUSR    R               REFFLD(LÅEUSR)
      *
      *  Bestilling-forslag-register        (LF)
      *
     A            LFFIRM    R               REFFLD(LÅFIRM)
     A            LFNUMM      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Forslag_nummer')
     A                                      TEXT('Forslag_nummer')
     A                                      COMP(NE 0)
     A                                      CHKMSGID(LM00011 *LIBL/QMFLAGR)
     A            LFLINE    R               REFFLD(LÅLINE)
     A            LFLTYP    R               REFFLD(LÅLTYP)
     A            LFLDOR    R               REFFLD(LÅLDOR)
     A            LFLAGE    R               REFFLD(LÅLAGE)
     A            LFOGRP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Overgruppe')
     A                                      TEXT('Overgruppe')
     A            LFHGRP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedgruppe')
     A                                      TEXT('Hovedgruppe')
     A            LFUGRP      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Undergruppe')
     A                                      TEXT('Undergruppe')
     A            LFLVAR    R               REFFLD(LÅLVAR)
     A            LFVARE    R               REFFLD(LÅVARE)
     A            LFENH1    R               REFFLD(LÅENHE)
     A            LFTEK1    R               REFFLD(LÅTEK1)
     A            LFTEK2    R               REFFLD(LÅTEK2)
     A            LFANTA      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall')
     A                                      TEXT('Antall')
     A                                      COMP(LT 99999999)
     A                                      CHKMSGID(LRD0090 *LIBL/QMFLAGR)
     A            LFSTAT         1A
     A                                      COLHDG('Statuskode')
     A                                      TEXT('Statuskode')
     A            LFVEKT    R               REFFLD(LÅVEKT)
     A                                      COLHDG('Vekt')
     A                                      TEXT('Vekt på detalje')
     A            LFLBEL        11S 2
     A                                      COLHDG('Linjebeløp')
     A                                      TEXT('Linjebeløp')
     A            LFVLEV    R               REFFLD(LÅLDOR)
     A                                      COLHDG('Opprinnelig varelev.')
     A                                      TEXT('Opprinnelig varelev.')
6.NU A            LFORNR      0008S 0
6.22 A                                      EDTCDE(Z)
6.22 A                                      COLHDG('Ordrenummer')
6.22 A                                      TEXT('Ordrenummer')
6.22 A            LFORSU      0002S 0
6.22 A                                      EDTCDE(Z)
6.22 A                                      COLHDG('Suffix-ordre')
6.22 A                                      TEXT('Suffix-ordre')
6.22 A            LFORLI    R               REFFLD(LÅLINE)
6.22 A                                      EDTCDE(Z)
6.22 A                                      COLHDG('Linje-ordre')
6.22 A                                      TEXT('Linje-ordre')
6.22 A            LFLETY    R               REFFLD(LÅLETY)
6.22 A                                      COLHDG('Lev.type-ordre')
6.22 A                                      TEXT('Lev.type-ordre')
6.22 A            LFLDAT          L
6.22 A                                      COLHDG('Leveringsdato')
6.22 A                                      TEXT('Leveringsdato')
6.2B A                                      DFT('0001-01-01')
6.10 A            LFODAT    R               REFFLD(LÅEDAT)
6.10 A            LFOTIM    R               REFFLD(LÅETIM)
6.10 A            LFOUSR    R               REFFLD(LÅOUSR)
6.10 A            LFEDAT    R               REFFLD(LÅEDAT)
6.10 A            LFETIM    R               REFFLD(LÅETIM)
6.10 A            LFEUSR    R               REFFLD(LÅEUSR)
      *
      * Overføringsfil til økonomi          (FF)
      *
     A            LGFIRM    R               REFFLD(LÅFIRM)
      *
     A            LGPERI         4S 0       TEXT('Periode')
     A                                      COLHDG('Peri' 'ode')
     A                                      EDTCDE(Z)
      *
     A            LGBUNT         5S 0       TEXT('Bunt-nummer')
     A                                      COLHDG('Bunt' 'nr')
     A                                      EDTCDE(Z)
      *
6.NU A            LGBILN         8S 0       TEXT('Bilagsnummer')
     A                                      COLHDG('Bilag' 'nr')
     A                                      EDTCDE(Z)
      *
     A            LGBILL         4S 0       TEXT('Bilagslinje')
     A                                      COLHDG('Bilag' 'linje')
     A                                      EDTCDE(Z)
      *
     A            LGBDAT          L         TEXT('Bilagsdato')
     A                                      COLHDG('Bilags' 'dato')
      *
     A            LGFDAT          L         TEXT('Forfallsdato')
     A                                      COLHDG('Forf.' 'dato')
      *
     A            LGBILK         2S 0       TEXT('Bilags-kode')
     A                                      COLHDG('Bilag' 'kode')
     A                                      EDTCDE(Z)
      *
     A            LGTEXT        20A         TEXT('Bilags-tekst')
     A                                      COLHDG('Bilags-tekst')
      *
     A            LGDAVD         4S 0       TEXT('Debet avd')
     A                                      COLHDG('Debet' 'avd.')
     A                                      EDTCDE(Z)
      *
     A            LGDKTO         6S 0       TEXT('Debet konto')
     A                                      COLHDG('Debet' 'Konto')
     A                                      EDTCDE(Z)
      *
     A            LGDSPS         4S 0       TEXT('Debet Spes')
     A                                      COLHDG('Debet' 'Spes')
     A                                      EDTCDE(Z)
      *
     A            LGDMOM         1A         TEXT('Debet Moms')
     A                                      COLHDG('Debet' 'Moms')
      *
     A            LGBELP        10S 2       TEXT('Beløp')
     A                                      COLHDG('Beløp')
     A                                      EDTCDE(4)
6.32  *
6.32 A            LGMVAG        10S 2       TEXT('Mva. grunnl')
6.32 A                                      COLHDG('Mva' 'Grunnl')
6.32 A                                      EDTCDE(4)
      *
     A            LGCAVD         4S 0       TEXT('Kredit avd')
     A                                      COLHDG('Kred.' 'avd.')
     A                                      EDTCDE(Z)
      *
     A            LGCKTO         6S 0       TEXT('Kredit konto')
     A                                      COLHDG('Kred.' 'Konto')
     A                                      EDTCDE(Z)
      *
     A            LGCSPS         4S 0       TEXT('Kredit Spes')
     A                                      COLHDG('Kred.' 'Spes')
     A                                      EDTCDE(Z)
      *
     A            LGCMOM         1A         TEXT('Kredit Moms')
     A                                      COLHDG('Kred.' 'Moms')
      *
6.20 A**          LGPROJ         6S 0       TEXT('Prosjektnr.')
6.20 A            LGPROJ    R               REFFLD(LÅPROJ)
     A                                      COLHDG('Prosj.' 'nr.')
      *
6.20 A**          LGAKTI         3A         TEXT('Aktivitet')
6.20 A            LGAKTI    R               REFFLD(LÅAKTI)
     A                                      COLHDG('Akt')
      *
6.20 A            LGUPRO    R               REFFLD(LÅUPRO)
6.20 A            LGARBO    R               REFFLD(LÅARBO)
      *
6.NU A            LGKREF         8S 0       TEXT('Kreditreferanse')
     A                                      COLHDG('Kred.' 'ref.')
     A                                      EDTCDE(Z)
      *
     A            LGKUND         6S 0       TEXT('Reskontro-nummer.')
     A                                      COLHDG('Konto' 'Resk')
      *
     A            LGVALK         3A         TEXT('Valutakode')
     A                                      COLHDG('Val.' 'Kode')
      *
     A            LGVALB        11S 2       TEXT('Valutabeløp')
     A                                      COLHDG('Val.' 'Beløp')
     A                                      EDTCDE(4)
      *
     A            LGMNGK         2S 0       TEXT('Mengde Kode')
     A                                      COLHDG('Mengde' 'Kode')
     A                                      EDTCDE(Z)
      *
     A            LGMNGD         9S 2       TEXT('Mengde')
     A                                      COLHDG('Mengde')
     A                                      EDTCDE(4)
      *
     A            LGAUTX         1A         TEXT('Saldert/Krysset')
     A                                      COLHDG('Saldert')
      *
     A            LGKIDI        25A         TEXT('Kidinformasjon')
     A                                      COLHDG('Kidfelt')
      *
     A            LGSFAK      0015A         TEXT('Selgers fak.nr')
     A                                      COLHDG('Selgers fak.nr')
7.00 A            LGLOGG          Z         TEXT('Logg tidspunkt')
7.00 A                                      COLHDG('Loggtid')
      *
      *  Bestilling-forslag-hode-register   (LH)
      *
     A            LHFIRM    R               REFFLD(LÅFIRM)
     A            LHNUMM      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Forslag_nummer')
     A                                      TEXT('Forslag_nummer')
     A                                      COMP(NE 0)
     A                                      CHKMSGID(LM00011 *LIBL/QMFLAGR)
     A            LHOTYP    R               REFFLD(LÅOTYP)
     A            LHLAGE    R               REFFLD(LÅLAGE)
     A            LHAVDE    R               REFFLD(LÅAVDE)
     A            LHBDAT          L
     A                                      COLHDG('Best_dato')
     A                                      TEXT('Best_dato')
     A            LHLDAT          L
     A                                      COLHDG('Leveringsdato')
     A                                      TEXT('Leveringsdato')
     A            LHWSID      0010A
     A                                      COLHDG('Arbeidstasjon')
     A                                      TEXT('Arbeidstasjon')
     A            LHUSER    R               REFFLD(LÅUSER)
     A            LHOVRF         1A
     A                                      COLHDG('Overført')
     A                                      TEXT('Overført')
     A            LHDATE          L
     A                                      COLHDG('Dato opprettet')
     A                                      TEXT('Dato opprettet')
     A            LHTIME          T
     A                                      COLHDG('Klokkeslett')
     A                                      TEXT('Klokkeslett')
     A            LHSELG    R               REFFLD(LÅSELG)
     A                                      COLHDG('Ansvarlig')
     A                                      TEXT('Ansvarlig')
     A            LHLSOR        12A
     A                                      COLHDG('Sort.lev.navn')
     A                                      TEXT('Sorteringsfelt - lev.navn')
     A            LHSTAT         1A
     A                                      COLHDG('Statuskode')
     A                                      TEXT('Statuskode')
     A            LHLDOR    R               REFFLD(LÅLDOR)
     A            LHVEKT    R               REFFLD(LÅVEKT)
     A                                      COLHDG('Tot.vekt')
     A                                      TEXT('Total vekt best.forslag')
     A            LHTBEL        11S 2
     A                                      COLHDG('Tot.beløp')
     A                                      TEXT('Total beløp best.forslag')
     A            LHOPPR         1A
     A                                      COLHDG('Oppr.')
     A                                      TEXT('Opprinnelse R=radiot.,H=håndt-
     A                                       A=autom. M=manuell')
     A            LHSATS         3S 0       TEXT('Øke best.pkt med sats  ')
     A                                      COLHDG('Sats')
     A                                      EDTCDE(Z)
     A            LHLNUM         3S 0       TEXT('Løpenr.i parameter')
     A                                      COLHDG('Løpenr. parm.')
     A                                      EDTCDE(Z)
     A            LHBNUM    R               REFFLD(LÅNUMM)
6.NU A            LHORNR      0008S 0
6.22 A                                      EDTCDE(Z)
6.22 A                                      COLHDG('Ordrenummer')
6.22 A                                      TEXT('Ordrenummer')
6.22 A            LHORSU      0002S 0
6.22 A                                      EDTCDE(Z)
6.22 A                                      COLHDG('Suffix-ordre')
6.22 A                                      TEXT('Suffix-ordre')
6.22 A            LHLETY    R               REFFLD(LÅLETY)
6.22 A                                      COLHDG('Lev.type-ordre')
6.22 A                                      TEXT('Lev.type-ordre')
6.10 A            LHOUSR    R               REFFLD(LÅOUSR)
6.10 A            LHEDAT    R               REFFLD(LÅEDAT)
6.10 A            LHETIM    R               REFFLD(LÅETIM)
6.10 A            LHEUSR    R               REFFLD(LÅEUSR)
      *
      *  EDI-retur meldinger                (LI)
      *
     A            LIFIRM    R               REFFLD(LÅFIRM)
6.10 A            LIKODE         1A         COLHDG('Meldings_kode')
6.10 A                                      TEXT('Meldings_kode')
     A            LITYPE         4A
     A                                      COLHDG('Meldings_type')
     A                                      TEXT('Meldings_type')
8.01 A            LIMNUM         8S 0       TEXT('Meldingsnummer')
     A                                      COLHDG('Meldingsnummer')
     A            LIMLIN         6S 0       TEXT('Meldingslinje')
     A                                      COLHDG('Meldingslinje')
     A            LIMDAT          L
     A                                      COLHDG('Meldings_dato')
     A                                      TEXT('Meldings_dato')
     A            LIMTID          T
     A                                      COLHDG('Meldings_tid')
     A                                      TEXT('Meldings_tid')
6.NU A            LINUMM         8S 0       TEXT('Best.nr')
     A                                      COLHDG('Best.nr')
     A            LISUFF         2S 0       TEXT('Suff.nr')
     A                                      COLHDG('Suff.nr')
     A            LILINE         4S 0       TEXT('Bes.lin')
     A                                      COLHDG('Bes.lin')
     A            LILDOR         6S 0       TEXT('Leverandør')
     A                                      COLHDG('Leverandør')
7.NX A            LIKUND         6S 0       TEXT('Kunde')
7.NX A                                      COLHDG('Kunde')
     A            LIMELD       400A
     A                                      COLHDG('Melding')
     A                                      TEXT('Melding')
     A            LISTAT         1A
     A                                      COLHDG('Meldings_status')
     A                                      TEXT('Meldings_status')
6.10 A            LIODAT    R               REFFLD(LÅODAT)
6.10 A            LIOTIM    R               REFFLD(LÅOTIM)
6.10 A            LIOUSR    R               REFFLD(LÅOUSR)
6.10 A            LIEDAT    R               REFFLD(LÅEDAT)
6.10 A            LIETIM    R               REFFLD(LÅETIM)
6.10 A            LIEUSR    R               REFFLD(LÅEUSR)
      *
      *  Fast bestillingstekst-register     (LJ)
      *
     A            LJFIRM    R               REFFLD(LÅFIRM)
     A            LJNUMM      0006A
     A                                      COLHDG('Tekst-kode')
     A                                      TEXT('Tekst-kode')
     A            LJREFX      0030A
     A                                      COLHDG('Referanse')
     A                                      TEXT('Referanse')
     A            LJSL01      0070A
     A                                      COLHDG('Tekst-01')
     A                                      TEXT('Tekst-01')
     A            LJSL02      0070A
     A                                      COLHDG('Tekst-02')
     A                                      TEXT('Tekst-02')
     A            LJSL03      0070A
     A                                      COLHDG('Tekst-03')
     A                                      TEXT('Tekst-03')
     A            LJSL04      0070A
     A                                      COLHDG('Tekst-04')
     A                                      TEXT('Tekst-04')
     A            LJSL05      0070A
     A                                      COLHDG('Tekst-05')
     A                                      TEXT('Tekst-05')
     A            LJSL06      0070A
     A                                      COLHDG('Tekst-06')
     A                                      TEXT('Tekst-06')
     A            LJSL07      0070A
     A                                      COLHDG('Tekst-07')
     A                                      TEXT('Tekst-07')
     A            LJSL08      0070A
     A                                      COLHDG('Tekst-08')
     A                                      TEXT('Tekst-08')
     A            LJSL09      0070A
     A                                      COLHDG('Tekst-09')
     A                                      TEXT('Tekst-09')
     A            LJSL10      0070A
     A                                      COLHDG('Tekst-10')
     A                                      TEXT('Tekst-10')
     A            LJSL11      0070A
     A                                      COLHDG('Tekst-11')
     A                                      TEXT('Tekst-11')
     A            LJSL12      0070A
     A                                      COLHDG('Tekst-12')
     A                                      TEXT('Tekst-12')
     A            LJSL13      0070A
     A                                      COLHDG('Tekst-13')
     A                                      TEXT('Tekst-13')
     A            LJSL14      0070A
     A                                      COLHDG('Tekst-14')
     A                                      TEXT('Tekst-14')
     A            LJSL15      0070A
     A                                      COLHDG('Tekst-15')
     A                                      TEXT('Tekst-15')
     A            LJSL16      0070A
     A                                      COLHDG('Tekst-16')
     A                                      TEXT('Tekst-16')
     A            LJSL17      0070A
     A                                      COLHDG('Tekst-17')
     A                                      TEXT('Tekst-17')
     A            LJSL18      0070A
     A                                      COLHDG('Tekst-18')
     A                                      TEXT('Tekst-18')
6.10 A            LJODAT    R               REFFLD(LÅODAT)
6.10 A            LJOTIM    R               REFFLD(LÅOTIM)
6.10 A            LJOUSR    R               REFFLD(LÅOUSR)
6.10 A            LJEDAT    R               REFFLD(LÅEDAT)
6.10 A            LJETIM    R               REFFLD(LÅETIM)
6.10 A            LJEUSR    R               REFFLD(LÅEUSR)
      *
      *  Utplukk-param-register             (LKP)
      *
     A            LKPFIR    R               REFFLD(LÅFIRM)
     A            LKPONR    R               REFFLD(LÅNUMM)
     A            LKPSUF    R               REFFLD(LÅSUFF)
     A            LKPOTY    R               REFFLD(LÅOTYP)
     A            LKPLAG    R               REFFLD(LÅLAGE)
     A            LKPWSD      0010A
     A                                      COLHDG('Arbeids-stasjon')
     A                                      TEXT('Arbeids-stasjon')
     A            LKPUSR      0010A
     A                                      COLHDG('Bruker')
     A                                      TEXT('Bruker')
     A            LKPALT      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Alternativ')
     A                                      TEXT('Alternativ')
     A            LKPDIR      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Direkte ut')
     A                                      TEXT('Direkte ut')
     A            LKPRES      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Restet')
     A                                      TEXT('Restet')
     A            LKPTXT      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Fast tekst')
     A                                      TEXT('Fast tekst')
     A            LKPKOL      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Kolli')
     A                                      TEXT('Kolli')
     A            LKPNET      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Netto vekt')
     A                                      TEXT('Netto vekt')
     A            LKPBRU      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Brutto vekt')
     A                                      TEXT('Brutto vekt')
     A            LKPLMT      0020A
     A                                      COLHDG('Lev. måte tekst')
     A                                      TEXT('Lev. måte tekst')
     A            LKPFPR      0009S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Frakt pris')
     A                                      TEXT('Frakt pris')
     A            LKPFTE      0030A
     A                                      COLHDG('Frakt tekst')
     A                                      TEXT('Frakt tekst')
     A            LKPEPR      0009S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Emball.pris')
     A                                      TEXT('Emball.pris')
     A            LKPETE      0030A
     A                                      COLHDG('Emb.tekst')
     A                                      TEXT('Emb.tekst')
      *
      *  Utplukk-linje-register             (LKL)
      *
     A            LKLFIR    R               REFFLD(LÅFIRM)
     A            LKLONR    R               REFFLD(LÅNUMM)
     A            LKLSUF    R               REFFLD(LÅSUFF)
     A            LKLLIN    R               REFFLD(LÅLINE)
     A            LKLANT      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall')
     A                                      TEXT('Antall')
     A            LKLKOD      0001A
     A                                      COLHDG('Utplukkskode')
     A                                      TEXT('Utplukkskode')
      *
      *  Plukk-1-linje-register             (LK1)
      *
     A            LK1FIR    R               REFFLD(LÅFIRM)
     A            LK1WSD      0010A
     A                                      COLHDG('Arbeids-stasjon')
     A                                      TEXT('Arbeids-stasjon')
     A            LK1USR      0010A
     A                                      COLHDG('Bruker')
     A                                      TEXT('Bruker')
     A            LK1LST      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Listenr')
     A                                      TEXT('Listenr')
     A            LK1UTQ      0010A
     A                                      COLHDG('Printer-Outq')
     A                                      TEXT('Printer-Outq')
     A            LK1OTY    R               REFFLD(LÅOTYP)
     A            LK1ONR    R               REFFLD(LÅNUMM)
     A            LK1SUF    R               REFFLD(LÅSUFF)
     A            LK1VG0      0001S 0
     A                                      COLHDG('Direkte/Jobbkø')
     A                                      TEXT('Direkte/Jobbkø')
     A            LK1VG1      0001S 0
     A                                      COLHDG('Variant')
     A                                      TEXT('Variant')
     A            LK1VG2      0001S 0
     A                                      COLHDG('Valg-Skjerm')
     A                                      TEXT('Valg-Skjerm')
     A            LK1VG3      0001S 0
     A                                      COLHDG('Valg-Bruker')
     A                                      TEXT('Valg-Bruker')
     A            LK1PER      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Periode')
     A                                      TEXT('Periode')
     A            LK1DAT          L
     A                                      COLHDG('Fakt.dato')
     A                                      TEXT('Fakt.dato')
      *
      *  Plukk-2-linje-register             (LK2)
      *
     A            LK2FIR    R               REFFLD(LÅFIRM)
     A            LK2WSD      0010A
     A                                      COLHDG('Arbeids-stasjon')
     A                                      TEXT('Arbeids-stasjon')
     A            LK2USR      0010A
     A                                      COLHDG('Bruker')
     A                                      TEXT('Bruker')
     A            LK2LST      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Listenr')
     A                                      TEXT('Listenr')
     A            LK2UTQ      0010A
     A                                      COLHDG('Printer-Outq')
     A                                      TEXT('Printer-Outq')
     A            LK2OTY    R               REFFLD(LÅOTYP)
     A            LK2ONR    R               REFFLD(LÅNUMM)
     A            LK2SUF    R               REFFLD(LÅSUFF)
     A            LK2VG0      0001S 0
     A                                      COLHDG('Direkte/Jobbkø')
     A                                      TEXT('Direkte/Jobbkø')
     A            LK2VG1      0001S 0
     A                                      COLHDG('Variant')
     A                                      TEXT('Variant')
     A            LK2VG2      0001S 0
     A                                      COLHDG('Valg-dkjerm')
     A                                      TEXT('Valg-skjerm')
     A            LK2VG3      0001S 0
     A                                      COLHDG('Valg-Bruker')
     A                                      TEXT('Valg-Bruker')
     A            LK2PER      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Periode')
     A                                      TEXT('Periode')
     A            LK2DAT          L
     A                                      COLHDG('Fakt.dato')
     A                                      TEXT('Fakt.dato')
      *
      *  Plukk-S-linje-register             (LKS)
      *
     A            LKSFIR    R               REFFLD(LÅFIRM)
6.NU A            LKSONR      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Best_nr')
     A                                      TEXT('Best_nr')
     A            LKSSUF    R               REFFLD(LÅSUFF)
     A            LKSTLL      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Teller')
     A                                      TEXT('Teller')
     A            LKSLIN    R               REFFLD(LÅLINE)
     A            LKSKOD      0001A
     A                                      COLHDG('Type-kode')
     A                                      TEXT('Type-kode')
     A                                      VALUES('H' 'K' 'T' 'V' 'R')
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LKSOTY    R               REFFLD(LÅOTYP)
     A            LKSALT      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Alternativ')
     A                                      TEXT('Alternativ')
6.NU A            LKSSRT      0068A
     A                                      COLHDG('Sortering')
     A                                      TEXT('Sortering')
     A            LKSANT      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall plukket')
     A                                      TEXT('Antall plukket')
     A            LKSDIV      0010A
     A                                      COLHDG('Diverse')
     A                                      TEXT('Diverse')
      *
      *  Bestilling logg-register          (LM)
      *
     A            LMFIRM    R               REFFLD(LÅFIRM)
      *
     A            LMNUMM    R               REFFLD(LÅNUMM)
      *
     A            LMSUFF    R               REFFLD(LÅSUFF)
      *
     A            LMKODE         1A         TEXT('Logg-kode')
     A                                      COLHDG('Logg' 'kode')
      *
      *                                     Logg koden er som følger:
      *                                     1 = Bestilling sendt
      *                                     2 = Bestilling bekreftet
      *
     A            LMDATE          L         TEXT('Dato logget')
     A                                      COLHDG('Dato logget')
      *
     A            LMTIME          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
      *
     A            LMWSID        10A         TEXT('Arbeidstasjon')
     A                                      COLHDG('Arbeidstasjon')
      *
     A            LMUSER        10A         TEXT('Bruker-ID')
     A                                      COLHDG('Bruker-ID')
      *
      * Ordre Logg-koder                    (LN)
      *
     A            LNFIRM    R               REFFLD(LÅFIRM)
     A            LNTYPE         1A
     A            LNTEXT        20A
     A            LNEDAT    R               REFFLD(LÅEDAT)
     A            LNETIM    R               REFFLD(LÅETIM)
     A            LNEUSR    R               REFFLD(LÅEUSR)
      *
      *  Bestilling-hode-register           (LO)
      *
     A            LOFIRM    R               REFFLD(LÅFIRM)
     A            LONUMM    R               REFFLD(LÅNUMM)
     A            LOSUFF    R               REFFLD(LÅSUFF)
     A                                      COLHDG('Siste suffix')
     A                                      TEXT('Siste suffix')
     A            LOLINE    R               REFFLD(LÅLINE)
     A            LOOTYP    R               REFFLD(LÅOTYP)
     A            LOLAGE    R               REFFLD(LÅLAGE)
6.NU A            LOBINR      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagsnummer')
     A                                      TEXT('Bilagsnummer')
     A            LOBITX      0025
     A                                      COLHDG('Bilagstekst')
     A                                      TEXT('Bilagstekst')
     A            LOBKID      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kid-kode')
     A                                      TEXT('Kid-kode')
     A                                      VALUES(0 1)
     A            LOKIDI      0025A
     A                                      COLHDG('Kid-Felt')
     A                                      TEXT('Kid-Felt')
     A            LOKREF      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kreditt-ref.')
     A                                      TEXT('Kreditt-ref.')
     A            LOBDAT          L
     A                                      COLHDG('Best_dato')
     A                                      TEXT('Best_dato')
     A            LOLDAT          L
     A                                      COLHDG('Ønsket lev.dat')
     A                                      TEXT('Ønsket lev.dat')
     A            LOFKDA          L
     A                                      COLHDG('Fakturadato')
     A                                      TEXT('Fakturadato')
     A            LOFFDA          L
     A                                      COLHDG('Forfallsdato')
     A                                      TEXT('Forfallsdato')
     A            LOPERI      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Periode')
     A                                      TEXT('Periode')
     A            LOMODA          L
     A                                      COLHDG('Bekreftet lev.dat')
     A                                      TEXT('Bekreftet lev.dat')
     A            LOVIDA          L
     A                                      COLHDG('Virkelig lev.dat')
     A                                      TEXT('Virkelig lev.dat')
     A            LOBETB      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bet.betingelser')
     A                                      TEXT('Bet.betingelser')
     A            LOINNK      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Innkjøper')
     A                                      TEXT('Innkjøper')
     A            LODIST      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Distrikt')
     A                                      TEXT('Distrikt')
     A            LOLMAT      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Leveringsmåte')
     A                                      TEXT('Leveringsmåte')
     A            LOLBET      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Leveringsbet.')
     A                                      TEXT('Leveringsbet.')
     A            LOVALK      0003A
     A                                      COLHDG('Valuta')
     A                                      TEXT('Valuta')
     A            LORKAT      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-kategori')
     A                                      TEXT('Rabatt-kategori')
     A            LOSPED      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Speditør')
     A                                      TEXT('Speditør')
     A            LOKJOR      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kjørerute')
     A                                      TEXT('Kjørerute')
     A            LOMKOD      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Mva-kode')
     A                                      TEXT('Mva-kode')
6.37 A                                      VALUES(0 1 2)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LOLELE      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Vare-adresse')
     A                                      TEXT('Vare-adresse')
     A            LOLDOR    R               REFFLD(LÅLDOR)
     A            LOLENA      0030A
     A                                      COLHDG('Leverandør-navn')
     A                                      TEXT('Leverandør-navn')
     A            LONAVN      0030A
     A                                      COLHDG('Navn')
     A                                      TEXT('Navn')
     A            LOADR1      0030A
     A                                      COLHDG('Adresse 1')
     A                                      TEXT('Adresse 1')
     A            LOADR2      0030A
     A                                      COLHDG('Adresse 2')
     A                                      TEXT('Adresse 2')
     A            LOSTED      0030A
     A                                      COLHDG('Poststed')
     A                                      TEXT('Poststed')
     A            LOAVDE    R               REFFLD(LÅAVDE)
     A            LOKONT    R               REFFLD(LÅKONT)
     A            LOSPES    R               REFFLD(LÅSPES)
     A            LOPROJ    R               REFFLD(LÅPROJ)
     A            LOAKTI    R               REFFLD(LÅAKTI)
6.20 A            LOUPRO    R               REFFLD(LÅUPRO)
6.20 A            LOARBO    R               REFFLD(LÅARBO)
     A            LOLOPP      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lager, Oppdatert')
     A                                      TEXT('Lager, Oppdatert')
     A                                      VALUES(0 1)
     A            LOBSEN      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Best sendt')
     A                                      TEXT('Best sendt')
     A                                      VALUES(0 1)
     A            LOBSDA          L
     A                                      COLHDG('Sendt dato')
     A                                      TEXT('Sendt dato')
     A            LOBSAV      0010A
     A                                      COLHDG('Sendt av')
     A                                      TEXT('Sendt av')
     A            LOKFAK      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Faktura kjørt?')
     A                                      TEXT('Faktura kjørt?')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LOKSPR      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Sperret f.vedl.')
     A                                      TEXT('Sperret f.vedl.')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
6.12 A            LOVREF      0030A
     A                                      COLHDG('Vår ref.')
     A                                      TEXT('Vår ref.')
6.12 A            LODREF      0030A
     A                                      COLHDG('Deres ref.')
     A                                      TEXT('Deres ref.')
6.33  *
6.33 A            LOKPNR      0006S 0       TEXT('Kontaktpersonnr.')
6.33 A                                      COLHDG('Kontaktp.nr.')
6.33 A                                      EDTCDE(Z)
     A            LOREKV      0020A
     A                                      COLHDG('Kund.rekv.nr.')
     A                                      TEXT('Kund.rekv.nr.')
     A            LOLMTX      0020A
     A                                      COLHDG('Lev. måte tekst')
     A                                      TEXT('Lev. måte tekst')
     A            LOLBTX      0075A
     A                                      COLHDG('Lev. bet. tekst')
     A                                      TEXT('Lev. bet. tekst')
     A            LORABP      0005S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Rabatt i %')
     A                                      TEXT('Rabatt i %')
6.NU A            LOORNR      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ordrenummer')
     A                                      TEXT('Ordrenummer')
     A            LOORSU      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Suffix-ordre')
     A                                      TEXT('Suffix-ordre')
     A            LONETT      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Netto vekt')
     A                                      TEXT('Netto vekt')
     A            LOBRUT      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Brutto vekt')
     A                                      TEXT('Brutto vekt')
     A            LOKOLI      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Kolli')
     A                                      TEXT('Kolli')
     A            LOKONR      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Kontant-rabatt')
     A                                      TEXT('Kontant-rabatt')
     A            LOTOTX      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('KR fritt kjøp')
     A                                      TEXT('KR fritt kjøp')
     A            LOTOTF      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Bruttosum,faktura')
     A                                      TEXT('Bruttosum,faktura')
     A            LOTOTI      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Total kjøp')
     A                                      TEXT('Total kjøp')
     A            LOTOTR      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Total rabatt')
     A                                      TEXT('Total rabatt')
     A            LOTOTK      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Total kost')
     A                                      TEXT('Total kost')
     A            LOWSID      0010A
     A                                      COLHDG('Arbeidstasjon')
     A                                      TEXT('Arbeidstasjon')
     A            LOUSER    R               REFFLD(LÅUSER)
     A            LODATE          L
     A                                      COLHDG('Dato opprettet')
     A                                      TEXT('Dato opprettet')
     A            LOTIME          T
     A                                      COLHDG('Klokkeslett')
     A                                      TEXT('Klokkeslett')
     A            LOKODE      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Behandling pågår')
     A                                      TEXT('Behandling pågår')
     A            LOKOWS      0010A
     A                                      COLHDG('Behandl. WS')
     A                                      TEXT('Behandl. WS')
     A            LOKOUS      0010A
     A                                      COLHDG('Behandl. bruker')
     A                                      TEXT('Behandl. bruker')
     A            LOKODA          L
     A                                      COLHDG('Behandl. dato')
     A                                      TEXT('Behandl. dato')
     A            LOKOTI          T
     A                                      COLHDG('Behandl. kl')
     A                                      TEXT('Behandl. kl')
     A            LOBIND      0001A
     A                                      COLHDG('Binding til skjerm')
     A                                      TEXT('Binding til skjerm')
     A                                      VALUES(' ' 'N' 'J' 'X')
     A                                      CHKMSGID(LRO0160 *LIBL/QMFLAGR)
     A            LOLADR      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lev.-adresse')
     A                                      TEXT('Lev.-adresse')
     A            LOKORN      0015A
     A                                      COLHDG('Kjøpers ordrenr')
     A                                      TEXT('Kjøpers ordrenr')
     A            LOFLEV      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Fakturaleverandør')
     A                                      TEXT('Fakturaleverandør')
     A            LOSORN      0015A
     A                                      COLHDG('Selgers ordrenr')
     A                                      TEXT('Selgers ordrenr')
     A            LOSFAK      0015A
     A                                      COLHDG('Selgers fakt.nr')
     A                                      TEXT('Selgers fakt.nr')
8.01 A            LOMNUM         8S 0       TEXT('EDI Meldingsnummer')
6.29 A                                      COLHDG('EDI meldnr.')
     A            LOFLOW      0010A
     A                                      COLHDG('Workflow')
     A                                      TEXT('Workflow')
6.29 A            LOKAMP         5A         TEXT('Kampanje')
6.29 A                                      COLHDG('Kamp.')
      *
6.10 A            LOEDAT    R               REFFLD(LÅEDAT)
6.10 A            LOETIM    R               REFFLD(LÅETIM)
6.10 A            LOEUSR    R               REFFLD(LÅEUSR)
      *
      *  Leverandør-distribusjon-register   (LP)
      *
     A            LPFIRM    R               REFFLD(LÅFIRM)
     A            LPLDOR    R               REFFLD(LÅLDOR)
     A            LPLAGE      0002A
     A                                      COLHDG('Lager')
     A                                      TEXT('Lager')
     A            LPTYPE      0010A
     A                                      COLHDG('Type')
     A                                      TEXT('Type')
     A            LPFORM      0010A
     A                                      COLHDG('Format')
     A                                      TEXT('Format')
     A            LPMOTT      0015A
     A                                      COLHDG('Mottaker')
     A                                      TEXT('Mottaker')
     A            LPMAIL      0050A
     A                                      COLHDG('E-Mail')
     A                                      TEXT('E-Mail')
     A            LPFAXN      0020A
     A                                      COLHDG('Faxnr.')
     A                                      TEXT('Faxnr.')
     A            LPLKNR      0020A
     A                                      COLHDG('Lev.knr.')
     A                                      TEXT('Lev.knr.')
6.21 A            LPOTYP    R               REFFLD(LÅOTYP)
6.21 A                                      COLHDG('Otyp.''Int.best')
6.21 A                                      TEXT('Ordretype int.best')
     A            LPFTPR      0010A
     A                                      COLHDG('FTP rutine')
     A                                      TEXT('FTP rutine')
     A            LPSIBE    R               REFFLD(LÅNUMM)
     A                                      COLHDG('Siste bestnr.')
     A                                      TEXT('Siste bestnr.')
     A            LPSIDA          L
     A                                      COLHDG('Siste sendedato')
     A                                      TEXT('Siste sendedato')
     A            LPSIKL          T
     A                                      COLHDG('Siste sendekl')
     A                                      TEXT('Siste sendekl')
6.2C A            LPNEBG      0001A
6.2C A                                      COLHDG('NEB godkjent')
6.2C A                                      TEXT('NEB godkjent')
     A            LPEDAT    R               REFFLD(LÅEDAT)
     A            LPETIM    R               REFFLD(LÅETIM)
     A            LPEUSR    R               REFFLD(LÅUSER)
      *
      *  Lager-transaksjons-hode            (LQ)
      *
     A            LQFIRM    R               REFFLD(LÅFIRM)
6.NU A            LQNUMM      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Nummer')
     A                                      TEXT('Nummer')
     A                                      COMP(NE 0)
     A                                      CHKMSGID(LM00011 *LIBL/QMFLAGR)
     A            LQTYPE      0002A
     A                                      COLHDG('Type')
     A                                      TEXT('Type')
     A            LQLAGE    R               REFFLD(LÅLAGE)
     A            LQLAST    R               REFFLD(LÅLAGE)
     A            LQTEXT      0030A
     A                                      COLHDG('Tekst')
     A                                      TEXT('Tekst')
     A            LQXRKO      0002A
     A                                      COLHDG('Årsakskode')
     A                                      TEXT('Årsakskode')
     A            LQWSID      0010A
     A                                      COLHDG('Arbeidstasjon')
     A                                      TEXT('Arbeidstasjon')
     A            LQUSER    R               REFFLD(LÅUSER)
     A            LQDATE          L
     A                                      COLHDG('Dato opprettet')
     A                                      TEXT('Dato opprettet')
     A            LQTIME          T
     A                                      COLHDG('Klokkeslett')
     A                                      TEXT('Klokkeslett')
     A            LQUTSK      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kjørt kontroll')
     A                                      TEXT('Kjørt kontroll')
     A            LQKODE      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Behandling pågår')
     A                                      TEXT('Behandling pågår')
6.10 A            LQEDAT    R               REFFLD(LÅEDAT)
6.10 A            LQETIM    R               REFFLD(LÅETIM)
6.10 A            LQEUSR    R               REFFLD(LÅEUSR)
      *
      *  Lager-transaskjson-register        (LS)
      *
     A            LSFIRM    R               REFFLD(LÅFIRM)
6.NU A            LSNUMM      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Nummer')
     A                                      TEXT('Nummer')
     A                                      COMP(NE 0)
     A                                      CHKMSGID(LM00011 *LIBL/QMFLAGR)
     A            LSLINE    R               REFFLD(LÅLINE)
     A            LSTYPE      0002A
     A                                      COLHDG('Type')
     A                                      TEXT('Type')
     A            LSVARE    R               REFFLD(LÅVARE)
     A            LSLAGE    R               REFFLD(LÅLAGE)
     A            LSLAST    R               REFFLD(LÅLAGE)
     A            LSANTA      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall')
     A                                      TEXT('Antall')
     A            LSENH1    R               REFFLD(LÅENHE)
     A            LSKPNY      0009S 2
     A                                      EDTWRD('     0 ,  ')
     A                                      COLHDG('Kost-pris')
     A                                      TEXT('Kost-pris')
     A            LSTEK1      0035A
     A                                      COLHDG('Kommentarer')
     A                                      TEXT('Kommentarer')
6.NU A            LSREFR      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Nummer')
     A                                      TEXT('Nummer')
     A                                      COMP(NE 0)
     A                                      CHKMSGID(LM00011 *LIBL/QMFLAGR)
     A            LSXRKO      0002A
     A                                      COLHDG('Årsakskode')
     A                                      TEXT('Årsakskode')
6.10 A            LSODAT    R               REFFLD(LÅODAT)
6.10 A            LSOTIM    R               REFFLD(LÅOTIM)
6.10 A            LSOUSR    R               REFFLD(LÅOUSR)
6.10 A            LSEDAT    R               REFFLD(LÅEDAT)
6.10 A            LSETIM    R               REFFLD(LÅETIM)
6.10 A            LSEUSR    R               REFFLD(LÅEUSR)
      *
      *  Bestilling-tekst-register          (LT)
      *
     A            LTFIRM    R               REFFLD(LÅFIRM)
     A            LTNUMM    R               REFFLD(LÅNUMM)
     A            LTSUFF    R               REFFLD(LÅSUFF)
     A                                      COLHDG('Siste suffix')
     A                                      TEXT('Siste suffix')
     A            LTLINE    R               REFFLD(LÅLINE)
     A            LTTYPE      0002A
     A                                      COLHDG('Tekst-type')
     A                                      TEXT('Tekst-type')
     A            LTTEXT      0070A
     A                                      COLHDG('Tekst')
     A                                      TEXT('Tekst')
6.10 A            LTODAT    R               REFFLD(LÅODAT)
6.10 A            LTOTIM    R               REFFLD(LÅOTIM)
6.10 A            LTOUSR    R               REFFLD(LÅOUSR)
6.10 A            LTEDAT    R               REFFLD(LÅEDAT)
6.10 A            LTETIM    R               REFFLD(LÅETIM)
6.10 A            LTEUSR    R               REFFLD(LÅEUSR)
      *
      *  Lagertelling-bunt-hode-register    (LU)
      *
     A            LUFIRM    R               REFFLD(LÅFIRM)
     A            LUBATC    R               REFFLD(LÅBATC)
     A            LUNUMM      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bunt-nummer')
     A                                      TEXT('Bunt-nummer')
     A            LUTNUM      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Liste-nummer')
     A                                      TEXT('Liste-nummer')
     A            LULAGE    R               REFFLD(LÅLAGE)
     A            LUTYPE      0010A
     A                                      COLHDG('Type registrering')
     A                                      TEXT('Type registrering')
     A            LUTEXT      0030A
     A                                      COLHDG('Tekst')
     A                                      TEXT('Tekst')
     A            LUOPER      0030A
     A                                      COLHDG('Operatør')
     A                                      TEXT('Operatør')
     A            LUDATO          L
     A                                      COLHDG('Opprettet dato')
     A                                      TEXT('Opprettet dato')
     A            LUTIME          T
     A                                      COLHDG('Opprettet kl.')
     A                                      TEXT('Opprettet kl.')
     A            LUSDAT          L
     A                                      COLHDG('Skrevet dato')
     A                                      TEXT('Skrevet dato')
     A            LUODAT          L
     A                                      COLHDG('Overført dato')
     A                                      TEXT('Overført dato')
     A            LUWSID      0010A
     A                                      COLHDG('Arbeidstasjon')
     A                                      TEXT('Arbeidstasjon')
     A            LUUSER    R               REFFLD(LÅUSER)
     A            LUSKOD      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Skrevet, kode')
     A                                      TEXT('Skrevet, kode')
     A            LUKODE      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Behandling pågår')
     A                                      TEXT('Behandling pågår')
6.10 A            LUEDAT    R               REFFLD(LÅEDAT)
6.10 A            LUETIM    R               REFFLD(LÅETIM)
6.10 A            LUEUSR    R               REFFLD(LÅEUSR)
      *
      *  Lagertelling-bunt-linje-register   (LV)
      *
     A            LVFIRM    R               REFFLD(LÅFIRM)
     A            LVBATC    R               REFFLD(LÅBATC)
     A            LVNUMM      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bunt-nummer')
     A                                      TEXT('Bunt-nummer')
     A            LVLINE      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Linjenummer')
     A                                      TEXT('Linjenummer')
     A            LVTLIN      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Liste-linjenr')
     A                                      TEXT('Liste-linjenr')
     A            LVDLOP      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Løpenr-diversevarer')
     A                                      TEXT('Løpenr-diversevarer')
     A            LVOGRP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Overgruppe')
     A                                      TEXT('Overgruppe')
     A            LVHGRP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedgruppe')
     A                                      TEXT('Hovedgruppe')
     A            LVUGRP      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Undergruppe')
     A                                      TEXT('Undergruppe')
     A            LVVARE    R               REFFLD(LÅVARE)
     A            LVLAGE    R               REFFLD(LÅLAGE)
     A            LVPLAS    R               REFFLD(LÅPLAS)
     A            LVTEK1    R               REFFLD(LÅTEK1)
     A            LVENH1    R               REFFLD(LÅENHE)
     A            LVANTT      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall, tellet')
     A                                      TEXT('Antall, tellet')
     A                                      COMP(LT 99999999)
     A                                      CHKMSGID(LRD0090 *LIBL/QMFLAGR)
     A            LVSPNY      0009S 2
     A                                      EDTWRD('     0 ,  ')
     A                                      COLHDG('Salgspris')
     A                                      TEXT('Salgspris')
     A            LVKPNY      0009S 2
     A                                      EDTWRD('     0 ,  ')
     A                                      COLHDG('Kostpris')
     A                                      TEXT('Kostpris')
6.22 A            LVTIMS          Z         TEXT('Timestamp')
6.22 A                                      COLHDG('Timestamp')
6.2B A                                      DFT('0001-01-01-00.00.00.000000')
6.10 A            LVODAT    R               REFFLD(LÅODAT)
6.10 A            LVOTIM    R               REFFLD(LÅOTIM)
6.10 A            LVOUSR    R               REFFLD(LÅOUSR)
6.10 A            LVEDAT    R               REFFLD(LÅEDAT)
6.10 A            LVETIM    R               REFFLD(LÅETIM)
6.10 A            LVEUSR    R               REFFLD(LÅEUSR)
      *
      *  Lager-utskrift-hjelpe-register     (LW)
      *
     A            LWFIRM    R               REFFLD(LÅFIRM)
     A            LWLAGE    R               REFFLD(LÅLAGE)
     A            LWVARE    R               REFFLD(LÅVARE)
     A            LWNUMM      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Løpenummer')
     A                                      TEXT('Løpenummer')
     A            LWLAGR    R               REFFLD(LÅLAGE)
     A            LWOGRP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Overgruppe')
     A                                      TEXT('Overgruppe')
     A            LWHGRP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedgruppe')
     A                                      TEXT('Hovedgruppe')
     A            LWUGRP      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Undergruppe')
     A                                      TEXT('Undergruppe')
     A            LWSSUM      0015S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Sorteringsum')
     A                                      TEXT('Sorteringsum')
     A            LWSPNY      0009S 2
     A                                      EDTWRD('     0 ,  ')
     A                                      COLHDG('Salgspris')
     A                                      TEXT('Salgspris')
     A            LWKPNY      0009S 2
     A                                      EDTWRD('     0 ,  ')
     A                                      COLHDG('Kostpris')
     A                                      TEXT('Kostpris')
     A            LWENH1    R               REFFLD(LÅENHE)
     A            LWANTT      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall, tellet')
     A                                      TEXT('Antall, tellet')
     A            LWANTL      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall, i lager')
     A                                      TEXT('Antall, i lager')
     A            LWTEK1    R               REFFLD(LÅTEK1)
6.22 A            LWTIMS          Z         TEXT('Timestamp')
6.22 A                                      COLHDG('Timestamp')
6.2B A                                      DFT('0001-01-01-00.00.00.000000')
      *
      *  Bestilling-slettet-register        (LY)
      *
     A            LYFIRM    R               REFFLD(LÅFIRM)
     A            LYAARR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('År')
     A                                      TEXT('År')
     A            LYNUMM    R               REFFLD(LÅNUMM)
     A            LYSUFF    R               REFFLD(LÅSUFF)
     A                                      COLHDG('Siste suffix')
     A                                      TEXT('Siste suffix')
     A            LYOTYP    R               REFFLD(LÅOTYP)
     A            LYBDAT          L
     A                                      COLHDG('Best_dato')
     A                                      TEXT('Best_dato')
     A            LYINNK      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Innkjøper')
     A                                      TEXT('Innkjøper')
     A            LYVALK      0003A
     A                                      COLHDG('Valuta')
     A                                      TEXT('Valuta')
     A            LYMKOD      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Mva-kode')
     A                                      TEXT('Mva-kode')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            LYLELE      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Vare-adresse')
     A                                      TEXT('Vare-adresse')
     A            LYLDOR    R               REFFLD(LÅLDOR)
     A            LYLENA      0030A
     A                                      COLHDG('Leverandør-navn')
     A                                      TEXT('Leverandør-navn')
     A            LYNAVN      0030A
     A                                      COLHDG('Navn')
     A                                      TEXT('Navn')
     A            LYADR1      0030A
     A                                      COLHDG('Adresse 1')
     A                                      TEXT('Adresse 1')
     A            LYADR2      0030A
     A                                      COLHDG('Adresse 2')
     A                                      TEXT('Adresse 2')
     A            LYSTED      0030A
     A                                      COLHDG('Poststed')
     A                                      TEXT('Poststed')
6.12 A            LYVREF      0030A
     A                                      COLHDG('Vår ref.')
     A                                      TEXT('Vår ref.')
6.12 A            LYDREF      0030A
     A                                      COLHDG('Deres ref.')
     A                                      TEXT('Deres ref.')
     A            LYREKV      0020A
     A                                      COLHDG('Kund.rekv.nr.')
     A                                      TEXT('Kund.rekv.nr.')
     A            LYTOTI      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Total kjøp')
     A                                      TEXT('Total kjøp')
     A            LYTOTR      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Total rabatt')
     A                                      TEXT('Total rabatt')
     A            LYTOTK      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Total kost')
     A                                      TEXT('Total kost')
6.NU A            LYORNR      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ordrenummer')
     A                                      TEXT('Ordrenummer')
     A            LYORSU      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Suffix-ordre')
     A                                      TEXT('Suffix-ordre')
     A            LYWSID      0010A
     A                                      COLHDG('Arbeidstasjon')
     A                                      TEXT('Arbeidstasjon')
     A            LYUSER    R               REFFLD(LÅUSER)
     A            LYDATE          L
     A                                      COLHDG('Dato opprettet')
     A                                      TEXT('Dato opprettet')
     A            LYTIME          T
     A                                      COLHDG('Klokkeslett')
     A                                      TEXT('Klokkeslett')
     A            LYTYPE      0004A
     A                                      COLHDG('Type sletting')
     A                                      TEXT('Type sletting')
     A            LYPRTK      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kode, Utskrift')
     A                                      TEXT('Kode, Utskrift')
     A            LYKOM1      0030A
     A                                      COLHDG('Kommentar 1')
     A                                      TEXT('Kommentar 1')
     A            LYKOM2      0030A
     A                                      COLHDG('Kommentar 2')
     A                                      TEXT('Kommentar 2')
6.10 A            LYEDAT    R               REFFLD(LÅEDAT)
6.10 A            LYETIM    R               REFFLD(LÅETIM)
6.10 A            LYEUSR    R               REFFLD(LÅEUSR)
7.01  *
7.01  *  Bestilling-linje-slettet-register  (LR)
7.01  *
7.01 A            LRFIRM    R               REFFLD(LÅFIRM)
7.01 A            LRNUMM    R               REFFLD(LÅNUMM)
7.01 A            LRSUFF    R               REFFLD(LÅSUFF)
7.01 A            LRLINE    R               REFFLD(LÅLINE)
7.01 A            LROTYP    R               REFFLD(LÅOTYP)
7.01 A            LRLTYP    R               REFFLD(LÅLTYP)
7.01 A            LRLETY    R               REFFLD(LÅLETY)
7.01 A            LRVARE    R               REFFLD(LÅVARE)
7.01 A            LRENH1    R               REFFLD(LÅENHE)
7.01 A            LRLAGE    R               REFFLD(LÅLAGE)
7.01 A            LRLDOR    R               REFFLD(LÅLDOR)
7.01 A            LRLDAT          L
7.01 A                                      COLHDG('Leveringsdato')
7.01 A                                      TEXT('Leveringsdato')
7.01 A            LRAVDE    R               REFFLD(LÅAVDE)
7.01 A            LRKONT    R               REFFLD(LÅKONT)
7.01 A            LRSPES    R               REFFLD(LÅSPES)
7.01 A            LRPROJ    R               REFFLD(LÅPROJ)
7.01 A            LRAKTI    R               REFFLD(LÅAKTI)
7.01 A            LRORNU      0008S 0
7.01 A                                      EDTCDE(Z)
7.01 A                                      COLHDG('Ordrenummer')
7.01 A                                      TEXT('Ordrenummer')
7.01 A            LRORSU    R               REFFLD(LÅSUFF)
7.01 A            LRORLI    R               REFFLD(LÅLINE)
7.01 A            LRLVAR    R               REFFLD(LÅLVAR)
7.01 A            LRNOBB    R               REFFLD(LÅNOBB)
7.01 A            LREANN    R               REFFLD(LÅEANN)
7.01 A            LRTEK1    R               REFFLD(LÅTEK1)
7.01 A            LRTEK2    R               REFFLD(LÅTEK2)
7.01 A            LRANTA      0011S 3
7.01 A                                      EDTCDE(M)
7.01 A                                      COLHDG('Antall')
7.01 A                                      TEXT('Antall')
7.01 A                                      COMP(LT 99999999)
7.01 A                                      CHKMSGID(LRD0090 *LIBL/QMFLAGR)
7.01 A            LRIPNY      0009S 2
7.01 A                                      EDTWRD('     0 ,  ')
7.01 A                                      COLHDG('Innkjøpspris')
7.01 A                                      TEXT('Innkjøpspris')
7.01 A            LRKPNY      0009S 2
7.01 A                                      EDTWRD('     0 ,  ')
7.01 A                                      COLHDG('Kost-pris')
7.01 A                                      TEXT('Kost-pris')
7.01 A            LRRAB1      0005S 2
7.01 A                                      EDTCDE(Z)
7.01 A                                      COLHDG('Linje-rabatt 1')
7.01 A                                      TEXT('Linje-rabatt 1')
7.01 A                                      COMP(LE 100)
7.01 A                                      CHKMSGID(LRD0100 *LIBL/QMFLAGR)
7.01 A            LRRAB2      0005S 2
7.01 A                                      EDTCDE(Z)
7.01 A                                      COLHDG('Linje-rabatt 2')
7.01 A                                      TEXT('Linje-rabatt 2')
7.01 A                                      COMP(LE 100)
7.01 A                                      CHKMSGID(LRD0100 *LIBL/QMFLAGR)
7.01 A            LRSUMI      0011S 2
7.01 A                                      EDTCDE(M)
7.01 A                                      COLHDG('Sum kjøp')
7.01 A                                      TEXT('Sum kjøp')
7.01 A            LRSUMR      0011S 2
7.01 A                                      EDTCDE(M)
7.01 A                                      COLHDG('Sum rabatt')
7.01 A                                      TEXT('Sum rabatt')
7.01 A            LRSUMK      0011S 2
7.01 A                                      EDTCDE(M)
7.01 A                                      COLHDG('Sum kost')
7.01 A                                      TEXT('Sum kost')
7.01 A            LROMVA         1A         TEXT('Økonomi MVA-kode')
7.01 A                                      COLHDG('OKON' 'MVA')
7.01  *
7.01 A            LRLVRE      0001S 0
7.01 A                                      EDTCDE(Z)
7.01 A                                      COLHDG('Lokalt vreg')
7.01 A                                      TEXT('Lokalt vreg')
7.01 A                                      VALUES(0 1)
7.01 A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
7.01 A            LRVARI       140A         TEXT('Varians')
7.01 A                                      COLHDG('Varians')
7.01 A            LROGRP    R               REFFLD(LÅOGRP)
7.01 A            LRHGRP    R               REFFLD(LÅHGRP)
7.01 A            LRUGRP    R               REFFLD(LÅUGRP)
7.01 A            LRKPLJ      0001S 0
7.01 A                                      EDTCDE(Z)
7.01 A                                      COLHDG('Kostpr.just linje')
7.01 A                                      TEXT('Kostpr.just linje')
7.01 A            LRSLDA          L         TEXT('Slettet dato')
7.01 A                                      COLHDG('Slet.dat')
7.01  *
7.01 A            LRSLTI          T         TEXT('Slettet tid')
7.01 A                                      COLHDG('Slet.tid')
7.01 A            LRSPGM        10          TEXT('Slette program')
7.01 A                                      COLHDG('Slettet-Pgm')
7.01 A            LRSLWS        10          TEXT('Slette WS')
7.01 A                                      COLHDG('Slettet-WS')
7.01 A            LRSLUS        10          TEXT('Slette bruker')
7.01 A                                      COLHDG('Slettet-User')
7.01 A            LRODAT    R               REFFLD(LÅODAT)
7.01 A            LROTIM    R               REFFLD(LÅOTIM)
7.01 A            LROUSR    R               REFFLD(LÅOUSR)
7.01 A            LREDAT    R               REFFLD(LÅEDAT)
7.01 A            LRETIM    R               REFFLD(LÅETIM)
7.01 A            LREUSR    R               REFFLD(LÅEUSR)
      *
      *  Lager-telling-hjelpe-register      (LZ)
      *
     A            LZFIRM    R               REFFLD(LÅFIRM)
     A            LZVARE    R               REFFLD(LÅVARE)
     A            LZLAGE    R               REFFLD(LÅLAGE)
     A            LZOGRP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Overgruppe')
     A                                      TEXT('Overgruppe')
     A            LZHGRP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedgruppe')
     A                                      TEXT('Hovedgruppe')
     A            LZUGRP      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Undergruppe')
     A                                      TEXT('Undergruppe')
     A            LZPLAS    R               REFFLD(LÅPLAS)
     A            LZSORT      0060A
     A                                      COLHDG('Sorteringbegrep')
     A                                      TEXT('Sorteringbegrep')
     A            LZTEK1    R               REFFLD(LÅTEK1)
     A            LZENH1    R               REFFLD(LÅENHE)
     A            LZANTL      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall i lager')
     A                                      TEXT('Antall i lager')
      *
      * Håndterminal ordre-linje            (HD)
      *
     A            HDFIRM    R               REFFLD(LÅFIRM)
     A            HDREFN         8S 0       TEXT('Refnr')
     A                                      COLHDG('Refnr')
     A                                      EDTCDE(Z)
     A            HDVARE         8S 0       TEXT('Varenr')
     A                                      COLHDG('Varenr')
     A            HDENHE    R               REFFLD(LÅENHE)
     A            HDANTA    R               REFFLD(LÅANTA)
     A            HDDATO          L         TEXT('Dato')
     A                                      COLHDG('Dato')
     A            HDTIME          T         TEXT('Tidspunkt')
     A                                      COLHDG('Tidspunkt')
      *
      * Håndterminal ordre-hode             (HO)
      *
     A            HOFIRM    R               REFFLD(LÅFIRM)
6.NU A            HOREFN         8S 0       TEXT('Refnr')
     A                                      COLHDG('Refnr')
     A                                      EDTCDE(Z)
     A            HOAVDE    R               REFFLD(LÅAVDE)
     A            HOLAGE    R               REFFLD(LÅLAGE)
     A            HOKUND    R               REFFLD(LÅKUND)
     A            HOKPRO    R               REFFLD(LÅKPRO)
     A            HOSELG    R               REFFLD(LÅSELG)
     A**          HOMERK        10          TEXT('Merknad')
     A**                                    COLHDG('Merknad')
     A            HONAVN        30          TEXT('Lev.adr./navn')
     A                                      COLHDG('Lev.adr./navn')
     A            HODREF        20          TEXT('Kundens ref.')
     A                                      COLHDG('Kundens ref.')
     A            HOREKV        20          TEXT('Rekv.nummer')
     A                                      COLHDG('Rekv.nummer')
     A            HODATO          L         TEXT('Dato')
     A                                      COLHDG('Dato')
     A            HOTIME          T         TEXT('Tidspunkt')
     A                                      COLHDG('Tidspunkt')
     A            HOSTAT         1S 0       TEXT('Status')
     A                                      COLHDG('Sts')
     A                                      EDTCDE(Z)
      *
      * Radioterminal trans-register        (HR)
      *
     A            HRFIRM    R               REFFLD(LÅFIRM)
     A            HRKODE         1A         TEXT('Kode')
     A                                      COLHDG('Kode')
      *                                     E=Ekspedisjon
      *                                     B=Bestillingsforlag
     A            HRTIMS          Z         TEXT('Timestamp')
     A                                      COLHDG('Timestamp')
     A            HRVARE         8S 0       TEXT('Varenr')
     A                                      COLHDG('Varenr')
     A            HRENHE    R               REFFLD(LÅENHE)
     A            HRANTA    R               REFFLD(LÅANTA)
     A            HRSAIM         9S 2       TEXT('Salgspris inkl.mva')
     A                                      COLHDG('Salgspris' 'inkl.mva')
     A                                      EDTCDE(M)
     A            HREANN    R               REFFLD(LÅEANN)
     A            HREKOD         1S 0       TEXT('Etikettkode')
                                            COLHDG('Etikettkode')
     A            HRSTAT         1A         TEXT('Statuskode')
                                            COLHDG('Statuskode')
     A            HRDATO          L         TEXT('Dato')
     A                                      COLHDG('Dato')
     A            HRTIME          T         TEXT('Tidspunkt')
     A                                      COLHDG('Tidspunkt')
      *
      * Håndterminal vareregister           (HV)
      *
     A            HVINFO       150A
     A                                      COLHDG('Varelinje')
     A                                      TEXT('Varelinje')
      *
      * Håndterminal ean-register           (HE)
      *
     A            HEINFO       150A
     A                                      COLHDG('Ean-nummer')
     A                                      TEXT('Ean-nummer')
      *
      * Håndterminal lev.varenummer         (HL)
      *
     A            HLINFO       150A
     A                                      COLHDG('Lev.varenr')
     A                                      TEXT('Lev.varenr')
      *
      * Håndterminal kunderegister          (HK)
      *
     A            HKINFO       150A
     A                                      COLHDG('Kundelinje')
     A                                      TEXT('Kundelinje')
      *
      * Håndterminal bestillingstranser     (HB)
      *
     A            HBINFO       150A
     A                                      COLHDG('Bestillingslinje')
     A                                      TEXT('Bestillingslinje')
      *
      * Håndterminal telletranser           (HT)
      *
     A            HTINFO       150A
     A                                      COLHDG('Tellelinje')
     A                                      TEXT('Tellelinje')
      *
      * Håndterminal ordretranser           (HO)
      *
     A            HOINFO       150A
     A                                      COLHDG('Ordrelinje')
     A                                      TEXT('Ordrelinje')
      *
      *  Inng_faktura-linje-register        (SL)
      *
     A            SLFIRM    R               REFFLD(LÅFIRM)
     A            SLAARR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('År')
     A                                      TEXT('År')
6.NU A            SLBINR      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Fakturanummer')
     A                                      TEXT('Fakturanummer')
     A            SLNUMM    R               REFFLD(LÅNUMM)
     A            SLSUFF    R               REFFLD(LÅSUFF)
     A            SLKTXT      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Tekstkode')
     A                                      TEXT('Tekstkode')
     A            SLLINE    R               REFFLD(LÅLINE)
     A            SLEXTR      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Generert ekstralinje')
     A                                      TEXT('Generert ekstralinje')
     A            SLKVIS      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Vise alle opplysn')
     A                                      TEXT('Vise alle opplysn')
     A            SLOTYP    R               REFFLD(LÅOTYP)
     A            SLLTYP    R               REFFLD(LÅLTYP)
     A            SLVARE    R               REFFLD(LÅVARE)
     A            SLNOBB    R               REFFLD(LÅNOBB)
6.14 A            SLEANN    R               REFFLD(LÅEANN)
     A            SLENH1    R               REFFLD(LÅENHE)
     A            SLLAGE    R               REFFLD(LÅLAGE)
     A            SLAVDE    R               REFFLD(LÅAVDE)
     A            SLKONT    R               REFFLD(LÅKONT)
     A            SLSPES    R               REFFLD(LÅSPES)
     A            SLPROJ    R               REFFLD(LÅPROJ)
7.nx A            SLUPRO    R               REFFLD(LÅUPRO)
     A            SLAKTI    R               REFFLD(LÅAKTI)
     A            SLTEK1    R               REFFLD(LÅTEK1)
     A            SLTEK2    R               REFFLD(LÅTEK2)
     A            SLTEK3    R               REFFLD(LÅTEK3)
     A            SLANTA      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall bestilt')
     A                                      TEXT('Antall bestilt')
     A            SLIPNY      0009S 2
     A                                      EDTCDE(Z)
     A                                      COLHDG('Innkjøpspris')
     A                                      TEXT('Innkjøpspris')
     A            SLKPNY      0009S 2
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kost-pris')
     A                                      TEXT('Kost-pris')
     A            SLRAB1      0005S 2
     A                                      EDTCDE(Z)
     A                                      COLHDG('Linje-rabatt 1')
     A                                      TEXT('Linje-rabatt 1')
     A            SLRAB2      0005S 2
     A                                      EDTCDE(Z)
     A                                      COLHDG('Linje-rabatt 2')
     A                                      TEXT('Linje-rabatt 2')
     A            SLKJOP      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Sum kjøp')
     A                                      TEXT('Sum kjøp')
     A            SLRKR1      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Rabatt 1')
     A                                      TEXT('Rabatt 1')
     A            SLRKR2      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Rabatt 2')
     A                                      TEXT('Rabatt 2')
     A            SLRKRO      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Ordrerab.')
     A                                      TEXT('Ordrerab.')
     A            SLKOST      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Sum kost')
     A                                      TEXT('Sum kost')
      *
     A            SLKMVA      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Mva-kode')
     A                                      TEXT('Mva-kode')
      *
6.32 A            SLOMVA         1A         TEXT('Økonomi MVA-kode')
6.32 A                                      COLHDG('OKON' 'MVA')
      *
6.32 A            SLMPRO      0004S 2
6.32 A                                      EDTCDE(K)
6.32 A                                      COLHDG('Merverdiavgift')
      *
     A            SLLVRE      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lokalt vreg')
     A                                      TEXT('Lokalt vreg')
     A            SLOGRP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Overgruppe')
     A                                      TEXT('Overgruppe')
     A            SLHGRP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedgruppe')
     A                                      TEXT('Hovedgruppe')
     A            SLUGRP      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Undergruppe')
     A                                      TEXT('Undergruppe')
6.NU A            SLORNR      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ordrenummer')
     A                                      TEXT('Ordrenummer')
     A            SLORSU      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ordresuffix')
     A                                      TEXT('Ordresuffix')
     A            SLORLI      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ordrelinje')
     A                                      TEXT('Ordrelinje')
6.10 A            SLODAT    R               REFFLD(LÅODAT)
6.10 A            SLOTIM    R               REFFLD(LÅOTIM)
6.10 A            SLOUSR    R               REFFLD(LÅOUSR)
6.10 A            SLEDAT    R               REFFLD(LÅEDAT)
6.10 A            SLETIM    R               REFFLD(LÅETIM)
6.10 A            SLEUSR    R               REFFLD(LÅEUSR)
      *
      *  Inng_faktura-hode-register         (SH)
      *
     A            SHFIRM    R               REFFLD(LÅFIRM)
     A            SHAARR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('År')
     A                                      TEXT('År')
6.NU A            SHBINR      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Fakturanummer')
     A                                      TEXT('Fakturanummer')
     A            SHNUMM    R               REFFLD(LÅNUMM)
     A            SHSUFF    R               REFFLD(LÅSUFF)
     A            SHBATC      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Batchnummer')
     A                                      TEXT('Batchnummer')
     A            SHOTYP    R               REFFLD(LÅOTYP)
     A            SHLAGE    R               REFFLD(LÅLAGE)
     A            SHKREF      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kreditt-ref.')
     A                                      TEXT('Kreditt-ref.')
     A            SHBDAT          L
     A                                      COLHDG('Best_dato')
     A                                      TEXT('Best_dato')
     A            SHLDAT          L
     A                                      COLHDG('Leveringsdato')
     A                                      TEXT('Leveringsdato')
     A            SHFKDA          L
     A                                      COLHDG('Fakturadato')
     A                                      TEXT('Fakturadato')
     A            SHFFDA          L
     A                                      COLHDG('Forfallsdato')
     A                                      TEXT('Forfallsdato')
     A            SHMODA          L
     A                                      COLHDG('Mottatt OBEK dato')
     A                                      TEXT('Mottatt OBEK dato')
6.30 A            SHVIDA          L
6.30 A                                      DFT('0001-01-01')
6.30 A                                      COLHDG('Virk. lev.dato')
6.30 A                                      TEXT('Virkelig lev.dato')
     A            SHBETB      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bet.betingelser')
     A                                      TEXT('Bet.betingelser')
     A            SHINNK      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Innkjøper')
     A                                      TEXT('Innkjøper')
     A            SHDIST      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Distrikt')
     A                                      TEXT('Distrikt')
     A            SHLMAT      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Leveringsmåte')
     A                                      TEXT('Leveringsmåte')
     A            SHLBET      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Leveringsbet.')
     A                                      TEXT('Leveringsbet.')
     A            SHVALK      0003A
     A                                      COLHDG('Valuta')
     A                                      TEXT('Valuta')
     A            SHRKAT      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabatt-kategori')
     A                                      TEXT('Rabatt-kategori')
     A            SHSPED      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Speditør')
     A                                      TEXT('Speditør')
     A            SHKJOR      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kjørerute')
     A                                      TEXT('Kjørerute')
     A            SHMKOD      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Mva-kode')
     A                                      TEXT('Mva-kode')
     A            SHLELE      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Vare-adresse')
     A                                      TEXT('Vare-adresse')
     A            SHLDOR    R               REFFLD(LÅLDOR)
     A            SHLENA      0030A
     A                                      COLHDG('Leverandør-alfa')
     A                                      TEXT('Leverandør-alfa')
     A            SHNAVN      0030A
     A                                      COLHDG('Navn')
     A                                      TEXT('Navn')
     A            SHADR1      0030A
     A                                      COLHDG('Adresse 1')
     A                                      TEXT('Adresse 1')
     A            SHADR2      0030A
     A                                      COLHDG('Adresse 2')
     A                                      TEXT('Adresse 2')
     A            SHSTED      0030A
     A                                      COLHDG('Poststed')
     A                                      TEXT('Poststed')
     A            SHAVDE    R               REFFLD(LÅAVDE)
     A            SHKONT    R               REFFLD(LÅKONT)
     A            SHSPES    R               REFFLD(LÅSPES)
     A            SHPROJ    R               REFFLD(LÅPROJ)
7.nx A            SHUPRO    R               REFFLD(LÅUPRO)
     A            SHAKTI    R               REFFLD(LÅAKTI)
6.12 A            SHVREF      0030A
     A                                      COLHDG('Vår ref.')
     A                                      TEXT('Vår ref.')
6.12 A            SHDREF      0030A
     A                                      COLHDG('Deres ref.')
     A                                      TEXT('Deres ref.')
     A            SHREKV      0020A
     A                                      COLHDG('Kund.rekv.nr.')
     A                                      TEXT('Kund.rekv.nr.')
     A            SHLMTX      0020A
     A                                      COLHDG('Lev. måte tekst')
     A                                      TEXT('Lev. måte tekst')
     A            SHLBTX      0075A
     A                                      COLHDG('Lev. bet. tekst')
     A                                      TEXT('Lev. bet. tekst')
     A            SHRABP      0005S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Rabatt i %')
     A                                      TEXT('Rabatt i %')
     A            SHNETT      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Netto vekt')
     A                                      TEXT('Netto vekt')
     A            SHBRUT      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Brutto vekt')
     A                                      TEXT('Brutto vekt')
     A            SHKOLI      0011S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Kolli')
     A                                      TEXT('Kolli')
     A            SHKJOP      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Kjøp, pliktig')
     A                                      TEXT('Kjøp, pliktig')
     A            SHKJOF      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Kjøp, fritt')
     A                                      TEXT('Kjøp, fritt')
     A            SHRK1P      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Rab.1 plikt')
     A                                      TEXT('Rab.1 plikt')
     A            SHRK1F      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Rab.1 fritt')
     A                                      TEXT('Rab.1 fritt')
     A            SHRK2P      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Rab.2 plikt')
     A                                      TEXT('Rab.2 plikt')
     A            SHRK2F      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Rab.2 fritt')
     A                                      TEXT('Rab.2 fritt')
     A            SHRBGP      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Rabgr plikt')
     A                                      TEXT('Rabgr plikt')
     A            SHRBGF      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Rabgr fritt')
     A                                      TEXT('Rabgr fritt')
     A            SHRKOP      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Orab plikt')
     A                                      TEXT('Orab plikt')
     A            SHRKOF      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Orab fritt')
     A                                      TEXT('Orab fritt')
     A            SHKSTP      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Kostp plikt')
     A                                      TEXT('Kostp plikt')
     A            SHKSTF      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Kostp fritt')
     A                                      TEXT('Kostp fritt')
     A            SHTOTF      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Bruttosum,faktura')
     A                                      TEXT('Bruttosum,faktura')
6.32 A            SHMVGP        11S 2
6.32 A                                      EDTCDE(M)
6.32 A                                      COLHDG('Mva.grunnlag')
6.32 A                                      TEXT('Mva.grunnlag')
     A            SHFSUM      0011S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Fakturasum')
     A                                      TEXT('Fakturasum')
6.NU A            SHORNR      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ordrenummer')
     A                                      TEXT('Ordrenummer')
     A            SHORSU      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ordresuffix')
     A                                      TEXT('Ordresuffix')
     A            SHFLEV      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Fakturaleverandør')
     A                                      TEXT('Fakturaleverandør')
     A            SHLONR      0015A
     A                                      COLHDG('Selgers Ordrenr')
     A                                      TEXT('Selgers ordrenr')
     A            SHLFNR      0015A
     A                                      COLHDG('Selgers faknr')
     A                                      TEXT('Selgers faknr')
8.01 A            SHMNUM         8S 0
6.29 A                                      TEXT('EDI Meldingsnummer')
6.29 A                                      COLHDG('EDI meldnr.')
     A            SHWSID      0010A
     A                                      COLHDG('Arbeidstasjon')
     A                                      TEXT('Arbeidstasjon')
     A            SHUSER    R               REFFLD(LÅUSER)
     A            SHDATE          L
     A                                      COLHDG('Dato opprettet')
     A                                      TEXT('Dato opprettet')
     A            SHTIME          T
     A                                      COLHDG('Klokkeslett')
     A                                      TEXT('Klokkeslett')
6.10 A            SHEDAT    R               REFFLD(LÅEDAT)
6.10 A            SHETIM    R               REFFLD(LÅETIM)
6.10 A            SHEUSR    R               REFFLD(LÅEUSR)
      *
      * ----
      *
      * Arbeidsregister Lager                      (ML)
      *
     A            MLFIRM    R               REFFLD(LÅFIRM)
      *
     A            MLVARE      0008  0       TEXT('Varenummer')
     A                                      COLHDG('Varenummer')
      *
     A            MLLAGE      0002S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
      *
     A            MLPLAS         8A         TEXT('Lagerplass')
     A                                      COLHDG('Lagerpl.')
      *
     A            MLENHL         3A         TEXT('Lagerenhet')
     A                                      COLHDG('Lager' 'enhet')
      *
     A            MLPAKK        11S 3       TEXT('I Pakkseddel HIÅ')
     A                                      COLHDG('I Pakks. HIÅ')
     A                                      EDTCDE(M)
      *
     A            MLOORD        11S 3       TEXT('I Ordre      HIÅ')
     A                                      COLHDG('I Ordre  HIÅ')
     A                                      EDTCDE(M)
      *
     A            MLORES        11S 3       TEXT('I Ordre rest HIÅ')
     A                                      COLHDG('I rest   HIÅ')
     A                                      EDTCDE(M)
      *
     A            MLBBES        11S 3       TEXT('I Bestilling HIÅ')
     A                                      COLHDG('I Best.  HIÅ')
     A                                      EDTCDE(M)
      *
     A            MLBRES        11S 3       TEXT('I Bestilling res')
     A                                      COLHDG('I Best.  res')
     A                                      EDTCDE(M)
      *
     A            MLINNG        11S 3       TEXT('Inngang      HIÅ')
     A                                      COLHDG('Inngang  HIÅ')
     A                                      EDTCDE(M)
      *
     A            MLUTTA        11S 3       TEXT('Uttak        HIÅ')
     A                                      COLHDG('Uttak    HIÅ')
     A                                      EDTCDE(M)
      *
     A            MLJUST        11S 3       TEXT('Justering    HIÅ')
     A                                      COLHDG('Just.    HIÅ')
     A                                      EDTCDE(M)
      *
     A            MLTELL        11S 3       TEXT('Telle avvik  HIÅ')
     A                                      COLHDG('Telleavv.HIÅ')
     A                                      EDTCDE(M)
      *
     A            MLSALG        11S 3       TEXT('Salg         HIÅ')
     A                                      COLHDG('Salg     HIÅ')
     A                                      EDTCDE(M)
      *
     A            MLRETU        11S 3       TEXT('Retur        HIÅ')
     A                                      COLHDG('Retur    HIÅ')
     A                                      EDTCDE(M)
      *
     A            MLB101        11S 3       TEXT('Antall, pr. 1/1')
     A                                      COLHDG('Antall' 'pr. 1/1')
     A                                      EDTCDE(M)
      *
     A            MLBEHL        11S 3       TEXT('Beholdning   HIÅ')
     A                                      COLHDG('Beholdn. HIÅ')
     A                                      EDTCDE(M)
      *
     A            MLBEVE        11S 3       TEXT('Bevegelse ant.IÅ')
     A                                      COLHDG('Bev.  ant.IÅ')
     A                                      EDTCDE(M)
      *
     A            MLKPNY         9S 2       TEXT('Bergn. kostpris')
     A                                      COLHDG('Bergn.' 'kostpris')
     A                                      EDTCDE(M)
      *
     A            MLMINI        11S 3       TEXT('Minimumsbeh.')
     A                                      COLHDG('Min.' 'beholdn.')
     A                                      EDTCDE(M)
      *
     A            MLMAKS        11S 3       TEXT('Maksimumsbeh.')
     A                                      COLHDG('Maks.' 'beholdn.')
     A                                      EDTCDE(M)
      *
     A            MLLTID         3S 0       TEXT('Leveringstid')
     A                                      COLHDG('Lev.' 'tid')
     A                                      EDTCDE(Z)
      *
     A            MLBPUN        11S 3       TEXT('Bestillingspunkt')
     A                                      COLHDG('Best.' 'punkt')
     A                                      EDTCDE(M)
      *
     A            MLBMEN        11S 3       TEXT('Best. mengde')
     A                                      COLHDG('Best.' 'mengde'    )
     A                                      EDTCDE(M)
      *
     A            MLSIKL        11S 3       TEXT('Sikkerhetslager')
     A                                      COLHDG('Sikkerhets' 'lager')
     A                                      EDTCDE(M)
      *
     A            MLTRDA          L         TEXT('Siste trans.dato')
     A                                      COLHDG('Siste' 'trans.dato')
      *
     A            MLOPDA          L         TEXT('Siste oppt.dato')
     A                                      COLHDG('Siste' 'oppt.dato')
      *
     A            MLSDAT          L         TEXT('Siste salgsdato')
     A                                      COLHDG('Siste' 'salgsdato')
     A            MLSPRI         9S 2
     A                                      COLHDG('Salgspris')
     A            MLKPRI         9S 2
     A                                      COLHDG('Kostpris')
     A            MLIPRI         9S 2
     A                                      COLHDG('Innkjøpspri')
     A            MLOMST        13S 2
     A                                      COLHDG('Salg total')
     A            MLKOST        13S 2
     A                                      COLHDG('Kost total')
     A            MLINKT        13S 2
     A                                      COLHDG('Inkjøp total')
     A            MLDEKT        13S 2
     A                                      COLHDG('Dekningsbidrag')
     A            MLLAGV        13S 2
     A                                      COLHDG('Lagerverdi')
     A            MLOGRP         2S 0
     A                                      COLHDG('Overgruppe')
     A            MLHGRP         2S 0
     A                                      COLHDG('Hovedgruppe')
     A            MLUGRP         3S 0
     A                                      COLHDG('Undergruppe')
     A            MLKHEV         4
     A                                      COLHDG('Kontohenvisning')
      *
     A            MLAKEY        65A
     A                                      COLHDG('Nøkkelfelt')
      *
      * Arbeidsfil historisk-lagerbok         (MH)
      *
     A            MHFIRM    R               REFFLD(LÅFIRM)
      *
     A            MHVARE        15A
     A                                      COLHDG('Varenummer')
     A                                      TEXT('Varenummer')
     A            MHLAGE         2S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lagernummer')
     A                                      TEXT('Lagernummer')
     A            MHDATO          L
     A                                      COLHDG('Dato')
     A                                      TEXT('Dato')
     A            MHTIME          T
     A                                      COLHDG('Klokkeslett')
     A                                      TEXT('Klokkeslett')
     A            MHUSER    R               REFFLD(LÅEUSR)
     A                                      COLHDG('Bruker-id')
     A                                      TEXT('Bruker-id')
     A            MHSYST         1A
     A                                      COLHDG('System Lag/Fak/B')
     A                                      TEXT('System Lag/Fak/B')
     A                                      VALUES(' ' 'F' 'L' 'B')
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            MHKODE         2A
     A                                      COLHDG('Kode (Ordre-type')
     A                                      TEXT('Kode (Ordre-type')
     A                                      COMP(NE '  ')
     A                                      CHKMSGID(LM00011 *LIBL/QMFLAGR)
     A            MHTYPE         1A
     A                                      COLHDG('Type I=Inn/U=Ut')
     A                                      TEXT('Type I=Inn/U=Ut')
     A                                      VALUES('I' 'U')
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            MHREFR        10A
     A                                      COLHDG('Referanse-felt')
     A                                      TEXT('Referanse-felt')
     A            MHBEHL        11S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Beholdning-etter')
     A                                      TEXT('Beholdning-etter')
     A            MHANTA        11S 3
     A                                      EDTCDE(M)
     A                                      COLHDG('Antall')
     A                                      TEXT('Antall')
     A            MHENHL         3A         TEXT('Lagerenhet')
     A                                      COLHDG('Lager' 'enhet')
     A            MHKPRI         9S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Kostpris')
     A                                      TEXT('Kostpris')
      *
     A            MHAKEY        65A
      *
      * Arbeidsregister ABC-analyse
      *
     A            MWFIRM    R               REFFLD(LÅFIRM)
      *
     A            MWVARE         8  0
     A                                      COLHDG('Varenummer')
     A            MWOGRP         2S 0
     A                                      COLHDG('Overgruppe')
     A            MWHGRP         2S 0
     A                                      COLHDG('Hovedgruppe')
     A            MWUGRP         3S 0
     A                                      COLHDG('Undergruppe')
     A            MWENHL         3A
     A                                      COLHDG('Lagerenhet')
     A            MWOMST        13S 2
     A                                      COLHDG('Omsetning')
     A            MWLAGV        13S 2
     A                                      COLHDG('Lagerverdi')
      *
      * Arbeidsregister Overvåking
      *
     A            MWOFIR    R               REFFLD(LÅFIRM)
      *
     A            MWOTYP         2S 0
     A                                      COLHDG('Overvåkingstype')
     A            MWOSYS         1A
     A                                      COLHDG('System')
     A            MWOLIH         1A
     A                                      COLHDG('linje/Heading')
     A            MWOVNR    R               REFFLD(LÅVARE)
     A                                      COLHDG('Varenummer')
     A            MWOVTX    R               REFFLD(LÅTEK1)
     A                                      COLHDG('Varetekst')
     A            MWOOGR    R               REFFLD(LÅOGRP)
     A            MWOHGR    R               REFFLD(LÅHGRP)
     A            MWOUGR    R               REFFLD(LÅUGRP)
6.38 A            MWOONR    R               REFFLD(LÅNUMM)
     A                                      COLHDG('Ordrenr')
     A            MWOSUF    R               REFFLD(LÅSUFF)
     A            MWOLIN    R               REFFLD(LÅLINE)
6.38 A            MWOBNR    R               REFFLD(LÅNUMM)
     A                                      COLHDG('Bestillingsnr.')
     A            MWOLAG    R               REFFLD(LÅLAGE)
     A                                      COLHDG('Lagernr.')
     A            MWODAT    R               REFFLD(LÅEDAT)
     A                                      COLHDG('Ordrenr')
     A            MWOTXO    R               REFFLD(LÅTEK1)
     A                                      COLHDG('Overstyrt tekst1')
     A            MWOT2O    R               REFFLD(LÅTEK1)
     A                                      COLHDG('Overstyrt tekst2')
     A            MWOTXV    R               REFFLD(LÅTEK1)
     A                                      COLHDG('Tekst på vare 1')
     A            MWOT2V    R               REFFLD(LÅTEK1)
     A                                      COLHDG('Tekst på vare 2')
     A            MWOAVD    R               REFFLD(LÅAVDE)
     A            MWOSLG    R               REFFLD(LÅSELG)
     A            MWOSLN        30A
     A                                      COLHDG('Selgernavn')
     A            MWOBNG        12A
     A                                      COLHDG('Bongnr')
     A            MWOBEH        11S 3       TEXT('Beholdning')
     A                                      COLHDG('Beholdn.')
     A                                      EDTCDE(M)
     A            MWOANT        11S 0       TEXT('Ant.restordre')
     A                                      COLHDG('Ant.Restordre')
     A                                      EDTCDE(M)
     A            MWOABC         2A
     A                                      COLHDG('ABC-kode')
     A            MWOOMS        11S 2       TEXT('Omsetning')
     A                                      COLHDG('Omsetning')
     A                                      EDTCDE(M)
     A            MWOVRD        11S 2       TEXT('Lagerverdi')
     A                                      COLHDG('Lagerverdi')
     A                                      EDTCDE(M)
     A            MWONET        11S 2       TEXT('Netto sum')
     A                                      COLHDG('Netto sum')
     A                                      EDTCDE(M)
     A            MWOTIM          T         TEXT('Klokkeslett')
     A                                      COLHDG('Klokken')
     A            MWOUSR        10A
     A                                      COLHDG('Brukerid')
     A            MWOODA          L
     A                                      COLHDG('Opprett.dato')
     A                                      TEXT('Opprett.dato')
      *
      * Arbeidsregister varemottak
      *
     A            MVFIRM    R               REFFLD(LÅFIRM)
      *
     A            MVNUMM    R               REFFLD(LÅNUMM)
     A            MVSUFF    R               REFFLD(LÅSUFF)
     A            MVLINE    R               REFFLD(LÅLINE)
     A            MVVARE    R               REFFLD(LÅVARE)
     A            MVEANN    R               REFFLD(LÅEANN)
     A            MVLEVR      0011S 3       TEXT('Levert')
                                            COLHDG('Levert')
     A            MVENHE    R               REFFLD(LÅENHE)
     A            MVEKOD         1S 0       TEXT('Etikettkode')
                                            COLHDG('Etikettkode')
     A            MVRKOD         1S 0       TEXT('Restkode')
                                            COLHDG('Restkode')
     A            MVSTAT         1A         TEXT('Statuskode')
                                            COLHDG('Statuskode')
      *
      * Arbeidsregister plukkliste
      *
     A            MKFIRM    R               REFFLD(LÅFIRM)
      *
     A            MKNUMM    R               REFFLD(LÅNUMM)
     A            MKSUFF    R               REFFLD(LÅSUFF)
     A            MKLINE    R               REFFLD(LÅLINE)
     A            MKVARE    R               REFFLD(LÅVARE)
     A            MKEANN    R               REFFLD(LÅEANN)
     A            MKANTA    R               REFFLD(LÅANTA)
     A                                      TEXT('Ant.ordre')
     A                                      COLHDG('Ant.ordre')
     A            MKANTP    R               REFFLD(LÅANTA)
     A                                      TEXT('Ant.plukket')
     A                                      COLHDG('Ant.plukket')
     A            MKENHE    R               REFFLD(LÅENHE)
     A                                      TEXT('Enh.ordre')
     A                                      COLHDG('Enh.ordre')
     A            MKENHP    R               REFFLD(LÅENHE)
     A                                      TEXT('Enh.plukket')
     A                                      COLHDG('Enh.plukket')
     A            MKRKOD         1S 0       TEXT('Restkode')
     A                                      COLHDG('Restkode')
     A            MKLOKA      0008A         COLHDG('Lagerlokasjon')
     A                                      TEXT('Lagerlokasjon')
     A            MKOTYP    R               REFFLD(LÅOTYP)
     A            MKSTAT         1A         TEXT('Statuskode')
     A                                      COLHDG('Statuskode')
     A            MKDATO    R               REFFLD(LÅEDAT)
     A            MKTIME    R               REFFLD(LÅETIM)
      *
      * Arbeidsregister Ny Håndholdt registrering Bestilling
      *
     A            MYFIRM    R               REFFLD(LÅFIRM)
     A            MYKODE         1A         TEXT('Tansaksjonskode')
     A            MYTIME          Z         TEXT('Timestamp')
     A            MYLINE    R               REFFLD(LÅLINE)
     A            MYLDOR    R               REFFLD(LÅLDOR)
     A            MYLAGE    R               REFFLD(LÅLAGE)
     A            MYAVDE    R               REFFLD(LÅAVDE)
     A            MYBDAT    R               REFFLD(LÅEDAT)
     A                                      TEXT('Bestillingsdato')
     A                                      COLHDG('Bestillingsdato')
     A            MYLDAT    R               REFFLD(LÅEDAT)
     A                                      COLHDG('Leveringsdato')
     A                                      TEXT('Leveringsdato')
     A            MYSELG    R               REFFLD(LÅSELG)
     A            MYVARE    R               REFFLD(LÅVARE)
     A            MYENHE    R               REFFLD(LÅENHE)
     A            MYANTA    R               REFFLD(LÅANTA)
     A            MYEANN    R               REFFLD(LÅEANN)
     A            MYBATC    R               REFFLD(LÅBATC)
     A            MYBTXT      0030A
     A                                      COLHDG('Tekst')
     A                                      TEXT('Tekst')
     A            MYTIMS          Z         TEXT('TELLETIMS')
6.2B A                                      DFT('0001-01-01-00.00.00.000000')
     A            MYEUSR    R               REFFLD(LÅEUSR)
8.02 A            MYOPPR         1A         TEXT('Opprinnelse')
8.02 A                                      COLHDG('Opprinnelse')
8.03 A            MYEREF        25A         TEXT('Ekstern referanse')
8.03 A                                      COLHDG('Ekstern referanse')
      *
      * Pakketregister
      *
     A            MTFIRM    R               REFFLD(LÅFIRM)
      *
     A            MTNUMM         6S 0       TEXT('Pakkenummer')
     A                                      COLHDG('Pakkenummer')
      *
     A            MTVARE    R               REFFLD(LÅVARE)
     A            MTLVAR    R               REFFLD(LÅLVAR)
     A            MTTVAR    R               REFFLD(LÅLVAR)
     A            MTNOBB    R               REFFLD(LÅNOBB)
     A            MTLAGE    R               REFFLD(LÅLAGE)
      *
     A            MTLINE         3S 0       TEXT('Linjenummer')
     A                                      COLHDG('Linjenummer')
      *
     A            MTSERI         6S 0       TEXT('Serienummer')
     A                                      COLHDG('Serienummer')
      *
     A            MTKORR         1S 0       TEXT('Korrigert')
     A                                      COLHDG('Korrigert')
      *
     A            MTDATO          L         TEXT('Prod. Dato')
     A                                      COLHDG('Prod. Dato')
      *
     A            MTTIME          T         TEXT('Prod. tid')
     A                                      COLHDG('Prod. tid')
      *
     A            MTNTYK         6S 0       TEXT('Nom. tykkelse')
     A                                      COLHDG('Nom. tykkelse')
      *
     A            MTNBRE         6S 0       TEXT('Nom. bredde')
     A                                      COLHDG('Nom. bredde')
      *
     A            MTATYK         6S 0       TEXT('Akt. tykkelse')
     A                                      COLHDG('Akt. tykkelse')
      *
     A            MTABRE         6S 0       TEXT('Akt. bredde')
     A                                      COLHDG('Akt. bredde')
      *
     A            MTARTN         8S 0       TEXT('Artikkelnr.')
     A                                      COLHDG('Artikkelnr.')
      *
     A            MTPROF        15A         TEXT('Profil')
     A                                      COLHDG('Profil')
      *
     A            MTKVAL         1A         TEXT('Kvalitet')
     A                                      COLHDG('Kvalitet')
      *
     A            MTTREK         1A         TEXT('Trekode')
     A                                      COLHDG('Trekode')
      *
     A            MTBEHA         1A         TEXT('Behandling')
     A                                      COLHDG('Behandling')
      *
     A            MTPTYP         1A         TEXT('Pakketype')
     A                                      COLHDG('Pakketype')
      *
     A            MTLJUS         5A         TEXT('Lengdejustert')
     A                                      COLHDG('Lengdejustert')
      *
     A            MTTANT         6S 0       TEXT('Totalt antall')
     A                                      COLHDG('Totalt antall')
      *
     A            MTKANT         6S 0       TEXT('Kortlengde antall')
     A                                      COLHDG('Kortlengde antall')
      *
     A            MTDM18         3S 0       TEXT('Ant. i gruppe 18')
     A                                      COLHDG('Ant. i gruppe 18')
      *
     A            MTDM19         3S 0       TEXT('Ant. i gruppe 19')
     A                                      COLHDG('Ant. i gruppe 19')
      *
     A            MTDM20         3S 0       TEXT('Ant. i gruppe 20')
     A                                      COLHDG('Ant. i gruppe 20')
      *
     A            MTDM21         3S 0       TEXT('Ant. i gruppe 21')
     A                                      COLHDG('Ant. i gruppe 21')
      *
     A            MTDM22         3S 0       TEXT('Ant. i gruppe 22')
     A                                      COLHDG('Ant. i gruppe 22')
      *
     A            MTDM23         3S 0       TEXT('Ant. i gruppe 23')
     A                                      COLHDG('Ant. i gruppe 23')
      *
     A            MTDM24         3S 0       TEXT('Ant. i gruppe 24')
     A                                      COLHDG('Ant. i gruppe 24')
      *
     A            MTDM25         3S 0       TEXT('Ant. i gruppe 25')
     A                                      COLHDG('Ant. i gruppe 25')
      *
     A            MTDM26         3S 0       TEXT('Ant. i gruppe 26')
     A                                      COLHDG('Ant. i gruppe 26')
      *
     A            MTDM27         3S 0       TEXT('Ant. i gruppe 27')
     A                                      COLHDG('Ant. i gruppe 27')
      *
     A            MTDM28         3S 0       TEXT('Ant. i gruppe 28')
     A                                      COLHDG('Ant. i gruppe 28')
      *
     A            MTDM29         3S 0       TEXT('Ant. i gruppe 29')
     A                                      COLHDG('Ant. i gruppe 29')
      *
     A            MTDM30         3S 0       TEXT('Ant. i gruppe 30')
     A                                      COLHDG('Ant. i gruppe 30')
      *
     A            MTDM31         3S 0       TEXT('Ant. i gruppe 31')
     A                                      COLHDG('Ant. i gruppe 31')
      *
     A            MTDM32         3S 0       TEXT('Ant. i gruppe 32')
     A                                      COLHDG('Ant. i gruppe 32')
      *
     A            MTDM33         3S 0       TEXT('Ant. i gruppe 33')
     A                                      COLHDG('Ant. i gruppe 33')
      *
     A            MTDM34         3S 0       TEXT('Ant. i gruppe 34')
     A                                      COLHDG('Ant. i gruppe 34')
      *
     A            MTDM35         3S 0       TEXT('Ant. i gruppe 35')
     A                                      COLHDG('Ant. i gruppe 35')
      *
     A            MTDM36         3S 0       TEXT('Ant. i gruppe 36')
     A                                      COLHDG('Ant. i gruppe 36')
      *
     A            MTDM37         3S 0       TEXT('Ant. i gruppe 37')
     A                                      COLHDG('Ant. i gruppe 37')
      *
     A            MTDM38         3S 0       TEXT('Ant. i gruppe 38')
     A                                      COLHDG('Ant. i gruppe 38')
      *
     A            MTDM39         3S 0       TEXT('Ant. i gruppe 39')
     A                                      COLHDG('Ant. i gruppe 39')
      *
     A            MTDM40         3S 0       TEXT('Ant. i gruppe 40')
     A                                      COLHDG('Ant. i gruppe 40')
      *
     A            MTDM41         3S 0       TEXT('Ant. i gruppe 41')
     A                                      COLHDG('Ant. i gruppe 41')
      *
     A            MTDM42         3S 0       TEXT('Ant. i gruppe 42')
     A                                      COLHDG('Ant. i gruppe 42')
      *
     A            MTDM43         3S 0       TEXT('Ant. i gruppe 43')
     A                                      COLHDG('Ant. i gruppe 43')
      *
     A            MTDM44         3S 0       TEXT('Ant. i gruppe 44')
     A                                      COLHDG('Ant. i gruppe 44')
      *
     A            MTDM45         3S 0       TEXT('Ant. i gruppe 45')
     A                                      COLHDG('Ant. i gruppe 45')
      *
     A            MTDM46         3S 0       TEXT('Ant. i gruppe 46')
     A                                      COLHDG('Ant. i gruppe 46')
      *
     A            MTDM47         3S 0       TEXT('Ant. i gruppe 47')
     A                                      COLHDG('Ant. i gruppe 47')
      *
     A            MTDM48         3S 0       TEXT('Ant. i gruppe 48')
     A                                      COLHDG('Ant. i gruppe 48')
      *
     A            MTDM49         3S 0       TEXT('Ant. i gruppe 49')
     A                                      COLHDG('Ant. i gruppe 49')
      *
     A            MTDM50         3S 0       TEXT('Ant. i gruppe 50')
     A                                      COLHDG('Ant. i gruppe 50')
      *
     A            MTDM51         3S 0       TEXT('Ant. i gruppe 51')
     A                                      COLHDG('Ant. i gruppe 51')
      *
     A            MTDM52         3S 0       TEXT('Ant. i gruppe 52')
     A                                      COLHDG('Ant. i gruppe 52')
      *
     A            MTDM53         3S 0       TEXT('Ant. i gruppe 53')
     A                                      COLHDG('Ant. i gruppe 53')
      *
     A            MTDM54         3S 0       TEXT('Ant. i gruppe 54')
     A                                      COLHDG('Ant. i gruppe 54')
      *
     A            MTDM55         3S 0       TEXT('Ant. i gruppe 55')
     A                                      COLHDG('Ant. i gruppe 55')
      *
     A            MTDM56         3S 0       TEXT('Ant. i gruppe 56')
     A                                      COLHDG('Ant. i gruppe 56')
      *
     A            MTDM57         3S 0       TEXT('Ant. i gruppe 57')
     A                                      COLHDG('Ant. i gruppe 57')
      *
     A            MTDM58         3S 0       TEXT('Ant. i gruppe 58')
     A                                      COLHDG('Ant. i gruppe 58')
      *
     A            MTDM59         3S 0       TEXT('Ant. i gruppe 59')
     A                                      COLHDG('Ant. i gruppe 59')
      *
     A            MTDM60         3S 0       TEXT('Ant. i gruppe 60')
     A                                      COLHDG('Ant. i gruppe 60')
      *
     A            MTDM61         3S 0       TEXT('Ant. i gruppe 61')
     A                                      COLHDG('Ant. i gruppe 61')
      *
     A            MTDM62         3S 0       TEXT('Ant. i gruppe 62')
     A                                      COLHDG('Ant. i gruppe 62')
      *
     A            MTTOTL         6S 1       TEXT('Total lengde')
     A                                      COLHDG('Total lengde')
      *
     A            MTTOTK         6S 1       TEXT('Total kortlengde')
     A                                      COLHDG('Total kortlengde')
      *
     A            MTNOMK         5S 3       TEXT('Nominell kubikk')
     A                                      COLHDG('Nominell kubikk')
      *
     A            MTKNOK         5S 3       TEXT('Kortl. nom.kub.')
     A                                      COLHDG('Kortl. nom.kub.')
      *
     A            MTAKTK         5S 3       TEXT('Aktuell kubikk')
     A                                      COLHDG('Aktuell kubikk')
      *
     A            MTKAKK         5S 3       TEXT('Kortl. akt.kub.')
     A                                      COLHDG('Kortl. akt.kub.')
      *
     A            MTMLEN         3S 2       TEXT('Minste lengde.')
     A                                      COLHDG('Minste lengde.')
      *
     A            MTSLEN         3S 2       TEXT('Største lengde.')
     A                                      COLHDG('Største lengde.')
      *
     A            MTSNIT         3S 2       TEXT('Snittlengde')
     A                                      COLHDG('Snittlengde')
      *
     A            MTPROS         5S 2       TEXT('Kortl.prosent')
     A                                      COLHDG('Kortl.prosent')
      *
     A            MTVEKT         5S 1       TEXT('Vekt')
     A                                      COLHDG('Vekt')
      *
     A            MTSORT         5A         TEXT('Sorterer')
     A                                      COLHDG('Sorterer')
      *
     A            MTORDN        10A         TEXT('Ordrenummer')
     A                                      COLHDG('Ordrenummer')
      *
     A            MTKUND        10A         TEXT('Kunde')
     A                                      COLHDG('Kunde')
      *
     A            MTTOTR         6S 1       TEXT('Rest lengde')
     A                                      COLHDG('Rest lengde')
      *
     A            MTSTAT         1A         TEXT('Pakkestatus')
     A                                      COLHDG('Pakkestatus')
6.10 A            MTODAT    R               REFFLD(LÅODAT)
6.10 A            MTOTIM    R               REFFLD(LÅOTIM)
6.10 A            MTOUSR    R               REFFLD(LÅOUSR)
6.10 A            MTEDAT    R               REFFLD(LÅEDAT)
6.10 A            MTETIM    R               REFFLD(LÅETIM)
6.10 A            MTEUSR    R               REFFLD(LÅEUSR)
      *
      * Pakketregister historikk
      *
     A            MUFIRM    R               REFFLD(LÅFIRM)
      *
     A            MUNUMM         6S 0       TEXT('Pakkenummer')
     A                                      COLHDG('Pakkenummer')
      *
     A            MUDATO          L         TEXT('Logg. Dato')
     A                                      COLHDG('Prod. Dato')
      *
     A            MUTIME          T         TEXT('Logg. tid')
     A                                      COLHDG('Prod. tid')
      *
     A            MUTEXT        20A         TEXT('Hendelse')
     A                                      COLHDG('Hendelse')
      *
     A            MULENG         6S 1       TEXT('Logget lengde')
     A                                      COLHDG('Logget lengde')
      *
     A            MUUSER        10A         TEXT('Utført av')
     A                                      COLHDG('Utført av')
6.10 A            MUODAT    R               REFFLD(LÅODAT)
6.10 A            MUOTIM    R               REFFLD(LÅOTIM)
6.10 A            MUOUSR    R               REFFLD(LÅOUSR)
6.10 A            MUEDAT    R               REFFLD(LÅEDAT)
6.10 A            MUETIM    R               REFFLD(LÅETIM)
6.10 A            MUEUSR    R               REFFLD(LÅEUSR)
      *
      *  Abc parameter-sumnivå              (MA)
      *
     A            MAFIRM    R               REFFLD(LÅFIRM)
     A            MAVSOR    R               REFFLD(LÅVSOR)
     A            MAOGRP    R               REFFLD(LÅOGRP)
     A            MAHGRP    R               REFFLD(LÅHGRP)
     A            MAUGRP    R               REFFLD(LÅUGRP)
     A            MALAGK         2A         TEXT('Lager som oppdateres')
     A                                      COLHDG('LAGER' 'OPPD')
     A            MATEXT        30A         TEXT('Beskrivelse')
     A                                      COLHDG('Beskrivelse')
     A            MAABAP         3S 0       TEXT('ABC A %')
     A                                      COLHDG('ABC A %')
     A                                      EDTCDE(Z)
     A            MAABBP         3S 0       TEXT('ABC B %')
     A                                      COLHDG('ABC B %')
     A                                      EDTCDE(Z)
     A            MAABCP         3S 0       TEXT('ABC C %')
     A                                      COLHDG('ABC C %')
     A                                      EDTCDE(Z)
     A            MAXYXP         3S 0       TEXT('XYZ X %')
     A                                      COLHDG('XYZ X %')
     A                                      EDTCDE(Z)
     A            MAXYYP         3S 0       TEXT('XYZ Y %')
     A                                      COLHDG('XYZ Y %')
     A                                      EDTCDE(Z)
     A            MAXYZP         3S 0       TEXT('XYZ Z %')
     A                                      COLHDG('XYZ Z %')
     A                                      EDTCDE(Z)
     A            MAANAX        11S 0       TEXT('Antall AX')
     A                                      COLHDG('Antall AX')
     A                                      EDTCDE(Z)
     A            MAANAY        11S 0       TEXT('Antall AY')
     A                                      COLHDG('Antall AY')
     A                                      EDTCDE(Z)
     A            MAANAZ        11S 0       TEXT('Antall AZ')
     A                                      COLHDG('Antall AZ')
     A                                      EDTCDE(Z)
     A            MAANBX        11S 0       TEXT('Antall BX')
     A                                      COLHDG('Antall BX')
     A                                      EDTCDE(Z)
     A            MAANBY        11S 0       TEXT('Antall BY')
     A                                      COLHDG('Antall BY')
     A                                      EDTCDE(Z)
     A            MAANBZ        11S 0       TEXT('Antall BZ')
     A                                      COLHDG('Antall BZ')
     A                                      EDTCDE(Z)
     A            MAANCX        11S 0       TEXT('Antall CX')
     A                                      COLHDG('Antall CX')
     A                                      EDTCDE(Z)
     A            MAANCY        11S 0       TEXT('Antall CY')
     A                                      COLHDG('Antall CY')
     A                                      EDTCDE(Z)
     A            MAANCZ        11S 0       TEXT('Antall CZ')
     A                                      COLHDG('Antall CZ')
     A                                      EDTCDE(Z)
     A            MAKDAT    R               REFFLD(LÅODAT)
     A                                      COLHDG('Kjøredato')
     A            MAVDAT    R               REFFLD(LÅODAT)
     A                                      COLHDG('Vareoppdat.dato')
     A            MAFAAR         4S 0       TEXT('ABC-ana. kjørt for:fra år')
     A                                      COLHDG('Fra år')
     A            MATAAR         4S 0       TEXT('ABC-ana. kjørt for:til år')
     A                                      COLHDG('Til år')
     A            MAFMND         2S 0       TEXT('ABC-ana. kjørt for:fra mnd')
     A                                      COLHDG('Fra mnd')
     A            MATMND         2S 0       TEXT('ABC-ana. kjørt for:til mnd')
     A                                      COLHDG('Fra mnd')
     A            MALAGR        20S 0       TEXT('Lager-intil 10 lager kan ve-
     A                                      lges')
     A                                      COLHDG('Lager')
     A            MALTYP        10  0       TEXT('Leveringstype intil 10 lev.ty-
     A                                      per')
     A                                      COLHDG('Lager')
     A            MAUSER    R               REFFLD(LÅUSER)
     A            MAODAT    R               REFFLD(LÅODAT)
6.10 A            MAOTIM    R               REFFLD(LÅOTIM)
     A            MAEDAT    R               REFFLD(LÅEDAT)
     A            MAETIM    R               REFFLD(LÅETIM)
6.10 A            MAEUSR    R               REFFLD(LÅEUSR)
      *
      *  Abc analyse - detaljer             (MB)
      *
     A            MBFIRM    R               REFFLD(LÅFIRM)
     A            MBVSOR    R               REFFLD(LÅVSOR)
     A            MBOGRP    R               REFFLD(LÅOGRP)
     A            MBHGRP    R               REFFLD(LÅHGRP)
     A            MBUGRP    R               REFFLD(LÅUGRP)
     A            MBVARE    R               REFFLD(LÅVARE)
     A            MBLAGK         2A         TEXT('Lager som oppdateres')
     A                                      COLHDG('Lager' 'oppd')
     A            MBLAGE    R               REFFLD(LÅLAGE)
     A            MBKABC         2A         TEXT('ABC-kode')
     A                                      COLHDG('ABC' 'kode')
     A            MBEABC         2A         TEXT('Endret ABC-kode')
     A                                      COLHDG('Oppr.' 'ABC')
     A            MBOABC         2A         TEXT('Opprinnelig ABC-kode')
     A                                      COLHDG('Oppr.' 'ABC')
     A            MBKXYZ         1A         TEXT('XYZ-kode')
     A                                      COLHDG('XYZ' 'kode')
     A            MBANTA        11S 0       TEXT('Antall')
     A                                      COLHDG('Antall')
     A                                      EDTCDE(Z)
     A            MBANTO        11S 0       TEXT('Antall Ordrelinjer')
     A                                      COLHDG('Antall' 'Ordrelinjer')
     A                                      EDTCDE(Z)
     A            MBOMSE        11S 2       TEXT('Omsetning')
     A                                      COLHDG('Omsetning')
     A                                      EDTCDE(Z)
     A            MBTOPR        10S 7       TEXT('Prosentvis fordeling total')
     A                                      COLHDG('%-vis fordeling')
     A                                      EDTCDE(Z)
     A            MBABPR        10S 7       TEXT('Prosentvis fordel.inn abck')
     A                                      COLHDG('%-vis fordeling')
     A                                      EDTCDE(Z)
     A            MBABAP        10S 7       TEXT('Akkumulert % for abck')
     A                                      COLHDG('Akk. %-for abck')
     A                                      EDTCDE(Z)
     A            MBXYPR        10S 7       TEXT('Prosentvis fordel.inn xyzk')
     A                                      COLHDG('%-vis fordeling')
     A                                      EDTCDE(Z)
     A            MBXYAP        10S 7       TEXT('Akkumulert % for abck')
     A                                      COLHDG('Akk. %-for abck')
     A                                      EDTCDE(Z)
     A            MBENHE         3A         TEXT('Enhet')
     A                                      COLHDG('Enh')
     A            MBUSER    R               REFFLD(LÅUSER)
     A            MBODAT    R               REFFLD(LÅODAT)
6.10 A            MBOTIM    R               REFFLD(LÅOTIM)
     A            MBEDAT    R               REFFLD(LÅEDAT)
     A            MBETIM    R               REFFLD(LÅETIM)
6.10 A            MBEUSR    R               REFFLD(LÅEUSR)
      *
      *  Parameter leveringstid             (MC)
      *
     A            MCFIRM    R               REFFLD(LÅFIRM)
     A            MCOGRP    R               REFFLD(LÅOGRP)
     A            MCHGRP    R               REFFLD(LÅHGRP)
     A            MCUGRP    R               REFFLD(LÅUGRP)
     A            MCVARE    R               REFFLD(LÅVARE)
     A            MCLDOR    R               REFFLD(LÅLDOR)
     A            MCLAGE    R               REFFLD(LÅLAGE)
     A            MCCRDO         1S 0       TEXT('Cross docking')
     A                                      COLHDG('Cross docking')
     A            MCLTID         3S 0       TEXT('Leveringstid')
     A                                      COLHDG('Leveringstid')
     A                                      EDTCDE(Z)
     A            MCKDAT    R               REFFLD(LÅODAT)
     A            MCUSER    R               REFFLD(LÅUSER)
     A            MCODAT    R               REFFLD(LÅODAT)
6.10 A            MCOTIM    R               REFFLD(LÅOTIM)
     A            MCEDAT    R               REFFLD(LÅEDAT)
     A            MCETIM    R               REFFLD(LÅETIM)
6.10 A            MCEUSR    R               REFFLD(LÅEUSR)
      *
      *  Matrise Best.mengde /Sikkerhetsid  (MM)
      *
     A            MMFIRM    R               REFFLD(LÅFIRM)
     A            MMVSOR    R               REFFLD(LÅVSOR)
     A            MMOGRP    R               REFFLD(LÅOGRP)
     A            MMHGRP    R               REFFLD(LÅHGRP)
     A            MMUGRP    R               REFFLD(LÅUGRP)
     A            MMVARE    R               REFFLD(LÅVARE)
     A            MMKDAT    R               REFFLD(LÅODAT)
     A                                      COLHDG('Kjøredato')
     A            MMFAAR         4S 0       TEXT('Prognose kjørt for:fra år')
     A                                      COLHDG('Fra år')
     A            MMTAAR         4S 0       TEXT('Prognose kjørt for:til år')
     A                                      COLHDG('Til år')
     A            MMFUKE         2S 0       TEXT('Prognose kjørt for uke')
     A                                      COLHDG('Fra uke')
     A            MMTUKE         2S 0       TEXT('Prognose kjørt for uke')
     A                                      COLHDG('Til uke')
     A            MMDBAX         3S 0       TEXT('Best.mengde Dager AX')
     A                                      COLHDG('Dager AX')
     A            MMDBAY         3S 0       TEXT('Best.mengde Dager AY')
     A                                      COLHDG('Dager AY')
     A            MMDBAZ         3S 0       TEXT('Best.mengde Dager AZ')
     A                                      COLHDG('Dager AZ')
     A            MMDBBX         3S 0       TEXT('Best.mengde Dager BX')
     A                                      COLHDG('Dager BX')
     A            MMDBBY         3S 0       TEXT('Best.mengde Dager BY')
     A                                      COLHDG('Dager BY')
     A            MMDBBZ         3S 0       TEXT('Best.mengde Dager BZ')
     A                                      COLHDG('Dager BZ')
     A            MMDBCX         3S 0       TEXT('Best.mengde Dager CX')
     A                                      COLHDG('Dager CX')
     A            MMDBCY         3S 0       TEXT('Best.mengde Dager CY')
     A                                      COLHDG('Dager CY')
     A            MMDBCZ         3S 0       TEXT('Best.mengde Dager CZ')
     A                                      COLHDG('Dager CZ')
     A            MMDSAX         3S 0       TEXT('Sikk.tid Dager AX')
     A                                      COLHDG('Dager AX')
     A            MMDSAY         3S 0       TEXT('Sikk.tid Dager AY')
     A                                      COLHDG('Dager AY')
     A            MMDSAZ         3S 0       TEXT('Sikk.tid Dager AZ')
     A                                      COLHDG('Dager AZ')
     A            MMDSBX         3S 0       TEXT('Sikk.tid Dager BX')
     A                                      COLHDG('Dager BX')
     A            MMDSBY         3S 0       TEXT('Sikk.tid Dager BY')
     A                                      COLHDG('Dager BY')
     A            MMDSBZ         3S 0       TEXT('Sikk.tid Dager BZ')
     A                                      COLHDG('Dager BZ')
     A            MMDSCX         3S 0       TEXT('Sikk.tid Dager CX')
     A                                      COLHDG('Dager CX')
     A            MMDSCY         3S 0       TEXT('Sikk.tid Dager CY')
     A                                      COLHDG('Dager CY')
     A            MMDSCZ         3S 0       TEXT('Sikk.tid Dager CZ')
     A                                      COLHDG('Dager CZ')
     A            MMANTP         1S 0       TEXT('Antall år prognosegrunnlag')
     A                                      COLHDG('Ant.år prog.grunnl.')
     A            MMANTU         2S 0       TEXT('Antall uker trendkorreksjon')
     A                                      COLHDG('Ant.uker trend.korr')
     A            MMBRKU         1S 0       TEXT('Bruk trendkorreksjon uker')
     A                                      COLHDG('Bruk trendk. uker')
     A            MMANTG         2S 0       TEXT('Antall uker for glatting')
     A                                      COLHDG('Ant.uker glatting')
     A            MMBRKG         1S 0       TEXT('Bruk glatning av prognose')
     A                                      COLHDG('Bruk glatn. prog')
     A            MMLT01         1S 0       TEXT('Leveringstype 1')
     A                                      COLHDG('Lev.t 1')
     A            MMLT02         1S 0       TEXT('Leveringstype 2')
     A                                      COLHDG('Lev.t 2')
     A            MMLT03         1S 0       TEXT('Leveringstype 3')
     A                                      COLHDG('Lev.t 3')
     A            MMLT04         1S 0       TEXT('Leveringstype 4')
     A                                      COLHDG('Lev.t 4')
     A            MMLT05         1S 0       TEXT('Leveringstype 5')
     A                                      COLHDG('Lev.t 5')
     A            MMLT06         1S 0       TEXT('Leveringstype 6')
     A                                      COLHDG('Lev.t 6')
     A            MMLT07         1S 0       TEXT('Leveringstype 7')
     A                                      COLHDG('Lev.t 7')
     A            MMLT08         1S 0       TEXT('Leveringstype 8')
     A                                      COLHDG('Lev.t 8')
     A            MMLT09         1S 0       TEXT('Leveringstype 9')
     A                                      COLHDG('Lev.t 9')
     A            MMLT10         1S 0       TEXT('Leveringstype10')
     A                                      COLHDG('Lev.t10')
     A            MMVTYP         1A         TEXT('Varetupe')
     A                                      COLHDG('Varetype')
     A            MMLDOR    R               REFFLD(LÅLDOR)
     A            MMLAGE    R               REFFLD(LÅLAGE)
     A            MMLAGR        20S 0       TEXT('Lager-intil 10 lager kan ve-
     A                                      lges')
     A            MMLAGT    R               REFFLD(LÅLAGE)
     A                                      TEXT('Lager som oppdateres, ut fra-
                                             lager i MMLAGE+MMLAGR')
     A                                      COLHDG('Lager som oppd.')
     A            MMAKTI         1S 0       TEXT('0=Aktiv/1=passiv')
     A                                      COLHDG('Akt./Pas.')
     A            MMCRDO         1S 0       TEXT('0=Vanlig/1=Cross docking')
     A                                      COLHDG('Cross docking')
     A            MMUSER    R               REFFLD(LÅUSER)
     A            MMODAT    R               REFFLD(LÅODAT)
6.10 A            MMOTIM    R               REFFLD(LÅOTIM)
     A            MMEDAT    R               REFFLD(LÅEDAT)
     A            MMETIM    R               REFFLD(LÅETIM)
6.10 A            MMEUSR    R               REFFLD(LÅUSER)
      *
      *  Prognose                           (MO)
      *
     A            MOFIRM    R               REFFLD(LÅFIRM)
     A            MOVARE    R               REFFLD(LÅVARE)
     A            MOVARK    R               REFFLD(LÅVARE)
     A            MOLAGE    R               REFFLD(LÅLAGE)
     A            MOLDOR    R               REFFLD(LÅLDOR)
     A            MOVSOR    R               REFFLD(LÅVSOR)
     A            MOOGRP    R               REFFLD(LÅOGRP)
     A            MOHGRP    R               REFFLD(LÅHGRP)
     A            MOUGRP    R               REFFLD(LÅUGRP)
     A            MOTEXT        35A
     A            MOKDAT    R               REFFLD(LÅODAT)
     A                                      COLHDG('Kjøredato')
     A            MOBPUN        11S 3       TEXT('Bestillingspunkt')
     A                                      COLHDG('Best.' 'punkt')
     A                                      EDTCDE(M)
      *
     A            MOBMEN        11S 3       TEXT('Best. mengde')
     A                                      COLHDG('Best.' 'mengde'    )
     A                                      EDTCDE(M)
      *
     A            MOMINI        11S 3       TEXT('Minimumslager')
     A                                      COLHDG('Mini' 'lager')
     A                                      EDTCDE(M)
     A            MOKABC         2A         TEXT('ABC-kode')
     A                                      COLHDG('ABC' 'kode')
6.10 A            MOODAT    R               REFFLD(LÅODAT)
6.10 A            MOOTIM    R               REFFLD(LÅOTIM)
6.10 A            MOOUSR    R               REFFLD(LÅOUSR)
6.10 A            MOEDAT    R               REFFLD(LÅEDAT)
6.10 A            MOETIM    R               REFFLD(LÅETIM)
6.10 A            MOEUSR    R               REFFLD(LÅEUSR)
      *
6.22  *  Prognose   Sperre                  (MOS)
6.22  *  Utgår i v.6.20, legges i VLAGPF
6.22  *
6.22 A            MOSFRM    R               REFFLD(LÅFIRM)
6.22 A            MOSVAR    R               REFFLD(LÅVARE)
6.22 A            MOSLAG    R               REFFLD(LÅLAGE)
6.22 A            MOSTDA    R               REFFLD(LÅODAT)
6.22 A                                      COLHDG('Sperret''Til dato')
6.22 A            MOSUDA    R               REFFLD(LÅODAT)
6.22 A                                      COLHDG('Utg.''dato')
6.2B A                                      DFT('0001-01-01')
6.22 A            MOSLDO    R               REFFLD(LÅLDOR)
6.22 A                                      COLHDG('Best.''Leverandør')
6.22 A            MOSODA    R               REFFLD(LÅODAT)
6.22 A            MOSOTI    R               REFFLD(LÅOTIM)
6.22 A            MOSOUS    R               REFFLD(LÅOUSR)
6.22 A            MOSEDA    R               REFFLD(LÅODAT)
6.22 A            MOSETI    R               REFFLD(LÅETIM)
6.22 A            MOSUSR    R               REFFLD(LÅEUSR)
      *
      *  Prognose  pr. uke                  (MU)
      *
     A            MRFIRM    R               REFFLD(LÅFIRM)
     A            MRVARE    R               REFFLD(LÅVARE)
     A            MRLAGE    R               REFFLD(LÅLAGE)
     A            MRAAR          4S 0       TEXT('Prognose år')
     A                                      COLHDG('År')
     A            MRUKE          2S 0       TEXT('Prognose uke')
     A                                      COLHDG('År')
     A            MRENHE    R               REFFLD(LÅENHE)
     A                                      COLHDG('Lager enhet')
     A            MRANTP        11S 3       TEXT('Prognose antall lagerenh.')
     A                                      COLHDG('Prognose' 'Antall''Lag.enh')
     A                                      EDTCDE(Z)
     A            MRANTR        11S 3       TEXT('Registrert antall')
     A                                      COLHDG('Registrert' 'Antall')
     A                                      EDTCDE(Z)
     A            MRANTT        11S 3       TEXT('Prognose antall stat.enh.')
     A                                      COLHDG('Prognose' 'Antall''Sta.enh')
     A                                      EDTCDE(Z)
     A            MRANTS        11S 0       TEXT('Antall solgt')
     A                                      COLHDG('Antall' 'Solgt')
     A                                      EDTCDE(Z)
     A            MRANTI        11S 0       TEXT('Antall Innkjøp')
     A                                      COLHDG('Antall' 'Innkjøp')
     A                                      EDTCDE(Z)
     A            MRGLPR        11S 2       TEXT('Trendsprosent')
     A                                      COLHDG('Trend' 'Prosent')
     A                                      EDTCDE(Z)
     A            MRUANT        11S 3       TEXT('Ujustert antall')
     A                                      COLHDG('Ujustert' 'Antall')
     A                                      EDTCDE(Z)
     A            MRANTG        11S 3       TEXT('Glattet antall')
     A                                      COLHDG('Glattet' 'Antall')
     A                                      EDTCDE(Z)
     A            MRKABC         2A         TEXT('ABC-kode')
     A                                      COLHDG('ABC' 'kode')
     A            MRVSOR    R               REFFLD(LÅVSOR)
     A                                      COLHDG('Par.key' 'Varesort')
     A                                      TEXT('Parameterkey - varesortiment')
     A            MROGRP    R               REFFLD(LÅOGRP)
     A                                      COLHDG('Par.key' 'Overgrp')
     A                                      TEXT('Parameterkey - Overgruppe')
     A            MRHGRP    R               REFFLD(LÅHGRP)
     A                                      COLHDG('Par.key' 'Hovedgrp')
     A                                      TEXT('Parameterkey - Hovedgruppe')
     A            MRUGRP    R               REFFLD(LÅUGRP)
     A                                      COLHDG('Par.key' 'Undergrp')
     A                                      TEXT('Parameterkey - Undergruppe')
     A            MRLDOR    R               REFFLD(LÅLDOR)
     A                                      COLHDG('Par.key' 'Lev.nr')
     A                                      TEXT('Parameterkey - Leverandør')
     A            MRVARK    R               REFFLD(LÅVARE)
     A                                      COLHDG('Par.key' 'Varenr')
     A                                      TEXT('Parameterkey - varenummer')
     A            MRCRDO         1S 0
     A                                      COLHDG('Par.key' 'Cross dock')
     A                                      TEXT('Parameterkey - Cross docking')
     A            MRUSER    R               REFFLD(LÅUSER)
     A            MRODAT    R               REFFLD(LÅODAT)
6.10 A            MROTIM    R               REFFLD(LÅOTIM)
     A            MREDAT    R               REFFLD(LÅEDAT)
     A            MRETIM    R               REFFLD(LÅETIM)
6.10 A            MREUSR    R               REFFLD(LÅEUSR)
      *
      *  Prognose  - store avvik innkjøpsparm (MQ)
      *
     A            MQFIRM    R               REFFLD(LÅFIRM)
     A            MQVARE    R               REFFLD(LÅVARE)
     A            MQLAGE    R               REFFLD(LÅLAGE)
     A            MQBMEG        11S 0       TEXT('Best. mengde gammel')
     A                                      COLHDG('Best.' 'mengde gml.')
     A                                      EDTCDE(M)
     A            MQBMEN        11S 0       TEXT('Best. mengde ny')
     A                                      COLHDG('Best.' 'mengde ny')
     A                                      EDTCDE(M)
     A            MQUSER    R               REFFLD(LÅUSER)
     A            MQODAT    R               REFFLD(LÅODAT)
     A            MQEDAT    R               REFFLD(LÅEDAT)
     A            MQETIM    R               REFFLD(LÅETIM)
      *
      *  Syklisk telling parameter          (MS)
      *
     A            MSFIRM    R               REFFLD(LÅFIRM)
     A            MSAAR          4S 0       TEXT('Parameter år')
     A                                      COLHDG('Parm År')
     A                                      EDTCDE(Z)
     A            MSLAGE    R               REFFLD(LÅLAGE)
     A            MSAXAF         6S 0       TEXT('Ant. forekomster AX')
     A                                      COLHDG('Ant.forekomst. AX')
     A                                      EDTCDE(Z)
     A            MSAXAG         6S 0       TEXT('Ant.ganger telles pr. år AX')
     A                                      COLHDG('Ant.g.telles pr AX')
     A                                      EDTCDE(Z)
     A            MSAYAF         6S 0       TEXT('Ant. forekomster AY')
     A                                      COLHDG('Ant.forekomst. AY')
     A                                      EDTCDE(Z)
     A            MSAYAG         6S 0       TEXT('Ant.ganger telles pr. år AY')
     A                                      COLHDG('Ant.g.telles pr AX')
     A                                      EDTCDE(Z)
     A            MSAZAF         6S 0       TEXT('Ant. forekomster AZ')
     A                                      COLHDG('Ant.forekomst. AZ')
     A                                      EDTCDE(Z)
     A            MSAZAG         6S 0       TEXT('Ant.ganger telles pr. år AZ')
     A                                      COLHDG('Ant.g.telles pr AZ')
     A                                      EDTCDE(Z)
     A            MSBXAF         6S 0       TEXT('Ant. forekomster BX')
     A                                      COLHDG('Ant.forekomst. BX')
     A                                      EDTCDE(Z)
     A            MSBXAG         6S 0       TEXT('Ant.ganger telles pr. år BX')
     A                                      COLHDG('Ant.g.telles pr BX')
     A                                      EDTCDE(Z)
     A            MSBYAF         6S 0       TEXT('Ant. forekomster BY')
     A                                      COLHDG('Ant.forekomst. BY')
     A                                      EDTCDE(Z)
     A            MSBYAG         6S 0       TEXT('Ant.ganger telles pr. år BY')
     A                                      COLHDG('Ant.g.telles pr BX')
     A                                      EDTCDE(Z)
     A            MSBZAF         6S 0       TEXT('Ant. forekomster BZ')
     A                                      COLHDG('Ant.forekomst. BZ')
     A                                      EDTCDE(Z)
     A            MSBZAG         6S 0       TEXT('Ant.ganger telles pr. år BZ')
     A                                      COLHDG('Ant.g.telles pr BZ')
     A                                      EDTCDE(Z)
     A            MSCXAF         6S 0       TEXT('Ant. forekomster CX')
     A                                      COLHDG('Ant.forekomst. CX')
     A                                      EDTCDE(Z)
     A            MSCXAG         6S 0       TEXT('Ant.ganger telles pr. år CX')
     A                                      COLHDG('Ant.g.telles pr CX')
     A                                      EDTCDE(Z)
     A            MSCYAF         6S 0       TEXT('Ant. forekomster CY')
     A                                      COLHDG('Ant.forekomst. CY')
     A                                      EDTCDE(Z)
     A            MSCYAG         6S 0       TEXT('Ant.ganger telles pr. år CY')
     A                                      COLHDG('Ant.g.telles pr CZ')
     A                                      EDTCDE(Z)
     A            MSCZAF         6S 0       TEXT('Ant. forekomster CZ')
     A                                      COLHDG('Ant.forekomst. CZ')
     A                                      EDTCDE(Z)
     A            MSCZAG         6S 0       TEXT('Ant.ganger telles pr. år CZ')
     A                                      COLHDG('Ant.g.telles pr CZ')
     A                                      EDTCDE(Z)
     A            MSANTT         6S 0       TEXT('Ant.tellinger pr. år')
     A                                      COLHDG('Ant. tellinger pr.år')
     A                                      EDTCDE(Z)
     A            MSANTV         6S 0       TEXT('Ant.varer pr. telling')
     A                                      COLHDG('Ant varer pr. tell.')
     A                                      EDTCDE(Z)
     A            MSUSER    R               REFFLD(LÅUSER)
     A            MSODAT    R               REFFLD(LÅODAT)
6.10 A            MSOTIM    R               REFFLD(LÅOTIM)
     A            MSEDAT    R               REFFLD(LÅEDAT)
     A            MSETIM    R               REFFLD(LÅETIM)
6.10 A            MSEUSR    R               REFFLD(LÅEUSR)
      *
      *  Syklisk telling håndholdt transer  (MF)
      *
     A            MFFIRM    R               REFFLD(LÅFIRM)
     A            MFHHUS    R               REFFLD(LÅUSER)
     A            MFBATC    R               REFFLD(LÅBATC)
     A            MFPLAS    R               REFFLD(LÅPLAS)
     A            MFVARE    R               REFFLD(LÅVARE)
     A            MFUSER    R               REFFLD(LÅUSER)
     A            MFODAT    R               REFFLD(LÅODAT)
6.10 A            MFOTIM    R               REFFLD(LÅOTIM)
     A            MFEDAT    R               REFFLD(LÅEDAT)
     A            MFETIM    R               REFFLD(LÅETIM)
6.10 A            MFEUSR    R               REFFLD(LÅEUSR)
      *
      *  Parameter bestillingsforslag       (MP)
      *
     A            MPFIRM    R               REFFLD(LÅFIRM)
     A            MPLDOR    R               REFFLD(LÅLDOR)
     A            MPLNUM         3S 0       TEXT('Løpenr.')
     A                                      COLHDG('Løpenr.')
     A                                      EDTCDE(Z)
     A            MPOGRF    R               REFFLD(LÅOGRP)
     A            MPOGRT    R               REFFLD(LÅOGRP)
     A            MPHGRF    R               REFFLD(LÅHGRP)
     A            MPHGRT    R               REFFLD(LÅHGRP)
     A            MPUGRF    R               REFFLD(LÅUGRP)
     A            MPUGRT    R               REFFLD(LÅUGRP)
     A            MPVARF    R               REFFLD(LÅVARE)
     A            MPVART    R               REFFLD(LÅVARE)
     A            MPPRAN    R               REFFLD(LÅPRAN)
     A            MPTHOR         2S 0       TEXT('Bevegelser tom. tidshorisont -
     A                                            i antall uker')
     A                                      COLHDG('Bev.tidshorisont')
     A                                      EDTCDE(Z)
     A            MPLAGE    R               REFFLD(LÅLAGE)
     A            MPVVAL         1S 0       TEXT('Valg varer som skal med')
     A                                      COLHDG('V.Valg')
     A                                      VALUES(0 1 2 3)
     A                                      EDTCDE(Z)
     A            MPSATS         3S 0       TEXT('Øke best.pkt med sats  ')
     A                                      COLHDG('Sats')
     A                                      EDTCDE(Z)
     A            MPAVAL         1S 0       TEXT('Bestemme antall')
     A                                      COLHDG('A.Valg')
     A                                      VALUES(1 2)
     A                                      EDTCDE(Z)
     A            MPBESK    R               REFFLD(LÅBESK)
     A            MPHYPP         2A         TEXT('Frekvens : Hyppighet')
     A                                      COLHDG('Hyppighet')
     A                                      VALUES('DG' 'UK' 'MD' '14')
     A            MPLU14         1A         TEXT('Lik /ulik uke v/14 dager')
     A                                      COLHDG('Lik/ulik')
     A            MPDAG1         1A         TEXT('Hvilke dager i uke eller -
     A                                       14 dager')
     A                                      COLHDG('Dag')
     A            MPDAG2         1A         TEXT('Hvilke dager i uke eller -
     A                                       14 dager')
     A                                      COLHDG('Dag')
     A            MPDAG3         1A         TEXT('Hvilke dager i uke eller -
     A                                       14 dager')
     A                                      COLHDG('Dag')
     A            MPDAG4         1A         TEXT('Hvilke dager i uke eller -
     A                                       14 dager')
     A                                      COLHDG('Dag')
     A            MPDAG5         1A         TEXT('Hvilke dager i uke eller -
     A                                       14 dager')
     A                                      COLHDG('Dag')
     A            MPDAG6         1A         TEXT('Hvilke dager i uke eller -
     A                                       14 dager')
     A                                      COLHDG('Dag')
     A            MPDAG7         1A         TEXT('Hvilke dager i uke eller -
     A                                       14 dager')
     A                                      COLHDG('Dag')
     A            MPHOLD         1S 0       TEXT('Legges i hold 0 = av 1=ho-
     A                                       ld      ')
     A                                      COLHDG('Hold')
     A                                      EDTCDE(Z)
     A            MPSDAT    R               REFFLD(LÅODAT)
     A                                      TEXT('Sist kjørt dato')
     A                                      COLHDG('Sist kjørt')
     A            MPGVEK    R               REFFLD(LÅVEKT)
     A                                      COLHDG('Grenseverdi vekt')
     A            MPGBEL        11S 2       TEXT('Grenseverdi beløp')
     A                                      COLHDG('Grenseverdi beløp')
     A            MPMAIL    R               REFFLD(LÅMAIL)
     A                                      COLHDG('Mail selger')
     A            MPLSOR        12A         TEXT('Sortering leverandør')
     A                                      COLHDG('Sortering')
     A            MPSELG    R               REFFLD(LÅSELG)
     A                                      COLHDG('Ansvarlig Selger')
     A                                      TEXT('Ansvarlig Selger')
     A            MPREBE         1A         TEXT('Reberegning av bestilling')
     A                                      COLHDG('R.B')
     A            MPKORA         1A         TEXT('Korriger mot anbrekk')
     A                                      COLHDG('Korr.m.anbr.')
6.13 A            MPKSOR    R               REFFLD(LÅJANE)
6.13 A                                      TEXT('Sortimentsstyring')
6.13 A                                      COLHDG('Sortiment''Styring')
6.28 A            MPRAPP         1A         TEXT('Kjøres rapport')
6.28 A                                      COLHDG('Rapport')
6.28 A            MPAB01         2A         TEXT('ABC kode')
6.28 A                                      COLHDG('ABC kode')
6.28 A            MPAB02         2A         TEXT('ABC kode')
6.28 A                                      COLHDG('ABC kode')
6.28 A            MPAB03         2A         TEXT('ABC kode')
6.28 A                                      COLHDG('ABC kode')
6.28 A            MPAB04         2A         TEXT('ABC kode')
6.28 A                                      COLHDG('ABC kode')
6.28 A            MPAB05         2A         TEXT('ABC kode')
6.28 A                                      COLHDG('ABC kode')
6.28 A            MPAB06         2A         TEXT('ABC kode')
6.28 A                                      COLHDG('ABC kode')
6.28 A            MPAB07         2A         TEXT('ABC kode')
6.28 A                                      COLHDG('ABC kode')
6.28 A            MPAB08         2A         TEXT('ABC kode')
6.28 A                                      COLHDG('ABC kode')
6.28 A            MPAB09         2A         TEXT('ABC kode')
6.28 A                                      COLHDG('ABC kode')
     A            MPUSER    R               REFFLD(LÅUSER)
     A            MPODAT    R               REFFLD(LÅODAT)
6.10 A            MPOTIM    R               REFFLD(LÅOTIM)
     A            MPEDAT    R               REFFLD(LÅEDAT)
     A            MPETIM    R               REFFLD(LÅETIM)
6.10 A            MPEUSR    R               REFFLD(LÅEUSR)
      *
      * Arbeidsregister                     (MWB)
      *
     A            MWBFIR    R               REFFLD(LÅFIRM)
     A            MWBVAR    R               REFFLD(LÅVARE)
     A            MWBOGR    R               REFFLD(LÅOGRP)
     A            MWBHGR    R               REFFLD(LÅHGRP)
     A            MWBUGR    R               REFFLD(LÅUGRP)
     A            MWBTK1    R               REFFLD(LÅTEK1)
     A            MWBENH    R               REFFLD(LÅENHE)
     A            MWBANT        11S 3       TEXT('Antall')
     A                                      COLHDG('Antall')
     A            MWBAOL        11S 0       TEXT('Antall ordrelinjer')
     A                                      COLHDG('Antall''Ordrelinjer')
     A            MWBSMB        11S 2       TEXT('Sum brutto')
     A                                      COLHDG('Sum brutto')
     A            MWBSMR        11S 2       TEXT('Sum rabatt')
     A                                      COLHDG('Sum rabatt')
     A            MWBSMN        11S 2       TEXT('Sum netto')
     A                                      COLHDG('Sum netto')
     A            MWABPR        10S 7       TEXT('Prosentvis fordel.inn abck')
     A                                      COLHDG('%-vis fordeling')
     A                                      EDTCDE(Z)
     A            MWABAP        10S 7       TEXT('Akkumulert % for abck')
     A                                      COLHDG('Akk. %-for abck')
     A                                      EDTCDE(Z)
     A            MWXYPR        10S 7       TEXT('Prosentvis fordel.inn xyzk')
     A                                      COLHDG('%-vis fordeling')
     A                                      EDTCDE(Z)
     A            MWXYAP        10S 7       TEXT('Akkumulert % for abck')
     A                                      COLHDG('Akk. %-for abck')
6.10 A            MWBODA    R               REFFLD(LÅODAT)
6.10 A            MWBOTI    R               REFFLD(LÅOTIM)
6.10 A            MWBOUS    R               REFFLD(LÅOUSR)
6.10 A            MWBEDA    R               REFFLD(LÅEDAT)
6.10 A            MWBETI    R               REFFLD(LÅETIM)
6.10 A            MWBEUS    R               REFFLD(LÅEUSR)
      *
      * Logistikkpunkt                      (MWB)
      *
     A            MJFIRM    R               REFFLD(LÅFIRM)
     A            MJSKAF         1A         TEXT('Skaffeordre')
     A                                      COLHDG('Skaffeordre')
     A            MJLAGE    R               REFFLD(LÅLAGE)
     A            MJAVDE    R               REFFLD(LÅAVDE)
     A            MJEANN    R               REFFLD(LÅEANN)
     A            MJSTED      0030A
     A                                      COLHDG('Sted')
     A                                      TEXT('Sted')
     A            MJADR1      0030A
     A                                      COLHDG('Adresse 1')
     A                                      TEXT('Adresse 1')
     A            MJADR2      0030A
     A                                      COLHDG('Adresse 2')
     A                                      TEXT('Adresse 2')
     A            MJPSTE      0030A
     A                                      COLHDG('Poststed')
     A                                      TEXT('Poststed')
     A            MJODAT    R               REFFLD(LÅODAT)
6.10 A            MJOTIM    R               REFFLD(LÅOTIM)
6.10 A            MJOUSR    R               REFFLD(LÅOUSR)
     A            MJEDAT    R               REFFLD(LÅEDAT)
     A            MJETIM    R               REFFLD(LÅETIM)
     A            MJEUSR    R               REFFLD(LÅEUSR)
      *
      * Lagerlokasjon                       (MD)
      *
     A            MDFIRM    R               REFFLD(LÅFIRM)
     A            MDLAGE    R               REFFLD(LÅLAGE)
     A            MDLOKA      0008A         COLHDG('Lagerlokasjon')
     A                                      TEXT('Lagerlokasjon')
     A            MDLBES      0030A         COLHDG('Lok.beskr.')
     A                                      TEXT('Lok. besk.')
     A            MDEUSR    R               REFFLD(LÅEUSR)
     A            MDODAT    R               REFFLD(LÅODAT)
6.10 A            MDOTIM    R               REFFLD(LÅOTIM)
6.10 A            MDOUSR    R               REFFLD(LÅOUSR)
     A            MDEDAT    R               REFFLD(LÅEDAT)
     A            MDETIM    R               REFFLD(LÅETIM)
6.27  *
6.27  *  Synkronisering ordre/bestilling    (LAF)
6.27  *
6.27 A            LAFFIR    R               REFFLD(LÅFIRM)
6.27 A            LAFTYP         1A
6.27 A                                      COLHDG('Type')
6.27 A                                      TEXT('Type')
6.27 A            LAFCHK         1A
6.27 A                                      COLHDG('Rekalk' 'kostpr')
6.27 A                                      TEXT('Rekalk. kostpris')
6.27 A            LAFCHA         1A
6.27 A                                      COLHDG('Antall')
6.27 A                                      TEXT('Endre antall')
6.27 A            LAFCHL         1A
6.27 A                                      COLHDG('Nye linjer')
6.27 A                                      TEXT('Nye linjer')
6.27 A            LAFVAR         1A
6.27 A                                      COLHDG('Varsling')
6.27 A                                      TEXT('Vrasling')
6.27 A            LAFITY         2A
6.27 A                                      COLHDG('Infokode')
6.27 A                                      TEXT('Infokode')
6.XX A            LAFGFR    R               REFFLD(LÅODAT)
6.XX A                                      COLHDG('Gjelder fra')
6.XX A                                      TEXT('Gjelder fra')
6.27 A            LAFODA    R               REFFLD(LÅODAT)
6.27 A            LAFOTI    R               REFFLD(LÅOTIM)
6.27 A            LAFOUS    R               REFFLD(LÅOUSR)
6.27 A            LAFEDA    R               REFFLD(LÅEDAT)
6.27 A            LAFETI    R               REFFLD(LÅETIM)
6.27 A            LAFEUS    R               REFFLD(LÅEUSR)
6.31  *
6.31  *  Leverandør-tilleggsdager-register   (LPG)
6.31  *
6.31 A            LPGFIR    R               REFFLD(LÅFIRM)
6.31 A            LPGLDO    R               REFFLD(LÅLDOR)
6.31 A            LPGLAG    R               REFFLD(LÅLAGE)
6.31 A            LPGDAG         3S 0
6.31 A                                      COLHDG('Dager')
6.31 A                                      TEXT('Dager')
6.31 A            LPGEDA    R               REFFLD(LÅEDAT)
6.31 A            LPGETI    R               REFFLD(LÅETIM)
6.31 A            LPGEUS    R               REFFLD(LÅUSER)
6.31 A            LPGODA    R               REFFLD(LÅODAT)
6.31 A            LPGOTI    R               REFFLD(LÅOTIM)
6.31 A            LPGOUS    R               REFFLD(LÅUSER)
6.39  *
6.39  * BATCHREGISTER - FILTRERING         (L1)
6.39  *
6.39 A            L1FIRM    R               REFFLD(LÅFIRM)
6.39 A            L1BATC        10A         TEXT('Tellebatch')
6.39 A                                      COLHDG('Tellebatch')
6.39 A            L1LAGE         2  0       TEXT('Filtreringslager')
6.39 A                                      COLHDG('Filtreringslager')
6.39  *
6.39 A            L1ODAT    R               REFFLD(LÅODAT)
6.39 A            L1OTIM    R               REFFLD(LÅOTIM)
6.39 A            L1OUSR    R               REFFLD(LÅOUSR)
6.39 A            L1EDAT    R               REFFLD(LÅEDAT)
6.39 A            L1ETIM    R               REFFLD(LÅETIM)
6.39 A            L1EUSR    R               REFFLD(LÅEUSR)
      *
