      *
      *  Fast-bestillingstekst-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R LFTXPFR
     A            LJFIRM    R
     A            LJNUMM    R
     A            LJREFX    R
     A            LJSL01    R
     A            LJSL02    R
     A            LJSL03    R
     A            LJSL04    R
     A            LJSL05    R
     A            LJSL06    R
     A            LJSL07    R
     A            LJSL08    R
     A            LJSL09    R
     A            LJSL10    R
     A            LJSL11    R
     A            LJSL12    R
     A            LJSL13    R
     A            LJSL14    R
     A            LJSL15    R
     A            LJSL16    R
     A            LJSL17    R
     A            LJSL18    R
6.10 A            LJODAT    R
6.10 A            LJOTIM    R
6.10 A            LJOUSR    R
6.10 A            LJEDAT    R
6.10 A            LJETIM    R
6.10 A            LJEUSR    R
