      *
      *  Fast-bestillingstekst-register      Index=Read
      *
     A          R LFTXPFR
     A                                      PFILE(*LIBL/LFTXPF)
      *
     A          K LJFIRM
     A          K LJNUMM
