      *
      * GLN KOBLINGSFIL
      *
     A                                      UNIQUE
     A          R LGLNPFR                   PFILE(*LIBL/LGLNPF)
      *
     A          K LGLFIR    R
     A          K LGLHOV    R
     A          K LGLUND    R
