      *
      * GLN koblingsfil
      *
     A          R LGLNPFR
     A            LGLFIR         3S 0       TEXT('Firma')
     A            LGLHOV        13S 0       TEXT('HovedGLN')
     A            LGLUND        13S 0       TEXT('UnderGLN')
     A            LGLTEK        30A         TEXT('Under tekst')
     A            LGLODA          L         TEXT('Opprettet dato')
     A            LGLOTI          T         TEXT('Opprettet tidspkt')
     A            LGLOUS        10A         TEXT('Opprettet av')
     A            LGLEDA          L         TEXT('Endringsdato')
     A            LGLETI          T         TEXT('Endringstidspunkt')
     A            LGLEUS        10A         TEXT('Endret av')
