      *
      *  ORDER EDI KOBL.TABL     Index=Read
      *
     A          R LKOBPFR
     A                                      PFILE(*LIBL/LKOBPF)
      *  Nøkkel
     A          K LXFIRM
     A          K LXAARR
     A          K LXORNR
     A          K LXORSU
