      *  ORDER EDI KOBL.TABL     Index=Read
     A*
     A          R LKOBPFR                   PFILE(LKOBPF)
      * Nøkkel
     A          K LXFIRM
     A          K LXAARR
     A          K LXORNR
     A          K LXORSU
