     A*
     A*  Kunderr - tillegsregister
     A*
     A*
     A          R LKOBPFR
     A            LXFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A            LXAARR         4S 0       TEXT('År')
     A                                      COLHDG('År')
     A            LXORNR         8S 0       TEXT('Ordrenr')
     A                                      COLHDG('Ordrenr')
     A            LXORSU         2S 0       TEXT('Suffix')
     A                                      COLHDG('Suffix')
     A            LXMNUM         8S 0       TEXT('Meld.num')
     A                                      COLHDG('Meld.num')
     A            LXEDAT          L         TEXT('Endret dato')
     A                                      COLHDG('Endret dato')
     A            LXETIM          T         TEXT('Endret tidspkt')
     A                                      COLHDG('Endret tidspkt.')
     A            LXEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
     A            LXODAT          L         TEXT('Oppretet dato')
     A                                      COLHDG('Opprettet dato')
     A            LXOTIM          T         TEXT('Opprettet tidspkt')
     A                                      COLHDG('Opprettet tidspkt.')
     A            LXOUSR        10A         TEXT('Opprettet av')
     A                                      COLHDG('Opprettet av')
