      *
      *  Leverandør-distribusjon-liste
      *
      *  240912 BOF Utvidelse i forb. NEB
6.NU  *  220514 BOF UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/LFRF)
     A          R LLDIPFR
     A            LPFIRM    R
     A            LPLDOR    R
     A            LPLAGE    R
     A            LPTYPE    R
     A            LPFORM    R
     A            LPMOTT    R
     A            LPMAIL    R
     A            LPFAXN    R
     A            LPLKNR    R
     A            LPOTYP    R
     A            LPFTPR    R
     A            LPSIBE    R
     A            LPSIDA    R
     A            LPSIKL    R
6.20 A            LPNEBG    R
     A            LPEDAT    R
     A            LPETIM    R
     A            LPEUSR    R
