      *
      *  Leverandør-distribusjons-liste         Index=Read
      *
     A                                      UNIQUE
     A          R LLDIPFR
     A                                      PFILE(*LIBL/LLDIPF)
      *
     A          K LPFIRM
     A          K LPLDOR
     A          K LPLAGE
