      *
      * LEVERANDØRS DISTRIBUSJONSINFO - NEB
      *
     A          R LLDNPFR                   PFILE(*LIBL/LLDNPF)
      *
     A          K LNFIRM
     A          K LNLDOR
     A          K LNLAGE
