      *
      * Tilleggsinformasjon pr leverandør
      *
      *---------------------------------------------------------------*
      *K000 031022 bsa Ordretype for retur av varer                   *
      *K000 071122 bsa Ordreinfokode ved oppdatering av edi pakkseddel*
      *                                                               *
      *---------------------------------------------------------------*
      *
     A                                      REF(*LIBL/FFRF)
     A          R LLDNPFR
     A            LNFIRM         3S 0
     A            LNLDOR         6S 0
     A            LNLAGE         2A
     A            LNAOBK    R               REFFLD(FÅJANE)
     A                                      TEXT('Aut OBKR')
     A            LNAPAK    R               REFFLD(FÅJANE)
     A                                      TEXT('Aut PAKK')
     A            LNAFAK    R               REFFLD(FÅJANE)
     A                                      TEXT('Aut FAKT')
     A            LNLOGN    R               REFFLD(FÅJANE)
     A                                      TEXT('Bruke logistikknr')
     A            LNNOTY         2A         TEXT('Ordretype')
     A                                      COLHDG('OT')
     A            LNITYP         2A         TEXT('Ordreinfokode')
     A                                      COLHDG('OI kode')
     A            LNODAT          L         TEXT('Opprettet dato')
     A            LNOTIM          T         TEXT('Opprettettidspunkt')
     A            LNOUSR        10A
     A            LNEDAT          L         TEXT('Endringsdato')
     A            LNETIM          T         TEXT('Endringstidspunkt')
     A            LNEUSR        10A
      *
