      *
      * Lager-trans-linje-register          Index=Read
      *
     A          R LLDTPFR
     A                                      PFILE(*LIBL/LLDTPF)
      *
     A          K LSFIRM
     A          K LSNUMM
     A          K LSVARE
     A          K LSLINE
