      *
      *  Lager-trans-hode-register              Index=Update
      *
     A                                      UNIQUE
     A          R LLHEPFR
     A                                      PFILE(*LIBL/LLHEPF)
      *
     A          K LQFIRM
     A          K LQNUMM
