      *
      *  Lager-trans-hode-register
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/LFRF)
     A          R LLHEPFR
     A            LQFIRM    R
     A            LQNUMM    R
     A            LQTYPE    R
     A            LQLAGE    R
     A            LQLAST    R
     A            LQTEXT    R
     A            LQXRKO    R
     A            LQWSID    R
     A            LQUSER    R
     A            LQDATE    R
     A            LQTIME    R
     A            LQUTSK    R
     A            LQKODE    R
6.10 A            LQEDAT    R
6.10 A            LQETIM    R
6.10 A            LQEUSR    R
