      *
      * Fil for logging av best.forløp
      *
     A          R LLOGPFR                   PFILE(*LIBL/LLOGPF)
      *
     A          K LMFIRM
     A          K LMNUMM
     A          K LMSUFF
     A          K LMKODE
     A          K LMDATE
     A          K LMTIME
