      *
      * Best.-Logg-Koder
      *
     A                                      REF(*LIBL/LFRF)
     A          R LLOKPFR
     A            LNFIRM    R
     A            LNTYPE    R
     A            LNTEXT    R
     A            LNEDAT    R
     A            LNETIM    R
     A            LNEUSR    R
