      *
      * Best.-Logg-Koder
      *
     A          R LLOKPFR                   PFILE(*LIBL/LLOKPF)
      *
     A          K LNFIRM
     A          K LNTYPE
