      *
      *  Bestillings-linje-register     Index=Update
      *
     A                                      UNIQUE
     A          R LODTPFR
     A                                      PFILE(*LIBL/LODTPF)
      *
     A          K LDFIRM
     A          K LDNUMM
     A          K LDSUFF
     A          K LDLINE
