      *
      *  Bestillings-linje-register     Index=Ordre/Suffix/Linje
      *
     A          R LODTPFR
     A                                      PFILE(*LIBL/LODTPF)
      *
     A          K LDFIRM
     A          K LDORNU
     A          K LDORSU
     A          K LDORLI
