      *
      *  Bestillings-linje-register     Index=Varenummer
      *
     A          R LODTPFR
     A                                      PFILE(*LIBL/LODTPF)
      *
     A          K LDFIRM
     A          K LDVARE
     A          K LDNUMM
     A          K LDSUFF
     A          K LDENH1
