      *
      *  Bestilling-linje-register  Index=Leverandør&Bestnr
      *
     A          R LODTPFR
     A                                      PFILE(*LIBL/LODTPF)
      *
     A          K LDFIRM
     A          K LDLDOR
     A          K LDNUMM
     A          K LDSUFF
     A          K LDLINE
