      *
      *  Bestilling-linje
      *
     A          R LODTPFR                   PFILE(*LIBL/LODTPF)
      *
     A          K LDFIRM
     A          K LDLAGE
     A          K LDVARE
     A          K LDEDAT
