      *
      *  Bestillings-hode-register      Index=Lev.onr
      *
     A          R LOHEPFR
     A                                      PFILE(*LIBL/LOHEPF)
      *
     A          K LOFIRM
     A          K LOSORN
     A          K LOBDAT                    DESCEND
