      *
      *  Bestillings-hode-register      Index=Read
      *
     A          R LOHETRR
     A                                      PFILE(*LIBL/LOHETR)
      *
     A          K LOFIRM
     A          K LONUMM
     A          K LOSUFF
