      *
      *  Bestillings-hode-register      Index=Ordrenummer
      *
     A          R LOHEPFR
     A                                      PFILE(*LIBL/LOHEPF)
      *
     A          K LOFIRM
     A          K LOORNR
     A          K LOORSU
     A          K LONUMM
     A          K LOSUFF
