      *
      *  Bestillings-hode-register      Index=Bestillingsdato
      *
     A          R LOHEPFR
     A                                      PFILE(*LIBL/LOHEPF)
      *
     A          K LOFIRM
     A          K LOBDAT
     A          K LONUMM
     A          K LOSUFF
