      *
      *  Bestillings-hode-register      Index=Leverandør+Vareadresse
      *
     A          R LOHEPFR
     A                                      PFILE(*LIBL/LOHEPF)
      *
     A          K LOFIRM
     A          K LOLENA
     A          K LONAVN
     A          K LONUMM
     A          K LOSUFF
