      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
6.20  * R6.20 111010 NHO  Nye felter i forbindelse  med prosjekt
6.NU  * R6.30 220514 BOF  UTVIDELSE NUMMERSERIE
6.33  * R6.30 220914 BSA  Utvidet med kontaktperson i bestillingshodet
      *
      *
      *  Bestillings-hode-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R LOHEPFR
     A            LOFIRM    R
     A            LONUMM    R
     A            LOSUFF    R
     A            LOLINE    R
     A            LOOTYP    R
     A            LOLAGE    R
     A            LOBINR    R
     A            LOBITX    R
     A            LOKIDI    R
     A            LOKREF    R
     A            LOBDAT    R
     A            LOLDAT    R
     A            LOFKDA    R
     A            LOFFDA    R
     A            LOPERI    R
     A            LOMODA    R
     A            LOVIDA    R
     A            LOBETB    R
     A            LOINNK    R
     A            LODIST    R
     A            LOLMAT    R
     A            LOLBET    R
     A            LOVALK    R
     A            LORKAT    R
     A            LOSPED    R
     A            LOKJOR    R
     A            LOMKOD    R
     A            LOLELE    R
     A            LOLDOR    R
     A            LOLENA    R
     A            LONAVN    R
     A            LOADR1    R
     A            LOADR2    R
     A            LOSTED    R
     A            LOAVDE    R
     A            LOKONT    R
     A            LOSPES    R
     A            LOPROJ    R
     A            LOAKTI    R
     A            LOLOPP    R
     A            LOBSEN    R
     A            LOBSDA    R
     A            LOBSAV    R
     A            LOKFAK    R
     A            LOKSPR    R
     A            LOVREF    R
     A            LODREF    R
6.33 A            LOKPNR    R
     A            LOREKV    R
     A            LOLMTX    R
     A            LOLBTX    R
     A            LORABP    R
     A            LOORNR    R
     A            LOORSU    R
     A            LONETT    R
     A            LOBRUT    R
     A            LOKOLI    R
     A            LOKONR    R
     A            LOTOTX    R
     A            LOTOTF    R
     A            LOTOTI    R
     A            LOTOTR    R
     A            LOTOTK    R
     A            LOWSID    R
     A            LOUSER    R
     A            LODATE    R
     A            LOTIME    R
     A            LOKODE    R
     A            LOKOWS    R
     A            LOKOUS    R
     A            LOKODA    R
     A            LOKOTI    R
     A            LOBIND    R
     A            LOLADR    R
     A            LOKORN    R
     A            LOFLEV    R
     A            LOSORN    R
     A            LOSFAK    R
6.29 A            LOMNUM    R
     A            LOFLOW    R
6.29 A            LOKAMP    R
6.10 A            LOEDAT    R
6.10 A            LOETIM    R
6.10 A            LOEUSR    R
6.20 A            LOARBO    R
