      *
      *  Bestillings-hode-register      Index=Leverandør+best.nr.
      *
     A          R LOHEPFR
     A                                      PFILE(*LIBL/LOHEPF)
      *
     A          K LOFIRM
     A          K LOLDOR
     A          K LONUMM
     A          K LOSUFF
