      *
      *  Bestillings-tekst-register     Index=Read
      *
     A          R LOTXPFR
     A                                      PFILE(*LIBL/LOTXPF)
      *
     A          K LTFIRM
     A          K LTNUMM
     A          K LTSUFF
     A          K LTLINE
