      *
      *  Overføringsfil til økonomisystemet Index=Read
      *
     A          R LOVFPFR
     A                                      PFILE(*LIBL/LOVFPF)
      *
     A          K LGFIRM
     A          K LGPERI
