      *
      *  Overføringsfil til økonomisystemet Index=Read
      *
     A          R LOVIPFR
     A                                      PFILE(*LIBL/LOVIPF)
      *
     A          K LGFIRM
     A          K LGPERI
     A          K LGBILN
     A          K LGDKTO
     A          K LGCKTO
