      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
6.20  * R6.20 101010 NHO  Nye felter i forbilndelse med prosjekt
6.20  * R6.20 100912 LOVF  Summert
6.32  * R6.30 170914 BSA  UTVIDELSE IFBM MVA POSTERING
      *
     A                                      REF(*LIBL/LFRF)
     A          R LOVUPFR
     A            LGFIRM    R
     A            LGPERI    R
     A            LGBUNT    R
     A            LGBILN    R
     A            LGBILL    R
     A            LGBDAT    R
     A            LGFDAT    R
     A            LGBILK    R
     A            LGTEXT    R
     A            LGDAVD    R
     A            LGDKTO    R
     A            LGDSPS    R
     A            LGDMOM    R
     A            LGBELP    R
6.32 A            LGMVAG    R
     A            LGCAVD    R
     A            LGCKTO    R
     A            LGCSPS    R
     A            LGCMOM    R
     A            LGPROJ    R
     A            LGAKTI    R
     A            LGKREF    R
     A            LGKUND    R
     A            LGVALK    R
     A            LGVALB    R
     A            LGMNGK    R
     A            LGMNGD    R
     A            LGAUTX    R
     A            LGKIDI    R
     A            LGSFAK    R
6.20 A            LGUPRO    R
6.20 A            LGARBO    R
