      *
      *  Utplukk-linje-register   Index=Read
      *
     A          R LPLLPFR
     A                                      PFILE(*LIBL/LPLLPF)
      *
     A          K LKLFIR
     A          K LKLONR
     A          K LKLSUF
     A          K LKLLIN
