      *
      *  Utplukk-param-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R LPLOPFR
     A            LKPFIR    R
     A            LKPONR    R
     A            LKPSUF    R
     A            LKPOTY    R
     A            LKPLAG    R
     A            LKPWSD    R
     A            LKPUSR    R
     A            LKPALT    R
     A            LKPDIR    R
     A            LKPRES    R
     A            LKPTXT    R
     A            LKPKOL    R
     A            LKPNET    R
     A            LKPBRU    R
     A            LKPLMT    R
     A            LKPFPR    R
     A            LKPFTE    R
     A            LKPEPR    R
     A            LKPETE    R
