      *
      *  Utplukk-param-register   Index=Ordretype
      *
     A          R LPLOPFR
     A                                      PFILE(*LIBL/LPLOPF)
      *
     A          K LKPFIR
     A          K LKPOTY
     A          K LKPONR
     A          K LKPSUF
