      *
      *  Utplukk-param-register   Index=Update
      *
     A          R LPLOPFR
     A                                      PFILE(*LIBL/LPLOPF)
      *
     A          K LKPFIR
     A          K LKPONR
     A          K LKPSUF
