      *
      *  Plukk-1-linje-register   Index=Read
      *
     A          R LPM1PFR
     A                                      PFILE(*LIBL/LPM1PF)
      *
     A          K LK1FIR
     A          K LK1WSD
     A          K LK1USR
     A          K LK1LST
