      *
      *  Plukk-1-linje-register
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/LFRF)
     A          R LPM1PFR
     A            LK1FIR    R
     A            LK1WSD    R
     A            LK1USR    R
     A            LK1LST    R
     A            LK1UTQ    R
     A            LK1OTY    R
     A            LK1ONR    R
     A            LK1SUF    R
     A            LK1VG0    R
     A            LK1VG1    R
     A            LK1VG2    R
     A            LK1VG3    R
     A            LK1PER    R
     A            LK1DAT    R
