      *
      *  Plukk-2-linje-register   Index=Update
      *
     A          R LPM2PFR
     A                                      PFILE(*LIBL/LPM2PF)
      *
     A          K LK2FIR
