      *
      *  Lagerplukkområde-register
      *
     A                                      REF(*LIBL/FFRF)
     A          R LPOMPFR
      *
     A            LPOFIR    R               REFFLD(FÅFIRM)
     A            LPOLAG    R               REFFLD(FÅLAGE)
     A            LPOOGR    R               REFFLD(FÅOGRP)
     A            LPOHGR    R               REFFLD(FÅHGRP)
     A            LPOUGR    R               REFFLD(FÅUGRP)
     A            LPOMOD    R               REFFLD(FÅMODN)
     A            LPOVAR    R               REFFLD(FÅVARE)
     A            LPOPOM        10A         TEXT('Plukkområde')
     A                                      COLHDG('Plukkområde')
     A            LPOTXT        30A         TEXT('Beskrivelse')
     A                                      COLHDG('Beskrivelse')
     A            LPORLA    R               REFFLD(FÅLAGE)
     A                                      TEXT('RDS lager')
     A                                      COLHDG('RDS lager')
      *
     A            LPOEDA    R               REFFLD(FÅEDAT)
     A            LPOETI    R               REFFLD(FÅETIM)
     A            LPOEUS    R               REFFLD(FÅEUSR)
     A            LPOODA    R               REFFLD(FÅODAT)
     A            LPOOTI    R               REFFLD(FÅOTIM)
     A            LPOOUS    R               REFFLD(FÅOUSR)
