      *
      * Plukkområde
      *
     A          R LPOMPFR
     A                                      PFILE(*LIBL/LPOMPF)
      *
     A          K LPOFIR
     A          K LPOPOM
     A          K LPOLAG
