      *
      * PÅSLAGSKATEGORI
      *
     A          R LPSKPFR                   PFILE(*LIBL/LPSKPF)
      *
     A          K PQFIRM
     A          K PQBESK
