      *
      * PÅSLAGSKODE
      *
     A                                      REF(*LIBL/MFRF)
     A          R LPSKPFR
     A            PQFIRM    R
     A            PQPKAT    R
     A            PQBESK    R
     A            PQODAT    R
     A            PQOTIM    R
     A            PQOUSR    R
     A            PQEDAT    R
     A            PQETIM    R
     A            PQEUSR    R
