      *
      * PÅSLAGSMATRISE
      *
     A                                      REF(*LIBL/MFRF)
     A          R LPSMPFR
     A            PRFIRM    R
     A            PRPRGR    R
     A            PRPKAT    R
     A            PRKKAT    R
     A            PRKUND    R
     A            PRKPRO    R
     A            PROGRP    R
     A            PRHGRP    R
     A            PRUGRP    R
     A            PRLDOR    R
     A            PRMODN    R
     A            PRVARE    R
     A            PRENHE    R
     A            PRLETY    R
     A            PRNOTA    R
     A            PRPSLM    R
     A            PRRAB1    R
     A            PRRA1D    R
     A            PRRA1F    R
     A            PRRA1T    R
     A            PRRAB2    R
     A            PRRA2D    R
     A            PRRA2F    R
     A            PRRA2T    R
     A            PRRABN    R
     A            PRRAND    R
     A            PRRANF    R
     A            PRRANT    R
     A            PRRABB    R
     A            PRRABD    R
     A            PRRBUF    R
     A            PRRBUT    R
     A            PRRABT    R
     A            PRRATD    R
     A            PRRATF    R
     A            PRRATT    R
     A            PRDEKN    R
     A            PRDEKD    R
     A            PRDEKF    R
     A            PRDEKT    R
     A            PRODAT    R
     A            PROTIM    R
     A            PROUSR    R
     A            PREDAT    R
     A            PRETIM    R
     A            PREUSR    R
