      *
      * PÅSLAGSMATRISE
      *
     A          R LPSMPFR                   PFILE(*LIBL/LPSMPF)
      *
     A          K PRFIRM
     A          K PRLETY
     A          K PRPKAT
     A          K PRKKAT
     A          K PRKUND
     A          K PRKPRO
     A          K PROGRP
     A          K PRHGRP
     A          K PRUGRP
     A          K PRLDOR
     A          K PRMODN
     A          K PRVARE
     A          K PRPRGR
     A          K PRENHE
