      *
      *  Plukk-S-linje-register   Index=Update
      *
     A          R LPSOPFR
     A                                      PFILE(*LIBL/LPSOPF)
      *
     A          K LKSFIR
     A          K LKSONR
     A          K LKSSUF
     A          K LKSTLL
     A          K LKSLIN
