      *
      *  Plukk-S-linje-register
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/LFRF)
     A          R LPSOPFR
     A            LKSFIR    R
     A            LKSONR    R
     A            LKSSUF    R
     A            LKSTLL    R
     A            LKSLIN    R
     A            LKSKOD    R
     A            LKSOTY    R
     A            LKSALT    R
     A            LKSSRT    R
     A            LKSANT    R
     A            LKSDIV    R
