      *
      * PÅSLAGSKATEGORI PR KUNDE
      *
     A          R LPSPPFR                   PFILE(*LIBL/LPSPPF)
      *
     A          K PSFIRM
     A          K PSPKAT
