      *
      *  Lagertelling-hjelpe-register           Index=Read
      *
     A          R LPSTPFR
     A                                      PFILE(*LIBL/LPSTPF)
      *
     A          K LZFIRM
     A          K LZVARE
     A          K LZLAGE
