      *
      *  Lagertelling-hjelpe-register           Index=Sortering
      *
     A          R LPSTPFR
     A                                      PFILE(*LIBL/LPSTPF)
      *
     A          K LZFIRM
     A          K LZSORT
     A          K LZVARE
     A          K LZLAGE
