      *
      *  Lagertelling-hjelpe-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R LPSTPFR
     A            LZFIRM    R
     A            LZVARE    R
     A            LZLAGE    R
     A            LZOGRP    R
     A            LZHGRP    R
     A            LZUGRP    R
     A            LZPLAS    R
     A            LZSORT    R
     A            LZTEK1    R
     A            LZENH1    R
     A            LZANTL    R
