      *
      *  Synkronisering ordre/bestilling
      *
     A                                      REF(*LIBL/LFRF)
     A          R LSBOPFR
     A            LAFFIR    R
     A            LAFTYP    R
     A            LAFCHK    R
     A            LAFCHA    R
     A            LAFCHL    R
     A            LAFVAR    R
     A            LAFITY    R
6.2A A            LAFGFR    R
     A            LAFODA    R
     A            LAFOTI    R
     A            LAFOUS    R
     A            LAFEDA    R
     A            LAFETI    R
     A            LAFEUS    R
