      *
      *  Parametre synkronisering ordre/best   Index=Update
      *
     A          R LSBOPFR
     A                                      PFILE(*LIBL/LSBOPF)
      *
     A          K LAFFIR
