      *
      *  Lagerutskrift-hjelpe-register          Index=Sortering
      *
     A          R LSORPFR
     A                                      PFILE(*LIBL/LSORPF)
      *
     A          K LWFIRM
     A          K LWLAGE
     A          K LWSSUM
     A          K LWOGRP
     A          K LWHGRP
     A          K LWUGRP
     A          K LWVARE
     A          K LWNUMM
     A          K LWLAGR
