      *
      *  Lagerutskrift-hjelpe-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R LSORPFR
     A            LWFIRM    R
     A            LWLAGE    R
     A            LWVARE    R
     A            LWNUMM    R
     A            LWLAGR    R
     A            LWOGRP    R
     A            LWHGRP    R
     A            LWUGRP    R
     A            LWSSUM    R
     A            LWSPNY    R
     A            LWKPNY    R
     A            LWENH1    R
     A            LWANTT    R
     A            LWANTL    R
     A            LWTEK1    R
     A            LWTIMS    R
