      *
      * Liste over member som skal compileres ved inst. av ny korr
      *
     A          R LSTMPFR                   PFILE(LSTMPF)
      *
      * NØKKEL
      *
     A          K KOBIBL
     A          K KOMEMB
     A          K KONUMM
