      *
      * Liste over member som skal compileres ved inst. av ny korr
      *
     A          R LSTMPFR
     A            KOBIBL        10          COLHDG('Bibliotek')
     A            KOMEMB        10          COLHDG('Program')
     A            KOTYPE        10          COLHDG('Type Prog')
     A            KONUMM         2          COLHDG('Sekv.nr')
     A            KOCOMP          L         COLHDG('Dato compet')
     A            KODATO          L         COLHDG('SLUTT DATO')
     A            KOTIME          T         COLHDG('SLUTT KL')
     A            KOUSER        10          COLHDG('Bruker')
