      *
      *  Lager-kode-register       Index=Update
      *
     A                                      UNIQUE
     A          R LSTSPFR
     A                                      PFILE(*LIBL/LSTSPF)
      *
     A          K LAAFIR
