      *
      *  Lager-kode-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R LSTSPFR
     A            LAAFIR    R
     A            LAABRK    R
     A            LAABIN    R
     A            LAABIC    R
     A            LAAFOR    R
     A            LAADEL    R
     A            LAALSM    R
     A            LAABAT    R
     A            LAABUN    R
     A            LAATEL    R
     A            LAATBU    R
     A            LAABND    R
     A            LAAOTY    R
     A            LAALTY    R
     A            LAATTY    R
     A            LAAMVA    R
     A            LAAENL    R
     A            LAAENS    R
     A            LAALAG    R
     A            LAAHLA    R
     A            LAAHOY    R
     A            LAATYK    R
     A            LAALIK    R
     A            LAAOVF    R
     A            LAALEV    R
     A            LAALNR    R
     A            LAAVNR    R
     A            LAABIL    R
     A            LAABIK    R
     A            LAABIF    R
     A            LAADES    R
     A            LAASAK    R
     A            LAASA1    R
     A            LAASA2    R
     A            LAASAO    R
     A            LAAKHV    R
     A            LAAOT1    R
     A            LAAOT2    R
     A            LAAOT3    R
     A            LAAOT4    R
     A            LAAOT5    R
     A            LAARK1    R
     A            LAARK2    R
     A            LAARK3    R
     A            LAARK4    R
     A            LAARK5    R
     A            LAARK6    R
     A            LAARK7    R
     A            LAARK8    R
     A            LAAADA    R
     A            LAAOTM    R
     A            LAABST    R
     A            LAAABE    R
6.13 A            LAAKSO    R
6.23 A            LAALDS    R
6.25 A            LAAEDS    R
6.10 A            LAAODA    R
6.10 A            LAAOTI    R
6.10 A            LAAOUS    R
6.10 A            LAAEDA    R
6.10 A            LAAETI    R
6.10 A            LAAEUS    R
