      *
      *  Lager-kode-register       Index=Read
      *
     A          R LSTSPFR
     A                                      PFILE(*LIBL/LSTSPF)
      *
     A          K LAAFIR
