      *
      * Lagertelling-telle-register         Index=Vare
      *
     A          R LTELPFR
     A                                      PFILE(*LIBL/LTELPF)
      *
     A          K LEFIRM
     A          K LEVARE
