      *
      *  Lagertelling-telle-register            Index=Varenummer
      *
     A          R LTELPFR
     A                                      PFILE(*LIBL/LTELPF)
      *
     A          K LEFIRM
     A          K LEBATC
     A          K LENUMM
     A          K LESUFF
     A          K LEVARE
     A          K LELAGE
     A          K LEDLOP
