      *
      *  Lagertelling-telle-register            Index=Read
      *
     A          R LTELPFR
     A                                      PFILE(*LIBL/LTELPF)
      *
     A          K LEFIRM
     A          K LEBATC
     A          K LENUMM
     A          K LESUFF
     A          K LELINE
