      *
      *  Toleransegrenser/EDI      Index=Update
      *
     A                                      UNIQUE
     A          R LTOEPFR
     A                                      PFILE(*LIBL/LTOEPF)
      *
     A          K LAEFIR
