      *
      *  Toleransegrenser/EDI
      *
     A                                      REF(*LIBL/LFRF)
     A          R LTOEPFR
     A            LAEFIR    R
     A            LAETG0    R
     A            LAETG1    R
     A            LAETG2    R
     A            LAETG3    R
     A            LAETG4    R
     A            LAEAV1    R
     A            LAEAV2    R
     A            LAEAV3    R
     A            LAEAV4    R
     A            LAEAV5    R
6.24 A            LAEFOB    R
6.24 A            LAEODA    R
6.24 A            LAEOTI    R
6.24 A            LAEOUS    R
6.24 A            LAEEDA    R
6.24 A            LAEETI    R
6.24 A            LAEEUS    R
