      *
      *  Bestillings-bruker-register     Index=Update
      *
     A                                      UNIQUE
     A          R LUSRPFR
     A                                      PFILE(*LIBL/LUSRPF)
      *
     A          K LBFIRM
     A          K LBUSER
