      *
      *  Bestillings-bruker-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R LUSRPFR
     A            LBFIRM    R
     A            LBUSER    R
     A            LBBIND    R
     A            LBOTYP    R
     A            LBCBES    R
     A            LBVISE    R
     A            LBKO01    R
     A            LBKO02    R
     A            LBKO03    R
     A            LBKO04    R
6.10 A            LBKO05    R
6.10 A            LBKO06    R
6.10 A            LBKO07    R
6.10 A            LBKO08    R
6.10 A            LBKO09    R
6.10 A            LBKO10    R
6.20 A            LBKO11    R
6.20 A            LBKO12    R
6.20 A            LBKO13    R
6.20 A            LBKO14    R
6.20 A            LBKO15    R
     A            LBTANS    R
     A            LBBOTY    R
     A            LBBSTS    R
     A            LBBSLG    R
     A            LBBLEV    R
     A            LBFLOW    R
     A            LBCTRL    R
6.10 A            LBODAT    R
6.10 A            LBOTIM    R
6.10 A            LBOUSR    R
6.10 A            LBEDAT    R
6.10 A            LBETIM    R
6.10 A            LBEUSR    R
