      *
      *  Arbeidsregister - Lager
      *
     A                                      REF(*LIBL/LFRF)
     A          R LWA1PFR
     A            MLFIRM    R
     A            MLVARE    R
     A            MLLAGE    R
     A            MLPLAS    R
     A            MLENHL    R
     A            MLPAKK    R
     A            MLOORD    R
     A            MLORES    R
     A            MLBBES    R
     A            MLBRES    R
     A            MLINNG    R
     A            MLUTTA    R
     A            MLJUST    R
     A            MLTELL    R
     A            MLSALG    R
     A            MLRETU    R
     A            MLB101    R
     A            MLBEHL    R
     A            MLBEVE    R
     A            MLKPNY    R
     A            MLMINI    R
     A            MLMAKS    R
     A            MLLTID    R
     A            MLBPUN    R
     A            MLBMEN    R
     A            MLSIKL    R
     A            MLTRDA    R
     A            MLOPDA    R
     A            MLSDAT    R
      *
     A            MLSPRI    R
     A            MLKPRI    R
     A            MLIPRI    R
     A            MLOMST    R
     A            MLKOST    R
     A            MLINKT    R
     A            MLDEKT    R
     A            MLLAGV    R
     A            MLOGRP    R
     A            MLHGRP    R
     A            MLUGRP    R
     A            MLKHEV    R
     A            MLAKEY    R
