      *
      *  Arbeidsregister hyllevarmere, Logisk file for omsetning
      *
     A          R LWA2PFR                   PFILE(LWA2PF)
      * Nøkkel
     A          K MWFIRM
     A          K MWOMST
     A          K MWVARE
