      *
      *  Arbeidsregister ABC-analyse        Index=Read
      *
     A          R LWA2PFR                   PFILE(LWA2PF)
      * Nøkkel
     A          K MWFIRM
     A          K MWOGRP
     A          K MWHGRP
     A          K MWUGRP
     A          K MWVARE
