      *
      *  Historisk-Lagerbok-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R LWA3PFR
     A            MHFIRM    R
     A            MHVARE    R
     A            MHLAGE    R
     A            MHDATO    R
     A            MHTIME    R
     A            MHUSER    R
     A            MHSYST    R
     A            MHKODE    R
     A            MHTYPE    R
     A            MHREFR    R
     A            MHBEHL    R
     A            MHANTA    R
     A            MHENHL    R
     A            MHKPRI    R
     A            MHAKEY    R
