      *
      *  Arbeidsregister Lager              Index=Update
      *
     A          R LWA4PFR                   PFILE(LWA4PF)
      * Nøkkel
     A          K L4FIRM
     A          K L4AKEY
