      *
      *  Arbeidsregister med orfinal varetekst - diversevarer
      *
     A                                      REF(*LIBL/LFRF)
     A          R LWA4PFR
     A            L4FIRM         3S 0       TEXT('Firma')
     A            L4AKEY        65A         TEXT('Nøkkel')
     A            L4TEK1        35A         TEXT('Varetekst')
      *
     A            L4EUSR        10A         TEXT('Endret av')
     A            L4EDAT          L         TEXT('Endret dato')
     A            L4ETIM          T         TEXT('Endret tidspkt.')
     A            L4OUSR        10A         TEXT('Opprettet av')
     A            L4ODAT          L         TEXT('Opprettetdato')
     A            L4OTIM          T         TEXT('Oppretttetidspunkt')
