      *
      * Arbeidsregister abcxyz
      *
     A                                      REF(*LIBL/LFRF)
     A          R LWB1PFR
     A            MWBFIR    R
     A            MWBVAR    R
     A            MWBOGR    R
     A            MWBHGR    R
     A            MWBUGR    R
     A            MWBTK1    R
     A            MWBENH    R
     A            MWBANT    R
     A            MWBAOL    R
     A            MWBSMB    R
     A            MWBSMR    R
     A            MWBSMN    R
     A            MWABPR    R
     A            MWABAP    R
     A            MWXYPR    R
     A            MWXYAP    R
6.10 A            MWBODA    R
6.10 A            MWBOTI    R
6.10 A            MWBOUS    R
6.10 A            MWBEDA    R
6.10 A            MWBETI    R
6.10 A            MWBEUS    R
