      *
      * Arbeidsregister abcxyz
      *
     A          R LWB1PFR                   PFILE(LWB1PF)
      *
     A          K MWBFIR
     A          K MWBSMB                    DESCEND
