      *
      * EDI BESTILLING
      *
     A          R LWEBPFR
     A            BESLIN        80A         TEXT('EDI-linje')
     A                                      COLHDG('EDI-linje')
