      *
      * EDI FAKTURA
      *
     A          R LWEFPFR
     A            FAKLIN        80A         TEXT('EDI-linje')
     A                                      COLHDG('EDI-linje')
     A            FAKMNR         6S 0       TEXT('Meldingsnummer')
     A                                      COLHDG('Meldingsnummer')
