      *
      * EDI FAKTURA
      *
     A          R LWEGPFR
     A            GAKLIN        80A         TEXT('EDI-linje')
     A                                      COLHDG('EDI-linje')
     A            GAKMNR         6S 0       TEXT('Meldingsnummer')
     A                                      COLHDG('Meldingsnummer')
