      *
      *  EDI-BESTILLING Loggfil        Index=Dato,klokke,type
      *
     A          R LWELPFR
     A                                      PFILE(*LIBL/LWELPF)
      *
     A          K LOGIND
     A          K LOGDAT
     A          K LOGTID
     A          K LOGTYP
