      *
      *  EDI-BESTILLING Loggfil        Index=Type,dato,klokke
      *
     A          R LWELPFR
     A                                      PFILE(*LIBL/LWELPF)
      *
     A          K LOGIND
     A          K LOGTYP
     A          K LOGDAT
     A          K LOGTID
