      *
      * EDI BESTILLING
      *
     A          R LWEDPFR
     A            EDILIN        80A         TEXT('EDI-linje')
     A                                      COLHDG('EDI-linje')
