      *
      * Arbeidsfil fra EXCEL
      *
     A          R LEXCPFR
     A            EXCLIN      1024A         TEXT('EX-linje')
     A                                      COLHDG('EX-linje')
