      *
      * Ny Håndholdt trans Bestilling       Index=Read
      *
     A          R LWHBPFR
     A                                      PFILE(*LIBL/LWHBPF)
      *
     A          K MYFIRM
     A          K MYKODE
     A          K MYTIME
     A          K MYLINE
