      *
      *  Arbeidsregister Overvåking         Index=Read
      *
     A          R LWO1PFR                   PFILE(LWO1PF)
      * Nøkkel
     A          K MWOFIR
     A          K MWODAT
     A          K MWOSYS
     A          K MWOONR
     A          K MWOSUF
     A          K MWOLIN
     A          K MWOVNR
