      *
      *  Arbeidsregister Overvåking lager   Index=Read
      *
     A          R LWO2PFR                   PFILE(LWO2PF)
      * Nøkkel
     A          K MWOFIR
     A          K MWODAT
     A          K MWOSYS
     A          K MWOONR
     A          K MWOSUF
     A          K MWOLIN
     A          K MWOVNR
