      *
      *  Arbeidsregister - Overvåking lager
      *
     A                                      REF(*LIBL/LFRF)
     A          R LWO4PFR
     A            MWOFIR    R
     A            MWODAT    R
     A            MWOSYS    R
     A            MWOLIH    R
     A            MWOONR    R
     A            MWOSUF    R
     A            MWOVNR    R
     A            MWOOGR    R
     A            MWOHGR    R
     A            MWOUGR    R
     A            MWOVTX    R
     A            MWOSLG    R
     A            MWOSLN    R
     A            MWOLIN    R
     A            MWOUSR    R
     A            MWOODA    R
     A            MWOTIM    R
