      *
      *  Arbeidsregister Overvåking lager   Index=Read
      *
     A                                      UNIQUE
     A          R LWO4PFR                   PFILE(LWO4PF)
      * Nøkkel
     A          K MWOFIR
     A          K MWODAT
     A          K MWOSYS
     A          K MWOONR
     A          K MWOSUF
     A          K MWOLIN
     A          K MWOVNR
