      *
      *  Arbeidsregister overvåking lager   Index=Read
      *
     A          R LWO6PFR                   PFILE(LWO6PF)
      * Nøkkel
     A          K MWOFIR
     A          K MWODAT
     A          K MWOSYS
     A          K MWOLAG
     A          K MWOVNR
