      *
      *  Arbeidsregister - Overvåking lager
      *
     A                                      REF(*LIBL/LFRF)
     A          R LWO6PFR
     A            MWOFIR    R
     A            MWODAT    R
     A            MWOSYS    R
     A            MWOLAG    R
     A            MWOVNR    R
     A            MWOOGR    R
     A            MWOHGR    R
     A            MWOUGR    R
     A            MWOVTX    R
     A            MWOBEH    R
     A            MWOUSR    R
     A            MWOODA    R
     A            MWOTIM    R
