      *
      *  Arbeidsregister Overvåking         Index=Read
      *
     A                                      UNIQUE
     A          R LWO7PFR                   PFILE(LWO7PF)
      * Nøkkel
     A          K MWOFIR
     A          K MWODAT
     A          K MWOSYS
     A          K MWOVNR
     A          K MWOONR
     A          K MWOSUF
     A          K MWOLIN
