      *
      *  Arbeidsregister Plukking,   Logisk file for varenummer
      *
     A          R LWPLPFR                   PFILE(LWPLPF)
      * Nøkkel
     A          K MKFIRM
     A          K MKNUMM
     A          K MKSUFF
     A          K MKSTAT
     A          K MKLOKA
     A          K MKVARE
