      *
      *  Arbeidsregister plukking           Index=Read
      *
     A          R LWPLPFR                   PFILE(LWPLPF)
      * Nøkkel
     A          K MKFIRM
     A          K MKNUMM
     A          K MKSUFF
     A          K MKLINE
