      *
      *  Arbeidsregister - Varemottak
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/LFRF)
     A          R LWVAPFR
     A            MVFIRM    R
     A            MVNUMM    R
     A            MVSUFF    R
     A            MVLINE    R
     A            MVVARE    R
     A            MVEANN    R
     A            MVLEVR    R
     A            MVENHE    R
     A            MVEKOD    R
     A            MVRKOD    R
     A            MVSTAT    R
      *
