      *
      *  Arbeidsregister Varemottak         Index=Update
      *
     A                                      UNIQUE
     A          R LWVAPFR                   PFILE(LWVAPF)
      * Nøkkel
     A          K MVFIRM
     A          K MVNUMM
     A          K MVSUFF
     A          K MVLINE
