      *
      *  ABC Parameter og summer                Index=READ
      *
     A          R MABCPFR
     A                                      PFILE(*LIBL/MABCPF)
      *
     A          K MAFIRM
     A          K MAVSOR
