      *
      *  ABC Parameter og summer
      *
     A                                      REF(*LIBL/LFRF)
     A          R MABCPFR
     A            MAFIRM    R
     A            MAVSOR    R
     A            MAOGRP    R
     A            MAHGRP    R
     A            MAUGRP    R
     A            MALAGK    R
     A            MATEXT    R
     A            MAABAP    R
     A            MAABBP    R
     A            MAABCP    R
     A            MAXYXP    R
     A            MAXYYP    R
     A            MAXYZP    R
     A            MAANAX    R
     A            MAANAY    R
     A            MAANAZ    R
     A            MAANBX    R
     A            MAANBY    R
     A            MAANBZ    R
     A            MAANCX    R
     A            MAANCY    R
     A            MAANCZ    R
     A            MAKDAT    R
     A            MAVDAT    R
     A            MAFAAR    R
     A            MATAAR    R
     A            MAFMND    R
     A            MATMND    R
     A            MALAGR    R
     A            MALTYP    R
     A            MAUSER    R
     A            MAODAT    R
6.10 A            MAOTIM    R
     A            MAEDAT    R
     A            MAETIM    R
6.10 A            MAEUSR    R
