      *
      *  ABC Parameter og summer                Index=Update
      *
     A                                      UNIQUE
     A          R MABCPFR
     A                                      PFILE(*LIBL/MABCPF)
      *
     A          K MAFIRM
     A          K MAVSOR
     A          K MAOGRP
     A          K MAHGRP
     A          K MAUGRP
     A          K MALAGK
