      *
      * ABC Detaljer
      *
     A          R MABDPFR                   PFILE(*LIBL/MABDPF)
      *
     A          K MBFIRM
     A          K MBVARE
