      *
      *  ABC Detaljer                           Index=READ
      *
     A          R MABDPFR
     A                                      PFILE(*LIBL/MABDPF)
      *
     A          K MBFIRM
     A          K MBLAGK
     A          K MBVSOR
     A          K MBOGRP
     A          K MBHGRP
     A          K MBUGRP
     A          K MBABPR                    DESCEND
