      *
      *  ABC Detaljer
      *
     A                                      REF(*LIBL/LFRF)
     A          R MABDPFR
     A            MBFIRM    R
     A            MBLAGK    R
     A            MBVSOR    R
     A            MBOGRP    R
     A            MBHGRP    R
     A            MBUGRP    R
     A            MBVARE    R
     A            MBLAGE    R
     A            MBKABC    R
     A            MBEABC    R
     A            MBOABC    R
     A            MBKXYZ    R
     A            MBANTA    R
     A            MBANTO    R
     A            MBOMSE    R
     A            MBTOPR    R
     A            MBABPR    R
     A            MBABAP    R
     A            MBXYPR    R
     A            MBXYAP    R
     A            MBENHE    R
     A            MBUSER    R
     A            MBODAT    R
6.10 A            MBOTIM    R
     A            MBEDAT    R
     A            MBETIM    R
6.10 A            MBEUSR    R
