      *
      *  Lagerlokasjon                          Index=Update
      *
     A                                      UNIQUE
     A          R MDLOPFR
     A                                      PFILE(*LIBL/MDLOPF)
      *
     A          K MDFIRM
     A          K MDLAGE
     A          K MDLOKA
