      *
      *  Lagerlokasjon                          Index=Lokasjon,Lager
      *
     A          R MDLOPFR
     A                                      PFILE(*LIBL/MDLOPF)
      *
     A          K MDFIRM
     A          K MDLOKA
     A          K MDLAGE
