      *
      *  Lagerlokasjon
      *
     A                                      REF(*LIBL/LFRF)
     A          R MDLOPFR
     A            MDFIRM    R
     A            MDLAGE    R
     A            MDLOKA    R
     A            MDLBES    R
     A            MJODAT    R
     A            MDEUSR    R
     A            MDODAT    R
6.10 A            MDOTIM    R
6.10 A            MDOUSR    R
     A            MDEDAT    R
     A            MDETIM    R
