     A          R MFRFR                     TEXT('MGR SYS/400')
      *
      *         DetteErEnFrf    (NB!!  Denne må ikke fjernes)
      *
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
7.NX  *       121120 BSA  Utvidet numemrserie
8.01  *       230621 BSA  Utvidet numemrserie, meldingsnummer EDI
      *
      * ----- ------ ---- -------------------------------------------------
      *
      * Koder benyttet hos Mestergruppen
      *
      *           PQ - PÅSLAGSKATEGORI     (LPSKPF)
      *           PR - PÅSLAGSMATRISE      (LPSMPF)
      *           PS - PÅSLAGSKAT PR KUNDE (LPSPPF)
      *
      *
      * Referansefelter                     (FÅ)
      *
     A            FÅVALG         1S 0       TEXT('Valg')
     A                                      COLHDG('Valg')
     A                                      EDTCDE(Z)
      *
     A            FÅFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
      *
     A            FÅKPRO         6S 0       TEXT('Kundeprosjektnr')
     A                                      COLHDG('Kunde' 'prosjekt')
     A                                      EDTCDE(Z)
      *
     A            FÅKUND         6S 0       TEXT('Kundenr')
     A                                      COLHDG('Kunde')
     A                                      EDTCDE(Z)
      *
     A            FÅPRGR         1A         TEXT('Prisgruppe')
     A                                      COLHDG('Pg')
      *
     A            FÅOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogr')
     A                                      EDTCDE(Z)
      *
     A            FÅHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgr')
     A                                      EDTCDE(Z)
      *
     A            FÅUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugr')
     A                                      EDTCDE(Z)
      *
     A            FÅMODN         8S 0       TEXT('Modulnr')
     A                                      COLHDG('Modulnr')
     A                                      EDTCDE(Z)
      *
     A            FÅVARE        15A         TEXT('Varenr')
     A                                      COLHDG('Varenr')
      *
     A            FÅNOBB         8S 0       TEXT('Nobbnr')
     A                                      COLHDG('Nobbnr')
     A                                      EDTCDE(Z)
      *
     A            FÅLETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
      *
     A            FÅENHE         3A         TEXT('Enhet')
     A                                      COLHDG('Enhet')
      *
     A            FÅKKAT         4S 0       TEXT('Kundekategori')
     A                                      COLHDG('Kunde' 'kat.')
     A                                      EDTCDE(Z)
      *
     A            FÅRKAT         3S 0       TEXT('Rabattkategori')
     A                                      COLHDG('Rab.' 'kat.')
     A                                      EDTCDE(Z)
      *
     A            FÅLDOR         6S 0       TEXT('Leverandørnr')
     A                                      COLHDG('Lev.')
     A                                      EDTCDE(Z)
      *
     A            FÅUSER        10A         TEXT('Bruker')
     A                                      COLHDG('Bruker')
      *
     A            FÅTAPE        10A         TEXT('Tape')
     A                                      COLHDG('Tape')
      *
     A            FÅBESK        35A         TEXT('Beskrivelse')
     A                                      COLHDG('Beskrivelse')
      *
     A            FÅPSLM         4S 2       TEXT('Påslag Mestergrp.')
     A                                      COLHDG('Påslag' 'Mgr.')
     A                                      EDTCDE(4)
      *
     A            FÅODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
      *
     A            FÅOTIM          T         TEXT('Opprettet tidspunkt')
     A                                      COLHDG('Oppr.tid')
      *
     A            FÅOUSR        10A         TEXT('Opprettet av')
     A                                      COLHDG('Oppr. av')
      *
     A            FÅEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
      *
     A            FÅETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
      *
     A            FÅEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
      *
      * PÅSLAGSKATEGORI                     (PQ)
      *
     A            PQFIRM    R               REFFLD(FÅFIRM)
     A            PQPKAT    R               REFFLD(FÅRKAT)
     A                                      TEXT('Påslagskategori')
     A                                      COLHDG('Påslagskat')
     A            PQBESK    R               REFFLD(FÅBESK)
      *
     A            PQODAT    R               REFFLD(FÅODAT)
     A            PQOTIM    R               REFFLD(FÅOTIM)
     A            PQOUSR    R               REFFLD(FÅOUSR)
     A            PQEDAT    R               REFFLD(FÅEDAT)
     A            PQETIM    R               REFFLD(FÅETIM)
     A            PQEUSR    R               REFFLD(FÅEUSR)
      *
      * PÅSLAGSMATRISE                      (PR)
      *
     A            PRFIRM    R               REFFLD(FÅFIRM)
     A            PRPRGR    R               REFFLD(FÅPRGR)
     A            PRPKAT    R               REFFLD(FÅRKAT)
     A                                      TEXT('Påslagskategori')
     A                                      COLHDG('Påslagskat')
     A            PRKKAT    R               REFFLD(FÅKKAT)
     A            PRKUND    R               REFFLD(FÅKUND)
     A            PRKPRO    R               REFFLD(FÅKPRO)
     A            PROGRP    R               REFFLD(FÅOGRP)
     A            PRHGRP    R               REFFLD(FÅHGRP)
     A            PRUGRP    R               REFFLD(FÅUGRP)
     A            PRLDOR    R               REFFLD(FÅLDOR)
     A            PRMODN    R               REFFLD(FÅMODN)
     A            PRVARE    R               REFFLD(FÅVARE)
     A            PRENHE    R               REFFLD(FÅENHE)
     A            PRLETY    R               REFFLD(FÅLETY)
      *
     A            PRNOTA         5A         TEXT('Notat')
     A                                      COLHDG('Notat')
      *
     A            PRPSLM    R               REFFLD(FÅPSLM)
      *
     A            PRRAB1         4S 2       TEXT('Rabatt-1')
     A                                      COLHDG('Rab-1')
     A                                      EDTCDE(4)
      *
     A            PRRA1D         4S 2       TEXT('Rabatt-1 datostyrt')
     A                                      COLHDG('Rab-1' 'datostyrt')
     A                                      EDTCDE(4)
      *
     A            PRRA1F          L         TEXT('Rabatt-1 fra-dato')
     A                                      COLHDG('Rab-1' 'fra-dato')
      *
     A            PRRA1T          L         TEXT('Rabatt-1 til-dato')
     A                                      COLHDG('Rab-1' 'til-dato')
      *
     A            PRRAB2         4S 2       TEXT('Rabatt-2')
     A                                      COLHDG('Rab-2')
     A                                      EDTCDE(4)
      *
     A            PRRA2D         4S 2       TEXT('Rabatt-2 datostyrt')
     A                                      COLHDG('Rab-2' 'datostyrt')
     A                                      EDTCDE(4)
      *
     A            PRRA2F          L         TEXT('Rabatt-2 fra-dato')
     A                                      COLHDG('Rab-2' 'fra-dato')
      *
     A            PRRA2T          L         TEXT('Rabatt-2 til-dato')
     A                                      COLHDG('Rab-2' 'til-dato')
      *
     A            PRRABN         4S 2       TEXT('Rabatt-N')
     A                                      COLHDG('Rab-N')
     A                                      EDTCDE(4)
      *
     A            PRRAND         4S 2       TEXT('Rabatt-N datostyrt')
     A                                      COLHDG('Rab-N' 'datostyrt')
     A                                      EDTCDE(4)
      *
     A            PRRANF          L         TEXT('Rabatt-N fra-dato')
     A                                      COLHDG('Rab-N' 'fra-dato')
      *
     A            PRRANT          L         TEXT('Rabatt-N til-dato')
     A                                      COLHDG('Rab-N' 'til-dato')
      *
     A            PRRABB         4S 2       TEXT('Rabatt-B')
     A                                      COLHDG('Rab-B')
     A                                      EDTCDE(4)
      *
     A            PRRABD         4S 2       TEXT('Rabatt-B datostyrt')
     A                                      COLHDG('Rab-B' 'datostyrt')
     A                                      EDTCDE(4)
      *
     A            PRRBUF          L         TEXT('Rabatt-B fra-dato')
     A                                      COLHDG('Rab-B' 'fra-dato')
      *
     A            PRRBUT          L         TEXT('Rabatt-B til-dato')
     A                                      COLHDG('Rab-B' 'til-dato')
      *
     A            PRRABT         4S 2       TEXT('Rabatt-T')
     A                                      COLHDG('Rab-T')
     A                                      EDTCDE(4)
      *
     A            PRRATD         4S 2       TEXT('Rabatt-T datostyrt')
     A                                      COLHDG('Rab-T' 'datostyrt')
     A                                      EDTCDE(4)
      *
     A            PRRATF          L         TEXT('Rabatt-T fra-dato')
     A                                      COLHDG('Rab-T' 'fra-dato')
      *
     A            PRRATT          L         TEXT('Rabatt-T til-dato')
     A                                      COLHDG('Rab-T' 'til-dato')
      *
     A            PRDEKN         5S 2       TEXT('Dekningsgrad')
     A                                      COLHDG('DG')
     A                                      EDTCDE(4)
      *
     A            PRDEKD         5S 2       TEXT('Dekningsgrad datostyrt')
     A                                      COLHDG('DG' 'datostyrt')
     A                                      EDTCDE(4)
      *
     A            PRDEKF          L         TEXT('Dekningsgrad fra-dato')
     A                                      COLHDG('DG' 'fra-dato')
      *
     A            PRDEKT          L         TEXT('Dekningrad til-dato')
     A                                      COLHDG('DG' 'til-dato')
      *
     A            PRODAT    R               REFFLD(FÅODAT)
     A            PROTIM    R               REFFLD(FÅOTIM)
     A            PROUSR    R               REFFLD(FÅOUSR)
     A            PREDAT    R               REFFLD(FÅEDAT)
     A            PRETIM    R               REFFLD(FÅETIM)
     A            PREUSR    R               REFFLD(FÅEUSR)
      *
      * PÅSLAGSKATEGORI PR KUNDE            (PS)
      *
     A            PSFIRM    R               REFFLD(FÅFIRM)
     A            PSKUND    R               REFFLD(FÅKUND)
     A            PSPKAT    R               REFFLD(FÅRKAT)
     A                                      COLHDG('Påslagskat')
      *
     A            PSODAT    R               REFFLD(FÅODAT)
     A            PSOTIM    R               REFFLD(FÅOTIM)
     A            PSOUSR    R               REFFLD(FÅOUSR)
     A            PSEDAT    R               REFFLD(FÅEDAT)
     A            PSETIM    R               REFFLD(FÅETIM)
     A            PSEUSR    R               REFFLD(FÅEUSR)
      *
      * BONUSBERETTIGET OMSETNING           (EP)
      *
     A            EPFIRM    R               REFFLD(FÅFIRM)
     A            EPKUND    R               REFFLD(FÅKUND)
     A            EPPBEL        13S 2       TEXT('Prognose omsetning')
     A                                      COLHDG('Omsetning')
     A                                      EDTCDE(M)
     A                                      COMP(LT 99999999999)
     A                                      CHKMSGID(FMD0640 *LIBL/QMFOFAK)
      *
     A            EPODAT    R               REFFLD(FÅODAT)
     A            EPOTIM    R               REFFLD(FÅOTIM)
     A            EPOUSR    R               REFFLD(FÅOUSR)
     A            EPEDAT    R               REFFLD(FÅEDAT)
     A            EPETIM    R               REFFLD(FÅETIM)
     A            EPEUSR    R               REFFLD(FÅEUSR)
      *
      *  EDI-retur meldinger                (GI)
      *
     A            GIFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            GIKODE         1A         COLHDG('Meldings_kode')
     A                                      TEXT('Meldings_kode')
     A            GITYPE         4A
     A                                      COLHDG('Meldings_type')
     A                                      TEXT('Meldings_type')
7.NX A            GIMNUM         8S 0       TEXT('Meldingsnummer')
     A                                      COLHDG('Meldingsnummer')
     A            GIMLIN         6S 0       TEXT('Meldingslinje')
     A                                      COLHDG('Meldingslinje')
     A            GIMDAT          L
     A                                      COLHDG('Meldings_dato')
     A                                      TEXT('Meldings_dato')
     A            GIMTID          T
     A                                      COLHDG('Meldings_tid')
     A                                      TEXT('Meldings_tid')
6.NU A            GINUMM         8S 0       TEXT('Best.nr')
     A                                      COLHDG('Best.nr')
     A            GISUFF         2S 0       TEXT('Suff.nr')
     A                                      COLHDG('Suff.nr')
     A            GILINE         4S 0       TEXT('Bes.lin')
     A                                      COLHDG('Bes.lin')
     A            GILDOR         6S 0       TEXT('Leverandør')
     A                                      COLHDG('Leverandør')
     A            GIKUND         6S 0       TEXT('Kunde')
     A                                      COLHDG('Kunde')
     A            GIMELD       400A
     A                                      COLHDG('Melding')
     A                                      TEXT('Melding')
     A            GISTAT         1A
     A                                      COLHDG('Meldings_status')
     A                                      TEXT('Meldings_status')
     A            GIODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
     A            GIOTIM          T         TEXT('Opprettet tidspkt')
     A                                      COLHDG('Oppr.tid')
     A            GIOUSR        10A         TEXT('Opprettet av')
     A                                      COLHDG('Oppr. av')
     A            GIEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
     A            GIETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
     A            GIEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
      *
      *  EDI-meldinger omregning logg   (GL)
      *
     A            GLFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            GLTYPE         4A
     A                                      COLHDG('Meldings_type')
     A                                      TEXT('Meldings_type')
8.01 A            GLMNUM         8S 0       TEXT('Meldingsnummer')
     A                                      COLHDG('Meldingsnummer')
     A            GLMLIN         6S 0       TEXT('Meldingslinje')
     A                                      COLHDG('Meldingslinje')
     A            GLMDAT          L
     A                                      COLHDG('Meldings_dato')
     A                                      TEXT('Meldings_dato')
     A            GLMTID          T
     A                                      COLHDG('Meldings_tid')
     A                                      TEXT('Meldings_tid')
      *
     A            GLSTAT         1A         TEXT('Status konvertering')
     A                                      COLHDG('Status konvertering')
     A            GLLDOR         6S 0       TEXT('Leverandørnummer')
     A                                      COLHDG('Leverandørnummer')
     A            GLGTIN        14S 0       TEXT('GTIN nummer')
     A                                      COLHDG('GTIN nummer')
     A            GLNOBB         8S 0       TEXT('NOBB nummer')
     A                                      COLHDG('NOBB nummer')
     A            GLEENH         3A         TEXT('EDI enhet')
     A                                      COLHDG('EDI enhet')
     A            GLEKVA        15S 3       TEXT('EDI kvantum')
     A                                      COLHDG('EDI kvantum')
     A            GLESAP        15S 3       TEXT('EDI pris')
     A                                      COLHDG('EDI pris')
     A            GLOENH         3A         TEXT('Omregnet til enhet')
     A                                      COLHDG('Omregnet til enhet')
     A            GLOKVA        15S 3       TEXT('Omregnet til kvantum')
     A                                      COLHDG('Omregnet til kvantum')
     A            GLOSAP        15S 3       TEXT('Omregnet pris')
     A                                      COLHDG('Omregnet pris')
      *
     A            GLODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
     A            GLOTIM          T         TEXT('Opprettet tidspkt')
     A                                      COLHDG('Oppr.tid')
     A            GLOUSR        10A         TEXT('Opprettet av')
     A                                      COLHDG('Oppr. av')
     A            GLEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
     A            GLETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
     A            GLEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
      *
      *  EDI-meldinger omregningskrav   (GG)
      *
     A            GGFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            GGSTAT         1  0       TEXT('Statuskode')
     A                                      COLHDG('Statuskode')
     A                                      EDTCDE(Z)
     A            GGNBEL        13S 2       TEXT('Nedre beløpsgrense')
     A                                      COLHDG('Nedre beløpsgrense')
     A            GGOBEL        13S 2       TEXT('Øvre beløpsgrense')
     A                                      COLHDG('Øvre beløpsgrense')
     A            GGMAI1        50A         TEXT('Mailadresse 1')
     A                                      COLHDG('Mailadresse 1')
     A            GGMAI2        50A         TEXT('Mailadresse 2')
     A                                      COLHDG('Mailadresse 2')
     A            GGMAI3        50A         TEXT('Mailadresse 3')
     A                                      COLHDG('Mailadresse 3')
     A            GGTXT1        50A         TEXT('Tekstlinje 1')
     A                                      COLHDG('Tekstlinje 1')
     A            GGTXT2        50A         TEXT('Tekstlinje 2')
     A                                      COLHDG('Tekstlinje 2')
     A            GGTXT3        50A         TEXT('Tekstlinje 3')
     A                                      COLHDG('Tekstlinje 3')
     A            GGKK01         4S 0       TEXT('Kundekategori 01')
     A                                      COLHDG('Kundekategori 01')
     A                                      EDTCDE(Z)
     A            GGKK02         4S 0       TEXT('Kundekategori 02')
     A                                      COLHDG('Kundekategori 02')
     A                                      EDTCDE(Z)
     A            GGKK03         4S 0       TEXT('Kundekategori 03')
     A                                      COLHDG('Kundekategori 03')
     A                                      EDTCDE(Z)
     A            GGKK04         4S 0       TEXT('Kundekategori 04')
     A                                      COLHDG('Kundekategori 04')
     A                                      EDTCDE(Z)
     A            GGKK05         4S 0       TEXT('Kundekategori 05')
     A                                      COLHDG('Kundekategori 05')
     A                                      EDTCDE(Z)
     A            GGKK06         4S 0       TEXT('Kundekategori 06')
     A                                      COLHDG('Kundekategori 06')
     A                                      EDTCDE(Z)
     A            GGKK07         4S 0       TEXT('Kundekategori 07')
     A                                      COLHDG('Kundekategori 07')
     A                                      EDTCDE(Z)
     A            GGKK08         4S 0       TEXT('Kundekategori 08')
     A                                      COLHDG('Kundekategori 08')
     A                                      EDTCDE(Z)
     A            GGKK09         4S 0       TEXT('Kundekategori 09')
     A                                      COLHDG('Kundekategori 09')
     A                                      EDTCDE(Z)
     A            GGKK10         4S 0       TEXT('Kundekategori 10')
     A                                      COLHDG('Kundekategori 10')
     A                                      EDTCDE(Z)
     A            GGKK11         4S 0       TEXT('Kundekategori 11')
     A                                      COLHDG('Kundekategori 11')
     A                                      EDTCDE(Z)
     A            GGKK12         4S 0       TEXT('Kundekategori 12')
     A                                      COLHDG('Kundekategori 12')
     A                                      EDTCDE(Z)
     A            GGKK13         4S 0       TEXT('Kundekategori 13')
     A                                      COLHDG('Kundekategori 13')
     A                                      EDTCDE(Z)
     A            GGKK14         4S 0       TEXT('Kundekategori 14')
     A                                      COLHDG('Kundekategori 14')
     A                                      EDTCDE(Z)
     A            GGKK15         4S 0       TEXT('Kundekategori 15')
     A                                      COLHDG('Kundekategori 15')
     A                                      EDTCDE(Z)
     A            GGKK16         4S 0       TEXT('Kundekategori 16')
     A                                      COLHDG('Kundekategori 16')
     A                                      EDTCDE(Z)
     A            GGKK17         4S 0       TEXT('Kundekategori 17')
     A                                      COLHDG('Kundekategori 17')
     A                                      EDTCDE(Z)
     A            GGKK18         4S 0       TEXT('Kundekategori 18')
     A                                      COLHDG('Kundekategori 18')
     A                                      EDTCDE(Z)
     A            GGKK19         4S 0       TEXT('Kundekategori 19')
     A                                      COLHDG('Kundekategori 19')
     A                                      EDTCDE(Z)
     A            GGKK20         4S 0       TEXT('Kundekategori 20')
     A                                      COLHDG('Kundekategori 20')
     A                                      EDTCDE(Z)
     A            GGKK21         4S 0       TEXT('Kundekategori 21')
     A                                      COLHDG('Kundekategori 21')
     A                                      EDTCDE(Z)
     A            GGKK22         4S 0       TEXT('Kundekategori 22')
     A                                      COLHDG('Kundekategori 22')
     A                                      EDTCDE(Z)
     A            GGKK23         4S 0       TEXT('Kundekategori 23')
     A                                      COLHDG('Kundekategori 23')
     A                                      EDTCDE(Z)
     A            GGKK24         4S 0       TEXT('Kundekategori 24')
     A                                      COLHDG('Kundekategori 24')
     A                                      EDTCDE(Z)
     A            GGKK25         4S 0       TEXT('Kundekategori 25')
     A                                      COLHDG('Kundekategori 25')
     A                                      EDTCDE(Z)
     A            GGLK01         4S 0       TEXT('Leverandørkategori 01')
     A                                      COLHDG('Levkat 01')
     A                                      EDTCDE(Z)
     A            GGLK02         4S 0       TEXT('Leverandørkategori 02')
     A                                      COLHDG('Levkat 02')
     A                                      EDTCDE(Z)
     A            GGLK03         4S 0       TEXT('Leverandørkategori 03')
     A                                      COLHDG('Levkat 03')
     A                                      EDTCDE(Z)
     A            GGLK04         4S 0       TEXT('Leverandørkategori 04')
     A                                      COLHDG('Levkat 04')
     A                                      EDTCDE(Z)
     A            GGLK05         4S 0       TEXT('Leverandørkategori 05')
     A                                      COLHDG('Levkat 05')
     A                                      EDTCDE(Z)
     A            GGLK06         4S 0       TEXT('Leverandørkategori 06')
     A                                      COLHDG('Levkat 06')
     A                                      EDTCDE(Z)
     A            GGLK07         4S 0       TEXT('Leverandørkategori 07')
     A                                      COLHDG('Levkat 07')
     A                                      EDTCDE(Z)
     A            GGLK08         4S 0       TEXT('Leverandørkategori 08')
     A                                      COLHDG('Levkat 08')
     A                                      EDTCDE(Z)
     A            GGLK09         4S 0       TEXT('Leverandørkategori 09')
     A                                      COLHDG('Levkat 09')
     A                                      EDTCDE(Z)
     A            GGLK10         4S 0       TEXT('Leverandørkategori 10')
     A                                      COLHDG('Levkat 10')
     A                                      EDTCDE(Z)
     A            GGFDAT          L
     A                                      COLHDG('Sist FTP dato')
     A                                      TEXT('Sist FTP dato')
     A            GGFTID          T
     A                                      COLHDG('Sist FTP tid')
     A                                      TEXT('Sist FTP tid')
     A            GGUDAT          L
     A                                      COLHDG('Sist oppdatert dato')
     A                                      TEXT('Sist oppdatert dato')
     A            GGUTID          T
     A                                      COLHDG('Sist oppdatert tid')
     A                                      TEXT('Sist oppdatert tid')
     A            GGSDAT          L
     A                                      COLHDG('Sist ferdig dato')
     A                                      TEXT('Sist ferdig dato')
     A            GGSTID          T
     A                                      COLHDG('Sist ferdig tid')
     A                                      TEXT('Sist ferdig tid')
      *
     A            GGODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
     A            GGOTIM          T         TEXT('Opprettet tidspkt')
     A                                      COLHDG('Oppr.tid')
     A            GGOUSR        10A         TEXT('Opprettet av')
     A                                      COLHDG('Oppr. av')
     A            GGEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
     A            GGETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
     A            GGEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
      *
      * BATCHREGISTER - FILTRERING         (L1)
      *
     A            L1FIRM    R               REFFLD(FÅFIRM)
     A            L1BATC        10A         TEXT('Tellebatch')
     A                                      COLHDG('Tellebatch')
     A            L1LAGE         2  0       TEXT('Filtreringslager')
     A                                      COLHDG('Filtreringslager')
      *
     A            L1ODAT    R               REFFLD(FÅODAT)
     A            L1OTIM    R               REFFLD(FÅOTIM)
     A            L1OUSR    R               REFFLD(FÅOUSR)
     A            L1EDAT    R               REFFLD(FÅEDAT)
     A            L1ETIM    R               REFFLD(FÅETIM)
     A            L1EUSR    R               REFFLD(FÅEUSR)
      *
      *  Cobuilder - logg/status v   (SC)
      *
     A            SCFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            SCSTAT         1  0       TEXT('Statuskode')
     A                                      COLHDG('Statuskode')
     A                                      EDTCDE(Z)
     A            SCMAI1        50A         TEXT('Mailadresse 1')
     A                                      COLHDG('Mailadresse 1')
     A            SCMAI2        50A         TEXT('Mailadresse 2')
     A                                      COLHDG('Mailadresse 2')
     A            SCMAI3        50A         TEXT('Mailadresse 3')
     A                                      COLHDG('Mailadresse 3')
     A            SCSUBJ        50A         TEXT('Subjekt')
     A                                      COLHDG('Subjekt')
     A            SCTXT1        50A         TEXT('Tekstlinje 1')
     A                                      COLHDG('Tekstlinje 1')
     A            SCTXT2        50A         TEXT('Tekstlinje 2')
     A                                      COLHDG('Tekstlinje 2')
     A            SCTXT3        50A         TEXT('Tekstlinje 3')
     A                                      COLHDG('Tekstlinje 3')
     A            SCSEND        50A         TEXT('Avsender')
     A                                      COLHDG('Avsender')
     A            SCUDAT          L
     A                                      COLHDG('Sist oppdatert dato')
     A                                      TEXT('Sist oppdatert dato')
     A            SCUTID          T
     A                                      COLHDG('Sist oppdatert tid')
     A                                      TEXT('Sist oppdatert tid')
     A            SCKDAT          L
     A                                      COLHDG('Siste kjøredato')
     A                                      TEXT('Siste kjøredato')
      *
     A            SCODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
     A            SCOTIM          T         TEXT('Opprettet tidspkt')
     A                                      COLHDG('Oppr.tid')
     A            SCOUSR        10A         TEXT('Opprettet av')
     A                                      COLHDG('Oppr. av')
     A            SCEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
     A            SCETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
     A            SCEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
      *
      *  Cobuilder - varer           (SV)
      *
     A            SVFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            SVNOBB         8S 0       TEXT('Nobbnummer')
     A                                      COLHDG('Nobbnummer')
     A                                      EDTCDE(Z)
     A            SVTEK1        35A         TEXT('Varetekst')
     A                                      COLHDG('Varetekst')
      *
     A            SVODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
     A            SVOTIM          T         TEXT('Opprettet tidspkt')
     A                                      COLHDG('Oppr.tid')
     A            SVOUSR        10A         TEXT('Opprettet av')
     A                                      COLHDG('Oppr. av')
     A            SVEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
     A            SVETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
     A            SVEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
      *
      *
