      *
      *  Logistikkpunkt                         Index=Ean-lok
      *
     A          R MJLOPFR
     A                                      PFILE(*LIBL/MJLOPF)
      *
     A          K MJFIRM
     A          K MJEANN
