      *
      *  Logistikkpunkt                         Index=Read
      *
     A          R MJLOPFR
     A                                      PFILE(*LIBL/MJLOPF)
      *
     A          K MJFIRM
     A          K MJLAGE
     A          K MJAVDE
     A          K MJSKAF
