      *
      *  PARAMETER FOR LEVERINGSTID
      *
     A                                      UNIQUE
     A          R MLTIPFR
     A                                      PFILE(*LIBL/MLTIPF)
      *
     A          K MCFIRM
     A          K MCOGRP
     A          K MCHGRP
     A          K MCUGRP
     A          K MCLDOR
     A          K MCVARE
     A          K MCLAGE
     A          K MCCRDO
