      *
      *  ABC Detaljer
      *
     A                                      REF(*LIBL/LFRF)
     A          R MMATPFR
     A            MMFIRM    R
     A            MMVSOR    R
     A            MMOGRP    R
     A            MMHGRP    R
     A            MMUGRP    R
     A            MMVARE    R
     A            MMCRDO    R
     A            MMDBAX    R
     A            MMDBAY    R
     A            MMDBAZ    R
     A            MMDBBX    R
     A            MMDBBY    R
     A            MMDBBZ    R
     A            MMDBCX    R
     A            MMDBCY    R
     A            MMDBCZ    R
     A            MMDSAX    R
     A            MMDSAY    R
     A            MMDSAZ    R
     A            MMDSBX    R
     A            MMDSBY    R
     A            MMDSBZ    R
     A            MMDSCX    R
     A            MMDSCY    R
     A            MMDSCZ    R
     A            MMANTP    R
     A            MMANTU    R
     A            MMBRKU    R
     A            MMANTG    R
     A            MMBRKG    R
     A            MMLT01    R
     A            MMLT02    R
     A            MMLT03    R
     A            MMLT04    R
     A            MMLT05    R
     A            MMLT06    R
     A            MMLT07    R
     A            MMLT08    R
     A            MMLT09    R
     A            MMLT10    R
     A            MMVTYP    R
     A            MMLDOR    R
     A            MMLAGE    R
     A            MMLAGR    R
     A            MMLAGT    R
     A            MMAKTI    R
     A            MMKDAT    R
     A            MMUSER    R
     A            MMODAT    R
6.10 A            MMOTIM    R
     A            MMEDAT    R
     A            MMETIM    R
6.10 A            MMEUSR    R
