      *
      *  Matrise Best.mengde /Sikkerhetstid     Index=READ
      *
     A          R MMATPFR
     A                                      PFILE(*LIBL/MMATPF)
      *
     A          K MMFIRM
     A          K MMVSOR
     A          K MMOGRP
     A          K MMHGRP
     A          K MMUGRP
