      *
      *  Matr. Bestillingsmengde /Sikk.tid      Index=Update
      *
     A                                      UNIQUE
     A          R MMATPFR
     A                                      PFILE(*LIBL/MMATPF)
      *
     A          K MMFIRM
     A          K MMVSOR
     A          K MMOGRP
     A          K MMHGRP
     A          K MMUGRP
     A          K MMLDOR
     A          K MMVARE
     A          K MMCRDO
