      *
      *  Matrise Best.mengde /Sikkerhetstid     Index=READ
      *
     A          R MMATPFR
     A                                      PFILE(*LIBL/MMATPF)
      *
     A          K MMFIRM
     A          K MMVARE
