      *
      *  Lagertelling-batch-register
      *
     A                                      REF(*LIBL/LFRF)
     A          R MPPAPFR
     A            MPFIRM    R
     A            MPLDOR    R
     A            MPLNUM    R
     A            MPOGRF    R
     A            MPOGRT    R
     A            MPHGRF    R
     A            MPHGRT    R
     A            MPUGRF    R
     A            MPUGRT    R
     A            MPVARF    R
     A            MPVART    R
     A            MPPRAN    R
     A            MPTHOR    R
     A            MPLAGE    R
     A            MPVVAL    R
     A            MPSATS    R
     A            MPAVAL    R
     A            MPBESK    R
     A            MPHYPP    R
     A            MPLU14    R
     A            MPDAG1    R
     A            MPDAG2    R
     A            MPDAG3    R
     A            MPDAG4    R
     A            MPDAG5    R
     A            MPDAG6    R
     A            MPDAG7    R
     A            MPHOLD    R
     A            MPSDAT    R
     A            MPGVEK    R
     A            MPGBEL    R
     A            MPMAIL    R
     A            MPLSOR    R
     A            MPSELG    R
     A            MPREBE    R
     A            MPKORA    R
6.13 A            MPKSOR    R
6.28 A            MPRAPP    R
6.28 A            MPAB01    R
6.28 A            MPAB02    R
6.28 A            MPAB03    R
6.28 A            MPAB04    R
6.28 A            MPAB05    R
6.28 A            MPAB06    R
6.28 A            MPAB07    R
6.28 A            MPAB08    R
6.28 A            MPAB09    R
     A            MPUSER    R
     A            MPODAT    R
6.10 A            MPOTIM    R
     A            MPEDAT    R
     A            MPETIM    R
6.10 A            MPEUSR    R
