      *
      *  Parameter pr. leverandør Best.forslag  Index=READ
      *
     A          R MPPAPFR
     A                                      PFILE(*LIBL/MPPAPF)
      *
     A          K MPFIRM
     A          K MPLDOR
     A          K MPLNUM
