      *
      *  Prognose - store avvik                 Index=Read
      *
     A          R MPRAPFR
     A                                      PFILE(*LIBL/MPRAPF)
      *
     A          K MQFIRM
     A          K MQVARE
     A          K MQLAGE
