      *
      *  Prognose                               Index=READ
      *
     A          R MPROPFR
     A                                      PFILE(*LIBL/MPROPF)
      *
     A          K MOFIRM
     A          K MOMINI
