      *
      *  PROGNOSE PR. UKE                       Index=Read
      *
     A          R MPRUPFR
     A                                      PFILE(*LIBL/MPRUPF)
      *
     A          K MRFIRM
     A          K MRVARE
     A          K MRLAGE
     A          K MRAAR
     A          K MRUKE
