      *
      *  Prognose PR UKE                        Index=READ
      *
     A          R MPRUPFR
     A                                      PFILE(*LIBL/MPRUPF)
      *
     A          K MRFIRM
     A          K MRKABC
     A          K MRVARE
     A          K MRLAGE
