      *
      *  Prognose PR UKE                        Index=READ
      *
     A          R MPRUPFR
     A                                      PFILE(*LIBL/MPRUPF)
      *
     A          K MRFIRM
     A          K MRVSOR
     A          K MROGRP
     A          K MRHGRP
     A          K MRUGRP
     A          K MRLDOR
     A          K MRVARK
     A          K MRCRDO
     A          K MRVARE
