      *
      *  Prognose  PR. UKE
      *
     A                                      REF(*LIBL/LFRF)
     A          R MPRUPFR
     A            MRFIRM    R
     A            MRVARE    R
     A            MRLAGE    R
     A            MRAAR     R
     A            MRUKE     R
     A            MRENHE    R
     A            MRANTP    R
     A            MRANTR    R
     A            MRANTT    R
     A            MRANTS    R
     A            MRANTI    R
     A            MRGLPR    R
     A            MRUANT    R
     A            MRANTG    R
     A            MRKABC    R
     A            MRVSOR    R
     A            MROGRP    R
     A            MRHGRP    R
     A            MRUGRP    R
     A            MRLDOR    R
     A            MRVARK    R
     A            MRCRDO    R
     A            MRUSER    R
     A            MRODAT    R
6.10 A            MROTIM    R
     A            MREDAT    R
     A            MRETIM    R
6.10 A            MREUSR    R
