      *
      *  Prognose                               Index=READ
      *
     A          R MPROPFR
     A                                      PFILE(*LIBL/MPRWPF)
      *
     A          K MOFIRM
     A          K MOVSOR
     A          K MOOGRP
     A          K MOHGRP
     A          K MOUGRP
     A          K MOLDOR
     A          K MOVARK
     A          K MOMINI
