      *
      *  Prognose                               Index=Update
      *
     A                                      UNIQUE
     A          R MPROPFR
     A                                      PFILE(*LIBL/MPRWPF)
      *
     A          K MOFIRM
     A          K MOVARE
     A          K MOLAGE
