      *
      *  Lager
      *
     A                                      UNIQUE
     A          R MPSPPFR                   PFILE(*LIBL/MPSPPF)
      *
     A          K MOSFRM
     A          K MOSVAR
     A          K MOSLAG
