      *
      *  Lager
      *
     A                                      REF(*LIBL/LFRF)
     A          R MPSPPFR
     A            MOSFRM    R
     A            MOSVAR    R
     A            MOSLAG    R
     A            MOSTDA    R
6.20 A            MOSUDA    R
6.20 A            MOSLDO    R
     A            MOSODA    R
6.10 A            MOSOTI    R
6.10 A            MOSOUS    R
     A            MOSEDA    R
6.10 A            MOSETI    R
     A            MOSUSR    R
