      *
      *  Syklisk telling parameter
      *
     A                                      REF(*LIBL/LFRF)
     A          R MSTPPFR
     A            MSFIRM    R
     A            MSAAR     R
     A            MSLAGE    R
     A            MSAXAF    R
     A            MSAXAG    R
     A            MSAYAF    R
     A            MSAYAG    R
     A            MSAZAF    R
     A            MSAZAG    R
     A            MSBXAF    R
     A            MSBXAG    R
     A            MSBYAF    R
     A            MSBYAG    R
     A            MSBZAF    R
     A            MSBZAG    R
     A            MSCXAF    R
     A            MSCXAG    R
     A            MSCYAF    R
     A            MSCYAG    R
     A            MSCZAF    R
     A            MSCZAG    R
     A            MSANTT    R
     A            MSANTV    R
     A            MSUSER    R
     A            MSODAT    R
6.10 A            MSOTIM    R
     A            MSEDAT    R
     A            MSETIM    R
6.10 A            MSEUSR    R
