      *
      *  Syklisk telling                        Index=Read
      *
     A          R MSTPPFR
     A                                      PFILE(*LIBL/MSTPPF)
      *
     A          K MSFIRM
     A          K MSAAR
     A          K MSLAGE
