      *
      * Håndholdt transer telling
      *
     A          R MTHHPFR                   PFILE(*LIBL/MTHHPF)
      *
     A          K MFFIRM
     A          K MFHHUS
     A          K MFBATC
     A          K MFPLAS
     A          K MFVARE
      *
