      *
      *  Pakketreregister
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/LFRF)
     A          R MTPAPFR
     A            MTFIRM    R
     A            MTNUMM    R
     A            MTVARE    R
     A            MTLVAR    R
     A            MTTVAR    R
     A            MTNOBB    R
     A            MTLAGE    R
     A            MTLINE    R
     A            MTSERI    R
     A            MTKORR    R
     A            MTDATO    R
     A            MTTIME    R
     A            MTNTYK    R
     A            MTNBRE    R
     A            MTATYK    R
     A            MTABRE    R
     A            MTARTN    R
     A            MTPROF    R
     A            MTKVAL    R
     A            MTTREK    R
     A            MTBEHA    R
     A            MTPTYP    R
     A            MTLJUS    R
     A            MTTANT    R
     A            MTKANT    R
     A            MTDM18    R
     A            MTDM19    R
     A            MTDM20    R
     A            MTDM21    R
     A            MTDM22    R
     A            MTDM23    R
     A            MTDM24    R
     A            MTDM25    R
     A            MTDM26    R
     A            MTDM27    R
     A            MTDM28    R
     A            MTDM29    R
     A            MTDM30    R
     A            MTDM31    R
     A            MTDM32    R
     A            MTDM33    R
     A            MTDM34    R
     A            MTDM35    R
     A            MTDM36    R
     A            MTDM37    R
     A            MTDM38    R
     A            MTDM39    R
     A            MTDM40    R
     A            MTDM41    R
     A            MTDM42    R
     A            MTDM43    R
     A            MTDM44    R
     A            MTDM45    R
     A            MTDM46    R
     A            MTDM47    R
     A            MTDM48    R
     A            MTDM49    R
     A            MTDM50    R
     A            MTDM51    R
     A            MTDM52    R
     A            MTDM53    R
     A            MTDM54    R
     A            MTDM55    R
     A            MTDM56    R
     A            MTDM57    R
     A            MTDM58    R
     A            MTDM59    R
     A            MTDM60    R
     A            MTDM61    R
     A            MTDM62    R
     A            MTTOTL    R
     A            MTTOTK    R
     A            MTNOMK    R
     A            MTKNOK    R
     A            MTAKTK    R
     A            MTKAKK    R
     A            MTMLEN    R
     A            MTSLEN    R
     A            MTSNIT    R
     A            MTPROS    R
     A            MTVEKT    R
     A            MTSORT    R
     A            MTORDN    R
     A            MTKUND    R
     A            MTTOTR    R
     A            MTSTAT    R
6.10 A            MTODAT    R
6.10 A            MTOTIM    R
6.10 A            MTOUSR    R
6.10 A            MTEDAT    R
6.10 A            MTETIM    R
6.10 A            MTEUSR    R
