      *
      *  Pakketreregister
      *
     A          R MTPAPFR                   PFILE(*LIBL/MTPAPF)
      *
     A          K MTFIRM
     A          K MTLVAR
     A          K MTLAGE
     A          K MTNUMM
