      *
      *  Pakketreregister
      *
     A                                      UNIQUE
     A          R MTPAPFR                   PFILE(*LIBL/MTPAPF)
      *
     A          K MTFIRM
     A          K MTNUMM
