      *
      *  Pakkehistorikk
      *
     A                                      REF(*LIBL/LFRF)
     A          R MUPAPFR
     A            MUFIRM    R
     A            MUNUMM    R
     A            MUDATO    R
     A            MUTIME    R
     A            MUTEXT    R
     A            MULENG    R
     A            MUUSER    R
6.10 A            MUODAT    R
6.10 A            MUOTIM    R
6.10 A            MUOUSR    R
6.10 A            MUEDAT    R
6.10 A            MUETIM    R
6.10 A            MUEUSR    R
