      *
      *  Pakkehistorikk
      *
     A                                      UNIQUE
     A          R MUPAPFR                   PFILE(*LIBL/MUPAPF)
      *
     A          K MUFIRM
     A          K MUNUMM
     A          K MUDATO
     A          K MUTIME
