      *
      * Bensinsystemtrans./Lesja
      *
     A          R NBBTPFR
     A            BTDATO         8S 0
     A            BTTIME         4S 0
     A            BTCRNO        24A
     A            BTPROD         8S 0
     A            BTVOLU         8S 2
     A            BTPUMP         4S 0
     A            BTCRNM        40A
     A            BTCUST         6S 0
     A            BTPRNM        40A
     A            BTINNM        40A
     A            BTTPLA        40A
     A            BTCUNM        40A
     A            BTCUA1        40A
     A            BTCUA2        40A
     A            BTCUAD        40A
     A            BTPRIC         8S 3
     A            BTVATC         5S 2
