      *
      * Ekstern ordre arbeidstabell
      *
     A          R NEOWPFR
     A            NWIRAD      1200A         TEXT('Ekstern ordre')
     A                                      COLHDG('Ekstern ordre')
