      *
      * Nettbutikk kundefil
      *
     A          R NETKUNDR
     A            DATA         700A         TEXT('Data')
     A                                      COLHDG('Data')
