      *
      * Nettbutikk lagerfil
      *
     A          R NETLAGERR
     A            DATA         512A         TEXT('Data')
     A                                      COLHDG('Data')
