      *
      * Nettbutikk  handlelistefil
      *
     A          R NETLISTR
     A            DATA         512A         TEXT('Data')
     A                                      COLHDG('Data')
