      *
      * Nettbutikk leverandørfil
      *
     A          R NETLEVERR
     A            DATA         512A         TEXT('Data')
     A                                      COLHDG('Data')
