      *
      * Nettbutikk vare/lagerfil
      *
     A          R NETVARLAGR
     A            DATA         512A         TEXT('Data')
     A                                      COLHDG('Data')
