      *
      * Nettbutikk varefil
      *
     A          R NETVARER
     A            DATA         512A         TEXT('Data')
     A                                      COLHDG('Data')
