      *
      * Ekstern ordre-linje
      *
     A          R NODTPFR                   PFILE(*LIBL/NODTPF)
      *
     A          K NDFIRM
     A          K NDFSYS
     A          K NDTELL
     A          K NDTEK1
     A          K NDVARE
     A          K NDLINE
