      *
      * Ekstern ordre-hode - tilleggstabell
      *
     A          R NOH2PFR
     A            N2FIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            N2FSYS         3A         TEXT('Eksternt system')
     A                                      COLHDG('Ekst.' 'sys.')
     A            N2TELL         6S 0       TEXT('Teller')
     A                                      COLHDG('Teller')
     A                                      EDTCDE(Z)
     A            N2NUMM         8S 0       TEXT('Ordrenummer')
     A                                      COLHDG('ordrenummer')
     A                                      EDTCDE(Z)
     A            N2PREF        15A         TEXT('Parent referanse')
     A                                      COLHDG('Parent referanse')
     A            N2KREF        35A         TEXT('Kontaktreferanse')
     A                                      COLHDG('Kontaktreferanse')
     A            N2TREF        15A         TEXT('Telefonnr kontaktpers.')
     A                                      COLHDG('Telefon kontaktpers.')
     A            N2ODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
     A            N2OTIM          T         TEXT('Opprettet tidspunkt')
     A                                      COLHDG('Oppr.tid')
     A            N2OUSR        10A         TEXT('Opprettet av')
     A                                      COLHDG('Oppr. av')
     A            N2EDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
     A            N2ETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
     A            N2EUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
