      *
      * Ekstern ordre-hode - tillegg
      *
     A          R NOH2PFR                   PFILE(*LIBL/NOH2PF)
      *
     A          K N2FIRM
     A          K N2FSYS
     A          K N2TELL
