      *
      * Ekstern ordre-hode
      *
     A          R NOHEPFR                   PFILE(*LIBL/NOHEPF)
      *
     A          K NOFIRM
     A          K NOFSYS
     A          K NONREF
     A          K NOKNAV
     A          K NOPNAV
     A          K NOUSER
