      *
      * Ekstern ordre-hode
      *
     A                                      REF(*LIBL/FFRF)
     A          R NOHEPFR
     A            NOFIRM    R
     A            NOFSYS    R
     A            NOTELL    R
     A            NONREF    R
     A            NOFRSP    R
     A            NOLAGE    R
     A            NOAVDE    R
     A            NOUSER    R
     A            NOKUND    R
     A            NOKNAV    R
     A            NOKPRO    R
     A            NOPNAV    R
     A            NONAVN    R
     A            NOADR1    R
     A            NOADR2    R
     A            NOPONR    R
     A            NOSTED    R
     A            NOLETY    R
     A            NOLDAT    R
     A            NODREF    R
     A            NOREKV    R
     A            NOUNAV    R
     A            NOUTLF    R
     A            NOUMOB    R
     A            NOUFAX    R
     A            NOUMAI    R
     A            NOMELD    R
     A            NONUMM    R
     A            NOLMAT    R
     A            NOBDAT    R
6.3G A            NOLASS    R
6.3G A            NOFRI1    R
6.3G A            NOFRI2    R
6.3G A            NOFRI3    R
     A            NOODAT    R
     A            NOOTIM    R
6.10 A            NOOUSR    R
     A            NOEDAT    R
     A            NOETIM    R
     A            NOEUSR    R
