      *
      * EDI BESTILLING
      *
     A          R NWEBPFR
     A            ORDLIN        80A         TEXT('EDI-linje')
     A                                      COLHDG('EDI-linje')
