      * Rapportering av status distribusjon av NXKORr
     A*
     A          R NXLOPFR                   PFILE(NXLOPF)
     A* Nøkkel
      *
     A          K NXTIST
