      *
      * Rapportering av status distribusjon av NXKORR
      *
      * NB!!!   DISSE MÅ LIGGE HER OG IKKE I NXCLOUD/NXKORR DA DE
      *         IKKE MÅ GENERERES I OPPGRADERINGSJOBBEN.
      *         GJØRES MANUELT DERSOM ENDRINGER MED
      *         NB!!!  NXLO*  kopieres herfra til NXKORR først.
      *         CALL AG930C ('NXLAPF    ' '800')  800 = Versjonsnr
      *         CALL AG930C ('NXLAPF    ' '630')  Bør også kjøres for disse.
      *         NB!!!  NXLO*  Slettes fra NXKORR etter generering.
      *
     A          R NXLOPFR
     A            NXDATO          L         COLHDG('Dato')
     A            NXTIME          T         COLHDG('Kl')
     A            NXJOBB        10A         COLHDG('Jobb')
     A            NXSEKV         3S 0       COLHDG('Sekv')
     A            NXPROG        10A         COLHDG('Prog')
     A            NXTEXT       200A         COLHDG('Tekst')
     A            NXUSER        10A         COLHDG('Bruker')
     A            NXTIST          Z         COLHDG('TimeStamp')
