      * Rapportering av status distribusjon av NXKORr
     A*
     A          R NXLOPFR                   PFILE(NXLOPF)
     A* Nøkkel
      *
     A          K NXDATO                    DESCEND
     A          K NXTIME                    DESCEND
     A          K NXSEKV
