      *
      * Betingleser fra Nobb-kontrakt
      *
     A          R PCBETPFR
     A            PCBET        240A         TEXT('Betingelse')
     A                                      COLHDG('Betingelse')
