      *
      * Slettede varer i ODA
      *
     A          R PCDLTPFR
     A            PCDLT        200A
     A                                      COLHDG('Slettet vare')
     A                                      TEXT('Slettet vare')
