      *
      * Vareinformsjon fra ODA
      *
     A          R PCINTPFR
     A            PCINT        298A         TEXT('Integrasjon')
     A                                      COLHDG('Integrasjon')
