      *
      * Produsentinformasjon fra ODA
      *
     A          R PCPROPFR
     A            PCPRO         80A         TEXT('Produsent')
     A                                      COLHDG('Produsent')
