      *
      * Rabattelementer fra Nobb-kontrakt
      *
     A          R PCRAEPFR
     A            PCRAE        240A         TEXT('Rabattelement')
     A                                      COLHDG('Rabattelement')
