      *
      * Stikkord fra ODA
      *
     A                                      REF(*LIBL/JFRF)
     A          R PCSTKPFR
     A            PCSTK        400A         TEXT('Stikkord')
     A                                      COLHDG('Stikkord')
