      *
      * Varegruppestruktur ODA
      *
     A                                      REF(*LIBL/JFRF)
     A          R PCVGRPFR
     A            PCVGR         80A         TEXT('Varegruppe')
     A                                      COLHDG('Varegruppe')
