      *
      * Vare- og prisanalyes
      *
     A                                      REF(*LIBL/FFRF)
     A          R QVPAPFR
      *
     A            VVFIRM    R
     A            VVVARE    R
     A            JVNOBB         8S 0       TEXT('Nobbnr')
     A                                      COLHDG('Nobbnr')
     A            JVTEK1        35A         TEXT('Varetekst-1')
     A                                      COLHDG('Varetekst-1')
     A            JVTEK2        35A         TEXT('Varetekst-2')
     A                                      COLHDG('Varetekst-2')
     A            JVOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogr')
     A            JVHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgr')
     A            JVUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugr')
     A            JVOGRA         2          TEXT('Overgruppe alfa')
     A                                      COLHDG('Ogr' 'alf')
     A            JVOGRB        50          TEXT('Overgruppe beskrivelse')
     A                                      COLHDG('Overgruppe beskr.')
     A            JVHGRA         4          TEXT('Hovedgruppe alfa')
     A                                      COLHDG('Hgr' 'alf')
     A            JVHGRB        50          TEXT('Hovedgruppe beskrivelse')
     A                                      COLHDG('Hovedgruppe beskr.')
     A            JVUGRA         7          TEXT('Undergruppe alfa')
     A                                      COLHDG('Ugr' 'alf')
     A            JVUGRB        50          TEXT('Undergruppe beskrivelse')
     A                                      COLHDG('Undergruppe beskr.')
     A            JVMODN         8S 0       TEXT('Modulnr')
     A                                      COLHDG('Modulnr')
     A            JVMTX1        35          TEXT('Modultekst 1')
     A                                      COLHDG('Modultekst 1')
     A            JVUDAT          L         TEXT('Nobb utgårdato')
     A                                      COLHDG('Nobb' 'utgårdato')
     A            VVLDOR    R
     A            VVNLEV    R
     A            VVLNAV        35          TEXT('Leverandørnavn')
     A                                      COLHDG('Leverandørnavn')
     A            VVKMVA    R
     A            VVKABC    R
     A            VVSORT    R
      *
     A            VPLDOR    R
     A            VPNLEV    R
     A            VPLNAV        35          TEXT('Leverandørnavn')
     A                                      COLHDG('Leverandørnavn')
     A            VPPRGR    R
     A            VPENHE    R
     A            VPLETY    R
     A            VPPDAT    R
     A            VPNOPR    R
     A            VPINPR    R
     A            VPKOPR    R
     A            VPSAPR    R
     A            VPSAIM         9S 2       TEXT('Salgspris ink.mva')
     A                                      COLHDG('Salgspris' 'inkl.mva')
     A            VPSM2P         9S 2       TEXT('M2-salgspris')
     A                                      COLHDG('M2-salgspris')
     A            VPSM2I         9S 2       TEXT('M2-salgspris inkl.mva')
     A                                      COLHDG('M2-salgspris' 'inkl.mva')
     A            VPEDAT    R
     A            VPETIM    R
     A            VPEUSR    R
      *
     A            NPOSTS         1          TEXT('Status')
     A                                      COLHDG('Sts')
      *
     A            NPPDAT          L         TEXT('Ny prisdato')
     A                                      COLHDG('Ny' 'prisdato')
     A            NPNOPR         9S 2       TEXT('Ny Nobb pris')
     A                                      COLHDG('Ny' 'Nobb pris')
     A            NPINP1         9S 2       TEXT('Ny innkjøpspris 1')
     A                                      COLHDG('Ny' 'innkj.pris 1')
     A            NPINP2         9S 2       TEXT('Ny innkjøpspris 2')
     A                                      COLHDG('Ny' 'innkj.pris 2')
     A            NPKOPR         9S 2       TEXT('Ny kostpris')
     A                                      COLHDG('Ny' 'kostpris')
     A            NPSAPR         9S 2       TEXT('Ny salgspris')
     A                                      COLHDG('Ny' 'salgspris')
     A            NPSAIM         9S 2       TEXT('Ny salgspris inkl.mva')
     A                                      COLHDG('Ny salgspris' 'inkl.mva')
     A            NPDEKN         5S 2       TEXT('Dekningsgrad')
     A                                      COLHDG('DG')
     A            NPSM2P         9S 2       TEXT('Ny M2-salgspris')
     A                                      COLHDG('Ny' 'M2-salgspris')
     A            NPSM2I         9S 2       TEXT('Ny M2-salgspris inkl.mva')
     A                                      COLHDG('Ny M2-salgspris' 'inkl.mva')
      *
     A            NPLDOR         6S 0       TEXT('Prisgiver')
     A                                      COLHDG('Prisgiver')
     A            NPLVAR        15          TEXT('Lev.varenr')
     A                                      COLHDG('Lev.varenr')
     A            NPELDO         6S 0       TEXT('Reskontro leverandør')
     A                                      COLHDG('Reskontro' 'lev.')
      *
     A            NPENHE         3          TEXT('Nobb prisenhet')
     A                                      COLHDG('Nobb' 'prisenh')
     A            NPENH1         3          TEXT('1. salgsenhet')
     A                                      COLHDG('1. salgs' 'enh')
     A            NPENH2         3          TEXT('2. salgsenhet')
     A                                      COLHDG('2. salgs' 'enh')
     A            NPENH3         3          TEXT('3. salgsenhet')
     A                                      COLHDG('3. salgs' 'enh')
     A            NPENI1         3          TEXT('1. innkjøpsenhet')
     A                                      COLHDG('1. innkj.' 'enh')
     A            NPENI2         3          TEXT('2. innkjøpsenhet')
     A                                      COLHDG('2. innkj.' 'enh')
     A            NPENI3         3          TEXT('3. innkjøpsenhet')
     A                                      COLHDG('3. innkj.' 'enh')
     A            NPENP1         3          TEXT('1. prisbokenhet')
     A                                      COLHDG('1. prisb.' 'enh')
     A            NPENP2         3          TEXT('2. prisbokenhet')
     A                                      COLHDG('2. prisb.' 'enh')
     A            NPENP3         3          TEXT('3. prisbokenhet')
     A                                      COLHDG('3. prisb.' 'enh')
      *
     A            NPOFA1        12S 6       TEXT('Omr.faktor 1. salgsenh.')
     A                                      COLHDG('Omr.fakt.' '1. salgsenh.')
     A            NPOFA2        12S 6       TEXT('Omr.faktor 2. salgsenh.')
     A                                      COLHDG('Omr.fakt.' '2. salgsenh.')
     A            NPOFA3        12S 6       TEXT('Omr.faktor 3. salgsenh.')
     A                                      COLHDG('Omr.fakt.' '3. salgsenh.')
      *
     A            NPBLDO         6S 0       TEXT('Bet. leverandør')
     A                                      COLHDG('Bet.' 'lev.')
     A            NPBOGR         2S 0       TEXT('Bet. overgruppe')
     A                                      COLHDG('Bet.' 'ogr')
     A            NPBHGR         2S 0       TEXT('Bet. hovedgruppe')
     A                                      COLHDG('Bet.' 'hgr')
     A            NPBUGR         3S 0       TEXT('Bet. undergruppe')
     A                                      COLHDG('Bet.' 'ugr')
     A            NPBMOD         8S 0       TEXT('Bet. modulnr')
     A                                      COLHDG('Bet.' 'modulnr')
     A            NPBVAR        15          TEXT('Bet. varenr')
     A                                      COLHDG('Bet.' 'varenr')
     A            NPBVTY         1          TEXT('Bet. varetype')
     A                                      COLHDG('Bet' 'VT')
     A            NPBLET         1S 0       TEXT('Bet. leveringstype')
     A                                      COLHDG('Bet.' 'LT')
     A            NPBBET        35          TEXT('Betingelse')
     A                                      COLHDG('Betingelse')
     A            NPNTPR         9S 2       TEXT('Nettopris')
     A                                      COLHDG('Nettopris')
     A            NPIFAK         8S 6       TEXT('Innkjprisfaktor')
     A                                      COLHDG('Innkjøpris' 'faktor')
      *
     A            NPPOGR         2S 0       TEXT('Pasl. overgruppe')
     A                                      COLHDG('Pasl.' 'ogr')
     A            NPPHGR         2S 0       TEXT('Pasl. hovedgruppe')
     A                                      COLHDG('Pasl.' 'hgr')
     A            NPPUGR         3S 0       TEXT('Pasl. undergruppe')
     A                                      COLHDG('Pasl.' 'ugr')
     A            NPPLDO         6S 0       TEXT('Pasl. leverandør')
     A                                      COLHDG('Pasl.' 'lev.')
     A            NPPMOD         8S 0       TEXT('Pasl. modulnr')
     A                                      COLHDG('Pasl.' 'modulnr')
     A            NPPVAR        15          TEXT('Pasl. varenr')
     A                                      COLHDG('Pasl.' 'varenr')
     A            NPPPKO         1          TEXT('Pasl. priskode')
     A                                      COLHDG('Pasl.' 'PK')
     A            NPPVTY         1          TEXT('Pasl. varetype')
     A                                      COLHDG('Pasl.' 'VT')
     A            NPPLET         1S 0       TEXT('Pasl. leveringstype')
     A                                      COLHDG('Pasl.' 'LT')
     A            NPKOFA         8S 6       TEXT('Kostpris-faktor')
     A                                      COLHDG('Kostpris' 'faktor')
     A                                      EDTCDE(2)
     A            NPKOBE         7S 2       TEXT('Kostpris-beløp')
     A                                      COLHDG('Kostpris' 'beløp')
     A                                      EDTCDE(K)
     A            NPSAFA         8S 6       TEXT('Salgspris-faktor')
     A                                      COLHDG('Salgspris' 'faktor')
      *
