      *
      * Vare- og prisanalyes
      *
      *
     A          R QVPAPFR                   PFILE(*LIBL/QVPAPF)
      *
     A          K VVFIRM    R
     A          K VVVARE    R
     A          K VPLDOR    R
     A          K VPPRGR    R
     A          K VPENHE    R
     A          K VPLETY    R
