      *
      * Bilagskoder
6.10  * R6.10 220909 NHO  Ny felt i forb. med bilagsnummer og hva som søkes
6.10  *                   i forbindelse med bilagsregistrering  debet/kredit
6.NU  * R6.30 220514 BOF  UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/RFRF)
     A          R RA01PFR
     A            RAAFIR    R
     A            RAAKOD    R
     A            RAATXT    R
     A            RAAKJØ    R
     A            RAAINK    R
     A            RAARNK    R
     A            RAAFAC    R
     A            RAASUM    R
     A            RAABNR    R
     A            RAAOPT    R
     A            RAADAT    R
     A            RAATIM    R
     A            RAAUSR    R
6.10 A            RADEBE    R
6.10 A            RAKRED    R
6.10 A            RABINU    R
6.10 A            RASPMA    R
