      *
      * Bilagskoder          Index=Read
      *
     A          R RA01PFR
     A                                      PFILE(*LIBL/RA01PF)
      *
     A          K RAAFIR
     A          K RAAKOD
