     A*  Betalingsmåter      Index=Alfa
     A*
     A          R RA02PFR                   PFILE(RA02PF)
     A* Nøkkel
     A          K RABFIR
     A          K RABTXT
     A          K RABKOD
