     A*  Betalingsmåter
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA02PFR
     A            RABFIR    R
     A            RABKOD    R
     A            RABTXT    R
     A            RABDAT    R
     A            RABTIM    R
     A            RABUSR    R
     A* Nøkkel
     A          K RABFIR
     A          K RABKOD
