     A*  Betalingsmåter      Index=Update
     A*
     A          R RA02PFR                   PFILE(RA02PF)
     A* Nøkkel
     A          K RABFIR
     A          K RABKOD
