     A* Betalingsbetingelser Index=Update
     A*
     A          R RA03PFR                   PFILE(RA03PF)
     A* Nøkkel
     A          K RACFIR
     A          K RACKOD
