     A* Betalingsbetingelser
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA03PFR
     A            RACFIR    R
     A            RACKOD    R
     A            RACTXT    R
     A            RACTX2    R
     A            RACDAG    R
     A            RACRAB    R
     A            RACJAN    R
     A            RACDA1    R
     A            RACDA2    R
     A            RACRA2    R
     A            RACDA3    R
     A            RACRA3    R
     A            RACDAT    R
     A            RACTIM    R
     A            RACUSR    R
     A* Nøkkel
     A          K RACFIR
     A          K RACKOD
