     A* Firmaopplysninger
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA04PFR
     A            RADFIR    R
     A            RADK01    R
     A            RADS01    R
     A            RADA01    R
     A            RADK02    R
     A            RADS02    R
     A            RADA02    R
     A            RADK03    R
     A            RADS03    R
     A            RADA03    R
     A            RADK04    R
     A            RADS04    R
     A            RADA04    R
     A            RADK05    R
     A            RADS05    R
     A            RADA05    R
     A            RADK06    R
     A            RADS06    R
     A            RADA06    R
     A            RADK07    R
     A            RADS07    R
     A            RADA07    R
     A            RADK08    R
     A            RADS08    R
     A            RADA08    R
     A            RADK11    R
     A            RADS11    R
     A            RADA11    R
     A            RADK12    R
     A            RADS12    R
     A            RADA12    R
     A            RADK13    R
     A            RADS13    R
     A            RADA13    R
     A            RADK14    R
     A            RADS14    R
     A            RADA14    R
     A            RADK15    R
     A            RADS15    R
     A            RADA15    R
     A            RADK16    R
     A            RADS16    R
     A            RADA16    R
     A            RADK17    R
     A            RADS17    R
     A            RADA17    R
     A            RADK19    R
     A            RADS19    R
     A            RADA19    R
     A            RADK20    R
     A            RADS20    R
     A            RADA20    R
     A            RADK21    R
     A            RADS21    R
     A            RADA21    R
     A            RADDAT    R
     A            RADTIM    R
     A            RADUSR    R
     A* Nøkkel
     A          K RADFIR
