     A* MVA-koder            Index=Read
     A*
     A          R RA05PFR                   PFILE(RA05PF)
     A* Nøkkel
     A          K RAEFIR
     A          K RAEKOD
