     A* MVA-koder            Index=Alfa
     A*
     A          R RA05PFR                   PFILE(RA05PF)
     A* Nøkkel
     A          K RAEFIR
     A          K RAETXT
     A          K RAEKOD
