     A* MVA-koder
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA05PFR
     A            RAEFIR    R
     A            RAEKOD    R
     A            RAETXT    R
     A            RAEPRO    R
     A            RAEINV    R
     A            RAEMDA    R
     A            RAEGPR    R
     A            RAEGIN    R
     A            RAEBMK    R
     A            RAEBPR    R
     A            RAEPDA    R
     A            RAEBGP    R
     A            RAEDAT    R
     A            RAETIM    R
     A            RAEUSR    R
     A* Nøkkel
     A          K RAEFIR
     A          K RAEKOD
