     A* Rabattkategori       Index=Read
     A*
     A          R RA06PFR                   PFILE(RA06PF)
     A* Nøkkel
     A          K RAFFIR
     A          K RAFKOD
