     A* Rabattkategori       Index=Alfa
     A*
     A          R RA06PFR                   PFILE(RA06PF)
     A* Nøkkel
     A          K RAFFIR
     A          K RAFTXT
     A          K RAFKOD
