     A* Rabatttkategori
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA06PFR
     A            RAFFIR    R
     A            RAFKOD    R
     A            RAFTXT    R
     A            RAFDAT    R
     A            RAFTIM    R
     A            RAFUSR    R
     A* Nøkkel
     A          K RAFFIR
     A          K RAFKOD
