     A* Avdelinger           Index=Update
     A*
     A          R RA07PFR                   PFILE(RA07PF)
     A* Nøkkel
     A          K RAGFIR
     A          K RAGKOD
