     A* Distrikter           Index=Read
     A*
     A          R RA08PFR                   PFILE(RA08PF)
     A* Nøkkel
     A          K RAHFIR
     A          K RAHKOD
