     A* Distrikter
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA08PFR
     A            RAHFIR    R
     A            RAHKOD    R
     A            RAHTXT    R
     A            RAHDAT    R
     A            RAHTIM    R
     A            RAHUSR    R
     A* Nøkkel
     A          K RAHFIR
     A          K RAHKOD
