      * Selgere              Index=Read
      *
     A          R RA09PFR
     A                                      PFILE(*LIBL/RA09PF)
      * Nøkkel
     A          K RAIFIR
     A          K RAIKOD
