      * Selger-register
      *
     A                                      REF(*LIBL/RFRF)
     A          R RA09PFR
     A            RAIFIR    R
     A            RAIKOD    R
     A            RAITXT    R
     A            RAIKTO    R
     A            RAIRSK    R
     A            RAIMVA    R
     A            RAIPRK    R
     A            RAIBLK    R
     A            RAISA2    R
     A            RAISA3    R
     A            RAISA4    R
     A            RAISA5    R
     A            RAIEMA    R
6.10 A            RAIMOB    R
     A            RAIDAT    R
     A            RAITIM    R
     A            RAIUSR    R
