     A* Lagere               Index=Update
     A*
     A          R RA10PFR                   PFILE(RA10PF)
     A* Nøkkel
     A          K RAJFIR
     A          K RAJKOD
