     A* Lagere               Index=Alfa
     A*
     A          R RA10PFR                   PFILE(RA10PF)
     A* Nøkkel
     A          K RAJFIR
     A          K RAJTXT
     A          K RAJKOD
