      *
      * Lagere
      *
     A          R RA10PFR                   PFILE(RA10PF)
      *
     A          K RAJFIR
     A          K RAJAVD
     A          K RAJKOD
