     A* Kundekategori        Index=Update
     A*
     A          R RA11APFR                  PFILE(RA11APF)
     A* Nøkkel
     A          K RAKFIR
     A          K RAKKOD
