     A* Kundekategori        Index=Update
     A*
     A          R RA11PFR                   PFILE(RA11PF)
     A* Nøkkel
     A          K RAKFIR
     A          K RAKKOD
