     A* Kundekategori
     A*      Denne record sier foreløpig at kategorien er for ansatte
     A                                      REF(*LIBL/RFRF)
     A          R RA11APFR
     A            RAKFIR    R
     A            RAKKOD    R
     A            RAKTXT    R
     A            RAKKTO    R
     A            RAKSPS    R
     A            RAKAVD    R
     A            RAKKAT    R
     A            RAKAVP    R
T5.40A            RAKBEB    R
T5.40A            RAKBEM    R
T5.40A            RAKPPA    R
T5.40A            RAKNTO    R
T5.40A            RAKSAM    R
T5.40A            RAKSEK    R
T5.40A            RAKBOK    R
T5.30A            RAKORG    R
T5.41A            RAKPNR    R
T5.41A            RAKKPE    R
T5.41A            RAKTLF    R
T5.41A            RAKFAX    R
T5.41A            RAKEMA    R
     A            RAKGRN    R
     A            RABGRN    R
     A            RAKDAT    R
     A            RAKTIM    R
     A            RAKUSR    R
     A* Nøkkel
     A          K RAKFIR
     A          K RAKKOD
