     A* Landkoder            Index=Read
     A*
     A          R RA12PFR                   PFILE(RA12PF)
     A* Nøkkel
     A          K RALFIR
     A          K RALKOD
