     A* Fordelingsnøkler     Index=Read
     A*
     A          R RA13PFR                   PFILE(RA13PF)
     A* Nøkkel
     A          K RAMFIR
     A          K RAMKOD
