     A* Fordelingsnøkler
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA13PFR
     A            RAMFIR    R
     A            RAMKOD    R
     A            RAMTXT    R
     A            RAMP01    R
     A            RAMP02    R
     A            RAMP03    R
     A            RAMP04    R
     A            RAMP05    R
     A            RAMP06    R
     A            RAMP07    R
     A            RAMP08    R
     A            RAMP09    R
     A            RAMP10    R
     A            RAMP11    R
     A            RAMP12    R
     A            RAMP13    R
     A            RAMDAT    R
     A            RAMTIM    R
     A            RAMUSR    R
     A* Nøkkel
     A          K RAMFIR
     A          K RAMKOD
