     A* Leverandørkategori   Index=Read
     A*
     A          R RA14PFR                   PFILE(RA14PF)
     A* Nøkkel
     A          K RANFIR
     A          K RANKOD
