     A*  Koderegister - Leverandørkategori
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA14PFR
     A            RANFIR    R
     A            RANKOD    R
     A            RANTXT    R
     A            RANKTO    R
     A            RANSPS    R
     A            RANAVD    R
     A            RANKAT    R
T5.50A            RANORG    R
T5.50A            RANBGI    R
T5.50A            RANKPE    R
T5.50A            RANTLF    R
T5.50A            RANFAX    R
T5.50A            RANEMA    R
     A            RANDAT    R
     A            RANTIM    R
     A            RANUSR    R
     A* Nøkkel
     A          K RANFIR
     A          K RANKOD
