     A* Mengdekode           Index=Alfa
     A*
     A          R RA15PFR                   PFILE(RA15PF)
     A* Nøkkel
     A          K RAOFIR
     A          K RAOTXT
     A          K RAOKOD
