     A* Valutakoder          Index=Update
     A*
     A          R RA16PFR                   PFILE(RA16PF)
     A* Nøkkel
     A          K RAPFIR
     A          K RAPKOD
