     A* Forsendelsesmåter    Index=Update
     A*
     A          R RA17PFR                   PFILE(RA17PF)
     A* Nøkkel
     A          K RAQFIR
     A          K RAQKOD
