     A* Forsendelsesmåter
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA17PFR
     A            RAQFIR    R
     A            RAQKOD    R
     A            RAQTXT    R
     A            RAQDIR    R
     A            RAQKJO    R
6.34 A            RAQSMK    R
6.34 A            RAQSMS    R
     A            RAQDAT    R
     A            RAQTIM    R
     A            RAQUSR    R
     A* Nøkkel
     A          K RAQFIR
     A          K RAQKOD
