     A*  Koderegister - Leveringsbetingelser
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA18PFR
     A            RARFIR    R
     A            RARKOD    R
     A            RARTX1    R
     A            RARTX2    R
     A            RARTX3    R
     A            RARDAT    R
     A            RARTIM    R
     A            RARUSR    R
     A* Nøkkel
     A          K RARFIR
     A          K RARKOD
