     A* Leveringsbetingelser Index=Alfa
     A*
     A          R RA18PFR                   PFILE(RA18PF)
     A* Nøkkel
     A          K RARFIR
     A          K RARTX1
     A          K RARKOD
