     A* Leveringsbetingelser Index=Update
     A*
     A          R RA18PFR                   PFILE(RA18PF)
     A* Nøkkel
     A          K RARFIR
     A          K RARKOD
