     A* Kontoklasser
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA19PFR
     A            RASFIR    R
     A            RASKOD    R
     A            RASTXT    R
     A            RASSDK    R
     A            RASBFA    R
T5.60A            RASPG1    R
T5.60A            RASPG2    R
T5.60A            RASPG3    R
T5.60A            RASPG4    R
T5.60A            RASPG5    R
     A            RASDAT    R
     A            RASTIM    R
     A            RASUSR    R
     A* Nøkkel
     A          K RASFIR
     A          K RASKOD
