     A* Kontoklasser         Index=Alfa
     A*
     A          R RA19PFR                   PFILE(RA19PF)
     A* Nøkkel
     A          K RASFIR
     A          K RASTXT
     A          K RASKOD
