     A* Lagere
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA1XPFR
     A            RAJ2FI    R
     A            RAJ2KO    R
     A            RAJ2LA    R
     A            RAJ2DA    R
     A            RAJ2TI    R
     A            RAJ2US    R
