     A* Lagere               Index=Update
     A*
     A          R RA1XPFR                   PFILE(RA1XPF)
     A* Nøkkel
     A          K RAJ2FI
     A          K RAJ2KO
