     A* Kontogrupper         Index=Alfa
     A*
     A          R RA20PFR                   PFILE(RA20PF)
     A* Nøkkel
     A          K RATFIR
     A          K RATTXT
     A          K RATKOD
