     A* Aktiviteter          Index=Read
     A*
     A          R RA21PFR                   PFILE(RA21PF)
     A* Nøkkel
     A          K RAUFIR
     A          K RAUKOD
