     A* Aktiviteter
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA21PFR
     A            RAUFIR    R
     A            RAUKOD    R
     A            RAUTXT    R
     A            RAUTX2    R
     A            RAUKTO    R
     A            RAUSPS    R
     A            RAUAVD    R
     A            RAUPKT    R
     A            RAUPSP    R
     A            RAUPAV    R
     A            RAUPMV    R
     A            RAUFKT    R
     A            RAUFSP    R
     A            RAUFAV    R
     A            RAUFMV    R
     A            RAUPRI    R
     A            RAUMUD    R
     A            RAUFAK    R
     A            RAUMNG    R
     A            RAUMVA    R
     A            RAURAB    R
     A            RAURBK    R
     A            RAUDAT    R
     A            RAUTIM    R
     A            RAUUSR    R
     A* Nøkkel
     A          K RAUFIR
     A          K RAUKOD
