     A* Speditører           Index=Alfa
     A*
     A          R RA22PFR                   PFILE(RA22PF)
     A* Nøkkel
     A          K RAVFIR
     A          K RAVTXT
     A          K RAVKOD
