     A*  Koderegister - Speditører
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA22PFR
     A            RAVFIR    R
     A            RAVKOD    R
     A            RAVTXT    R
     A            RAVFRA    R
     A            RAVDAT    R
     A            RAVTIM    R
     A            RAVUSR    R
     A* Nøkkel
     A          K RAVFIR
     A          K RAVKOD
