     A*  Koderegister - Virksomhetskoder
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA23PFR
     A            RAWFIR    R
     A            RAWKOD    R
     A            RAWTXT    R
     A            RAWBPK    R
     A            RAWKTO    R
     A            RAWSPS    R
     A            RAWAVD    R
     A            RAWBIK    R
     A            RAWDAT    R
     A            RAWTIM    R
     A            RAWUSR    R
     A* Nøkkel
     A          K RAWFIR
     A          K RAWKOD
