      * Reklamasjonsårsak
      *
     A                                      REF(*LIBL/RFRF)
     A          R RA24PFR
     A            RAXFIR    R
     A            RAXRKO    R
     A            RAXTXT    R
     A            RAXDAT    R
     A            RAXTIM    R
     A            RAXUSR    R
