      * Reklamasjonsårsak    Index=Read
      *
     A          R RA24PFR
     A                                      PFILE(*LIBL/RA24PF)
      * Nøkkel
     A          K RAXFIR
     A          K RAXRKO
