      * Reklamasjonsårsak    Index=Alfa
      *
     A          R RA24PFR
     A                                      PFILE(*LIBL/RA24PF)
      *
     A          K RAXFIR
     A          K RAXTXT
     A          K RAXRKO
