      * Kjøreruter
      *
     A                                      REF(*LIBL/RFRF)
     A          R RA25PFR
     A            RAYFIR    R
     A            RAYRUT    R
     A            RAYTXT    R
     A            RAYDAT    R
     A            RAYTIM    R
     A            RAYUSR    R
