      * Produktansvarlig     Index=Read
      *
     A          R RA26PFR
     A                                      PFILE(*LIBL/RA26PF)
      * Nøkkel
     A          K RAZFIR
     A          K RAZSAK
