      * Produktansvarlig
      *
     A                                      REF(*LIBL/RFRF)
     A          R RA26PFR
     A            RAZFIR    R
     A            RAZSAK    R
     A            RAZTXT    R
     A            RAZEMA    R
     A            RAZDAT    R
     A            RAZTIM    R
     A            RAZUSR    R
