      * Kostnadsbærergruppe
      *
     A                                      REF(*LIBL/RFRF)
     A          R RA27PFR
     A            REAFIR    R
     A            REAGRP    R
     A            REATXT    R
     A            READAT    R
     A            REATIM    R
     A            REAUSR    R
