      * Kostnadsbærergruppe  Index=Alfa
      *
     A          R RA27PFR
     A                                      PFILE(*LIBL/RA27PF)
      * Nøkkel
     A          K REAFIR
     A          K REATXT
     A          K REAGRP
