      * Kostnadsbærer        Index=Read
      *
     A          R RA28PFR
     A                                      PFILE(*LIBL/RA28PF)
      * Nøkkel
     A          K REBFIR
     A          K REBKOD
