      * Kostnadsbærer
      *
     A                                      REF(*LIBL/RFRF)
     A          R RA28PFR
     A            REBFIR    R
     A            REBKOD    R
     A            REBTXT    R
     A            REBGRP    R
     A            REBSPR    R
     A            REBDAT    R
     A            REBTIM    R
     A            REBUSR    R
