      *
      * Mobiloperatør        Index=Update
      *
     A          R RA29PFR
     A                                      PFILE(*LIBL/RA29PF)
      * Nøkkel
     A          K RECFIR
     A          K RECKOD
