      *
      * Prisgrupper          Index=Update
      *
     A          R RA30PFR
     A                                      PFILE(*LIBL/RA30PF)
      * Nøkkel
     A          K REDFIR
     A          K REDKOD
