      * Prisgrupper
      *
     A                                      REF(*LIBL/RFRF)
     A          R RA30PFR
     A            REDFIR    R
     A            REDKOD    R
     A            REDTXT    R
     A            REDDAT    R
     A            REDTIM    R
     A            REDUSR    R
