     A* Leveringsmåte bestilling
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA31PFR
     A            REEFIR    R
     A            REEKOD    R
     A            REETXT    R
     A            REEEDI    R
     A            REEDAT    R
     A            REETIM    R
     A            REEUSR    R
     A* Nøkkel
     A          K REEFIR
     A          K REEKOD
