     A* Leveringsmåte bestilling    Index=Alfa
     A*
     A          R RA31PFR                   PFILE(RA31PF)
     A* Nøkkel
     A          K REEFIR
     A          K REETXT
     A          K REEKOD
