     A* Leveringsmåte bestilling  Index=Update
     A*
     A          R RA31PFR                   PFILE(RA31PF)
     A* Nøkkel
     A          K REEFIR
     A          K REEKOD
