     A* Kundegruppe - Zilliant
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA32PFR
     A            REFFIR    R
     A            REFKOD    R
     A            REFBES    R
     A            REFODA    R
     A            REFOTI    R
     A            REFOUS    R
     A            REFEDA    R
     A            REFETI    R
     A            REFEUS    R
      *
