     A* Kundegruppe
     A*
     A          R RA32PFR                   PFILE(RA32PF)
     A* Nøkkel
     A          K REFFIR
     A          K REFKOD
