      * Returkoder           Index=DTXT/DKOD
      *
     A          R RA50PFR
     A                                      PFILE(*LIBL/RA50PF)
      * Nøkkel
     A          K REGFIR
     A          K REGTXT
     A          K REGKOD
