      *
      * Returkoder           Index=Update
      *
     A          R RA50PFR
     A                                      PFILE(*LIBL/RA50PF)
      * Nøkkel
     A          K REGFIR
     A          K REGKOD
