      * Returkoder
      *
     A                                      REF(*LIBL/RFRF)
     A          R RA50PFR
     A            REGFIR    R
     A            REGKOD    R
     A            REGTXT    R
     A            REGDAT    R
     A            REGTIM    R
     A            REGUSR    R
