     A*  Koderegister - Formulartekster
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RA70PFR
     A            R70FIR    R
     A            R70KOD    R
     A            R70SPR    R
     A            R70LIN    R
     A            R70LTX    R
