     A*  Koderegister - Formulartekster, Logisk file for read
     A*
     A          R RA70PFR                   PFILE(RA70PF)
     A* Nøkkel
     A          K R70FIR
     A          K R70KOD
     A          K R70SPR
     A          K R70LIN
