     A* Avdelinger           Index=Update
     A*
     A          R RA90PFR                   PFILE(RA90PF)
     A* Nøkkel
     A          K RAGFIR
     A          K RAGKOD
