     A* Kobling mellom lager og region
     A*
     A          R RA91PFR                   PFILE(RA91PF)
     A* Nøkkel
     A          K RRFIRM
     A          K RRREGI
     A          K RRLAGE
