     A* Kobling mellom lager og region
     A*
     A          R RA91PFR
     A            RRFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A            RRREGI         2S 0       TEXT('Regionskode')
     A                                      COLHDG('Regionskode')
     A            RRLAGE         2S 0       TEXT('Lagerkode')
     A                                      COLHDG('Lagerkode')
     A            RRRTEK        30A         TEXT('Region')
     A                                      COLHDG('Region')
     A            RRLTEK        20A         TEXT('Lager')
     A                                      COLHDG('Lager')
     A            RREBIZ         1S 0       TEXT('Til ehandel')
     A                                      COLHDG('Til ehandel')
     A            RRKJED         2A         TEXT('Kjede')
     A                                      COLHDG('Kjede')
