     A*  Koderegister - Statusopplysninger
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RAA1PFR
     A            RA1FIR    R
     A            RA1BKK    R
     A            RA1BKL    R
     A            RA1PER    R
     A            RA1AAR    R
     A            RA1HKT    R
     A            RA1HRS    R
     A            RA1ARS    R
     A            RA1BNR    R
     A            RA1BIK    R
     A            RA1BIT    R
     A            RA1BID    R
     A            RA1BIN    R
     A            RA1REF    R
     A            RA1LFA    R
     A            RA1AKR    R
     A            RA1KTO    R
     A            RA1AVD    R
     A            RA1SPS    R
     A            RA1MVA    R
     A            RA1BLP    R
     A            RA1PRO    R
     A            RA1RAB    R
     A            RA1VRK    R
     A            RA1AKT    R
     A            RA1MGN    R
     A            RA1VKO    R
     A            RA1VBE    R
     A            RA1FTX    R
     A            RA1FOR    R
     A            RA1ATT    R
     A            RA1KID    R
     A            RA1DKO    R
     A            RA1AVS    R
     A            RA1BEK    R
     A            RA1BEL    R
     A            RA1KSP    R
     A            RA1APE    R
     A            RA1BUN    R
     A            RA1SKD    R
     A            RA1PRE    R
     A            RA1DAT    R
     A            RA1TIM    R
     A            RA1USR    R
     A* Nøkkel
     A          K RA1FIR
