     A*  Koderegister - Statusopplysninger, Logisk file for les
     A*
     A          R RAA1PFR                   PFILE(RAA1PF)
     A* Nøkkel
     A          K RA1FIR
