     A*  Koderegister - Statusopplysninger
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RAA2PFR
     A            RA2FIR    R
     A            RA2BBK    R
     A            RA2BMK    R
     A            RA2AKO    R
     A            RA2ABK    R
     A* Nøkkel
     A          K RA2FIR
