     A*  Koderegister - Statusopplysninger, Logisk file for update
     A*
     A          R RAA2PFR                   PFILE(RAA2PF)
     A* Nøkkel
     A          K RA2FIR
