     A*  Koderegister - Statusopplysninger, Logisk file for les
     A*
     A          R RAA3PFR                   PFILE(RAA3PF)
     A* Nøkkel
     A          K RA3FIR
