     A*  Koderegister - Statusopplysninger
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RAA3PFR
     A            RA3FIR    R
     A            RA3P01    R
     A            RA3P02    R
     A            RA3P03    R
     A            RA3P04    R
     A            RA3P05    R
     A            RA3P06    R
     A            RA3P07    R
     A            RA3P08    R
     A            RA3P09    R
     A            RA3P10    R
     A            RA3P11    R
     A            RA3P12    R
     A            RA3P13    R
     A            RA3STP    R
     A            RA3SDA    R
     A            RA3KA1    R
     A            RA3KA2    R
     A            RA3KA3    R
     A            RA3LA1    R
     A            RA3LA2    R
     A            RA3LA3    R
     A            RA3SAK    R
     A            RA3MFE    R
     A            RA3MFL    R
     A            RA3KBR    R
     A            RA3BÆR    R
     A            RA3DAT    R
     A            RA3TIM    R
     A            RA3USR    R
     A* Nøkkel
     A          K RA3FIR
