     A*  Koderegister - Statusopplysninger
     A*
6.10  * R6.13 110603 NHO  Ny felt i forb. med sporingsref og avkr. ref.ttet
6.NU  * R6.30 220514 BOF  UTVIDELSE NUMMERSERIE
6.10  *                                                                tt og
     A                                      REF(*LIBL/RFRF)
     A          R RAA4PFR
     A            RA4FIR    R
     A            RA4AAR    R
     A            RA4SAM    R
     A            RA4SNO    R
     A            RA4SUG    R
     A            RA4SIG    R
     A            RA4SJÅ    R
     A            RA4SPJ    R
     A            RA4SGB    R
     A***         RA4SRB    R
     A***         RA4SUB    R
     A***         RA4SLN    R
     A***         RA4SUF    R
     A            RA4SIF    R
     A***         RA4SBU    R
     A            RA4KNR    R
     A            RA4LNR    R
     A            RA4PNR    R
     A            RA4KRT    R
     A            RA4DAT    R
     A            RA4TIM    R
     A            RA4USR    R
6.10 A            RA4SPO    R
6.10 A            RA4AVK    R
