     A*  Koderegister - Statusopplysninger, Les
     A*
     A          R RAA4PFR                   PFILE(RAA4PF)
     A* Nøkkel
     A          K RA4FIR
     A          K RA4AAR
