     A*  Koderegister - Statusopplysninger
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RAA5PFR
     A            RA5FIR    R
     A            RA5LDG    R
     A            RA5RPM    R
     A            RA5RPR    R
     A            RA5RGR    R
     A            RA5RMN    R
     A            RA5RPG    R
     A            RA5RPO    R
     A            RA5RGB    R
     A            RA5GEB    R
     A            RA5PBT    R
     A            RA5RRN    R
     A            RA5RFK    R
     A            RA5RTK    R
     A            RA5RKT    R
     A            RA5RAF    R
     A            RA5RTX    R
     A            RA5IDA    R
     A            RA5RBS    R
     A            RA5RPU    R
     A            RA5KPR    R
     A            RA5TFN    R
     A            RA5EML    R
     A            RA5BFO    R
     A            RA5BFI    R
     A            RA5DAT    R
     A            RA5TIM    R
     A            RA5USR    R
     A* Nøkkel
     A          K RA5FIR
