     A*  Koderegister - Statusopplysninger, Logisk file for les
     A*
     A          R RAA5PFR                   PFILE(RAA5PF)
     A* Nøkkel
     A          K RA5FIR
