     A*  Koderegister - Statusopplysninger, Logisk file for les
     A*
     A          R RAA6PFR                   PFILE(RAA6PF)
     A* Nøkkel
     A          K RA6FIR
