     A*  Koderegister - Statusopplysninger, Logisk file for les
     A*
     A          R RAA7PFR                   PFILE(RAA7PF)
     A* Nøkkel
     A          K RA7FIR
