     A*  Koderegister - Statusopplysninger
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RAA8PFR
     A            RA8FIR    R
     A            RA8EAN    R
     A            RA8IBM    R
     A            RA8TST    R
     A            RA8DAT    R
     A            RA8TIM    R
     A            RA8USR    R
