     A*  Koderegister - Statusopplysninger, Logisk file for les
     A*
     A          R RAA8PFR                   PFILE(RAA8PF)
     A* Nøkkel
     A          K RA8FIR
