     A*  Koderegister - Statusopplysninger, Logisk file for update
     A*
     A          R RAA9PFR                   PFILE(RAA9PF)
     A* Nøkkel
     A          K RA9FIR
