     A*  Koderegister - Statusopplysninger
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RAA9PFR
     A            RA9FIR    R
     A            RA9KNR    R
     A            RA9FMT    R
     A            RA9KLI    R
     A            RA9KUN    R
     A            RA9REG    R
     A            RA9BIL    R
6.10 A            RA9ODA    R
6.10 A            RA9OTI    R
6.10 A            RA9OUS    R
     A            RA9DAT    R
     A            RA9TIM    R
     A            RA9USR    R
