     A* Forsendelsesmåter    Index=Read
     A*
     A          R RAF2PFR                   PFILE(RAF2PF)
     A* Nøkkel
     A          K RA2FIR
     A          K RA2KOD
