     A* Forsendelsesmåter
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RAF2PFR
      *
     A            RA2FIR         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
      *
     A            RA2KOD         2S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Forsendelse')
      *
     A            RA2FLT         1S 0       TEXT('Flåtestyrt')
     A                                      COLHDG('Flåtestyrt')
     A                                      EDTCDE(Z)
      *
     A            RA2FID        35A         TEXT('Transportørid')
     A                                      COLHDG('Transportørid')
      *
     A            RA2EDA          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
      *
     A            RA2ETI          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
      *
     A            RA2EUS        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
      *
     A            RA2DAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
      *
     A            RA2OTI          T         TEXT('Opprettet tidspunkt')
     A                                      COLHDG('Oppr.tid')
      *
     A            RA2OUS        10A         TEXT('Opprettet av')
     A                                      COLHDG('Oppr. av')
     A*
