      *
      * Almenning
      *
     A          R RALMPFR                   PFILE(*LIBL/RALMPF)
      *
     A          K RMFIRM
     A          K RMALME
