      *
      * Almenning
      *
     A                                      REF(*LIBL/RFRF)
     A          R RALMPFR
     A            RMFIRM    R
     A            RMALME    R
     A            RMNAVN    R
     A            RMADR1    R
     A            RMADR2    R
     A            RMPONR    R
     A            RMTLFN    R
     A            RMFAKS    R
     A            RMMAIL    R
     A            RMURLA    R
     A            RMKPRS    R
     A            RMKTLF    R
     A            RMKMOB    R
     A            RMKMAI    R
     A            RMBGRN    R
     A            RMODAT    R
     A            RMEDAT    R
     A            RMETIM    R
     A            RMEUSR    R
      *
