     A* MVA-koder  Tillegg
     A*
     A*
     A          R RAT5PFR
     A            RTEFIR         3S 0       COLHDG('Firma')
     A            RTEKOD         1          COLHDG('Momskode')
     A            RTESMK         2S 0       COLHDG('Std.Mvakode')
     A            RTSPSS         1          COLHDG('Spes.Saft')
     A            RTPRUT         6A         COLHDG('Uttak prosjekt')
     A            RTEEUS        10          COLHDG('Endret BRUKER')
     A            RTEEDA          L         COLHDG('Endret DATO')
     A            RTEETI          T         COLHDG('Endret KL')
     A* Nøkkel
     A          K RTEFIR
     A          K RTEKOD
