      * Selgere              Index=Update
      *
     A          R RAX9PFR
     A                                      PFILE(*LIBL/RAX9PF)
      * Nøkkel
     A          K RAIFIR
     A          K RAIKOD
