      * Selger-register
      *
     A                                      REF(*LIBL/RFRF)
     A          R RAX9PFR
     A            RAIFIR    R
     A            RAIKOD    R
     A            RAIK01    R
     A            RAIK02    R
     A            RAIK03    R
     A            RAIK04    R
     A            RAIK05    R
     A            RAIK06    R
     A            RAIK07    R
     A            RAIK08    R
     A            RAIK09    R
     A            RAIK10    R
     A            RAIDAT    R
     A            RAITIM    R
     A            RAIUSR    R
