     A*  KODER       - Gammel/Ny
     A*
     A          R RB00PFR                   PFILE(RB00PF)
     A* Nøkkel
     A          K R00FIR
     A          K R00TYP
     A          K R00KOD
