     A*  KODER       - GAMMEL/NY
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RB00PFR
     A            R00FIR    R               REFFLD(RAEFIR)
     A            R00TYP        10A
     A            R00KOD         6A
     A            R00NKO         6A         TEXT('NY KODE')
     A                                      COLHDG('NY KODE')
     A            R00TXT    R               REFFLD(RAETXT)
     A            R00DAT    R               REFFLD(RAEDAT)
     A            R00TIM    R               REFFLD(RAETIM)
     A            R00USR    R               REFFLD(RAEUSR)
