     A*  Bilagstyper - Gammel/Ny
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RB10PFR
     A            RAAFIR    R
     A            RAAKOD    R
     A            RANKOD         5S 0       TEXT('Ny bilagskode')
     A                                      COLHDG('Ny bilagskode')
     A            RAATXT    R
     A            RAFIRB         8
     A            RAADAT    R
     A            RAATIM    R
     A            RAAUSR    R
