     A*  Bilagstyper - Gammel/Ny
     A*
     A          R RB10PFR                   PFILE(RB10PF)
     A* Nøkkel
     A          K RAAFIR
     A          K RAATXT
     A          K RAAKOD
