     A*  Registrering - Buntfile Physical file
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RBUNPFR
610  A            RSNIVO    R
610  A            RSMEMB    R
     A            RSFIRM    R
     A            RSBUNT    R
     A            RSREID    R
     A            RSSTAT    R
     A            RSRAAR    R
     A            RSRPER    R
     A            RSFØRS    R
     A            RSSIST    R
     A            RSPDAT    R
     A            RSBSUM    R
     A            RSPSUM    R
     A            RSPDEB    R
     A            RSPKRE    R
6.37 A            RSPTYP    R
610  A            RSEDAT    R
610  A            RSETIM    R
610  A            RSEUSR    R
