     A*  Registrering - Buntfile Logisk file for update
     A*
     A          R RBUNPFR                   PFILE(RBUNPF)
     A*
     A* Nøkkel
     A*
610  A          K RSNIVO
610  A          K RSMEMB
     A          K RSFIRM
     A          K RSRAAR
     A          K RSRPER
     A          K RSPDAT
