     A*  Inkasso - status - faste opplysninger
     A*  ------------
     A          R RCA0PFR                   PFILE(RCA0PF)
     A* Nøkkel
     A          K RC0FIR
