     A*  Inkasso - statuskoder - faste opplysninger
     A*  ------------
     A                                      REF(*LIBL/RFRF)
     A          R RCA0PFR
     A            RC0FIR    R
     A            RC0TXT    R
     A            RC0CNK    R
     A            RC0RNT    R
     A            RC0INR    R
     A            RC0BIK    R
     A            RC0KTO    R
     A            RC0SPS    R
     A            RC0AVD    R
     A            RC0PRT    R
     A            RC0INF        10          TEXT('Inkassobyrå')
     A            RCUBK1         2  0       TEXT('Utelate Bilagskode1')
     A            RCUBK2         2  0       TEXT('Utelate Bilagskode2')
     A            RCUBK3         2  0       TEXT('Utelate Bilagskode3')
     A            RCUBK4         2  0       TEXT('Utelate Bilagskode4')
     A            RCUBK5         2  0       TEXT('Utelate Bilagskode5')
     A            RCBKK1         2  0       TEXT('Bilagskode Kr.nota1')
     A            RCBKK2         2  0       TEXT('Bilagskode Kr.nota2')
     A            RCBKK3         2  0       TEXT('Bilagskode Kr.nota3')
     A            RCBKK4         2  0       TEXT('Bilagskode Kr.nota4')
     A            RCBKK5         2  0       TEXT('Bilagskode Kr.nota5')
     A            RC0DAT    R
     A            RC0TIM    R
     A            RC0USR    R
