     A*  REGISTRERING - POSTERINGER
     A*
     A          R RCMDPFR                   PFILE(RCMDPF)
      *
      * NØKKEL
      *
     A          K RTFGRP
     A          K RTFIRM
     A          K RTRAAR
     A          K RTHUID
