     A*  REGISTRERING - POSTERINGER
     A*
     A          R RCMDPFR                   PFILE(RCMDPF)
      *
      * NØKKEL
      *
     A          K RTFGRP
     A          K RTFIRM
     A          K RTRAAR                    DESCEND
     A          K RTRPER                    DESCEND
     A          K RTBILN                    DESCEND
