     A*  Registrering - posteringer
     A*
     A          R RCMPPFR                   PFILE(RCMPPF)
      *
      * Nøkkel
      *
     A          K RTFGRP
     A          K RTHUID
     A          S RTHENT                    COMP(NE 'J')
