     A*  Registrering - posteringer
     A*
     A          R RCMPPFR                   PFILE(RCMPPF)
      *
      * Nøkkel
      *
     A          K RTFGRP
     A*         K RTHUID
     A          K RTRAAR
     A          K RTRPER
     A          K RTBILN
     A          K RTCKTO
     A          K RTDKTO
     A          S RTHENT                    COMP(NE 'J')
