     A*  COMPELLO Ta vare på reskontronr pr bilag
     A*
     A          R RCMRPFR                   PFILE(RCMRPF)
      *
      * NØKKEL
      *
     A          K RTFIRM
     A          K RTBILN
