     A*  COMPELLO Ta vare på reskontronr pr bilag
      *
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RCMRPFR
     A            RTFIRM    R
     A            RTBILN    R
     A            RTRESN    R
     A            RTRAAR    R
     A            RTRPER    R
