     A*  Rapporteringsgrunnlag - Logisk update
     A*  ------------
     A          R RCNFPFR                   PFILE(RCNFPF)
     A* Nøkkel
     A          K RCNFIR
     A          K RCNSAK
     A          K RCNASK
