     A*  Rapporteringsgrunnlag
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
     A*  ---------------------
     A                                      REF(*LIBL/RFRF)
     A          R RCNFPFR
     A            RCNSTA    R
     A            RCNFIR    R
     A            RCNASK    R
     A            RCNASB    R
     A            RCBDAT    R
     A            RCNCNK    R
     A            RCNREF    R
     A            RCNSAK    R
     A            RCNSTO    R
     A            RCNOMK    R
     A            RCNRNT    R
     A            RCNPRV    R
     A            RCNDAT    R
     A            RCNAVR    R
     A            RCNOVÅ    R
     A            RCNLED    R
     A            RCNINB    R
     A            RCNINR    R
