     A*  Rapporteringsgrunnlag - Logisk update
     A*  ------------
     A          R RCNFPFR                   PFILE(RCNFPF)
     A* Nøkkel
     A          K RCNREF
     A          K RCNSAK
