     A*  RETURER     (grunnlag)
     A*  ---------------------
     A                                      REF(*LIBL/RFRF)
     A          R RCNRPFR
     A            RCN130       130A         TEXT('Inkasso trans')
