     A*  Forsendelse (grunnlag)
     A*  ---------------------
     A                                      REF(*LIBL/RFRF)
     A          R RCNSPFR
     A            RCN130    R
