     A*  Forsendelse av Innbetalinger/Feil/Korreksjoner
     A*  ---------------------
     A                                      REF(*LIBL/RFRF)
     A          R RCNTPFR
     A            RCN130    R
