      *
      * POSTER FOR OVERFØRING TIL COGNOS
      *
     A          R RCOGPFR
     A            CKPERI         4A         TEXT('Periode')
     A            CKACTU         2A         TEXT('Kode')
     A            CKCOMP         3A         TEXT('Filgruppe')
     A            CKAMNT        13S 2       TEXT('Beløp')
     A            CKKNTO         5S 0       TEXT('Konto')
     A            CKIDNT         6A         TEXT('Partner nummer')
     A            CKVALU         3A         TEXT('Valuta')
     A            CKDIM1        10A         TEXT('Dimensjon')
     A**TEST      CKJRNR         5S 0       TEXT('Journal')
      *
