     A*  Integrasjon fra Compello   Ny utgave 19.12.2011
     A*
     A          R RCOMPFR                   PFILE(RCOMPF)
      *
      * Nøkkel
      *
     A*         K RCFGRP
     A          K RCFIRM
     A          K RCBILN
     A          K RCLFAK
     A          S RCFERD                    COMP(EQ 'X')
