     A*  Integrasjon fra Compello   Ny utgave 19.12.2011
     A*
     A*
     A          R RCOMPFR                   PFILE(RCOMPF)
      *
      * Nøkkel
      *
     A*         K RCFGRP
     A          K RCHUID
     A          S RCHENT                    COMP(NE 'J')
     A            RCFERD                    COMP(EQ 'X')
