     A*  Integrasjon fra Compello   Ny utgave 19.12.2011
     A*
     A
     A          R RCOMPFR
     A*           RCFGRP         3          COLHDG('Filgr.')
     A            RCFIRM         3          COLHDG('Firma.')
     A            RCBILN        15          COLHDG('Bilagsnr')
     A            RCBILK         2          COLHDG('Bilagskode')
     A            RCRPER         6          COLHDG('R.per ÅÅÅÅMM')
     A            RCBDAT        15          COLHDG('Bilagsdato')
     A            RCBELO        15          COLHDG('Beløp')
     A            RCDAVD        15          COLHDG('Debet avd')
     A            RCDKTO         6          COLHDG('Debet konto')
     A            RCDSPS         4          COLHDG('Debet bærer')
     A            RCDMVA         1          COLHDG('Debet Mva-kode')
     A            RCCAVD        15          COLHDG('Kredit avd')
     A            RCCKTO         6          COLHDG('Kredit konto')
     A            RCCSPS         4          COLHDG('Kredit bærer')
     A            RCCMVA         1          COLHDG('Kredit MVA-kode')
     A            RCFDAT        15          COLHDG('Forfallsdato')
     A            RCVALB        15          COLHDG('Valutabeløp')
     A            RCVALK         5          COLHDG('Valutakode')
     A            RCTEXT        40          COLHDG('Bilagstekst')
     A            RCLFAK        40          COLHDG('Lev.fakt.nr.')
     A            RCKIDI        40          COLHDG('Kid')
     A            RCPROS        10          COLHDG('Prosjekt')
     A            RCAKTI        10          COLHDG('Aktivitet')
     A            RCHUID        40          COLHDG('Unik id')
     A            RCEDAT          L         COLHDG('Endret dato')
     A            RCETIM          T         COLHDG('Endret tid')
     A            RCHENT         1          COLHDG('Hentet')
     A            RCFEIL        30          COLHDG('Feil')
     A            RCFERD         1          COLHDG('Ferdig fra Didrik(X)')
