     A* COGNOS RAPPORTERING         Index=Update
     A*
     A                                      UNIQUE
     A          R RCOSPFR                   PFILE(RCOSPF)
     A* Nøkkel
     A          K RCFIRM
     A          K RCFILG
     A          K RCSFIR
