      *
      * Liste over leste journaler
      *
     A          R RCOWPFR
     A            CKRAAR         4S 0       TEXT('År')
     A            CKKONT         5S 0       TEXT('Kontonummer')
     A            CKJOUR         5S 0       TEXT('Journalnummer')
      *
