     A*  Saldomatriser - Trioplan
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RE01PFR
     A            RIKONT    R
     A            RIAVDE    R
     A            RAGTXT    R
     A            RHTEXT    R
     A            RISA00    R
     A            RISA01    R
     A            RISA02    R
     A            RISA03    R
     A            RISA04    R
     A            RISA05    R
     A            RISA06    R
     A            RISA07    R
     A            RISA08    R
     A            RISA09    R
     A            RISA10    R
     A            RISA11    R
     A            RISA12    R
     A            RQSA01    R
     A            RQSA02    R
     A            RQSA03    R
     A            RQSA04    R
     A            RQSA05    R
     A            RQSA06    R
     A            RQSA07    R
     A            RQSA08    R
     A            RQSA09    R
     A            RQSA10    R
     A            RQSA11    R
     A            RQSA12    R
     A            RR9S01    R
     A            RR9S02    R
     A            RR9S03    R
     A            RR9S04    R
     A            RR9S05    R
     A            RR9S06    R
     A            RR9S07    R
     A            RR9S08    R
     A            RR9S09    R
     A            RR9S10    R
     A            RR9S11    R
     A            RR9S12    R
