     A*  Resultatregister til PC
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RE02PFR
     A            RR9FIR    R
     A            RR9RAP    R
     A            RR9LIN    R
     A            RR9TYP    R
     A            RR0BFJ    R
     A            RR9AVD    R
     A            RR9PER    R
     A            RR9AAR    R
     A            RRFPÅR    R
     A            RRFTÅR    R
     A            RRBPÅR    R
     A            RRBTÅR    R
     A            RRFPFJ    R
     A            RRFTFJ    R
     A            RR9TXT    R
