     A*  Saldobalanse til FINALE
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RE04PFR
     A            RPCFIN    R
