     A*  Saldobalanse til MAESTRO
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RE06PFR
     A            RPCMAX    R
