     A*  Saldobalanse til MAX
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RE07PFR
     A            RPCMAX    R
