     A*  Saldobalanse til AKELIUS
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RE08PFR
     A            RPCMAX    R
