     A*  Kontoplan - Nye/Endrede konti
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RE0HPFR
     A            RHFIRM    R
     A            RHKONT    R
     A            RHSPES    R
     A            RHAVDE    R
     A            RHTEXT    R
     A            RHTXT2    R
     A            RHSPRK    R
     A            RHMVAK    R
     A            RHBNØK    R
     A            RHPROJ    R
     A            RHVALK    R
     A            RHMVAO    R
     A            RHMVAG    R
     A            RHAVDK    R
     A            RHMNGD    R
     A            RHNØKK    R
     A            RHALFA    R
