     A*  Mottaksfile for data fra Externe systemer
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RE0IPFR
     A            RPCIN1    R
     A            RPCIN2    R
     A            RPCIN3    R
