     A*  Leverandører Index firma leverandørnummer
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RE0LPFR
     A            RLFIRM    R
     A            RLLEVR    R
     A            RLNAVN    R
     A            RLALFA    R
     A            RLGATE    R
     A            RLADR2    R
     A            RLPONR    R
     A            RLSTED    R
     A            RLKOMN    R
     A            RLLAND    R
     A            RLFTNR    R
     A            RLPERS    R
     A            RLEMAL    R
     A            RLTLFN    R
     A            RLTLFX    R
     A            RLMOBN    R
     A            RLBGIR    R
     A            RLFACN    R
     A            RLFACT    R
     A            RLNOBB    R
     A            RLEDIK    R
     A            RLEANL    R
     A            RLDIST    R
     A            RLAVDE    R
     A            RLLAGR    R
     A            RLKATG    R
     A            RLRABK    R
     A            RLBETB    R
     A            RLBETM    R
     A            RLSAKS    R
     A            RLISOK    R
     A            RLSALD    R
     A            RLSAIF    R
     A            RLKJØP    R
     A            RLKJØF    R
     A            RLKTID    R
     A            RLTDAT    R
     A            RLVALK    R
     A            RLSPRK    R
     A            RLMKOD    R
     A            RLFORM    R
     A            RLFRIE    R
     A            RLBONU    R
     A            RLPURR    R
     A            RLLBET    R
     A            RLSPES    R
     A            RLPRIO    R
     A            RLAVTS    R
     A            RLREST    R
     A            RLPAKK    R
     A            RLORSK    R
     A            RLORAB    R
     A            RLSTKO    R
     A            RLKPRI    R
     A            RLPPRO    R
     A            RLREMK    R
     A            RLSLET    R
     A            RLHYLE    R
     A            RLLVKO    R
     A            RLNDAT    R
     A            RLNTIM    R
     A            RLNSIG    R
     A            RLEDAT    R
     A            RLETIM    R
     A            RLESIG    R
