     A*  Prosjekter - Utvekslingfile mot externe systemer
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RE0PPFR
     A            RPFIRM    R
     A            RPPROS    R
     A            RPAKTI    R
     A            RPKONT    R
     A            RPSPES    R
     A            RPTXT1    R
     A            RPTXT2    R
     A            RPKUND    R
     A            RPSBEH    R
     A            RPMNGK    R
     A            RPRAKT    R
     A            RPPSTA    R
     A            RPPKAT    R
     A            RPSTDA    R
     A            RPSLDA    R
     A            RPALFA    R
     A            RPMVAK    R
