     A*  Registrering - posteringer
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RE0TPFR
     A            RTFIRM    R
     A            RTBUNT    R
     A            RTLINJ    R
     A            RTREID    R
     A            RTSTAT    R
     A            RTBDAT    R
     A            RTBELØ    R
     A            RTRAAR    R
     A            RTRPER    R
     A            RTBILN    R
T5.40A            RTBILL    R
     A            RTDAVD    R
     A            RTDKTO    R
     A            RTDSPS    R
     A            RTDMVA    R
     A            RTCAVD    R
     A            RTCKTO    R
     A            RTCSPS    R
     A            RTCMVA    R
     A            RTPROS    R
     A            RTREFN    R
     A            RTFDAT    R
     A            RTKRAB    R
     A            RTVALK    R
     A            RTVALB    R
     A            RTAKTI    R
     A            RTMNGD    R
     A            RTMNGK    R
     A            RTRESN    R
     A            RTRESS    R
     A            RTRESA    R
T5.40A            RTRESM    R
     A            RTVIRK    R
     A            RTATTE    R
     A            RTKRYS    R
     A            RTKIDI    R
     A            RTBILK    R
     A            RTTEXT    R
     A            RTBETB    R
     A            RTBREF    R
T5.40A            RTLFAK    R
     A            RTDECK    R
     A            RTAUTX    R
     A            RTBLDE    R
