      *
      * Factoring Transaksjonsfil 256 Alfa
      *
     A                                      REF(*LIBL/RFRF)
     A          R REF2PFR
     A            REFREC       256A         TEXT('Alfa 256')
     A                                      COLHDG('Alfa 256')
