     A*  Fakturaposter       Index=Read
     A*
     A          R REFAPFR                   PFILE(REFAPF)
      *
      * Nøkkel
      *
     A          K RNFIRM
     A          K RNKUND
     A          K RNBDAT
     A          K RNTIST
