      *
      * Factoring - Fakturaposter
      *            (Samme definisjoner som kunderposteringer)
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/RFRF)
     A          R REFAPFR
     A            RNFIRM    R
     A            RNKUND    R
     A            RNRAAR    R
     A            RNRPER    R
     A            RNBDAT    R
     A            RNBILN    R
     A            RNBILK    R
     A            RNTEXT    R
     A            RNBELØ    R
     A            RNREST    R
     A            RNVALK    R
     A            RNVALB    R
     A            RNVALR    R
     A            RNFDAT    R
     A            RNJOUR    R
     A            RNSAMF    R
     A            RNSTAT    R
     A            RNREFN    R
     A            RNVIRK    R
     A            RNAVDE    R
T5.40A            RNKONT    R
T5.40A            RNSPES    R
     A            RNSLGR    R
     A            RNREKL    R
     A            RNRENK    R
     A            RNRDAT    R
     A            RNANTP    R
     A            RNPDAT    R
     A            RNINKO    R
     A            RNIDAT    R
     A            RNODAT    R
     A            RNAUTO    R
     A            RNADAT    R
     A            RNFACK    R
     A            RNFADA    R
     A            RNTIST    R
