     A*  Fakturaposter, Logisk file for update
     A*
     A                                      UNIQUE
     A          R REFAPFR                   PFILE(REFAPF)
     A* Nøkkel
     A          K RNFIRM
     A          K RNKUND
     A          K RNBDAT
     A          K RNTIST
