      *
      * Factoring Kundefil 512 Alfa
      *
     A                                      REF(*LIBL/RFRF)
     A          R REK2PFR
     A            REKREC       512A         TEXT('Alfa 512')
     A                                      COLHDG('Alfa 512')
