     A*  Kundeposter, Logisk file for update
     A*
     A                                      UNIQUE
     A          R REKUPFR                   PFILE(REKUPF)
     A* Nøkkel
     A          K RKFIRM
     A          K RKKUND
