     A*  Kundeposter         Index=Read
      *
     A          R REKUPFR                   PFILE(REKUPF)
      *
      * Nøkkel
      *
     A          K RKFIRM
     A          K RKKUND
