     A*  Registrering - posteringer
     A*
     A          R REMSPFR                   PFILE(REMSPF)
      *
      * Nøkkel
      *
     A          K RTFIRM
     A          K RTRAAR
     A          K RTRPER
