     A*  Integrasjon Huldt&Lillevik lønn ==> ASOKON
     A*  OBS! Filen genereres med *NOMAX members
     A*
     A                                      REF(*LIBL/RFRF)
     A          R REUTPFR
     A            REFLGR    R               REFFLD(RJFLGR)
     A            REFIRM    R               REFFLD(RTFIRM)
     A            REKONT    R               REFFLD(RTDKTO)
     A            RESPES    R               REFFLD(RTDSPS)
     A            REAVDE    R               REFFLD(RTDAVD)
     A            REPROS    R               REFFLD(RTPROS)
     A            REAKTI    R               REFFLD(RTAKTI)
     A            RERAAR    R               REFFLD(RTRAAR)
     A            RERPER    R               REFFLD(RTRPER)
     A            REBDAT    R               REFFLD(RTBDAT)
     A            REBELØ    R               REFFLD(RTBELØ)
     A            REMVAK    R               REFFLD(RTDMVA)
     A            REMNGD    R               REFFLD(RTMNGD)
