     A*  Fordelingsparametre, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RFORPFR                   PFILE(RFORPF)
     A* Nøkkel
     A          K RFFIRM
     A          K RFKONT
     A          K RFSPES
     A          K RFAVDE
     A          K RFLINJ
