     A*  Fordelingsparametre, Logisk file index 2
     A*
     A          R RFORPFR                   PFILE(RFOSPF)
     A* Nøkkel
     A          K RFFIRM
     A          K RFKONT
     A          K RFSPES
     A          K RFAVDE
     A          K RFLINJ
      *
     A          S RFLINJ                    COMP(EQ 00)
