     A*  Fordelingsparametre
6.20 A*  260913  NHO     Lagt inn 3 nye felt lik RFOLPF pga Override
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RFORPFR
     A            RFKODE    R
     A            RFFIRM    R
     A            RFKONT    R
     A            RFSPES    R
     A            RFAVDE    R
     A            RFLINJ    R
     A            RFPROS    R
     A            RFPRIS    R
     A            RFPROT    R
     A            RFKTO1    R
     A            RFSPS1    R
     A            RFAVD1    R
     A            RFKTO2    R
     A            RFSPS2    R
     A            RFAVD2    R
6.20 A            RFODAT    R
6.20 A            RFOTIM    R
6.20 A            RFOUSR    R
     A            RFEDAT    R
     A            RFETIM    R
     A            RFEUSR    R
