     A          R RFRFR                     TEXT('ASP Økonomi')
      *
      *         DetteErEnFrf    (NB!!  Denne må ikke fjernes)
      *
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
6.10  * R6.10 110609 BSA  Oppdatert filer med sporingsinformajon. Opprettet
6.10  *                   dato, kl.slett og bruker. Endret dato, kl.slett og
6.10  *                   bruker.
      *
6.11  * R6.11 110603 NHO  Oppdatert filer med sporingsinformajon. Opprettet
6.11  *                   dato, kl.slett og bruker. Endret dato, kl.slett og
6.11  *                   bruker og nivo
      *
6.12  * R6.12 110603 NHO  Oppdatert 3 nye felter på kunde/leverandør-  ttet
6.12  *                   transer og hovedbok i forbindelse med sporingtt og
6.12  *                   og avkryssing
      *
6.13  * R6.13 110603 NHO  Ny fil i forb.med sporing og avkryssings ref.ttet
6.13  *                   (dstrpf), samt tilleggsfelter på sist brukte tt og
6.13  *                   nummer                                       tt og
      *
6.14  * R6.14 240909 NHO  Nye felt på vedlikehold av bilagskode. Num-
6.14  *                   merserie samt F4 søk ved debet/kredit bil-
6.14  *                   agsregistrering
6.15  * R6.15 141009 BSA  Nye felt på speditør.
6.16  * R6.16 280110 AMD  Nye felt lagt til i V6.10
6.17  * R6.17 060510 BSA  Ekstra loggefelter
6.18  * R6.18 030910 BSA  Kjøreinfo felter på kortregister
6.18  * R6.18 030511 NHO  Ny loggfil
6.19  * R6.19 060910 BSA  Nytt kortregister - Statusinfo pr. korttype
6.19  * R6.19 130711 Sst  Nytt felt RTBELO for å erstatte RTBELØ
6.20  * R6.20 080710 sst  Nye Prosjekt register
6.21  * R6.20 060810 sst  Nye Prosjekt register VEDR LØNNSTRANSER
6.22  * R6.20 101010 NHO  Endring av prosjektnr til alfa, og aktivitet
6.22  *                   fra 3 til 6 posisjoner
6.23  * R6.20 270111 BOF  Utvidet med kjørekontor på fors.måte
6.24  * R6.20 100211 BSA  Utvidet avdelingstekst fra 20 til 30 posisjoner
6.25  * R6.20 200511 ASK  Lagt inn sperrefil for journaloppdatering (6.10)
6.26  * R6.20 260411 AMD  Flere muligheter rundt kredit-alternativer
6.27  * R6.20 250511 BSA  Webadresse og mail legges til på avdeling.
6.28  * R6.20 070611 BOF  Memosaldo tatt fra kunde til egen tabell
6.29  * R6.20 031111 BOF  Utvidet med "sperre man. bokføring'
6.30  * R6.20 300911 NHO  Nye felt for JAVA, feil del 1
6.31  * R6.20 251009 NHO  Nye felt for JAVA, feil del 2
6.32  * R6.20 010212 SST  Endring av rapportgenerator Prosjekt
6.2A  * R6.20 150212 BSA  Kode på kortregister som sier om oppgjørsmetode
6.SS  * R6.20 160212 BSA  REF. TIL SVEN
6.2B  * R6.20 160212 ASK  Serviceavgift, alm løsning
6.2B1 *       040911 BOF  Utvidet lev.bet. med kode Direkte valg
6.2C  * R6.20 300312 BSA  Setter defaultverdi for å unngå at dd/tid settes
6.2C  *                   som verdi, der hvor nye tidsfelter legges til i
6.2C  *                   allerede eksisterende filer.
      *
6.2D  * R6.20 160412 NHO  Ny fil i forb.med avkryssings ref.
6.2D  *                   (DAVXPF)
      *
      *
6.2E  * R6.20 160412 NHO  Kommentar til fil DSTRPF
6.2F  *       150812 sst  Utvidet RTRXPF med RX1MSG (x(50))
6.2G  *       200812 sst  Nytt register for test mot restbeløp i avx.
6.2H  *       210812 sst  Nytt felt i RBUNPF vedr klienten
6.2I  *       120912 BOF  Utvidet Leverandørtranser med fra/til dato
6.2J  *       080814 BSA  Utvidet kortfile med ordreinfokode. Nytt
6.2J  *                   register med status for saldosjekk
6.2K  *       201114 BSA  Kobling mellom kasseid og avdeling. Brukes
6.2K  *                   ved beløpstrekk via webservice.
      *
6.30  *       260314 BOF  Sidereg. for rkunpf, felt for kont.k tilbud
6.31  *       270314 BOF  Utvidet med leveringsmåte bestilling RA31PF
6.NU  *       210515 BOF  Nummerserieutvidelse
6.33  *       250914 ASK  Utvidet kortregister spesifikasjon og korttype
6.34  *       120215 BSA  Utvidet forsendelsesregister
6.35  *       270515 BOF  UTvidet kidreferanse fra 6 til 8
6.36  *       200615 BOF  Utvidet RJSORT med 2 posisjoner.
6.37  *       080116 BSA  Utvidet RMEIPF med kommunenummer. (bruksrett)
6.38  *       291116 bof  Utvidet kundens avgifst kode med utenlandsk
6.39  *       260919 BKV  Returkoder RA50
6.3D  *       030719 BOF  UTVIDET SALDOFELTER PÅ SALDOMATRISE RHSAPF
6.41  * 6.40  250118 BOF  Sidereg. RAX9PF (selger) sys inn i 6.40
      *
7.01  *KO  7.00  100820 sst Nytt felt for landkode for remitering på RLBAPF
7.NX  *KO  7.00  011020 BOF Fjerne felter for RMUTPF
7.NX  *KO  7.00  061120 BSA Sidetabell fra Skattum (SGR)
7.N1  *       050117 ask  Lagt inn eget tabeller for tilgangsstyring
7.NX  *K00       131120 BSA Felter og tabeller ifbm One Nexstep
7.NX  *K00    280621 bsa Utvidet tilleggsregister på kunde
      *
8.01  *PRG2   090622 bof Utvidet prisgruppe fra 1 til 2 posisjoner
8.02  *       210622 bof Bestemt at vi ikke utvider prgr. på ra07pf-ikke brukt
8.03  *K000   190422 bsa Utvidet tilleggsregister på kunde 2.
8.04  *K000   230622 bsa Utvidet tilleggsregister på kunde 2.
      *
      *
      *
      * ----- ------ ---- -------------------------------------------------
6.2E  * Fil DSTRPF ikke lenger i bruk, men blir lagt ut i
6.2E  * journalkjøring
6.2E  *
6.13  *   Sporing/avkryssing      DSTRPF
6.13 A*
6.13  *
6.13 A            DSFIRM         3S 0       TEXT('Firma')
6.13 A                                      COLHDG('Firma')
6.13 A                                      EDTCDE(Z)
6.13  *
6.13 A            DSSPOR      0010S 0
6.13 A                                      TEXT('Spor.ref.')
6.13 A                                      COLHDG('Spor.ref.')
6.13  *
6.13  *
6.12 A            DSAVKR      0010S 0
6.12 A                                      TEXT('Avkr.ref.')
6.12 A                                      COLHDG('Avkr.ref.')
6.13  *
6.12 A            DSKONT      0006S 0
6.12 A                                      TEXT('Konto.')
6.12 A                                      COLHDG('Konto.')
6.13  *
6.13 A            DSBELO      0011S 2
6.13 A                                      EDTCDE(K)
6.13 A                                      COLHDG('Beløp på post')
6.13  *
6.13 A            DSSLET      0001S 0
6.13 A                                      TEXT('Slettekode')
6.13  *
6.13 A            DSTIS1          Z
6.13 A                                      TEXT('Post. timestamp')
6.13 A                                      COLHDG('Post' 't-stamp')
6.13 A*
6.13 A            DSEUSR        10A         TEXT('Endret av')
6.13 A                                      COLHDG('Endret av')
      *
6.2D  *   Avkryssing              DAVXPF
6.2D  *
6.2D A            DXFIRM         3S 0       TEXT('Firma')
6.2D A                                      COLHDG('Firma')
6.2D A                                      EDTCDE(Z)
6.2D  *
6.2D A            DXRESN      0006S 0
6.2D A                                      EDTCDE(Z)
6.2D A                                      TEXT('Kontonr.(reskontro)')
6.2D A                                      COLHDG('Konto')
6.2D A            DXBDAT          L
6.2D A                                      TEXT('Bilags-dato')
6.2D A                                      COLHDG('Bil.dat')
6.2D A            DXBILN      0006S 0
6.2D A                                      EDTCDE(Z)
6.2D A                                      COLHDG('Bilagsnr.')
6.2D A            DXRTIM          Z
6.2D A                                      TEXT('Resk. timestamp')
6.2D A                                      COLHDG('Resk' 't-stamp')
6.2D A*
6.2D A            DXREFN      0012S 0
6.2D A                                      TEXT('Ref.nr.  ')
6.2D A                                      COLHDG('Ref.nr.  ')
6.2D  *
6.2D A            DXOBEL      0011S 2
6.2D A                                      EDTCDE(K)
6.2D A                                      COLHDG('Oppr.beløp'   )
6.2D  *
6.2D A            DXBBEL      0011S 2
6.2D A                                      EDTCDE(K)
6.2D A                                      COLHDG('Brukt beløp'  )
6.2D  *
6.2D A            DXTIS1          Z
6.2D A                                      TEXT('Post. timestamp')
6.2D A                                      COLHDG('Post' 't-stamp')
6.2D A*
6.2D A            DXEUSR        10A         TEXT('Endret av')
6.2D A                                      COLHDG('Endret av')
      *
      *   ASOKON  FRF (felles arbeidsfelter)
     A            RÅVALG         1S 0
     A                                      COLHDG('Valg')
     A                                      TEXT('Valg')
     A                                      EDTCDE(Z)
      *
     A            RÅWVLG         1A
     A                                      VALUES(' ' '1')
     A                                      CHKMSGID(RMA0710 *LIBL/QMFOKON)
     A                                      COLHDG('Velg alternativ')
      *
     A            RÅFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
      *
     A            RÅALME         4S 0       TEXT('Almenning')
     A                                      COLHDG('Alm.')
     A                                      EDTCDE(Z)
      *
     A            RÅBRTY         1S 0       TEXT('Bruksrett-type')
     A                                      COLHDG('Bruksrett' 'type')
     A                                      EDTCDE(4)
      *
     A            RÅODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Oppr.' 'dato')
      *
     A            RÅEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
      *
     A            RÅETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
      *
     A            RÅEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
6.10  *
6.10 A            RÅOTIM          T         TEXT('Opprettet tidspunkt')
6.10 A                                      COLHDG('Oppr.tid')
6.10  *
6.10 A            RÅOUSR        10A         TEXT('Opprettet av')
6.10 A                                      COLHDG('Oppr. av')
6.22  *
6.22 A            RÅAKTI         6A         TEXT('Aktivitet')
6.22 A                                      COLHDG('Akt.')
6.22 A            RÅPROS         6S 0       TEXT('Prosjekt-nr')
6.22 A                                      COLHDG('Prosj.')
6.22 A            RÅPROA         6A         TEXT('Prosjekt-nr')
6.22 A                                      COLHDG('Prosj.')
6.22 A            RÅUPRO         6A         TEXT('U.Prosjekt')
6.22 A                                      COLHDG('U.proj')
6.22 A            RÅARBO         6A         TEXT('Arb.ordre')
6.22 A                                      COLHDG('A.ordre')
6.22  *
6.10 A            SPODAT    R               REFFLD(RÅODAT)
6.10 A            SPOTIM    R               REFFLD(RÅOTIM)
6.10 A            SPOUSR    R               REFFLD(RÅOUSR)
6.10 A            SPEDAT    R               REFFLD(RÅEDAT)
6.10 A            SPETIM    R               REFFLD(RÅETIM)
6.10 A            SPEUSR    R               REFFLD(RÅEUSR)
      *
     A            RWVALG      0001A
     A                                      COLHDG('Valg')
     A                                      TEXT('Valg')
      *
     A            RWNYEN      0011A
     A                                      COLHDG('Ny/Endr')
     A                                      TEXT('Ny/Endr')
     A            RWMELD      0050A
     A                                      COLHDG('Meldingsfelt')
     A                                      TEXT('Meldingsfelt')
     A            RWSVAR      0001A
     A                                      COLHDG('Svar')
     A                                      TEXT('Svar')
     A            RWMKEY      0021A
     A                                      COLHDG('Motpost rente')
     A            RWRENT      0011S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Renter')
     A            RWRGRL      0011S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Rentegrunnlag')
     A            RWDAGR      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Antall dager')
     A            RWRFDA          L
     A                                      COLHDG('Rente fra dato')
     A            RWRTDA          L
     A                                      COLHDG('Rente til dato')
     A            RWSUMR      0013S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Sum')
     A            RWTIST          Z
     A                                      TEXT('Post. timestamp')
     A                                      COLHDG('Post' 't-stamp')
6.21 A            KLIENT         3S 0
6.21 A                                      EDTCDE(Z)
6.21 A                                      COLHDG('Klient')
6.21 A                                      TEXT('Klient')
6.21 A            LØNNSNR        6S 0
6.21 A                                      EDTCDE(Z)
6.21 A                                      COLHDG('Lønnsnr.')
6.21 A                                      TEXT('Lønnsnr.')
6.21 A            NAVN          30A
6.21 A                                      COLHDG('Lønnstager')
6.21 A                                      TEXT('Lønnstager')
6.21 A            AVD            4S 0
6.21 A                                      EDTCDE(Z)
6.21 A                                      COLHDG('Avdeling')
6.21 A                                      TEXT('Avdeling')
6.21 A            ONR            6S 0
6.21 A                                      EDTCDE(Z)
6.21 A                                      COLHDG('Arb.OrdreNr.')
6.21 A                                      TEXT('Arb.OrdreNr.')
      *
      *   PARAMETER-RECORD        RPARPF    (RW)
      *
     A            RWPSTA      0001A
     A                                      COLHDG('Status')
     A            RWPFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RWPREC      0252A
     A                                      COLHDG('Fast = blank')
      *
      *   WORK-RECORD    (RHW1PF, RHWAPF)   (RW)
      *                  (RKW1PF, RKWAPF)
      *                  (RLW1PF, RLWAPF)
      *
     A            RWKREC      0191A
     A                                      COLHDG('Fast = blank')
     A            RWKKEY      0064A
     A                                      COLHDG('Fast = blank')
     A            RWKFIR      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            RWKNIV      0004S 0
     A                                      TEXT('Nivå')
     A                                      COLHDG('Nivå')
     A            RWKSAL      0011S 2
     A                                      TEXT('Saldo')
     A                                      COLHDG('Saldo')
     A            RWKALF      0018A
     A                                      TEXT('Alfa')
     A                                      COLHDG('Alfa')
     A            RWKKNR      0006S 0
     A                                      TEXT('Kundenr')
     A                                      COLHDG('Kundenr')
6.25  * Okon-jobb-status-register           (FAJ)
6.25  *
6.25 A            RJBFIR    R               REFFLD(RÅFIRM)
6.25 A            RJBMEM      0010A
6.25 A                                      TEXT('Member')
6.25 A                                      COLHDG('Mb')
6.25  *
6.25 A            RJBUSR      0010A         TEXT('Bruker')
6.25 A                                      COLHDG('Bruker')
6.25  *
6.25 A            RJBAWS        10A         TEXT('Arbeidstasjon')
6.25 A                                      COLHDG('Arb.stasj.')
6.25  *
6.25 A            RJBDA1          L         TEXT('Dato opprettet')
6.25 A                                      COLHDG('Dato' 'opprettet')
6.25  *
6.25 A            RJBTIM    R               REFFLD(RÅETIM)
6.25  *
6.25 A            RJLED1      0001A
     A                                      COLHDG('Ledig')
      *
      *   STATUSRECORD 000001     RAA1PF    (RA1)
      *
     A            RA1FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RA1BKK      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMA0520 *LIBL/QMFOKON)
     A                                      COLHDG('Små/Store kunder')
     A            RA1BKL      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMA0520 *LIBL/QMFOKON)
     A                                      COLHDG('Små/Store leverandør')
     A            RA1PER      0002S 0
     A                                      EDTCDE(Z)
     A                                      COMP(LE 13)
     A                                      CHKMSGID(RMA0300 *LIBL/QMFOKON)
     A                                      COLHDG('Periode-sperre H.bok')
     A            RA1AAR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COMP(GT 1980)
     A                                      CHKMSGID(RMA0320 *LIBL/QMFOKON)
     A                                      COLHDG('År-sperre .... H.bok')
     A            RA1HKT      0006S 0
     A                                      EDTCDE(Z)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(RMA0330 *LIBL/QMFOKON)
     A                                      COLHDG('Øvre grense konto')
     A            RA1HRS      0006S 0
     A                                      EDTCDE(Z)
     A                                      COMP(NE 0)
     A                                      CHKMSGID(RMA0340 *LIBL/QMFOKON)
     A                                      COLHDG('Øvre grense kundenr.')
     A            RA1ARS      0001A
     A                                      VALUES('0' '1')
     A                                      CHKMSGID(RMA0380 *LIBL/QMFOKON)
     A                                      COLHDG('(Avdeling)')
     A            RA1BNR      0001A
     A                                      VALUES('J' 'N')
     A                                      COLHDG('(Test bil.nr)')
     A            RA1BIK      0001A
     A                                      VALUES(' ' 'C' 'D')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Bil.k.')
     A            RA1BIT      0001A
     A                                      VALUES(' ' 'D')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Tekst')
     A            RA1BID      0001A
     A                                      VALUES(' ' 'C' 'D')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Dato')
     A            RA1BIN      0001A
     A                                      VALUES(' ' 'A' 'C' 'D')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Bil.nr.')
     A            RA1REF      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Refnr.')
     A            RA1AKR      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Avkryssing')
     A            RA1KTO      0001A
     A                                      VALUES(' ' 'D')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Konto')
     A            RA1AVD      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Avdeling')
     A            RA1SPS      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Kostnadsbærer')
     A            RA1MVA      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('MVA-kode')
     A            RA1BLP      0001A
     A                                      VALUES(' ' 'D')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Beløp')
     A            RA1PRO      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Prosjekt')
     A            RA1RAB      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Rabatt')
     A            RA1VRK      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Virksomhet')
     A            RA1AKT      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Aktivitet')
     A            RA1MGN      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Mengde')
     A            RA1VKO      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Valutakode')
     A            RA1VBE      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Valutabeløp')
     A            RA1FTX      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Fritekst')
     A            RA1FOR      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Forfallsdato')
     A            RA1ATT      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Attestert')
     A            RA1KID      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Kundeidentifikasjon')
     A            RA1DKO      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('Deklareringskode')
     A            RA1LFA      0001A
     A                                      VALUES(' ' 'D' 'X')
     A                                      CHKMSGID(RMA0570 *LIBL/QMFOKON)
     A                                      COLHDG('L.fak.')
     A            RA1AVS      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMA0390 *LIBL/QMFOKON)
     A                                      COLHDG('Like perioder)')
     A            RA1BEK      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Std. bet.bet. kunder')
     A            RA1BEL      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Std. bet.bet. lever.')
     A            RA1KSP      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMA0550 *LIBL/QMFOKON)
     A                                      COLHDG('Kategorispesifikasjo')
     A            RA1APE      0002S 0
     A                                      EDTCDE(Z)
     A                                      COMP(LE 13)
     A                                      CHKMSGID(RMA0300 *LIBL/QMFOKON)
     A                                      COLHDG('Antall perioder')
     A            RA1BUN      0001A
     A                                      VALUES('J' 'N')
     A                                      COLHDG('Buntsum')
     A            RA1SKD      0001A
     A                                      VALUES('J' ' ')
     A                                      COLHDG('Strekkode')
5.50 A            RA1PRE      0001A
5.50 A                                      VALUES('J' ' ')
5.50 A                                      COLHDG('Preregistrering')
     A            RA1DAT    R               REFFLD(RÅEDAT)
     A            RA1TIM    R               REFFLD(RÅETIM)
     A            RA1USR    R               REFFLD(RÅEUSR)
      *
      *   STATUSRECORD 000002    RAA2PF     (RA2)
      *
     A            RA2FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RA2BBK      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMA0400 *LIBL/QMFOKON)
     A                                      COLHDG('BBS-OCR-Kunder')
     A            RA2BMK      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMA0410 *LIBL/QMFOKON)
     A                                      COLHDG('Bank-modulus kunde')
     A            RA2AKO      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMA0420 *LIBL/QMFOKON)
     A                                      COLHDG('Alternativ konto BBS')
     A            RA2ABK      0011S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Alternativ bankkonto')
     A            RA2DAT    R               REFFLD(RÅEDAT)
     A            RA2TIM    R               REFFLD(RÅETIM)
     A            RA2USR    R               REFFLD(RÅEUSR)
      *
      *   STATUSRECORD 000003     RAA3PF    (RA3)
      *
     A            RA3FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RA3P01      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 01')
     A            RA3P02      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 02')
     A            RA3P03      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 03')
     A            RA3P04      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 04')
     A            RA3P05      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 05')
     A            RA3P06      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 06')
     A            RA3P07      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 07')
     A            RA3P08      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 08')
     A            RA3P09      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 09')
     A            RA3P10      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 10')
     A            RA3P11      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 11')
     A            RA3P12      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 12')
     A            RA3P13      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avvikende periode 13')
     A            RA3STP      0002S 0
     A                                      EDTCDE(Z)
     A                                      COMP(LE 13)
     A                                      CHKMSGID(RMA0300 *LIBL/QMFOKON)
     A                                      COLHDG('Start-periode')
     A            RA3SDA          L
     A                                      COLHDG('Sist oppdat. dato')
     A            RA3KA1      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Aldersfordelt 0-A')
     A            RA3KA2      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Aldersfordelt A-B')
     A            RA3KA3      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Aldersfordelt B-C')
     A            RA3KA4      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Aldersfordelt C-D')
     A            RA3LA1      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Aldersfordelt 0-A')
     A            RA3LA2      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Aldersfordelt A-B')
     A            RA3LA3      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Aldersfordelt B-C')
     A            RA3LA4      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Aldersfordelt C-D')
     A            RA3SAK      0001A
     A                                      VALUES('0' '1')
     A                                      CHKMSGID(RMA0560 *LIBL/QMFOKON)
     A                                      COLHDG('Avkryssing')
     A            RA3MFE      0001A
     A                                      VALUES('0' '1')
     A                                      COLHDG('Må-felt kunder')
     A            RA3MFL      0001A
     A                                      VALUES('0' '1')
     A                                      COLHDG('Må-felt lever.')
     A            RA3KBR      0001S 0       EDTCDE(Z)
     A                                      COLHDG('Kundebrev')
     A            RA3BÆR      0001A
     A                                      COLHDG('Kostnadsbærer')
     A            RA3DAT    R               REFFLD(RÅEDAT)
     A            RA3TIM    R               REFFLD(RÅETIM)
     A            RA3USR    R               REFFLD(RÅEUSR)
      *
      *   STATUSRECORD 000004     RAA4PF    (RA4)
      *
     A            RA4FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RA4AAR      0004S 0
     A                                      COLHDG('År                  ')
6.NU A            RA4SAM      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Samlefakturanr.')
6.NU A            RA4SNO      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rentenotanr.')
6.NU A            RA4SUG      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Utg. gironr.')
6.NU A            RA4SIG      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Inng. gironr.')
     A            RA4SJÅ      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Journalnr.')
     A            RA4SPJ      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Prosjektjournal ....')
6.NU A            RA4SGB      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Generet bilag-nr.')
     A            RA4SRB      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Regisrert bilag-nr.')
     A            RA4SUB      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Utbetalings-nr.')
     A            RA4SLN      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lønnsbilag')
     A            RA4SUF      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Utg. faktura')
6.NU A            RA4SIF      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Inng. faktura')
     A            RA4SBU      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Butikkfaktura')
     A            RA4KNR      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Siste kundenr.')
     A            RA4LNR      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Siste leverandørnr.')
     A            RA4PNR      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Siste kontaktperson')
     A            RA4KRT      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Siste kundekortnr.')
     A            RA4DAT    R               REFFLD(RÅEDAT)
     A            RA4TIM    R               REFFLD(RÅETIM)
     A            RA4USR    R               REFFLD(RÅEUSR)
6.13 A            RA4SPO      0010S 0
6.13 A                                      EDTCDE(Z)
6.13 A                                      COLHDG('Siste spor.ref.nr.')
6.13 A            RA4AVK      0010S 0
6.13 A                                      EDTCDE(Z)
6.13 A                                      COLHDG('Siste avkr.ref.nr.')
      *
      *   STATUSRECORD 000005     RAA5PF    (RA5)
      *
     A            RA5FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RA5LDG      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Antall løpedager')
     A            RA5RPM      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMA0580 *LIBL/QMFOKON)
     A                                      COLHDG('Renter pr. mnd.')
     A            RA5RPR      0003S 1
     A                                      EDTCDE(K)
     A                                      COLHDG('Rente-%')
     A            RA5RGR      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rentegrense')
     A            RA5RMN      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Minimums-rente')
     A            RA5RPG      0001A
     A                                      VALUES( 'N' 'G' 'S')
     A                                      CHKMSGID(RMA0590 *LIBL/QMFOKON)
     A                                      COLHDG('Giro skrives')
     A            RA5RPO      0001A
     A                                      VALUES('J' ' ')
     A                                      CHKMSGID(RMA0600 *LIBL/QMFOKON)
     A                                      COLHDG('Posteres i regnskap')
     A            RA5RGB      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMA0620 *LIBL/QMFOKON)
     A                                      COLHDG('Purregebyr')
     A            RA5GEB      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Purregebyr -Kr')
     A            RA5PBT      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bet.betingelse gebyr')
     A            RA5RRN      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMA0610 *LIBL/QMFOKON)
     A                                      COLHDG('Egen rentenota')
     A            RA5RFK      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Fra kunde (nummer) .')
     A            RA5RTK      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Til kunde (nummer)')
     A            RA5RKT      0002A
     A                                      COLHDG('Kategori')
     A            RA5RAF      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMA0650 *LIBL/QMFOKON)
     A                                      COLHDG('Alfabetisk sortering')
     A            RA5RTX      0001S 0
     A                                      EDTCDE(Z)
     A                                      COMP(GT 0)
     A                                      CHKMSGID(RMA0630 *LIBL/QMFOKON)
     A                                      COLHDG('Inkassotekst (p.nr.)')
     A            RA5IDA          L
     A                                      COLHDG('Siste purredato')
     A            RA5RBS      0001A
     A                                      VALUES('<' '>' '=')
     A                                      CHKMSGID(RMA0640 *LIBL/QMFOKON)
     A                                      COLHDG('Beslutning/Regel (<>')
     A            RA5RPU      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Purre-nr.')
     A            RA5KPR      0030A
     A                                      COLHDG('Kontaktperson')
     A            RA5TFN      0011A
     A                                      TEXT('Telefonnummer')
     A                                      COLHDG('Telefon')
     A            RA5EML      0050A
     A                                      TEXT('E-mail adresse')
     A                                      COLHDG('E-mail adresse')
     A            RA5BFO      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Blankett nr.(Varsel)')
     A            RA5BFI      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMA0660 *LIBL/QMFOKON)
     A                                      COLHDG('Firmaoppl. skrives')
     A            RA5DAT    R               REFFLD(RÅEDAT)
     A            RA5TIM    R               REFFLD(RÅETIM)
     A            RA5USR    R               REFFLD(RÅEUSR)
      *
      *   STATUSRECORD 000006     RAA6PF    (RA6)
      *
     A            RA6FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RA6PPR      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Rente-% p.a. .......')
     A            RA6PNU      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMA0670 *LIBL/QMFOKON)
     A                                      COLHDG('Negativ ut (J/N)')
     A            RA6PGR      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rentegrense')
     A            RA6PFG      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rentegrense pr. fakt')
     A            RA6PDA          L
     A                                      COLHDG('Kjørt rente dato')
     A            RA6PLD      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Antall løpedager')
     A            RA6PIB      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMA0680 *LIBL/QMFOKON)
     A                                      COLHDG('Forfalt ikke betalt')
     A            RA6POR      0001A
     A                                      VALUES('J' 'N')
     A                                      COLHDG('Oppdatere regnskap')
     A            RA6RPU      0001A
     A                                      VALUES('J' 'N')
     A                                      COLHDG('Renter ved purring')
     A            RA6PBT      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bet.betingelse rente')
     A            RA6KPR      0030A
     A                                      COLHDG('Kontaktperson')
     A            RA6DAT    R               REFFLD(RÅEDAT)
     A            RA6TIM    R               REFFLD(RÅETIM)
     A            RA6USR    R               REFFLD(RÅEUSR)
      *
      *   STATUSRECORD 000007     RAA7PF    (RA7)
      *
     A            RA7FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RA7TXT      0020A
     A                                      COLHDG('Beskrivelse')
     A            RA7PER      0002S 0
     A                                      EDTCDE(Z)
     A                                      COMP(LE 13)
     A                                      CHKMSGID(RMA0300 *LIBL/QMFOKON)
     A                                      COLHDG('Periode fra systemer')
     A            RA7AAR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COMP(GT 1980)
     A                                      CHKMSGID(RMA0320 *LIBL/QMFOKON)
     A                                      COLHDG('År fra tilstøtende s')
     A            RA7TEL      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ovf.nr. til NT')
     A            RA7DAV      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Dataavsender')
     A            RA7AVT      0009S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avtale-ID')
     A            RA7FOR      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Forsendelsenr.      ')
     A            RA7ONR      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Oppdragsnr.')
     A            RA7ANR      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Autogiro varselnr.')
     A            RA7DAT    R               REFFLD(RÅEDAT)
     A            RA7TIM    R               REFFLD(RÅETIM)
     A            RA7USR    R               REFFLD(RÅEUSR)
      *
      *   STATUSRECORD 000008     RAA8PF    (RA8)
      *
     A            RA8FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RA8EAN      0013S 0
     A                                      COLHDG('HovedEANnr.')
     A            RA8IBM      0008A
     A                                      COLHDG('Postkasse IBM')
     A            RA8TST      0001A
     A                                      VALUES(' ' 'T')
     A                                      COLHDG('Testmodus')
     A            RA8DAT    R               REFFLD(RÅEDAT)
     A            RA8TIM    R               REFFLD(RÅETIM)
     A            RA8USR    R               REFFLD(RÅEUSR)
      *
      *   STATUSRECORD 000009     RAA9PF    (RA9)
      *
     A            RA9FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RA9KNR      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kundenr.')
     A            RA9FMT      0010A
     A                                      COLHDG('Format overf.')
     A            RA9KLI      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Klientnr.')
     A            RA9KUN      0001S 0
     A                                      COLHDG('Ta med kunde')
     A            RA9REG      0001A
     A                                      COLHDG('Oppdat.regnskap')
     A            RA9BIL      0002S 0
     A                                      COLHDG('Bilagskode')
6.10 A            RA9ODA    R               REFFLD(RÅODAT)
6.10 A            RA9OTI    R               REFFLD(RÅOTIM)
6.10 A            RA9OUS    R               REFFLD(RÅOUSR)
     A            RA9DAT    R               REFFLD(RÅEDAT)
     A            RA9TIM    R               REFFLD(RÅETIM)
     A            RA9USR    R               REFFLD(RÅEUSR)
      *
      *   BILAGSKODER             RA01PF    (RAA)
      *
     A            RAAFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAAKOD      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagskode')
     A            RAATXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Bilagstekst')
     A            RAAKJØ      0001A
     A                                      VALUES(' ' '1')
     A                                      CHKMSGID(RMA0050 *LIBL/QMFOKON)
     A                                      COLHDG('Varekjøpsoppdatering')
     A            RAAINK      0001A
     A                                      VALUES(' ' '1')
     A                                      CHKMSGID(RMA0060 *LIBL/QMFOKON)
     A                                      COLHDG('Innbet.kode')
     A            RAARNK      0001A
     A                                      VALUES(' ' '1')
     A                                      CHKMSGID(RMA0070 *LIBL/QMFOKON)
     A                                      COLHDG('Rentekode')
     A            RAAFAC      0001A
     A                                      VALUES(' ' '1')
     A                                      CHKMSGID(RMA0070 *LIBL/QMFOKON)
     A                                      COLHDG('Factoringkode')
     A            RAASUM      0001A
     A                                      VALUES(' ' '1')
     A                                      CHKMSGID(RMA0080 *LIBL/QMFOKON)
     A                                      COLHDG('Summeringskode')
6.NU A            RAABNR      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagsnr.')
     A            RAAOPT      0025A
     A                                      COLHDG('Oppl.type')
     A            RAADAT    R               REFFLD(RÅEDAT)
     A            RAATIM    R               REFFLD(RÅETIM)
     A            RAAUSR    R               REFFLD(RÅEUSR)
6.14 A            RADEBE      0001A
6.14 A                                      VALUES('H' 'K' 'L' ' ')
6.14 A                                      TEXT('Debet søk')
6.14 A*                                     COLHDG('Deb.søk')
6.14 A            RAKRED      0001A
6.14 A                                      VALUES('H' 'K' 'L' ' ')
6.14 A                                      TEXT('Kredit søk')
6.14 A                                      COLHDG('Kred.søk')
6.14 A            RABINU      0006A
6.14 A                                      TEXT('Bilagsnummerserie')
6.14 A*                                     COLHDG('Bil.nr.serie')
6.29 A            RASPMA         1S 0
6.29 A                                      COLHDG('Sperre' 'man.bokf')
6.29 A                                      TEXT('Sperre man.bokføring')
6.29 A                                      VALUES(0 1)
6.29 A                                      EDTCDE(Z)
6.29 A                                      CHKMSGID(RMA0710 *LIBL/QMFOKON)
6.29  *                                     1 = ja
6.29  *                                     0 = nei
      *
      *   BETALINGSMÅTE           RA02PF    (RAB)
      *
     A            RABFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RABKOD      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Betalingsmåte ......')
     A            RABTXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RABDAT    R               REFFLD(RÅEDAT)
     A            RABTIM    R               REFFLD(RÅETIM)
     A            RABUSR    R               REFFLD(RÅEUSR)
      *
      *   BETALINGSBETINGELSE     RA03PF    (RAC)
      *
     A            RACFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RACKOD      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Betalingsbetingelse.')
     A            RACTXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Tekst')
     A            RACTX2      0020A
     A                                      COLHDG('Utfyllende tekst')
     A            RACDAG      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Dager')
     A            RACRAB      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Rabatt')
     A            RACJAN      0003A
     A                                      VALUES('JA ' 'NEI')
     A                                      CHKMSGID(RMA0090 *LIBL/QMFOKON)
     A                                      COLHDG('Fri mnd. JA/NEI')
     A            RACDA1      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Dager kredit1')
     A            RACDA2      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Dager kredit2')
     A            RACRA2      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Rabatt kredit2')
     A            RACDA3      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Dager kredit3')
     A            RACRA3      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Rabatt kredit3')
     A            RACDAT    R               REFFLD(RÅEDAT)
     A            RACTIM    R               REFFLD(RÅETIM)
     A            RACUSR    R               REFFLD(RÅEUSR)
      *
      *   FASTE KONTI             RA04PF    (RAD)
      *
     A            RADFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RADK01      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Utgående MVA-konto')
     A            RADS01      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Utgående MVA - bærer')
     A            RADA01      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Utgående MVA - avd.')
     A            RADK02      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Inngående MVA  konto')
     A            RADS02      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Inngående MVA  bærer')
     A            RADA02      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Inngående MVA  avd.')
     A            RADK03      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Inv.avgift  konto')
     A            RADS03      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Inv.avgift  bærer')
     A            RADA03      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Inv.avgift  avd.')
     A            RADK04      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Fylkesskatt. konto')
     A            RADS04      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Fylkesskatt. bærer')
     A            RADA04      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Fylkesskatt. avd.')
     A            RADK05      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Debitorer - konto')
     A            RADS05      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Debitorer - bærer')
     A            RADA05      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Debitorer - avd.')
     A            RADK06      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kreditorer - konto')
     A            RADS06      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kreditorer - bærer')
     A            RADA06      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kreditorer - avd.')
     A            RADK07      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kontantrabatt konto')
     A            RADS07      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kontantrabatt bærer')
     A            RADA07      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kontantrabatt avd.')
     A            RADK08      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Inng.utl. MVA  konto')
     A            RADS08      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Inng.utl. MVA  bærer')
     A            RADA08      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Inng.utl. MVA  avd.')
     A            RADK11      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Renteinntekter konto')
     A            RADS11      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Renteinntekter bærer')
     A            RADA11      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Renteinntekter avd.')
     A            RADK12      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Agio - konto')
     A            RADS12      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Agio - bærer')
     A            RADA12      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Agio - avd.')
     A            RADK13      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Disagio - konto')
     A            RADS13      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Disagio - bærer')
     A            RADA13      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Disagio - avd.')
     A            RADK14      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Øreavrunding konto')
     A            RADS14      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Øreavrunding bærer')
     A            RADA14      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Øreavrunding avd.')
     A            RADK15      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bank - konto')
     A            RADS15      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bank - bærer')
     A            RADA15      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bank - avd.')
     A            RADK16      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lev.rabatt - konto')
     A            RADS16      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lev.rabatt - bærer')
     A            RADA16      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lev.rabatt - avd.')
     A            RADK17      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kasse - konto')
     A            RADS17      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kasse - bærer')
     A            RADA17      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kasse - avd.')
     A            RADK19      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ink.prov.- konto')
     A            RADS19      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ink.prov.- bærer')
     A            RADA19      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ink.prov. - avd.')
     A            RADK20      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bet.gebyr - konto')
     A            RADS20      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bet.gebyr - bærer')
     A            RADA20      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bet.gebyr - avd.')
     A            RADK21      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Interims - konto')
     A            RADS21      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Interims - bærer')
     A            RADA21      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Interims - avd.')
     A            RADDAT    R               REFFLD(RÅEDAT)
     A            RADTIM    R               REFFLD(RÅETIM)
     A            RADUSR    R               REFFLD(RÅEUSR)
      *
      *   MVA-KODER               RA05PF    (RAE)
      *
     A            RAESTA      0001A
     A                                      COLHDG('Status')
     A            RAEFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAEKOD      0001A
     A                                      COLHDG('MVA-kode')
     A            RAETXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Tekst')
     A            RAEPRO      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Merverdiavgift')
     A            RAEINV      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Investeringsavgift')
     A            RAEMDA          L
     A                                      COLHDG('Endringsdato')
     A            RAEGPR      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Gammel MVA.')
     A            RAEGIN      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Gammel Inv.avg.')
     A            RAEBMK      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Behandlingskode')
     A            RAEBPR      0005S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('%-andel som beh.')
     A            RAEPDA          L
     A                                      COLHDG('Endringsdato')
     A            RAEBGP      0005S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('%-andel som beh.')
     A            RAEDAT    R               REFFLD(RÅEDAT)
     A            RAETIM    R               REFFLD(RÅETIM)
     A            RAEUSR    R               REFFLD(RÅEUSR)
      *
      *   RABATTKATEGORI          RA06PF    (RAF)
      *
     A            RAFFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAFKOD      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rabattkategori')
     A            RAFTXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst ..')
     A            RAFDAT    R               REFFLD(RÅEDAT)
     A            RAFTIM    R               REFFLD(RÅETIM)
     A            RAFUSR    R               REFFLD(RÅEUSR)
      *
      *   AVDELING                RA07PF    (RAG)
      *
     A            RAGFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAGKOD      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling')
6.24 A            RAGTXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RAGADR      0030A
     A                                      COLHDG('Adresse')
     A            RAGAD2      0030A
     A                                      COLHDG('Mellomadr.')
     A                                      TEXT('Mellomadresse')
     A            RAGPNR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Postnr.')
     A            RAGSTE      0030A
     A                                      COLHDG('Poststed')
     A            RAGTLF      0011A
     A                                      COLHDG('Telefon')
     A                                      TEXT('Telefonnummer')
     A            RAGFAX      0011A
     A                                      COLHDG('Telefax')
     A                                      TEXT('Telefaxnummer')
     A            RAGBGI      0011S 0
     A                                      COLHDG('Bankgiro')
     A                                      TEXT('Bankgiro')
     A                                      EDTCDE(Z)
     A            RAGEAN      0013S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('EAN-Kode')
     A                                      COLHDG('EAN-Kode')
     A            RAGPÅT      0001A
     A                                      VALUES(' ' 'P' '%')
     A                                      CHKMSGID(RMA0100 *LIBL/QMFOKON)
     A                                      COLHDG('Type sats')
     A            RAGSAT      0007S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Sats (P/%)')
     A            RAGMEF      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Med-post Firma')
     A            RAGMEK      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Med-post Konto')
     A            RAGMES      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Med-post bærer')
     A            RAGMEA      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Med-post Avd.')
     A            RAGMOF      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Mot-post Firma')
     A            RAGMOK      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Mot-post Konto')
     A            RAGMOS      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Mot-post bærer')
     A            RAGMOA      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Mot-post Avd.')
     A            RAGKTA      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMA0110 *LIBL/QMFOKON)
     A                                      COLHDG('Kontroll Avd.')
     A            RAGPRF      0004A
     A                                      COLHDG('Profitsenter')
     A            RAGSPR      0001A
     A                                      TEXT('Sperrekode')
     A                                      COLHDG('Sp')
      *
     A            RAGLTY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
8.02 A            RAGPRG      0001A
     A                                      TEXT('Prisgruppe')
     A                                      COLHDG('Pg')
6.27  *
6.27 A            RAGMAI      0050A         TEXT('Mailadresse')
6.27 A                                      COLHDG('Mailadresse')
6.27  *
6.27 A            RAGWEB      0050A
6.27 A                                      TEXT('Webadresse')
6.27 A                                      COLHDG('Webadresse')
6.27  *
     A            RAGDAT    R               REFFLD(RÅEDAT)
     A            RAGTIM    R               REFFLD(RÅETIM)
     A            RAGUSR    R               REFFLD(RÅEUSR)
      *
      *   DISTRIKT                RA08PF    (RAH)
      *
     A            RAHFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAHKOD      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Distrikt')
     A            RAHTXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RAHDAT    R               REFFLD(RÅEDAT)
     A            RAHTIM    R               REFFLD(RÅETIM)
     A            RAHUSR    R               REFFLD(RÅEUSR)
      *
      *   SELGER                  RA09PF    (RAI)
      *
     A            RAIFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAIKOD      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Selger')
     A            RAITXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RAIKTO      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto (Inter-SUN)')
     A            RAIRSK      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Reskontro(Inter-SUN)')
     A            RAIMVA      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('MVA-plikt(Inter-SUN)')
     A            RAIPRK      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Provisjon(Inter-SUN)')
     A            RAIBLK      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bil.kode (Inter-SUN)')
     A            RAISA2      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Sats-2   (Inter-SUN)')
     A            RAISA3      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Sats-3   (Inter-SUN)')
     A            RAISA4      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Sats-4   (Inter-SUN)')
     A            RAISA5      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Sats-5   (Inter-SUN)')
     A            RAIEMA      0050A
     A                                      TEXT('E-mail adresse')
     A                                      COLHDG('E-mail adresse')
6.16 A            RAIMOB      0011A
6.16 A                                      TEXT('Mobil-nr.')
6.16 A                                      COLHDG('Mobil-nr.')
6.41 A            RAIK01      0001S 0
6.41 A                                      TEXT('Mail Varer')
6.41 A                                      COLHDG('Mail varer')
6.41 A                                      EDTCDE(Z)
6.41 A                                      VALUES(0 1)
6.41 A            RAIK02      0001S 0
6.41 A                                      TEXT('Ledig')
6.41 A                                      COLHDG('Ledig')
6.41 A                                      EDTCDE(Z)
6.41 A                                      VALUES(0 1)
6.41 A            RAIK03      0001S 0
6.41 A                                      TEXT('Ledig')
6.41 A                                      COLHDG('Ledig')
6.41 A                                      EDTCDE(Z)
6.41 A                                      VALUES(0 1)
6.41 A            RAIK04      0001S 0
6.41 A                                      TEXT('Ledig')
6.41 A                                      COLHDG('Ledig')
6.41 A                                      EDTCDE(Z)
6.41 A                                      VALUES(0 1)
6.41 A            RAIK05      0001S 0
6.41 A                                      TEXT('Ledig')
6.41 A                                      COLHDG('Ledig')
6.41 A                                      EDTCDE(Z)
6.41 A                                      VALUES(0 1)
6.41 A            RAIK06      0001S 0
6.41 A                                      TEXT('Ledig')
6.41 A                                      COLHDG('Ledig')
6.41 A                                      EDTCDE(Z)
6.41 A                                      VALUES(0 1)
6.41 A            RAIK07      0001S 0
6.41 A                                      TEXT('Ledig')
6.41 A                                      COLHDG('Ledig')
6.41 A                                      EDTCDE(Z)
6.41 A                                      VALUES(0 1)
6.41 A            RAIK08      0001S 0
6.41 A                                      TEXT('Ledig')
6.41 A                                      COLHDG('Ledig')
6.41 A                                      EDTCDE(Z)
6.41 A                                      VALUES(0 1)
6.41 A            RAIK09      0001S 0
6.41 A                                      TEXT('Ledig')
6.41 A                                      COLHDG('Ledig')
6.41 A                                      EDTCDE(Z)
6.41 A                                      VALUES(0 1)
6.41 A            RAIK10      0001S 0
6.41 A                                      TEXT('Ledig')
6.41 A                                      COLHDG('Ledig')
6.41 A                                      EDTCDE(Z)
6.41 A                                      VALUES(0 1)
     A            RAIDAT    R               REFFLD(RÅEDAT)
     A            RAITIM    R               REFFLD(RÅETIM)
     A            RAIUSR    R               REFFLD(RÅEUSR)
      *
      *   LAGER                   RA10PF    (RAJ)
      *
     A            RAJFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAJKOD      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lager')
     A            RAJTXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RAJADR      0030A
     A                                      COLHDG('Adresse')
     A            RAJAD2      0030A
     A                                      COLHDG('Mellomadr.')
     A                                      TEXT('Mellomadresse')
     A            RAJPNR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Postnr.')
     A            RAJSTE      0030A
     A                                      COLHDG('Poststed')
     A            RAJTLF      0011A
     A                                      COLHDG('Telefon')
     A                                      TEXT('Telefonnummer')
     A            RAJFAX      0011A
     A                                      COLHDG('Telefax')
     A                                      TEXT('Telefaxnummer')
     A            RAJAVD      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling')
     A            RAJDAT    R               REFFLD(RÅEDAT)
     A            RAJTIM    R               REFFLD(RÅETIM)
     A            RAJUSR    R               REFFLD(RÅEUSR)
      *
      *   KUNDEKATEGORI           RA11PF    (RAK)
      *
     A            RAKFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAKKOD      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kundekategori')
     A            RAKTXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RAKKTO      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A            RAKSPS      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RAKAVD      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling')
     A            RAKKAT      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMA0120 *LIBL/QMFOKON)
     A                                      COLHDG('Spes. kategori')
     A            RAKAVP      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Avvikende rente')
     A            RAKBEB      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Betalingsbetingelse')
     A                                      COLHDG('Bet' 'bet')
     A            RAKBEM      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Betalingsmåte')
     A                                      COLHDG('Bet' 'måt')
     A            RAKPPA      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0170 *LIBL/QMFOKON)
     A                                      TEXT('Pris/Pakkseddel')
     A                                      COLHDG('Pr' 'pa')
     A            RAKNTO      0001S 0
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0171 *LIBL/QMFOKON)
     A                                      TEXT('Pris på faktura')
     A                                      COLHDG('Pris' 'fakt')
     A            RAKSAM      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2 3 4)
     A                                      CHKMSGID(RMK0190 *LIBL/QMFOKON)
     A                                      TEXT('Samlefaktura')
     A                                      COLHDG('Sa' 'fa')
     A            RAKSEK      0002S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(00 01 07 14 30)
     A                                      CHKMSGID(RMK0260 *LIBL/QMFOKON)
     A                                      TEXT('Fakturasekvens')
     A                                      COLHDG('Fa' 'se')
     A            RAKBOK      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0173 *LIBL/QMFOKON)
     A                                      TEXT('Fakt. etter prisbok')
     A                                      COLHDG('Fa' 'pb')
     A            RAKGRN      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kreditgrense')
     A                                      COLHDG('Kredit' 'grense')
     A            RABGRN      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kreditgrense butikk')
     A                                      COLHDG('Kredit' 'butikk')
T5.30A            RAKORG      0001A
E5.41A                                      COLHDG('Organisasjonsnr.')
T5.41A            RAKPNR      0001A
T5.41A                                      COLHDG('Personnr.')
T5.41A            RAKKPE      0001A
T5.41A                                      COLHDG('Kontaktperson')
T5.41A            RAKTLF      0001A
T5.41A                                      COLHDG('Telefon')
T5.41A            RAKFAX      0001A
T5.41A                                      COLHDG('Telefaks')
T5.41A            RAKEMA      0001A
T5.41A                                      COLHDG('E-mail adr.')
7.nx A            RAKUGR      0010A
7.nx A                                      TEXT('Kundegruppe')
7.nx A                                      COLHDG('Kundegruppe')
7.nx A            RAKKPR      0001A
7.nx A                                      TEXT('Krav til prosjekt')
7.nx A                                      COLHDG('Krav til prosjekt')
     A            RAKDAT    R               REFFLD(RÅEDAT)
     A            RAKTIM    R               REFFLD(RÅETIM)
     A            RAKUSR    R               REFFLD(RÅEUSR)
      *
      *   LAND                    RA12PF    (RAL)
      *
     A            RALFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RALKOD      0002A
     A                                      COLHDG('Land')
     A            RALTXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RALSPR      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2 3 4 5)
     A                                      CHKMSGID(RMA0140 *LIBL/QMFOKON)
     A                                      COLHDG('Språkkode')
     A            RALPFX      0004S 0
     A                                      COLHDG('Prefix tlf')
     A            RALDAT    R               REFFLD(RÅEDAT)
     A            RALTIM    R               REFFLD(RÅETIM)
     A            RALUSR    R               REFFLD(RÅEUSR)
      *
      *   BUDSJETTNØKKEL          RA13PF    (RAM)
      *
     A            RAMFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAMKOD      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Budsjettnøkkel')
     A            RAMTXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Tekst')
     A            RAMP01      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Periode01-%')
     A            RAMP02      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Periode02-%')
     A            RAMP03      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Periode03-%')
     A            RAMP04      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Peridoe04-%')
     A            RAMP05      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Periode05-%')
     A            RAMP06      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Periode06-%')
     A            RAMP07      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Periode07-%')
     A            RAMP08      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Periode08-%')
     A            RAMP09      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Periode09-%')
     A            RAMP10      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Periode10-%')
     A            RAMP11      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Periode11-%')
     A            RAMP12      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Periode12-%')
     A            RAMP13      0004S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Periode13-%')
     A            RAMDAT    R               REFFLD(RÅEDAT)
     A            RAMTIM    R               REFFLD(RÅETIM)
     A            RAMUSR    R               REFFLD(RÅEUSR)
      *
      *   LEVERANDØRKATEGORI      RA14PF    (RAN)
      *
     A            RANFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RANKOD      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Leverandørkategori')
     A            RANTXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RANKTO      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A            RANSPS      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RANAVD      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling')
     A            RANKAT      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMA0120 *LIBL/QMFOKON)
     A                                      COLHDG('Spes. Kat.(J/N)')
T5.50A            RANORG      0001A
T5.50A                                      COLHDG('Organisasjonsnr.')
T5.50A            RANBGI      0001A
T5.50A                                      COLHDG('Bankkonto')
T5.50A            RANKPE      0001A
T5.50A                                      COLHDG('Kontaktperson')
T5.50A            RANTLF      0001A
T5.50A                                      COLHDG('Telefon')
T5.50A            RANFAX      0001A
T5.50A                                      COLHDG('Telefaks')
T5.50A            RANEMA      0001A
T5.50A                                      COLHDG('E-mail adr.')
     A            RANDAT    R               REFFLD(RÅEDAT)
     A            RANTIM    R               REFFLD(RÅETIM)
     A            RANUSR    R               REFFLD(RÅEUSR)
      *
      *   MENGDE                  RA15PF    (RAO)
      *
     A            RAOFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAOKOD      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Mengde')
     A            RAOTXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Tekst')
     A            RAOFAK      0008S 4
     A                                      EDTCDE(K)
     A                                      COLHDG('Omregningsfaktor')
     A            RAOFOR      0007A
     A                                      COLHDG('Forkortet type')
     A            RAODAT    R               REFFLD(RÅEDAT)
     A            RAOTIM    R               REFFLD(RÅETIM)
     A            RAOUSR    R               REFFLD(RÅEUSR)
      *
      *   VALUTAKURSER            RA16PF    (RAP)
      *
     A            RAPFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAPKOD      0003A
     A                                      COLHDG('Valutakurs .........')
     A            RAPMNA      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Mynttype')
     A            RAPMFO      0005A
     A                                      COLHDG('Mynttype Forkortet')
     A            RAPMKU      0010S 6
     A                                      EDTCDE(K)
     A                                      COLHDG('Faktor til NOK')
     A            RAPMTI      0010S 6
     A                                      EDTCDE(K)
     A                                      COLHDG('Faktor til valuta')
     A            RAPBKT      0011S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bank-konto')
     A            RAPKTO      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedboks bank-konto')
     A            RAPSPS      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedboks bank-bærer')
     A            RAPAVD      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedboks bank-avd.')
     A            RAPKDA          L
     A                                      COLHDG('Endr' 'dato')
     A            RAPMKG      0010S 6
     A                                      EDTCDE(K)
     A                                      COLHDG('Faktor til NOK Gml.')
     A            RAPMTG      0010S 6
     A                                      EDTCDE(K)
     A                                      COLHDG('Faktor til val. Gml.')
     A            RAPDAT    R               REFFLD(RÅEDAT)
     A            RAPTIM    R               REFFLD(RÅETIM)
     A            RAPUSR    R               REFFLD(RÅEUSR)
      *
      *   FORSENDELSESMÅTE        RA17PF    (RAQ)
      *
     A            RAQFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAQKOD      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Forsendelse')
     A            RAQTXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
6.2B1A            RAQDIR      0001S 0
6.2B1A                                      EDTCDE(Z)
6.2B1A                                      VALUES(0 1)
6.2B1A                                      COLHDG('Direkte er valgt')
6.23 A            RAQKJO      0001S 0
6.23 A                                      EDTCDE(Z)
6.23 A                                      COLHDG('Kjørekontor')
6.34 A            RAQSMK      0001S 0
6.34 A                                      EDTCDE(Z)
6.34 A                                      COLHDG('SMS til kunde')
6.34 A            RAQSMS      0001S 0
6.34 A                                      EDTCDE(Z)
6.34 A                                      COLHDG('SMS til selger')
     A            RAQDAT    R               REFFLD(RÅEDAT)
     A            RAQTIM    R               REFFLD(RÅETIM)
     A            RAQUSR    R               REFFLD(RÅEUSR)
      *
      *   LEVERINGSBETINGELSE     RA18PF    (RAR)
      *
     A            RARFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RARKOD      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Leveringsbetingelse')
     A            RARTX1      0025A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Tekstfelt-1')
     A            RARTX2      0025A
     A                                      COLHDG('Tekstfelt-2')
     A            RARTX3      0025A
     A                                      COLHDG('Tekstfelt-3')
     A            RARDAT    R               REFFLD(RÅEDAT)
     A            RARTIM    R               REFFLD(RÅETIM)
     A            RARUSR    R               REFFLD(RÅEUSR)
      *
      *   KONTOKLASSE             RA19PF    (RAS)
      *
     A            RASFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RASKOD      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Klasse')
     A            RASTXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Tekst')
     A            RASSDK      0002A
     A                                      COLHDG('Statuskode')
     A            RASBFA      0005S 3
     A                                      EDTCDE(K)
     A                                      COLHDG('Budsjettfaktor')
T5.60A            RASPG1         2          COLHDG('Kont.pl.gr1')
T5.60A                                      TEXT('Kontoplangruppe')
T5.60A            RASPG2         2          COLHDG('Kont.pl.gr2')
T5.60A                                      TEXT('Kontoplangruppe')
T5.60A            RASPG3         2          COLHDG('Kont.pl.gr3')
T5.60A                                      TEXT('Kontoplangruppe')
T5.60A            RASPG4         2          COLHDG('Kont.pl.gr4')
T5.60A                                      TEXT('Kontoplangruppe')
T5.60A            RASPG5         2          COLHDG('Kont.pl.gr5')
T5.60A                                      TEXT('Kontoplangruppe')
     A            RASDAT    R               REFFLD(RÅEDAT)
     A            RASTIM    R               REFFLD(RÅETIM)
     A            RASUSR    R               REFFLD(RÅEUSR)
      *
      *   KONTOGRUPPE             RA20PF    (RAT)
      *
     A            RATFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RATKOD      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Gruppe')
     A            RATTXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Tekst')
     A            RATSDK      0002A
     A                                      COLHDG('Statuskode')
     A            RATBFA      0005S 3
     A                                      EDTCDE(K)
     A                                      COLHDG('Budsjettfaktor')
T5.60A            RATPG1         2          COLHDG('Kont.pl.gr1')
T5.60A                                      TEXT('Kontoplangruppe')
T5.60A            RATPG2         2          COLHDG('Kont.pl.gr2')
T5.60A                                      TEXT('Kontoplangruppe')
T5.60A            RATPG3         2          COLHDG('Kont.pl.gr3')
T5.60A                                      TEXT('Kontoplangruppe')
T5.60A            RATPG4         2          COLHDG('Kont.pl.gr4')
T5.60A                                      TEXT('Kontoplangruppe')
T5.60A            RATPG5         2          COLHDG('Kont.pl.gr5')
T5.60A                                      TEXT('Kontoplangruppe')
     A            RATDAT    R               REFFLD(RÅEDAT)
     A            RATTIM    R               REFFLD(RÅETIM)
     A            RATUSR    R               REFFLD(RÅEUSR)
      *
      *   AKTIVITET               RA21PF    (RAU)
      *
     A            RAUFIR      0003S 0
     A                                      COLHDG('Firma')
6.22 A            RAUKOD    R               REFFLD(RÅAKTI)
     A            RAUTXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Aktivitets-tekst')
     A            RAUTX2      0030A
     A                                      COLHDG('Utfyllende tekst')
     A            RAUKTO      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Finans konto')
     A            RAUSPS      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Finans Kostnadsbærer')
     A            RAUAVD      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Finans avdeling')
     A            RAUPKT      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avgiftspliktig konto')
     A            RAUPSP      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avgiftspliktig bærer')
     A            RAUPAV      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avgiftspliktig avd.')
     A            RAUPMV      0001A
     A                                      COLHDG('Pliktig MVA-kode')
     A            RAUFKT      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avgiftsfri konto')
     A            RAUFSP      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avgiftsfri bærer')
     A            RAUFAV      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avgiftsfri avd.')
     A            RAUFMV      0001A
     A                                      COLHDG('Fri MVA-kode')
     A            RAUPRI      0009S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Pris')
     A            RAUMUD      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMA0250 *LIBL/QMFOKON)
     A                                      COLHDG('Med/Uten desimal')
     A            RAUFAK      0005S 3
     A                                      EDTCDE(K)
     A                                      COLHDG('Prisfaktor')
     A            RAUMNG      0001A
     A                                      VALUES(' ' 'J' 'N')
     A                                      CHKMSGID(RMA0260 *LIBL/QMFOKON)
     A                                      COLHDG('Mengde i prosjekt')
     A            RAUMVA      0001A
     A                                      COLHDG('MVA-kode')
     A            RAURAB      0001A
     A                                      VALUES(' ' 'J' 'N')
     A                                      CHKMSGID(RMA0270 *LIBL/QMFOKON)
     A                                      COLHDG('Rabatt posteres')
     A            RAURBK      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagkode for rabatt')
     A            RAUDAT    R               REFFLD(RÅEDAT)
     A            RAUTIM    R               REFFLD(RÅETIM)
     A            RAUUSR    R               REFFLD(RÅEUSR)
      *
      *   SPEDITØR                RA22PF    (RAV)
      *
     A            RAVFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAVKOD      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Speditør')
     A            RAVTXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
6.15 A            RAVFRA         1S 0
6.15 A                                      COLHDG('Fraktbrev')
6.15 A                                      EDTCDE(Z)
     A            RAVDAT    R               REFFLD(RÅEDAT)
     A            RAVTIM    R               REFFLD(RÅETIM)
     A            RAVUSR    R               REFFLD(RÅEUSR)
      *
      *   VIRKSOMHET              RA23PF    (RAW)
      *
     A            RAWFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAWKOD      0002A
     A                                      COLHDG('Virksomhetskode ....')
     A            RAWTXT      0020A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RAWBPK      0011S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bank-giro')
     A            RAWKTO      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A            RAWSPS      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bærer')
     A            RAWAVD      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avd.')
     A            RAWBIK      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagskode')
     A            RAWDAT    R               REFFLD(RÅEDAT)
     A            RAWTIM    R               REFFLD(RÅETIM)
     A            RAWUSR    R               REFFLD(RÅEUSR)
      *
      *   REKLAMASJONSÅRSAK       RA24PF    (RAX)
      *
     A            RAXFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAXRKO      0002A
     A                                      COLHDG('Reklamasjonskode')
     A            RAXTXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RAXDAT    R               REFFLD(RÅEDAT)
     A            RAXTIM    R               REFFLD(RÅETIM)
     A            RAXUSR    R               REFFLD(RÅEUSR)
      *
      *   KJØRERUTE               RA25PF    (RAY)
      *
     A            RAYFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAYRUT      0002S 0
     A                                      COLHDG('Kjørerute')
     A                                      EDTCDE(Z)
     A            RAYTXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RAYDAT    R               REFFLD(RÅEDAT)
     A            RAYTIM    R               REFFLD(RÅETIM)
     A            RAYUSR    R               REFFLD(RÅEUSR)
      *
      *   PRODUKTANSVARLIG        RA26PF    (RAZ)
      *
     A            RAZFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RAZSAK      0004A
     A                                      COLHDG('Produktansvarlig')
     A            RAZTXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RAZEMA      0050A
     A                                      TEXT('E-mail adresse')
     A                                      COLHDG('E-mail adresse')
     A            RAZDAT    R               REFFLD(RÅEDAT)
     A            RAZTIM    R               REFFLD(RÅETIM)
     A            RAZUSR    R               REFFLD(RÅEUSR)
      *
      *   KOSTNADSBÆRERGRUPPE     RA27PF    (REA)
      *
     A            REAFIR      0003S 0
     A                                      COLHDG('Firma')
     A            REAGRP      0002A
     A                                      COLHDG('Kostn.bærergruppe')
     A            REATXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            READAT    R               REFFLD(RÅEDAT)
     A            REATIM    R               REFFLD(RÅETIM)
     A            REAUSR    R               REFFLD(RÅEUSR)
      *
      *   KOSTNADSBÆRER           RA28PF    (REB)
      *
     A            REBFIR      0003S 0
     A                                      COLHDG('Firma')
     A            REBKOD      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kostnadesbærer')
     A            REBTXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            REBGRP      0002A
     A                                      COLHDG('Kostn.bærergruppe')
     A            REBSPR      0001A
     A                                      TEXT('Sperrekode')
     A                                      COLHDG('Sp')
     A            REBDAT    R               REFFLD(RÅEDAT)
     A            REBTIM    R               REFFLD(RÅETIM)
     A            REBUSR    R               REFFLD(RÅEUSR)
      *
      *   Mobiloperatør           RA29PF    (REC)
      *
     A            RECFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RECKOD      0002A
     A                                      COLHDG('Mobiloperatør')
     A            RECTXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            RECADR      0030A
     A                                      COLHDG('Adresse')
     A                                      TEXT('Adresse etter alfakrøll')
     A            RECDAT    R               REFFLD(RÅEDAT)
     A            RECTIM    R               REFFLD(RÅETIM)
     A            RECUSR    R               REFFLD(RÅEUSR)
      *
      *   Prisgrupper             RA30PF    (RED)
      *
     A            REDFIR      0003S 0
     A                                      COLHDG('Firma')
8.01 A            REDKOD      0002A
     A                                      COLHDG('Prisgruppe')
     A            REDTXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
     A                                      COLHDG('Beskrivende tekst')
     A            REDDAT    R               REFFLD(RÅEDAT)
     A            REDTIM    R               REFFLD(RÅETIM)
     A            REDUSR    R               REFFLD(RÅEUSR)
6.31  *
6.31  *   Leveringsmåte bestilliing RA31PF    (REE)
6.31  *
6.31 A            REEFIR      0003S 0
6.31 A                                      COLHDG('Firma')
6.31 A            REEKOD      0002S 0
6.31 A                                      COLHDG('Leveringsmåte')
6.31 A            REETXT      0030A
6.31 A                                      COMP(NE ' ')
6.31 A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
6.31 A                                      COLHDG('Beskrivende tekst')
6.31 A            REEEDI      0001S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      COLHDG('Edifaktkode')
6.31 A            REEDAT    R               REFFLD(RÅEDAT)
6.31 A            REETIM    R               REFFLD(RÅETIM)
6.31 A            REEUSR    R               REFFLD(RÅEUSR)
6.39  *
6.39  *   Returkoder              RA50PF    (REF)
6.39  *
6.39 A            REGFIR      0003S 0
6.39 A                                      COLHDG('Firma')
8.01 A            REGKOD      0002A
6.39 A                                      COLHDG('Prisgruppe')
6.39 A            REGTXT      0030A
6.39 A                                      COMP(NE ' ')
6.39 A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
6.39 A                                      COLHDG('Beskrivende tekst')
6.39 A            REGDAT    R               REFFLD(RÅEDAT)
6.39 A            REGTIM    R               REFFLD(RÅETIM)
6.39 A            REGUSR    R               REFFLD(RÅEUSR)
      *
      *   FORMULARTEKSTER         RA70PF    (R70)
      *
     A            R70FIR      0003S 0
     A                                      COLHDG('Firma')
     A            R70KOD      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rapport-nr. (70,71,)')
     A            R70SPR      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Språk-kode (1 - 5)')
     A            R70LIN      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Linje-nr.')
     A            R70LTX      0080A
     A                                      COLHDG('Hele linjen')
     A            R70DAT    R               REFFLD(RÅEDAT)
     A            R70TIM    R               REFFLD(RÅETIM)
     A            R70USR    R               REFFLD(RÅEUSR)
      *
      *  FORDELING-REGISTER       RFORPF    (RF)
      *
     A            RFFIRM      0003S 0
     A                                      COLHDG('Firma')
     A            RFKODE      0001A
     A                                      COLHDG('Kode')
     A                                      VALUES(' ' 'B' 'P' 'O')
     A                                      CHKMSGID(RMF0040 *LIBL/QMFOKON)
     A            RFKONT      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A            RFSPES      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kostnadsbærer')
     A            RFAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling')
     A            RFLINJ      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Record type')
     A            RFPROS      0005S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('%andel')
     A            RFPRIS      0007S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Pris')
     A            RFPROT      0005S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Til %andel')
     A            RFKTO1      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Til Konto-1')
     A            RFSPS1      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Til Kostnadsbærer-1')
     A            RFAVD1      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Til Avdeling-1')
     A            RFKTO2      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Til Konto-2')
     A            RFSPS2      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Til Kostnadsbærer-2')
     A            RFAVD2      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Til Avdeling-2')
6.10 A            RFODAT    R               REFFLD(RÅODAT)
6.10 A            RFOTIM    R               REFFLD(RÅOTIM)
6.10 A            RFOUSR    R               REFFLD(RÅOUSR)
     A            RFEDAT    R               REFFLD(RÅEDAT)
     A            RFETIM    R               REFFLD(RÅETIM)
     A            RFEUSR    R               REFFLD(RÅEUSR)
      *
      *  BANK-Giro grunnlag RGIRPF          (RG)
      *
     A            RGFIRM      0003S 0
     A                                      COLHDG('Firma')
     A            RGKUND      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kundenummer')
     A            RGNAVN      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMK0370 *LIBL/QMFOKON)
     A                                      COLHDG('Kundenavn')
     A            RGGATE      0030A
     A                                      COLHDG('Gateadresse')
     A            RGADR2      0030A
     A                                      COLHDG('Mellomadresse')
     A            RGPONR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Postnr.')
     A            RGSTED      0030A
     A                                      COLHDG('Poststed')
     A            RGPERS      0030A
     A                                      COLHDG('Kontaktperson')
     A            RGTLFN      0011A
     A                                      COLHDG('Telefonnummer')
     A            RGTLFX      0011A
     A                                      COLHDG('Telefaxsnummer')
     A            RGAKTI      0001A
     A                                      COLHDG('Type bilag (P,F,R,S)')
6.NU A            RGBILN      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagsnummer')
     A            RGBDAT          L
     A                                      COLHDG('Bilags-dato')
     A            RGBGIR      0011S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bankgiro(kunde)')
     A            RGBELØ      0011S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Beløp')
     A            RGRENT      0011S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Renter')
     A            RGRABB      0005S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Rabatt %')
     A            RGTEXT      0020A
     A                                      COLHDG('Bilagstekst')
     A            RGFDAT          L
     A                                      COLHDG('Forfalls-dato')
     A            RGBGIF        13
     A                                      COLHDG('Bankgiro(firma)')
     A            RGLAGR      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lager')
     A            RGSLGR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Selger')
     A            RGDIST      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Distrikt')
     A            RGKATG      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kategori')
     A            RGBETB      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Betalingsbetingelse')
     A            RGBETM      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Betalingsmåte')
     A            RGFRIE      0005A
     A                                      COLHDG('Frie koder')
     A            RGAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling')
     A            RGAVTS      0030A
     A                                      COLHDG('Avtalespesifikasjon')
     A            RGFTNR      0009S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Foretaksnummer')
     A            RGKKID      0021A
     A                                      COLHDG('Kidd')
     A            RGKKEY      0064A
     A                                      COLHDG('Fast = blank')
      *
      *  KLADDEBLOKK              RKLAPF    (RX)
      *
     A            RXFIRM      0003S 0
     A                                      COLHDG('Firma')
     A            RXSYST      0001A
     A                                      TEXT('Systemkode')
     A                                      COLHDG('Sk')
6.22 A            RXPROS    R               REFFLD(RÅPROA)
6.22 A            RXAKTI    R               REFFLD(RÅAKTI)
     A            RXKONT      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A            RXSPES      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RXAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A            RXLINJ      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Linjenr.')
     A                                      COLHDG('Linje')
     A            RXTGRP      0003A
     A                                      TEXT('Grupperingskode')
     A                                      COLHDG('Grp' 'kod')
     A            RXTEXT      0078A
     A                                      COLHDG('Fri-tekst')
6.NU A            RXBILN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagsnr.')
     A                                      COLHDG('Bilag')
T5.40A            RXTIST          Z
     A                                      TEXT('Post. timestamp')
     A                                      COLHDG('Post' 't-stamp')
T5.40A            RXONR          6S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Ordrenr.')
     A                                      COLHDG('Ordre')
6.10 A            RXODAT    R               REFFLD(RÅODAT)
6.10 A            RXOTIM    R               REFFLD(RÅOTIM)
6.10 A            RXOUSR    R               REFFLD(RÅOUSR)
6.10 A            RXEDAT    R               REFFLD(RÅEDAT)
6.10 A            RXETIM    R               REFFLD(RÅETIM)
6.10 A            RXEUSR    R               REFFLD(RÅEUSR)
      *
      *  KONTOPLAN                RHOVPF    (RH)
      *
     A            RHFIRM      0003S 0
     A                                      COLHDG('Firma')
     A            RHKONT      0005S 0
     A                                      COLHDG('Konto')
     A            RHSPES      0004S 0
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RHAVDE      0004S 0
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A            RHTEXT      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMH0200 *LIBL/QMFOKON)
     A                                      COLHDG('Kontotekst')
     A            RHTXT2      0030A
     A                                      COLHDG('Kontotekst 2')
     A            RHALFA      0012A
     A                                      COLHDG('Alfafelt')
     A            RHSPRK      0001A
     A                                      TEXT('Sperrekode')
     A                                      COLHDG('Sp')
     A            RHMVAK      0001A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMH0190 *LIBL/QMFOKON)
     A                                      TEXT('MVA-kode')
     A                                      COLHDG('MVA')
     A            RHMVAO      0001A
     A                                      TEXT('MVA-overstyring')
     A                                      COLHDG('Mo')
     A            RHMVAG      0008A
     A                                      TEXT('Gyldige MVA-koder')
     A                                      COLHDG('MVA-koder')
     A            RHBNØK      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Budsjett-nøkkel')
     A                                      COLHDG('Bn')
     A            RHVALK      0003A
     A                                      TEXT('Valutakode')
     A                                      COLHDG('Val' 'kod')
     A            RHAVDK      0001A
     A                                      TEXT('Avdelingskode')
     A                                      COLHDG('Ak')
     A            RHPROJ      0001A
     A                                      TEXT('Prosjektkode')
     A                                      COLHDG('Pk')
     A            RHBÆRK      0001A
     A                                      TEXT('Kostnadsbærerkode')
     A                                      COLHDG('Bk')
     A            RHMNGD      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Mengdekode')
     A                                      COLHDG('Mk')
     A            RHNØKK      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Nøkkeltall-kode')
     A                                      COLHDG('Nk')
T5.30A            RHREFN         4S 0       COLHDG('Refnr.')
     A                                      EDTCDE(Z)
     A                                      TEXT('Referansenr.')
T5.30A            RHREFT        30          COLHDG('Ref.tekst')
     A                                      TEXT('Referanse tekst')
T5.60A            RHKPG1         2          COLHDG('Kont.pl.gr1')
T5.60A                                      TEXT('Kontoplangruppe')
T5.60A            RHKPG2         2          COLHDG('Kont.pl.gr2')
T5.60A                                      TEXT('Kontoplangruppe')
T5.60A            RHKPG3         2          COLHDG('Kont.pl.gr3')
T5.60A                                      TEXT('Kontoplangruppe')
T5.60A            RHKPG4         2          COLHDG('Kont.pl.gr4')
T5.60A                                      TEXT('Kontoplangruppe')
T5.60A            RHKPG5         2          COLHDG('Kont.pl.gr5')
T5.60A                                      TEXT('Kontoplangruppe')
6.10 A            RHODAT    R               REFFLD(RÅODAT)
6.10 A            RHOTIM    R               REFFLD(RÅOTIM)
6.10 A            RHOUSR    R               REFFLD(RÅOUSR)
     A            RHEDAT    R               REFFLD(RÅEDAT)
     A            RHETIM    R               REFFLD(RÅETIM)
     A            RHEUSR    R               REFFLD(RÅEUSR)
      *
      *  KONTO SALDO              RHSAPF    (RI)
      *
     A            RIFIRM      0003S 0
     A                                      COLHDG('Firma')
     A            RIKONT      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A            RISPES      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RIAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A            RIRAAR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('År')
     A            RITYPE      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Record type')
     A                                      COLHDG('Rt')
6.3D A            RISA01      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 01')
     A                                      COLHDG('Bev. Per 01')
6.3D A            RISA02      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 02')
     A                                      COLHDG('Bev. Per 02')
6.3D A            RISA03      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 03')
     A                                      COLHDG('Bev. Per 03')
6.3D A            RISA04      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 04')
     A                                      COLHDG('Bev. Per 04')
6.3D A            RISA05      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 05')
     A                                      COLHDG('Bev. Per 05')
6.3D A            RISA06      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 06')
     A                                      COLHDG('Bev. Per 06')
6.3D A            RISA07      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 07')
     A                                      COLHDG('Bev. Per 07')
6.3D A            RISA08      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 08')
     A                                      COLHDG('Bev. Per 08')
6.3D A            RISA09      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 09')
     A                                      COLHDG('Bev. Per 09')
6.3D A            RISA10      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 10')
     A                                      COLHDG('Bev. Per 10')
6.3D A            RISA11      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 11')
     A                                      COLHDG('Bev. Per 11')
6.3D A            RISA12      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 12')
     A                                      COLHDG('Bev. Per 12')
6.3D A            RISA13      0015S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 13')
     A                                      COLHDG('Bev. Per 13')
6.3D A            RISA00      0015S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Saldo 01.01')
6.10 A            RIODAT    R               REFFLD(RÅODAT)
6.10 A            RIOTIM    R               REFFLD(RÅOTIM)
6.10 A            RIOUSR    R               REFFLD(RÅOUSR)
6.10 A            RIEDAT    R               REFFLD(RÅEDAT)
6.10 A            RIETIM    R               REFFLD(RÅETIM)
6.10 A            RIEUSR    R               REFFLD(RÅEUSR)
      *
      *  KONTO POSTERINGER        RHTRPF    (RB)
      *
     A            RBFIRM      0003S 0
     A                                      COLHDG('Firma')
     A            RBKONT      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A            RBSPES      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RBAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A            RBRAAR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('År')
     A            RBRPER      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Periode')
     A                                      COLHDG('Per')
     A            RBBDAT          L
     A                                      TEXT('Bilags-dato')
     A                                      COLHDG('Bil.dat')
6.NU A            RBBILN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagsnr.')
     A                                      COLHDG('Bilag')
     A            RBBILK      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagskode')
     A                                      COLHDG('Bk')
     A            RBTEXT      0020A
     A                                      COLHDG('Bilagstekst')
     A            RBNETO      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Nettobeløp')
     A                                      COLHDG('Nettobeløp')
     A            RBMVAG      0011S 2
E5.30A                                      EDTCDE(K)
     A                                      TEXT('MVA Grunnlag')
     A                                      COLHDG('MVA Grl')
     A            RBAMVA      0005S 2
     A                                      EDTCDE(4)
     A                                      TEXT('Andel MVA i %')
     A                                      COLHDG('Andel %')
     A            RBPMVA      0005S 2
     A                                      EDTCDE(4)
     A                                      TEXT('MVA-prosent')
     A                                      COLHDG('MVA %')
     A            RBMVAB      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Beregnet mva')
     A                                      COLHDG('MVA-Beløp')
     A            RBPIVA      0005S 2
     A                                      EDTCDE(4)
     A                                      TEXT('IVA-prosent')
     A                                      COLHDG('IVA %')
     A            RBINVB      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Investeringsavgift')
     A                                      COLHDG('Inv.avg.')
     A            RBVALK      0003A
     A                                      TEXT('Postert valuta')
     A                                      COLHDG('Val' 'kod')
     A            RBVALB      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Valutabeløp')
     A                                      COLHDG('Valutabeløp')
     A            RBVALS      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Std. valutabeløp')
     A                                      COLHDG('Std.val.bel')
     A            RBMNGK      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Mengdekode')
     A                                      COLHDG('Men' 'kod')
     A            RBMNGD      0011S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Mengde')
     A            RBRMRK      0001A
     A                                      TEXT('Revisjonsjournal')
     A                                      COLHDG('Rev')
     A            RBMVAK      0001A
     A                                      TEXT('MVA-kode')
     A                                      COLHDG('MVA')
     A            RBMVAO      0001A
     A                                      TEXT('Overstyrt MVA')
     A                                      COLHDG('Ov')
     A            RBMMRK      0001A
     A                                      TEXT('MVA-oppgjør')
     A                                      COLHDG('Mo')
     A            RBMVAP      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('MVA-Periode')
     A                                      COLHDG('MVA')
     A            RBHMRK      0001A
     A                                      TEXT('Hovedbok-merke')
     A                                      COLHDG('Hm')
     A            RBAUTK      0001A
     A                                      TEXT('Vanlig/Automatisk')
     A                                      COLHDG('V/A')
     A            RBJOUR      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Journal-nr.')
     A                                      COLHDG('Journ')
6.22 A            RBPROS    R               REFFLD(RÅPROS)
6.22 A            RBHPRO    R               REFFLD(RÅPROA)
6.22 A            RBUPRO    R               REFFLD(RÅUPRO)
6.22 A            RBAKTI    R               REFFLD(RÅAKTI)
6.22 A            RBARBO    R               REFFLD(RÅARBO)
     A            RBPFAK      0001A
     A                                      TEXT('Fakturert Prosjekt')
     A                                      COLHDG('FP')
     A*                                     F=Fakturert
     A*                                     U=Uttrekt til Fakt
     A*                                     N=Skal ikke faktureres
     A            RBFAKA      0010A
     A                                      TEXT('Fakturert av')
     A                                      COLHDG('FaktAv')
     A            RBAVST      0001A
     A                                      TEXT('Statusfelt (Avstemt)')
     A                                      COLHDG('Av')
     A            RBBREF      0012A
     A                                      TEXT('Bank-referanse')
     A                                      COLHDG('Bank-ref.')
E5.40A            RBLFAK      0015A
T5.20A                                      TEXT('Lev.fakturanr.')
T5.20A                                      COLHDG('Lev.fakt.')
     A            RBTIST          Z
     A                                      TEXT('Post. timestamp')
     A                                      COLHDG('Post' 't-stamp')
      *
     A            RBKON6      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto spes.hovedbok')
     A            RBSTAT      0001A
     A                                      TEXT('Status')
     A                                      COLHDG('St')
6.12 A            RBSPOR      0010S 0
6.12 A                                      TEXT('Spor.ref.')
6.12 A                                      COLHDG('Spor.ref.')
6.12 A            RBAVKR      0010S 0
6.12 A                                      TEXT('Avkr.ref.')
6.12 A                                      COLHDG('Avkr.ref.')
6.10 A            RBODAT    R               REFFLD(RÅODAT)
6.10 A            RBOTIM    R               REFFLD(RÅOTIM)
6.10 A            RBOUSR    R               REFFLD(RÅOUSR)
6.10 A            RBEDAT    R               REFFLD(RÅEDAT)
6.10 A            RBETIM    R               REFFLD(RÅETIM)
6.10 A            RBEUSR    R               REFFLD(RÅEUSR)
      *
      *  KUNDE                    RKUNPF    (RK)
      *
     A            RKFIRM      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            RKKUND      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kundenummer')
     A                                      COLHDG('Kunde')
     A            RKNAVN      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RMK0370 *LIBL/QMFOKON)
     A                                      TEXT('Kundenavn')
     A                                      COLHDG('Kundenavn')
     A            RKALFA      0018A
     A                                      TEXT('Alfabetisk søkefelt')
     A                                      COLHDG('Alfasøkfelt')
     A            RKGATE      0030A
     A                                      TEXT('Gateadresse')
     A                                      COLHDG('Gateadresse')
     A            RKADR2      0030A
     A                                      TEXT('Mellomadresse')
     A                                      COLHDG('Mellomadresse')
     A            RKPONR      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Postnr.')
     A                                      COLHDG('Ponr.')
     A            RKSTED      0030A
     A                                      TEXT('Poststed')
     A                                      COLHDG('Poststed')
     A            RKBGAT      0030A
     A                                      TEXT('Besøksgate')
     A                                      COLHDG('Besøksgate')
     A            RKBADR      0030A
     A                                      TEXT('Besøksadresse')
     A                                      COLHDG('Besøksadresse')
     A            RKBPNR      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Besøkspostnr.')
     A                                      COLHDG('Besøkspostnr.')
     A            RKKOMN      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kommunenr.')
     A                                      COLHDG('Komm')
     A            RKLAND      0002A
     A                                      TEXT('Landkode')
     A                                      COLHDG('Land')
T5.5 A            RKUPNR      0009A
     A                                      TEXT('Utenlandsk Postnr.')
     A                                      COLHDG('Utl. Ponr.')
     A            RKFTNR      0009S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Foretaksnummer')
     A                                      COLHDG('Foretaksnummer')
     A            RKPENR      0011S 0       TEXT('Personnr.')
     A                                      COLHDG('Personnr.')
     A                                      EDTCDE(Z)
     A            RKPERS      0030A
     A                                      TEXT('Kontaktperson')
     A                                      COLHDG('Kontaktperson')
     A            RKEMAL      0050A
     A                                      TEXT('E-mail adresse')
     A                                      COLHDG('E-mail adresse')
     A            RKWEBA      0040A
     A                                      TEXT('Web adresse')
     A                                      COLHDG('Web adresse')
     A            RKTLFN      0011A
     A                                      TEXT('Telefonnummer')
     A                                      COLHDG('Telefon')
     A            RKTLFX      0011A
     A                                      TEXT('Telefaxsnummer')
     A                                      COLHDG('Telefax')
     A            RKMOBN      0011A
     A                                      TEXT('Mobil-nr.')
     A                                      COLHDG('Mobil-nr.')
     A            RKMOBO      0002A
     A                                      TEXT('Mobiloperatør')
     A                                      COLHDG('Mobiloperatør')
     A            RKBGIR      0011S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bankgiro')
     A                                      COLHDG('Bankgiro')
6.NU A            RKFAKU      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Faktura kundenr.')
     A                                      COLHDG('Faktura' 'kunde')
     A            RKFACN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Factoring-nummer')
     A                                      COLHDG('Fact' 'nummer')
     A            RKKOKU      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Konsern kundenr.')
     A                                      COLHDG('Konsrn' 'kunde')
     A            RKEDIK      0001A
     A                                      VALUES(' ' 'A' 'E')
     A                                      CHKMSGID(RMK0310 *LIBL/QMFOKON)
     A                                      TEXT('EDI-Kode')
     A                                      COLHDG('EDI' 'Kod')
     A            RKEANK      0013S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('EAN-Kunde')
     A                                      COLHDG('EAN-Kunde')
     A            RKEANF      0013S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('EAN-fakt.kunde')
     A                                      COLHDG('EAN-faktkunde')
     A            RKAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd')
     A            RKKJØR      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kjørerute')
     A                                      COLHDG('Rute')
     A            RKKJNR      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rekkefølge innen rute')
     A                                      COLHDG('Rute' ' nr.')
     A            RKKATG      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kundekategori')
     A                                      COLHDG('Kat')
     A            RKRABK      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rabatt-kategori')
     A                                      COLHDG('Rab' 'kat')
     A            RKLAGR      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Lager')
     A                                      COLHDG('Lag')
     A            RKSLGR      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Selger')
     A                                      COLHDG('Slgr')
     A            RKDIST      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Distrikt')
     A                                      COLHDG('Dst')
     A            RKBETB      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Betalingsbetingelse')
     A                                      COLHDG('Bet' 'bet')
     A            RKBETM      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Betalingsmåte')
     A                                      COLHDG('Bet' 'måt')
     A            RKSALD      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Saldo')
     A                                      COLHDG('Saldo')
     A            RKSAIF      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Saldo i fjor')
     A                                      COLHDG('Saldo i fjor')
     A            RKKJØP      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Kjøp i år')
     A                                      COLHDG('Kjøp i år')
     A            RKKJØF      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Kjøp i fjor')
     A                                      COLHDG('Kjøp i fjor')
T5.50A            RKKJAL      0011S 2
T5.50A                                      EDTCDE(K)
T5.50A                                      TEXT('Kjøp i år alm.')
T5.50A                                      COLHDG('Kjøp i år alm.')
T5.50A            RKGRAL      0009S 0
T5.50A                                      TEXT('Beløpgrense alm.')
T5.50A                                      COLHDG('Beløpgrense alm.')
     A            RKKTID      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kredittid')
     A                                      COLHDG('Kred' 'tid')
     A            RKTDAT          L
     A                                      TEXT('Siste trans-dato')
     A                                      COLHDG('S.trn' ' dato')
     A            RKVALK      0003A
     A                                      TEXT('Valutakode')
     A                                      COLHDG('Val' 'kod')
     A            RKSPRK      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMK0060 *LIBL/QMFOKON)
     A                                      TEXT('Sperrekode')
     A                                      COLHDG('Sp' 'kd')
     A            RKMKOD      0001S 0
     A                                      EDTCDE(Z)
6.38 A                                      VALUES(0 1 2)
     A                                      CHKMSGID(RMK0070 *LIBL/QMFOKON)
     A                                      TEXT('MVA-beregning')
     A                                      COLHDG('MVA' 'kod')
6.38  * 0 = vanlig avgiftspliktig
6.38  * 1 = avgiftfri
6.38  * 2 = utenlandsk kunde, eksport
     A            RKLADR      0001S 0
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0080 *LIBL/QMFOKON)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leveringsadresse')
     A                                      COLHDG('Lev' 'adr')
     A            RKLBET      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Leveringsbetingelse')
     A                                      COLHDG('Lev' 'bet')
     A            RKFORM      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Forsendelsesmåte')
     A                                      COLHDG('Fors' 'måte')
     A            RKSPED      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Speditørnummer')
     A                                      COLHDG('Sped' 'nr')
     A            RKORAB      0005S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Ordrerabatt')
     A                                      COLHDG('Ordr' 'rab.')
     A            RKGRNS      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kreditgrense')
     A                                      COLHDG('Kredit' 'grense')
     A            RKKGRK      0001A
     A                                      TEXT('Kreditgr.kode')
     A                                      COLHDG('Kr.gr.' 'kode')
     A            RKFRIE      0005A
     A                                      TEXT('Frie koder')
     A                                      COLHDG('Frie' 'koder')
     A            RKRENK      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2 3)
     A                                      CHKMSGID(RMK0050 *LIBL/QMFOKON)
     A                                      TEXT('Rentekode')
     A                                      COLHDG('Rk')
     A            RKRNEG      0001A
     A                                      TEXT('Rentenota negativ')
     A                                      COLHDG('Rente' 'neg.')
     A            RKRDAT          L
     A                                      TEXT('Siste rente-dato')
     A                                      COLHDG('S.rnt' 'dato')
     A            RKPURR      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0150 *LIBL/QMFOKON)
     A                                      TEXT('Purrekode')
     A                                      COLHDG('Pk')
     A            RKPDAT          L
     A                                      TEXT('Siste purre-dato')
     A                                      COLHDG('S.pur' 'dato')
     A            RKPNEG      0001A
     A                                      TEXT('Purring negativ')
     A                                      COLHDG('Purr.' 'neg.')
     A            RKINKK      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMK0320 *LIBL/QMFOKON)
     A                                      TEXT('Inkassokode')
     A                                      COLHDG('Ik' 'kd')
     A            RKIDAT          L
     A                                      TEXT('Siste inkasso-dato')
     A                                      COLHDG('S.ik' 'dato')
     A            RKFACK      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0150 *LIBL/QMFOKON)
     A                                      TEXT('Factoringkode')
     A                                      COLHDG('Fa' 'kd')
     A            RKSAMM      0001A
     A                                      TEXT('Samlefakturamerke')
     A                                      COLHDG('Sm')
     A            RKORDB      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0100 *LIBL/QMFOKON)
     A                                      TEXT('Ordrebekreftelse')
     A                                      COLHDG('Ob')
     A            RKKRES      0001S 0
     A                                      EDTCDE(Z)
6.26 A                                      VALUES(0 1 2 3)
     A                                      CHKMSGID(RMK0140 *LIBL/QMFOKON)
     A                                      TEXT('Kredittsperre')
     A                                      COLHDG('Ks')
     A            RKSPAV      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Spesialavtale')
     A                                      COLHDG('Sp' 'av')
     A            RKPRPA      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0170 *LIBL/QMFOKON)
     A                                      TEXT('Pris/Pakkseddel')
     A                                      COLHDG('Pr' 'pa')
     A            RKNETO      0001S 0
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0171 *LIBL/QMFOKON)
     A                                      TEXT('Pris på faktura')
     A                                      COLHDG('Pris' 'fakt')
     A            RKSAMF      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2 3 4)
     A                                      CHKMSGID(RMK0190 *LIBL/QMFOKON)
     A                                      TEXT('Samlefaktura')
     A                                      COLHDG('Sa' 'fa')
     A            RKREKV      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0172 *LIBL/QMFOKON)
     A                                      TEXT('Krav til rekvisisjon')
     A                                      COLHDG('Kr' 're')
     A            RKFAGB      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0200 *LIBL/QMFOKON)
     A                                      TEXT('Fakturagebyr')
     A                                      COLHDG('Fa' 'ge')
     A            RKEKGB      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0210 *LIBL/QMFOKON)
     A                                      TEXT('Ekspedisjonsgebyr')
     A                                      COLHDG('Ek' 'gb')
     A            RKFRGB      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0220 *LIBL/QMFOKON)
     A                                      TEXT('Fraktgebyr')
     A                                      COLHDG('Fr' 'gb')
     A            RKRASP      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0230 *LIBL/QMFOKON)
     A                                      TEXT('Rabatt-sperre')
     A                                      COLHDG('Ra' 'sp')
     A            RKFRSK      0010A
     A                                      TEXT('Frie statistikk-kode')
     A                                      COLHDG('Frie statk')
     A            RKPBOK      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0173 *LIBL/QMFOKON)
     A                                      TEXT('Fakt. etter prisbok')
     A                                      COLHDG('Fa' 'pb')
     A            RKPTAB      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Påslagstabell')
     A                                      COLHDG('Pås' 'tab')
     A            RKPTA2      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Påslagstab 2 ')
     A                                      COLHDG('Pås' 'tab2')
     A            RKSPFA      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(RMK0090 *LIBL/QMFOKON)
     A                                      TEXT('Spesifiser faktureri')
     A                                      COLHDG('Sp' 'fa')
     A            RKSPL1      0001A
     A                                      VALUES(' ' 'X')
     A                                      CHKMSGID(RMK0250 *LIBL/QMFOKON)
     A                                      TEXT('Spesifiser lønn 1')
     A                                      COLHDG('Sp' 'l1')
     A            RKSPL2      0001A
     A                                      TEXT('Spesifiser lønn 2')
     A                                      COLHDG('Sp' 'l2')
     A            RKSPL3      0001A
     A                                      TEXT('Spesifiser lønn 3')
     A                                      COLHDG('Sp' 'l3')
     A            RKSPL4      0001A
     A                                      TEXT('Spesifiser lønn 4')
     A                                      COLHDG('Sp' 'l4')
     A            RKSPL5      0001A
     A                                      TEXT('Spesifiser lønn 5')
     A                                      COLHDG('Sp' 'l5')
     A            RKSEKV      0002S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(00 01 07 14 30)
     A                                      CHKMSGID(RMK0260 *LIBL/QMFOKON)
     A                                      TEXT('Fakturasekvens')
     A                                      COLHDG('Fa' 'se')
     A            RKFAGR      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Fakturagrense')
     A                                      COLHDG('Fakt' 'grns')
     A            RKAFDA          L
     A                                      TEXT('Gyldig dato-fra AG')
     A                                      COLHDG('Dato-til')
     A            RKATDA          L
     A                                      TEXT('Gyldig dato-til AG')
     A                                      COLHDG('Dato-til')
     A            RKSENT      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0300 *LIBL/QMFOKON)
     A                                      TEXT('Fullm. sendt AG')
     A                                      COLHDG('Snt')
     A            RKTILB      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Tilbudsnummer')
     A                                      COLHDG('Tilb.nr.')
     A            RKOCOP      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Ordre - ant.kopi')
     A                                      COLHDG('Or' 'ak')
     A            RKPCOP      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Pakk. - ant.kopi')
     A                                      COLHDG('Pk' 'ak')
     A            RKFCOP      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Fakt. - ant.kopi')
     A                                      COLHDG('Fa' 'ak')
     A            RKPASS      0001A
     A                                      TEXT('Passiv kunde')
     A                                      COLHDG('Passiv' 'kunde')
     A            RKEBIZ      0001S 0
     A                                      TEXT('E_handels kunde')
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RMK0174 *LIBL/QMFOKON)
     A                                      COLHDG('E-handels' 'kunde')
     A                                      EDTCDE(Z)
     A            RKLETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
     A            RKFATY      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Fakturatype')
     A                                      COLHDG('Fakt' 'type')
6.30 A            RKKOTI      0001S 0
6.30 A                                      TEXT('Kontant kunde tilbud')
6.30 A                                      VALUES(0 1)
6.30 A                                      COLHDG('Kont.kund' 'tilbud')
6.30 A                                      EDTCDE(Z)
     A            RKNDAT          L
     A                                      TEXT('Ny   Dato')
     A                                      COLHDG('Ny  Dato')
     A            RKNTIM          T
     A                                      TEXT('Ny   Kl.')
     A                                      COLHDG('Ny  Kl.')
     A            RKNSIG      0010A
     A                                      TEXT('Ny   av   (User-ID).')
     A                                      COLHDG('Ny  Bruker')
     A            RKEDAT          L
     A                                      TEXT('Endr.dato')
     A                                      COLHDG('Endr.dto')
     A            RKETIM          T
     A                                      TEXT('Endr.tid')
     A                                      COLHDG('Endr.Kl')
     A            RKESIG      0010A
     A                                      TEXT('Endret av (User-ID).')
     A                                      COLHDG('Endret av')
6.17 A            RKEPGM      0010A
6.17 A                                      TEXT('Endret av program')
6.17 A                                      COLHDG('Endr pgm')
6.17  *
6.17 A            RK2DPT          Z
6.17 A                                      TEXT('Siste endring 2dp')
6.17 A                                      COLHDG('Repl' '2DP')
6.30  *
6.30  *  KUNDE  sideregister      RKU2PF    (RK)
6.30  *  Sydd RKKOTI inn i RKUNPF  (130115 BOF)
6.28  *
6.28  *  KUNDE-MEMOSALDO          RKMEPF    (RKM)
6.28  *
6.28 A            RKMFIR      0003S 0
6.28 A                                      TEXT('Firma')
6.28 A                                      COLHDG('Firma')
6.28 A            RKMKUN      0006S 0
6.28 A                                      EDTCDE(Z)
6.28 A                                      TEXT('Kundenummer')
6.28 A                                      COLHDG('Kunde')
7.NX A            RKPRKR      0001S 0
7.NX A                                      TEXT('Krav om kundeprosjekt')
7.NX A                                      VALUES(0 1)
7.NX A                                      COLHDG('Krav' 'Kundeprosjekt')
7.NX A                                      EDTCDE(Z)
7.NX A            RK2FIR      0003S 0
7.NX A                                      TEXT('Firma')
7.NX A                                      COLHDG('Firma')
7.nx A            RK2KUN      0006S 0
7.nx A                                      EDTCDE(Z)
7.nx A                                      TEXT('Kundenummer')
7.nx A                                      COLHDG('Kunde')
7.nx A            RK2UOG        20A
7.nx A                                      TEXT('Organisasjonsnr utland')
7.nx A                                      COLHDG('Org.nr utland')
8.nx A            RK2DAT          L
8.nx A                                      TEXT('Oppr.dato')
8.01 A                                      COLHDG('Oppr.dto')
8.01 A            RK2TIM          T
8.01 A                                      TEXT('Oppr.tid')
8.01 A                                      COLHDG('Oppr.Kl')
8.01 A            RK2SIG      0010A
8.01 A                                      TEXT('Opprettet av (User-ID).')
8.01 A                                      COLHDG('Oppr. av')
8.01 A            RK2EDA          L
8.01 A                                      TEXT('Endr.dato')
8.01 A                                      COLHDG('Endr.dto')
8.01 A            RK2ETI          T
8.01 A                                      TEXT('Endr.tid')
8.01 A                                      COLHDG('Endr.Kl')
8.01 A            RK2EUS      0010A
8.01 A                                      TEXT('Endret av (User-ID).')
8.01 A                                      COLHDG('Endret av')
8.03 A            RK2RGB         1S 0
8.03 A                                      EDTCDE(Z)
8.03 A                                      VALUES(0 1)
8.03 A                                      CHKMSGID(FMY0100 *LIBL/QMFOFAK)
8.03 A                                      TEXT('Returgebyr')
8.03 A                                      COLHDG('Returgebyr')
8.04 A            RK2SOB         1S 0
8.04 A                                      EDTCDE(Z)
8.04 A                                      VALUES(0 1)
8.04 A                                      CHKMSGID(FMY0100 *LIBL/QMFOFAK)
8.04 A                                      TEXT('Spes pris overst beste')
8.04 A                                      COLHDG('Bruk spesialpris')
6.28 A            RKMEMS      0011S 2
6.28 A                                      EDTCDE(K)
6.28 A                                      TEXT('Memosaldo')
6.28 A                                      COLHDG('Memosaldo')
6.28 A            RKMEMA      0011S 2
6.28 A                                      EDTCDE(K)
6.28 A                                      TEXT('Memosaldo alm.')
6.28 A                                      COLHDG('Memosaldo alm.')
6.28 A            RKMEDA          L
6.28 A                                      TEXT('Endr.dato')
6.28 A                                      COLHDG('Endr.dto')
6.28 A            RKMETI          T
6.28 A                                      TEXT('Endr.tid')
6.28 A                                      COLHDG('Endr.Kl')
6.28 A            RKMEUS      0010A
6.28 A                                      TEXT('Endret av (User-ID).')
6.28 A                                      COLHDG('Endret av')
6.28 A            RKMODA          L
6.28 A                                      TEXT('Endr.dato')
6.28 A                                      COLHDG('Endr.dto')
6.28 A            RKMOTI          T
6.28 A                                      TEXT('Endr.tid')
6.28 A                                      COLHDG('Endr.Kl')
      *
      *  KUNDE-SØKETEKST          RKSOPF    (RK)
      *
     A            RKSFIR      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            RKSKUN      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kundenummer')
     A                                      COLHDG('Kunde')
     A            RKSTEK      0150A
     A                                      TEXT('Søketekst')
     A                                      COLHDG('Søketekst')
      *
      *   KUNDE POSTERINGER       RKTRPF    (RN)
      *
     A            RNFIRM      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            RNKUND      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kunde-nr.')
     A                                      COLHDG('Kunde')
     A            RNRAAR      0004S 0
     A                                      TEXT('Regnskapsår')
     A                                      COLHDG('År')
     A            RNRPER      0002S 0
     A                                      TEXT('Periode')
     A                                      COLHDG('Per')
     A            RNBDAT          L
     A                                      TEXT('Bilags-dato')
     A                                      COLHDG('Bil.' ' dato')
6.NU A            RNBILN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagsnummer')
     A                                      COLHDG('Bilag')
     A            RNBILK      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilags-kode')
     A                                      COLHDG('Bk')
     A            RNTEXT      0020A
     A                                      TEXT('Bilagstekst')
     A                                      COLHDG('Bilagstekst')
     A            RNBELØ      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Beløp')
     A                                      COLHDG('Beløp')
     A            RNREST      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Restbeløp')
     A                                      COLHDG('Restbeløp')
     A            RNVALK      0003A
     A                                      TEXT('Valuta-kode')
     A                                      COLHDG('Val' 'kod')
     A            RNVALB      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Valutabeløp')
     A                                      COLHDG('Valutabeløp')
     A            RNVALR      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Valuta-rest')
     A                                      COLHDG('Valuta-rest')
     A            RNFDAT          L
     A                                      TEXT('Forfalls-dato')
     A                                      COLHDG('For.' 'dato')
     A            RNJOUR      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Journalliste-nr.')
     A                                      COLHDG('Journ' ' nr.')
6.NU A            RNSAMF      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Samlefaktura-nr.')
     A                                      COLHDG('S.fakt.' ' nr.')
     A            RNSTAT      0001A
     A                                      TEXT('Status')
     A                                      COLHDG('St')
6.NU A            RNREFN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Referansenummer')
     A                                      COLHDG('Refnr.')
     A            RNVIRK      0002A
     A                                      TEXT('Virksomhetskode')
     A                                      COLHDG('Vir' 'kod')
     A            RNAVDE      0004S 0
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd')
T5.40A            RNKONT      0004S 0
     A                                      TEXT('Konto')
     A                                      COLHDG('Konto')
T5.40A            RNSPES      0004S 0
     A                                      TEXT('Bærer')
     A                                      COLHDG('Bærer')
     A            RNSLGR      0004S 0
     A                                      TEXT('Selger')
     A                                      COLHDG('Slgr')
     A            RNREKL      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMK0350 *LIBL/QMFOKON)
     A                                      TEXT('Reklamasjonskode')
     A                                      COLHDG('Rk.' 'kd')
     A            RNRENK      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 3 5)
     A                                      CHKMSGID(RMK0330 *LIBL/QMFOKON)
     A                                      TEXT('Renteberegnet')
     A                                      COLHDG('Rt')
     A            RNRDAT          L
     A                                      TEXT('Siste rente-dato')
     A                                      COLHDG('S.rnt' 'dato')
     A            RNANTP      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Antall purringer')
     A                                      COLHDG('An' 'pu')
     A            RNPDAT          L
     A                                      TEXT('Siste purre-dato')
     A                                      COLHDG('S.pur' 'dato')
     A            RNINKO      0001A
     A                                      VALUES(' ' 'B' 'J')
     A                                      CHKMSGID(RMK0340 *LIBL/QMFOKON)
     A                                      TEXT('Inkassokode')
     A                                      COLHDG('In' 'kd')
     A            RNIDAT          L
     A                                      TEXT('Inkassodato')
     A                                      COLHDG('I.da' 'dato')
     A            RNODAT          L
     A                                      TEXT('Oppgjørsdato')
     A                                      COLHDG('O.da' 'dato')
     A            RNAUTO      0001A
     A                                      TEXT('Autogiro kode')
     A                                      COLHDG('Autog' 'Kode')
     A            RNADAT          L
     A                                      TEXT('Autogiro dato')
     A                                      COLHDG('Autog' 'dato')
     A            RNFACK      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      TEXT('Ikke factoring')
     A                                      COLHDG('Fact')
     A            RNFADA          L
     A                                      TEXT('Overført dato')
     A                                      COLHDG('Fact' 'dato')
     A            RNTIST          Z
     A                                      TEXT('Post. timestamp')
     A                                      COLHDG('Post' 't-stamp')
T5.50A            RNKIDI      0025A
T5.50A                                      COLHDG('Kundeident')
T5.50 *
6.35 A            RNKIDR      0008S 0       TEXT('Kidd referansenr')
T5.50A                                      COLHDG('Kidd' 'Ref')
T5.50A                                      EDTCDE(Z)
T5.50 *
T5.50A            RNKSIF      0001S 0       TEXT('Kontroll-siffer')
T5.50A                                      COLHDG('Kont' 'Siff')
T5.50A                                      EDTCDE(Z)
T5.50 *
T5.50A            RNKID2      0025A         TEXT('Kiddnummer 2')
T5.50A                                      COLHDG('Kidd-2')
6.12 A            RNSPOR      0010S 0
6.12 A                                      TEXT('Spor.ref.')
6.12 A                                      COLHDG('Spor.ref.')
6.12 A            RNAVKR      0010S 0
6.12 A                                      TEXT('Avkr.ref.')
6.12 A                                      COLHDG('Avkr.ref.')
6.10 A            RNDATE    R               REFFLD(RÅODAT)
6.10 A            RNOTIM    R               REFFLD(RÅOTIM)
6.10 A            RNOUSR    R               REFFLD(RÅOUSR)
6.10 A            RNEDAT    R               REFFLD(RÅEDAT)
6.10 A            RNETIM    R               REFFLD(RÅETIM)
6.10 A            RNEUSR    R               REFFLD(RÅEUSR)
      *
      *
      *  KUNDE SPESIALAVTALE      RKSAPF    (RK)
      *
     A            RKSAFI      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            RKSAKU      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kundenummer')
     A                                      COLHDG('Kunde')
     A            RKSAT1      0030A
     A                                      TEXT('Tekst 1')
     A                                      COLHDG('Tekst 1')
     A            RKSAT2      0030A
     A                                      TEXT('Tekst 2')
     A                                      COLHDG('Tekst 2')
     A            RKSAT3      0030A
     A                                      TEXT('Tekst 3')
     A                                      COLHDG('Tekst 3')
6.10 A            RKODAT    R               REFFLD(RÅODAT)
6.10 A            RKOTIM    R               REFFLD(RÅOTIM)
6.10 A            RKOUSR    R               REFFLD(RÅOUSR)
6.10 A            RKENDA    R               REFFLD(RÅEDAT)
6.10 A            RKENTI    R               REFFLD(RÅETIM)
6.10 A            RKEUSR    R               REFFLD(RÅEUSR)
      *
      * FACTORING Kundefil        REKUPF    (RE)
      *
     A            REFIRM    R               REFFLD(RKFIRM)
     A            REKUND    R               REFFLD(RKKUND)
     A            REFTNR    R               REFFLD(RKFTNR)
     A            REFACN    R               REFFLD(RKFACN)
     A            RENAVN    R               REFFLD(RKNAVN)
     A            REGATE    R               REFFLD(RKGATE)
     A            READR2    R               REFFLD(RKADR2)
     A            REPONR    R               REFFLD(RKPONR)
     A            RESTED    R               REFFLD(RKSTED)
     A            REPERS    R               REFFLD(RKPERS)
     A            RETLFN    R               REFFLD(RKTLFN)
     A            REEMAL    R               REFFLD(RKEMAL)
     A            RELAND    R               REFFLD(RKLAND)
     A            RELTXT    R               REFFLD(RALTXT)
     A            REBGIR    R               REFFLD(RKBGIR)
     A            REDIST    R               REFFLD(RKDIST)
      *
      * Nordea/Entra Kundefil     REK2PF    (RE)
      *
     A            REKREC       256A         TEXT('Alfa 256')
     A                                      COLHDG('Alfa' '256')
      *
      * FACTORING  Fakturafil     REFAPF    (RE)
      *
     A            REFIR2    R               REFFLD(RNFIRM)
     A            REKUN2    R               REFFLD(RNKUND)
     A            REBILN    R               REFFLD(RNBILN)
     A            REBIDA    R               REFFLD(RNBDAT)
     A            REFDAT    R               REFFLD(RNFDAT)
     A            REBELØ    R               REFFLD(RNBELØ)
     A            REFTXT    R               REFFLD(RNTEXT)
     A            RESLGR    R               REFFLD(RNSLGR)
     A            REVALK    R               REFFLD(RNVALK)
     A            REVALB    R               REFFLD(RNVALB)
      *
      * Nordea/Entra Fakturafil   REF2PF    (RE)
      *
     A            REFREC        80A         TEXT('Alfa 80')
     A                                      COLHDG('Alfa' '80')
      *
      *  LEVERANDØR register      RLEVPF    (RL)
      *
     A            RLFIRM      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            RLLEVR      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLHDG('Lever.')
     A            RLNAVN      0030A
     A                                      COMP(NE ' ')
     A                                      CHKMSGID(RML0230 *LIBL/QMFOKON)
     A                                      TEXT('Navn')
     A                                      COLHDG('Navn')
     A            RLALFA      0018A
     A                                      TEXT('Alfafelt')
     A                                      COLHDG('Alfafelt')
     A            RLGATE      0030A
     A                                      TEXT('Gateadresse')
     A                                      COLHDG('Gateadresse')
     A            RLADR2      0030A
     A                                      TEXT('Mellomadresse')
     A                                      COLHDG('Mellomadresse')
     A            RLPONR      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Postnr.')
     A                                      COLHDG('Postnr')
     A            RLSTED      0030A
     A                                      TEXT('Poststed')
     A                                      COLHDG('Poststed')
     A            RLBGAT      0030A
     A                                      TEXT('Besøksgate')
     A                                      COLHDG('Besøksgate')
     A            RLBADR      0030A
     A                                      TEXT('Besøksadresse')
     A                                      COLHDG('Besøksadresse')
     A            RLBPNR      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Besøkspostnr.')
     A                                      COLHDG('Besøkspostnr.')
     A            RLKOMN      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kommunenr.')
     A                                      COLHDG('Komm')
     A            RLLAND      0002A
     A                                      TEXT('Landkode')
     A                                      COLHDG('Land')
     A            RLFTNR      0009S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Foretaksnummer')
     A                                      COLHDG('Foretaksnummer')
     A            RLPERS      0030A
     A                                      TEXT('Kontaktperson')
     A                                      COLHDG('Kontaktperson')
     A            RLEMAL      0050A
     A                                      TEXT('E-mail adresse')
     A                                      COLHDG('E-mail adresse')
     A            RLWEBA      0040A
     A                                      TEXT('Web adresse')
     A                                      COLHDG('Web adresse')
     A            RLTLFN      0011A
     A                                      TEXT('Telefonnummer')
     A                                      COLHDG('Telefon')
     A            RLTLFX      0011A
     A                                      TEXT('Telefaxsnummer')
     A                                      COLHDG('Telefaks')
     A            RLMOBN      0011A
     A                                      TEXT('Mobil-nr.')
     A                                      COLHDG('Mobil-nr.')
     A            RLBGIR      0011S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bankgiro')
     A                                      COLHDG('Bankgiro')
     A            RLFLEV      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Fakturaleverandør')
     A                                      COLHDG('Fakt.' 'lev.')
     A            RLFACN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Factoring-nummer')
     A                                      COLHDG('Factoring' 'nummer')
     A            RLFACT      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Factoring L.nr.')
     A                                      COLHDG('Factor' 'L.nr.')
     A            RLNOBB      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('NOBB-nummer')
     A                                      COLHDG('NOBB' 'nummer')
     A            RLEDIK      0001A
     A                                      VALUES(' ' 'A' 'E' 'T')
     A                                      CHKMSGID(RML0190 *LIBL/QMFOKON)
     A                                      TEXT('EDI-kode')
     A                                      COLHDG('EDI' 'kod')
     A            RLEANL      0013S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('EAN-leverandør')
     A                                      COLHDG('EAN-leverand.')
     A            RLDIST      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Distrikt')
     A                                      COLHDG('Dis')
     A            RLAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd')
     A            RLLAGR      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Lager')
     A                                      COLHDG('Lag')
     A            RLKATG      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørkategori')
     A                                      COLHDG('Lev' 'kat')
     A            RLRABK      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rabatt-kategori')
     A                                      COLHDG('Rab' 'kat')
     A            RLBETB      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Betalingsbetingelse')
     A                                      COLHDG('Bet' 'bet')
     A            RLBETM      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Betalingsmåte')
     A                                      COLHDG('Bet' 'måt')
E5.30A            RLSAKS      0004S 0
T5.30A                                      EDTCDE(Z)
     A                                      TEXT('Saksbehandler')
     A                                      COLHDG('Sak' 'beh')
     A            RLISOK      0001A
     A                                      TEXT('ISO-kode')
     A                                      COLHDG('ISO' 'kod')
     A            RLSALD      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Saldo')
     A                                      COLHDG('Saldo')
     A            RLSAIF      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Saldo i fjor')
     A                                      COLHDG('Saldo i fjor')
     A            RLKJØP      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Kjøp i år')
     A                                      COLHDG('Kjøp i år')
     A            RLKJØF      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Kjøp i fjor')
     A                                      COLHDG('Kjøp i fjor')
     A            RLKTID      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kredittid')
     A                                      COLHDG('Kred' 'tid')
     A            RLTDAT          L
     A                                      TEXT('Siste trans-dato')
     A                                      COLHDG('S.tra' 'dato')
     A            RLVALK      0003A
     A                                      TEXT('Valutakode')
     A                                      COLHDG('Val' 'kod')
     A            RLSPRK      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RML0050 *LIBL/QMFOKON)
     A                                      TEXT('Sperrekode')
     A                                      COLHDG('Sp' 'kd')
     A            RLMKOD      0001S 0
6.38 A                                      VALUES(0 1 2)
     A                                      CHKMSGID(RML0060 *LIBL/QMFOKON)
     A                                      EDTCDE(Z)
     A                                      TEXT('Avgiftpliktig')
     A                                      COLHDG('Av' 'pl')
     A            RLFORM      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Forsendelsesmåte')
     A                                      COLHDG('For' 'måt')
     A            RLFRIE      0005A
     A                                      TEXT('Frie koder')
     A                                      COLHDG('Frie' 'koder')
     A            RLBONU      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RML0070 *LIBL/QMFOKON)
     A                                      TEXT('Bonuskode')
     A                                      COLHDG('Bo' 'kd')
     A            RLPURR      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RML0080 *LIBL/QMFOKON)
     A                                      TEXT('Purrekode')
     A                                      COLHDG('Pu' 'kd')
     A            RLLBET      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Leveringsbetingelse  ')
     A                                      COLHDG('Lev' 'bet')
     A            RLSPES      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RML0090 *LIBL/QMFOKON)
     A                                      TEXT('Spesialavtale')
     A                                      COLHDG('Sp' 'av')
     A            RLPRIO      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RML0100 *LIBL/QMFOKON)
     A                                      TEXT('Prioritetskode')
     A                                      COLHDG('Pr' 'kd')
     A            RLAVTS      0030A
     A                                      TEXT('Avtalespesifikasjon  ')
     A                                      COLHDG('Avtalespesifikasjon')
     A            RLREST      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RML0110 *LIBL/QMFOKON)
     A                                      TEXT('Restordre')
     A                                      COLHDG('Re' 'or')
     A            RLPAKK      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RML0120 *LIBL/QMFOKON)
     A                                      TEXT('Pakkseddel')
     A                                      COLHDG('Pk' 'se')
     A            RLORSK      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RML0130 *LIBL/QMFOKON)
     A                                      TEXT('Ordrebekreftelse')
     A                                      COLHDG('Or' 'bk')
     A            RLKVRA      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kvantumsrabatt-kate  g')
     A                                      COLHDG('Kva' 'kat')
     A            RLORAB      0005S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Ordrerabatt')
     A                                      COLHDG('Ordr' 'rabat')
     A            RLSTKO      0010A
     A                                      TEXT('Frie statistikk-koder ')
     A                                      COLHDG('Frie koder')
     A            RLKPRI      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RML0140 *LIBL/QMFOKON)
     A                                      TEXT('Kostpriskontering')
     A                                      COLHDG('Kp' 'ko')
     A            RLPPRO      0005S 4
     A                                      EDTCDE(K)
     A                                      TEXT('Påslagsprosent')
     A                                      COLHDG('Påslg' 'pros')
     A            RLREMK      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RML0150 *LIBL/QMFOKON)
     A                                      TEXT('Remitteringskode')
     A                                      COLHDG('Re' 'kd')
     A            RLSLET      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RML0160 *LIBL/QMFOKON)
     A                                      TEXT('Slettekode')
     A                                      COLHDG('Sl' 'kd')
     A            RLHYLE      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Type hylle-etikett'  )
     A                                      COLHDG('Ty' 'et')
     A            RLLVKO      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Skrive i div. felt'  )
     A                                      COLHDG('Sk' 'di')
     A            RLKUNR      0015A
     A                                      TEXT('Vårt kundenr')
     A                                      COLHDG('Vårt' 'kundenr')
     A            RLPASS      0001A
     A                                      TEXT('Passiv lever')
     A                                      COLHDG('Passiv' 'lever')
     A            RLEANB      0013S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('EAN-Bestillingsmottaker')
     A                                      COLHDG('EAN-Best.  mottaker')
     A            RLNDAT          L
     A                                      TEXT('Ny   Dato')
     A                                      COLHDG('Ny  Dato')
     A            RLNTIM          T
     A                                      TEXT('Ny   Kl.')
     A                                      COLHDG('Ny  Kl.')
     A            RLNSIG      0010A
     A                                      TEXT('Ny   av  ')
     A                                      COLHDG('Ny  Bruker')
     A            RLEDAT          L
     A                                      TEXT('Endr.dato')
     A                                      COLHDG('Endr.dato')
     A            RLETIM          T
     A                                      TEXT('Endr.tid')
     A                                      COLHDG('Endr.tid')
     A            RLESIG      0010A
     A                                      TEXT('Endret av')
     A                                      COLHDG('Endret av')
6.17 A            RLEPGM      0010A
6.17 A                                      TEXT('Endret av program')
6.17 A                                      COLHDG('Endr pgm')
6.17  *
6.17 A            RL2DPT          Z
6.17 A                                      TEXT('Siste endring 2dp')
6.17 A                                      COLHDG('Repl' '2DP')
      *
      *  LEVERANDØRBANK UTLAND    RLBAPF    (RV)
      *
     A            RVFIRM      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            RVLEVR      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnr.')
     A                                      COLHDG('Lever.')
     A            RVHSWA      0011A
     A                                      TEXT('Bank(SWIFT/BIC)')
     A                                      COLHDG('Bank(SWIFT/BIC)')
7.01 A            RVHSLK    R               REFFLD(RLLAND)
7.01 A                                      TEXT('Landkode')
7.01 A                                      COLHDG('Land' 'Kode')
     A            RVHBA1      0035A
     A                                      TEXT('Bankadresse-1')
     A                                      COLHDG('Bankadresse-1')
     A            RVHBA2      0035A
     A                                      TEXT('Bankadresse-2')
     A                                      COLHDG('Bankadresse-2')
     A            RVHBA3      0035A
     A                                      TEXT('Bankadresse-3')
     A                                      COLHDG('Bankadresse-3')
     A            RVHBA4      0035A
     A                                      TEXT('Bankadresse-4')
     A                                      COLHDG('Bankadresse-4')
     A            RVHBKO      0035A
     A                                      TEXT('Kontonr./IBAN')
     A                                      COLHDG('Kontonr./IBAN')
     A            RVHBKU      0001A
     A                                      VALUES('B' 'O')
     A                                      TEXT('Omkostninger i utl.')
     A                                      COLHDG('Omk.' 'utl.')
     A            RVHBKI      0001A
     A                                      VALUES('B' 'O')
     A                                      TEXT('Omkostninger i No.')
     A                                      COLHDG('Om' 'NO')
     A            RVHBVK      0001A
     A                                      TEXT('Belaste valuta(J/N)')
     A                                      COLHDG('Be' 'va')
6.10 A            RVODAT    R               REFFLD(RÅODAT)
6.10 A            RVOTIM    R               REFFLD(RÅOTIM)
6.10 A            RVOUSR    R               REFFLD(RÅOUSR)
6.10 A            RVEDAT    R               REFFLD(RÅEDAT)
6.10 A            RVETIM    R               REFFLD(RÅETIM)
6.10 A            RVEUSR    R               REFFLD(RÅEUSR)
      *
      *  LEVERANDØR-SØKETEKST     RLSOPF    (RL)
      *
     A            RLSFIR      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            RLSLEV      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Lev. nummer')
     A                                      COLHDG('Lever')
     A            RLSTEK      0150A
     A                                      TEXT('Søketekst')
     A                                      COLHDG('Søketekst')
      *
      *   LEVERANDØR POSTERINGER  RLTRPF    (RO)
      *
     A            ROFIRM      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            ROLEVR      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandør-nr.')
     A                                      COLHDG('Lever.')
     A            RORAAR      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Regnskapsår')
     A                                      COLHDG('År')
     A            RORPER      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Periode')
     A                                      COLHDG('Per.')
     A            ROBDAT          L
     A                                      TEXT('Bilags-dato')
     A                                      COLHDG('Bil' 'dato')
6.NU A            ROBILN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagsnummer')
     A                                      COLHDG('Bil.nr')
     A            ROBILK      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilags-kode')
     A                                      COLHDG('Bk')
     A            ROTEXT      0020A
     A                                      TEXT('Bilagstekst')
     A                                      COLHDG('Bilagstekst')
     A            ROBELØ      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Beløp')
     A                                      COLHDG('Beløp')
     A            ROREST      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Restbeløp')
     A                                      COLHDG('Restbeløp')
     A            ROVALK      0003A
     A                                      TEXT('Valuta-kode')
     A                                      COLHDG('Val' 'kod')
     A            ROVALB      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Valutabeløp')
     A                                      COLHDG('Valutabeløp')
     A            ROVALR      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Valuta-rest')
     A                                      COLHDG('Valuta-rest')
     A            ROFDAT          L
     A                                      TEXT('Forfalls-dato')
     A                                      COLHDG('For' 'dato')
     A            ROJOUR      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Journalliste-nr.')
     A                                      COLHDG('Journ' ' nr.')
6.NU A            ROSAMB      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Samlebilag-nr.')
     A                                      COLHDG('S.bil.' ' nr.')
     A            ROBETK      0001A
     A                                      VALUES(' ' '1' '2')
     A                                      CHKMSGID(RML0210 *LIBL/QMFOKON)
     A                                      TEXT('Remitteringskode')
     A                                      COLHDG('Rm' 'kd')
6.NU A            ROREFN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Referansenummer')
     A                                      COLHDG('Refnr.')
     A            ROVIRK      0002A
     A                                      TEXT('Virksomhetskode')
     A                                      COLHDG('Vir' 'kod')
     A            ROATTS      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RML0200 *LIBL/QMFOKON)
     A                                      TEXT('Attestasjonskode')
     A                                      COLHDG('Att' 'kod')
T5.30A            ROATTU      0010A
     A                                      TEXT('Attestert av (User-ID).')
     A                                      COLHDG('Attestert' 'av')
T5.30A            ROADAT          L
     A                                      TEXT('Att.dato')
     A                                      COLHDG('Att.dato')
6.NU A            RORRF1      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Betalingsreferanse-1')
     A                                      COLHDG('Bet.' 'rf.1')
     A            RORRF2      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Betalingsreferanse-  2')
     A                                      COLHDG('Bet.' 'rf.2')
     A            RODECK      0006A
     A                                      TEXT('Deklarasjonskode')
     A                                      COLHDG('Dekl.' 'kode')
     A            ROBFNR      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Betalingsforslags-n  r')
     A                                      COLHDG('Bet.' 'fors')
     A            ROBFLI      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Betalingsforsl.-lin  j')
     A                                      COLHDG('Forsl' 'linje')
     A            ROKIDI      0025A
     A                                      TEXT('Kundeidentifikasjon  ')
     A                                      COLHDG('Kundeidentifikasjon')
T5.50 *
6.35 A            ROKIDR      0008S 0       TEXT('Kidd referansenr')
T5.50A                                      COLHDG('Kidd' 'Ref')
T5.50A                                      EDTCDE(Z)
T5.50 *
T5.50A            ROKSIF      0001S 0       TEXT('Kontroll-siffer')
T5.50A                                      COLHDG('Kont' 'Siff')
T5.50A                                      EDTCDE(Z)
T5.50 *
T5.50A            ROKID2      0025A         TEXT('Kiddnummer 2')
T5.50A                                      COLHDG('Kidd-2')
      *
E5.40A            ROLFAK      0015A
T5.20A                                      TEXT('Lev.fakturanr.')
T5.20A                                      COLHDG('Lev.fakt.')
     A            ROAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd.')
T5.40A            ROKONT      0004S 0
     A                                      TEXT('Konto')
     A                                      COLHDG('Konto')
T5.40A            ROSPES      0004S 0
     A                                      TEXT('Bærer')
     A                                      COLHDG('Bærer')
     A            ROREKL      0001A
     A                                      TEXT('Reklamasjonskode')
     A                                      COLHDG('Re' 'kd')
     A            RODELB      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Delbetalt')
     A                                      COLHDG('Delbetalt')
     A            ROBETB      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Betalingsbetingelse  ')
     A                                      COLHDG('Bet' 'bet')
     A            RORESN      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kontonr.(Reskontro)  ')
     A                                      COLHDG('Konto')
     A            RORESS      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Sp')
     A            RORESA      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd')
     A            RORESM      0001A
     A                                      TEXT('MVA-kode')
     A                                      COLHDG('MVA' 'kod')
     A            ROTIST          Z
     A                                      TEXT('Post-nr.')
     A                                      COLHDG('Post')
V5.40A            ROFODA          L
     A                                      TEXT('Forsl.dato')
     A                                      COLHDG('Forsl.dato')
V5.40A            ROFTIM          T
     A                                      TEXT('Forsl.tid')
     A                                      COLHDG('Forsl.tid')
V5.40A            ROFSIG      0010A
     A                                      TEXT('Forsl.bruker')
     A                                      COLHDG('Forsl.bruker')
V5.40A            RORDAT          L
     A                                      TEXT('Returdato')
     A                                      COLHDG('Returdato')
V5.40A            RORTIM          T
     A                                      TEXT('Returtid')
     A                                      COLHDG('Returtid')
V5.40A            RORSIG      0010A
     A                                      TEXT('Returbruker')
     A                                      COLHDG('Returbruker')
V5.40A            ROTKTO      0035A
     A                                      COLHDG('Overf. til konto')
6.12 A            ROSPOR      0010S 0
6.12 A                                      TEXT('Spor.ref.')
6.12 A                                      COLHDG('Spor.ref.')
6.12 A            ROAVKR      0010S 0
6.12 A                                      TEXT('Avkr.ref.')
6.12 A                                      COLHDG('Avkr.ref.')
6.2I A            ROFRDA    R               REFFLD(RÅODAT)
6.2I A                                      TEXT('Fra Dato')
6.2I A                                      COLHDG('Fra Dato')
6.2I A            ROTIDA    R               REFFLD(RÅODAT)
6.2I A                                      TEXT('Til Dato')
6.2I A                                      COLHDG('Til Dato')
6.10 A            ROODAT    R               REFFLD(RÅODAT)
6.10 A            ROOTIM    R               REFFLD(RÅOTIM)
6.10 A            ROOUSR    R               REFFLD(RÅOUSR)
6.10 A            ROEDAT    R               REFFLD(RÅEDAT)
6.10 A            ROETIM    R               REFFLD(RÅETIM)
6.10 A            ROEUSR    R               REFFLD(RÅEUSR)
      *
      *  PROSJEKT-REGISTER        RPROPF    (RP)
      *
     A            RPFIRM      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
6.22 A            RPPROS    R               REFFLD(RÅPROS)
6.22 A            RPAKTI    R               REFFLD(RÅAKTI)
     A            RPKONT      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A            RPSPES      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RPAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A            RPTXT1      0030A
     A                                      COLHDG('Prosjekt-navn')
     A            RPTXT2      0030A
     A                                      COLHDG('Prosjekt-navn2')
     A            RPKUND      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Prosjekt-kunde')
     A                                      COLHDG('P.kunde')
     A            RPSBEH      0002A
     A                                      TEXT('Saksbehandler')
     A                                      COLHDG('Sbe')
     A            RPOBUD      0011S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Opprinnlig budsjett')
     A                                      COLHDG('Budsjett')
     A            RPTBUD      0011S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Tilleggs-budsjett')
     A                                      COLHDG('B.Tillegg')
     A            RPMNGK      0002S
     A                                      TEXT('Mengdekode')
     A                                      COLHDG('Mng' 'kod')
     A            RPRAKT      0001A
     A                                      TEXT('Reg. akt.nivå')
     A                                      COLHDG('Reg' 'akn')
     A            RPPSTA      0001A
     A                                      TEXT('Prosjekt-status')
     A                                      COLHDG('Pr' 'st')
     A            RPPKAT      0006A
     A                                      TEXT('Prosjekt kategori')
     A                                      COLHDG('Prosj.' 'kateg')
     A            RPSTDA          L
     A                                      TEXT('Start dato')
     A                                      COLHDG('Start' 'dato')
     A            RPSLDA          L
     A                                      TEXT('Slutt dato')
     A                                      COLHDG('Slutt' 'dato')
     A            RPALFA      0018A
     A                                      COLHDG('Alfafelt')
     A            RPMVAK      0001A
     A                                      TEXT('MVA-kode')
     A                                      COLHDG('MVA' 'kod')
6.10 A            RPODAT    R               REFFLD(RÅODAT)
6.10 A            RPOTIM    R               REFFLD(RÅOTIM)
6.10 A            RPOUSR    R               REFFLD(RÅOUSR)
     A            RPEDAT    R               REFFLD(RÅEDAT)
     A            RPETIM    R               REFFLD(RÅETIM)
     A            RPEUSR    R               REFFLD(RÅEUSR)
      *
      *  PROSJEKTRAPPORTER        RPRHPF    (RPR)
      *
     A            RPRFIR      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            RPRRAP      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rapport-nr.')
     A                                      COLHDG('Rap')
     A            RPRTXT      0030A
     A                                      COLHDG('Rapport-txt')
     A            RPRANV      0001S 0
     A                                      EDTCDE(Z)
     A                                      VALUES(1 2 3 4 5 6 7 8 9)
     A                                      TEXT('Antall sumnivå')
     A                                      COLHDG('Su' 'ni')
     A            RPRALF      0018A
     A                                      TEXT('ALFA-søkefelt')
     A                                      COLHDG('ALFA-søkefelt')
6.10 A            RPRODA    R               REFFLD(RÅODAT)
6.10 A            RPROTI    R               REFFLD(RÅOTIM)
6.10 A            RPROUS    R               REFFLD(RÅOUSR)
     A            RPRDAT    R               REFFLD(RÅEDAT)
     A            RPRTIM    R               REFFLD(RÅETIM)
     A            RPRUSR    R               REFFLD(RÅEUSR)
      *
      *  PROSJEKTRAPPORTER        RPRLPF    (RPR)
      *
     A            RPRLRA      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rapport-nr.')
     A                                      COLHDG('Rap')
     A            RPRLIN      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rapport-linje')
     A                                      COLHDG('Lin')
6.32 A            RPRULI      0003S 0
6.32 A                                      EDTCDE(Z)
6.32 A                                      TEXT('Under-linje')
6.32 A                                      COLHDG('ULin')
     A            RPRLST      0001A
     A                                      TEXT('Status')
     A                                      COLHDG('St')
     A            RPRLTX      0030A
     A                                      COLHDG('Linje-txt')
     A            RPRFKT      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Fra konto')
     A                                      COLHDG('F.kto')
     A            RPRFSP      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Fra Kostnadsbærer')
     A                                      COLHDG('F.bær')
6.22 A            RPRFAK    R               REFFLD(RÅAKTI)
     A                                      COLHDG('F.akt')
     A            RPRFLI      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Fra linje')
     A                                      COLHDG('F.lin')
     A            RPRTKT      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Til konto')
     A                                      COLHDG('T.kto')
     A            RPRTSP      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Til Kostnadsbærer')
     A                                      COLHDG('T.bær')
6.22 A            RPRTAK    R               REFFLD(RÅAKTI)
     A                                      COLHDG('T.akt')
     A            RPRTLI      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Til linje')
     A                                      COLHDG('T.lin')
     A            RPRLKO      0001A
     A                                      TEXT('Linjekode')
     A                                      COLHDG('L.kod')
     A            RPRFTG      0001A
     A                                      VALUES(' ' '-' '+')
     A                                      TEXT('Fortegn')
     A                                      COLHDG('Ft')
     A            RPRNIV      0001S 0
     A                                      VALUES(1 2 3 4 5 6 7 8 9)
     A                                      TEXT('Summeringsnivå')
     A                                      COLHDG('Niv')
      *
      *  PROSJEKTRAPPORTER        RPRXPF    (RPR)
      *
     A            RPRXFI      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
     A            RPRXRA      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rapport-nr.')
     A                                      COLHDG('Rap')
     A            RPRXLI      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rapport-linje')
     A                                      COLHDG('Lin')
     A            RPRXTX      0030A
     A                                      COLHDG('Linje-txt')
     A            RPRXLK      0001A
     A                                      TEXT('Linjekode')
     A                                      COLHDG('Lk')
     A            RPRXFP      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Faktisk - Periode')
     A                                      COLHDG('Faktisk Per')
     A            RPRXFÅ      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Faktisk - År')
     A                                      COLHDG('Faktisk År')
     A            RPRXFT      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Faktisk - Totalt')
     A                                      COLHDG('Faktisk Tot')
     A            RPRXBP      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Budsjett - Periode')
     A                                      COLHDG('Budsjett Per')
     A            RPRXBÅ      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Budsjett - År')
     A                                      COLHDG('Budsjett År')
     A            RPRXBT      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Budsjett - Totalt')
     A                                      COLHDG('Budsjett Tot')
     A            RPRXMP      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('F.mengde - Periode')
     A                                      COLHDG('F.mengde Per')
     A            RPRXMÅ      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('F.mengde - År')
     A                                      COLHDG('F.mengde År')
     A            RPRXMT      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('F.mengde - Totalt')
     A                                      COLHDG('F.mengde Tot')
     A            RPRXNP      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('B.mengde - Periode')
     A                                      COLHDG('B.mengde Per')
     A            RPRXNÅ      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('B.mengde - År')
     A                                      COLHDG('B.mengde År')
     A            RPRXNT      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('B.mengde - Totalt')
     A                                      COLHDG('B.mengde Tot')
6.10 A            RPRXOD    R               REFFLD(RÅODAT)
6.10 A            RPRXOT    R               REFFLD(RÅOTIM)
6.10 A            RPRXOU    R               REFFLD(RÅOUSR)
6.10 A            RPRXED    R               REFFLD(RÅEDAT)
6.10 A            RPRXET    R               REFFLD(RÅETIM)
6.10 A            RPRXEU    R               REFFLD(RÅEUSR)
      *
      *  PROSJEKT SALDO           RPSAPF    (RQ)
      *
     A            RQFIRM      0003S 0
     A                                      TEXT('Firma')
     A                                      COLHDG('Firma')
6.22 A            RQPROS    R               REFFLD(RÅPROS)
6.22 A            RQAKTI    R               REFFLD(RÅAKTI)
     A            RQRAAR      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('REGNSKAPS-År')
     A                                      COLHDG('År')
     A            RQKONT      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A            RQSPES      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RQTYPE      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rec. type')
     A                                      COLHDG('Rt')
     A            RQSA01      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.01')
     A                                      COLHDG('Bev. Per.01')
     A            RQSA02      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.02')
     A                                      COLHDG('Bev. Per.02')
     A            RQSA03      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.03')
     A                                      COLHDG('Bev. Per.03')
     A            RQSA04      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.04')
     A                                      COLHDG('Bev. Per.04')
     A            RQSA05      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.05')
     A                                      COLHDG('Bev. Per.05')
     A            RQSA06      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.06')
     A                                      COLHDG('Bev. Per.06')
     A            RQSA07      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.07')
     A                                      COLHDG('Bev. Per.07')
     A            RQSA08      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.08')
     A                                      COLHDG('Bev. Per.08')
     A            RQSA09      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.09')
     A                                      COLHDG('Bev. Per.09')
     A            RQSA10      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.10')
     A                                      COLHDG('Bev. Per.10')
     A            RQSA11      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.11')
     A                                      COLHDG('Bev. Per.11')
     A            RQSA12      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.12')
     A                                      COLHDG('Bev. Per.12')
     A            RQSA13      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Per.13')
     A                                      COLHDG('Bev. Per.13')
     A            RQSA00      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Saldo 01.01 (IB)')
     A                                      COLHDG('Saldo 01.01')
     A            RQSA14      0011S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Ikke brukt')
     A            RQSTDP      0009S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Standard pris')
6.10 A            RQODAT    R               REFFLD(RÅODAT)
6.10 A            RQOTIM    R               REFFLD(RÅOTIM)
6.10 A            RQOUSR    R               REFFLD(RÅOUSR)
6.10 A            RQEDAT    R               REFFLD(RÅEDAT)
6.10 A            RQETIM    R               REFFLD(RÅETIM)
6.10 A            RQEUSR    R               REFFLD(RÅEUSR)
6.20  *
6.20  *  PROSJEKT-REGISTER        RP1PPF    (RP1)  NYTT 2010
6.20  *
6.20 A            RP1FRM      0003S 0
6.20 A                                      TEXT('Firma')
6.20 A                                      COLHDG('Firma')
6.20 A            RP1PRO      0006A
6.20 A                                      TEXT('Prosjekt-nr.')
6.20 A                                      COLHDG('Prosj.')
6.20 A            RP1AVD      0004S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Avdeling')
6.20 A                                      COLHDG('Avd.')
6.20 A            RP1TXT      0030A
6.20 A                                      TEXT('Prosjekt navn')
6.20 A                                      COLHDG('Prosjekt' 'Navn')
6.20 A            RP1TX2      0030A
6.20 A                                      TEXT('Prosjekt navn2')
6.20 A                                      COLHDG('Prosjekt' 'navn2')
6.20 A            RP1KNR      0006S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Prosjekt-kunde')
6.20 A                                      COLHDG('P.kunde')
6.20 A            RP1KRN      0006S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Kundens Ref Nr')
6.20 A                                      COLHDG('Kundens' 'Ref.nr')
6.20 A            RP1KRF      0050A
6.20 A                                      TEXT('Kundens-ref.')
6.20 A                                      COLHDG('Kundens-ref')
6.20 A            RP1KRT      0015A
6.20 A                                      TEXT('Kundens-ref.Tlf')
6.20 A                                      COLHDG('Kundens-ref.Tlf')
6.20 A            RP1KRM      0040A
6.20 A                                      TEXT('Kundens-ref.Mail')
6.20 A                                      COLHDG('Kundens-ref.Mail')
6.20 A            RP1PRL      0004S 0
6.20  *                       Bør ev. utvides til 5 siffer (LØNN)    NB!!!
6.20 A                                      TEXT('Prosjektleder')
6.20 A                                      COLHDG('Prosj.' 'Leder')
6.20 A            RP1BUO      0011S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Budsjett opprinnlig')
6.20 A                                      COLHDG('Budsjett')
6.20 A            RP1BUT      0011S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Budsjett tillegg')
6.20 A                                      COLHDG('B.Tillegg')
6.20 A            RP1RUP      0001A
6.20 A                                      TEXT('Reg. Und.Pro')
6.20 A                                      COLHDG('Reg' 'Upr')
6.20 A            RP1RAK      0001A
6.20 A                                      TEXT('Reg. Aktivitet')
6.20 A                                      COLHDG('Reg' 'Akt')
6.20 A            RP1RAO      0001A
6.20 A                                      TEXT('Reg. Arb.Ordre')
6.20 A                                      COLHDG('Reg' 'A.Ord')
6.20 A            RP1AST      0010A
6.20 A                                      TEXT('Aktivitets standard')
6.20 A                                      COLHDG('Aktiviet' 'Standard')
6.20 A            RP1STS      0001A
6.20 A                                      TEXT('Prosjekt-status')
6.20 A                                      COLHDG('Pr' 'st')
6.20 A*                                     'A' = Avsluttet
6.20 A*                                     'O'/' ' = Åpent
6.20 A            RP1PTY      0002A
6.20 A                                      TEXT('Prosjekt type')
6.20 A                                      COLHDG('Prosj.' 'type')
6.20 A            RP1FSD          L
6.20 A                                      TEXT('Forv. Start dato')
6.20 A                                      COLHDG('Forv' 'Start' 'dato')
6.20 A            RP1FED          L
6.20 A                                      TEXT('Forv. Slutt dato')
6.20 A                                      COLHDG('Forv.' 'Slutt' 'dato')
6.20 A            RP1VSD          L
6.20 A                                      TEXT('Virk. Start dato')
6.20 A                                      COLHDG('Virk.' 'Start' 'dato')
6.20 A            RP1VED          L
6.20 A                                      TEXT('Virk. Slutt dato')
6.20 A                                      COLHDG('Virk.' 'Slutt' 'dato')
6.20 A            RP1ALF      0020A
6.20 A                                      COLHDG('Alfafelt')
6.20 A            RP1ODA    R               REFFLD(RÅODAT)
6.20 A            RP1OTI    R               REFFLD(RÅOTIM)
6.20 A            RP1OAV    R               REFFLD(RÅOUSR)
6.20 A            RP1EDA    R               REFFLD(RÅEDAT)
6.20 A            RP1ETI    R               REFFLD(RÅETIM)
6.20 A            RP1EAV    R               REFFLD(RÅEUSR)
6.20  *
6.20  *  PROSJEKT UNDERPROSJEKT  RP2UPF    (RP2)  NYTT 2010
6.20  *
6.20 A            RP2FRM      0003S 0
6.20 A                                      TEXT('Firma')
6.20 A                                      COLHDG('Firma')
6.20 A            RP2PRO      0006A
6.20 A                                      TEXT('Prosjekt-nr.')
6.20 A                                      COLHDG('Prosj.')
6.20 A            RP2UPR      0006A
6.20 A                                      TEXT('Under Prosjekt-nr.')
6.20 A                                      COLHDG('Under' 'Prosj.')
6.20 A            RP2AVD      0004S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Avdeling')
6.20 A                                      COLHDG('Avd.')
6.20 A            RP2TXT      0030A
6.20 A                                      TEXT('UnderProsjekt-navn')
6.20 A                                      COLHDG('Under' 'Prosjekt' 'Navn')
6.20 A            RP2TX2      0030A
6.20 A                                      TEXT('UnderProsjekt-navn2')
6.20 A                                      COLHDG('Under' 'Prosjekt' 'navn2')
6.20 A            RP2KNR      0006S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Prosjekt-kunde')
6.20 A                                      COLHDG('P.kunde')
6.20 A            RP2KRN      0006S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Kundens Ref Nr')
6.20 A                                      COLHDG('Kundens' 'Ref.nr')
6.20 A            RP2KRF      0050A
6.20 A                                      TEXT('Kundens-ref.')
6.20 A                                      COLHDG('Kundens-ref')
6.20 A            RP2KRT      0015A
6.20 A                                      TEXT('Kundens-ref.Tlf')
6.20 A                                      COLHDG('Kundens-ref.Tlf')
6.20 A            RP2KRM      0040A
6.20 A                                      TEXT('Kundens-ref.Mail')
6.20 A                                      COLHDG('Kundens-ref.Mail')
6.20 A            RP2PRL      0004S 0
6.20  *                       Bør ev. utvides til 5 siffer (LØNN)    NB!!!
6.20 A                                      TEXT('Prosjektleder')
6.20 A                                      COLHDG('Prosj.' 'Leder')
6.20 A            RP2BUO      0011S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Budsjett opprinnlig')
6.20 A                                      COLHDG('Budsjett')
6.20 A            RP2BUT      0011S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Budsjett tillegg')
6.20 A                                      COLHDG('B.Tillegg')
6.20 A            RP2RAK      0001A
6.20 A                                      TEXT('Reg. Aktivitet')
6.20 A                                      COLHDG('Reg' 'Akt')
6.20 A            RP2RAO      0001A
6.20 A                                      TEXT('Reg. Arb.Ordre')
6.20 A                                      COLHDG('Reg' 'A.Ord')
6.20 A            RP2STS      0001A
6.20 A                                      TEXT('Prosjekt-status')
6.20 A                                      COLHDG('Pr' 'st')
6.20 A*                                     'A' = Avsluttet
6.20 A*                                     'O'/' ' = Åpent
6.20 A            RP2PTY      0002A
6.20 A                                      TEXT('Prosjekt type')
6.20 A                                      COLHDG('Prosj.' 'type')
6.20 A            RP2FSD          L
6.20 A                                      TEXT('Forv. Start dato')
6.20 A                                      COLHDG('Forv' 'Start' 'dato')
6.20 A            RP2FED          L
6.20 A                                      TEXT('Forv. Slutt dato')
6.20 A                                      COLHDG('Forv.' 'Slutt' 'dato')
6.20 A            RP2VSD          L
6.20 A                                      TEXT('Virk. Start dato')
6.20 A                                      COLHDG('Virk.' 'Start' 'dato')
6.20 A            RP2VED          L
6.20 A                                      TEXT('Virk. Slutt dato')
6.20 A                                      COLHDG('Virk.' 'Slutt' 'dato')
6.20 A            RP2ALF      0020A
6.20 A                                      COLHDG('Alfafelt')
6.20 A            RP2ODA    R               REFFLD(RÅODAT)
6.20 A            RP2OTI    R               REFFLD(RÅOTIM)
6.20 A            RP2OAV    R               REFFLD(RÅOUSR)
6.20 A            RP2EDA    R               REFFLD(RÅEDAT)
6.20 A            RP2ETI    R               REFFLD(RÅETIM)
6.20 A            RP2EAV    R               REFFLD(RÅEUSR)
6.20  *
6.20  *  Prosjekt Aktivitet  RP3APF    (RP3)  NYTT 2010
6.20  *
6.20 A            RP3FRM      0003S 0
6.20 A                                      TEXT('Firma')
6.20 A                                      COLHDG('Firma')
6.20 A            RP3PRO      0006A
6.20 A                                      TEXT('Prosjekt-nr.')
6.20 A                                      COLHDG('Prosj.')
6.20 A            RP3UPR      0006A
6.20 A                                      TEXT('Under Prosjekt-nr.')
6.20 A                                      COLHDG('Under' 'Prosj.')
6.20 A            RP3AKT      0006A
6.20 A                                      TEXT('Aktivitet')
6.20 A                                      COLHDG('Aktivitet')
6.20 A            RP3AVD      0004S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Avdeling')
6.20 A                                      COLHDG('Avd.')
6.20 A            RP3TXT      0030A
6.20 A                                      TEXT('Aktivitets-navn')
6.20 A                                      COLHDG('Aktivitets-navn')
6.20 A            RP3TX2      0030A
6.20 A                                      TEXT('Aktivitets-navn2')
6.20 A                                      COLHDG('Aktivitet' 'navn2')
6.20 A            RP3KNR      0006S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Prosjekt-kunde')
6.20 A                                      COLHDG('P.kunde')
6.20 A            RP3KRN      0006S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Kundens Ref Nr')
6.20 A                                      COLHDG('Kundens' 'Ref.nr')
6.20 A            RP3KRF      0050A
6.20 A                                      TEXT('Kundens-ref.')
6.20 A                                      COLHDG('Kundens-ref')
6.20 A            RP3KRT      0015A
6.20 A                                      TEXT('Kundens-ref.Tlf')
6.20 A                                      COLHDG('Kundens-ref.Tlf')
6.20 A            RP3KRM      0040A
6.20 A                                      TEXT('Kundens-ref.Mail')
6.20 A                                      COLHDG('Kundens-ref.Mail')
6.20 A            RP3PRL      0004S 0
6.20  *                       Bør ev. utvides til 5 siffer (LØNN)    NB!!!
6.20 A                                      TEXT('Prosjektleder')
6.20 A                                      COLHDG('Prosj.' 'Leder')
6.20 A            RP3BUO      0011S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Budsjett opprinnlig')
6.20 A                                      COLHDG('Budsjett')
6.20 A            RP3BUT      0011S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Budsjett tillegg')
6.20 A                                      COLHDG('B.Tillegg')
6.20 A            RP3RAO      0001A
6.20 A                                      TEXT('Reg. Arb.Ordre')
6.20 A                                      COLHDG('Reg' 'A.Ord')
6.20 A            RP3STS      0001A
6.20 A                                      TEXT('Prosjekt-status')
6.20 A                                      COLHDG('Pr' 'st')
6.20 A*                                     'A' = Avsluttet
6.20 A*                                     'O'/' ' = Åpent
6.20 A            RP3ATY      0002A
6.20 A                                      TEXT('Aktivitet type')
6.20 A                                      COLHDG('Akt.' 'type')
6.20 A            RP3FSD          L
6.20 A                                      TEXT('Forv. Start dato')
6.20 A                                      COLHDG('Forv' 'Start' 'dato')
6.20 A            RP3FED          L
6.20 A                                      TEXT('Forv. Slutt dato')
6.20 A                                      COLHDG('Forv.' 'Slutt' 'dato')
6.20 A            RP3VSD          L
6.20 A                                      TEXT('Virk. Start dato')
6.20 A                                      COLHDG('Virk.' 'Start' 'dato')
6.20 A            RP3VED          L
6.20 A                                      TEXT('Virk. Slutt dato')
6.20 A                                      COLHDG('Virk.' 'Slutt' 'dato')
6.20 A            RP3ALF      0020A
6.20 A                                      COLHDG('Alfafelt')
6.20 A            RP3ODA    R               REFFLD(RÅODAT)
6.20 A            RP3OTI    R               REFFLD(RÅOTIM)
6.20 A            RP3OAV    R               REFFLD(RÅOUSR)
6.20 A            RP3EDA    R               REFFLD(RÅEDAT)
6.20 A            RP3ETI    R               REFFLD(RÅETIM)
6.20 A            RP3EAV    R               REFFLD(RÅEUSR)
6.20  *
6.20  *  Prosjekt Arbeidsordre RP4OPF    (RP4)  NYTT 2010    SVEN
6.20  *
6.20 A            RP4FRM      0003S 0
6.20 A                                      TEXT('Firma')
6.20 A                                      COLHDG('Firma')
6.20 A            RP4PRO      0006A
6.20 A                                      TEXT('Prosjekt-nr.')
6.20 A                                      COLHDG('Prosj.')
6.20 A            RP4UPR      0006A
6.20 A                                      TEXT('Under Prosjekt-nr.')
6.20 A                                      COLHDG('Under' 'Prosj.')
6.20 A            RP4AKT      0006A
6.20 A                                      TEXT('Aktivitet')
6.20 A                                      COLHDG('Aktivitet')
6.20 A            RP4ORD      0006A
6.20 A                                      TEXT('Arbeidsordre')
6.20 A                                      COLHDG('Arbeids' 'Ordre')
6.20 A            RP4TXT      0030A
6.20 A                                      TEXT('Arb.Ordre Navn')
6.20 A                                      COLHDG('Arbeids' 'Ordre' 'Navn')
6.20 A            RP4TX2      0030A
6.20 A                                      TEXT('Arb.Ordre Navn2')
6.20 A                                      COLHDG('Arbeids' 'Ordre' 'Navn2')
6.20 A            RP4KRN      0006S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Kundens Ref Nr')
6.20 A                                      COLHDG('Kundens' 'Ref.nr')
6.20 A            RP4KRF      0050A
6.20 A                                      TEXT('Kundens-ref.')
6.20 A                                      COLHDG('Kundens-ref')
6.20 A            RP4KRT      0015A
6.20 A                                      TEXT('Kundens-ref.Tlf')
6.20 A                                      COLHDG('Kundens-ref.Tlf')
6.20 A            RP4KRM      0040A
6.20 A                                      TEXT('Kundens-ref.Mail')
6.20 A                                      COLHDG('Kundens-ref.Mail')
6.20 A            RP4PRL      0004S 0
6.20  *                       Bør ev. utvides til 5 siffer (LØNN)    NB!!!
6.20 A                                      TEXT('Prosjektleder')
6.20 A                                      COLHDG('Prosj.' 'Leder')
6.20 A            RP4LEV      0006S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Leverandørnr')
6.20 A                                      COLHDG('Leverandør' 'Nummer')
6.20 A            RP4ARL      0005S 0
6.20 A                                      EDTCDE(Z)
6.20 A                                      TEXT('Arbeids leder')
6.20 A                                      COLHDG('Arbeids' 'Leder')
6.20 A            RP4STS      0001A
6.20 A                                      TEXT('Ordre-status')
6.20 A                                      COLHDG('Ordre' 'stat.')
6.20 A*                                     'A' = Avsluttet
6.20 A*                                     'O'/' ' = Åpent
6.20 A            RP4OTY      0002A
6.20 A                                      TEXT('Ordre type')
6.20 A                                      COLHDG('Ordre' 'type')
6.20 A            RP4FSD          L
6.20 A                                      TEXT('Forv. Start dato')
6.20 A                                      COLHDG('Forv' 'Start' 'dato')
6.20 A            RP4FED          L
6.20 A                                      TEXT('Forv. Slutt dato')
6.20 A                                      COLHDG('Forv.' 'Slutt' 'dato')
6.20 A            RP4VSD          L
6.20 A                                      TEXT('Virk. Start dato')
6.20 A                                      COLHDG('Virk.' 'Start' 'dato')
6.20 A            RP4VED          L
6.20 A                                      TEXT('Virk. Slutt dato')
6.20 A                                      COLHDG('Virk.' 'Slutt' 'dato')
6.20 A            RP4ALF      0020A
6.20 A                                      COLHDG('Alfafelt')
6.20  *
6.20 A            RP4ODA    R               REFFLD(RÅODAT)
6.20 A            RP4OTI    R               REFFLD(RÅOTIM)
6.20 A            RP4OAV    R               REFFLD(RÅOUSR)
6.20 A            RP4EDA    R               REFFLD(RÅEDAT)
6.20 A            RP4ETI    R               REFFLD(RÅETIM)
6.20 A            RP4EAV    R               REFFLD(RÅEUSR)
6.22  *
6.22  *  Prosjekt Lønnstager (fra H&L)
6.22  *
6.22 A            ILRTYP         1A
6.22 A                                      COLHDG('L.TagerType')
6.22 A                                      TEXT('L.TagerType')
6.22  *                                     A = Ansatt
6.22  *                                     E = Ekstern/Innleid
6.22 A            ILRKLI    R               REFFLD(KLIENT)
6.22 A                                      EDTCDE(Z)
6.22 A                                      COLHDG('Klient')
6.22 A                                      TEXT('Klient')
6.22 A            ILRLNR    R               REFFLD(LØNNSNR)
6.22 A                                      EDTCDE(Z)
6.22 A                                      COLHDG('Lønnsnr.')
6.22 A                                      TEXT('Lønnsnr.')
6.22 A            ILRNAV    R               REFFLD(NAVN)
6.22 A                                      COLHDG('Lønnstager')
6.22 A                                      TEXT('Lønnstager')
6.22 A            ILRADR    R               REFFLD(NAVN)
6.22 A                                      COLHDG('Adresse')
6.22 A                                      TEXT('Adresse')
6.22 A            ILRAD2    R               REFFLD(NAVN)
6.22 A                                      COLHDG('Adresse2')
6.22 A                                      TEXT('Adresse2')
6.22 A            ILRPNR         4S 0       EDTCDE(Z)
6.22 A                                      COLHDG('Postnr')
6.22 A                                      TEXT('Postnr')
6.22 A            ILRSTE        30A
6.22 A                                      COLHDG('Poststed')
6.22 A                                      TEXT('Poststed')
6.22 A            ILRAVD    R               REFFLD(AVD)
6.22 A                                      COLHDG('Avdeling')
6.22 A                                      TEXT('Avdeling')
6.22 A            ILRMOB        12A
6.22 A                                      COLHDG('Mobilnr')
6.22 A                                      TEXT('Mobilnr')
6.22 A            ILREPO        50A
6.22 A                                      COLHDG('ePost')
6.22 A                                      TEXT('ePost')
6.22 A            ILRLTY         4A
6.22 A                                      COLHDG('LønnstagerType')
6.22 A                                      TEXT('LønnstagerType')
6.21 A            ILRUSR        10A
6.21 A                                      COLHDG('Bruker')
6.21 A                                      TEXT('Bruker')
6.21 A            ILRPWD        10A
6.21 A                                      COLHDG('Passord')
6.21 A                                      TEXT('Passord')
6.20 A            ILRODA    R               REFFLD(RÅODAT)
6.20 A            ILROTI    R               REFFLD(RÅOTIM)
6.20 A            ILROAV    R               REFFLD(RÅOUSR)
6.20 A            ILREDA    R               REFFLD(RÅEDAT)
6.20 A            ILRETI    R               REFFLD(RÅETIM)
6.20 A            ILREAV    R               REFFLD(RÅEUSR)
6.21  *
6.21  *  Prosjekt Lønnstranser           (RP5)  NYTT 2010    SVEN
6.21  *
6.21 A            ILTKLI         3S 0       EDTCDE(Z)
6.21 A                                      COLHDG('FirmaNr')
6.21 A                                      TEXT('FirmaNr')
6.21 A            ILTLIN      0005S 0
6.21 A                                      EDTCDE(Z)
6.21 A                                      COLHDG('Linjenr.')
6.21 A                                      TEXT('Linjenr.')
6.21 A            ILTLNR    R               REFFLD(LØNNSNR *SRC)
6.21 A                                      EDTCDE(Z)
6.21 A                                      COLHDG('Lønnsnr.')
6.21 A                                      TEXT('Lønnsnr.')
6.21 A            ILTNAV    R               REFFLD(NAVN *SRC)
6.21 A                                      COLHDG('Lønnstager')
6.21 A                                      TEXT('Lønnstager')
6.21 A            ILTAVD    R               REFFLD(AVD *SRC)
6.21 A                                      EDTCDE(Z)
6.21 A                                      COLHDG('Avdeling')
6.21 A                                      TEXT('Avdeling')
6.21 A            ILTONR         6A
6.21 A                                      COLHDG('Arb.OrdreNr.')
6.21 A                                      TEXT('Arb.OrdreNr.')
6.21 A            ILTOAV    R               REFFLD(AVD *SRC)
6.21 A                                      EDTCDE(Z)
6.21 A                                      COLHDG('OrdreAvd.')
6.21 A                                      TEXT('OrdreAvd.')
6.21  *
6.21 A            ILTLTY      0001A
6.21 A                                      COLHDG('Type L/F')
6.21 A                                      TEXT('Type L/F')
6.21 A            ILTART         3S 0
6.21 A                                      EDTCDE(Z)
6.21 A                                      COLHDG('Lønnart')
6.21 A                                      TEXT('Lønnart')
6.21 A            ILTANT      0007S 2
6.21 A                                      EDTCDE(M)
6.21 A                                      COLHDG('Antall')
6.21 A                                      TEXT('Antall')
6.21 A            ILTSAT      0007S 2
6.21 A                                      EDTCDE(M)
6.21 A                                      COLHDG('Sats')
6.21 A                                      TEXT('Sats')
6.21 A            ILTBEL      0009S 2
6.21 A                                      EDTCDE(M)
6.21 A                                      COLHDG('Beløp')
6.21 A                                      TEXT('Beløp')
6.21  *
6.21 A            ILTTXT      0030A
6.21 A                                      COLHDG('Tekst')
6.21 A                                      TEXT('Tekst')
6.21 A            ILTFDA          L
6.21 A                                      COLHDG('Fra Dato')
6.21 A                                      TEXT('Fra Dato')
6.21 A            ILTTDA          L
6.21 A                                      COLHDG('Til Dato')
6.21 A                                      TEXT('Til Dato')
6.21 A            ILTAVS      0001A
6.21 A                                      COLHDG('Arb.avslutt')
6.21 A                                      TEXT('Arb.Avslutt')
6.21 A            ILTPK          2S 0
6.21 A                                      COLHDG('Overstyrt prisk.')
6.21 A                                      TEXT('Overstyrt priskode')
6.21 A            ILTUSR    R               REFFLD(DSEUSR *SRC)
6.21 A                                      COLHDG('BRUKER')
6.21 A                                      TEXT('BRUKER')
6.21 A            ILTOVL         1A
6.21 A                                      COLHDG('OVF. LØNN')
6.21 A                                      TEXT('OVF. LØNN')
6.21 A*                                     ' ' = NY
6.21 A*                                     'F' = Feil
6.21 A*                                     'J' = Overført lønn
6.21 A*                                     'O' = Bare til Ordre
6.21 A*                                     'N' = Ikke til lønn
6.21 A*                                     'X' = Trukket ut
6.21 A            ILTOLD          L         COLHDG('Ovf.L.Dato')
6.21 A                                      TEXT('Ovf.L.Dato')
6.21 A            ILTOLT          T         COLHDG('Ovf.L.Kl')
6.21 A                                      TEXT('Ovf.L.Kl')
6.21 A            ILTOLU        10A         COLHDG('Ovf.L.User')
6.21 A                                      TEXT('Ovf.L.User')
6.21 A            ILTOVO         1A
6.21 A                                      COLHDG('OVF. ORDRE')
6.21 A                                      TEXT('OVF. ORDRE')
6.21 A*                                     ' ' = NY
6.21 A*                                     'F' = Feil
6.21 A*                                     'J' = Overført ordre
6.21 A*                                     'L' = Bare til Lønn
6.21 A*                                     'N' = Ikke til Ordre
6.21 A*                                     'X' = Trukket ut
6.21 A            ILTOVF         1A
6.21 A                                      COLHDG('Ovf. Fakt.')
6.21 A                                      TEXT('Ovf. Fakt.')
6.21 A*                                     ' ' = NY
6.21 A*                                     'J' = Overført Faktura
6.21 A*                                     'N' = Ikke til Faktura
6.21 A*                                     'X' = Trukket ut
6.21 A            ILTOFD          L         COLHDG('Ovf.F.Dato')
6.21 A                                      TEXT('Ovf.F.Dato')
6.21 A            ILTOFT          T         COLHDG('Ovf.F.Kl')
6.21 A                                      TEXT('Ovf.F.Kl')
6.21 A            ILTOFU        10A         COLHDG('Ovf.F.User')
6.21 A                                      TEXT('Ovf.F.User')
6.21 A            ILTOVR         1A
6.21 A                                      COLHDG('Ovf. Reiseregn.')
6.21 A                                      TEXT('Ovf. Reiseregn.')
6.21 A*                                     ' ' = NY
6.21 A*                                     'J' = Overf. Reiseregning
6.21 A*                                     'N' = Ikke til Reiseregn.
6.21 A*                                     'X' = Trukket ut
6.21 A            ILTORD          L         COLHDG('Ovf.R.Dato')
6.21 A                                      TEXT('Ovf.R.Dato')
6.21 A            ILTORT          T         COLHDG('Ovf.R.Kl')
6.21 A                                      TEXT('Ovf.R.Kl')
6.21 A            ILTORU        10A         COLHDG('Ovf.R.User')
6.21 A                                      TEXT('Ovf.R.User')
6.21 A            ILTATT    R               REFFLD(DSEUSR *SRC)
6.21 A                                      COLHDG('ATTESTERT AV')
6.21 A                                      TEXT('ATTESTERT AV')
6.21 A            ILTAT2    R               REFFLD(DSEUSR *SRC)
6.21 A                                      COLHDG('ATTESTERT AV 2')
6.21 A                                      TEXT('ATTESTERT AV 2')
6.21 A            ILTPER         6S 0
6.21 A                                      EDTCDE(Z)
6.21 A                                      COLHDG('LØNNSPERIODE')
6.21 A                                      TEXT('LØNNSPERIODE')
6.21 A            ILTLFK         1A
6.21 A                                      COLHDG('LF-KODE')
6.21 A                                      TEXT('LF-KODE')
6.21 A            ILTKDA          L
6.21 A                                      COLHDG('KEY DATO')
6.21 A                                      TEXT('KEY DATO')
6.21 A            ILTATA    R               REFFLD(LØNNSNR *SRC)
6.21 A                                      EDTCDE(Z)
6.21 A                                      COLHDG('Attesteres av')
6.21 A                                      TEXT('Attesteres av')
6.21 A            ILTAA2    R               REFFLD(LØNNSNR *SRC)
6.21 A                                      COLHDG('ATTESTERES AV 2')
6.21 A                                      TEXT('ATTESTERES AV 2')
6.21 A            ILTSLT         1A
6.21 A                                      COLHDG('SLETTEMERKE')
6.21 A                                      TEXT('SLETTEMERKE')
6.21 A            ILTSLR         1A
6.21 A                                      COLHDG('SLETT. RAPPORTERT')
6.21 A                                      TEXT('SLETTING RAPPORTERT')
6.21 A            ILTHTT         9S 0
6.21 A                                      TEXT('HM-tekst-teller')
6.21 A                                      COLHDG('HM-tekst-teller')
6.21 A            ILTAD1          L
6.21 A                                      COLHDG('AttDato1')
6.21 A                                      TEXT('AttDato1')
6.21 A            ILTAD2          L
6.21 A                                      COLHDG('AttDato2')
6.21 A                                      TEXT('AttDato2')
6.21 A            ILTAK1          T         TEXT('AttKl1')
6.21 A            ILTAK2          T         TEXT('AttKl2')
6.21 A            ILTRAV    R               REFFLD(LØNNSNR *SRC)
6.21 A                                      COLHDG('RegAv')
6.21 A                                      TEXT('RegAv')
6.21 A            ILTRDA          L
6.21 A                                      COLHDG('RegDato')
6.21 A                                      TEXT('RegDato')
6.21 A            ILTRKL          T         TEXT('RegTid')
6.21 A            ILTHML         9S 0
6.21 A                                      TEXT('HM-Linjenr.')
6.21 A                                      COLHDG('HM-Linjenr.')
6.21 A            ILTFEL        40
6.21 A                                      TEXT('Feilmelding')
6.21 A                                      COLHDG('Feilmelding')
6.21 A            ILTSPR         7S 0       EDTCDE(Z)
6.21 A                                      TEXT('Sporingslinjenr.')
6.21 A                                      COLHDG('Spor' 'Linjenr')
6.20  *
6.20  *  Prosjekt Lønnsarter             (ILA)  NYTT 2010    SVEN
6.20  *
6.21 A            ILAKLI         3S 0       EDTCDE(Z)
6.21 A                                      COLHDG('FirmaNr')
6.21 A                                      TEXT('FirmaNr')
6.21 A            ILAART         3S 0       EDTCDE(Z)
6.21 A                                      COLHDG('LønnArt')
6.21 A                                      TEXT('LønnArt')
6.21 A            ILATXT        30A
6.21 A                                      COLHDG('LønnArt Tekst')
6.21 A                                      TEXT('LønnArt Tekst')
6.21 A            ILALF          1A
6.21 A                                      COLHDG('Lønn-Fakt Kode')
6.21 A                                      TEXT('Lønn-Fakt Kode')
6.21 A            ILALTY         1A
6.21 A                                      COLHDG('Lønn-Type')
6.21 A                                      TEXT('Lønn-Type')
6.20  *                                     1 = Utførte timer
6.20  *                                     3 = Tillegg og herav tid
6.20  *                                     9 = Km
6.20  *                                     A = Andre kostnader
6.21 A            ILAKPR         7S 2       EDTCDE(Z)
6.21 A                                      COLHDG('Kostpris')
6.22 A                                      TEXT('Kostpris')
6.21 A            ILAKTO         5S 0       EDTCDE(Z)
6.21 A                                      COLHDG('Konto')
6.22 A                                      TEXT('Konto')
6.23 A            ILAKSB         1A
6.23 A                                      COLHDG('KravSatsBeløp')
6.23 A                                      TEXT('Krav om Sats/Bel')
6.20  *                                     J=Krever Sats/Beløp
6.22 A**
6.22 A**  Prosjekt,  Lønns-kalender
6.22 A**
6.22 A            ILKPER         6S 0
6.22 A                                      TEXT('LØNNS-PERIODE')
6.22 A                                      COLHDG('LØNNS-PERIODE')
6.22 A            ILKOKP         6S 0
6.22 A                                      TEXT('ØK-PERIODE')
6.22 A                                      COLHDG('ØK-PERIODE')
6.22 A            ILKPSP         1A
6.22 A                                      TEXT('PERIODE SPERRET')
6.22 A                                      COLHDG('PERIODE SPERRET')
6.22 A            ILKFDA          L
6.22 A                                      TEXT('FRA DATO')
6.22 A                                      COLHDG('FRA DATO')
6.22 A            ILKTDA          L
5.3A A                                      TEXT('TIL DATO')
5.3A A                                      COLHDG('TIL DATO')
5.3A A            ILKODA          L         TEXT('OPPRETTET DATO')
5.3A A            ILKEDA          L         TEXT('ENDRET DATO')
5.3A A            ILKETI          T         TEXT('ENDRINGS TIDSPUNKT')
5.3A A            ILKUSR        10A         TEXT('ENDRET AV')
6.20  *
6.20  *  Prosjekt Aktivitetsstandard     (RP9)  NYTT 2010    SVEN
6.20  *
6.20 A            RP9FRM      0003S 0
6.20 A                                      TEXT('Firma')
6.20 A                                      COLHDG('Firma')
6.20 A            RP9AST      0010A
6.20 A                                      TEXT('Akt.Standard')
6.20 A                                      COLHDG('Akt.' 'Standard')
6.20 A            RP9AKT      0006A
6.20 A                                      TEXT('Akti. linje')
6.20 A                                      COLHDG('Akt.' 'Linje')
6.20 A            RP9TXT      0040A
6.20 A                                      TEXT('Akt. Tekst')
6.20 A                                      COLHDG('Akt.' 'Tekst')
6.20 A            RP9ODA    R               REFFLD(RÅODAT)
6.20 A            RP9OTI    R               REFFLD(RÅOTIM)
6.20 A            RP9OAV    R               REFFLD(RÅOUSR)
6.20 A            RP9EDA    R               REFFLD(RÅEDAT)
6.20 A            RP9ETI    R               REFFLD(RÅETIM)
6.20 A            RP9EAV    R               REFFLD(RÅEUSR)
      *
      *   Registrering,buntrecord RBUNPF    (RS)
      *
6.11 A            RSNIVO      0001A
6.11 A                                      TEXT('Status')
6.11 A                                      COLHDG('St')
6.11  *
6.11 A            RSMEMB      0010A
6.11 A                                      TEXT('Member')
6.11 A                                      COLHDG('Mb')
6.11  *
     A            RSFIRM      0003S 0
     A                                      COLHDG('Firma')
     A            RSBUNT      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bunt-nr.')
     A                                      COLHDG('Bunt')
     A            RSREID      0001A
     A                                      TEXT('Status')
     A                                      COLHDG('St')
     A            RSSTAT      0001A
     A                                      TEXT('U=Utgått')
     A                                      COLHDG('U')
     A            RSRAAR      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Regnskapsår')
     A                                      COLHDG('År')
     A            RSRPER      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Regnskapsperiode')
     A                                      COLHDG('Per')
     A            RSFØRS      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Første')
     A                                      COLHDG('Først')
     A            RSSIST      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Siste')
     A            RSPDAT          L
     A                                      TEXT('Postert dato')
     A                                      COLHDG('Dato')
E5.30A            RSBSUM      0013S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Bunt-sum')
E5.30A            RSPSUM      0013S 2
     A                                      EDTCDE(M)
     A                                      COLHDG('Postert sum')
E5.30A            RSPDEB      0013S 2
     A                                      EDTCDE(M)
     A                                      TEXT('Postert debet')
     A                                      COLHDG('Postert deb')
E5.30A            RSPKRE      0013S 2
     A                                      EDTCDE(M)
     A                                      TEXT('Postert kredit')
     A                                      COLHDG('Postert kre')
6.2H A            RSPTYP      0010A
6.2H A                                      TEXT('Posteringstype')
6.2H A                                      COLHDG('Post.type')
6.11  *
6.11 A            RSEDAT          L         TEXT('Endringsdato')
6.11 A                                      COLHDG('Endr.dat')
6.11  *
6.11 A            RSETIM          T         TEXT('Endringstidspunkt')
6.11 A                                      COLHDG('Endr.tid')
6.11  *
6.11 A            RSEUSR        10A         TEXT('Endret av')
6.11 A                                      COLHDG('Endret av')
      *
6.30  *   Nye felt for java (Feiltrans)
      *
6.30 A            RX1IST      0001A
6.30 A                                      TEXT('Status')
6.30 A                                      COLHDG('St')
6.30  *
6.30 A            RX1EMB      0010A
6.30 A                                      TEXT('Member')
6.30 A                                      COLHDG('Mb')
6.30  *
6.30 A            RX1GRP      0003A
6.30 A                                      COLHDG('Filegruppe')
6.30 A            RX1FIR      0003S 0
6.30 A                                      COLHDG('Firma')
6.30 A            RX1UNT      0005S 0
6.30 A                                      EDTCDE(Z)
6.30 A                                      TEXT('Bunt-nr.')
6.30 A                                      COLHDG('Bunt')
6.30 A            RX1INJ      0005S 0
6.30 A                                      EDTCDE(Z)
6.30 A                                      TEXT('Linje-nr.')
6.30 A                                      COLHDG('Linje-nr.')
6.30 A            RX1IVO      0001A
6.30 A                                      TEXT('Status')
6.30 A                                      COLHDG('Status')
6.30 A            RX1IV1      0001A
6.30 A                                      TEXT('Status')
6.30 A                                      COLHDG('Status')
6.30 A            RXBELØ      0011S 2
6.30 A                                      EDTCDE(4)
6.30 A                                      COLHDG('Beløp')
6.NU A            RXREFN      0008S 0
6.30 A                                      EDTCDE(Z)
6.30 A                                      TEXT('Referanse-nr.')
6.30 A                                      COLHDG('Refnr.')
6.2F A            RX1MSG      0050A
6.2F A                                      TEXT('Tekst ')
6.2F A                                      COLHDG('Tekst ')
6.30 A            RX1TEL      0005S 0
6.30 A                                      EDTCDE(Z)
6.30 A                                      TEXT('Teller')
6.30 A                                      COLHDG('Teller')
      *
6.31  *   Nye felt for java (Feiltrans, del 2)
      *
6.31 A            RZ1IST      0001A
6.31 A                                      TEXT('Status')
6.31 A                                      COLHDG('St')
6.31  *
6.31 A            RZ2IST      0001A
6.31 A                                      TEXT('Status')
6.31 A                                      COLHDG('St')
6.31  *
6.31 A            RZ1EMB      0010A
6.31 A                                      TEXT('Member')
6.31 A                                      COLHDG('Mb')
6.31  *
6.31 A            RZ1FIR      0003S 0
6.31 A                                      COLHDG('Firma')
6.31 A            RZ1UNT      0005S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      TEXT('Bunt-nr.')
6.31 A                                      COLHDG('Bunt')
6.31 A            RZ1INJ      0005S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      TEXT('Linje-nr.')
6.31 A                                      COLHDG('Linje-nr.')
6.31 A            RZ1KTO      0006S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      TEXT('Konto')
6.31 A                                      COLHDG('Konto')
6.31 A            RZBELP      0011S 2
6.31 A                                      EDTCDE(K)
6.31 A                                      COLHDG('Beløp')
6.NU A            RZREFN      0008S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      TEXT('Referanse-nr.')
6.31 A                                      COLHDG('Refnr.')
6.NU A            RZDILN      0008S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      COLHDG('D.bilagsnr  ')
6.31 A            RZDBEL      0011S 2
6.31 A                                      EDTCDE(K)
6.31 A                                      COLHDG('D.restbel')
6.31 A            RZDNRE      0011S 2
6.31 A                                      EDTCDE(K)
6.31 A                                      COLHDG('D.nyrestb')
6.NU A            RZKILN      0008S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      COLHDG('K.bilagsnr  ')
6.31 A            RZKBEL      0011S 2
6.31 A                                      EDTCDE(K)
6.31 A                                      COLHDG('K.restbel')
6.31 A            RZKNRE      0011S 2
6.31 A                                      EDTCDE(K)
6.31 A                                      COLHDG('K.nyrestb')
6.31 A            RZKUND      0006S 0
6.31 A                                      TEXT('Kund/Lev')
6.31 A                                      COLHDG('Kund/Lev')
6.31 A            RZBILD    R               REFFLD(RÅEDAT)
6.31 A                                      COLHDG('Bilagsdto')
6.31 A            RZTIST          Z
6.31 A                                      TEXT('Post. timestamp')
6.31 A                                      COLHDG('Post' 't-stamp')
6.31 A            RZWVLG         1A
6.31 A                                      COLHDG('Diff kode')
6.31 A*************
      *
6.2G  *   Nye felt for Avkryssingstest - register
6.2G  *
6.2G A            RX2IST      0001A
6.2G A                                      TEXT('Status')
6.2G A                                      COLHDG('St')
6.2G  *
6.2G A            RX2EMB      0010A
6.2G A                                      TEXT('Member')
6.2G A                                      COLHDG('Mb')
6.2G  *
6.2G A            RX2GRP      0003A
6.2G A                                      COLHDG('Filegruppe')
6.2G A            RX2FIR      0003S 0
6.2G A                                      COLHDG('Firma')
6.2G A            RX2UNT      0005S 0
6.2G A                                      EDTCDE(Z)
6.2G A                                      TEXT('Bunt-nr.')
6.2G A                                      COLHDG('Bunt')
6.2G A            RX2RAA      0004S 0
6.2G A                                      EDTCDE(Z)
6.2G A                                      TEXT('Regnskapsår')
6.2G A                                      COLHDG('År')
6.NU A            RX2REF      0008S 0
6.2G A                                      EDTCDE(Z)
6.2G A                                      TEXT('RefNr.')
6.2G A                                      COLHDG('RefNr.')
6.2G A            RX2RST      0011S 2       EDTCDE(4)
6.2G A                                      TEXT('Restbeløp')
6.2G A                                      COLHDG('Restbeløp')
6.2G A            RX2BEL      0011S 2
6.2G A                                      EDTCDE(4)
6.2G A                                      COLHDG('Oppr.beløp')
      *
      *   Registrering,transaksjoner RTRAPF (RT)
      *
6.11 A            RTNIVO      0001A
6.11 A                                      TEXT('Status')
6.11 A                                      COLHDG('St')
6.11  *
6.11 A            RTMEMB      0010A
6.11 A                                      TEXT('Member')
6.11 A                                      COLHDG('Mb')
6.11  *
6.18 A            RTFGRP      0003A
6.18 A                                      COLHDG('Filegruppe')
     A            RTFIRM      0003S 0
     A                                      COLHDG('Firma')
     A            RTBUNT      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bunt-nr.')
     A                                      COLHDG('Bunt')
     A            RTLINJ      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Linje-nr.')
     A                                      COLHDG('Linje')
     A            RTREID      0001A
     A                                      TEXT('Status')
     A                                      COLHDG('St')
     A            RTSTAT      0001A
     A                                      TEXT('Buntstatus')
     A                                      COLHDG('St')
     A            RTBDAT          L
     A                                      TEXT('Bilags-dato')
     A                                      COLHDG('B.dato')
     A            RTBELØ      0011S 2
     A                                      EDTCDE(4)
     A                                      COLHDG('Beløp')
6.18 A            RTBELO      0011S 2
6.18 A                                      EDTCDE(4)
6.18 A                                      COLHDG('Beløp')
     A            RTGMVA      0011S 2
     A                                      EDTCDE(4)
     A                                      COLHDG('Gr.lag mva')
     A            RTRAAR      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Regnskapsår')
     A                                      COLHDG('År')
     A            RTRPER      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Regnskapsperiode')
     A                                      COLHDG('Per')
6.NU A            RTBILN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagsnr.')
     A                                      COLHDG('Bilag')
     A            RTBILL      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagslinje')
     A                                      COLHDG('Bilag' 'linje')
     A            RTDAVD      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Debet avd.')
     A                                      COLHDG('D.avd')
     A            RTDKTO      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Debet konto')
     A                                      COLHDG('D.konto')
     A            RTDSPS      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Debet bærer')
     A                                      COLHDG('D.Bær')
     A            RTDMVA      0001A
     A                                      TEXT('Debet mva')
     A                                      COLHDG('D.MVA')
     A            RTCAVD      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kredit avd.')
     A                                      COLHDG('K.avd')
     A            RTCKTO      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kredit konto')
     A                                      COLHDG('K.konto')
     A            RTCSPS      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kredit bærer')
     A                                      COLHDG('K.Bær')
     A            RTCMVA      0001A
     A                                      TEXT('Kredit mva')
     A                                      COLHDG('K.MVA')
6.22 A            RTPROS    R               REFFLD(RÅPROA)
6.22 A            RTUPRO    R               REFFLD(RÅUPRO)
6.22 A            RTARBO    R               REFFLD(RÅARBO)
6.22 A            RTAKTI    R               REFFLD(RÅAKTI)
6.NU A            RTREFN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Referanse-nr.')
     A                                      COLHDG('Refnr.')
     A            RTFDAT          L
     A                                      TEXT('Forfalls-dato')
     A                                      COLHDG('Forfal')
     A            RTKRAB      0005S 2
     A                                      EDTCDE(4)
     A                                      TEXT('Kontant-rabatt')
     A                                      COLHDG('Rabatt')
     A            RTVALK      0003A
     A                                      TEXT('Valuta-kode')
     A                                      COLHDG('Val' 'kod')
     A            RTVALB      0011S 2
     A                                      EDTCDE(4)
     A                                      TEXT('Valuta-beløp')
     A                                      COLHDG('Val.beløp')
     A            RTMNGD      0009S 2
     A                                      EDTCDE(4)
     A                                      COLHDG('Mengde')
     A            RTMNGK      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Mengde kode')
     A                                      COLHDG('Men' 'kod')
     A            RTRESN      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kontonr.(Reskontro)  ')
     A                                      COLHDG('Konto')
     A            RTRESS      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RTRESA      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A            RTRESM      0001A
     A                                      TEXT('MVA-kode')
     A                                      COLHDG('MVA')
     A            RTVIRK      0002A
     A                                      TEXT('Virksomhet')
     A                                      COLHDG('Vir')
     A            RTATTE      0001A
     A                                      TEXT('Attestasjonskode')
     A                                      COLHDG('At')
T5.50A            RTATTU      0010A
     A                                      TEXT('Attestert av (User-ID).')
     A                                      COLHDG('Attestert' 'av')
T5.50A            RTADAT          L
     A                                      TEXT('Att.dato')
     A                                      COLHDG('Att.dato')
     A            RTKRYS      0001A
     A                                      TEXT('Avkryssing')
     A                                      COLHDG('Av')
     A            RTKIDI      0025A
     A                                      COLHDG('Kundeident')
T5.50 *
6.35 A            RTKIDR      0008S 0       TEXT('Kidd referansenr')
T5.50A                                      COLHDG('Kidd' 'Ref')
T5.50A                                      EDTCDE(Z)
T5.50 *
T5.50A            RTKSIF      0001S 0       TEXT('Kontroll-siffer')
T5.50A                                      COLHDG('Kont' 'Siff')
T5.50A                                      EDTCDE(Z)
T5.50 *
T5.50A            RTKID2      0025A         TEXT('Kiddnummer 2')
T5.50A                                      COLHDG('Kidd-2')
T5.50 *
     A            RTBILK      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagskode')
     A                                      COLHDG('Bk')
     A            RTTEXT      0020A
     A                                      COLHDG('Bilagstekst')
     A            RTBETB      0002S 0
     A                                      TEXT('Betalingsbet.')
     A                                      COLHDG('Bet' 'bet')
     A            RTBREF      0012A
     A                                      TEXT('Bank-referanse')
     A                                      COLHDG('Bank-ref.')
E5.40A            RTLFAK      0015A
T5.20A                                      TEXT('Lev.fakturanr.')
T5.20A                                      COLHDG('Lev.fakt.')
     A            RTDECK      0006A
     A                                      TEXT('Deklarasjonskode')
     A                                      COLHDG('Deklk.')
     A            RTAUTX      0001A
     A                                      TEXT('Saldert/Krysset = K')
     A                                      COLHDG('Sa')
     A            RTBLDE      0001A
     A                                      TEXT('Registreringsbilde')
     A                                      COLHDG('Rb')
T5.50A            RTBONG      0012A
T5.50A                                      COLHDG('Bongnummer')
6.SS A            RTHENT      0001A         COLHDG('Hentet')
6.SS A            RTHUID      0036A         COLHDG('U_Id')
      *
     A            RTEDAT          L         TEXT('Endr.dato')
     A                                      COLHDG('Endr.dto')
      *
     A            RTETIM          T         TEXT('Endr.kl.')
     A                                      COLHDG('Endr.Kl')
      *
     A            RTEUSR      0010A         TEXT('Endret av (User-ID).')
     A                                      COLHDG('Endret av')
      *
      *   Reg. transaksjoner      RJOUPF    (RJ)
      *               i journal-kjøring
6.11 A            RJNIVO      0001A
6.11 A                                      TEXT('Status')
6.11 A                                      COLHDG('St')
6.11  *
6.11 A            RJMEMB      0010A
6.11 A                                      TEXT('Member')
6.11 A                                      COLHDG('Mb')
6.11  *
     A            RJREID      0001A
     A                                      TEXT('Rec.id.= H,K,L og P ')
     A                                      COLHDG('St')
     A            RJFIRM      0003S 0
     A                                      COLHDG('Firma')
     A            RJKONT      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Konto')
     A                                      COLHDG('Konto')
     A            RJSPES      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RJAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A            RJMVAP      0002S 0
     A                                      TEXT('MVA-periode')
     A                                      COLHDG('MVAp')
     A            RJMMRK      0001A
     A                                      TEXT('Mvaoppgjør merke')
     A                                      COLHDG('Mm')
     A            RJBDAT          L
     A                                      TEXT('Bilags-dato')
     A                                      COLHDG('B.dato')
6.NU A            RJBILN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagsnr.')
     A                                      COLHDG('Bilag')
     A            RJBILL      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagslinje')
     A                                      COLHDG('Bilag' 'linje')
     A            RJDBKR      0001A
     A                                      TEXT('Debet/Kredit (D/K)')
     A                                      COLHDG('D/K')
     A            RJBILK      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagskode')
     A                                      COLHDG('Bk')
     A            RJTEXT      0020A
     A                                      COLHDG('Bilagstekst')
7.nx A            RJNETO      0013S 2
     A                                      EDTCDE(4)
     A                                      TEXT('Netto til konto')
     A                                      COLHDG('Netto')
7.nx A            RJMVAG      0013S 2
     A                                      EDTCDE(4)
     A                                      TEXT('MVA Grunnlag')
     A                                      COLHDG('MVA Grl')
     A            RJAMVA      0005S 2
     A                                      EDTCDE(4)
     A                                      TEXT('Andel MVA i %')
     A                                      COLHDG('Andel %')
     A            RJPMVA      0005S 2
     A                                      EDTCDE(4)
     A                                      TEXT('MVA-prosent')
     A                                      COLHDG('MVA %')
     A            RJMVAB      0011S 2
     A                                      EDTCDE(4)
     A                                      TEXT('Beregnet mva')
     A                                      COLHDG('Ber. mva')
     A            RJPIVA      0005S 2
     A                                      EDTCDE(4)
     A                                      TEXT('IVA-prosent')
     A                                      COLHDG('IVA %')
     A            RJIAVG      0011S 2
     A                                      EDTCDE(4)
     A                                      TEXT('Beregnet inv.avg.')
     A                                      COLHDG('Inv.avg.')
     A            RJSTAR      0001A
     A                                      TEXT('Overstyrt mva')
     A                                      COLHDG('Om')
     A            RJMVAK      0001A
     A                                      TEXT('MVA-kode')
     A                                      COLHDG('MVA')
     A            RJFEIK      0001A
     A                                      TEXT('Saldering')
     A                                      COLHDG('Sa')
     A            RJATTE      0001A
     A                                      TEXT('Attestert')
     A                                      COLHDG('At')
T5.50A            RJATTU      0010A
     A                                      TEXT('Attestert av (User-ID).')
     A                                      COLHDG('Attestert' 'av')
T5.50A            RJADAT          L
     A                                      TEXT('Att.dato')
     A                                      COLHDG('Att.dato')
     A            RJTYPE      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Vanlig/Automatisk')
     A                                      COLHDG('V/A')
     A            RJRAAR      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Regnskapsår')
     A                                      COLHDG('År')
     A            RJRPER      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Regnskapsperiode')
     A                                      COLHDG('Per')
     A            RJBUNT      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bunt-nr.')
     A                                      COLHDG('Bunt.')
     A            RJLINJ      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Linje-nr.')
     A                                      COLHDG('Linje')
6.NU A            RJREFN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Referanse-nr.')
     A                                      COLHDG('Refnr.')
     A            RJFDAT          L
     A                                      TEXT('Forfalls-dato')
     A                                      COLHDG('Forfal')
     A            RJOPDT      0001A
     A                                      TEXT('Oppdatert (U=Ja)')
     A                                      COLHDG('O')
6.22 A            RJPROS    R               REFFLD(RÅPROA)
6.22 A            RJAKTI    R               REFFLD(RÅAKTI)
6.22 A            RJUPRO    R               REFFLD(RÅUPRO)
6.22 A            RJARBO    R               REFFLD(RÅARBO)
     A            RJVALK      0003A
     A                                      TEXT('Valuta-kode')
     A                                      COLHDG('Val' 'kod')
7.nx A            RJVALB      0013S 2
     A                                      EDTCDE(4)
     A                                      TEXT('Valuta-beløp')
     A                                      COLHDG('Val.beløp')
     A            RJMNGD      0009S 2
     A                                      EDTCDE(4)
     A                                      COLHDG('Mengde')
     A            RJMNGK      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Mengde kode')
     A                                      COLHDG('Men' 'kod')
     A            RJRESN      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kontonr.(reskontro)')
     A                                      COLHDG('Konto')
     A            RJRESS      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RJRESA      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A            RJRESM      0001A
     A                                      TEXT('MVA-kode')
     A                                      COLHDG('MVA')
     A            RJVIRK      0002A
     A                                      TEXT('Virksomhet')
     A                                      COLHDG('Vir')
     A            RJKRYS      0001A
     A                                      TEXT('Avkryssing')
     A                                      COLHDG('Av')
     A            RJRSTB      0011S 2
     A                                      EDTCDE(4)
     A                                      COLHDG('Restbeløp')
     A            RJRSTV      0011S 2
     A                                      EDTCDE(4)
     A                                      TEXT('Restbeløp - valuta')
     A                                      COLHDG('Rest valuta')
     A            RJBETB      0002S 0
     A                                      TEXT('Betalingsbet.')
     A                                      COLHDG('Bet' 'bet')
     A            RJBREF      0012A
     A                                      TEXT('Bank-referanse')
     A                                      COLHDG('Bank-ref.')
E5.40A            RJLFAK      0015A
T5.20A                                      TEXT('Lev.fakturanr.')
T5.20A                                      COLHDG('Lev.fakt.')
     A            RJKIDI      0025A
     A                                      COLHDG('Kundeident.')
T5.50 *
6.35 A            RJKIDR      0008S 0       TEXT('Kidd referansenr')
T5.50A                                      COLHDG('Kidd' 'Ref')
T5.50A                                      EDTCDE(Z)
T5.50 *
T5.50A            RJKSIF      0001S 0       TEXT('Kontroll-siffer')
T5.50A                                      COLHDG('Kont' 'Siff')
T5.50A                                      EDTCDE(Z)
T5.50 *
T5.50A            RJKID2      0025A         TEXT('Kiddnummer 2')
T5.50A                                      COLHDG('Kidd-2')
T5.50 *
     A            RJDECK      0006A
     A                                      TEXT('Deklarasjonskode')
     A                                      COLHDG('Deklk')
     A            RJJOUR      0005S
     A                                      TEXT('Journal-nr')
     A                                      COLHDG('Jou.nr')
     A            RJBLDE      0001A
     A                                      TEXT('Registreringsbilde')
     A                                      COLHDG('Rb')
T5.50A            RJBONG      0012A
T5.50A                                      COLHDG('Bongnummer')
     A            RJOVFN      0005S
     A                                      TEXT('Overførings-nr.')
     A                                      COLHDG('Ovfnr')
     A            RJFLGR      0003A
     A                                      TEXT('File-GRUPPE')
     A                                      COLHDG('GRP')
6.12 A            RJSPOR      0010S 0
6.12 A                                      TEXT('Spor.ref.')
6.12 A                                      COLHDG('Spor.ref.')
6.36 A            RJSORT      0044A
     A                                      COLHDG('Sorteringsrekkefølge')
6.11  *
6.11 A            RJEDAT          L         TEXT('Endr.dato')
6.11 A                                      COLHDG('Endr.dto')
6.11  *
6.11 A            RJETIM          T         TEXT('Endr.kl.')
6.11 A                                      COLHDG('Endr.Kl')
6.11  *
6.11 A            RJEUSR      0010A         TEXT('Endret av (User-ID).')
6.11 A                                      COLHDG('Endret av')
      *
      *   PROSJEKT POSTERINGER    RPTRPF    (RD)
      *
     A            RDFIRM      0003S 0
     A                                      COLHDG('Firma')
6.22 A            RDPROS    R               REFFLD(RÅPROS)
6.22 A            RDAKTI    R               REFFLD(RÅAKTI)
     A            RDKONT      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A            RDSPES      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RDAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A            RDRAAR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('År')
     A            RDRPER      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Regnskapsperiode')
     A                                      COLHDG('Per')
     A            RDBDAT          L
     A                                      TEXT('Bilags-dato')
     A                                      COLHDG('Bil' 'dat')
6.NU A            RDBILN      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagsnr.')
     A                                      COLHDG('Bilag')
     A            RDBILK      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagskode')
     A                                      COLHDG('Bk')
     A            RDTEXT      0020A
     A                                      COLHDG('Bilagstekst')
     A            RDNETO      0011S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Nettobeløp')
     A            RDMNGK      0002S 0
     A                                      TEXT('Mengdekode')
     A                                      COLHDG('Men' 'kod')
     A            RDMNGD      0011S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Mengde')
     A            RDJOUR      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Journal-nr.')
     A                                      COLHDG('Journ')
     A            RDRESN      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Reskontro-nr.')
     A                                      COLHDG('Konto')
     A            RDTIST          Z
     A                                      TEXT('Post. timestamp')
     A                                      COLHDG('Post' 't-stamp')
6.10 A            RDODAT    R               REFFLD(RÅODAT)
6.10 A            RDOTIM    R               REFFLD(RÅOTIM)
6.10 A            RDOUSR    R               REFFLD(RÅOUSR)
6.10 A            RDEDAT    R               REFFLD(RÅEDAT)
6.10 A            RDETIM    R               REFFLD(RÅETIM)
6.10 A            RDEUSR    R               REFFLD(RÅEUSR)
      *
      *   REFERANSE-REGISTER      RRF0PF    (RR)
      *
     A            RR0FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RR0RAP      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rapport-nr.')
     A                                      COLHDG('Rap')
     A            RR0TXT      0040A
     A                                      COLHDG('Rapport-tekst')
     A            RR0BFJ      0001A
     A                                      VALUES('B' 'F')
     A                                      CHKMSGID(RMA0710 *LIBL/QMFOKON)
     A                                      TEXT('Sammenliknes med')
     A                                      COLHDG('Sam')
     A            RR0AVV      0001A
     A                                      VALUES('P' 'D')
     A                                      CHKMSGID(RMA0820 *LIBL/QMFOKON)
     A                                      TEXT('Type avvik')
     A                                      COLHDG('Avv.')
     A            RR0HEL      0001A
     A                                      VALUES('H' 'T')
     A                                      CHKMSGID(RMA0830 *LIBL/QMFOKON)
     A                                      TEXT('Beløp skrives')
     A                                      COLHDG('Bel.')
     A            RR0DAT    R               REFFLD(RÅEDAT)
     A            RR0TIM    R               REFFLD(RÅETIM)
     A            RR0USR    R               REFFLD(RÅEUSR)
      *
      *   REFERANSE-REGISTER      RRF5PF    (RR)
      *
     A            RR5FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RR5RAP      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rapport-nr.')
     A                                      COLHDG('Rap')
     A            RR5LIN      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Linje-nr.')
     A                                      COLHDG('Linje')
     A            RR5TXT      0040A
     A                                      COLHDG('Linje-tekst')
     A            RR5KOD      0001A
     A                                      VALUES('K' 'B' 'L' 'N' 'S' 'T')
     A                                      CHKMSGID(RMA0720 *LIBL/QMFOKON)
     A                                      TEXT('Summeringskode')
     A                                      COLHDG('Sk')
     A            RR5SLN      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Sammenl. mot linje')
     A                                      COLHDG('Saml.')
     A            RR5NUL      0001A
     A                                      VALUES(' ' 'N')
     A                                      CHKMSGID(RMA0730 *LIBL/QMFOKON)
     A                                      TEXT('Nullstill regneverk')
     A                                      COLHDG('Nul')
     A            RR5ABL      0001A
     A                                      VALUES(' ' '0' '1' '2' '3' 'S')
     A                                      CHKMSGID(RMA0740 *LIBL/QMFOKON)
     A                                      TEXT('Antall blanke')
     A                                      COLHDG('Ab')
     A            RR5BER      0001A
     A                                      VALUES(' ' 'J')
     A                                      TEXT('Beregnet linje')
     A                                      COLHDG('Bl')
     A            RR5DAT    R               REFFLD(RÅEDAT)
     A            RR5TIM    R               REFFLD(RÅETIM)
     A            RR5USR    R               REFFLD(RÅEUSR)
      *
      *   REFERANSE-REGISTER      RRF8PF    (RR)
      *
     A            RR8FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RR8RAP      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rapport-nr.')
     A                                      COLHDG('Rap')
     A            RR8LIN      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Linje-nr.')
     A                                      COLHDG('Linje')
     A            RR8LØP      0003S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Løpe-nr.')
     A                                      COLHDG('Løp')
     A            RR8FKL      0003S 0
     A                                      TEXT('Fra-Firma')
     A                                      COLHDG('FFir')
     A            RR8FKT      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Fra-Konto')
     A                                      COLHDG('FKonto')
     A            RR8FSP      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Fra-Kostnadsbærer')
     A                                      COLHDG('F.bæ')
     A            RR8FAV      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Fra-Avdeling')
     A                                      COLHDG('FAvd')
     A            RR8TKL      0003S 0
     A                                      TEXT('Til-Firma')
     A                                      COLHDG('TFir')
     A            RR8TKT      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Til-Konto')
     A                                      COLHDG('TKonto')
     A            RR8TSP      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Til-Kostnadsbærer')
     A                                      COLHDG('T.bæ')
     A            RR8TAV      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Til-Avdeling')
     A                                      COLHDG('TAvd')
     A            RR8KLF      0001A
     A                                      VALUES('K' 'L')
     A                                      CHKMSGID(RMA0750 *LIBL/QMFOKON)
     A                                      TEXT('Fra Konto/Linje(K/L)')
     A                                      COLHDG('F(K/L)')
     A            RR8LIF      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Fra linje-nr.')
     A                                      COLHDG('FLinje')
     A            RR8MOT      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMA0760 *LIBL/QMFOKON)
     A                                      TEXT('Snu fortegn')
     A                                      COLHDG('Snu')
     A            RR8PRO      0004S 1
     A                                      EDTCDE(K)
     A                                      TEXT('%andel')
     A                                      COLHDG('%and')
     A            RR8DAT    R               REFFLD(RÅEDAT)
     A            RR8TIM    R               REFFLD(RÅETIM)
     A            RR8USR    R               REFFLD(RÅEUSR)
      *
      *  RAPPORT SALDO            RRF9PF    (RR)
      *
     A            RR9FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RR9RAP      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Rapport-nr.')
     A                                      COLHDG('Rap')
     A            RR9LIN      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Linje-nr.')
     A                                      COLHDG('Linje')
     A            RR9AVD      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Avdeling')
     A                                      COLHDG('Avd.')
     A            RR9AAR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('År')
     A            RR9TYP      0001S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Record type')
     A                                      COLHDG('Rt')
     A            RR9TXT      0040A
     A                                      COLHDG('Linje-tekst')
     A            RR9KOD      0001A
     A                                      TEXT('Summeringskode')
     A                                      COLHDG('Sk')
     A            RR9SLN      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Sammenl. mot linje')
     A                                      COLHDG('Saml.')
     A            RR9NUL      0001A
     A                                      TEXT('Nullstill regneverk')
     A                                      COLHDG('Nul')
     A            RR9ABL      0001A
     A                                      TEXT('Antall blanke')
     A                                      COLHDG('Ab')
     A            RR9S01      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 01')
     A                                      COLHDG('Bev. Per 01')
     A            RR9S02      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 02')
     A                                      COLHDG('Bev. Per 02')
     A            RR9S03      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 03')
     A                                      COLHDG('Bev. Per 03')
     A            RR9S04      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 04')
     A                                      COLHDG('Bev. Per 04')
     A            RR9S05      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 05')
     A                                      COLHDG('Bev. Per 05')
     A            RR9S06      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 06')
     A                                      COLHDG('Bev. Per 06')
     A            RR9S07      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 07')
     A                                      COLHDG('Bev. Per 07')
     A            RR9S08      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 08')
     A                                      COLHDG('Bev. Per 08')
     A            RR9S09      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 09')
     A                                      COLHDG('Bev. Per 09')
     A            RR9S10      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 10')
     A                                      COLHDG('Bev. Per 10')
     A            RR9S11      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 11')
     A                                      COLHDG('Bev. Per 11')
     A            RR9S12      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 12')
     A                                      COLHDG('Bev. Per 12')
     A            RR9S13      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Bevegelse Periode 13')
     A                                      COLHDG('Bev. Per 13')
     A            RR9S00      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Saldo 01.01.')
     A                                      COLHDG('Saldo 01.01')
     A            RR9DPR      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Denne periode')
     A                                      COLHDG('Denne per')
     A            RR9HIA      0013S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Hittil i år')
      *
      *   Overføring til PC-produkter        (RP)
      *
     A            RR9PER      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Regnskapsperiode')
     A                                      COLHDG('Per')
     A            RRFPÅR      0013S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Denne periode i år')
     A                                      COLHDG('Denne per i år')
     A            RRFTÅR      0013S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Hittil i år')
     A            RRBPÅR      0013S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Periodebudsjett i år')
     A                                      COLHDG('Per.buds. i år')
     A            RRBTÅR      0013S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Budsjett hittil i år')
     A                                      COLHDG('Budsj hit i år')
     A            RRFPFJ      0013S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Periodebudsj. i fjor')
     A                                      COLHDG('Per.bud. i fjor')
     A            RRFTFJ      0013S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Budsj. hittil i fjor')
     A                                      COLHDG('Bud. hit i fjor')
      *
      *   Overføring til FINALE    RPC4PF    (RP)
      *
     A            RPCFIN      0057A
     A                                      COLHDG('Hele utvekslingsfelt')
      *
      *   Overføring til TOTAL     RPC4PF    (RP)
      *
     A            RPCTOT      0091A
     A                                      COLHDG('Hele utvekslingsfelt')
      *
      *   Overføring til MAESTRO   RPC6PF    (RP)
      *             og MAX Årsoppgjør
      *
     A            RPCMAX      0080A
     A                                      COLHDG('Hele utvekslingsfelt')
      *
      *   Overføring til ASOKON    RPCIPF    (RP)
      *             fra eksterne
      *
     A            RPCIN1      0256A
     A                                      COLHDG('1/3 utvekslingsfelt ')
     A            RPCIN2      0256A
     A                                      COLHDG('1/3 utvekslingsfelt ')
     A            RPCIN3      0256A
     A                                      COLHDG('1/3 utvekslingsfelt ')
      *
      *   Overføring til TRIOPLAN  RPCAPF    (RP)
      *
     A            RIUKTO      0007S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A            RIUAVD      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling')
      *
      *   Kiddinformasjon v/scann   RKIDPF  (RY)
      *
     A            RYFIRM      0003S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
      *
6.NU A            RYBILN      0008S 0       TEXT('Bilagsnr')
     A                                      COLHDG('Bilagnr')
      *
     A            RYRAAR      0004S 0       TEXT('Årstall')
     A                                      COLHDG('År')
      *
     A            RYRPER      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Periode')
     A                                      COLHDG('Per.')
      *
     A            RYFDAT    R               REFFLD(RÅEDAT)
     A                                      TEXT('Forfall')
     A                                      COLHDG('Forf.')
      *
     A            RYBDAT    R               REFFLD(RÅEDAT)
     A                                      TEXT('Bilag')
     A                                      COLHDG('Bilag')
      *
     A            RYRESN      0006  0       TEXT('Rskontro')
     A                                      COLHDG('Resk')
     A                                      EDTCDE(K)
      *
T550 A            RYBENR      0006  0       TEXT('Rekv.nr')
T550 A                                      COLHDG('Rekv.nr')
T550  *
     A            RYLFAK      0020A         TEXT('Lev. fakt.')
     A                                      COLHDG('Levf')
      *
     A            RYBELO      0011S 2       TEXT('Beløp')
     A                                      COLHDG('Beløp')
      *
     A            RYKIDD      0025A         TEXT('Kiddnummer')
     A                                      COLHDG('Kidd')
6.10  *
6.10 A            RYFLOW      0010A         TEXT('Navn Flow')
6.10 A                                      COLHDG('Navn Flow')
6.10  *
6.10 A            RYKOMM      0030A         TEXT('Kommentarer')
6.10 A                                      COLHDG('Kommentarer')
      *
6.10 A            RYODAT    R               REFFLD(RÅODAT)
6.10 A            RYOTIM    R               REFFLD(RÅOTIM)
6.10 A            RYOUSR    R               REFFLD(RÅOUSR)
     A            RYEDAT    R               REFFLD(RÅEDAT)
     A            RYETIM    R               REFFLD(RÅETIM)
     A            RYEUSR    R               REFFLD(RÅEUSR)
      *
      *   SUMMERINGS-REGISTER BILAG RZUMPF  (RZ)
      *
     A            RZFIRM      0003S 0
     A                                      COLHDG('Firma')
     A            RZRAAR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('År')
6.NU A            RZBILN      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagsnummer.nytt' )
     A            RZBDAT          L
     A                                      COLHDG('Bilags-dato')
     A            RZTELL      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Post-nr.')
6.NU A            RZBILG      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bilagsnummer.gmlt')
     A            RZBILL      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagslinje')
     A                                      COLHDG('Bilag' 'linje')
     A            RZBELØ      0011S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Beløp')
     A            RZMVAG      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('MVA Grunnlag')
     A                                      COLHDG('MVA Grl')
     A            RZAMVA      0005S 2
     A                                      EDTCDE(4)
     A                                      TEXT('Andel MVA i %')
     A                                      COLHDG('Andel %')
     A            RZPMVA      0005S 2
     A                                      EDTCDE(4)
     A                                      TEXT('MVA-prosent')
     A                                      COLHDG('MVA %')
     A            RZMVAB      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Beregnet mva')
     A                                      COLHDG('MVA-Beløp')
     A            RZMVAK      0001A
     A                                      TEXT('MVA-kode')
     A                                      COLHDG('MVA')
     A            RZPIVA      0005S 2
     A                                      EDTCDE(4)
     A                                      TEXT('IVA-prosent')
     A                                      COLHDG('IVA %')
     A            RZINVB      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Investeringsavgift')
     A                                      COLHDG('Inv.avg.')
     A            RZVALK      0003A
     A                                      TEXT('Postert valuta')
     A                                      COLHDG('Val' 'kod')
     A            RZVALB      0011S 2
     A                                      EDTCDE(K)
     A                                      TEXT('Valutabeløp')
     A                                      COLHDG('Valutabeløp')
     A            RZMNGK      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Mengdekode')
     A                                      COLHDG('Men' 'kod')
     A            RZMNGD      0011S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Mengde')
     A            RZKONT      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A            RZSPES      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLHDG('Bærer')
     A            RZAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling')
6.22 A            RZPROS    R               REFFLD(RÅPROA)
6.22 A            RZAKTI    R               REFFLD(RÅAKTI)
     A            RZRESN      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Reskontrokonto')
T5.50A            RZBONG      0012A         TEXT('Bongnr')
T5.50A                                      COLHDG('Bongnummer')
6.10 A            RZODAT    R               REFFLD(RÅODAT)
6.10 A            RZOTIM    R               REFFLD(RÅOTIM)
6.10 A            RZOUSR    R               REFFLD(RÅOUSR)
6.10 A            RZEDAT    R               REFFLD(RÅEDAT)
6.10 A            RZETIM    R               REFFLD(RÅETIM)
6.10 A            RZEUSR    R               REFFLD(RÅEUSR)
      *
      * Saksregister inkasso    RCBFPF    (RC)
      *
     A            RCNFIR      0003S 0
     A                                      COLHDG('Firma')
     A            RCNSTA      0001A
     A                                      TEXT('Status')
     A                                      COLHDG('St')
     A            RCNASK      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kunde')
6.30 A            RCNASB      0008S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilag-nr.')
     A                                      COLHDG('Bilag')
     A            RCBDAT          L
     A                                      TEXT('Bilags-dato')
     A                                      COLHDG('B.dato')
     A            RCNCNK      0012A
     A                                      TEXT('Kunde-id'   )
     A                                      COLHDG('Kunde-id')
     A            RCNREF      0020A
     A                                      COLHDG('Kunde-referanse     ')
     A            RCNSAK      0008A
     A                                      TEXT('Saks-nr.')
     A                                      COLHDG('Saks-nr.')
     A            RCNSTO      0010S 2
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedstol')
     A            RCNOMK      0010S 2
     A                                      EDTCDE(Z)
     A                                      COLHDG('Omkostninger')
     A            RCNRNT      0010S 2
     A                                      EDTCDE(Z)
     A                                      COLHDG('Renter')
     A            RCNPRV      0010S 2
     A                                      EDTCDE(Z)
     A                                      COLHDG('Provisjon')
     A            RCNDAT          L
     A                                      TEXT('Dato(inbet/avslut)')
     A                                      COLHDG('Dato(I/A)')
     A            RCNAVR      0001A
     A                                      VALUES('N' 'J')
     A                                      TEXT('Avdrag')
     A                                      COLHDG('Av')
     A            RCNOVÅ      0001A
     A                                      VALUES('N' 'J')
     A                                      TEXT('Overvåkning')
     A                                      COLHDG('Ov')
     A            RCNLED      0020A
     A                                      COLHDG('Kundens info')
     A            RCNINB      0011S 2
     A                                      EDTCDE(Z)
     A                                      TEXT('Innbetalt i reskont.')
     A                                      COLHDG('Innbetalt')
     A            RCNINR      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Inkassovarsel-nr.')
     A                                      COLHDG('Varsel')
      *
      *   Forsendelse (grunnlag)            (RC)
      *
7.nx A**          RCNS80      0080A
7.nx A            RCN130      0130A
     A                                      COLHDG('Post-format')
      *
      *   STATUSRECORD            RCA0PF    (RC)
      *
      *   Faste opplysninger for inkassobyrå
      *
     A            RC0FIR      0003S 0
     A                                      COLHDG('Firma')
     A            RC0TXT      0020A
     A                                      COLHDG('Beskrivelse')
     A            RC0CNK      0012A
     A                                      TEXT('Kundenr.')
     A                                      COLHDG('Kundenr')
     A            RC0RNT      0004S 2
     A                                      EDTCDE(Z)
     A                                      TEXT('Rentesats')
     A                                      COLHDG('Rente')
     A            RC0INR      0005S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Inkassovarsel-nr.')
     A                                      COLHDG('Varsel')
     A            RC0BIK      0002S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Bilagskode innbet.')
     A                                      COLHDG('Bk')
     A            RC0KTO      0006S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Mellomregn. konto')
     A                                      COLHDG('Konto')
     A            RC0SPS      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Mellomregn. bærer')
     A                                      COLHDG('Bærer')
     A            RC0AVD      0004S 0
     A                                      EDTCDE(Z)
     A                                      TEXT('Mellomregn. avd.')
     A                                      COLHDG('Avd.')
     A            RC0PRT      0001A
     A                                      VALUES('N' 'J')
     A                                      TEXT('Poster renter')
     A                                      COLHDG('Pr')
     A            RC0DAT    R               REFFLD(RÅEDAT)
     A            RC0TIM    R               REFFLD(RÅETIM)
     A            RC0USR    R               REFFLD(RÅEUSR)
      *
      * Parameter hovedbok
      *
     A            RHPFIR      0003S
     A                                      COLHDG('Firma')
     A            RHPNAV      0030A
     A                                      COLHDG('Firmanavn')
     A            RHPUSR      0010A
     A                                      COLHDG('Bruker')
     A            RHPAVF      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling fra:')
     A            RHPAVT      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling til:')
     A            RHPBÆF      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kost.bærer grp.fra:')
     A            RHPBÆT      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kost.bærer grp.til:')
     A            RHPBØF      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kost.bærer fra:')
     A            RHPBØT      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kost.bærer til:')
     A            RHPKTF      0005S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto fra:')
     A            RHPKTT      0005S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto til:')
     A            RHPKSP      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMH0010 *LIBL/QMFOKON)
     A                                      COLHDG('Konto sperret')
     A            RHPKKS      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMH0010 *LIBL/QMFOKON)
     A                                      COLHDG('Kontoklasse skrives')
     A            RHPKGS      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMH0010 *LIBL/QMFOKON)
     A                                      COLHDG('Kontogruppe skrives')
     A            RHPAVS      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMH0010 *LIBL/QMFOKON)
     A                                      COLHDG('Avdeling skrives')
     A            RHPSRT      0001A
     A                                      VALUES('A' 'K' 'B')
     A                                      CHKMSGID(RMH0020 *LIBL/QMFOKON)
     A                                      COLHDG('Sortering')
     A            RHPKDA      0006S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kjøredato')
     A            RHPRÅR      0004S
     A                                      EDTCDE(Z)
     A                                      COMP(GE 1984)
     A                                      CHKMSGID(RMH0050 *LIBL/QMFOKON)
     A                                      COLHDG('Regnskapsår')
     A            RHPPER      0002S
     A                                      EDTCDE(Z)
     A                                      COMP(LE 13)
     A                                      CHKMSGID(RMH0040 *LIBL/QMFOKON)
     A                                      COLHDG('Periode')
     A            RHPPEF      0002S
     A                                      EDTCDE(Z)
     A                                      COMP(LE 13)
     A                                      CHKMSGID(RMH0040 *LIBL/QMFOKON)
     A                                      COLHDG('Periode fra:')
     A            RHPPET      0002S
     A                                      EDTCDE(Z)
     A                                      COMP(LE 13)
     A                                      CHKMSGID(RMH0040 *LIBL/QMFOKON)
     A                                      COLHDG('Periode til:')
     A            RHPK01      0005S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto valg 01:')
     A            RHPKTU      0001A
     A                                      VALUES(' ' 'U')
     A                                      CHKMSGID(RMH0030 *LIBL/QMFOKON)
     A                                      COLHDG('Konto untatt:')
     A            RHPSPS      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Bærer')
     A            RHPSML      0001A
     A                                      VALUES('B' 'F' 'G')
     A                                      CHKMSGID(RMH0100 *LIBL/QMFOKON)
     A                                      COLHDG('Sammenligning')
     A            RHPAVV      0001A
     A                                      VALUES('P' 'D')
     A                                      CHKMSGID(RMH0110 *LIBL/QMFOKON)
     A                                      COLHDG('Avvik')
     A            RHPBLK      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMH0010 *LIBL/QMFOKON)
     A                                      COLHDG('Beløpskontroll')
     A            RHPTYP      0001A
     A                                      VALUES('B' 'R' 'A' 'P' 'F')
     A                                      CHKMSGID(RMH0180 *LIBL/QMFOKON)
     A                                      COLHDG('Datatype')
     A            RHPMVA      0001S
     A                                      EDTCDE(Z)
     A                                      VALUES(1 2 3 4 5 6)
     A                                      CHKMSGID(RMH0120 *LIBL/QMFOKON)
     A                                      COLHDG('MVA-periode')
     A            RHPMV0      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMH0270 *LIBL/QMFOKON)
     A                                      COLHDG('MVA-kode 0')
     A            RHPOMK      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMH0270 *LIBL/QMFOKON)
     A                                      COLHDG('Omkjøring MVA-oppgj.')
     A            RHPFÅR      0004S
     A                                      EDTCDE(Z)
     A                                      COMP(GE 1984)
     A                                      CHKMSGID(RMH0050 *LIBL/QMFOKON)
     A                                      COLHDG('Overfør fra år')
     A            RHPTÅR      0004S
     A                                      EDTCDE(Z)
     A                                      COMP(GE 1984)
     A                                      CHKMSGID(RMH0050 *LIBL/QMFOKON)
     A                                      COLHDG('Overfør til år')
     A            RHPBFA      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMH0010 *LIBL/QMFOKON)
     A                                      COLHDG('Oppdater med faktor')
     A            RHPHEL      0001A
     A                                      VALUES(' ' 'H' 'T')
     A                                      CHKMSGID(RMH0300 *LIBL/QMFOKON)
     A                                      COLHDG('Beløp i kr./tusen  ')
     A            RHPLIN      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMH0280 *LIBL/QMFOKON)
     A                                      COLHDG('Skriv linjenr.     ')
     A            RHPNUL      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMH0320 *LIBL/QMFOKON)
     A                                      COLHDG('Skriv null-linjer  ')
     A            RHPJNR      0005S
     A                                      EDTCDE(Z)
     A                                      COMP(GT 0)
     A                                      CHKMSGID(RMH0290 *LIBL/QMFOKON)
     A                                      COLHDG('Journalnr slettes  ')
     A            RHPOVR      0001A
     A                                      VALUES('M' 'P')
     A                                      CHKMSGID(RMH0310 *LIBL/QMFOKON)
     A                                      COLHDG('Type overføring    ')
     A            RHPBEL      0011S 2
     A                                      EDTCDE(Z)
     A                                      COMP(GE 0)
     A                                      COLHDG('Beløpsgrense')
     A            RHPRAN      0004S 0
     A                                      EDTCDE(Z)
     A                                      COMP(GE 0)
     A                                      COLHDG('Tilfeldig nr.')
     A*
     A* Parameter kunder
     A*
     A            RKPKDA      0006S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kjøredato')
     A            RKPRÅR      0004S
     A                                      EDTCDE(Z)
S5.60A*                                     COMP(GE 1984)
S5.60A*                                     CHKMSGID(RMH0050 *LIBL/QMFOKON)
     A                                      COLHDG('Regnskapsår')
     A            RKPPER      0002S
     A                                      EDTCDE(Z)
     A                                      COMP(LE 13)
     A                                      CHKMSGID(RMH0040 *LIBL/QMFOKON)
     A                                      COLHDG('Periode')
     A            RKPPTX      0001S
     A                                      EDTCDE(X)
     A                                      COLHDG('Purrenr.')
     A            RKPPNR      0001S
     A                                      EDTCDE(X)
     A                                      COLHDG('Purrenr.><=')
     A            RKPAVF      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling fra. . . .')
     A            RKPAVT      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling til. . . .')
     A            RKPKAF      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kundekategori fra .')
     A            RKPKAT      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kundekategori til .')
     A            RKPSEF      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Selger fra. . . . .')
     A            RKPSET      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Selger til. . . . .')
     A            RKPDIF      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Distrikt fra. . . .')
     A            RKPDIT      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Distrikt til. . . .')
     A            RKPLAF      0002S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lager fra . . . . .')
     A            RKPLAT      0002S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lager til . . . . .')
     A            RKPKPE      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Kontaktperson . . .')
     A            RKPTLF      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Telefonnummer . . .')
     A            RKPKMP      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Komprimert liste. .')
     A            RKPSAL      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Kun konti m/saldo .')
     A            RKPKTG      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Kategori. . . . . .')
     A            RKPAVD      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Avdeling. . . . . .')
     A            RKPSLG      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Selger. . . . . . .')
     A            RKPALF      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0290 *LIBL/QMFOKON)
     A                                      COLHDG('Alfabetisk. . . . .')
     A            RKPKNR      0006S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kundenummer . . . .')
     A            RKPVAL      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Valutabeløp . . . .')
     A            RKPSLD      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Saldotest . . . . .')
     A            RKPSGR      0007S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Saldogrense . . . .')
     A            RKPKRT      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Kredittidtest . . .')
     A            RKPKRD      0005S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kredittid i dager .')
     A            RKPKGR      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Kredit overskredet.')
     A            RKPTYP      0001A
     A                                      VALUES('S' 'F' 'B')
     A                                      CHKMSGID(RMH0300 *LIBL/QMFOKON)
     A                                      COLHDG('Type utskrift . . .')
     A            RKPBDA          L
     A                                      COLHDG('Bilagsdato t.o.m. .')
     A            RKPFDA          L
     A                                      COLHDG('Forfall eldre enn')
     A            RKPLTY      0001A
     A                                      VALUES('E' 'F')
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      COLHDG('Type liste')
     A            RKPFOR          L
     A                                      COLHDG('Forfallsdato')
     A            RKPSKR      0001A
     A                                      VALUES(' ' 'J')
     A                                      COLHDG('Bankgiro skrives')
     A            RKPREG      0001A
     A                                      VALUES(' ' 'J')
     A                                      COLHDG('Oppdatere regnskap')
     A            RKPSTY      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Bilagstype med')
     A            RKPSFP      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Kun forfalte poster')
     A            RKPSBB      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Betalingsbet. fra')
     A            RKPETI      0001S
     A                                      VALUES(1 3)
     A                                      CHKMSGID(RMH0310 *LIBL/QMFOKON)
     A                                      COLHDG('Type etikett')
     A*
     A* Parameter leverandører
     A*
     A            RLPKDA      0006S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kjøredato')
     A            RLPRÅR      0004S
     A                                      EDTCDE(Z)
     A                                      COMP(GE 1984)
     A                                      CHKMSGID(RMH0050 *LIBL/QMFOKON)
     A                                      COLHDG('Regnskapsår')
     A            RLPPER      0002S
     A                                      EDTCDE(Z)
     A                                      COMP(LE 13)
     A                                      CHKMSGID(RMH0040 *LIBL/QMFOKON)
     A                                      COLHDG('Periode')
     A            RLPAVF      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling fra')
     A            RLPAVT      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avdeling til')
     A            RLPKAF      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lev.kategori fra')
     A            RLPKAT      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Lev.kategori til')
     A            RLPSEF      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Selger fra')
     A            RLPSET      0004S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Selger til')
     A            RLPKPE      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Kontaktperson')
     A            RLPTLF      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Telefonnummer')
     A            RLPKMP      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Komprimert liste')
     A            RLPSAL      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Kun konti m/saldo')
     A            RLPKTG      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Kategori')
     A            RLPAVD      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Avdeling')
     A            RLPSLG      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Selger')
     A            RLPALF      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0290 *LIBL/QMFOKON)
     A                                      COLHDG('Alfabetisk')
     A            RLPLNR      0006S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Leverandørnummer')
     A            RLPVAL      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Valutabeløp')
     A            RLPSLD      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Saldotest')
     A            RLPSGR      0007S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Saldogrense')
     A            RLPKRT      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Kredittidtest')
     A            RLPKRD      0005S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kredittid i dager')
     A            RLPKGR      0001A
     A                                      VALUES(' ' 'J')
     A                                      CHKMSGID(RMH0090 *LIBL/QMFOKON)
     A                                      COLHDG('Kredit overskredet')
     A            RLPTYP      0001A
     A                                      VALUES('S' 'F' 'B')
     A                                      CHKMSGID(RMH0300 *LIBL/QMFOKON)
     A                                      COLHDG('Type utskrift')
     A            RLPBDA          L
     A                                      COLHDG('Bilagsdato t.o.m.')
     A            RLPFDA          L
     A                                      COLHDG('Forfall eldre enn')
     A            RLPLTY      0001A
     A                                      VALUES('E' 'F')
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      COLHDG('Type liste')
     A            RLPETI      0001S
     A                                      VALUES(1 3)
     A                                      CHKMSGID(RMH0310 *LIBL/QMFOKON)
     A                                      COLHDG('Type etikett')
     A*
     A* PARAMETRE PROSJEKT
     A*
6.22 A            RPPROF    R               REFFLD(RÅPROA)
     A                                      COLHDG('Prosjekt fra:')
6.22 A            RPPROT    R               REFFLD(RÅPROA)
     A                                      COLHDG('Prosjekt til:')
6.22 A            RPAKTF    R               REFFLD(RÅAKTI)
     A                                      COLHDG('Aktivitet fra:')
6.22 A            RPAKTT    R               REFFLD(RPAKTI)
     A                                      COLHDG('Aktivitet til:')
     A            RPKATF      0006A
     A                                      COLHDG('Kategori fra: ')
     A            RPKATT      0006A
     A                                      COLHDG('Kategori til: ')
     A            RPSBHF      0004A
     A                                      COLHDG('Saksbeh. fra: ')
     A            RPSBHT      0004A
     A                                      COLHDG('Saksbeh. til: ')
     A            RPKNRF      0006S
     A                                      COLHDG('P. Kunde fra: ')
     A            RPKNRT      0006S
     A                                      COLHDG('P. Kunde til: ')
     A            RPPSLT      0001A
     A                                      VALUES('J' 'N' ' ')
     A                                      CHKMSGID(RMH0010 *LIBL/QMFOKON)
     A                                      COLHDG('Prosjekt avsluttet')
     A            RPPSRT      0001A
     A                                      VALUES('P' 'A')
     A                                      CHKMSGID(RMP0120 *LIBL/QMFOKON)
     A                                      COLHDG('Sortering')
     A            RPBEMN      0001A
     A                                      VALUES('B' 'M')
     A                                      CHKMSGID(RMP0110 *LIBL/QMFOKON)
     A                                      COLHDG('Beløp/Mengde')
     A            RPPKDA      0006S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kjøredato')
     A            RPPRÅR      0004S
     A                                      EDTCDE(Z)
     A                                      COMP(GE 1984)
     A                                      CHKMSGID(RMH0050 *LIBL/QMFOKON)
     A                                      COLHDG('Regnskapsår')
     A            RPPPER      0002S
     A                                      EDTCDE(Z)
     A                                      COMP(LE 13)
     A                                      CHKMSGID(RMH0040 *LIBL/QMFOKON)
     A                                      COLHDG('Periode')
     A            RPPPEF      0002S
     A                                      EDTCDE(Z)
     A                                      COMP(LE 13)
     A                                      CHKMSGID(RMH0040 *LIBL/QMFOKON)
     A                                      COLHDG('Periode fra:')
     A            RPPPET      0002S
     A                                      EDTCDE(Z)
     A                                      COMP(LE 13)
     A                                      CHKMSGID(RMH0040 *LIBL/QMFOKON)
     A                                      COLHDG('Periode til:')
     A            RPPK01      0006S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Prosjekt valg 01:')
     A            RPPROU      0001A
     A                                      VALUES(' ' 'U')
     A                                      CHKMSGID(RMH0030 *LIBL/QMFOKON)
     A                                      COLHDG('Prosjekt untatt:')
     A            RPPSML      0001A
     A                                      VALUES('B' 'F' 'G')
     A                                      CHKMSGID(RMH0100 *LIBL/QMFOKON)
     A                                      COLHDG('Sammenligning')
     A            RPPAVV      0001A
     A                                      VALUES('P' 'D')
     A                                      CHKMSGID(RMH0110 *LIBL/QMFOKON)
     A                                      COLHDG('Avvik')
     A            RPPTYP      0001A
     A                                      VALUES('B' 'S' 'A')
     A                                      CHKMSGID(RMH0180 *LIBL/QMFOKON)
     A                                      COLHDG('Datatype')
     A            RPPFÅR      0004S
     A                                      EDTCDE(Z)
     A                                      COMP(GE 1984)
     A                                      CHKMSGID(RMH0050 *LIBL/QMFOKON)
     A                                      COLHDG('Overfør fra år')
     A            RPPTÅR      0004S
     A                                      EDTCDE(Z)
     A                                      COMP(GE 1984)
     A                                      CHKMSGID(RMH0050 *LIBL/QMFOKON)
     A                                      COLHDG('Overfør til år')
     A            RPPBFA      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMH0010 *LIBL/QMFOKON)
     A                                      COLHDG('Oppdater med faktor')
     A**
     A** Kontaktpersonregister
     A**
     A            RUFIRM      0003S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
      *
     A            RUKUND      0006S 0       TEXT('Kundenr.')
     A                                      COLHDG('Kunde')
     A                                      EDTCDE(Z)
      *
     A            RULEVR      0006S 0       TEXT('Leverandørnr.')
     A                                      COLHDG('Lever.')
     A                                      EDTCDE(Z)
      *
     A            RUKPNR      0006S 0       TEXT('Kontaktpersonnr.')
     A                                      COLHDG('Kontaktp.nr.')
     A                                      EDTCDE(Z)
      *
     A            RUENAV      0030A         TEXT('Etternavn')
     A                                      COLHDG('Etternavn')
      *
     A            RUFNAV      0030A         TEXT('Fornavn')
     A                                      COLHDG('Fornavn')
      *
     A            RUALFA      0040A         TEXT('Alfa')
     A                                      COLHDG('Alfa')
      *
     A            RUPENR      0011S 0       TEXT('Personnr.')
     A                                      COLHDG('Personnr.')
     A                                      EDTCDE(Z)
      *
     A            RUKROL      0020A         TEXT('Rolle som kunde')
     A                                      COLHDG('Rolle kunde')
      *
     A            RULROL      0020A         TEXT('Rolle som levr.')
     A                                      COLHDG('Rolle levr.')
      *
     A            RUSTAT      0001A         TEXT('Status')
     A                                      COLHDG('Status')
      *
     A            RUKTLF      0011A         TEXT('Kontortlf')
     A                                      COLHDG('Kontortlf')
      *
     A            RUKFAX      0011A         TEXT('Kontorfax')
     A                                      COLHDG('Kontorfax')
      *
     A            RUPTLF      0011A         TEXT('Privattlf')
     A                                      COLHDG('Privattlf')
      *
     A            RUPFAX      0011A         TEXT('Privatfax')
     A                                      COLHDG('Privatfax')
      *
     A            RUMTLF      0011A         TEXT('Mobiltlf')
     A                                      COLHDG('Mobiltlf')
      *
     A            RUMAIL      0050A         TEXT('E-mail')
     A                                      COLHDG('E-mail')
      *
6.10 A            RUODAT    R               REFFLD(RÅODAT)
6.10 A            RUOTIM    R               REFFLD(RÅOTIM)
6.10 A            RUOUSR    R               REFFLD(RÅOUSR)
     A            RUEDAT          L         TEXT('Endr.dato')
     A                                      COLHDG('Endr.dto')
      *
     A            RUETIM          T         TEXT('Endr.kl.')
     A                                      COLHDG('Endr.Kl')
      *
     A            RUEUSR      0010A         TEXT('Endret av (User-ID).')
     A                                      COLHDG('Endret av')
     A**
     A** Kortregister
     A**
     A            RUKFIR      0003S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
      *
     A            RUKKUN      0006S 0       TEXT('Kundenr.')
     A                                      COLHDG('Kunde')
      *
     A            RUKPRO      0006S 0       TEXT('Kundeprosjekt')
     A                                      COLHDG('Kundeprosjekt')
      *
     A            RUKKPN      0006S 0       TEXT('Kontaktpersonnr.')
     A                                      COLHDG('Kontaktpersonnr.')
     A                                      EDTCDE(Z)
      *
      *           Koder pr. kort type etter behov :
      *           01=VISA Purchasing/ClearPark
      *           02=Europay Purchasing/ClearPark
      *
     A            RUKTYP         2S 0       TEXT('Korttype')
     A                                      COLHDG('Korttype')
     A                                      EDTCDE(Z)
      *
     A            RUKTSQ         4S 0       TEXT('Kort type/sekv')
     A                                      COLHDG('Kort type/sekv')
     A                                      EDTCDE(Z)
      *
     A            RUKKNR      0025S 0       TEXT('Kortnr.')
     A                                      COLHDG('Kortnr.')
     A                                      EDTCDE(Z)
      *
     A            RUKSTR      0025S 0       TEXT('Strekkode')
     A                                      COLHDG('Strekkode')
     A                                      EDTCDE(Z)
      *
     A            RUKEXP         4S 0       TEXT('Kort exp.date')
     A                                      COLHDG('Kort' 'exp.date')
     A                                      EDTCDE(Z)
      *
     A            RUKSPR      0001A         TEXT('Sperret')
     A                                      COLHDG('Sperret')
      *
     A            RUKOBL      0001S 0       TEXT('Avtale obligatorisk')
     A                                      VALUES(0 1)
     A                                      COLHDG('Avtale' 'obl.')
      *
     A            RUKHLD        30A         TEXT('Navn på kort')
     A                                      COLHDG('Navn' 'kort')
6.18  *
6.18 A            RUKFLM      0001S 0       TEXT('Fullmakt')
6.18 A                                      COLHDG('Fullmakt')
6.18  *
6.18 A            RUKDAT          L         TEXT('Siste kjørt')
6.18 A                                      COLHDG('Sist.kjørt')
6.2C A                                      DFT('0001-01-01')
6.18  *
6.18 A            RUKTIM          T         TEXT('Sist kjørt kl.')
6.18 A                                      COLHDG('Sist kjørt Kl')
6.2C A                                      DFT('00.00.00')
6.18  *
6.18 A            RUKUSR      0010A         TEXT('Kjørt av (User-ID).')
6.18 A                                      COLHDG('Kjørt av')
6.18  *
6.10 A            RUKODA    R               REFFLD(RÅODAT)
6.10 A            RUKOTI    R               REFFLD(RÅOTIM)
6.10 A            RUKOUS    R               REFFLD(RÅOUSR)
6.19 A**
6.19 A** Kortregister - statusinformasjon
6.19 A**
6.19 A            RUSFIR      0003S 0       TEXT('Firma')
6.19 A                                      COLHDG('Firma')
6.19  *
6.19  *           Koder pr. kort type etter behov :
6.19  *           01=VISA Purchasing/ClearPark
6.19  *           02=Europay Purchasing/ClearPark
6.19  *           03=Maxbo Kort
6.19  *           04=XL Bygg
6.19  *           05=BM Kort
6.19  *           06=NBBL Fordelskort
6.19  *
6.19 A            RUSKTY         2S 0       TEXT('Korttype')
6.19 A                                      COLHDG('Korttype')
6.19 A                                      EDTCDE(Z)
6.19  *
6.19 A            RUSLAG         2S 0       TEXT('Lager')
6.19 A                                      COLHDG('Lager')
6.19 A                                      EDTCDE(Z)
6.19  *
6.19 A            RUSKID      0015A         TEXT('Kunde Identitet')
6.19 A                                      COLHDG('Kunde ID')
6.19  *
6.19 A            RUSBES      0030A         TEXT('Beskrivelse')
6.19 A                                      COLHDG('Beskrivelse')
6.19  *
6.19 A            RUSFRK      0002A         TEXT('Avregn. frekvens')
6.19 A                                      COLHDG('Avr.frekvens')
6.19  *
6.19 A            RUSDG1      0001A         TEXT('Ukedag 1')
6.19 A                                      COLHDG('Ukedag 1')
6.19  *
6.19 A            RUSDG2      0001A         TEXT('Ukedag 2')
6.19 A                                      COLHDG('Ukedag 2')
6.19  *
6.19 A            RUSDG3      0001A         TEXT('Ukedag 3')
6.19 A                                      COLHDG('Ukedag 1')
6.19  *
6.19 A            RUSDG4      0001A         TEXT('Ukedag 4')
6.19 A                                      COLHDG('Ukedag 2')
6.19  *
6.19 A            RUSDG5      0001A         TEXT('Ukedag 5')
6.19 A                                      COLHDG('Ukedag 1')
6.19  *
6.19 A            RUSDG6      0001A         TEXT('Ukedag 6')
6.19 A                                      COLHDG('Ukedag 2')
6.19  *
6.19 A            RUSDG7      0001A         TEXT('Ukedag 7')
6.19 A                                      COLHDG('Ukedag 1')
6.19  *
6.19 A            RUSFRA          L         TEXT('Gyldig fra')
6.19 A                                      COLHDG('Gyldig fra')
6.19  *
6.19 A            RUSTIL          L         TEXT('Gyldig til')
6.19 A                                      COLHDG('Gyldig til')
6.19  *
6.19 A            RUSHLD      0001A         TEXT('Aktiv/hold')
6.19 A                                      COLHDG('Akt/Hld')
6.19  *
6.19 A            RUSKTF         4S 0       TEXT('Kontoserie fra')
6.19 A                                      COLHDG('Kto fra')
6.19 A                                      EDTCDE(Z)
6.19  *
6.19 A            RUSKTT         4S 0       TEXT('Kontoserie til')
6.19 A                                      COLHDG('Kto til')
6.19 A                                      EDTCDE(Z)
6.19  *
6.19 A            RUSKTO         5S 0       TEXT('Hovedbokskonto')
6.19 A                                      COLHDG('Hov Kto')
6.19 A                                      EDTCDE(Z)
6.33  *
6.33 A            RUSSPE         4S 0       TEXT('Spesifikasjon')
6.33 A                                      COLHDG('Spes')
6.33 A                                      EDTCDE(Z)
6.19  *
6.19 A            RUSBKD         2S 0       TEXT('Bilagskode')
6.19 A                                      COLHDG('Bil.kode')
6.19 A                                      EDTCDE(Z)
6.19  *
6.19 A            RUSTYP      0001A         TEXT('Korttype')
6.19 A                                      COLHDG('Korttype')
6.19  *
6.2A A            RUSOME      0001A         TEXT('Oppgjørsmetode')
6.2A A                                      COLHDG('Oppgjørsmetode')
6.2A  *
6.2A A            RUSKKD         2S 0       TEXT('Bilagskode kredit')
6.2A A                                      COLHDG('Bil.kode kredit')
6.2A A                                      EDTCDE(Z)
6.2J A            RUSITY      0002A         TEXT('Ordreinfo kode')
6.2J A                                      COLHDG('Infokode')
6.33  *
6.33 A            RUSBTY         3A         TEXT('Terminal korttype')
6.33 A                                      COLHDG('Term korttyp')
6.19  *
6.19 A            RUSDAT          L         TEXT('Siste kjørt')
6.19 A                                      COLHDG('Sist.kjørt')
6.19  *
6.19 A            RUSTIM          T         TEXT('Sist kjørt kl.')
6.19 A                                      COLHDG('Sist kjørt Kl')
6.19  *
6.19 A            RUSUSR      0010A         TEXT('Kjørt av (User-ID).')
6.19 A                                      COLHDG('Kjørt av')
6.19  *
6.19  *
6.19 A            RUSEDA          L         TEXT('Endret dato')
6.19 A                                      COLHDG('Endr.dato')
6.19  *
6.19 A            RUSETI          T         TEXT('Endret tid')
6.19 A                                      COLHDG('Endr.tid')
6.19  *
6.19 A            RUSEUS      0010A         TEXT('Endret av')
6.19 A                                      COLHDG('Endr.av')
6.19  *
6.19 A            RUSODA    R               REFFLD(RÅODAT)
6.19 A            RUSOTI    R               REFFLD(RÅOTIM)
6.19 A            RUSOUS    R               REFFLD(RÅOUSR)
      *
     A**
     A** Feltdefinisjoner Telegiro
     A**
     A            GEFSTA      0001A
     A                                      COLHDG('Status')
     A            GEFFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GEFFIN      0011S 0
     A                                      COLHDG('Foretaksidentifikas.')
     A            GEFUBF      0003S 0
     A                                      COLHDG('Utbetalingsforslagnr')
     A            GEFOPE      0011A
     A                                      COLHDG('Operatørnummer')
     A            GEFPWD      0008A
     A                                      COLHDG('Passord for transreg')
     A            GEFDIV      0011A
     A                                      COLHDG('Divisjonsnummer')
     A            GEFEFS      0001A
     A                                      VALUES('E' 'F')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A                                      COLHDG('Egne/Felles sekv.nr.')
     A            GEFFOS      0004S 0
     A                                      COLHDG('Fortløpende sekv.nr.')
     A            GEFFO2      0004S 0
     A                                      COLHDG('Hjelpesekv.nummer')
     A            GEFDAT      0008S 0
     A                                      COLHDG('Dato endret GEFFO2')
     A            GEFTIM      0006S 0
     A                                      COLHDG('Tidsp. endret GEFFO2')
     A            GEFDAS      0006S 0
     A                                      COLHDG('Daglig sekv.nr.')
     A            GEFDDA      0008S 0
     A                                      COLHDG('Dato endret GEFDAS')
     A            GEFBAN      0002A
     A                                      COLHDG('Bankkode')
     A            GEFKOM      0004A
     A                                      COLHDG('Kommunikasjonstype')
     A            GEFSBF      0001A
     A                                      VALUES('A' 'N')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A                                      COLHDG('Sortering av bet.for')
     A            GEFSAM      0001A
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A                                      COLHDG('Samle file')
     A            GEFLON      0001A
     A                                      VALUES('M' '3')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A                                      COLHDG('MDLØNN eller 3PLØNN.')
     A            GEFIFS      0045A
     A                                      COLHDG('Mappenavn')
     A**
     A**  BETFOR00-IDENTIFIKASJONSTRANSAKSJON-INNLAND
     A**
     A            GDHHID      0002A
     A                                      COLHDG('Header/ID')
     A                                      VALUES('AH')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDHVER      0001S 0
     A                                      COLHDG('Header/Versjon')
     A            GDHRET      0002S 0
     A                                      COLHDG('Header/Returkode')
     A            GDHRID      0004A
     A                                      COLHDG('Header/Retur-ID')
     A                                      VALUES('TBII' 'TBIU' 'TBRI' 'TBRU')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDHTRD      0004S 0
     A                                      COLHDG('Header/TransdatoMMDD')
     A            GDHTRS      0006S 0
     A                                      COLHDG('Header/Trans.sekvnr.')
     A            GDHTRK      0008A
     A                                      COLHDG('Header/Trans.kode')
     A            GDHBRU      0011A
     A                                      COLHDG('Header/Bruker-id')
     A            GDHANT      0002S 0
     A                                      COLHDG('Header/Ant.blokk â80')
     A*                                                                .')
     A            GDHB00      0008A
     A                                      COLHDG('BETFOR00')
     A            GDHFOR      0011S 0
     A                                      COLHDG('Foretaksnummer')
     A            GDHDIV      0011A
     A                                      COLHDG('Divisjon')
     A            GDHSKF      0004S 0
     A                                      COLHDG('Sekvenskontrollfelt')
     A            GDHRE1      0006A
     A                                      COLHDG('Reservert')
     A            GDHPRO      0004S 0
     A                                      COLHDG('Produksjonsdato')
     A            GDHPWD      0010A
     A                                      COLHDG('Passord')
     A            GDHRVE      0010A
     A                                      COLHDG('Rutine versjon')
     A            GDHNPW      0010A
     A                                      COLHDG('Nytt Passord')
     A            GDHOPN      0011A
     A                                      COLHDG('Operatørnummer')
     A            GDHSIB      0001A
     A                                      COLHDG('SIGILL: Segl-bruk')
     A            GDHSID      0006S 0
     A                                      COLHDG('SIGILL: Segl-dato')
     A            GDHSIN      0020S 0
     A                                      COLHDG('SIGILL: Del-nøkkel')
     A            GDHSIH      0001A
     A                                      COLHDG('SIGILL: Segl-hvordan')
     A            GDHRE2      0142A
     A                                      COLHDG('Reservert')
     A            GDHAEB      0001A
     A                                      COLHDG('AEGIS : Segl-bruk')
     A            GDHRE3      0024A
     A                                      COLHDG('Reservert')
     A*
     A            GDHFGR      0003A
     A                                      COLHDG('Filegruppe')
     A            GDHFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDHUBF      0003S 0
     A                                      COLHDG('Utbet.forslagsnummer')
     A**
     A**  BETFOR01-OVERFØRSELSTRANSAKSJON - UTENLANDS
     A**
     A            GDAHID      0002A
     A                                      COLHDG('Header/ID')
     A                                      VALUES('AH')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDAVER      0001S 0
     A                                      COLHDG('Header/Versjon')
     A            GDARET      0002S 0
     A                                      COLHDG('Header/Returkode')
     A            GDARID      0004A
     A                                      COLHDG('Header/Retur-ID')
     A                                      VALUES('TBII' 'TBIU' 'TBRI' 'TBRU')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDATRD      0004S 0
     A                                      COLHDG('Header/TransdatoMMDD')
     A            GDATRS      0006S 0
     A                                      COLHDG('Header/Trans.sekvnr.')
     A            GDATRK      0008A
     A                                      COLHDG('Header/Trans.kode')
     A            GDABRU      0011A
     A                                      COLHDG('Header/Bruker-id')
     A            GDAANT      0002S 0
     A                                      COLHDG('Header/Ant.blokk â80')
     A*                                                                .')
     A            GDAB01      0008A
     A                                      COLHDG('BETFOR01')
     A            GDAFOR      0011S 0
     A                                      COLHDG('Foretaksnummer')
     A            GDAKTO      0011S 0
     A                                      COLHDG('Kontonummer')
     A            GDASKF      0004S 0
     A                                      COLHDG('Sekvenskontrollfelt')
     A            GDAREF      0006A
     A                                      COLHDG('Referansenummer')
     A            GDABET      0006S 0
     A                                      COLHDG('Betalingsdato')
     A            GDAVAL      0003A
     A                                      COLHDG('Egenref: Valutakode')
     A            GDAEG1      0005A
     A                                      COLHDG('Egenref: 5 Ledig')
     A            GDAFGR      0003A
     A                                      COLHDG('Egenref: Filgruppe')
     A            GDAEG2      0010A
     A                                      COLHDG('Egenref: 10 Ledig')
     A            GDAFIR      0003S 0
     A                                      COLHDG('Egenref: Firma')
     A            GDALEV      0006S 0
     A                                      COLHDG('Egenref: Leverandør')
     A            GDABEV      0003A
     A                                      COLHDG('Valutasort betaling')
     A            GDAFAV      0003A
     A                                      COLHDG('Valutasort faktura')
     A            GDAOUT      0003A
     A                                      COLHDG('Omkostninger utland')
     A            GDAONO      0003A
     A                                      COLHDG('Omostninger Norge')
     A            GDAVAA      0030A
     A                                      COLHDG('Varslingsanvisninger')
     A            GDAHAS      0001A
     A                                      COLHDG('Hasteangivelse')
     A            GDAAVT      0008S 0
     A                                      COLHDG('Avtalt kurs')
     A            GDATNR      0006A
     A                                      COLHDG('Terminkontraktsnr.')
     A            GDATKU      0008S 0
     A                                      COLHDG('Terminkontraktskurs')
     A            GDASJE      0001A
     A                                      COLHDG('Sjekkode')
     A            GDARE1      0008A
     A                                      COLHDG('Reservert')
     A            GDAREK      0008S 0
     A                                      COLHDG('Reell kurs')
     A            GDARE2      0016A
     A                                      COLHDG('Reservert')
     A            GDABBE      0016S 0
     A                                      COLHDG('Belastet beløp')
     A            GDAOBE      0016S 0
     A                                      COLHDG('Overført beløp')
     A            GDARE3      0005A
     A                                      COLHDG('Reservert')
     A            GDAEFF      0006S 0
     A                                      COLHDG('Effektueringsref')
     A            GDAAVM      0006A
     A                                      COLHDG('Avtalt med')
     A            GDASLE      0001A
     A                                      COLHDG('Sletting')
     A            GDASBP      0001A
     A                                      COLHDG('SBP-kode')
     A            GDAVKO      0006S 0
     A                                      COLHDG('Valuteringsdato ÅMD')
     A            GDAPRO      0009S 0
     A                                      COLHDG('Provisjon')
     A            GDAKMN      0008S 0
     A                                      COLHDG('Kurs mot NOK')
     A            GDARE4      0032A
     A                                      COLHDG('Reservert')
     A*
     A            GDAUBF      0003S 0
     A                                      COLHDG('Utbet.forslagsnummer')
     A            GDATEL      0005S 0
     A                                      COLHDG('Intern teller')
     A**
     A**  BETFOR02-BANKFORBINDELSESTRANSAKSJON UTENLANDS
     A**
     A            GDBHID      0002A
     A                                      COLHDG('Header/ID')
     A                                      VALUES('AH')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDBVER      0001S 0
     A                                      COLHDG('Header/Versjon')
     A            GDBRET      0002S 0
     A                                      COLHDG('Header/Returkode')
     A            GDBRID      0004A
     A                                      COLHDG('Header/Retur-ID')
     A                                      VALUES('TBII' 'TBIU' 'TBRI' 'TBRU')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDBTRD      0004S 0
     A                                      COLHDG('Header/TransdatoMMDD')
     A            GDBTRS      0006S 0
     A                                      COLHDG('Header/Trans.sekvnr.')
     A            GDBTRK      0008A
     A                                      COLHDG('Header/Trans.kode')
     A            GDBBRU      0011A
     A                                      COLHDG('Header/Bruker-id')
     A            GDBANT      0002S 0
     A                                      COLHDG('Header/Ant.blokk â80')
     A*                                                                .')
     A            GDBB02      0008A
     A                                      COLHDG('BETFOR02')
     A            GDBFOR      0011S 0
     A                                      COLHDG('Foretaksnummer')
     A            GDBKTO      0011S 0
     A                                      COLHDG('Kontonummer')
     A            GDBSKF      0004S 0
     A                                      COLHDG('Sekvenskontrollfelt')
     A            GDBREF      0006A
     A                                      COLHDG('Referansenummer')
     A            GDBSWI      0011A
     A                                      COLHDG('Swiftadresse')
     A            GDBBNA      0035A
     A                                      COLHDG('Banknavn')
     A            GDBBA1      0035A
     A                                      COLHDG('Bankadresse-1')
     A            GDBBA2      0035A
     A                                      COLHDG('Bankadresse-2')
     A            GDBBA3      0035A
     A                                      COLHDG('Bankadresse-3')
     A            GDBSRB      0011A
     A                                      COLHDG('Swiftadr.remb.bank')
     A            GDBMLK      0002A
     A                                      COLHDG('Mottakers bank landk')
     A            GDBRE1      0076A
     A                                      COLHDG('Reservert')
     A*
     A            GDBFGR      0003A
     A                                      COLHDG('Filgruppe')
     A            GDBFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDBUBF      0003S 0
     A                                      COLHDG('Utbet.forslagsnummer')
     A            GDBTEL      0005S 0
     A                                      COLHDG('Intern teller')
     A**
     A**  BETFOR03-OVERFØRSELSTRANSAKSJON - UTENLANDS
     A**
     A            GDCHID      0002A
     A                                      COLHDG('Header/ID')
     A                                      VALUES('AH')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDCVER      0001S 0
     A                                      COLHDG('Header/Versjon')
     A            GDCRET      0002S 0
     A                                      COLHDG('Header/Returkode')
     A            GDCRID      0004A
     A                                      COLHDG('Header/Retur-ID')
     A                                      VALUES('TBII' 'TBIU' 'TBRI' 'TBRU')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDCTRD      0004S 0
     A                                      COLHDG('Header/TransdatoMMDD')
     A            GDCTRS      0006S 0
     A                                      COLHDG('Header/Trans.sekvnr.')
     A            GDCTRK      0008A
     A                                      COLHDG('Header/Trans.kode')
     A            GDCBRU      0011A
     A                                      COLHDG('Header/Bruker-id')
     A            GDCANT      0002S 0
     A                                      COLHDG('Header/Ant.blokk â80')
     A*                                                                .')
     A            GDCB03      0008A
     A                                      COLHDG('BETFOR03')
     A            GDCFOR      0011S 0
     A                                      COLHDG('Foretaksnummer')
     A            GDCKTO      0011S 0
     A                                      COLHDG('Kontonummer')
     A            GDCSKF      0004S 0
     A                                      COLHDG('Sekvenskontrollfelt')
     A            GDCREF      0006A
     A                                      COLHDG('Referansenummer')
     A            GDCMKO      0035A
     A                                      COLHDG('Mottakers kontonr')
     A            GDCMNA      0035A
     A                                      COLHDG('Mottakers navn')
     A            GDCMA1      0035A
     A                                      COLHDG('Mottakers adresse-1')
     A            GDCMA2      0035A
     A                                      COLHDG('Mottakers adresse-2')
     A            GDCMA3      0035A
     A                                      COLHDG('Mottakers adresse-3')
     A            GDCMLA      0002A
     A                                      COLHDG('Mottakers landkode')
     A            GDCTTX      0001A
     A                                      COLHDG('Telex/Telefax')
     A                                      VALUES('T' 'F')
     A            GDCTLA      0002A
     A                                      COLHDG('Telex-landkode')
     A            GDCTTN      0018A
     A                                      COLHDG('Telex/Telefax nr.')
     A            GDCATT      0020A
     A                                      COLHDG('Attention')
     A            GDCRE1      0022A
     A                                      COLHDG('Reservert')
     A*
     A            GDCFGR      0003A
     A                                      COLHDG('Filgruppe')
     A            GDCFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDCUBF      0003S 0
     A                                      COLHDG('Utbet.forslagsnummer')
     A            GDCTEL      0005S 0
     A                                      COLHDG('Intern teller')
     A**
     A**  BETFOR04-FAKTURATRANSAKSJON - UTENLANDS
     A**
     A            GDDHID      0002A
     A                                      COLHDG('Header/ID')
     A                                      VALUES('AH')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDDVER      0001S 0
     A                                      COLHDG('Header/Versjon')
     A            GDDRET      0002S 0
     A                                      COLHDG('Header/Returkode')
     A            GDDRID      0004A
     A                                      COLHDG('Header/Retur-ID')
     A                                      VALUES('TBII' 'TBIU' 'TBRI' 'TBRU')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDDTRD      0004S 0
     A                                      COLHDG('Header/TransdatoMMDD')
     A            GDDTRS      0006S 0
     A                                      COLHDG('Header/Trans.sekvnr.')
     A            GDDTRK      0008A
     A                                      COLHDG('Header/Trans.kode')
     A            GDDBRU      0011A
     A                                      COLHDG('Header/Bruker-id')
     A            GDDANT      0002S 0
     A                                      COLHDG('Header/Ant.blokk â80')
     A*                                                                .')
     A            GDDB04      0008A
     A                                      COLHDG('BETFOR04')
     A            GDDFOR      0011S 0
     A                                      COLHDG('Foretaksnummer')
     A            GDDKTO      0011S 0
     A                                      COLHDG('Kontonummer')
     A            GDDSKF      0004S 0
     A                                      COLHDG('Sekvenskontrollfelt.')
     A            GDDREF      0006A
     A                                      COLHDG('Referansenummer')
     A            GDDMT1      0004A
     A                                      COLHDG('Mottakers ref: REF:')
     A            GDDMBT      0020A
     A                                      COLHDG('Mottakers ref:Biltxt')
     A            GDDMT2      0005A
     A                                      COLHDG('Mottakers ref: DAT:')
     A            GDDMBD      0006S 0
     A                                      COLHDG('Mottakers ref.Bildat')
     A            GDDEVA      0008S 2
     A                                      COLHDG('Egenref: Valutarab.')
     A            GDDEBH      0007S 0
     A                                      COLHDG('Egenref: Beløp Høy.')
     A            GDDFGR      0003A
     A                                      COLHDG('Egenref: Filgruppe')
     A            GDDFIR      0003S 0
     A                                      COLHDG('Egenref: Firma')
     A            GDDUBF      0003S 0
     A                                      COLHDG('Egenref: Forsl.nr.')
     A            GDDBFL      0005S 0
     A                                      COLHDG('Egenref. Fors.linjnr')
     A            GDDEG1      0002A
     A                                      COLHDG('Egenref: Ledig 2')
     A            GDDEBL      0004S 0
     A                                      COLHDG('Egenref: Beløp Lav')
     A            GDDBEL      0015S 0
     A                                      COLHDG('Fakturabeløp')
     A            GDDDBK      0001A
     A                                      COLHDG('Debet/kredit kode')
     A            GDDBAK      0006A
     A                                      COLHDG('Betalingsartkode')
     A            GDDBGJ      0060A
     A                                      COLHDG('Beløpet gjelder')
     A            GDDTEK      0001A
     A                                      COLHDG('Til egen konto')
     A            GDDRE1      0001A
     A                                      COLHDG('Reservert')
     A            GDDRE2      0006S 0
     A                                      COLHDG('Reservert')
     A            GDDVIP      0001A
     A                                      COLHDG('Vareimport (utgår)')
     A            GDDRE3      0006S 0
     A                                      COLHDG('Reservert')
     A            GDDRE4      0046A
     A                                      COLHDG('Reservert')
     A            GDDLØP      0003S 0
     A                                      COLHDG('Løpenummer')
     A            GDDRE5      0024A
     A                                      COLHDG('Reservert')
     A*
     A            GDDTEL      0005S 0
     A                                      COLHDG('Intern teller')
     A**
     A**  BETFOR21-OVERFØRSELSTRANSAKSJON - INNLAND
     A**
     A            GDJHID      0002A
     A                                      COLHDG('Header/ID')
     A                                      VALUES('AH')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDJVER      0001S 0
     A                                      COLHDG('Header/Versjon')
     A            GDJRET      0002S 0
     A                                      COLHDG('Header/Returkode')
     A            GDJRID      0004A
     A                                      COLHDG('Header/Retur-ID')
     A                                      VALUES('TBII' 'TBIU' 'TBRI' 'TBRU')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDJTRD      0004S 0
     A                                      COLHDG('Header/TransdatoMMDD')
     A            GDJTRS      0006S 0
     A                                      COLHDG('Header/Trans.sekvnr.')
     A            GDJTRK      0008A
     A                                      COLHDG('Header/Trans.kode')
     A            GDJBRU      0011A
     A                                      COLHDG('Header/Bruker-id')
     A            GDJANT      0002S 0
     A                                      COLHDG('Header/Ant.blokk â80')
     A*                                                                .')
     A            GDJB21      0008A
     A                                      COLHDG('BETFOR21')
     A            GDJFOR      0011S 0
     A                                      COLHDG('Foretaksnummer')
     A            GDJKTO      0011S 0
     A                                      COLHDG('Kontonummer')
     A            GDJSKF      0004S 0
     A                                      COLHDG('Sekvenskontrollfelt')
     A            GDJREF      0006A
     A                                      COLHDG('Referansenummer')
     A            GDJBET      0006S 0
     A                                      COLHDG('Betalingsdato')
     A            GDJKOD      0002S 0
     A                                      COLHDG('Egenref: "23" ')
     A            GDJEG1      0006A
     A                                      COLHDG('Egenref: 6 Ledig')
     A            GDJFGR      0003A
     A                                      COLHDG('Egenref: Filgruppe')
     A            GDJEG2      0010A
     A                                      COLHDG('Egenref: 10 Ledig')
     A            GDJFIR      0003S 0
     A                                      COLHDG('Egenref: Firma')
     A            GDJLEV      0006S 0
     A                                      COLHDG('Egenref: Leverandør')
     A            GDJRE1      0001A
     A                                      COLHDG('Reservert')
     A            GDJMOK      0011A
     A                                      COLHDG('Mottakers konto')
     A            GDJMON      0030A
     A                                      COLHDG('Mottakers navn')
     A            GDJAD1      0030A
     A                                      COLHDG('Adresse 1')
     A            GDJAD2      0030A
     A                                      COLHDG('Adresse 2')
     A            GDJPNR      0004S 0
     A                                      COLHDG('Postnummer')
     A            GDJPOS      0026A
     A                                      COLHDG('Poststed')
     A            GDJBEG      0015S 0
     A                                      COLHDG('Beløp til egen konto')
     A            GDJTKO      0003S 0
     A                                      COLHDG('Tekstkode')
     A            GDJTTY      0001A
     A                                      COLHDG('Transaksjonstype')
     A            GDJSLE      0001A
     A                                      COLHDG('Sletting.')
     A            GDJTOT      0015S 0
     A                                      COLHDG('Totalbeløp')
     A            GDJRE2      0005S 0
     A                                      COLHDG('Reservert')
     A            GDJVAD      0006S 0
     A                                      COLHDG('Valuteringsdato')
     A            GDJRE3      0026A
     A                                      COLHDG('Reservert')
     A*
     A            GDJUBF      0003S 0
     A                                      COLHDG('Utbet.forslagsnummer')
     A            GDJTEL      0005S 0
     A                                      COLHDG('Intern teller')
     A**
     A**  BETFOR22-MASSEOVERFØRSEL
     A**
     A            GDKHID      0002A
     A                                      COLHDG('Header/ID')
     A                                      VALUES('AH')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDKVER      0001S 0
     A                                      COLHDG('Header/Versjon')
     A            GDKRET      0002S 0
     A                                      COLHDG('Header/Returkode')
     A            GDKRID      0004A
     A                                      COLHDG('Header/Retur-ID')
     A                                      VALUES('TBII' 'TBIU' 'TBRI' 'TBRU')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDKTRD      0004S 0
     A                                      COLHDG('Header/TransdatoMMDD')
     A            GDKTRS      0006S 0
     A                                      COLHDG('Header/Trans.sekvnr.')
     A            GDKTRK      0008A
     A                                      COLHDG('Header/Trans.kode')
     A            GDKBRU      0011A
     A                                      COLHDG('Header/Bruker-id')
     A            GDKANT      0002S 0
     A                                      COLHDG('Header/Ant.blokk â80')
     A*                                                                .')
     A            GDKB22      0008A
     A                                      COLHDG('BETFOR22')
     A            GDKFOR      0011S 0
     A                                      COLHDG('Foretaksnummer')
     A            GDKKTO      0011S 0
     A                                      COLHDG('Kontonummer')
     A            GDKSKF      0004S 0
     A                                      COLHDG('Sekvenskontrollfelt')
     A            GDKREF      0006A
     A                                      COLHDG('Referansenummer')
     A            GDKMOK      0011A
     A                                      COLHDG('Mottakers konto')
     A            GDKMON      0030A
     A                                      COLHDG('Mottakers navn')
     A            GDKBEL      0015S 0
     A                                      COLHDG('Beløp')
     A            GDKSLK      0001A
     A                                      COLHDG('Slettekode')
     A            GDKRE1      0145A
     A                                      COLHDG('Reservert')
     A            GDKUBF      0003S 0
     A                                      COLHDG('Egenref: Forsl.nr')
     A            GDKBFL      0005S 0
     A                                      COLHDG('Egenref. Fors.linjnr')
     A            GDKEG1      0002A
     A                                      COLHDG('Egenref - 2')
     A            GDKLØP      0004S 0
     A                                      COLHDG('Løpenummer')
     A            GDKRE2      0024A
     A                                      COLHDG('Reservert')
     A*
     A            GDKFGR      0003A
     A                                      COLHDG('Filgruppe')
     A            GDKFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDKTEL      0005S 0
     A                                      COLHDG('Intern teller')
     A**
     A**  BETFOR23-FAKTURATRANSAKSJON - INNLAND
     A**
     A            GDLHID      0002A
     A                                      COLHDG('Header/ID')
     A                                      VALUES('AH')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDLVER      0001S 0
     A                                      COLHDG('Header/Versjon')
     A            GDLRET      0002S 0
     A                                      COLHDG('Header/Returkode')
     A            GDLRID      0004A
     A                                      COLHDG('Header/Retur-ID')
     A                                      VALUES('TBII' 'TBIU' 'TBRI' 'TBRU')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDLTRD      0004S 0
     A                                      COLHDG('Header/TransdatoMMDD')
     A            GDLTRS      0006S 0
     A                                      COLHDG('Header/Trans.sekvnr.')
     A            GDLTRK      0008A
     A                                      COLHDG('Header/Trans.kode')
     A            GDLBRU      0011A
     A                                      COLHDG('Header/Bruker-id')
     A            GDLANT      0002S 0
     A                                      COLHDG('Header/Ant.blokk â80')
     A*                                                                .')
     A            GDLB23      0008A
     A                                      COLHDG('BETFOR23')
     A            GDLFOR      0011S 0
     A                                      COLHDG('Foretaksnummer')
     A            GDLKTO      0011S 0
     A                                      COLHDG('Kontonummer')
     A            GDLSKF      0004S 0
     A                                      COLHDG('Sekvenskontrollfelt')
     A            GDLREF      0006A
     A                                      COLHDG('Referansenummer')
     A            GDLMF1      0120A
     A                                      COLHDG('Mottakers ref.fakt')
     A            GDLKID      0027A
     A                                      COLHDG('Kunde-id felt')
     A            GDLRAB      0008S 2
     A                                      COLHDG('Egenref: Rabatt')
     A            GDLBDA      0007S 0
     A                                      COLHDG('Egenref: B.dato DMÅ')
     A            GDLFGR      0003A
     A                                      COLHDG('Egenref: Filgruppe')
     A            GDLFIR      0003S 0
     A                                      COLHDG('Egenref: Firma')
     A            GDLUBF      0003S 0
     A                                      COLHDG('Egenref: Forsl.nr.')
     A            GDLBFL      0005S 0
     A                                      COLHDG('Egenref: Fors.linjnr')
     A            GDLEG1      0001A
     A                                      COLHDG('Egenref: Ledig 1')
     A            GDLBEL      0015S 0
     A                                      COLHDG('Fakturabeløp')
     A            GDLDBK      0001A
     A                                      COLHDG('Debet/Kredit')
     A            GDLRE1      0020A
     A                                      COLHDG('Reservert')
     A            GDLLØP      0003S 0
     A                                      COLHDG('Løpenummer')
     A            GDLRE2      0024A
     A                                      COLHDG('Reservert')
     A*
     A            GDLTEL      0005S 0
     A                                      COLHDG('Intern teller')
     A**
     A**  BETFOR99-AVSLUTNINGSTRANSAKSJON-INNLAND
     A**
     A            GDZHID      0002A
     A                                      COLHDG('Header/ID')
     A                                      VALUES('AH')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDZVER      0001S 0
     A                                      COLHDG('Header/Versjon')
     A            GDZRET      0002S 0
     A                                      COLHDG('Header/Returkode')
     A            GDZRID      0004A
     A                                      COLHDG('Header/Retur-ID')
     A                                      VALUES('TBII' 'TBIU' 'TBRI' 'TBRU')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            GDZTRD      0004S 0
     A                                      COLHDG('Header/TransdatoMMDD')
     A            GDZTRS      0006S 0
     A                                      COLHDG('Header/Trans.sekvnr.')
     A            GDZTRK      0008A
     A                                      COLHDG('Header/Trans.kode')
     A            GDZBRU      0011A
     A                                      COLHDG('Header/Bruker-id')
     A            GDZANT      0002S 0
     A                                      COLHDG('Header/Ant.blokk â80')
     A*                                                                .')
     A            GDZB99      0008A
     A                                      COLHDG('BETFOR99')
     A            GDZFOR      0011S 0
     A                                      COLHDG('Foretaksnummer')
     A            GDZRE1      0011A
     A                                      COLHDG('Reservert')
     A            GDZSKF      0004S 0
     A                                      COLHDG('Sekvenskontrollfelt')
     A            GDZRE2      0006A
     A                                      COLHDG('Reservert')
     A            GDZPRO      0004S 0
     A                                      COLHDG('Produksjonsdato')
     A            GDZRE3      0019A
     A                                      COLHDG('Reservert')
     A            GDZATR      0005S 0
     A                                      COLHDG('Antall transaksjoner')
     A            GDZRE4      0123A
     A                                      COLHDG('Reservert')
     A            GDZAE1      0008S 0
     A                                      COLHDG('AEGIS: D1-Hash-verdi')
     A            GDZAE2      0008S 0
     A                                      COLHDG('AEGIS: D2-Hash-verdi')
     A            GDZAES      0007S 0
     A                                      COLHDG('AEGIS: SEGL1')
     A            GDZRE5      0001A
     A                                      COLHDG('Reservert')
     A            GDZAEB      0005A
     A                                      COLHDG('AEGIS: Brukerid-2')
     A            GDZRE6      0003A
     A                                      COLHDG('Reservert')
     A            GDZAEG      0007S 0
     A                                      COLHDG('AEGIS : SEGL2')
     A            GDZRE7      0001A
     A                                      COLHDG('Reservert')
     A            GDZSIS      0004A
     A                                      COLHDG('SIGILL: Security')
     A            GDZSIL      0001A
     A                                      COLHDG('SIGILL: Language')
     A            GDZSIV      0001A
     A                                      COLHDG('SIGILL: Versjon')
     A            GDZSII      0001A
     A                                      COLHDG('SIGILL: Interface')
     A            GDZSIK      0018A
     A                                      COLHDG('SIGILL: Kontrollfelt')
     A            GDZRE8      0024A
     A                                      COLHDG('Reservert')
     A*
     A            GDZFGR      0003A
     A                                      COLHDG('Filegruppe')
     A            GDZFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDZUBF      0003S 0
     A                                      COLHDG('Utbet.forslagsnummer')
     A            GDZTOT      0011S 2
     A                                      COLHDG('Totalbeløp for Batch')
     A            GDZIUK      0010A
     A                                      COLHDG('Innenlands/Utenlands')
     A**
     A**  Felles sekvensteller med nøkkel på foretaksnummer
     A**
     A            GDUFOR      0011S 0
     A                                      COLHDG('Foretaksnummer')
     A            GDUSB1      0004S 0
     A                                      COLHDG('Sist brukte sek.nr-1')
     A            GDUSB2      0004S 0
     A                                      COLHDG('Sist brukte sek.nr-2')
     A            GDUDAT      0008S 0
     A                                      COLHDG('Dato endret GDUSB2')
     A            GDUTIM      0006S 0
     A                                      COLHDG('Tidsp. endret GDUSB2')
     A**
     A**  Deklarasjonskoder:
     A**
     A            GDRDEC      0006A
     A                                      COLHDG('Deklarasjonskode')
     A            GDRTX1      0030A
     A                                      COLHDG('Deklarasjonstekst')
     A            GDRTX2      0030A
     A                                      COLHDG('Deklarasjonstekst')
     A**
     A**  Statusfile over hva som er returnert fra bank:
     A**
     A            GDMFGR      0003A
     A                                      COLHDG('Filgruppe')
     A            GDMFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDMUBF      0003S 0
     A                                      COLHDG('Forslagsnummer')
     A            GDMRKO      0001A
     A                                      COLHDG('Returkode')
     A                                      VALUES('1' '2' 'F')
     A            GDMRID      0004A
     A                                      COLHDG('Rutine-id.')
     A                                      VALUES('TBRI' 'TBRU')
     A            GDMDAT      0008S 0
     A                                      COLHDG('Mottat ÅÅÅÅ.MM.DD')
     A            GDMTIM      0006S 0
     A                                      COLHDG('Mottatt HH:MM:DD')
     A            GDMTXT      0020A
     A                                      COLHDG('Kommentar')
     A**
     A**  1. gangs returfile - regnskap:
     A**
     A            GDNFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDNFOR      0008S 0
     A                                      COLHDG('Forfall -  ÅÅÅÅMMDD')
     A            GDNLEV      0006S 0
     A                                      COLHDG('Leverandørnummer')
     A            GDNFAC      0006S 0
     A                                      COLHDG('Factoringnummer')
     A            GDNVAL      0003A
     A                                      COLHDG('Valutakode')
     A            GDNREF      0006A
     A                                      COLHDG('Bankens ref.nr.')
6.NU A            GDNBNR      0008S 0
     A                                      COLHDG('Bilagsnummer')
     A            GDNBEL      0011P 2
     A                                      COLHDG('Beløp NOK')
     A            GDNVBE      0011P 2
     A                                      COLHDG('Valutabeløp')
     A            GDNTKI      0011S 0
     A                                      COLHDG('Til konto innland')
     A            GDNFKI      0011S 0
     A                                      COLHDG('Fra konto innland')
     A            GDNTKU      0035A
     A                                      COLHDG('Til konto utland')
     A            GDNFKU      0035A
     A                                      COLHDG('Fra konto utland')
     A            GDNKID      0027A
     A                                      COLHDG('KID')
     A            GDNUBF      0003S 0
     A                                      COLHDG('Forslagsnummer')
     A            GDNBFL      0005S 0
     A                                      COLHDG('Forslags-linjenummer')
     A            GDNOPP      0001S 0
     A                                      COLHDG('Allerede oppdat. = 1')
     A**
     A**  2. gangs returfile - regnskap:
     A**
     A            GDOFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDOFOR      0008S 0
     A                                      COLHDG('Forfall -  ÅÅÅÅMMDD')
     A            GDOLEV      0006S 0
     A                                      COLHDG('Leverandørnummer')
     A            GDOFAC      0006S 0
     A                                      COLHDG('Factoringnummer')
     A            GDOVAL      0003A
     A                                      COLHDG('Valutakode')
     A            GDOREF      0006A
     A                                      COLHDG('Bankens ref.nr.')
6.NU A            GDOBNR      0008S 0
     A                                      COLHDG('Bilagsnummer')
     A            GDOBEL      0011P 2
     A                                      COLHDG('Beløp NOK')
     A            GDOVBE      0011P 2
     A                                      COLHDG('Valutabeløp')
     A            GDOTKI      0011S 0
     A                                      COLHDG('Til konto innland')
     A            GDOFKI      0011S 0
     A                                      COLHDG('Fra konto innland')
     A            GDOTKU      0035A
     A                                      COLHDG('Til konto utland')
     A            GDOFKU      0035A
     A                                      COLHDG('Fra konto utland')
     A            GDOKID      0027A
     A                                      COLHDG('KID')
     A            GDOUBF      0003S 0
     A                                      COLHDG('Forslagsnummer')
     A            GDOBFL      0005S 0
     A                                      COLHDG('Forslags-linjenummer')
     A            GDOKNO      0008S 4
     A                                      COLHDG('Kurs mot NOK')
     A            GDOOPP      0001S 0
     A                                      COLHDG('Allerede oppdat. = 1')
     A            GDOPRO      0009S 2
     A                                      COLHDG('Provisjon til bank')
     A**
     A**  Feilretur - regnskap:
     A**
     A            GDPFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDPTRK      0008A
     A                                      COLHDG('Transaksjonskode')
     A            GDPRET      0002S 0
     A                                      COLHDG('Returkode')
     A            GDPFOR      0008S 0
     A                                      COLHDG('Forfall -  ÅÅÅÅMMDD.')
     A            GDPLEV      0006S 0
     A                                      COLHDG('Leverandørnummer')
6.30 A            GDPBNR      0008S 0
     A                                      COLHDG('Bilagsnummer')
     A            GDPUBF      0003S 0
     A                                      COLHDG('Forslagsnummer')
     A            GDPBFL      0005S 0
     A                                      COLHDG('Forslags-linjenummer')
     A            GDPOPP      0001S 0
     A                                      COLHDG('Allerede oppdat. = 1')
     A**
     A**  1. gangs returfile - Lønn:
     A**
     A            GDSFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDSFOR      0008S 0
     A                                      COLHDG('Lønnsdato')
     A            GDSLON      0006S 0
     A                                      COLHDG('LØnnsnummer')
     A            GDSNAV      0030A
     A                                      COLHDG('Navn')
     A            GDSREF      0006A
     A                                      COLHDG('Bankens ref.nr.')
     A            GDSBEL      0011P 2
     A                                      COLHDG('Beløp')
     A            GDSTKI      0011S 0
     A                                      COLHDG('Til konto')
     A            GDSUBF      0003S 0
     A                                      COLHDG('Forslagsnummer')
     A            GDSBFL      0005S 0
     A                                      COLHDG('Forslags-linjenummer')
     A            GDSOPP      0001S 0
     A                                      COLHDG('Allerede oppdat. = 1')
     A**
     A**  2. gangs returfile - Lønn:
     A**
     A            GDTFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDTFOR      0008S 0
     A                                      COLHDG('Lønnsdato')
     A            GDTLON      0006S 0
     A                                      COLHDG('Lønnsnummer')
     A            GDTNAV      0030A
     A                                      COLHDG('Navn')
     A            GDTREF      0006A
     A                                      COLHDG('Bankens ref.nr.')
     A            GDTBEL      0011P 2
     A                                      COLHDG('Beløp')
     A            GDTTKI      0011S 0
     A                                      COLHDG('Til konto')
     A            GDTUBF      0003S 0
     A                                      COLHDG('Forslagsnummer')
     A            GDTBFL      0005S 0
     A                                      COLHDG('Forslags-linjenummer')
     A            GDTOPP      0001S 0
     A                                      COLHDG('Allerede oppdat. = 1')
     A**
     A**  Feilretur - Lønn:
     A**
     A            GDVFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDVTRK      0008A
     A                                      COLHDG('Transaksjonskode')
     A            GDVRET      0002S 0
     A                                      COLHDG('Returkode')
     A            GDVFOR      0008S 0
     A                                      COLHDG('Lønnsdato- ÅÅÅÅMMDD.')
     A            GDVLON      0006S 0
     A                                      COLHDG('Lønnsnummer')
     A            GDVNAV      0030A
     A                                      COLHDG('Navn')
     A            GDVUBF      0003S 0
     A                                      COLHDG('Forslagsnummer')
     A            GDVBFL      0005S 0
     A                                      COLHDG('Forslags-linjenummer')
     A            GDVOPP      0001S 0
     A                                      COLHDG('Allerede oppdat. = 1')
     A**
     A**  DIRREM - Remitteringsfile til bank:
     A**
     A            GDQREM      0080A
     A                                      COLHDG('Hele recorden')
     A**
     A**  ATRTPF - Returfile telegiro:
     A**
     A            GDQBET      0320A
     A                                      COLHDG('Hele recorden')
     A            GDQFGR      0003A
     A                                      COLHDG('Filgruppe')
     A            GDQFIR      0003S 0
     A                                      COLHDG('Firma')
     A            GDQDAT      0008S 0
     A                                      COLHDG('Mottatt ÅÅÅÅMMDD')
     A            GDQTIM      0006S 0
     A                                      COLHDG('Mottatt klokken.HMS.')
     A**
     A**  GOCRPF - Returer fra OCR og BBS lest inn via kommunikasjon.
     A**
     A            GDQOCR      0103A
     A                                      COLHDG('Hele recorden')
     A**
     A**  GOTRPF - OCR-returer til oppdatering:
     A**
     A            GDQOCO      0080A
     A                                      COLHDG('Hele recorden')
     A            GDQOFI      0003S 0
     A                                      COLHDG('Firma')
     A**
     A**  GINKPF - Inkassoreturer.
     A**
     A            GDQINK      0080A
     A                                      COLHDG('Hele recorden')
     A**
     A**  GISOPF - Hjelpefile for sortering av Inkassoreturer:
     A**
     A            GDQISO      0080A
     A                                      COLHDG('Hele recorden')
     A            GDQIFG      0003A
     A                                      COLHDG('Filgruppe')
     A            GDQIFI      0003S 0
     A                                      COLHDG('Firma')
     A            GDQITY      0003A
     A                                      COLHDG('Type inkassoretur')
     A**
     A**  GPCFPF - File for navnsetting av bankfiler:
     A**
     A            GDFFGR      0003A
     A                                      COLHDG('Filgruppe')
     A            GDFFIR      0003S 0
     A                                      COLHDG('Firmanummer')
     A            GDFREM      0020A
     A                                      COLHDG('Remitteringsfil')
     A            GDFMOT      0020A
     A                                      COLHDG('Mottaksretur')
     A            GDFAVR      0020A
     A                                      COLHDG('Avregningsretur')
     A            GDFOCR      0020A
     A                                      COLHDG('OCR-retur')
     A            GDFKTO      0020A
     A                                      COLHDG('Kontoinformasjon')
     A            GDFINK      0020A
     A                                      COLHDG('Inkassoretur')
     A            GDFTFF      0020A
     A                                      COLHDG('Feilretur')
     A**
     A**  ATGIPF - Returer fra Telegiro lest inn via kommunikasjon.
     A**
     A            GDQTGI      0080A
     A                                      COLHDG('Hele recorden')
     A**
     A**  AKTOPF - Returer fra Kontoavst. lest inn via kommunikasjon.
     A**
     A            GDQKTO      0160A
     A                                      COLHDG('Hele recorden')
     A**
     A**  ARETPF - Samlefile for transaksjoner fra kommunikasjon.
     A**
     A            GDQRET      0160A
     A                                      COLHDG('Hele recorden')
     A**
     A**  BETFOR00-Hjelpefelter ved overstyring av databasefile:
     A**
     A            GDHDE0      0005A
     A                                      COLHDG('Felt-1')
     A            GDHDE1      0004A
     A                                      COLHDG('Felt-2')
     A            GDHDE2      0051A
     A                                      COLHDG('Felt-3')
     A            GDHDE3      0246A
     A                                      COLHDG('Felt-4')
     A**
     A**  BETFOR01-Hjelpefelter ved overstyring av databasefile:
     A**
     A            GDADE0      0005A
     A                                      COLHDG('Felt-1')
     A            GDADE1      0004A
     A                                      COLHDG('Felt-2')
     A            GDADE2      0051A
     A                                      COLHDG('Felt-3')
     A            GDADE3      0020A
     A                                      COLHDG('Felt-4')
     A            GDADE4      0010A
     A                                      COLHDG('Felt-5')
     A            GDADE5      0210A
     A                                      COLHDG('Felt-6')
     A**
     A**  BETFOR02-Hjelpefelter ved overstyring av databasefile:
     A**
     A            GDBDE0      0005A
     A                                      COLHDG('Felt-1')
     A            GDBDE1      0004A
     A                                      COLHDG('Felt-2')
     A            GDBDE2      0051A
     A                                      COLHDG('Felt-3')
     A            GDBDE3      0246A
     A                                      COLHDG('Felt-4')
     A**
     A**  BETFOR03-Hjelpefelter ved overstyring av databasefile:
     A**
     A            GDCDE0      0005A
     A                                      COLHDG('Felt-1')
     A            GDCDE1      0004A
     A                                      COLHDG('Felt-2')
     A            GDCDE2      0051A
     A                                      COLHDG('Felt-3')
     A            GDCDE3      0246A
     A                                      COLHDG('Felt-4')
     A**
     A**  BETFOR04-Hjelpefelter ved overstyring av databasefile:
     A**
     A            GDDDE0      0005A
     A                                      COLHDG('Felt-1')
     A            GDDDE1      0004A
     A                                      COLHDG('Felt-2')
     A            GDDDE2      0051A
     A                                      COLHDG('Felt-3')
     A            GDDDE3      0056A
     A                                      COLHDG('Felt-4')
     A            GDDDE4      0176A
     A                                      COLHDG('Felt-5')
     A**
     A**  BETFOR21-Hjelpefelter ved overstyring av databasefile:
     A**
     A            GDJDE0      0005A
     A                                      COLHDG('Felt-1')
     A            GDJDE1      0004A
     A                                      COLHDG('Felt-2')
     A            GDJDE2      0051A
     A                                      COLHDG('Felt-3')
     A            GDJDE3      0020A
     A                                      COLHDG('Felt-4')
     A            GDJDE4      0010A
     A                                      COLHDG('Felt-5')
     A            GDJDE5      0210A
     A                                      COLHDG('Felt-6')
     A**
     A**  BETFOR22-Hjelpefelter ved overstyring av databasefile:
     A**
     A            GDKDE0      0005A
     A                                      COLHDG('Felt-1')
     A            GDKDE1      0004A
     A                                      COLHDG('Felt-2')
     A            GDKDE2      0051A
     A                                      COLHDG('Felt-3')
     A            GDKDE3      0208A
     A                                      COLHDG('Felt-4')
     A            GDKDE4      0035A
     A                                      COLHDG('Felt-5')
     A**
     A**  BETFOR23-Hjelpefelter ved overstyring av databasefile:
     A**
     A            GDLDE0      0005A
     A                                      COLHDG('Felt-1')
     A            GDLDE1      0004A
     A                                      COLHDG('Felt-2')
     A            GDLDE2      0051A
     A                                      COLHDG('Felt-3')
     A            GDLDE3      0168A
     A                                      COLHDG('Felt-4')
     A            GDLDE4      0064A
     A                                      COLHDG('Felt-5')
     A**
     A**  BETFOR99-Hjelpefelter ved overstyring av databasefile:
     A**
     A            GDZDE0      0005A
     A                                      COLHDG('Felt-1')
     A            GDZDE1      0004A
     A                                      COLHDG('Felt-2')
     A            GDZDE2      0051A
     A                                      COLHDG('Felt-3')
     A            GDZDE3      0029A
     A                                      COLHDG('Felt-4')
     A            GDZDE4      0212A
     A                                      COLHDG('Felt-5')
     A**
     A**  Avtaleregister:
     A**
     A            GCSTAT      0001A
     A                                      COLHDG('Status')
     A            GCBGIR      0011S 0
     A                                      COLHDG('Bankgironummer')
     A            GCPGIR      0011S 0
     A                                      COLHDG('Postgironummer')
     A            GCDATO      0008S 0
     A                                      COLHDG('Avtaledato ÅÅÅÅMMDD')
     A            GCKOMM      0030A
     A                                      COLHDG('Kommentar')
     A            GCFILG      0003A
     A                                      COLHDG('Filgruppe')
     A            GCFIRM      0003S 0
     A                                      COLHDG('Firmanummer')
     A            GCLØPN      0005S 0
     A                                      COLHDG('Løpenummer')
     A            GCAVTN      0009S 0
     A                                      COLHDG('Avtalenummer')
     A            GCSKTO      0011S 0
     A                                      COLHDG('Sonegironummer')
     A            GCSKOD      0003A
     A                                      COLHDG('Sonekode')
     A            GCSLOK      0030A
     A                                      COLHDG('Lokasjon/Sted')
     A            GCBANK      0003A
     A                                      COLHDG('Bankkode')
     A            GCHKON      0005S 0
     A                                      COLHDG('Konto')
     A            GCAVDE      0004S 0
     A                                      COLHDG('Avd.')
T5.00A            GCSPES      0004S 0
     A                                      COLHDG('Bærer')
     A**
     A**  Oppsamlingsfile for eksterne transaksjoner:
     A**
     A            GBRECO      0080A
     A                                      COLHDG('Ekstern record')
     A            GBGIRO      0011S 0
     A                                      COLHDG('Gironummer')
     A            GBLØPN      0005S 0
     A                                      COLHDG('Løpenummer')
     A            GBTYPE      0003A
     A                                      COLHDG('Type oppdrag')
     A            GBTELL      0005S 0
     A                                      COLHDG('Teller pr. løpenr')
     A            GBOPPD      0007S 0
     A                                      COLHDG('Oppdrag')
     A            GBDATO      0008S 0
     A                                      COLHDG('Overføringsdato')
     A            GBKLOK      0006S 0
     A                                      COLHDG('Tidspunkt TTMMSS')
     A            GBFGRP      0003A
     A                                      COLHDG('Filgruppe')
     A            GBFIRM      0003S 0
     A                                      COLHDG('Firma')
     A**
     A**
     A**  Oppsamlingsfile for eksterne transaksjoner:
     A**
     A            GFRECO      0080A
     A                                      COLHDG('Ekstern record')
     A            GFGIRO      0011S 0
     A                                      COLHDG('Gironummer')
     A            GFLØPN      0005S 0
     A                                      COLHDG('Løpenummer')
     A            GFTYPE      0003A
     A                                      COLHDG('Type oppdrag')
     A            GFTELL      0005S 0
     A                                      COLHDG('Teller pr. løpenr.')
     A            GFOPPD      0007S 0
     A                                      COLHDG('Oppdrag')
     A            GFDATO      0008S 0
     A                                      COLHDG('Overføringsdato')
     A            GFKLOK      0006S 0
     A                                      COLHDG('Tidspunkt TTMMSS')
     A            GFFGRP      0003A
     A                                      COLHDG('Filgruppe')
     A            GFFIRM      0003S 0
     A                                      COLHDG('Firma')
     A*
     A*  Feltdefinisjon bankavstemming
     A*
     A            DBSTAT      0001A
     A                                      COLHDG('Status')
     A                                      TEXT('Status')
     A            DBBKON      0011S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bankkonto')
     A                                      TEXT('Bankkonto')
     A            DBTIST          Z
     A                                      TEXT('Timestamp')
     A                                      COLHDG('T-stamp')
     A            DBBDAT          L
     A                                      COLHDG('Bokføringsdato')
     A                                      TEXT('Bokføringsdato')
     A            DBVDAT          L
     A                                      COLHDG('Valuteringsdato')
     A                                      TEXT('Valuteringsdato')
     A            DBTEKS      0009A
     A                                      COLHDG('Tekstkode')
     A                                      TEXT('Tekstkode')
     A            DBREF1      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('BBS-ref1')
     A                                      TEXT('BBS-ref1')
     A            DBREF2      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('BBS-ref2')
     A                                      TEXT('BBS-ref2')
     A            DBREF3      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('BBS-ref3')
     A                                      TEXT('BBS-ref3')
     A            DBREF4      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ark-ref4')
     A                                      TEXT('Ark-ref4')
     A            DBREF5      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ark-ref5')
     A                                      TEXT('Ark-ref5')
     A            DBREF6      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ark-ref6')
     A                                      TEXT('Ark-ref6')
     A            DBBELP      0015S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Beløp')
     A                                      TEXT('Beløp')
     A            DBSALD      0015S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Saldo')
     A                                      TEXT('Saldo')
     A            DBAVST      0001A
     A                                      COLHDG('Statusfelt - Avstemt')
     A                                      TEXT('Statusfelt - Avstemt')
     A*
     A*  ASBANK Kontoinformasjon bank
     A*
     A            DCSTAT      0001A
     A                                      COLHDG('Status')
     A                                      TEXT('Status')
     A            DCFIRM      0003S 0
     A                                      COLHDG('Firmanummer')
     A                                      TEXT('Firmanummer')
     A            DCBKON      0011S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bankkonto')
     A                                      TEXT('Bankkonto')
     A            DCTIST          Z
     A                                      TEXT('Timestamp')
     A                                      COLHDG('T-stamp')
     A            DCBDAT          L
     A                                      COLHDG('Bokføringsdato')
     A                                      TEXT('Bokføringsdato')
     A            DCVDAT          L
     A                                      COLHDG('Valuteringsdato')
     A                                      TEXT('Valuteringsdato')
     A            DCTEKS      0009A
     A                                      COLHDG('Tekstkode')
     A                                      TEXT('Tekstkode')
     A            DCBBSR      0009A
     A                                      COLHDG('Ref-BBS')
     A                                      TEXT('Ref-BBS')
     A            DCREFR      0012A
     A                                      COLHDG('Ref-Ark')
     A                                      TEXT('Ref-Ark')
     A            DCREF1      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('BBS-ref1')
     A                                      TEXT('BBS-ref1')
     A            DCREF2      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('BBS-ref2')
     A                                      TEXT('BBS-ref2')
     A            DCREF3      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('BBS-ref3')
     A                                      TEXT('BBS-ref3')
     A            DCREF4      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ark-ref4')
     A                                      TEXT('Ark-ref4')
     A            DCREF5      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ark-ref5')
     A                                      TEXT('Ark-ref5')
     A            DCREF6      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ark-ref6')
     A                                      TEXT('Ark-ref6')
     A            DCBELP      0015S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Beløp')
     A                                      TEXT('Beløp')
     A            DCBELK      0001A
     A                                      COLHDG('Debet/Kredit')
     A                                      TEXT('Debet/Kredit')
     A            DCSALD      0015S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Saldo')
     A                                      TEXT('Saldo')
     A            DCAVST      0001A
     A                                      COLHDG('Statusfelt - Avstemt')
     A                                      TEXT('Statusfelt - Avstemt')
     A            DCNREF      0011S 0
     A                                      COLHDG('Numerisk referanse..')
     A                                      TEXT('Numerisk referanse..')
     A            DCAREF      0009A
     A                                      COLHDG('Arkiv referanse.....')
     A                                      TEXT('Arkiv referanse.....')
     A            DCMOÅR      0004S 0
     A                                      COLHDG('Mottatt år..........')
     A                                      TEXT('Mottatt år............')
     A            DCMOMN      0002S 0
     A                                      COLHDG('Mottatt måned.......')
     A                                      TEXT('Mottatt måned.........')
     A            DCREFA      0009A
     A                                      COLHDG('BBS-ref A')
     A                                      TEXT('BBS-ref A')
     A            DCREFB      0009A
     A                                      COLHDG('BBS-ref B')
     A                                      TEXT('BBS-ref B')
     A            DCREFC      0006A
     A                                      COLHDG('BBS-ref C')
     A                                      TEXT('BBS-ref C')
     A            DCREFD      0005A
     A                                      COLHDG('Ark-ref D')
     A                                      TEXT('Ark-ref D')
     A            DCRTYP      0001A
     A                                      COLHDG('Avstemt rapporttype')
     A                                      TEXT('Avstemt rapporttype')
     A            DCMKRY      0001A
     A                                      COLHDG('Manuelt avkrysset')
     A                                      TEXT('Manuelt avkrysset')
     A            DCUSER      0010A
     A                                      COLHDG('Manuelt avkrysset av')
     A                                      TEXT('Manuelt avkrysset av')
     A            DCDKRY    R               REFFLD(RÅEDAT)
     A                                      COLHDG('Manuelt avkr. dato')
     A                                      TEXT('Manuelt avkrysset dato')
     A            DCTKRY    R               REFFLD(RÅETIM)
     A                                      COLHDG('Manuelt avkr.klokken')
     A                                      TEXT('Manuelt avkrysset klokken')
     A*
     A*  ASBANK Kontoinformasjon mottatt dobbelt
     A*
     A            DESTAT      0001A
     A                                      COLHDG('Status')
     A                                      TEXT('Status')
     A            DEBKON      0011S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bankkonto')
     A                                      TEXT('Bankkonto')
     A            DETIST          Z
     A                                      TEXT('Timestamp')
     A                                      COLHDG('T-stamp')
     A            DEBDAT          L
     A                                      COLHDG('Bokføringsdato')
     A                                      TEXT('Bokføringsdato')
     A            DEVDAT          L
     A                                      COLHDG('Valuteringsdato')
     A                                      TEXT('Valuteringsdato')
     A            DETEKS      0009A
     A                                      COLHDG('Tekstkode')
     A                                      TEXT('Tekstkode')
     A            DEREF1      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('BBS-ref1')
     A                                      TEXT('BBS-ref1')
     A            DEREF2      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('BBS-ref2')
     A                                      TEXT('BBS-ref2')
     A            DEREF3      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('BBS-ref3')
     A                                      TEXT('BBS-ref3')
     A            DEREF4      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ark-ref4')
     A                                      TEXT('Ark-ref4')
     A            DEREF5      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ark-ref5')
     A                                      TEXT('Ark-ref5')
     A            DEREF6      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Ark-ref6')
     A                                      TEXT('Ark-ref6')
     A            DEBELP      0015S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Beløp')
     A                                      TEXT('Beløp')
     A            DESALD      0015S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Saldo')
     A                                      TEXT('Saldo')
     A            DEAVST      0001A
     A                                      COLHDG('Statusfelt - Avstemt')
     A                                      TEXT('Statusfelt - Avstemt')
     A            DEDATO          L
     A                                      COLHDG('Mottatt dato........')
     A                                      TEXT('Mottatt dato..........')
     A            DEKLOK          T
     A                                      COLHDG('Mottatt klokken.....')
     A                                      TEXT('Mottatt klokken.......')
     A*
     A*  ASBANK Faste data
     A*
     A            DABKON      0011S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bankkonto')
     A                                      TEXT('Bankkonto')
     A            DAFIGR      0003A
     A                                      COLHDG('Filgr')
     A                                      TEXT('Filgr')
     A            DAFIRM      0003S 0
     A                                      COLHDG('Firma')
     A                                      TEXT('Firma')
     A            DAHKON      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A                                      TEXT('Konto')
     A            DAAVDE      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avd.')
     A                                      TEXT('Avdeling')
     A            DASPES      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bærer')
     A                                      TEXT('Bærer')
     A            DAFDAT          L
     A                                      COLHDG('Første dato')
     A                                      TEXT('Første dato')
     A            DASDAT          L
     A                                      COLHDG('Siste dato')
     A                                      TEXT('Siste dato')
     A            DASSTR          L
     A                                      COLHDG('Siste start-dato')
     A                                      TEXT('Siste start-dato')
     A            DASSLT          L
     A                                      COLHDG('Siste slutt-dato')
     A                                      TEXT('Siste Slutt-dato')
     A            DASSTP      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Siste start-per')
     A                                      TEXT('Siste start-per')
     A            DASSLP      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Siste slutt-per')
     A                                      TEXT('Siste Slutt-per')
     A            DASKJO          L
     A                                      COLHDG('Siste kjøring')
     A                                      TEXT('Siste kjøring')
     A            DATIST          Z
     A                                      TEXT('Timestamp')
     A                                      COLHDG('T-stamp')
     A            DAUTAV      0010A
     A                                      COLHDG('Utført av')
     A                                      TEXT('Utført av')
     A            DABANK      0003A
     A                                      COLHDG('Bank')
     A                                      TEXT('Bank')
     A            DAØKON      0001A
     A                                      COLHDG('ØKONOMISYSTEM')
     A                                      TEXT('ØKONOMISYSTEM')
     A            DAINDA          L
     A                                      COLHDG('Dato ing.saldo-')
     A                                      TEXT('Dato ing.saldo')
     A            DAINSA      0015S 2
     A                                      COLHDG('Inngående saldo')
     A                                      TEXT('Inngående saldo')
     A*
     A*  ASBANK Kontoinformasjon hovedbok til avstemming
     A*
     A            DDFIRM      0003S 0
     A                                      COLHDG('Firma')
     A            DDHBOK      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Konto')
     A                                      TEXT('Konto')
     A            DDBDAT          L
     A                                      COLHDG('Bilagsdato')
     A                                      TEXT('Bilagsdato')
     A            DDTIST          Z
     A                                      TEXT('Timestamp')
     A                                      COLHDG('T-stamp')
6.30 A            DDBILN      0008S 0
     A                                      COLHDG('Bilagsnummer')
     A                                      TEXT('Bilagsnummer')
     A            DDTEXT      0020A
     A                                      COLHDG('Bilagstekst')
     A                                      TEXT('Bilagstekst')
     A            DDREFR      0012A
     A                                      COLHDG('Ref-REF')
     A                                      TEXT('Ref-REF')
     A            DDBELP      0015S 2
     A                                      EDTCDE(K)
     A                                      COLHDG('Beløp')
     A                                      TEXT('Beløp')
     A            DDBELK      0001A
     A                                      COLHDG('Debet/Kredit')
     A                                      TEXT('Debet/Kredit')
     A            DDREFA      0006A
     A                                      COLHDG('BBS-ref A')
     A                                      TEXT('BBS-ref A')
     A            DDREFB      0005A
     A                                      COLHDG('BBS-ref B')
     A                                      TEXT('BBS-ref B')
     A            DDAVST      0001A
     A                                      COLHDG('Avstemt=1/Oppdat.=2')
     A                                      TEXT('Avstemt=1/Oppdat.=2')
     A            DDRTYP      0001A
     A                                      COLHDG('Avstemt rapporttype')
     A                                      TEXT('Avstemt rapporttype')
     A            DDRAAR      0004S 0
     A                                      COLHDG('År til bruk RHTRPF')
     A                                      TEXT('År til bruk mot RHTRPF')
     A            DDSPES      0004S 0
     A                                      COLHDG('Spes til bruk RHTRPF')
     A                                      TEXT('Spes til bruk mot RHTRPF')
     A            DDAVDE      0004S 0
     A                                      COLHDG('Avde til bruk RHTRPF')
     A                                      TEXT('Avde til bruk mot RHTRPF')
     A            DDRPER      0002S 0
     A                                      COLHDG('Peri til bruk RHTRPF')
     A                                      TEXT('Peri til bruk mot RHTRPF')
     A            DDMKRY      0001A
     A                                      COLHDG('Manuelt avkrysset')
     A                                      TEXT('Manuelt avkrysset')
     A            DDUSER      0010A
     A                                      COLHDG('Manuelt avkrysset av')
     A                                      TEXT('Manuelt avkrysset av')
     A            DDDKRY          L
     A                                      COLHDG('Manuelt avkr. dato')
     A                                      TEXT('Manuelt avkrysset dato')
     A            DDTKRY          T
     A                                      COLHDG('Manuelt avkr.klokken')
     A                                      TEXT('Manuelt avkrysset klokken')
     A*   FRA ASTELE
     A*   Syst. Adm. FRF (FELLES ARBEIDSFELTER)
     A*
     A            AAVALG      0001A
     A                                      COLHDG('Valg')
     A                                      TEXT('Valg')
     A            AANYEN      0011A
     A                                      COLHDG('Ny/Endr')
     A                                      TEXT('Ny/Endr')
     A            AAMELD      0050A
     A                                      COLHDG('Meldingsfelt')
     A                                      TEXT('Meldingsfelt')
     A            AADATO      0008S 0
     A                                      COLHDG('Datofelt........ ...')
      *
      * Almenning-register                  (RM)
      *
     A            RMFIRM    R               REFFLD(RÅFIRM)
     A            RMALME    R               REFFLD(RÅALME)
     A            RMNAVN        30A         TEXT('Navn')
     A                                      COLHDG('Navn')
     A            RMADR1        30A         TEXT('Adresse 1')
     A                                      COLHDG('Adresse 1')
     A            RMADR2        30A         TEXT('Adresse 2')
     A                                      COLHDG('Adresse 2')
     A            RMPONR         4S 0       TEXT('Postnummer')
     A                                      COLHDG('Postnr')
     A                                      EDTCDE(Z)
     A            RMTLFN        15A         TEXT('Telefon')
     A                                      COLHDG('Tlf.')
     A            RMFAKS        15A         TEXT('Faks')
     A                                      COLHDG('Faks')
     A            RMMAIL        50A         TEXT('E-mail adresse')
     A                                      COLHDG('E-mail')
     A            RMURLA        50A         TEXT('URL-adresse')
     A                                      COLHDG('URL-adresse')
     A            RMKPRS        30A         TEXT('Kontaktperson')
     A                                      COLHDG('Kontaktperson')
     A            RMKTLF        15A         TEXT('Kontaktperson telefon')
     A                                      COLHDG('Kontaktperson' 'telefon')
     A            RMKMOB        15A         TEXT('Kontaktperson mobiltelefon')
     A                                      COLHDG('Kontaktperson' 'mobilnr')
     A            RMKMAI        50A         TEXT('Kontaktperson E-mail adresse')
     A                                      COLHDG('Kontaktperson' 'E-mail')
T5.50A            RMBGRN         9S 0       TEXT('Beløpsgrense')
T5.50A                                      COLHDG('Beløpsgrense')
      *
     A            RMODAT    R               REFFLD(RÅODAT)
     A            RMEDAT    R               REFFLD(RÅEDAT)
     A            RMETIM    R               REFFLD(RÅETIM)
     A            RMEUSR    R               REFFLD(RÅEUSR)
      *
      * Bruksrett-type                      (RMT)
      *
     A            RMTFIR    R               REFFLD(RÅFIRM)
     A            RMTALM    R               REFFLD(RÅALME)
     A            RMTBRT    R               REFFLD(RÅBRTY)
     A            RMTTXT        30A         TEXT('Beskrivelse')
     A                                      COLHDG('Beskrivelse')
     A            RMTRA1         5S 2       TEXT('Rabatt 1')
     A                                      COLHDG('Rab. 1')
     A                                      EDTCDE(Z)
     A            RMTRA2         5S 2       TEXT('Rabatt 2')
     A                                      COLHDG('Rab. 2')
     A                                      EDTCDE(Z)
     A            RMTMVA         1A         TEXT('MVA-kode')
     A                                      COLHDG('MVA-kode')
     A            RMTAVD         4S 0       TEXT('Avdeling')
     A                                      COLHDG('Avd')
     A                                      EDTCDE(Z)
     A            RMTKTO         5S 0       TEXT('Konto')
     A                                      COLHDG('Konto')
     A                                      EDTCDE(Z)
     A            RMTSPS         4S 0       TEXT('Bærer')
     A                                      COLHDG('Bærer')
     A                                      EDTCDE(Z)
T5.50A            RMTSKO         1S 0       TEXT('Sumkode')
T5.50A                                      COLHDG('Sumkode')
     A            RMTODA    R               REFFLD(RÅODAT)
     A            RMTEDA    R               REFFLD(RÅEDAT)
     A            RMTETI    R               REFFLD(RÅETIM)
     A            RMTEUS    R               REFFLD(RÅEUSR)
      *
      *  KUNDE Tilleggsinformasjon
      *        (RMKUPF + RMKULU + RMKUL1)
      *
     A            RMKFIR      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Firma')
     A            RMKUND      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kundenr.')
     A            RMKFDA          L
     A                                      TEXT('Fødselsdato')
     A                                      COLHDG('Født.dato')
      *
      *   Områdeinformasjon
      *                     (RMOMPF + RMOMLU + RMOML1)
      *
     A            RMOFIR      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Firma')
     A            RMOOMR      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Områdenr')
     A            RMONAV      0030A
     A                                      COLHDG('Områdenavn')
     A            RMOKTO      0004A
     A                                      COLHDG('Kontohenv.')
     A            RMOTYP      0002A
     A                                      COLHDG('Ordretype')
     A            RMOVNR      0008S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Varenr.')
6.2B  * Serviceavgift
6.2B  *
6.2B A            RMSTYP      0002A
6.2B A                                      COLHDG('Ordretype.serv')
6.2B A            RMSVNR      0008S 0
6.2B A                                      EDTCDE(Z)
6.2B A                                      COLHDG('Varenr.serv')
      *
     A            RMOODA    R               REFFLD(RÅODAT)
     A            RMOEDA    R               REFFLD(RÅEDAT)
     A            RMOETI    R               REFFLD(RÅETIM)
     A            RMOEUS    R               REFFLD(RÅEUSR)
      *
      *   Eiendomsinformasjon
      *                     (RMEIPF + RMEILU + RMEIL1)
      *
     A            RMEFIR      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Firma')
     A            RMEALM      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Almening')
     A            RMEOMR      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Områdenr')
     A            RMEINR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Eiendomr.')
     A            RMEKNR      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kundenr.')
     A            RMEGNR      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Gårdsnr.')
     A            RMEBNR      0005S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bruksnr.')
     A            RMEGAB      0010S 0
     A                                      COLHDG('GAB-nr.')
     A            RMENAV      0030A
     A                                      COLHDG('Navn')
     A            RMEAD1      0030A
     A                                      COLHDG('Adresse 1')
     A            RMEAD2      0030A
     A                                      COLHDG('Adresse 2')
     A            RMEPNR      0004S
     A                                      COLHDG('Postnr.')
     A            RMEARE      0007S 1
     A                                      COLHDG('Tot.areale')
     A            RMEDYR      0007S 1
     A                                      COLHDG('Dyrket')
     A            RMEUTM      0007S 1
     A                                      COLHDG('Utmark')
     A            RMEST1      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('St.rett1')
     A            RMEST2      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('St.rett2')
     A            RMENA2      0030A
     A                                      COLHDG('Navn St.rett2')
     A            RMTING      0001A
     A                                      COLHDG('Tinglyst')
     A            RMSAER      0001A
     A                                      COLHDG('Særeie')
     A            RMDRIF      0030A
     A                                      COLHDG('Driftsform')
     A            RMKARA      0001A
     A                                      COLHDG('Karakter av jordbruk')
     A            RMBORT      0001A
     A                                      COLHDG(' Bortleid')
     A            RMHBYG      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Hovedbygninger')
     A            RMLBYG      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Livørebygninger')
     A            RMDBYG      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Driftsbygninger')
     A            RMAHUS      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Andre hus')
     A            RMAVGI      0009S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Avgift')
     A            RMVUDA    R               REFFLD(RÅODAT)
     A                                      COLHDG('Vurderingsdato')
     A            RMINTV      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Tidsinterval')
     A            RMLTID      0002S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Leietid')
     A            RMTGDA    R               REFFLD(RÅODAT)
     A                                      COLHDG('Tingl.dato')
     A            RMBEBY      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bebygd areal')
     A            RMBYÅR      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Byggeår')
     A            RMFTYP      0001S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Leietype')
     A            RMKODA    R               REFFLD(RÅODAT)
     A                                      COLHDG('Kontraktsdato')
6.37 A            RMEKON      0004S 0
6.37 A                                      COLHDG('Kommunenr')
      *
     A            RMEODA    R               REFFLD(RÅODAT)
     A            RMEEDA    R               REFFLD(RÅEDAT)
     A            RMEETI    R               REFFLD(RÅETIM)
     A            RMEEUS    R               REFFLD(RÅEUSR)
      *
      *   Eiendomsknytning
      *                     (RMKNPF + RMKNLU + RMKNL1)
      *
     A            RMXFIR      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Firma')
     A            RMXALM      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Almening')
     A            RMXKNR      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Kundenr.')
     A            RMXRMM      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Almening')
     A            RMXGNR      0005S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Gårdsnr.')
     A            RMXBNR      0005S
     A                                      EDTCDE(Z)
     A                                      COLHDG('Bruksnr.')
     A            RMXODA    R               REFFLD(RÅODAT)
     A            RMXEDA    R               REFFLD(RÅEDAT)
     A            RMXETI    R               REFFLD(RÅETIM)
     A            RMXEUS    R               REFFLD(RÅEUSR)
      *
      *   Prosjekt rapport  RPRRPF
      *
     A            RPHFIR      0003S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Firma')
     A            RPHRAP      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rapport')
     A            RPHTXT      0030A
     A                                      COLHDG('Rapport' 'Tekst')
     A            RPHLIN      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rapport' 'Linje')
     A            RPHULI      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rapport' 'U-Linje')
     A            RPHKTF      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Fra' 'Konto')
     A            RPHBEF      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Fra' 'Bærer')
     A            RPHKTT      0006S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Til' 'Konto')
     A            RPHBET      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Til' 'Bærer')
     A            RPHLI1      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Linje1')
     A            RPHLI2      0004S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Linje2')
     A            RPHFRT      0001A
     A                                      COLHDG('Fra-Til')
     A            RPHFUN      0001A
     A                                      COLHDG('Funksjon')
     A            RPHPRO      0004S 1
     A                                      EDTCDE(Z)
     A                                      COLHDG('Prosent')
     A            RPHLKT      0001A
     A                                      COLHDG('Liste' 'Konto')
     A            RPHLPO      0001A
     A                                      COLHDG('Liste' 'Poster')
     A            RPHSKR      0001A
     A                                      COLHDG('Skrive' 'Linje')
     A            RPHFAP      0001A
     A                                      COLHDG('Farge' 'Pluss')
     A            RPHFAM      0001A
     A                                      COLHDG('Farge' 'Minus')
      *
     A            RPHODA    R               REFFLD(RÅODAT)
     A            RPHEDA    R               REFFLD(RÅEDAT)
     A            RPHETI    R               REFFLD(RÅETIM)
     A            RPHEUS    R               REFFLD(RÅEUSR)
6.2J A**
6.2J A** Kortregister - status saldosjekk
6.2J A**
6.2J A            RSJFIR      0003S 0       TEXT('Firma')
6.2J A                                      COLHDG('Firma')
6.2J  *
6.2J A            RSJNUM         8S 0       TEXT('Ordrenummer')
6.2J A                                      COLHDG('Ordrenummer')
6.2J A                                      EDTCDE(Z)
6.2J  *
6.2J A            RSJSUF         2S 0       TEXT('Suffiks')
6.2J A                                      COLHDG('Suffiks')
6.2J A                                      EDTCDE(Z)
6.2J  *
6.2J A            RSJKUN         6S 0       TEXT('Kundenummer')
6.2J A                                      COLHDG('Kundenummer')
6.2J A                                      EDTCDE(Z)
6.2J  *
6.2J A            RSJIDE      0025A         TEXT('Identitet')
6.2J A                                      COLHDG('Identitet')
6.2J  *
6.2J A            RSJSUM      0013S 2       TEXT('Saldo')
6.2J A                                      COLHDG('Saldo')
6.2J  *
6.2J A            RSJSTA      0001A         TEXT('Status')
6.2J A                                      COLHDG('Status')
6.2J  *
6.2J A            RSJMSG      0512A         TEXT('Beskrivelse')
6.2J A                                      COLHDG('Beskrivelse')
6.2J  *
6.2J A            RSJEDA          L         TEXT('Endret dato')
6.2J A                                      COLHDG('Endr.dato')
6.2J  *
6.2J A            RSJETI          T         TEXT('Endret tid')
6.2J A                                      COLHDG('Endr.tid')
6.2J  *
6.2J A            RSJEUS      0010A         TEXT('Endret av')
6.2J A                                      COLHDG('Endr.av')
6.2J  *
6.2J A            RSJODA    R               REFFLD(RÅODAT)
6.2J A            RSJOTI    R               REFFLD(RÅOTIM)
6.2J A            RSJOUS    R               REFFLD(RÅOUSR)
6.2K A**
6.2K A** Kortregister - status saldosjekk
6.2K A**
6.2K A            RBAFIR         3S 0       TEXT('Firma')
6.2K A                                      COLHDG('Firma')
6.2K  *
6.2K A            RBAAVD         4S 0       TEXT('Avdeling')
6.2K A                                      COLHDG('Avdeling')
6.2K A                                      EDTCDE(Z)
6.2K  *
6.2K A            RBAKAS         3A         TEXT('Kasseid')
6.2K A                                      COLHDG('Kasseid')
6.2K  *
6.2K A            RBABES        30A         TEXT('Beskrivelse')
6.2K A                                      COLHDG('Beskrivelse')
6.2K  *
6.2K A            RBAEDA          L         TEXT('Endret dato')
6.2K A                                      COLHDG('Endr.dato')
6.2K  *
6.2K A            RBAETI          T         TEXT('Endret tid')
6.2K A                                      COLHDG('Endr.tid')
6.2K  *
6.2K A            RBAEUS        10A         TEXT('Endret av')
6.2K A                                      COLHDG('Endr.av')
6.2K  *
6.2K A            RBAODA    R               REFFLD(RÅODAT)
6.2K A            RBAOTI    R               REFFLD(RÅOTIM)
6.2K A            RBAOUS    R               REFFLD(RÅOUSR)
6.2K A**
7.nx  *
7.nx  *   LAGER Sideregister      RA1XPF    (RAJ)
7.nx  *
7.nx A            RAJ2FI      0003S 0
7.nx A                                      COLHDG('Firma')
7.nx A            RAJ2KO      0002S 0
7.nx A                                      EDTCDE(Z)
7.nx A                                      COLHDG('Lager')
7.nx A            RAJ2LA      0002S 0
7.nx A                                      EDTCDE(Z)
7.nx A                                      COLHDG('Sent.lager')
7.nx A                                      TEXT('Sentral lager')
7.nx A            RAJ2DA    R               REFFLD(RÅEDAT)
7.nx A            RAJ2TI    R               REFFLD(RÅETIM)
7.nx A            RAJ2US    R               REFFLD(RÅEUSR)
      *
      *   KUNDE POSTERINGER       RKTXPF    (PN)  AVKRYSSING
      *
6.SS A            PNFIRM      0003S 0
6.SS A                                      TEXT('Firma')
6.SS A                                      COLHDG('Firma')
6.SS A            PNKUND      0006S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Kunde-nr.')
6.SS A                                      COLHDG('Kunde')
6.SS A            PNRAAR      0004S 0
6.SS A                                      TEXT('Regnskapsår')
6.SS A                                      COLHDG('År')
6.SS A            PNRPER      0002S 0
6.SS A                                      TEXT('Periode')
6.SS A                                      COLHDG('Per')
6.SS A            PNBDAT          L
6.SS A                                      TEXT('Bilags-dato')
6.SS A                                      COLHDG('Bil.' ' dato')
6.SS A            PNBILN      0008S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Bilagsnummer')
6.SS A                                      COLHDG('Bilag')
6.SS A            PNBILK      0002S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Bilags-kode')
6.SS A                                      COLHDG('Bk')
6.SS A            PNTEXT      0020A
6.SS A                                      TEXT('Bilagstekst')
6.SS A                                      COLHDG('Bilagstekst')
6.SS A            PNBELØ      0011S 2
6.SS A                                      EDTCDE(K)
6.SS A                                      TEXT('Beløp')
6.SS A                                      COLHDG('Beløp')
6.SS A            PNREST      0011S 2
6.SS A                                      EDTCDE(K)
6.SS A                                      TEXT('Restbeløp')
6.SS A                                      COLHDG('Restbeløp')
6.SS A            PNVALK      0003A
6.SS A                                      TEXT('Valuta-kode')
6.SS A                                      COLHDG('Val' 'kod')
6.SS A            PNVALB      0011S 2
6.SS A                                      EDTCDE(K)
6.SS A                                      TEXT('Valutabeløp')
6.SS A                                      COLHDG('Valutabeløp')
6.SS A            PNVALR      0011S 2
6.SS A                                      EDTCDE(K)
6.SS A                                      TEXT('Valuta-rest')
6.SS A                                      COLHDG('Valuta-rest')
6.SS A            PNFDAT          L
6.SS A                                      TEXT('Forfalls-dato')
6.SS A                                      COLHDG('For.' 'dato')
6.SS A            PNJOUR      0005S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Journalliste-nr.')
6.SS A                                      COLHDG('Journ' ' nr.')
6.SS A            PNSAMF      0008S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Samlefaktura-nr.')
6.SS A                                      COLHDG('S.fakt.' ' nr.')
6.SS A            PNSTAT      0001A
6.SS A                                      TEXT('Status')
6.SS A                                      COLHDG('St')
6.SS A            PNREFN      0008S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Referansenummer')
6.SS A                                      COLHDG('Refnr.')
6.SS A            PNVIRK      0002A
6.SS A                                      TEXT('Virksomhetskode')
6.SS A                                      COLHDG('Vir' 'kod')
6.SS A            PNAVDE      0004S 0
6.SS A                                      TEXT('Avdeling')
6.SS A                                      COLHDG('Avd')
6.SS A            PNKONT      0004S 0
6.SS A                                      TEXT('Konto')
6.SS A                                      COLHDG('Konto')
6.SS A            PNSPES      0004S 0
6.SS A                                      TEXT('Bærer')
6.SS A                                      COLHDG('Bærer')
6.SS A            PNSLGR      0004S 0
6.SS A                                      TEXT('Selger')
6.SS A                                      COLHDG('Slgr')
6.SS A            PNREKL      0001A
6.SS A                                      VALUES(' ' 'J')
6.SS A                                      CHKMSGID(RMK0350 *LIBL/QMFOKON)
6.SS A                                      TEXT('Reklamasjonskode')
6.SS A                                      COLHDG('Rk.' 'kd')
6.SS A            PNRENK      0001S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      VALUES(0 1 3 5)
6.SS A                                      CHKMSGID(RMK0330 *LIBL/QMFOKON)
6.SS A                                      TEXT('Renteberegnet')
6.SS A                                      COLHDG('Rt')
6.SS A            PNRDAT          L
6.SS A                                      TEXT('Siste rente-dato')
6.SS A                                      COLHDG('S.rnt' 'dato')
6.SS A            PNANTP      0001S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Antall purringer')
6.SS A                                      COLHDG('An' 'pu')
6.SS A            PNPDAT          L
6.SS A                                      TEXT('Siste purre-dato')
6.SS A                                      COLHDG('S.pur' 'dato')
6.SS A            PNINKO      0001A
6.SS A                                      VALUES(' ' 'B' 'J')
6.SS A                                      CHKMSGID(RMK0340 *LIBL/QMFOKON)
6.SS A                                      TEXT('Inkassokode')
6.SS A                                      COLHDG('In' 'kd')
6.SS A            PNIDAT          L
6.SS A                                      TEXT('Inkassodato')
6.SS A                                      COLHDG('I.da' 'dato')
6.SS A            PNODAT          L
6.SS A                                      TEXT('Oppgjørsdato')
6.SS A                                      COLHDG('O.da' 'dato')
6.SS A            PNAUTO      0001A
6.SS A                                      TEXT('Autogiro kode')
6.SS A                                      COLHDG('Autog' 'Kode')
6.SS A            PNADAT          L
6.SS A                                      TEXT('Autogiro dato')
6.SS A                                      COLHDG('Autog' 'dato')
6.SS A            PNFACK      0001S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      VALUES(0 1)
6.SS A                                      TEXT('Ikke factoring')
6.SS A                                      COLHDG('Fact')
6.SS A            PNFADA          L
6.SS A                                      TEXT('Overført dato')
6.SS A                                      COLHDG('Fact' 'dato')
6.SS A            PNTIST          Z
6.SS A                                      TEXT('PstTimest.RKTR')
6.SS A                                      COLHDG('Post' 't-stamp')
6.SS A            PNTISD          Z
6.SS A                                      TEXT('PstTimest.RKTX')
6.SS A                                      COLHDG('Post' 't-stamp')
6.SS A            PNKIDI      0025A
6.SS A                                      COLHDG('Kundeident')
      *
7.NX A            PNKIDR      0008S 0       TEXT('Kidd referansenr')
6.SS A                                      COLHDG('Kidd' 'Ref')
6.SS A                                      EDTCDE(Z)
      *
6.SS A            PNKSIF      0001S 0       TEXT('Kontroll-siffer')
6.SS A                                      COLHDG('Kont' 'Siff')
6.SS A                                      EDTCDE(Z)
6.SS  *
6.SS A            PNKID2      0025A         TEXT('Kiddnummer 2')
6.SS A                                      COLHDG('Kidd-2')
6.SS A            PNSPOR      0010S 0
6.SS A                                      TEXT('Spor.ref.')
6.SS A                                      COLHDG('Spor.ref.')
6.SS A            PNAVKR      0010S 0
6.SS A                                      TEXT('Avkr.ref.')
6.SS A                                      COLHDG('Avkr.ref.')
6.SS A            PNDATE    R               REFFLD(RÅODAT)
6.SS A            PNOTIM    R               REFFLD(RÅOTIM)
6.SS A            PNOUSR    R               REFFLD(RÅOUSR)
6.SS A            PNEDAT    R               REFFLD(RÅEDAT)
6.SS A            PNETIM    R               REFFLD(RÅETIM)
6.SS A            PNEUSR    R               REFFLD(RÅEUSR)
6.SS  *
6.SS  *   LEVERANDØR POSTERINGER  RLTRPF    (RO)
6.SS  *
6.SS A            POFIRM      0003S 0
6.SS A                                      TEXT('Firma')
6.SS A                                      COLHDG('Firma')
6.SS A            POLEVR      0006S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Leverandør-nr.')
6.SS A                                      COLHDG('Lever.')
6.SS A            PORAAR      0004S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Regnskapsår')
6.SS A                                      COLHDG('År')
6.SS A            PORPER      0002S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Periode')
6.SS A                                      COLHDG('Per.')
6.SS A            POBDAT          L
6.SS A                                      TEXT('Bilags-dato')
6.SS A                                      COLHDG('Bil' 'dato')
6.SS A            POBILN      0008S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Bilagsnummer')
6.SS A                                      COLHDG('Bil.nr')
6.SS A            POBILK      0002S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Bilags-kode')
6.SS A                                      COLHDG('Bk')
6.SS A            POTEXT      0020A
6.SS A                                      TEXT('Bilagstekst')
6.SS A                                      COLHDG('Bilagstekst')
6.SS A            POBELØ      0011S 2
6.SS A                                      EDTCDE(K)
6.SS A                                      TEXT('Beløp')
6.SS A                                      COLHDG('Beløp')
6.SS A            POREST      0011S 2
6.SS A                                      EDTCDE(K)
6.SS A                                      TEXT('Restbeløp')
6.SS A                                      COLHDG('Restbeløp')
6.SS A            POVALK      0003A
6.SS A                                      TEXT('Valuta-kode')
6.SS A                                      COLHDG('Val' 'kod')
6.SS A            POVALB      0011S 2
6.SS A                                      EDTCDE(K)
6.SS A                                      TEXT('Valutabeløp')
6.SS A                                      COLHDG('Valutabeløp')
6.SS A            POVALR      0011S 2
6.SS A                                      EDTCDE(K)
6.SS A                                      TEXT('Valuta-rest')
6.SS A                                      COLHDG('Valuta-rest')
6.SS A            POFDAT          L
6.SS A                                      TEXT('Forfalls-dato')
6.SS A                                      COLHDG('For' 'dato')
6.SS A            POJOUR      0005S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Journalliste-nr.')
6.SS A                                      COLHDG('Journ' ' nr.')
6.SS A            POSAMB      0008S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Samlebilag-nr.')
6.SS A                                      COLHDG('S.bil.' ' nr.')
6.SS A            POBETK      0001A
6.SS A                                      VALUES(' ' '1' '2')
6.SS A                                      CHKMSGID(RML0210 *LIBL/QMFOKON)
6.SS A                                      TEXT('Remitteringskode')
6.SS A                                      COLHDG('Rm' 'kd')
6.SS A            POREFN      0008S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Referansenummer')
6.SS A                                      COLHDG('Refnr.')
6.SS A            POVIRK      0002A
6.SS A                                      TEXT('Virksomhetskode')
6.SS A                                      COLHDG('Vir' 'kod')
6.SS A            POATTS      0001A
6.SS A                                      VALUES(' ' 'J')
6.SS A                                      CHKMSGID(RML0200 *LIBL/QMFOKON)
6.SS A                                      TEXT('Attestasjonskode')
6.SS A                                      COLHDG('Att' 'kod')
6.SS A            POATTU      0010A
6.SS A                                      TEXT('Attestert av (User-ID).')
6.SS A                                      COLHDG('Attestert' 'av')
6.SS A            POADAT          L
6.SS A                                      TEXT('Att.dato')
6.SS A                                      COLHDG('Att.dato')
6.SS A            PORRF1      0008S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Betalingsreferanse-1')
6.SS A                                      COLHDG('Bet.' 'rf.1')
6.SS A            PORRF2      0003S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Betalingsreferanse-  2')
6.SS A                                      COLHDG('Bet.' 'rf.2')
6.SS A            PODECK      0006A
6.SS A                                      TEXT('Deklarasjonskode')
6.SS A                                      COLHDG('Dekl.' 'kode')
6.SS A            POBFNR      0003S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Betalingsforslags-n  r')
6.SS A                                      COLHDG('Bet.' 'fors')
6.SS A            POBFLI      0005S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Betalingsforsl.-lin  j')
6.SS A                                      COLHDG('Forsl' 'linje')
6.SS A            POKIDI      0025A
6.SS A                                      TEXT('Kundeidentifikasjon  ')
6.SS A                                      COLHDG('Kundeidentifikasjon')
6.SS  *
7.NX A            POKIDR      0008S 0       TEXT('Kidd referansenr')
6.SS A                                      COLHDG('Kidd' 'Ref')
6.SS A                                      EDTCDE(Z)
6.SS  *
6.SS A            POKSIF      0001S 0       TEXT('Kontroll-siffer')
6.SS A                                      COLHDG('Kont' 'Siff')
6.SS A                                      EDTCDE(Z)
6.SS  *
6.SS A            POKID2      0025A         TEXT('Kiddnummer 2')
6.SS A                                      COLHDG('Kidd-2')
6.SS  *
6.SS A            POLFAK      0015A
6.SS A                                      TEXT('Lev.fakturanr.')
6.SS A                                      COLHDG('Lev.fakt.')
6.SS A            POAVDE      0004S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Avdeling')
6.SS A                                      COLHDG('Avd.')
6.SS A            POKONT      0004S 0
6.SS A                                      TEXT('Konto')
6.SS A                                      COLHDG('Konto')
6.SS A            POSPES      0004S 0
6.SS A                                      TEXT('Bærer')
6.SS A                                      COLHDG('Bærer')
6.SS A            POREKL      0001A
6.SS A                                      TEXT('Reklamasjonskode')
6.SS A                                      COLHDG('Re' 'kd')
6.SS A            PODELB      0011S 2
6.SS A                                      EDTCDE(K)
6.SS A                                      TEXT('Delbetalt')
6.SS A                                      COLHDG('Delbetalt')
6.SS A            POBETB      0002S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Betalingsbetingelse  ')
6.SS A                                      COLHDG('Bet' 'bet')
6.SS A            PORESN      0006S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Kontonr.(Reskontro)  ')
6.SS A                                      COLHDG('Konto')
6.SS A            PORESS      0004S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Kostnadsbærer')
6.SS A                                      COLHDG('Sp')
6.SS A            PORESA      0004S 0
6.SS A                                      EDTCDE(Z)
6.SS A                                      TEXT('Avdeling')
6.SS A                                      COLHDG('Avd')
6.SS A            PORESM      0001A
6.SS A                                      TEXT('MVA-kode')
6.SS A                                      COLHDG('MVA' 'kod')
6.SS A            POTIST          Z
6.SS A                                      TEXT('Post-nr.RLTR')
6.SS A                                      COLHDG('Post')
6.SS A            POTISD          Z
6.SS A                                      TEXT('Post-nr.RLTX')
6.SS A                                      COLHDG('Post')
6.SS A            POFODA          L
6.SS A                                      TEXT('Forsl.dato')
6.SS A                                      COLHDG('Forsl.dato')
6.SS A            POFTIM          T
6.SS A                                      TEXT('Forsl.tid')
6.SS A                                      COLHDG('Forsl.tid')
6.SS A            POFSIG      0010A
6.SS A                                      TEXT('Forsl.bruker')
6.SS A                                      COLHDG('Forsl.bruker')
6.SS A            PORDAT          L
6.SS A                                      TEXT('Returdato')
6.SS A                                      COLHDG('Returdato')
6.SS A            PORTIM          T
6.SS A                                      TEXT('Returtid')
6.SS A                                      COLHDG('Returtid')
6.SS A            PORSIG      0010A
6.SS A                                      TEXT('Returbruker')
6.SS A                                      COLHDG('Returbruker')
6.SS A            POTKTO      0035A
6.SS A                                      COLHDG('Overf. til konto')
6.SS A            POSPOR      0010S 0
6.SS A                                      TEXT('Spor.ref.')
6.SS A                                      COLHDG('Spor.ref.')
6.SS A            POAVKR      0010S 0
6.SS A                                      TEXT('Avkr.ref.')
6.SS A                                      COLHDG('Avkr.ref.')
6.SS A            POFRDA    R               REFFLD(RÅODAT)
6.SS A                                      TEXT('Fra Dato')
6.SS A                                      COLHDG('Fra Dato')
6.SS A            POTIDA    R               REFFLD(RÅODAT)
6.SS A                                      TEXT('Til Dato')
6.SS A                                      COLHDG('Til Dato')
6.SS A            POODAT    R               REFFLD(RÅODAT)
6.SS A            POOTIM    R               REFFLD(RÅOTIM)
6.SS A            POOUSR    R               REFFLD(RÅOUSR)
6.SS A            POEDAT    R               REFFLD(RÅEDAT)
6.SS A            POETIM    R               REFFLD(RÅETIM)
6.SS A            POEUSR    R               REFFLD(RÅEUSR)
7.N1 A**
7.N1 A**  Tilganger i kontaktpersonregister
7.N1 A**
7.N1 A            RUTFIR      0003S 0       TEXT('Firma')
7.N1 A                                      COLHDG('Firma')
7.N1  *
7.N1 A            RUTPNR      0006S 0       TEXT('Kontaktpersonnr.')
7.N1 A                                      COLHDG('Kontaktp.nr.')
7.N1 A                                      EDTCDE(Z)
7.N1  *
7.N1 A            RUTTIL      0020A         TEXT('Tilgang')
7.N1 A                                      COLHDG('Tilgang')
7.N1  *
7.N1 A            RUTEDA          L         TEXT('Endret dato')
7.N1 A                                      COLHDG('Endr.dato')
7.N1  *
7.N1 A            RUTETI          T         TEXT('Endret tid')
7.N1 A                                      COLHDG('Endr.tid')
7.N1  *
7.N1 A            RUTEUS      0010A         TEXT('Endret av')
7.N1 A                                      COLHDG('Endr.av')
7.N1  *
7.N1 A            RUTODA    R               REFFLD(RÅODAT)
7.N1 A            RUTOTI    R               REFFLD(RÅOTIM)
7.N1 A            RUTOUS    R               REFFLD(RÅOUSR)
7.N1 A**
7.N1 A** Gyldige tilganger i kontaktpersonregister
7.N1 A**
7.N1 A            RUFFIR      0003S 0       TEXT('Firma')
7.N1 A                                      COLHDG('Firma')
7.N1  *
7.N1 A            RUFTIL      0020A         TEXT('Tilgang')
7.N1 A                                      COLHDG('Tilgang')
7.N1  *
7.N1 A            RUFTEK      0030A         TEXT('Tilgang tekst')
7.N1 A                                      COLHDG('Tilgangtekst')
7.N1  *
7.N1 A            RUFEDA          L         TEXT('Endret dato')
7.N1 A                                      COLHDG('Endr.dato')
7.N1  *
7.N1 A            RUFETI          T         TEXT('Endret tid')
7.N1 A                                      COLHDG('Endr.tid')
7.N1  *
7.N1 A            RUFEUS      0010A         TEXT('Endret av')
7.N1 A                                      COLHDG('Endr.av')
7.N1  *
7.N1 A            RUFODA    R               REFFLD(RÅODAT)
7.N1 A            RUFOTI    R               REFFLD(RÅOTIM)
7.N1 A            RUFOUS    R               REFFLD(RÅOUSR)
7.N2  *
7.N2  *   Leveringsmåte bestilliing RA32PF    (REE)
7.N2  *
7.N2 A            REFFIR      0003S 0
7.N2 A                                      COLHDG('Firma')
7.N2 A            REFKOD      0010A
7.N2 A                                      COLHDG('Kundegruppe')
7.N2 A            REFBES      0030A
7.N2 A                                      COMP(NE ' ')
7.N2 A                                      CHKMSGID(RMA0040 *LIBL/QMFOKON)
7.N2 A                                      COLHDG('Beskrivende tekst')
7.N2 A            REFODA    R               REFFLD(RÅODAT)
7.N2 A            REFOTI    R               REFFLD(RÅOTIM)
7.N2 A            REFOUS    R               REFFLD(RÅOUSR)
6.N2 A            REFEDA    R               REFFLD(RÅEDAT)
7.N2 A            REFETI    R               REFFLD(RÅETIM)
7.N2 A            REFEUS    R               REFFLD(RÅEUSR)
      *
