     A*  POSTERING REGNEARK - INN
     A*  ---------------------
     A                                      REF(*LIBL/RFRF)
     A          R RFW1PF
     A            RFW1PF       700A         TEXT('Postering regneark - inn')
