     A**
     A** BANK-Giro grunnlag
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
     A**
     A                                      REF(*LIBL/RFRF)
     A          R RGIRPFR
     A            RGFIRM    R
     A            RGKUND    R
     A            RGNAVN    R
     A            RGGATE    R
     A            RGADR2    R
     A            RGPONR    R
     A            RGSTED    R
     A            RGPERS    R
     A            RGTLFN    R
     A            RGTLFX    R
     A            RGAKTI    R
     A            RGBILN    R
     A            RGBDAT    R
     A            RGBGIR    R
     A            RGBELØ    R
     A            RGRENT    R
     A            RGRABB    R
     A            RGTEXT    R
     A            RGFDAT    R
     A            RGBGIF    R
     A            RGLAGR    R
     A            RGSLGR    R
     A            RGDIST    R
     A            RGKATG    R
     A            RGBETB    R
     A            RGBETM    R
     A            RGFRIE    R
     A            RGAVDE    R
     A            RGAVTS    R
     A            RGFTNR    R
     A            RGKKID    R
     A            RGKKEY    R
     A* Nøkkel
     A          K RGKKEY
