     A*  Kontoplan
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RHOVPFR
     A            RHFIRM    R
     A            RHKONT    R
     A            RHSPES    R
     A            RHAVDE    R
     A            RHTEXT    R
     A            RHTXT2    R
     A            RHALFA    R
     A            RHSPRK    R
     A            RHMVAK    R
     A            RHMVAO    R
     A            RHMVAG    R
     A            RHBNØK    R
     A            RHVALK    R
     A            RHAVDK    R
     A            RHPROJ    R
     A            RHBÆRK    R
     A            RHMNGD    R
     A            RHNØKK    R
T5.30A            RHREFN    R
T5.30A            RHREFT    R
T5.60A            RHKPG1    R
T5.60A            RHKPG2    R
T5.60A            RHKPG3    R
T5.60A            RHKPG4    R
T5.60A            RHKPG5    R
6.10 A            RHODAT    R
6.10 A            RHOTIM    R
6.10 A            RHOUSR    R
     A            RHEDAT    R
     A            RHETIM    R
     A            RHEUSR    R
     A* Nøkkel
     A          K RHFIRM
     A          K RHKONT
     A          K RHSPES
     A          K RHAVDE
