     A* Kontoplan            Index=Update
     A*
     A                                      UNIQUE
     A          R RHOVPFR                   PFILE(RHOVPF)
     A* Nøkkel
     A          K RHFIRM
     A          K RHKONT
     A          K RHSPES
     A          K RHAVDE
