     A*  Kontoplan           Index=Avdeling
     A*
     A          R RHOVPFR                   PFILE(RHOVPF)
     A* Nøkkel
     A          K RHFIRM
     A          K RHAVDE
     A          K RHKONT
     A          K RHSPES
