     A*  Kontoplan           Index=Alfa
     A*
     A          R RHOVPFR                   PFILE(RHOVPF)
     A* Nøkkel
     A          K RHFIRM
     A          K RHALFA
     A          K RHKONT
     A          K RHSPES
     A          K RHAVDE
