     A*  Saldomatrise - Hovedbok, Index=Read
     A*
     A          R RHSAPFR                   PFILE(RHSAPF)
     A* Nøkkel
     A          K RIFIRM
     A          K RIKONT
     A          K RISPES
     A          K RIAVDE
     A          K RIRAAR
     A          K RITYPE
