     A*  Saldomatrise - Hovedbok - Pr. kostnadsbærer
     A*
     A          R RHSAPFR                   PFILE(RHSAPF)
     A                                      TEXT('KOST.BÆRER-INDEX SALDO')
     A*
     A* Nøkkel
     A*
     A          K RIFIRM
     A          K RISPES
     A          K RIKONT
     A          K RIAVDE
     A          K RIRAAR
     A          K RITYPE
