     A*  Saldomatrise - Hovedbok, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RHSAPFR                   PFILE(RHSAPF)
     A* Nøkkel
     A          K RIFIRM
     A          K RIKONT
     A          K RISPES
     A          K RIAVDE
     A          K RIRAAR
     A          K RITYPE
