     A*  Saldomatrise - Hovedbok - Pr. avdeling
     A*
     A          R RHSAPFR                   PFILE(RHSAPF)
     A                                      TEXT('AVDELINGS-INDEX SALDO')
     A*
     A* Nøkkel
     A*
     A          K RIFIRM
     A          K RIAVDE
     A          K RIKONT
     A          K RISPES
     A          K RIRAAR
     A          K RITYPE
