     A*  Posteringer - Hovedbok for MVA-oppgjør
     A*
     A          R RHTRPFR                   PFILE(RHTRPF)
     A                                      TEXT('MVA-POSTERINGER')
     A*
     A* Nøkkel
     A*
     A          K RBFIRM
     A          K RBRAAR
     A          K RBMVAK
     A          K RBBILN
