     A*  Posteringer - Hovedbok for MVA-oppgjør
6.20 A*  23.09.13    - Sst   Ny logisk fil Prosjekt
     A*
     A          R RHTRPFR                   PFILE(RHTRPF)
     A                                      TEXT('PROSJEKT-TRANSER')
     A*
     A* Nøkkel
     A*
     A          K RBFIRM
     A          K RBHPRO
     A          K RBKONT
     A          K RBRAAR
     A          K RBRPER
     A          K RBBDAT
     A          O RBHPRO                    COMP(EQ ' ')
