     A*  Posteringer - Hovedbok/PERIODE/BILAGSNR
     A*
     A          R RHTRPFR                   PFILE(RHTRPF)
     A                                      TEXT('HOVEDBOKSPOSTER')
     A*
     A* Nøkkel
     A*
     A          K RBFIRM
     A          K RBRAAR
     A          K RBRPER
     A          K RBBILN
     A          K RBBDAT
     A          K RBKONT
     A          K RBSPES
