     A*  Posteringer - Hovedboksposter, ALT INDEX
     A*
     A          R RHTRPFR                   PFILE(RHTRPF)
     A* Nøkkel
     A          K RBFIRM
     A          K RBBDAT
