     A*  Posteringer             Index=Read
     A*
     A          R RHTRPFR                   PFILE(RHTRPF)
     A* Nøkkel
     A          K RBFIRM
     A          K RBRAAR
     A          K RBKONT
     A          K RBSPES
     A          K RBAVDE
     A          K RBRPER
     A          K RBBDAT
     A          K RBTIST
