     A*  Posteringer - Hovedbok for MVA-oppgjør
6.20 A*  27.02.15    - BOF   Ny logisk fil Prosjekt
     A*
     A          R RHTRPFR                   PFILE(RHTRPF)
     A                                      TEXT('PROSJEKT-TRANSER')
     A*
     A* Nøkkel
     A*
     A          K RBFIRM
     A          K RBHPRO
     A          K RBBILN
     A          K RBRAAR
     A          K RBKONT
     A          K RBBDAT
     A          K RBRPER
     A          O RBHPRO                    COMP(EQ ' ')
