     A*  Posteringer - Hovedbok pr. år og bilagsnummer
     A*
     A          R RHTRPFR                   PFILE(RHTRPF)
     A                                      TEXT('BILAGS-INDEX POSTER')
     A*
     A* Nøkkel
     A*
     A          K RBFIRM
     A          K RBRAAR
     A          K RBBILN
