     A*  Posteringer - Hovedbok
     A*  Arbeidsregister - Definert som RHTRPF med tillegg av RBKON6
     A*  og key
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
     A                                      REF(*LIBL/RFRF)
     A          R RHWAPFR
     A            RBFIRM    R
     A            RBKONT    R
     A            RBSPES    R
     A            RBAVDE    R
     A            RBRAAR    R
     A            RBRPER    R
     A            RBBDAT    R
     A            RBBILN    R
     A            RBBILK    R
     A            RBTEXT    R
     A            RBNETO    R
     A            RBMVAG    R
     A            RBAMVA    R
     A            RBPMVA    R
     A            RBMVAB    R
     A            RBPIVA    R
     A            RBINVB    R
     A            RBVALK    R
     A            RBVALB    R
     A            RBVALS    R
     A            RBMNGK    R
     A            RBMNGD    R
     A            RBRMRK    R
     A            RBMVAK    R
     A            RBMVAO    R
     A            RBMMRK    R
     A            RBMVAP    R
     A            RBHMRK    R
     A            RBAUTK    R
     A            RBJOUR    R
     A            RBPROS    R
     A            RBAKTI    R
     A            RBAVST    R
     A            RBBREF    R
     A            RBLFAK    R
     A            RBTIST    R
     A            RBKON6    R
     A            RWKKEY    R
     A* Nøkkel
     A          K RWKKEY
