      *
6.10  *  NHO 03.05.11   Ny fil
6.10  *
      *  Jobb status igangkjøring
      *
     A          R RJOBPFR                   PFILE(*LIBL/RJOBPF)
      *
     A          K RJBFIR
     A          K RJBMEM
