      *
6.10  *  NHO 03.05.11   Ny fil
6.10  *
      *  Jobb status igangkjøring
      *
     A                                      REF(*LIBL/RFRF)
     A          R RJOBPFR
     A            RJBFIR    R
     A            RJBMEM    R
     A            RJBUSR    R
     A            RJBAWS    R
     A            RJBDA1    R
     A            RJBTIM    R
     A            RJLED1    R
      *
      *
