     A*  Registrerte poster - Logisk file for update
     A*
     A          R RJOUPFR                   PFILE(RJOUPF)
     A* Nøkkel
610  A          K RJNIVO
610  A          K RJMEMB
     A          K RJSORT
