      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
6.20  * R6.20 111010 NHO  Nye felter i forbilndelse med prosjekt
6.NU  * R6.20 220514 BOF  UTVIDELSE NUMMERSERIE
      * ----- ------ ---- -------------------------------------------------
     A*  Registrerte posteringer i journal-kjøring
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RJOUPFR
610  A            RJNIVO    R
610  A            RJMEMB    R
     A            RJREID    R
     A            RJFIRM    R
     A            RJKONT    R
     A            RJSPES    R
     A            RJAVDE    R
     A            RJMVAP    R
     A            RJMMRK    R
     A            RJBDAT    R
     A            RJBILN    R
     A            RJBILL    R
     A            RJDBKR    R
     A            RJBILK    R
     A            RJTEXT    R
     A            RJNETO    R
T5.30A            RJMVAG    R
T5.30A            RJAMVA    R
T5.30A            RJPMVA    R
     A            RJMVAB    R
T5.30A            RJPIVA    R
     A            RJIAVG    R
     A            RJSTAR    R
     A            RJMVAK    R
     A            RJFEIK    R
     A            RJATTE    R
T5.50A            RJATTU    R
T5.50A            RJADAT    R
     A            RJTYPE    R
     A            RJRPER    R
     A            RJRAAR    R
     A            RJBUNT    R
     A            RJLINJ    R
     A            RJREFN    R
     A            RJFDAT    R
     A            RJOPDT    R
     A            RJPROS    R
     A            RJVALK    R
     A            RJVALB    R
     A            RJMNGD    R
     A            RJMNGK    R
     A            RJRESN    R
     A            RJRESS    R
     A            RJRESA    R
     A            RJRESM    R
     A            RJVIRK    R
     A            RJKRYS    R
     A            RJRSTB    R
     A            RJRSTV    R
     A            RJAKTI    R
     A            RJBETB    R
     A            RJBREF    R
T5.20A            RJLFAK    R
     A            RJKIDI    R
T5.50A            RJKIDR    R
T5.50A            RJKSIF    R
T5.50A            RJKID2    R
     A            RJDECK    R
     A            RJJOUR    R
     A            RJBLDE    R
T5.50A            RJBONG    R
     A            RJOVFN    R
     A            RJFLGR    R
     A            RJSPOR    R
     A            RJSORT    R
610  A            RJEDAT    R
610  A            RJETIM    R
610  A            RJEUSR    R
6.20 A            RJUPRO    R
6.20 A            RJARBO    R
     A* Nøkkel
610  A          K RJNIVO
610  A          K RJMEMB
     A          K RJSORT
