     A*  Registrerte poster - Alt.index for summering av bilag
     A*
     A          R RJOUPFR                   PFILE(RJOUPF)
     A* Nøkkel
     A          K RJNIVO
     A          K RJMEMB
     A          K RJFIRM
     A          K RJRAAR
     A          K RJRPER
     A          K RJBUNT
     A          K RJBDAT
