     A*  Kunder              Index=Read
     A*
     A          R RKBPPFR                   PFILE(RKBPPF)
      *
      * Nøkkel
      *
     A          K RKBFIR
     A          K RKBKUN
