      *
      * Fil for lagring av kid-informasjon ved innscanning
6.NU  * 220514 UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/RFRF)
     A          R RKIDPFR
     A            RYFIRM    R
     A            RYBILN    R
     A            RYRAAR    R
     A            RYRPER    R
     A            RYBDAT    R
     A            RYFDAT    R
     A            RYRESN    R
     A            RYBENR    R
     A            RYLFAK    R
     A            RYBELO    R
     A            RYKIDD    R
6.10 A            RYFLOW    R
6.10 A            RYKOMM    R
6.10 A            RYODAT    R
6.10 A            RYOTIM    R
6.10 A            RYOUSR    R
     A            RYEDAT    R
     A            RYETIM    R
     A            RYEUSR    R
