      *
      * Kidd-referanse-fil
      *
     A          R RKIDPFR
     A                                      PFILE(*LIBL/RKIDPF)
      *
      * Nøkkel
      *
     A          K RYFIRM
     A          K RYBILN
