     A*  Kladdeblokk - Logisk file for postnivå
     A*
     A          R RKLAPFR                   PFILE(RKLAPF)
     A* Nøkkel
     A          K RXFIRM
     A          K RXSYST
     A          K RXPROS
     A          K RXAKTI
     A          K RXKONT
     A          K RXSPES
     A          K RXAVDE
T5.40A          K RXTIST
     A          K RXLINJ
     A          S RXTIST                    COMP(NE '0001-01-01-00.00.00.000000-
     A                                      ')
