     A*  Kladdeblokk - Logisk file for ordrenivå
     A*
     A          R RKLAPFR                   PFILE(RKLAPF)
     A* Nøkkel
     A          K RXFIRM
     A          K RXSYST
     A          K RXONR
     A          K RXAKTI
     A          K RXTIST                    DESCEND
     A          S RXLINJ                    COMP(EQ 10)
