     A*  Kunder              Index=Read
      *
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RKLOPFR
     A            RKFIRM    R
     A            RKKUND    R
     A            RKNAVN    R
     A            RKALFA    R
     A            RKGATE    R
     A            RKADR2    R
     A            RKPONR    R
     A            RKSTED    R
     A            RKBGAT    R
     A            RKBADR    R
     A            RKBPNR    R
     A            RKKOMN    R
     A            RKLAND    R
     A            RKUPNR    R
     A            RKFTNR    R
     A            RKPENR    R
     A            RKPERS    R
     A            RKEMAL    R
     A            RKWEBA    R
     A            RKTLFN    R
     A            RKTLFX    R
     A            RKMOBN    R
T5.50A            RKMOBO    R
     A            RKBGIR    R
     A            RKFAKU    R
     A            RKFACN    R
     A            RKKOKU    R
     A            RKEDIK    R
     A            RKEANK    R
     A            RKEANF    R
     A            RKAVDE    R
     A            RKKJØR    R
     A            RKKJNR    R
     A            RKKATG    R
     A            RKRABK    R
     A            RKLAGR    R
     A            RKSLGR    R
     A            RKDIST    R
     A            RKBETB    R
     A            RKBETM    R
     A            RKSALD    R
     A            RKSAIF    R
     A            RKKJØP    R
     A            RKKJØF    R
6.30 A**          RKKJAL    R
T5.50A            RKGRAL    R
     A            RKKTID    R
     A            RKTDAT    R
     A            RKVALK    R
     A            RKSPRK    R
     A            RKMKOD    R
     A            RKLADR    R
     A            RKLBET    R
     A            RKFORM    R
     A            RKSPED    R
     A            RKORAB    R
     A            RKGRNS    R
5.50 A            RKKGRK    R
     A            RKFRIE    R
     A            RKRENK    R
     A            RKRNEG    R
     A            RKRDAT    R
     A            RKPURR    R
     A            RKPDAT    R
     A            RKPNEG    R
     A            RKINKK    R
     A            RKIDAT    R
     A            RKFACK    R
     A            RKSAMM    R
     A            RKORDB    R
     A            RKKRES    R
     A            RKSPAV    R
     A            RKPRPA    R
     A            RKNETO    R
     A            RKSAMF    R
     A            RKREKV    R
     A            RKFAGB    R
     A            RKEKGB    R
     A            RKFRGB    R
     A            RKRASP    R
     A            RKFRSK    R
     A            RKPTAB    R
     A            RKPTA2    R
     A            RKSPFA    R
     A            RKSPL1    R
     A            RKSPL2    R
     A            RKSPL3    R
     A            RKSPL4    R
     A            RKSPL5    R
     A            RKSEKV    R
     A            RKPBOK    R
     A            RKFAGR    R
     A            RKAFDA    R
     A            RKATDA    R
     A            RKSENT    R
     A            RKTILB    R
     A            RKOCOP    R
     A            RKPCOP    R
     A            RKFCOP    R
     A            RKPASS    R
     A            RKEBIZ    R
     A            RKLETY    R
     A            RKFATY    R
6.30 A            RKKOTI    R
     A            RKNDAT    R
     A            RKNTIM    R
     A            RKNSIG    R
     A            RKEDAT    R
     A            RKETIM    R
     A            RKESIG    R
6.17 A            RKEPGM    R
6.17 A            RK2DPT    R
     A* Nøkkel
     A**        K RKFIRM
     A**        K RKKUND
