     A*  Kladdeblokk
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RKLWPFR
     A            RXFIRM    R
     A            RXSYST    R
     A            RXPROS    R
     A            RXAKTI    R
     A            RXKONT    R
     A            RXSPES    R
     A            RXAVDE    R
     A            RXLINJ    R
     A            RXTGRP    R
     A            RXTEXT    R
T5.40A            RXBILN    R
T5.40A            RXTIST    R
T5.40A            RXONR     R
