     A*  Kunder memosaldo    Index=Read
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RKMEPFR
     A            RKFIRM    R
     A            RKKUND    R
     A            RKMEMS    R
     A            RKMEMA    R
6.30 A            RKKJAL    R
     A            RKMEDA    R
     A            RKMETI    R
     A            RKMEUS    R
     A            RKMODA    R
     A            RKMOTI    R
