     A*  Kunder, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RKMEPFR                   PFILE(RKMEPF)
     A* Nøkkel
     A          K RKFIRM
     A          K RKKUND
