      *
      * Kunde-spesialavtale-register  Index=Read
      *
     A          R RKSAPFR
     A                                      PFILE(*LIBL/RKSAPF)
      *
     A          K RKSAFI
     A          K RKSAKU
