      *
      * Kunde-spesialavtale-register
      *
     A                                      REF(*LIBL/RFRF)
     A          R RKSAPFR
     A            RKSAFI    R
     A            RKSAKU    R
     A            RKSAT1    R
     A            RKSAT2    R
     A            RKSAT3    R
6.10 A            RKODAT    R
6.10 A            RKOTIM    R
6.10 A            RKOUSR    R
6.10 A            RKENDA    R
6.10 A            RKENTI    R
6.10 A            RKEUSR    R
