     A*  SALDOSJEKK          Index=Read
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RKSJPFR
     A            RSJFIR    R
     A            RSJNUM    R
     A            RSJSUF    R
     A            RSJKUN    R
     A            RSJIDE    R
     A            RSJSUM    R
     A            RSJSTA    R
     A            RSJMSG    R
     A            RSJEDA    R
     A            RSJETI    R
     A            RSJEUS    R
     A            RSJODA    R
     A            RSJOTI    R
     A            RSJOUS    R
