     A*
     A          R RKSJPFR                   PFILE(RKSJPF)
     A*
     A* Nøkkel
     A*
     A          K RSJFIR
     A          K RSJNUM
     A          K RSJSUF
