      *
      * Kunde-søketekst
      *
     A          R RKSOPFR                   PFILE(*LIBL/RKSOPF)
      *
     A          K RKSFIR
     A          K RKSTEK
     A          K RKSKUN
