     A*  Posteringer - Kunder, TILLEGG ADRA
     A*
     A                                      UNIQUE
     A          R RKTAPFR                   PFILE(RKTAPF)
     A* Nøkkel
     A          K RKAFIR
     A          K RKATIS
