     A*  Posteringer - Kunder   Tillegsinfo til ADRA
     A*
     A
     A          R RKTAPFR
     A            RKAFIR         3S 0       COLHDG('Firma')
     A            RKATIS          Z         COLHDG('TimeStamp')
     A            RKABVN         8S 0       COLHDG('Bet.Varsel')
     A            RKAKID         8A         COLHDG('BVKid_8')
     A            RKAGNN         8S 0       COLHDG('Gen.notanr')
     A            RKAGKI         8A         COLHDG('GNKid_8')
     A            RKABV2         8S 0       COLHDG('Bet.Varsl2')
     A            RKAKI2         8A         COLHDG('BetVK2_8')
     A            RKABV3         8S 0       COLHDG('Bet.Varsl3')
     A            RKAKI3         8A         COLHDG('BetVK3_8')
     A            RKAODA          L         COLHDG('Oppr.Dato')
     A            RKAOTI          T         COLHDG('Oppr.Tid')
     A            RKAOUS        10A         COLHDG('Oppr.Av')
     A            RKAEDA          L         COLHDG('Endr.Dato')
     A            RKAETI          T         COLHDG('Endr.Tid')
     A            RKAEUS        10A         COLHDG('Endr.Av')
     A*  Bet.varsel legges først i RKABVN og RKAKID
     A*  Dersom det ligger noe her legges neste i RKABV2 og RKAKI2
     A*  Dersom begge er utfyllt flyttes RKABV2 og RKAKI2 til
     A*    RKABVN og RKAKID mens nytt legges i RKABV2 og RKAKI2
     A*  Det som ligger i RK--2 vil da til slutt bli inkassovarsel.
