     A*  Posteringer - Kunder, ALT INDEX
     A*
     A          R RKTAPFR                   PFILE(RKTAPF)
     A* Nøkkel
     A          K RKAFIR
     A          K RKATIS
