     A*  Posteringer - Kunder, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RKTRPFR                   PFILE(RKTRPF)
     A* Nøkkel
     A          K RNFIRM
     A          K RNKUND
     A          K RNBDAT
     A          K RNTIST
