     A*  Posteringer - Kunder, ALT INDEX
     A*
     A          R RKTRPFR                   PFILE(RKTRPF)
     A* Nøkkel
     A          K RNFIRM
     A          K RNSAMF
     A          K RNKUND
     A          K RNBILN
      *
     A          S RNSAMF                    COMP(NE 0)
