     A*  Posteringer - Kunder, ALT INDEX
     A*
     A          R RKTRPFR                   PFILE(RKTRPF)
     A* Nøkkel
     A          K RNFIRM
     A          K RNBDAT
