     A*  Posteringer - Kunder, ALT INDEX
     A*
     A          R RKTRPFR                   PFILE(RKTRPF)
     A* Nøkkel
     A          K RNFIRM
     A          K RNKUND
     A          K RNRAAR
     A          K RNRPER
     A          K RNBDAT
