     A*  Posteringer - Kunder   Logger transer sendt ????
     A*
     A
     A          R RKTSPFR
     A            RSFIRM         3S 0       COLHDG('Firma')
     A            RSKUND         6S 0       COLHDG('Kunde')
     A            RSSDAT          L         COLHDG('Sendt dato')
     A            RSTIST          Z         COLHDG('Timestamp')
     A            RSODAT          L         COLHDG('Oppr.Dato')
     A            RSOTIM          T         COLHDG('Oppr.Tid')
     A            RSOUSR        10A         COLHDG('Oppr.Av')
     A            RSEDAT          L         COLHDG('Endr.Dato')
     A            RSETIM          T         COLHDG('Endr.Tid')
     A            RSEUSR        10A         COLHDG('Endr.Av')
