     A*  Posteringer - Kunder, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RKTSPFR                   PFILE(RKTSPF)
     A* Nøkkel
     A          K RSFIRM
     A          K RSTIST
