     A*  Posteringer - Kunder, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RKTXPFR                   PFILE(RKTXPF)
     A* Nøkkel
     A          K PNFIRM
     A          K PNKUND
     A          K PNBDAT
     A          K PNTISD
