     A*  Posteringer - Kunder
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RKTXPFR
     A            PNFIRM    R
     A            PNKUND    R
     A            PNRAAR    R
     A            PNRPER    R
     A            PNBDAT    R
     A            PNBILN    R
     A            PNBILK    R
     A            PNTEXT    R
     A            PNBELØ    R
     A            PNREST    R
     A            PNVALK    R
     A            PNVALB    R
     A            PNVALR    R
     A            PNFDAT    R
     A            PNJOUR    R
     A            PNSAMF    R
     A            PNSTAT    R
     A            PNREFN    R
     A            PNVIRK    R
     A            PNAVDE    R
     A            PNKONT    R
     A            PNSPES    R
     A            PNSLGR    R
     A            PNREKL    R
     A            PNRENK    R
     A            PNRDAT    R
     A            PNANTP    R
     A            PNPDAT    R
     A            PNINKO    R
     A            PNIDAT    R
     A            PNODAT    R
     A            PNAUTO    R
     A            PNADAT    R
     A            PNFACK    R
     A            PNFADA    R
      *   Timestamp opprinnelig record i RKTRPF
     A            PNTIST    R
      *   Timestamp denne       record i RKTXPF
     A            PNTISD    R
     A            PNKIDI    R
     A            PNKIDR    R
     A            PNKSIF    R
     A            PNKID2    R
     A            PNSPOR    R
     A            PNAVKR    R
     A            PNDATE    R
     A            PNOTIM    R
     A            PNOUSR    R
     A            PNEDAT    R
     A            PNETIM    R
     A            PNEUSR    R
