     A*  Posteringer - Kunder, ALT INDEX
     A*
     A          R RKTXPFR                   PFILE(RKTXPF)
     A* Nøkkel
     A          K PNFIRM
     A          K PNKUND
     A          K PNREFN
     A          K PNBDAT
