     A*
8.05 A* 190422 bsa Legger til felt for returgebyr
8.06 A* 230622 bsa Legger til felt for om spesialpris skal overstyre
8.06 A*            beste pris.
8.07 A* 240524 bsa Legger til felt for samle/splitting av samlefakturering
     A*
     A*
     A*--------------------------------------------------------------
     A*  Kunder (sideregister)Index=Read
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RKU2PFR
     A            RK2FIR    R
     A            RK2KUN    R
     A            RKPRKR    R
     A            RK2UOG    R
8.05 A            RK2RGB    R
8.06 A            RK2SOB    R
8.07 A            RK2FAS         1S 0       TEXT('Blandet faktura')
8.07 A                                      COLHDG('Blandet fa')
8.07 A                                      EDTCDE(1)
     A            RK2EDA    R
     A            RK2ETI    R
     A            RK2EUS    R
     A            RK2DAT    R
     A            RK2TIM    R
     A            RK2SIG    R
