     A*  Kunder (sideregister)ndex=Read
     A*
     A          R RKU2PFR                   PFILE(RKU2PF)
      *
      * Nøkkel
      *
     A          K RK2FIR
     A          K RK2KUN
