     A*  Kunder              Index=Personnummer
     A*
     A          R RKUNPFR                   PFILE(RKUNPF)
      *
      * Nøkkel
      *
     A          K RKFIRM
     A          K RKPENR
