     A*  Kunder              Index=Alfa
     A*
     A          R RKUNPFR                   PFILE(RKUNPF)
      * Nøkkel
     A          K RKFIRM
     A          K RKALFA
     A          K RKKUND
