     A*  Kunder, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RKUNPFR                   PFILE(RKUNPF)
     A* Nøkkel
     A          K RKFIRM
     A          K RKKUND
