     A*  Kunder, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RKUNTRR                   PFILE(RKUNTR)
     A* Nøkkel
     A          K RKFIRM
     A          K RKKUND
