     A*  Kunder              Index=e-mailadresse
     A*
     A          R RKUNPFR                   PFILE(RKUNPF)
      *
      * Nøkkel
      *
     A          K RKFIRM
     A          K RKEMAL
