     A*  Kunder              Index=bankgironummer
     A*
     A          R RKUNPFR                   PFILE(RKUNPF)
     A*
     A* Nøkkel
     A*
     A          K RKFIRM
     A          K RKBGIR
