     A*  Kunder - Index firma nivå saldo alfa kundenummer
     A*
     A          R RKW1PFR                   PFILE(RKW1PF)
     A*
     A* Nøkkel
     A*
     A          K RWKFIR
     A          K RWKNIV
E5.10A          K RWKSAL                    DESCEND
     A          K RWKALF
     A          K RWKKNR
