     A*  Arbeidsregister - Kunder, Logisk file for update
     A*
     A          R RKW1PFR                   PFILE(RKW1PF)
     A* Nøkkel
     A          K RWKKEY
