     A*  Arbeidsregister - Kunder, Logisk file for update
     A*
     A          R RKW2PFR                   PFILE(RKW2PF)
     A* Nøkkel
     A          K RWKKEY
