     A*  Arbeidsregister - Kunder, Logisk file for update (Autogiro)
     A*
     A          R RKW4PFR                   PFILE(RKW4PF)
     A* Nøkkel
     A          K RWKKEY
