     A*  Arbeidsregister - Kunder, Logisk file for update
     A*
     A          R RKW5PFR                   PFILE(RKW5PF)
     A* Nøkkel
     A          K RNFIRM
     A          K RNKUND
     A          K RNBDAT
     A          K RNTIST
