     A*  Arbeidsregister - Generell definisjon
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RKWAPFR
     A            RWKREC    R
     A            RWKKEY    R
     A* Nøkkel
     A          K RWKKEY
