     A*  Arbeidsregister - Kunder, Logisk file for update
     A*
     A          R RKWAPFR                   PFILE(RKWAPF)
     A* Nøkkel
     A          K RWKKEY
