     A*  Posteringer - Kunder, Logisk file for READ
     A*
     A          R RKWBPFR                   PFILE(RKWBPF)
     A* Nøkkel
     A          K RNFIRM
     A          K RNRAAR
     A          K RNKUND
     A          K RNSAMF
     A          K RNBDAT
     A          K RWTIST
