     A*  Posteringer - Kunder, Logisk file for update
     A*
     A          R RKWBPFR                   PFILE(RKWBPF)
     A* Nøkkel
     A          K RNFIRM
     A          K RWKALF
     A          K RNKUND
     A          K RNBDAT
     A          K RWTIST
