     A*  Posteringer - Kunder, ALT INDEX
     A*
     A          R RKTRPFR                   PFILE(RKWCPF)
     A* Nøkkel
     A          K RNFIRM
     A          K RNKUND
     A          K RNBDAT
     A          K RNTIST
