     A*  Bankinformasjon utland - Leverandører; Logisk file for update
     A*
     A          R RLBAPFR                   PFILE(RLBAPF)
     A* Nøkkel
     A          K RVFIRM
     A          K RVLEVR
