     A*  Bankinformasjon utland
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RLBAPFR
     A            RVFIRM    R
     A            RVLEVR    R
     A            RVHSWA    R
     A            RVHBA1    R
     A            RVHBA2    R
     A            RVHBA3    R
     A            RVHBA4    R
     A            RVHBKO    R
     A            RVHBKU    R
     A            RVHBKI    R
     A            RVHBVK    R
6.10 A            RVODAT    R
6.10 A            RVOTIM    R
6.10 A            RVOUSR    R
6.10 A            RVEDAT    R
6.10 A            RVETIM    R
6.10 A            RVEUSR    R
     A* Nøkkel
     A          K RVFIRM
     A          K RVLEVR
