     A*
     A*  Leverandører - tillegsregister
     A*
     A*
     A          R RLE2PFR
     A            RL2FIR         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A            RL2LEV         6S 0       TEXT('Leverandørnummer')
     A                                      COLHDG('Leverandørnummer')
     A            RL2UOG        20A         TEXT('Organisasjonsnr utland')
     A                                      COLHDG('Org.nr utland')
     A            RL2EDA          L         TEXT('Endret dato')
     A                                      COLHDG('Endret dato')
     A            RL2ETI          T         TEXT('Endret tidspkt')
     A                                      COLHDG('Endret tidspkt.')
     A            RL2EUS        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
     A            RL2ODA          L         TEXT('Oppretet dato')
     A                                      COLHDG('Opprettet dato')
     A            RL2OTI          T         TEXT('Opprettet tidspkt')
     A                                      COLHDG('Opprettet tidspkt.')
     A            RL2OUS        10A         TEXT('Opprettet av')
     A                                      COLHDG('Opprettet av')
