     A*  Leverandører        Index=Read
     A*
     A          R RLE2PFR                   PFILE(RLE2PF)
      * Nøkkel
     A          K RL2FIR
     A          K RL2LEV
