     A*  Leverandører, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RLE2PFR                   PFILE(RLE2PF)
     A* Nøkkel
     A          K RL2FIR
     A          K RL2LEV
