     A*  Leverandører           Index=Postnr
     A*
     A          R RLEVPFR                   PFILE(RLEVPF)
      * Nøkkel
     A          K RLFIRM
     A          K RLPONR
     A          K RLALFA
