     A*  Leverandører - Index telefonnummer
     A*
     A          R RLEVPFR                   PFILE(RLEVPF)
     A*
     A* Nøkkel
     A*
     A          K RLFIRM
     A          K RLTLFN
