     A*  Leverandører        Index=Read
     A*
     A          R RLEVPFR                   PFILE(RLEVPF)
      * Nøkkel
     A          K RLFIRM
     A          K RLLEVR
