     A*  Leverandører - Index foretaksnummer
     A*
     A          R RLEVPFR                   PFILE(RLEVPF)
     A*
     A* Nøkkel
     A*
     A          K RLFIRM
     A          K RLFTNR
