     A*  Leverandør, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RLEVTRR                   PFILE(RLEVTR)
     A* Nøkkel
     A          K RLFIRM
     A          K RLLEVR
