     A*  Leverandører, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RLEVPFR                   PFILE(RLEVPF)
     A* Nøkkel
     A          K RLFIRM
     A          K RLLEVR
