     A*  Leverandører           Index=Alfa
     A*
     A          R RLEVPFR                   PFILE(RLEVPF)
      * Nøkkel
     A          K RLFIRM
     A          K RLALFA
     A          K RLLEVR
