      *  Leverandør-register    Index=Read
      *
     A          R RLEVPFR
     A                                      PFILE(*LIBL/RLEVPF)
      *  Nøkkel
     A          K RLFIRM
     A          K RLLEVR
