     A*  Leverandører - Index faktoringleverandør
     A*
     A          R RLEVPFR                   PFILE(RLEVPF)
     A*
     A* Nøkkel
     A*
     A          K RLFIRM
     A          K RLFACT
     A*
     A* Velger poster med utfylt factoringleverandør
     A*
     A          S RLFACT                    COMP(NE 0)
