      *
      * Leverandør-søketekst-register  Index=Read
      *
     A          R RLSOPFR
     A                                      PFILE(*LIBL/RLSOPF)
      *
     A          K RLSFIR
     A          K RLSLEV
     A          K RLSTEK
