      *
      * Leverandør-søketekst-register
      *
     A                                      REF(*LIBL/RFRF)
     A          R RLSOPFR
     A            RLSFIR    R
     A            RLSLEV    R
     A            RLSTEK    R
