     A*  Posteringer - Leverandører, Index=Read
     A*
     A          R RLTRPFR                   PFILE(RLTRPF)
     A* Nøkkel
     A          K ROFIRM
     A          K ROLEVR
     A          K ROBDAT
     A          K ROTIST
