     A*  Posteringer - Leverandører, ALT INDEX
     A*
     A          R RLTRPFR                   PFILE(RLTRPF)
     A* Nøkkel
     A          K ROFIRM
     A          K ROBILN
