     A*  Posteringer - Leverandører, ALT INDEX
     A*
     A          R RLTRPFR                   PFILE(RLTRPF)
     A* Nøkkel
     A          K ROFIRM
     A          K RORAAR
     A          K ROLFAK
      *
     A          S ROLFAK                    COMP(NE ' ')
