     A*  Posteringer - Leverandører, ALT INDEX
     A*
     A          R RLTRPFR                   PFILE(RLTRPF)
     A* Nøkkel
     A          K ROFIRM
     A          K ROLEVR
E5.20A          K RORAAR
E5.20A          K ROLFAK
