     A*  Posteringer - Leverandører, ALT INDEX
     A*
     A          R RLTRPFR                   PFILE(RLTRPF)
     A* Nøkkel
     A          K ROFIRM
     A          K ROLEVR
     A          K RORAAR
     A          K RORPER
     A          K ROBDAT
     A*
     A* Velger poster med restbeløp <> 0
     A*
     A          S ROREST                    COMP(NE 0)
