     A*  Posteringer - Leverandører, Index=Read
6.30 A*  260815   NHO   Brukes i RF107R
     A*
     A          R RLTRPFR                   PFILE(RLTRPF)
     A* Nøkkel
     A          K ROFIRM
     A          K ROLEVR
     A          K ROBDAT
     A          K ROTIST
6.30 A* Velger poster med restbeløp <> 0
6.30 A*
6.30 A          S ROREST                    COMP(NE 0)
