     A*  Posteringer - Leverandører
     A*
6.13  * R6.13 110603 NHO  Ny felt i forb. med sporingsref og avkr. ref.ttet
6.2I  * R6.20 120912 BOF  Utvidet med felt fra / til dato
6.NU  * R6.30 220514 BOF  UTVIDELSE NUMMERSERIE
      *
     A                                      REF(*LIBL/RFRF)
     A          R RLTRPFR
     A            ROFIRM    R
     A            ROLEVR    R
     A            RORAAR    R
     A            RORPER    R
     A            ROBDAT    R
     A            ROBILN    R
     A            ROBILK    R
     A            ROTEXT    R
     A            ROBELØ    R
     A            ROREST    R
     A            ROVALK    R
     A            ROVALB    R
     A            ROVALR    R
     A            ROFDAT    R
     A            ROJOUR    R
     A            ROSAMB    R
     A            ROBETK    R
     A            ROREFN    R
     A            ROVIRK    R
     A            ROATTS    R
T5.30A            ROATTU    R
T5.30A            ROADAT    R
     A            RORRF1    R
     A            RORRF2    R
     A            RODECK    R
     A            ROBFNR    R
     A            ROBFLI    R
     A            ROKIDI    R
T5.50A            ROKIDR    R
T5.50A            ROKSIF    R
T5.50A            ROKID2    R
T5.20A            ROLFAK    R
     A            ROAVDE    R
T5.40A            ROKONT    R
T5.40A            ROSPES    R
     A            ROREKL    R
     A            RODELB    R
     A            ROBETB    R
     A            RORESN    R
     A            RORESS    R
     A            RORESA    R
     A            RORESM    R
     A            ROTIST    R
V5.40A            ROFODA    R
V5.40A            ROFTIM    R
V5.40A            ROFSIG    R
V5.40A            RORDAT    R
V5.40A            RORTIM    R
V5.40A            RORSIG    R
V5.40A            ROTKTO    R
6.13 A            ROSPOR    R
6.13 A            ROAVKR    R
6.2I A            ROFRDA    R
6.2I A            ROTIDA    R
6.10 A            ROODAT    R
6.10 A            ROOTIM    R
6.10 A            ROOUSR    R
6.10 A            ROEDAT    R
6.10 A            ROETIM    R
6.10 A            ROEUSR    R
