     A*  Posteringer - Leverandører
     A*
     A*  06.06.2014  NYTT REGISTER VEDR AVKRYSSING LEVERANDØRER
     A*
      *
     A                                      REF(*LIBL/RFRF)
     A          R RLTXPFR
     A            POFIRM    R
     A            POLEVR    R
     A            PORAAR    R
     A            PORPER    R
     A            POBDAT    R
     A            POBILN    R
     A            POBILK    R
     A            POTEXT    R
     A            POBELØ    R
     A            POREST    R
     A            POVALK    R
     A            POVALB    R
     A            POVALR    R
     A            POFDAT    R
     A            POJOUR    R
     A            POSAMB    R
     A            POBETK    R
     A            POREFN    R
     A            POVIRK    R
     A            POATTS    R
     A            POATTU    R
     A            POADAT    R
     A            PORRF1    R
     A            PORRF2    R
     A            PODECK    R
     A            POBFNR    R
     A            POBFLI    R
     A            POKIDI    R
     A            POKIDR    R
     A            POKSIF    R
     A            POKID2    R
     A            POLFAK    R
     A            POAVDE    R
     A            POKONT    R
     A            POSPES    R
     A            POREKL    R
     A            PODELB    R
     A            POBETB    R
     A            PORESN    R
     A            PORESS    R
     A            PORESA    R
     A            PORESM    R
      *   POTIST er timestamp til hovedrec i rltrpf
     A            POTIST    R
      *   PDTIST er timestamp til denne rec i rltxpf
     A            POTISD    R
     A            POFODA    R
     A            POFTIM    R
     A            POFSIG    R
     A            PORDAT    R
     A            PORTIM    R
     A            PORSIG    R
     A            POTKTO    R
     A            POSPOR    R
     A            POAVKR    R
     A            POFRDA    R
     A            POTIDA    R
     A            POODAT    R
     A            POOTIM    R
     A            POOUSR    R
     A            POEDAT    R
     A            POETIM    R
     A            POEUSR    R
