     A*  Posteringer - Leverandører, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RLTXPFR                   PFILE(RLTXPF)
     A* Nøkkel
     A          K POFIRM
     A          K POLEVR
     A          K POBDAT
     A          K POTISD
