     A*  Posteringer - Leverandører, ALT INDEX
     A*
     A          R RLTXPFR                   PFILE(RLTXPF)
     A* Nøkkel
     A          K POFIRM
     A          K POLEVR
     A          K POREFN
     A          K POBDAT
