     A*  Leverandører - Index
     A*
     A          R RLW1PFR                   PFILE(RLW1PF)
     A*
     A* Nøkkel
     A*
     A          K RWKKEY
