     A*  Arbeidsregister - Generell definisjon
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RLW1PFR
     A            RWKREC    R
     A            RWKKEY    R
     A            RWKFIR    R
     A            RWKNIV    R
     A            RWKSAL    R
     A            RWKALF    R
     A            RWKKNR    R
     A* Nøkkel
     A          K RWKKEY
