     A*  Leverandører - Index firma nivå saldo alfa Leverandør
     A*
     A          R RLW1PFR                   PFILE(RLW1PF)
     A*
     A* Nøkkel
     A*
     A          K RWKFIR
     A          K RWKNIV
     A          K RWKSAL                    DESCEND
     A          K RWKALF
     A          K RWKKNR
