      *
      * MAMUT flatfil
      *
     A          R RM02PFR
     A            RMDATA       800A         TEXT('Data')
     A                                      COLHDG('Data')
