      *
      * Almenning, bruksrett-type
      *
     A                                      REF(*LIBL/RFRF)
     A          R RMBTPFR
     A            RMTFIR    R
     A            RMTALM    R
     A            RMTBRT    R
     A            RMTTXT    R
     A            RMTRA1    R
     A            RMTRA2    R
     A            RMTMVA    R
     A            RMTAVD    R
     A            RMTKTO    R
     A            RMTSPS    R
T5.50A            RMTSKO    R
     A            RMTODA    R
     A            RMTEDA    R
     A            RMTETI    R
     A            RMTEUS    R
