     A*  Eiendommer
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RMEIPFR
     A            RMEFIR    R
     A            RMEALM    R
     A            RMEGNR    R
     A            RMEBNR    R
     A            RMENAV    R
     A            RMEAD1    R
     A            RMEAD2    R
     A            RMEPNR    R
     A            RMEARE    R
     A            RMEDYR    R
     A            RMEUTM    R
     A            RMEST1    R
     A            RMEST2    R
     A            RMENA2    R
     A            RMTING    R
     A            RMSAER    R
     A            RMDRIF    R
     A            RMKARA    R
     A            RMBORT    R
     A            RMHBYG    R
     A            RMLBYG    R
     A            RMDBYG    R
     A            RMAHUS    R
6.37 A            RMEKON    R
     A            RMEODA    R
     A            RMEEDA    R
     A            RMEETI    R
     A            RMEEUS    R
