     A*  EIENDOMMER - Program, Logisk file for update
     A*
     A          R RMEIPFR                   PFILE(RMEIPF)
     A* Nøkkel
     A          K RMEFIR
     A          K RMEALM
     A          K RMEGNR
     A          K RMEBNR
