     A*  EIENDOMMSKNUTNING - Program, Logisk file for update
     A*
     A          R RMKNPFR                   PFILE(RMKNPF)
     A* Nøkkel
     A          K RMXFIR
     A          K RMXALM
     A          K RMXKNR
     A          K RMXGNR
     A          K RMXBNR
