     A*  Eiendomsknytninger
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RMKNPFR
     A            RMXFIR    R
     A            RMXALM    R
     A            RMXKNR    R
     A            RMXGNR    R
     A            RMXBNR    R
     A            RMXODA    R
     A            RMXEDA    R
     A            RMXETI    R
     A            RMXEUS    R
