     A*  EINDOMMSKNYTNING, Program Les
     A*
     A          R RMKNPFR                   PFILE(RMKNPF)
     A* Nøkkel
     A          K RMXFIR
     A          K RMXALM
     A          K RMXKNR
     A          K RMXGNR
     A          K RMXBNR
