     A*  EIENDOMMSKNYTNING - Program, Les
     A*
     A          R RMKNPFR                   PFILE(RMKNPF)
     A* Nøkkel
     A          K RMXFIR
     A          K RMXKNR
