     A*  Kunder - Tilleggsinformasjon
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RMKUPFR
     A            RMFIRM    R
     A            RMKUND    R
     A            RMKFDA          L
