     A*  Kunder, Logisk file for les
     A*
     A          R RMKUPFR                   PFILE(RMKUPF)
     A* Nøkkel
     A          K RMFIRM
     A          K RMKUND
