     A*  Kunder, Logisk file for update
     A*
     A*
     A          R RMKUPFR                   PFILE(RMKUPF)
     A* Nøkkel
     A          K RMFIRM
     A          K RMKUND
