     A*  OMRÅDE - Program, Les
     A*
     A          R RMOMPFR                   PFILE(RMOMPF)
     A* Nøkkel
     A          K RMOFIR
     A          K RMOOMR
