     A*  OMRÅDE - Fysisk file
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RMOMPFR
     A            RMOFIR    R
     A            RMOOMR    R
     A            RMONAV    R
     A            RMOTYP    R
     A            RMOVNR    R
     A            RMSTYP    R
     A            RMSVNR    R
     A            RMOODA    R
     A            RMOEDA    R
     A            RMOETI    R
     A            RMOEUS    R
