     A* MAL PROFF  Feiltranser
     A*
     A*
     A          R RMPFPFR
     A            RMFFIR         3S 0       COLHDG('Firma')
     A            RMFKDA          L         COLHDG('K_Dato')
     A            RMFKTI          T         COLHDG('K_Tid')
     A            RMFTEL         3S 0       COLHDG('K_Tell')
     A            RMFREC       200          COLHDG('Record')
     A            RMFEUS        10          COLHDG('Endret BRUKER')
     A            RMFEDA          L         COLHDG('Endret DATO')
     A            RMFETI          T         COLHDG('Endret KL')
