     A*  MalProff, Logisk file for update  (sideregister)
     A*
     A                                      UNIQUE
     A          R RMPIPFR                   PFILE(RMPIPF)
     A* Nøkkel
     A          K RMPFIR
     A          K RMPLAG
     A          K RMPVAR
     A          K RMPKDA
     A          K RMPKTI
     A          K RMPSEK
