     A* MAL PROFF  Tilleggsinfo
     A*
     A*
     A          R RMPIPFR
     A            RMPFIR         3S 0       COLHDG('Firma')
     A            RMPLAG         2S 0       COLHDG('Lager')
     A            RMPVAR        15          COLHDG('Varenr.')
     A            RMPKDA          L         COLHDG('K_Dato')
     A            RMPKTI          T         COLHDG('K_Tid')
     A            RMPSEK         6S 0       COLHDG('Sekvens')
     A            RMPONR         8S 0       COLHDG('Ordrenr')
     A            RMPLIN         4S 0       COLHDG('Linje')
     A            RMPKNR         8S 0       COLHDG('Kund.nr')
     A            RMPDAT          L         COLHDG('Dato')
     A            RMPTIM          T         COLHDG('Tid')
     A            RMPFDA          L         COLHDG('Fakt.dat')
     A            RMPAVD        30          COLHDG('Avdeling')
     A            RMPKUN        40          COLHDG('Kunde')
     A            RMPREF        40          COLHDG('Referanse')
     A            RMPEUS        10          COLHDG('Endret BRUKER')
     A            RMPEDA          L         COLHDG('Endret DATO')
     A            RMPETI          T         COLHDG('Endret KL')
