      *
      *
     A                                      REF(*LIBL/FFRF)
     A          R RMVXPFR
     A            RXFIRM         3S 0
     A            RXSMVK         2A         TEXT('SAFT-MVA-KODE')
     A            RXMVAP         4S 2       TEXT('MVA-PROSENT')
     A            RXNETO        11S 2       TEXT('Netto')
     A            RXGRLA        11S 2       TEXT('Grunnlag')
     A            RXIMVA        11S 2       TEXT('Ing.mva')
     A            RXUMVA        11S 2       TEXT('Utg.mva')
     A            RXEDAT          L         TEXT('Endret dato')
     A                                      COLHDG('End.Dat')
     A            RXETIM          T         TEXT('Endret tid')
     A                                      COLHDG('End.Tid')
     A            RXEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
