     A*  Registrering - posteringer
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
     A*
     A                                      REF(*LIBL/IINKST)
     A          R RNAVPFR
     A            UID       R
     A            IIFIRM    R
     A            IIBILN    R
     A            IIBDAT    R
     A            IIFDAT    R
     A            IIBILK    R
     A            IITEXT    R
     A            IIDAVD    R
     A            IIDKTO    R
     A            IIDSPS    R
     A            IIDMOM    R
     A            IICAVD    R
     A            IICKTO    R
     A            IICSPS    R
     A            IICMOM    R
     A            IIBELP    R
     A            IIKUND    R
     A            IIKREF    R
     A            IIKIDI    R
     A            IIVALK    R
     A            IIVALB    R
     A            IIPROJ    R
     A            IIAKTI    R
     A            IISFAK    R
     A            IIODAT    R
     A            IIOTIM    R
     A            IIOUSR    R
     A            IIBODA          L
