     A*  Prosjekter, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RP1PPFR                   PFILE(RP1PPF)
     A* Nøkkel
     A          K RP1FRM
     A          K RP1PRO
