     A*  Prosjekter - Avdeling index
     A*
     A          R RP1PPFR                   PFILE(RP1PPF)
     A* Nøkkel
     A          K RP1FRM
     A          K RP1AVD
     A          K RP1PRO
