     A*  Prosjekter
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RP1PPFR
     A            RP1FRM    R
     A            RP1PRO    R
     A            RP1AVD    R
     A            RP1TXT    R
     A            RP1TX2    R
     A            RP1KNR    R
     A            RP1KRN    R
     A            RP1KRF    R
     A            RP1KRT    R
     A            RP1KRM    R
     A            RP1PRL    R
     A            RP1BUO    R
     A            RP1BUT    R
     A            RP1RUP    R
     A            RP1RAK    R
     A            RP1RAO    R
     A            RP1AST    R
     A            RP1STS    R
     A            RP1PTY    R
     A            RP1FSD    R
     A            RP1FED    R
     A            RP1VSD    R
     A            RP1VED    R
     A            RP1ALF    R
     A            RP1ODA    R
     A            RP1OTI    R
     A            RP1OAV    R
     A            RP1EDA    R
     A            RP1ETI    R
     A            RP1EAV    R
