     A*  Prosjekter, Under, Logisk file for update
     A*
     A*                                     UNIQUE
     A          R RP2UPFR                   PFILE(RP2UPF)
     A* Nøkkel
     A          K RP2FRM
     A          K RP2UPR
     A          K RP2PRO
