     A*  Prosjekter, Under
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RP2UPFR
     A            RP2FRM    R
     A            RP2PRO    R
     A            RP2UPR    R
     A            RP2AVD    R
     A            RP2TXT    R
     A            RP2TX2    R
     A            RP2KNR    R
     A            RP2KRN    R
     A            RP2KRF    R
     A            RP2KRT    R
     A            RP2KRM    R
     A            RP2PRL    R
     A            RP2BUO    R
     A            RP2BUT    R
     A            RP2RAK    R
     A            RP2RAO    R
     A            RP2STS    R
     A            RP2PTY    R
     A            RP2FSD    R
     A            RP2FED    R
     A            RP2VSD    R
     A            RP2VED    R
     A            RP2ALF    R
     A            RP2ODA    R
     A            RP2OTI    R
     A            RP2OAV    R
     A            RP2EDA    R
     A            RP2ETI    R
     A            RP2EAV    R
