     A*  Prosjekter, Under, Aktivitet, Logisk file for update
     A*
     A          R RP3APFR                   PFILE(RP3APF)
     A* Nøkkel
     A          K RP3FRM
     A          K RP3PRO
     A          K RP3UPR
     A          K RP3ALF
