     A*  Arb.ordre
     A*
     A                                      UNIQUE
     A          R RP4OPFR                   PFILE(RP4OPF)
     A* Nøkkel
     A          K RP4FRM
     A          K RP4PRO
     A          K RP4UPR
     A          K RP4AKT
     A          K RP4ORD
