     A*  Prosjekter, Under, Aktivitet, Arb.Ordre
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RP4OPFR
     A            RP4FRM    R
     A            RP4PRO    R
     A            RP4UPR    R
     A            RP4AKT    R
     A            RP4ORD    R
     A            RP4TXT    R
     A            RP4TX2    R
     A            RP4KRN    R
     A            RP4KRF    R
     A            RP4KRT    R
     A            RP4KRM    R
     A            RP4PRL    R
     A            RP4LEV    R
     A            RP4ARL    R
     A            RP4STS    R
     A            RP4OTY    R
     A            RP4FSD    R
     A            RP4FED    R
     A            RP4VSD    R
     A            RP4VED    R
     A            RP4ALF    R
     A            RP4ODA    R
     A            RP4OTI    R
     A            RP4OAV    R
     A            RP4EDA    R
     A            RP4ETI    R
     A            RP4EAV    R
