     A*  Prosjekt, Standard Aktiviteter
     A*
     A          R RP9SPFR                   PFILE(RP9SPF)
     A* Nøkkel
     A          K RP9FRM
     A          K RP9AST
     A          S RP9AKT                    COMP(EQ '  ')
