     A*  Prosjekter  Standard aktivitet
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RP9SPFR
     A            RP9FRM    R
     A            RP9AST    R
     A            RP9AKT    R
     A            RP9TXT    R
      *
     A            RP9ODA    R
     A            RP9OTI    R
     A            RP9OAV    R
     A            RP9EDA    R
     A            RP9ETI    R
     A            RP9EAV    R
