     A*  Parameter - Generell definisjon
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RPARPFR
     A            RWPFIR    R
     A            RWPREC    R
     A* Nøkkel
     A          K RWPFIR
