      *
      * PROSJEKT,  DIV KODER
      *
     A                                      UNIQUE
     A          R RPKOPFR                   PFILE(*LIBL/RPKOPF)
      *
     A          K RPKFIR    R
     A          K RPKTYP    R
     A          K RPKKOD    R
