     A*  Prosjekt-rapporter (Heading) - Logisk file for update
     A*
     A                                      UNIQUE
     A          R RPRRPFR                   PFILE(RPRRPF)
     A* Nøkkel
     A          K RPHFIR
     A          K RPHRAP
     A          K RPHLIN
     A          K RPHULI
