     A*  Prosjekt-rapporter (Heading) - Logisk file for read
     A*
     A          R RPRRPFR                   PFILE(RPRRPF)
     A                                      TEXT('Rapportnr.-index')
     A* Nøkkel
     A          K RPHFIR
     A          K RPHRAP
     A          K RPHLIN
     A          K RPHULI
