     A*  Prosjekt-rapporter (Heading)
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RPRRPFR
     A            RPHFIR    R
     A            RPHRAP    R
     A            RPHTXT    R
     A            RPHLIN    R
     A            RPHULI    R
     A            RPHKTF    R
     A            RPHBEF    R
     A            RPHKTT    R
     A            RPHBET    R
     A            RPHLI1    R
     A            RPHLI2    R
     A            RPHFRT    R
     A            RPHFUN    R
     A            RPHPRO    R
     A            RPHLKT    R
     A            RPHLPO    R
     A            RPHSKR    R
     A            RPHFAP    R
     A            RPHFAM    R
     A            RPHODA    R
     A            RPHEDA    R
     A            RPHETI    R
     A            RPHEUS    R
