     A*  Prosjekt-rapporter (LINJER), Logisk file for read
     A*
     A          R RPRXPFR                   PFILE(RPRXPF)
     A* Nøkkel
     A          K RPRXRA
     A          K RPRXLI
