      *
      * Budsjetterte varer pr prosjekt   (smk=SmarKalk)
      *
     A          R RPVAPFR                   PFILE(*LIBL/RPVAPF)
      *
     A          K RPVFIR    R
     A          K RPVPRO    R
     A          K RPVUPR    R
     A          K RPVAKT    R
     A          K RPVTXT    R
     A          K RPVLAS    R
