      *
      * INNLESNING PROSJEKT FRA XL-ARK
      *
     A          R RPXLPFR
     A            D_PPRO         6          COLHDG('Prosjekt')
     A            D_PTXT        30          COLHDG('Tekst')
     A            D_PTX2        30          COLHDG('Tekst-2')
     A            D_PFRA        10          COLHDG('Fra Dato')
     A            D_PTIL        10          COLHDG('Til Dato')
     A            D_PPRL         5          COLHDG('Prosjektleder')
     A            D_PAVD         4          COLHDG('Avdeling')
     A            D_PKNR         6          COLHDG('Kundenr.')
     A            D_PBIN        13          COLHDG('Budsj.Innt.')
     A            D_PBUT        13          COLHDG('Budsj.Utg.')
     A            D_PTYP         1          COLHDG('Type')
     A            D_PSTA         1          COLHDG('Status')
     A            D_PUPR         1          COLHDG('Bruk U.Pro')
     A            D_PAKT         1          COLHDG('Bruk Akt.')
     A            D_UUPR         6          COLHDG('Prosjekt')
     A            D_UTXT        30          COLHDG('Tekst')
     A            D_UTX2        30          COLHDG('Tekst-2')
     A            D_UFRA        10          COLHDG('Fra Dato')
     A            D_UTIL        10          COLHDG('Til Dato')
     A            D_UPRL         5          COLHDG('Prosjektleder')
     A            D_UAVD         4          COLHDG('Avdeling')
     A            D_UKNR         6          COLHDG('Kundenr.')
     A            D_UKRF        30          COLHDG('K.Ref')
     A            D_UTLF        15          COLHDG('telefon')
     A            D_UEPO        60          COLHDG('ePost')
     A            D_UBIN        13          COLHDG('Budsj.Innt.')
     A            D_UBUT        13          COLHDG('Budsj.Utg.')
     A            D_UAKT         1          COLHDG('Bruk Akt.')
     A            D_USTA         1          COLHDG('Status')
     A            D_AAKT         6          COLHDG('Aktivitet')
     A            D_ATXT        30          COLHDG('Tekst')
     A            D_ATX2        30          COLHDG('Tekst-2')
     A            D_AFRA        10          COLHDG('Fra Dato')
     A            D_ATIL        10          COLHDG('Til Dato')
     A            D_APRL         5          COLHDG('Prosjektleder')
     A            D_AAVD         4          COLHDG('Avdeling')
     A            D_AKNR         6          COLHDG('Kundenr.')
     A            D_AKRF        30          COLHDG('K.Ref')
     A            D_ATLF        15          COLHDG('telefon')
     A            D_AEPO        60          COLHDG('ePost')
     A            D_ABIN        13          COLHDG('Budsj.Innt.')
     A            D_ABUT        13          COLHDG('Budsj.Utg.')
     A            D_ASTA         1          COLHDG('Status')
     A            D_FEIL       100          COLHDG('Feilmeldinger')
     A            D_USER        10          COLHDG('Bruker')
     A            D_DATO          L         COLHDG('Dato')
