      *
      * Innlesning Prosjekt fra XL-Ark
      *
     A          R RPXLPFR
     A                                      PFILE(*LIBL/RPXLPF)
      *
     A          K D_USER
     A          K D_PPRO
     A          K D_UUPR
     A          K D_AAKT
