     A*  Refaranseregister - Heading
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RRF0PFR
     A            RR0FIR    R
     A            RR0RAP    R
     A            RR0TXT    R
     A            RR0BFJ    R
KOB  A            RR0AVV    R
KOB  A            RR0HEL    R
     A            RR0DAT    R
     A            RR0TIM    R
     A            RR0USR    R
