     A*  Resultatrapport - linjehode
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RRF5PFR
     A            RR5FIR    R
     A            RR5RAP    R
     A            RR5LIN    R
     A            RR5TXT    R
     A            RR5KOD    R
     A            RR5SLN    R
     A            RR5NUL    R
     A            RR5ABL    R
     A            RR5BER    R
     A            RR5DAT    R
     A            RR5TIM    R
     A            RR5USR    R
