     A*  Resultatrapport
     A*
     A          R RRF5PFR                   PFILE(RRF5PF)
     A* Nøkkel
     A          K RR5FIR
     A          K RR5RAP
     A          K RR5TXT
