     A*  Resultatrapport  - fra/til konto
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RRF8PFR
     A            RR8FIR    R
     A            RR8RAP    R
     A            RR8LIN    R
     A            RR8LØP    R
     A            RR8FKL    R
     A            RR8FKT    R
     A            RR8FSP    R
     A            RR8FAV    R
     A            RR8TKL    R
     A            RR8TKT    R
     A            RR8TSP    R
     A            RR8TAV    R
     A            RR8KLF    R
     A            RR8LIF    R
     A            RR8MOT    R
     A            RR8PRO    R
     A            RR8DAT    R
     A            RR8TIM    R
     A            RR8USR    R
