     A*  Resultatrapport  - fra/til konto
     A*
     A          R RRF8PFR                   PFILE(RRF8PF)
     A* Nøkkel
     A          K RR8FIR
     A          K RR8RAP
     A          K RR8FKT
     A          K RR8FSP
     A          K RR8FAV
