     A*  Resultatrapport - resultatregister
     A*
     A          R RRF9PFR                   PFILE(RRF9PF)
     A* Nøkkel
     A          K RR9FIR
     A          K RR9RAP
     A          K RR9LIN
     A          K RR9AVD
     A          K RR9AAR
     A          K RR9TYP
