     A*  Resultatrapport - resultatregister
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RRF9PFR
     A            RR9FIR    R
     A            RR9RAP    R
     A            RR9LIN    R
     A            RR9AVD    R
     A            RR9AAR    R
     A            RR9TYP    R
     A            RR9TXT    R
     A            RR9KOD    R
     A            RR9SLN    R
     A            RR9NUL    R
     A            RR9ABL    R
     A            RR9S01    R
     A            RR9S02    R
     A            RR9S03    R
     A            RR9S04    R
     A            RR9S05    R
     A            RR9S06    R
     A            RR9S07    R
     A            RR9S08    R
     A            RR9S09    R
     A            RR9S10    R
     A            RR9S11    R
     A            RR9S12    R
     A            RR9S13    R
     A            RR9S00    R
     A            RR9DPR    R
     A            RR9HIA    R
