      *
      *
7.00  * sst  170920     Lagt til parameter vedr scedulering
      *
     A                                      REF(*LIBL/FFRF)
     A          R RSCDPFR
     A            RCAFIR    R               REFFLD(FÅFIRM)
     A            RCFAA          1A         TEXT('Få fil')
     A            RCHENT         1A         TEXT('Hent fil')
     A            RCFTPA        10A         TEXT('FTP-Anmodning')
     A            RCJNAV        10A         TEXT('Jobb-Navn')
     A            RCSTAT        10A         TEXT('Status')
7.00 A            RCDAGL         1A         TEXT('Kjøres daglig')
7.00 A                                      COLHDG('Kj.dagl')
7.00 A            RCDAG1         4A         TEXT('Kjøres dag 1 ')
7.00 A                                      COLHDG('Kj.dag1')
7.00 A            RCDAG2         4A         TEXT('Kjøres dag 2 ')
7.00 A                                      COLHDG('Kj.dag2')
7.00 A            RCDAG3         4A         TEXT('Kjøres dag 3 ')
7.00 A                                      COLHDG('Kj.dag3')
7.00 A            RCDAG4         4A         TEXT('Kjøres dag 4 ')
7.00 A                                      COLHDG('Kj.dag4')
7.00 A            RCDAG5         4A         TEXT('Kjøres dag 5 ')
7.00 A                                      COLHDG('Kj.dag5')
7.00 A            RCDAG6         4A         TEXT('Kjøres dag 6 ')
7.00 A                                      COLHDG('Kj.dag6')
7.00 A            RCSTOV         6A         TEXT('Start ovf.')
7.00 A                                      COLHDG('StartOvf')
7.00 A            RCSTOP         6A         TEXT('Start Oppd')
7.00 A                                      COLHDG('StartOppd')
7.00 A            RCSLUT         6A         TEXT('Stopp kl.    ')
7.00 A                                      COLHDG('StoppKl')
7.00 A            RCREPP         3A         TEXT('Hvert n. min.')
7.00 A                                      COLHDG('StoppKl')
7.00 A            RCMDAG         4A         TEXT('Kjøres dag i mnd.')
7.00 A                                      COLHDG('DagMnd')
7.00 A            RCMDAN         1A         TEXT('Kjøres dag nr.')
7.00 A                                      COLHDG('DagMndN')
7.00 A            RCAMND         2A         TEXT('Kjøres mnd i år')
7.00 A                                      COLHDG('MndAar')
7.00 A            RCADAG         4A         TEXT('Kjøres dag i mnd i år')
7.00 A                                      COLHDG('DgMnAr')
7.00 A            RCADAN         1A         TEXT('Kjøres dag nr.')
7.00 A                                      COLHDG('DgMnArN')
7.00 A            RCEDAT          L         TEXT('Endret dato')
7.00 A                                      COLHDG('End.Dat')
7.00 A            RCETIM          T         TEXT('Endret tid')
7.00 A                                      COLHDG('End.Tid')
7.00 A            RCEUSR        10A         TEXT('Endret av')
7.00 A                                      COLHDG('Endret av')
