     A*  Status innlesning fra Svea eller andre
     A*
     A                                      UNIQUE
     A          R RSVSPFR                   PFILE(RSVSPF)
     A* Nøkkel
     A          K RVFIRM
     A          K RVTYPE
     A          K RVFDAT
     A          K RVFILE
