     A*  Status innlesning filer fra Svea eller andre kilder
     A*
     A
     A          R RSVSPFR
     A            RVFIRM         3S 0       COLHDG('Firma')
     A            RVTYPE        10A         COLHDG('TypeFil')
     A            RVFDAT          L         COLHDG('FilDato')
     A            RVFILE        30A         COLHDG('Filnavn')
     A            RVANTL         3S 0       COLHDG('Ant.Les')
     A            RVODAT          L         COLHDG('Oppr.Dato')
     A            RVOTIM          T         COLHDG('Oppr.Tid')
     A            RVOUSR        10A         COLHDG('Oppr.Av')
     A            RVEDAT          L         COLHDG('Endr.Dato')
     A            RVETIM          T         COLHDG('Endr.Tid')
     A            RVEUSR        10A         COLHDG('Endr.Av')
