      *****************************************************************
      *
      *    --- RTOTL3 - TOTAL KONTOPLAN (FIRMA-KBARER) ---
      *
      *****************************************************************
     A          R RTOTPFR                   PFILE(RTOTPF)
     A          K FIRMA
     A          K KBARER
