      *****************************************************************
      *
      *         ---  RTOTPF - TOTAL KONTOPLAN FOR RAPPORTERING ---
      *
      *****************************************************************
     A                                      REF(*LIBL/RFRF)
     A          R RTOTPFR                      TEXT('TOTAL KONTOPLAN')
     A            FIRMA     R               REFFLD(RHFIRM)
     A            FINAVN        30A
     A            KONTO     R               REFFLD(RHKONT)
     A            KONAVN        30A
     A            AVDE      R               REFFLD(RHAVDE)
     A            AVNAVN        30A
     A            KBARER    R               REFFLD(RHSPES)
     A            KBNAVN        30A
     A            REFNR          4S 0       COLHDG('Refnr.')
     A            REFTXT        30A         COLHDG('Ref.tekst')
     A            KTOREF         4S 0       COLHDG('Ktoref.')
6.10 A            SPODAT    R
6.10 A            SPOTIM    R
6.10 A            SPOUSR    R
6.10 A            SPEDAT    R
6.10 A            SPETIM    R
6.10 A            SPEUSR    R
