      *****************************************************************
      *
      *         --- RTOTL2 - TOTAL KONTOPLAN (FIRMA-AVDE) ---
      *
      *****************************************************************
     A          R RTOTPFR                   PFILE(RTOTPF)
     A          K FIRMA
     A          K AVDE
