     A*  Registrering - transaksjonsfile
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RTRIPFR
610  A            RTNIVO    R
610  A            RTMEMB    R
     A            RTFIRM    R
     A            RTBUNT    R
     A            RTLINJ    R
     A            RTREID    R
     A            RTSTAT    R
     A            RTBDAT    R
     A            RTBELØ    R
T5.30A            RTGMVA    R
     A            RTRAAR    R
     A            RTRPER    R
     A            RTBILN    R
     A            RTBILL    R
     A            RTDAVD    R
     A            RTDKTO    R
     A            RTDSPS    R
E5.30A            RTDMVA    R
     A            RTCAVD    R
     A            RTCKTO    R
     A            RTCSPS    R
E5.30A            RTCMVA    R
6.20 A            RTPROS    R
6.20 A            RTUPRO    R
6.20 A            RTARBO    R
6.20 A            RTAKTI    R
     A            RTREFN    R
     A            RTFDAT    R
     A            RTKRAB    R
     A            RTVALK    R
     A            RTVALB    R
     A            RTMNGD    R
     A            RTMNGK    R
     A            RTRESN    R
     A            RTRESS    R
     A            RTRESA    R
     A            RTRESM    R
     A            RTVIRK    R
     A            RTATTE    R
T5.50A            RTATTU    R
T5.50A            RTADAT    R
     A            RTKRYS    R
     A            RTKIDI    R
T5.50A            RTKIDR    R
T5.50A            RTKSIF    R
T5.50A            RTKID2    R
     A            RTBILK    R
     A            RTTEXT    R
     A            RTBETB    R
     A            RTBREF    R
T5.20A            RTLFAK    R
     A            RTDECK    R
     A            RTAUTX    R
     A            RTBLDE    R
T5.50A            RTBONG    R
610  A            RTEDAT    R
610  A            RTETIM    R
610  A            RTEUSR    R
