     A*  Registrering - Transfile, Logisk update
     A*
     A          R RTRXPFR                   PFILE(RTRXPF)
     A*
     A* Nøkkel
     A*
     A          K RX1IST
     A          K RX1EMB
     A          K RX1FIR
     A          K RX1UNT
     A          K RX1INJ
     A          K RX1TEL
