     A*  Registrering - transaksjonsfile FOR for JAVA m / feil
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RTRXPFR
     A            RX1IST    R
     A            RX1EMB    R
     A            RX1FIR    R
     A            RX1UNT    R
     A            RX1INJ    R
     A            RX1TEL    R
     A            RXBELØ    R
     A            RXREFN    R
     A            RX1IVO    R
     A            RX1IV1    R
     A            RX1MSG    R
