     A*  Registrering - transaksjonsfile FOR for JAVA m / feil (Del2
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RTRZPFR
     A            RZ1IST    R
     A            RZ2IST    R
     A            RZ1EMB    R
     A            RZ1FIR    R
     A            RZ1UNT    R
     A            RZ1INJ    R
     A            RZ1KTO    R
     A            RZBELØ    R
     A            RZREFN    R
     A            RZBDAT    R
     A            RZDILN    R
     A            RZDBEL    R
     A            RZTIST    R
     A            RZWVLG    R
