     A*  Registrering - Feilposter
     A*
     A          R RTRZPFR                   PFILE(RTRZPF)
     A*
     A* Nøkkel
     A*
     A          K RZ1IST
     A          K RZ2IST
     A          K RZ1EMB
     A          K RZ1FIR
     A          K RZ1UNT
     A          K RZ1INJ
