      *
      *  Roller
      *
     A          R RUKFPFR                   PFILE(*LIBL/RUKFPF)
      *
     A          K RUFFIR
     A          K RUFTIL
