      *
      * Kortregister
      *
     A          R RUKRPFR                   PFILE(*LIBL/RUKRPF)
      *
     A          K RUKFIR
     A          K RUKHLD
     A          K RUKKUN
     A          K RUKPRO
