      *
      * Kortregister                        ktyp,kkun,kpro
      *
     A          R RUKRPFR                   PFILE(*LIBL/RUKRPF)
      *
     A          K RUKFIR
     A          K RUKTYP
     A          K RUKKUN
     A          K RUKPRO
