      *
      * Kortregister
      *
     A          R RUKRPFR                   PFILE(*LIBL/RUKRPF)
      *
     A          K RUKFIR
     A          K RUKKPN
     A          K RUKKUN
     A          K RUKPRO
