     A*  Kort                Index=Read
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RUKSPFR
     A            RUSFIR    R
     A            RUSKTY    R
     A            RUSLAG    R
     A            RUSKID    R
     A            RUSBES    R
     A            RUSFRK    R
     A            RUSDG1    R
     A            RUSDG2    R
     A            RUSDG3    R
     A            RUSDG4    R
     A            RUSDG5    R
     A            RUSDG6    R
     A            RUSDG7    R
     A            RUSFRA    R
     A            RUSTIL    R
     A            RUSHLD    R
6.2A A            RUSOME    R
6.2A A            RUSKKD    R
6.2J A            RUSITY    R
     A            RUSDAT    R
     A            RUSKTF    R
     A            RUSKTT    R
     A            RUSKTO    R
6.33 A            RUSSPE    R
     A            RUSBKD    R
     A            RUSTYP    R
6.33 A            RUSBTY    R
     A            RUSTIM    R
     A            RUSUSR    R
     A            RUSEDA    R
     A            RUSETI    R
     A            RUSEUS    R
     A            RUSODA    R
     A            RUSOTI    R
     A            RUSOUS    R
