     A*  Tilganger           Index=Read
     A*
     A                                      REF(*LIBL/RFRF)
     A          R RUKTPFR
     A            RUTFIR    R
     A            RUTPNR    R
     A            RUTTIL    R
     A            RUTEDA    R
     A            RUTETI    R
     A            RUTEUS    R
     A            RUTODA    R
     A            RUTOTI    R
     A            RUTOUS    R
