      *
      * Visma flatfil
      *
     A          R RV01PFR
     A            RVDATA       800A         TEXT('Data')
     A                                      COLHDG('Data')
