9.01  * 25.04.2014  Nho Utlegg av EDI transer til Visma
      * Visma flatfil
      *
     A          R RV03PFR
     A            RVDATA       800A         TEXT('Data')
     A                                      COLHDG('Data')
