      *
      * Visma GLOBAL flatfil
      *
     A          R RV12PFR
     A            RVDATA       800A         TEXT('Data')
     A                                      COLHDG('Data')
