      *
      * Visma flatfil
      *
     A          R RVK2PFR
     A            RVDATA       800A         TEXT('Data')
     A                                      COLHDG('Data')
