      *
      * Zirius
      *
     A          R RZ01PFR
     A            RZDATA       433A         TEXT('Data')
     A                                      COLHDG('Data')
