     A*  Posteringer - Summerte, Logisk file for update
     A*
     A                                      UNIQUE
     A          R RZUMPFR                   PFILE(RZUMPF)
     A* Nøkkel
     A          K RZFIRM
     A          K RZRAAR
     A          K RZBILN
     A          K RZBDAT
     A          K RZTELL
