      *
      * Fil for referansepriser
      *
     A          R SANSPFR                   PFILE(*LIBL/SANSPF)
      *
     A          K SAFIRM
     A          K SAPAAR
     A          K SABINR
     A          K SAORNR
     A          K SAORSU
     A          K SAORLI
     A          K SABONG
     A          K SAVARE
     A          K SAENHE
     A          K SAANTA
     A          K SADATE
     A          K SATIME
      *
