      *
      *  Fil for prisreferanse
      *
      * 220219 Ny tabell for BM
      *
     A                                      REF(*LIBL/SFRF)
     A          R SANSPFR
      *
     A            SAFIRM    R               REFFLD(SFFIRM)
     A            SAPAAR    R               REFFLD(SFPAAR)
     A            SABINR    R               REFFLD(SFBINR)
     A            SAORNR    R               REFFLD(SFORNR)
     A            SAORSU    R               REFFLD(SFORSU)
     A            SAORLI    R               REFFLD(SFORLI)
     A            SABONG    R               REFFLD(SFBONG)
     A            SAVARE    R               REFFLD(SFVARE)
     A            SAENHE    R               REFFLD(SFENHE)
     A            SAANTA    R               REFFLD(SFANTA)
     A            SADATE    R               REFFLD(SFDATE)
     A            SATIME    R               REFFLD(SFTIME)
      *
     A            SABELB        13S 2       TEXT('Referansebeløp')
     A                                      COLHDG('Referansebeløp')
     A            SAREFK        10A         TEXT('Kilde referansepris')
     A                                      COLHDG('Kilde refransepris')
      *
     A            SAEDAT          L         TEXT('Endret dato')
     A            SAETIM          T         TEXT('Endret tidspunkt')
     A            SAEUSR        10A         TEXT('Endret av')
     A            SAODAT          L         TEXT('Opprettet dato')
     A            SAOTIM          T         TEXT('Opprettet tidspunkt')
     A            SAOUSR        10A         TEXT('Opprettet av')
