      *
      *  Overføringer til Cobuilder - logg/status
      *
     A                                      REF(*LIBL/MFRF)
     A          R SCOBPFR
     A            SCFIRM    R
     A            SCSTAT    R
      *
     A            SCMAI1    R
     A            SCMAI2    R
     A            SCMAI3    R
     A            SCSUBJ    R
     A            SCTXT1    R
     A            SCTXT2    R
     A            SCTXT3    R
     A            SCSEND    R
      *
     A            SCUDAT    R
     A            SCUTID    R
     A            SCKDAT    R
      *
     A            SCODAT    R
     A            SCOTIM    R
     A            SCOUSR    R
     A            SCEDAT    R
     A            SCETIM    R
     A            SCEUSR    R
