      *
      *  Cobuilder- status/logg              Index=Update
      *
     A**                                    UNIQUE
     A          R SCOVPFR
     A                                      PFILE(*LIBL/SCOVPF)
      *
     A          K SVFIRM
     A          K SVNOBB
      *
