      *
      *  Overføringer til Cobuilder - nobbnummer
      *
     A                                      REF(*LIBL/MFRF)
     A          R SCOVPFR
     A            SVFIRM    R
     A            SVNOBB    R
     A            SVTEK1    R
      *
     A            SVODAT    R
     A            SVOTIM    R
     A            SVOUSR    R
     A            SVEDAT    R
     A            SVETIM    R
     A            SVEUSR    R
