     A          R SFRFR                     TEXT('ASSTAT')
      *
      *         DetteErEnFrf    (NB!!  Denne må ikke fjernes)
      *
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
5.01  * R5.01 260902 AMD  Utvidet tekstfeltene i PC-fil fra 15 til 35
5.02  * R5.02 260902 AMD  Lagt inn bestillingsnr. i salgsstatistikk
5.03  * R5.03 260902 AMD  Lagt inn leveringsmåte  i salgsstatistikk
5.04  * R5.04 031002 AMD  Lagt inn ordrenummer fra nett-butikken
5.05  * R5.05 031002 AMD  Lagt inn flagg for ekstern rapportering
5.06  * R5.06 071002 AMD  Utvidet Kunde/Lev.dør-kategori fra 2 til 4
5.07  * R5.07 150103 AMD  Utvidet Spesifikasjon/kostn.b. fra 2 til 4
5.21  * R5.21 171003 GRO  Utvidet nettbutikkref., lagt til fra-syst.
5.22  * R5.22 041103 ASK  Lagt inn ordrelinje på inkj.st + best. suff
5.23  * R5.23 041103 AMD  Lagt inn bestillings-linje-nummer på salgsst.
5.23  *                   + kundens bestillingsnr / linjenr
5.23  *                   + bruker/date/lokalt varereg og kontohenv
5.31  * R5.31 291203 AMD  Lagt inn tillegg for RingALm almenningsløsning
      *       160804 HKO  Salgsstatistikk:
      *                   Endret bongnr til A12 og lagt inn
      *                   varetekst-2, EAN-nr, serienr, sum mva,
      *                   selger kasse, opprettet-dato kasse, opprettet
      *                   tidspunkt kasse og bruker-id kasse
5.32  * R5.32 150904 AMD  Nye databasefelter i salgsstatisikk          g
5.33  * R5.33 200304 KOB  Lagt inn tillegg for aktuell og nominell m3  g
5.34  * R5.34 071004 AMD  Lagt inn gavekortreferanse                   g
      * R5.40 280305 KOB  Endret SILAND fra 3,0 til 2 alfa             g
      * R5.40 070405 KOB  Endret XXKONS til XXSELG I budsjett/akkum.   g
      *                   registre i innkjøpsstatistikk
      *       080805 HKO  Fjernet nettovekt, bruttovekt og volum fra
      *                   salgsstatistikken og innkjøpsstatistikken
      *       110805 HKO  Lagt inn varetype i salgsstatistikken
      *       230805 BØ   Lagt inn prog.uke /pakks.dato i Innkj.stat.
      * R5.50 231005 HKO  Lagt inn bonus til kunde inn i salgs-
      *                   statistikken
      *                   Fjernet bonuskode fra salgsstatistikken
      * R5.50 301005 HKO  Lagt inn bonus fra leverandør inn i
      *                   innkjøpsstatistikken
5.70  * PRGR  131108 BOF  Utvidet  SSTAPF med prisgruppe               F
6.10  * R6.10 080609 BSA  Oppdatert filer med sporingsinformajon. Opprettet
6.10  *                   dato, kl.slett og bruker. Endret dato, kl.slett og
6.10  *                   bruker.
6.11  *R610R  260808 BOF  Utvidet  EANN-NR fra 13 til 14 posisjoner
6.12  * R6.12 240310 AMD  Lagt inn kode for kredittkort
6.20  * R6.20 201211 BOF  Utvidet med pakkseddel dato på statistikk
6.21  * R6.20 300312 BSA  Setter defaultverdi for å unngå at dd/tid settes
6.21  *                   som verdi, der hvor nye tidsfelter legges til i
6.21  *                   allerede eksisterende filer.
6.30  * R6.30 260214 BOF  Utvidet med virk.lev.dat og bekr.lev.dato
6.31  * R6.30 290814 BOF  Utvidet SISTPF med div. felter fra best.hode
6.32  * R6.30 050814 BOF  Utvidet SSTAPF med Prosjekt og aktivitet
6.33  * R6.30 170914 BSA  Utvidet SISTPF med div. ifbm mva håndtering
6.34  * R6.30 031014 BOF  Utvidet SSTAPF med div. felter BM - statistikk
6.35  * R6.30 120515 BKV  Lagt inn SÅLVAR
6.36  * T6.30 140218 BOF  Utvidet med SFTDAT SFDDAT (tilbud og oppf.dato)
7.01  *       071020 BOF  SST  konverteringsprogrammer
7.nx  * K00   131120 bsa  Endringer relatert ti One Nexstep
7.02  * K00   211220 sst  Lagt på igjen SFUPRO på SSTA
      *
7.fb  * R6.40 240117 BOF  Utvidet med felter for Fordelt redus. salg
8.01  * 800   170123 ASK Lagt ut felter fra SST3PF ut på SSTAPF
8.02  * 800   170123 ASK Lagt ut nytt felt for gj.sn.kostpris på SSTAPF
8.03  * 800   210223 ASK Utvidet felt for prisgruppe til A(2)
      *
      * ----- ------ ---- -------------------------------------------------
      *
      *
      * Koder benyttet i STATISTIKK SYSTEM
      *
      *           SÅ = Diverse koder
      *           SA = Kunde-akkumulerings-register
      *           SB = Kunde-budsjett-register
      *           SC = Leverandør-budsjett-register
      *           SF = Kunde-statistikk-register
      *           SH = Leverandør-akkumulerings-register
      *           SI = Leverandør-statistikk-register
      *           SN = Kunde-budsjettnivå-register
      *           SM = Leverandør-budsjettnivå-register
      *           SP = Kunde-parameter-register
      *           SR = Leverandør-parameter-register
      *           SS = Kunde-statistikk-PC-register
      *           SW = Kunde/Leverandør-arbeids-register
      *
      * Referansefelter                     (SÅ)
      *
     A            SÅFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
      *
     A            SÅVALG         1A         TEXT('VALG')
     A                                      COLHDG('Valg')
     A            SÅSVAR         1S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Valg')
     A                                      TEXT('Valg')
     A            SÅNYEN        11A
     A                                      COLHDG('Ny/Endr')
     A                                      TEXT('Ny/Endr')
     A            SÅOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogr')
     A                                      EDTCDE(Z)
      *
     A            SÅHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgr')
     A                                      EDTCDE(Z)
      *
     A            SÅUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugr')
     A                                      EDTCDE(Z)
      *
     A            SÅVARE        15A         TEXT('Varenr')
     A                                      COLHDG('Varenr')
      *
     A            SÅTEK1        35A         TEXT('Varetekst 1')
     A                                      COLHDG('Varetekst 1')
      *
5.31 A            SÅBRTY         1S 0       TEXT('Bruksrett-type')
5.31 A                                      COLHDG('Bruksrett' 'type')
5.31 A                                      EDTCDE(Z)
5.31  *
5.31 A            SÅPRIV         1S 0       TEXT('Privat')
5.31 A                                      COLHDG('Priv.')
5.31 A                                      EDTCDE(Z)
5.31 A                                      VALUES(0 1)
5.31 A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
5.31  *
5.31 A            SÅALME         4S 0       TEXT('Allmenning')
5.31 A                                      COLHDG('Allm.')
5.31 A                                      EDTCDE(Z)
5.31  *
     A            SÅEDAT          L         TEXT('Endringsdato')
     A                                      COLHDG('Endr.dat')
      *
     A            SÅETIM          T         TEXT('Endringstidspunkt')
     A                                      COLHDG('Endr.tid')
      *
     A            SÅEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
5.70  *
8.03 A            SÅPRGR         2A         TEXT('Prisgruppe')
5.70 A                                      COLHDG('Pg')
      *
6.10 A            SÅODAT          L         TEXT('Opprettet dato')
6.10 A                                      COLHDG('Oppr. dato')
6.10  *
6.10 A            SÅOTIM          T         TEXT('Opprettet tidspunkt')
6.10 A                                      COLHDG('Oppr.tid')
6.10  *
6.10 A            SÅOUSR        10A         TEXT('Opprettet av')
6.10 A                                      COLHDG('Oppr. av')
6.31  *
6.20 A            SÅPROJ      0006A
6.31 A                                      COLHDG('Prosj')
6.31 A                                      TEXT('Prosjekt')
7.NX A            SÅUPRO      0006A
7.NX A                                      COLHDG('U.Prosj')
7.NX A                                      TEXT('UnderProsjekt')
6.31 A            SÅAKTI      0006A
6.31 A                                      COLHDG('Akt')
6.31 A                                      TEXT('Aktivitet')
6.35 A            SÅLVAR        20A         TEXT('Lev. varenr')
6.35 A                                      COLHDG('Lev. varenr')
      *
      * Akkumulerings-register (SKAKPF)     (SA)
      *
     A            SAFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
      *
     A            SAHHAA         4S 0       TEXT('År')
     A                                      COLHDG('År')
     A                                      EDTCDE(Z)
      *
     A            SAKODE        12A         TEXT('KeyKode')
     A                                      COLHDG('KeyKode')
      *
     A            SAAVDE         4S 0       TEXT('Avd. salg')
     A                                      COLHDG('Avd.' 'salg')
     A                                      EDTCDE(Z)
      *
     A            SALAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
      *
     A            SAOTYP         2A         TEXT('Ordretype')
     A                                      COLHDG('Ordretype')
      *
     A            SALAND         3A         TEXT('Land')
     A                                      COLHDG('Land')
      *
E5.40A            SADIST         4S 0       TEXT('Distrikt')
     A                                      COLHDG('Distr.')
     A                                      EDTCDE(Z)
      *
     A            SASELG         4S 0       TEXT('Selger')
     A                                      COLHDG('Selger')
     A                                      EDTCDE(Z)
      *
5.06 A            SAKKAT         4S 0       TEXT('Kundekategori')
     A                                      COLHDG('Kunde' 'kat.')
     A                                      EDTCDE(Z)
      *
     A            SAKUND         6S 0       TEXT('Fakturakunde')
     A                                      COLHDG('Fakt.' 'kunde')
     A                                      EDTCDE(Z)
      *
     A            SAOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogrp')
     A                                      EDTCDE(Z)
      *
     A            SAHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgrp')
     A                                      EDTCDE(Z)
      *
     A            SAUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugrp')
     A                                      EDTCDE(Z)
      *
     A            SAVARE        15A         TEXT('Varenummer')
     A                                      COLHDG('Varenr')
      *
     A            SASA01        11  2       TEXT('Brutto salg per. 01')
     A                                      COLHDG('Salg per.01')
     A                                      EDTCDE(K)
     A            SASA02        11  2       TEXT('Brutto salg per. 02')
     A                                      COLHDG('Salg per.02')
     A                                      EDTCDE(K)
     A            SASA03        11  2       TEXT('Brutto salg per. 03')
     A                                      COLHDG('Salg per.03')
     A                                      EDTCDE(K)
     A            SASA04        11  2       TEXT('Brutto salg per. 04')
     A                                      COLHDG('Salg per.04')
     A                                      EDTCDE(K)
     A            SASA05        11  2       TEXT('Brutto salg per. 05')
     A                                      COLHDG('Salg per.05')
     A                                      EDTCDE(K)
     A            SASA06        11  2       TEXT('Brutto salg per. 06')
     A                                      COLHDG('Salg per.06')
     A                                      EDTCDE(K)
     A            SASA07        11  2       TEXT('Brutto salg per. 07')
     A                                      COLHDG('Salg per.07')
     A                                      EDTCDE(K)
     A            SASA08        11  2       TEXT('Brutto salg per. 08')
     A                                      COLHDG('Salg per.08')
     A                                      EDTCDE(K)
     A            SASA09        11  2       TEXT('Brutto salg per. 09')
     A                                      COLHDG('Salg per.09')
     A                                      EDTCDE(K)
     A            SASA10        11  2       TEXT('Brutto salg per. 10')
     A                                      COLHDG('Salg per.10')
     A                                      EDTCDE(K)
     A            SASA11        11  2       TEXT('Brutto salg per. 11')
     A                                      COLHDG('Salg per.11')
     A                                      EDTCDE(K)
     A            SASA12        11  2       TEXT('Brutto salg per. 12')
     A                                      COLHDG('Salg per.12')
     A                                      EDTCDE(K)
     A            SASA13        11  2       TEXT('Brutto salg per. 13')
     A                                      COLHDG('Salg per.13')
     A                                      EDTCDE(K)
     A*
     A            SARA01        11  2       TEXT('Rabatter per. 01')
     A                                      COLHDG('Rab. per.01')
     A                                      EDTCDE(K)
     A            SARA02        11  2       TEXT('Rabatter per. 02')
     A                                      COLHDG('Rab. per.02')
     A                                      EDTCDE(K)
     A            SARA03        11  2       TEXT('Rabatter per. 03')
     A                                      COLHDG('Rab. per.03')
     A                                      EDTCDE(K)
     A            SARA04        11  2       TEXT('Rabatter per. 04')
     A                                      COLHDG('Rab. per.04')
     A                                      EDTCDE(K)
     A            SARA05        11  2       TEXT('Rabatter per. 05')
     A                                      COLHDG('Rab. per.05')
     A                                      EDTCDE(K)
     A            SARA06        11  2       TEXT('Rabatter per. 06')
     A                                      COLHDG('Rab. per.06')
     A                                      EDTCDE(K)
     A            SARA07        11  2       TEXT('Rabatter per. 07')
     A                                      COLHDG('Rab. per.07')
     A                                      EDTCDE(K)
     A            SARA08        11  2       TEXT('Rabatter per. 08')
     A                                      COLHDG('Rab. per.08')
     A                                      EDTCDE(K)
     A            SARA09        11  2       TEXT('Rabatter per. 09')
     A                                      COLHDG('Rab. per.09')
     A                                      EDTCDE(K)
     A            SARA10        11  2       TEXT('Rabatter per. 10')
     A                                      COLHDG('Rab. per.10')
     A                                      EDTCDE(K)
     A            SARA11        11  2       TEXT('Rabatter per. 11')
     A                                      COLHDG('Rab. per.11')
     A                                      EDTCDE(K)
     A            SARA12        11  2       TEXT('Rabatter per. 12')
     A                                      COLHDG('Rab. per.01')
     A                                      EDTCDE(K)
     A            SARA13        11  2       TEXT('Rabatter per. 13')
     A                                      COLHDG('Rab. per.12')
     A                                      EDTCDE(K)
     A*
     A            SAKO01        11  2       TEXT('Kostpris per. 01')
     A                                      COLHDG('Kost per.01')
     A                                      EDTCDE(K)
     A            SAKO02        11  2       TEXT('Kostpris per. 02')
     A                                      COLHDG('Kost per.02')
     A                                      EDTCDE(K)
     A            SAKO03        11  2       TEXT('Kostpris per. 03')
     A                                      COLHDG('Kost per.03')
     A                                      EDTCDE(K)
     A            SAKO04        11  2       TEXT('Kostpris per. 04')
     A                                      COLHDG('Kost per.04')
     A                                      EDTCDE(K)
     A            SAKO05        11  2       TEXT('Kostpris per. 05')
     A                                      COLHDG('Kost per.05')
     A                                      EDTCDE(K)
     A            SAKO06        11  2       TEXT('Kostpris per. 06')
     A                                      COLHDG('Kost per.06')
     A                                      EDTCDE(K)
     A            SAKO07        11  2       TEXT('Kostpris per. 07')
     A                                      COLHDG('Kost per.07')
     A                                      EDTCDE(K)
     A            SAKO08        11  2       TEXT('Kostpris per. 08')
     A                                      COLHDG('Kost per.08')
     A                                      EDTCDE(K)
     A            SAKO09        11  2       TEXT('Kostpris per. 09')
     A                                      COLHDG('Kost per.09')
     A                                      EDTCDE(K)
     A            SAKO10        11  2       TEXT('Kostpris per. 10')
     A                                      COLHDG('Kost per.10')
     A                                      EDTCDE(K)
     A            SAKO11        11  2       TEXT('Kostpris per. 11')
     A                                      COLHDG('Kost per.11')
     A                                      EDTCDE(K)
     A            SAKO12        11  2       TEXT('Kostpris per. 12')
     A                                      COLHDG('Kost per.12')
     A                                      EDTCDE(K)
     A            SAKO13        11  2       TEXT('Kostpris per. 13')
     A                                      COLHDG('Kost per.13')
     A                                      EDTCDE(K)
     A*
     A            SAAN01        11  2       TEXT('Antall per. 01')
     A                                      COLHDG('Ant. per.01')
     A                                      EDTCDE(K)
     A*
     A            SAAN02        11  2       TEXT('Antall per. 02')
     A                                      COLHDG('Ant. per.02')
     A                                      EDTCDE(K)
     A*
     A            SAAN03        11  2       TEXT('Antall per. 03')
     A                                      COLHDG('Ant. per.03')
     A                                      EDTCDE(K)
     A*
     A            SAAN04        11  2       TEXT('Antall per. 04')
     A                                      COLHDG('Ant. per.04')
     A                                      EDTCDE(K)
     A*
     A            SAAN05        11  2       TEXT('Antall per. 05')
     A                                      COLHDG('Ant. per.05')
     A                                      EDTCDE(K)
     A*
     A            SAAN06        11  2       TEXT('Antall per. 06')
     A                                      COLHDG('Ant. per.06')
     A                                      EDTCDE(K)
     A*
     A            SAAN07        11  2       TEXT('Antall per. 07')
     A                                      COLHDG('Ant. per.07')
     A                                      EDTCDE(K)
     A*
     A            SAAN08        11  2       TEXT('Antall per. 08')
     A                                      COLHDG('Ant. per.08')
     A                                      EDTCDE(K)
     A*
     A            SAAN09        11  2       TEXT('Antall per. 09')
     A                                      COLHDG('Ant. per.09')
     A                                      EDTCDE(K)
     A*
     A            SAAN10        11  2       TEXT('Antall per. 10')
     A                                      COLHDG('Ant. per.10')
     A                                      EDTCDE(K)
     A*
     A            SAAN11        11  2       TEXT('Antall per. 11')
     A                                      COLHDG('Ant. per.11')
     A                                      EDTCDE(K)
     A*
     A            SAAN12        11  2       TEXT('Antall per. 12')
     A                                      COLHDG('Ant. per.12')
     A                                      EDTCDE(K)
     A*
     A            SAAN13        11  2       TEXT('Antall per. 13')
     A                                      COLHDG('Ant. per.13')
     A                                      EDTCDE(K)
      *
      * Budsjettregister   (SKBUPF)         (SB)
      *
     A            SBFIRM    R               REFFLD(SÅFIRM)
      *
     A            SBHHAA         4S 0       TEXT('Budsjettår')
     A                                      COLHDG('Budsj' 'år')
     A                                      EDTCDE(Z)
      *
     A            SBVERS         2A         TEXT('Versjon')
     A                                      COLHDG('Versjon O/M')
      *
     A            SBKODE        12A         TEXT('KeyKode')
     A                                      COLHDG('KeyKode')
      *
     A            SBAABB         1A         TEXT('Antall/Beløp')
     A                                      COLHDG('Antall/Beløp')
      *
     A            SBAVDE         4S 0       TEXT('Avd. salg')
     A                                      COLHDG('Avd.' 'salg')
     A                                      EDTCDE(Z)
      *
     A            SBLAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
      *
     A            SBOTYP         2A         TEXT('Ordretype')
     A                                      COLHDG('Ordretype')
      *
     A            SBLAND         3A         TEXT('Land')
     A                                      COLHDG('Land')
      *
E5.40A            SBDIST         4S 0       TEXT('Distrikt')
     A                                      COLHDG('Distr.')
     A                                      EDTCDE(Z)
      *
     A            SBSELG         4S 0       TEXT('Selger')
     A                                      COLHDG('Selger')
     A                                      EDTCDE(Z)
      *
5.06 A            SBKKAT         4S 0       TEXT('Kundekategori')
     A                                      COLHDG('Kunde' 'kat.')
     A                                      EDTCDE(Z)
      *
     A            SBKUND         6S 0       TEXT('Fakturakunde')
     A                                      COLHDG('Fakt.' 'kunde')
     A                                      EDTCDE(Z)
      *
     A            SBOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogrp')
     A                                      EDTCDE(Z)
      *
     A            SBHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgrp')
     A                                      EDTCDE(Z)
      *
     A            SBUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugrp')
     A                                      EDTCDE(Z)
      *
     A            SBVARE        15A         TEXT('Varenummer')
     A                                      COLHDG('Varenr')
      *
     A            SBKOMM        35A         TEXT('Kommentarer')
     A                                      COLHDG('Komentarer')
      *
     A            SBBU01         9S 0       TEXT('Budsjett Periode 01')
     A                                      COLHDG('Budsjett' 'Periode 01')
     A                                      EDTCDE(K)
      *
     A            SBBU02         9S 0       TEXT('Budsjett Periode 02')
     A                                      COLHDG('Budsjett' 'Periode 02')
     A                                      EDTCDE(K)
      *
     A            SBBU03         9S 0       TEXT('Budsjett Periode 03')
     A                                      COLHDG('Budsjett' 'Periode 03')
     A                                      EDTCDE(K)
      *
     A            SBBU04         9S 0       TEXT('Budsjett Periode 04')
     A                                      COLHDG('Budsjett' 'Periode 04')
     A                                      EDTCDE(K)
      *
     A            SBBU05         9S 0       TEXT('Budsjett Periode 05')
     A                                      COLHDG('Budsjett' 'Periode 05')
     A                                      EDTCDE(K)
      *
     A            SBBU06         9S 0       TEXT('Budsjett Periode 06')
     A                                      COLHDG('Budsjett' 'Periode 06')
     A                                      EDTCDE(K)
      *
     A            SBBU07         9S 0       TEXT('Budsjett Periode 07')
     A                                      COLHDG('Budsjett' 'Periode 07')
     A                                      EDTCDE(K)
      *
     A            SBBU08         9S 0       TEXT('Budsjett Periode 08')
     A                                      COLHDG('Budsjett' 'Periode 08')
     A                                      EDTCDE(K)
      *
     A            SBBU09         9S 0       TEXT('Budsjett Periode 09')
     A                                      COLHDG('Budsjett' 'Periode 09')
     A                                      EDTCDE(K)
      *
     A            SBBU10         9S 0       TEXT('Budsjett Periode 10')
     A                                      COLHDG('Budsjett' 'Periode 10')
     A                                      EDTCDE(K)
      *
     A            SBBU11         9S 0       TEXT('Budsjett Periode 11')
     A                                      COLHDG('Budsjett' 'Periode 11')
     A                                      EDTCDE(K)
      *
     A            SBBU12         9S 0       TEXT('Budsjett Periode 12')
     A                                      COLHDG('Budsjett' 'Periode 12')
     A                                      EDTCDE(K)
      *
     A            SBEDAT    R               REFFLD(SÅEDAT)
     A            SBETIM    R               REFFLD(SÅETIM)
     A            SBEUSR    R               REFFLD(SÅEUSR)
      *
      * Budsjettregister   (SLBUPF)         (SB)
      *
     A            SCFIRM    R               REFFLD(SÅFIRM)
      *
     A            SCHHAA         4S 0       TEXT('Budsjettår')
     A                                      COLHDG('Budsj' 'år')
     A                                      EDTCDE(Z)
      *
     A            SCVERS         2A         TEXT('Versjon')
     A                                      COLHDG('Versjon O/M')
      *
     A            SCKODE        12A         TEXT('KeyKode')
     A                                      COLHDG('KeyKode')
      *
     A            SCAABB         1A         TEXT('Antall/Beløp')
     A                                      COLHDG('Antall/Beløp')
      *
     A            SCAVDE         4S 0       TEXT('Avd. salg')
     A                                      COLHDG('Avd.' 'salg')
     A                                      EDTCDE(Z)
      *
     A            SCLAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
      *
     A            SCOTYP         2A         TEXT('Ordretype')
     A                                      COLHDG('Ordretype')
      *
     A            SCLAND         3A         TEXT('Land')
     A                                      COLHDG('Land')
      *
E5.40A            SCDIST         4S 0       TEXT('Distrikt')
     A                                      COLHDG('Distr.')
     A                                      EDTCDE(Z)
      *
5.40 A            SCSELG         4S 0       TEXT('Selger')
     A                                      COLHDG('Selger')
     A                                      EDTCDE(Z)
      *
5.06 A            SCLKAT         4S 0       TEXT('Kundekategori')
     A                                      COLHDG('Kunde' 'kat.')
     A                                      EDTCDE(Z)
      *
     A            SCLDOR         6S 0       TEXT('Fakturakunde')
     A                                      COLHDG('Fakt.' 'kunde')
     A                                      EDTCDE(Z)
      *
     A            SCOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogrp')
     A                                      EDTCDE(Z)
      *
     A            SCHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgrp')
     A                                      EDTCDE(Z)
      *
     A            SCUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugrp')
     A                                      EDTCDE(Z)
      *
     A            SCVARE        15A         TEXT('Varenummer')
     A                                      COLHDG('Varenr')
      *
     A            SCKOMM        35A         TEXT('Kommentarer')
     A                                      COLHDG('Komentarer')
      *
     A            SCBU01         9S 0       TEXT('Budsjett Periode 01')
     A                                      COLHDG('Budsjett' 'Periode 01')
     A                                      EDTCDE(K)
      *
     A            SCBU02         9S 0       TEXT('Budsjett Periode 02')
     A                                      COLHDG('Budsjett' 'Periode 02')
     A                                      EDTCDE(K)
      *
     A            SCBU03         9S 0       TEXT('Budsjett Periode 03')
     A                                      COLHDG('Budsjett' 'Periode 03')
     A                                      EDTCDE(K)
      *
     A            SCBU04         9S 0       TEXT('Budsjett Periode 04')
     A                                      COLHDG('Budsjett' 'Periode 04')
     A                                      EDTCDE(K)
      *
     A            SCBU05         9S 0       TEXT('Budsjett Periode 05')
     A                                      COLHDG('Budsjett' 'Periode 05')
     A                                      EDTCDE(K)
      *
     A            SCBU06         9S 0       TEXT('Budsjett Periode 06')
     A                                      COLHDG('Budsjett' 'Periode 06')
     A                                      EDTCDE(K)
      *
     A            SCBU07         9S 0       TEXT('Budsjett Periode 07')
     A                                      COLHDG('Budsjett' 'Periode 07')
     A                                      EDTCDE(K)
      *
     A            SCBU08         9S 0       TEXT('Budsjett Periode 08')
     A                                      COLHDG('Budsjett' 'Periode 08')
     A                                      EDTCDE(K)
      *
     A            SCBU09         9S 0       TEXT('Budsjett Periode 09')
     A                                      COLHDG('Budsjett' 'Periode 09')
     A                                      EDTCDE(K)
      *
     A            SCBU10         9S 0       TEXT('Budsjett Periode 10')
     A                                      COLHDG('Budsjett' 'Periode 10')
     A                                      EDTCDE(K)
      *
     A            SCBU11         9S 0       TEXT('Budsjett Periode 11')
     A                                      COLHDG('Budsjett' 'Periode 11')
     A                                      EDTCDE(K)
      *
     A            SCBU12         9S 0       TEXT('Budsjett Periode 12')
     A                                      COLHDG('Budsjett' 'Periode 12')
     A                                      EDTCDE(K)
      *
     A            SCEDAT    R               REFFLD(SÅEDAT)
     A            SCETIM    R               REFFLD(SÅETIM)
     A            SCEUSR    R               REFFLD(SÅEUSR)
      *
      * Salgsstatistikk (SSTAPF)            (SF)
      *
     A            SFFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            SFPAAR         4S 0       TEXT('Periode-år')
     A                                      COLHDG('År')
     A                                      EDTCDE(Z)
     A            SFPMND         2S 0       TEXT('Periode-mnd')
     A                                      COLHDG('Mnd')
     A                                      EDTCDE(Z)
     A            SFVKUN         6S 0       TEXT('Varekunde')
     A                                      COLHDG('Vare' 'kunde')
     A                                      EDTCDE(Z)
     A            SFFKUN         6S 0       TEXT('Fakturakunde')
     A                                      COLHDG('Fakt.' 'kunde')
     A                                      EDTCDE(Z)
     A            SFKPRO         6S 0       TEXT('Kundeprosjekt')
     A                                      COLHDG('kunde' 'prosj.')
     A                                      EDTCDE(Z)
5.06 A            SFKKAT         4S 0       TEXT('Kundekategori')
     A                                      COLHDG('Kunde' 'kat.')
     A                                      EDTCDE(Z)
     A            SFRKAT         3S 0       TEXT('Rabattkategori')
     A                                      COLHDG('Rab.' 'kat.')
     A                                      EDTCDE(Z)
     A            SFSELG         4S 0       TEXT('Selger')
     A                                      COLHDG('Selger')
     A                                      EDTCDE(Z)
     A            SFKSEL         4S 0       TEXT('Kasse selger')
     A                                      COLHDG('Kasse' 'selger')
     A                                      EDTCDE(Z)
     A            SFLAND         3S 0       TEXT('Land')
     A                                      COLHDG('Land')
     A                                      EDTCDE(Z)
E5.40A            SFDIST         4S 0       TEXT('Distrikt')
     A                                      COLHDG('Distr.')
     A                                      EDTCDE(Z)
5.03  *
5.03 A            SFLMAT         2S 0       TEXT('Leveringsmåte')
5.03 A                                      COLHDG('Lev.' 'måte')
5.03 A                                      EDTCDE(Z)
5.03  *
     A            SFFRIK         5A         TEXT('Frie koder kunde')
     A                                      COLHDG('Frie' 'koder')
      *
     A            SFLETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
      *
     A            SFVARE        15A         TEXT('Varenummer')
     A                                      COLHDG('Varenr')
     A            SFTEK1        35A         TEXT('Varetekst 1')
     A                                      COLHDG('Varetekst 1')
     A            SFTEK2        35A         TEXT('Varetekst 2')
     A                                      COLHDG('Varetekst 2')
     A            SFOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogrp')
     A                                      EDTCDE(Z)
     A            SFHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgrp')
     A                                      EDTCDE(Z)
     A            SFUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugrp')
     A                                      EDTCDE(Z)
     A            SFRGRP         7S 0       TEXT('Rabattgruppe')
     A                                      COLHDG('Rgrp')
     A                                      EDTCDE(Z)
     A            SFKPRI         1A         TEXT('Priskode')
     A                                      COLHDG('Pris' 'kode')
     A            SFVTYP         1A         TEXT('Varetype')
     A                                      COLHDG('Vare' 'type')
5.23 A            SFLVRE         1S 0       TEXT('VA-registrert')
5.23 A                                      COLHDG('VA')
5.23 A                                      EDTCDE(Z)
     A            SFLDOR         6S 0       TEXT('Leverandørnr')
     A                                      COLHDG('Lev.')
     A                                      EDTCDE(Z)
6.35 A            SFLVAR    R               REFFLD(SÅLVAR)
6.35 A                                      TEXT('Leverandørs varenr.')
     A                                      COLHDG('Lev. varenr.')
6.11 A            SFEANN        14S 0       TEXT('EAN-nr')
     A                                      COLHDG('EAN-nr')
     A                                      EDTCDE(Z)
     A            SFNOBB         8S 0       TEXT('Nobbnr')
     A                                      COLHDG('Nobbnr')
     A                                      EDTCDE(Z)
     A            SFAHGR         2S 0       TEXT('Alt. hovedgruppe')
     A                                      COLHDG('Alt.' 'Hgrp')
     A            SFAUGR         3S 0       TEXT('Alt. undergruppe')
     A                                      COLHDG('Alt.' 'Ugrp')
     A            SFMODN         8S 0       TEXT('Modulnr')
     A                                      COLHDG('Monulnr')
     A                                      EDTCDE(Z)
     A            SFKAMP         5A         TEXT('Kampanje')
     A                                      COLHDG('Kamp.')
     A            SFLAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
     A            SFPRAN         4A         TEXT('Produktansvarlig')
     A                                      COLHDG('Prod.' 'ansv.')
6.NU A            SFBINR         8S 0       TEXT('Bilagsnummer')
     A                                      COLHDG('Bil.nr.')
     A                                      EDTCDE(Z)
     A            SFLINE         4S 0       TEXT('Bilag linjenummer')
     A                                      COLHDG('Bilag' 'ln')
     A                                      EDTCDE(Z)
     A            SFBIDA          L         TEXT('Bilagsdato')
     A                                      COLHDG('Bil.dato')
     A            SFOTYP         2A         TEXT('Ordretype')
     A                                      COLHDG('Ordretype')
6.NU A            SFORNR         8S 0       TEXT('Ordrenummer')
     A                                      COLHDG('Ordrenr')
     A                                      EDTCDE(Z)
     A            SFORSU         2S 0       TEXT('Ordre suffix')
     A                                      COLHDG('Ordre' 'suff.')
     A                                      EDTCDE(Z)
     A            SFORLI         4S 0       TEXT('Ordre linjenummer')
     A                                      COLHDG('Ordre' 'ln')
     A                                      EDTCDE(Z)
     A            SFORDA          L         TEXT('Ordredato')
     A                                      COLHDG('Ordredato')
     A            SFBONG        12A         TEXT('Bongnr')
     A                                      COLHDG('Bongnr')
6.NU A            SFBENR         8S 0       TEXT('Bestillings-nr')
5.02 A                                      COLHDG('Best' 'nr.')
5.02 A                                      EDTCDE(Z)
5.02 A            SFBSUF         2S 0       TEXT('Bestillings-suff')
5.02 A                                      COLHDG('Best' 'suff.')
5.02 A                                      EDTCDE(Z)
5.23 A            SFBLIN         4S 0       TEXT('Bestillings-linje')
5.23 A                                      COLHDG('Best' 'linje')
5.23 A                                      EDTCDE(Z)
5.23 A            SFKBNR        15A         TEXT('Kundens best.nr')
5.23 A                                      COLHDG('Kundens' 'best.nr')
5.23 A            SFKBLI         6S 0       TEXT('Kundens best.linje')
5.23 A                                      COLHDG('Kundens' 'best.linje')
5.32 A            SFPDAT          L         TEXT('Planlagt levert')
5.32 A                                      COLHDG('Planl' 'lev.')
5.32 A            SFLDAT          L         TEXT('Leverings dato')
5.32 A                                      COLHDG('Lev.' 'dato')
6.20 A            SFPADA          L         TEXT('Pakkseddel dato')
6.20 A                                      COLHDG('Pakks' 'dato')
6.21 A                                      DFT('0001-01-01')
      *
5.23 A            SFKHEV         4A         TEXT('Kontohenvisning')
5.23 A                                      COLHDG('Konto' 'henv.')
     A            SFSAVD         4S 0       TEXT('Avd. salg')
     A                                      COLHDG('Avd.' 'salg')
     A                                      EDTCDE(Z)
     A            SFSKON         6S 0       TEXT('Konto salg')
     A                                      COLHDG('Konto' 'salg')
     A                                      EDTCDE(Z)
5.07 A            SFSSPS         4S 0       TEXT('Spes. salg')
     A                                      COLHDG('Spes.' 'salg')
     A                                      EDTCDE(Z)
5.31  *
     A            SFSERI        20A         TEXT('Serienr')
     A                                      COLHDG('Serienr')
5.31 A            SFALME    R               REFFLD(SÅALME)
5.31 A            SFBRTY    R               REFFLD(SÅBRTY)
5.31 A            SFPRIV    R               REFFLD(SÅPRIV)
      *
5.31 A            SFOMVA         1A         TEXT('Økonomi MVA-kode')
5.31 A                                      COLHDG('OKON' 'MVA')
5.31  *
     A            SFANTO        11S 3       TEXT('Antall fra ordre')
     A                                      COLHDG('Antall' 'ordre')
     A                                      EDTCDE(M)
     A            SFENHO         3A         TEXT('Enhet fra ordre')
     A                                      COLHDG('Enh' 'ordre')
     A            SFANTA        11S 3       TEXT('Antall')
     A                                      COLHDG('Antall')
     A                                      EDTCDE(M)
     A            SFENHE         3A         TEXT('Enhet')
     A                                      COLHDG('Enh')
5.33 A            SFAKM3        11S 3       TEXT('Akt.m3')
5.33 A                                      COLHDG('Akt.m3')
5.33 A                                      EDTCDE(M)
5.33 A            SFNOM3        11S 3       TEXT('Nom.m3')
5.33 A                                      COLHDG('Nom.m3')
5.33 A                                      EDTCDE(M)
     A            SFFAKR         1A         TEXT('Debet/Kredit')
     A                                      COLHDG('D/K')
     A            SFSUMO        11S 2       TEXT('Sum opprinnlig')
     A                                      COLHDG('Sum opprinnlig')
     A                                      EDTCDE(M)
     A            SFSUMB        11S 2       TEXT('Sum brutto')
     A                                      COLHDG('Sum brutto')
     A                                      EDTCDE(M)
     A            SFSUMK        11S 2       TEXT('Sum kost')
     A                                      COLHDG('Sum kost')
     A                                      EDTCDE(M)
     A            SFSUOK        11S 2       TEXT('Sum oppr kost')
     A                                      COLHDG('Sum oppr kost')
     A                                      EDTCDE(M)
     A            SFRAB1        11S 2       TEXT('Sum rabatt 1')
     A                                      COLHDG('Sum rabatt 1')
     A                                      EDTCDE(M)
     A            SFRAB2        11S 2       TEXT('Sum rabatt 2')
     A                                      COLHDG('Sum rabatt 2')
     A                                      EDTCDE(M)
5.31 A            SFBRK1        11S 2       TEXT('Sum bruksrettrab 1')
5.31 A                                      COLHDG('Sum bruksr.' 'rab 1')
5.31 A                                      EDTCDE(M)
5.31 A            SFBRK2        11S 2       TEXT('Sum bruksrettrab 2')
5.31 A                                      COLHDG('Sum bruksr.' 'rab 2')
5.31 A                                      EDTCDE(M)
     A            SFRABO        11S 2       TEXT('Sum ordrerabatt')
     A                                      COLHDG('Sum ordrerabatt')
     A                                      EDTCDE(M)
      *
5.50 A            SFKUBO        11S 2       TEXT('Bonus til kunde')
5.50 A                                      COLHDG('Kundebonus')
5.50 A                                      EDTCDE(M)
      *
7.fb A            SFFOSA        11S 2       TEXT('Fordelt red.salg')
7.fb A                                      COLHDG('Ford.red.salg')
7.fb A                                      EDTCDE(M)
      *
7.fb A            SFFOSI        11S 2       TEXT('F.red.salgImva')
7.fb A                                      COLHDG('F.red.salgImva')
7.fb A                                      EDTCDE(M)
      *
     A            SFSUMM        11S 2       TEXT('Sum mva')
     A                                      COLHDG('Sum mva')
     A                                      EDTCDE(M)
     A            SFKMVA         1S 0       TEXT('Mva-kode')
     A                                      COLHDG('Mva' 'kode')
     A                                      EDTCDE(Z)
      *
     A            SFKRES         1S 0       TEXT('Restkode')
     A                                      COLHDG('Rest' 'kode')
     A                                      EDTCDE(Z)
      *
5.21 A            SFFSYS         3A         TEXT('Eksternt system')
5.21 A                                      COLHDG('Eks.' 'sys.')
      *
5.21 A            SFNREF        15A         TEXT('Nettbutikk ref.')
5.21 A                                      COLHDG('Nettb.' 'ref.')
      *
BOF  A            SFPUKE         2S 0       TEXT('Prognose uke')
BOF  A                                      COLHDG('Uke')
BOF  A                                      EDTCDE(Z)
      *
5.34 A            SFGAVE        12A         TEXT('Gavekortnr')
5.34 A                                      COLHDG('Gavekortnr')
5.70  *
5.70 A            SFPRGR    R               REFFLD(SÅPRGR)
5.70  *
5.70 A            SFOPRG         1S 0       TEXT('Kode, Overst. prisgr')
5.70 A                                      COLHDG('Kode, Overst.prgr')
5.70 A                                      EDTCDE(Z)
      *
5.05 A            SFERAP         1S 0       TEXT('Ekstern rapp.')
5.05 A                                      COLHDG('Ekstern' 'rapp')
5.05 A                                      EDTCDE(Z)
6.12  *
6.12 A            SFKRAP         1S 0       TEXT('Kreditt rapp.')
6.12 A                                      COLHDG('Kreditt' 'rapp')
6.12 A                                      EDTCDE(Z)
      *
6.32 A            SFPROJ    R               REFFLD(SÅPROJ)
6.32 A            SFAKTI    R               REFFLD(SÅAKTI)
7.02 A            SFUPRO    R               REFFLD(SÅUPRO)
      *
6.34 A            SFSUNO        11S 2       TEXT('Sum opprinnlig netto')
6.34 A                                      COLHDG('Sum oppr. netto')
6.34 A                                      EDTCDE(M)
6.34 A            SFSUMN        11S 2       TEXT('Sum netto salgspris')
6.34 A                                      COLHDG('Sum netto' 'Salgspris')
6.34 A                                      EDTCDE(M)
6.34  *
6.34 A            SFSUMI        11S 2       TEXT('Sum Innkjøpspris')
6.34 A                                      COLHDG('Sum' 'Innkjøpspris')
6.34 A                                      EDTCDE(M)
6.34  *
6.34 A            SFSUOI        11S 2       TEXT('Sum Oppr.innkjøpspris')
6.34 A                                      COLHDG('Sum' 'Oppr.inpr')
6.34 A                                      EDTCDE(M)
6.34  *
6.34 A            SFPKON         3A         TEXT('Priskilde Oppr.salgspris')
6.34 A                                      COLHDG('Priskld' 'Oppr.Netto Sapr')
6.34  *
6.34 A            SFPKNS         3A         TEXT('Priskilde Netto salgspris')
6.34 A                                      COLHDG('Priskld' 'Nett.sapr')
6.34  *
6.34 A            SFPKKO         3A         TEXT('Priskilde Netto kostpris')
6.34 A                                      COLHDG('Priskld' 'Nett.kopr')
6.34  *
6.34 A            SFPKOK         3A         TEXT('Priskilde Oppr. kostppris')
6.34 A                                      COLHDG('Priskld' 'Oppr.kopr')
6.34  *
6.34 A            SFPKIN         3A         TEXT('Priskilde Innkjøpspris')
6.34 A                                      COLHDG('Priskld' 'Innk.pris')
6.34  *
6.34 A            SFPKOI         3A         TEXT('Priskilde Oppr.innk.pris')
6.34 A                                      COLHDG('Priskld' 'Oppr.inpr')
6.34  *
6.34 A            SFKILD         3A         TEXT('Kilde Salg')
6.34 A                                      COLHDG('Kilde' 'Salg')
6.34  *
6.34 A            SFCARD         2A         TEXT('BM Card')
6.34 A                                      COLHDG('BM Card')
6.34  *
6.34 A            SFFCAR         2A         TEXT('NBBL Card')
6.34 A                                      COLHDG('NBBL Card')
6.34 A            SFKOFA         1A         TEXT('Kontant /Faktura')
6.34 A                                      COLHDG('Kont./Fakt')
      *
     A            SFKODA          L         TEXT('Kasse opprettet dato')
     A                                      COLHDG('Kasse ' 'opprettet' 'dato')
      *
     A            SFKOTI          T         TEXT('Kasse opprettet tidspunkt')
     A                                      COLHDG('Kasse' 'oppr. tidspunkt')
6.34  *
6.34 A            SFSODA          L         TEXT('Kasse/Ordre Oppr dato')
6.34 A                                      COLHDG('Kas/Ord' 'opprettet' 'dato')
6.34 A                                      DFT('0001-01-01')
6.34  *
6.34 A            SFSOTI          T         TEXT('Kasse/Ordre oppr tidspunkt')
6.34 A                                      COLHDG('Kas/Ord' 'oppr. tidspunkt')
6.36 A            SFTDAT          L         TEXT('Tilb.Utg dato')
6.36 A                                      COLHDG('Tilb.utg' 'dato')
6.36 A            SFDDAT          L         TEXT('Oppfølgingsdato')
6.36 A                                      COLHDG('Oppf.' 'dato')
     A            SFKOUS        10A         TEXT('Kasse opprettet av')
     A                                      COLHDG('Kasse' 'opprettet av')
      *
5.23 A            SFDATE          L         TEXT('Opprettet dato')
5.23 A                                      COLHDG('Opprettet' 'dato')
5.23  *
     A            SFTIME          T         TEXT('Klokkeslett')
     A                                      COLHDG('Kl.')
      *
5.23 A            SFUSER        10A         TEXT('Bruker-ID')
5.23 A                                      COLHDG('Bruker-ID')
5.23  *
     A            SFWSID        10A         TEXT('WSid skjerm')
     A                                      COLHDG('WSID')
8.01 A            SFSATS         5S 2
8.01 A                                      EDTWRD(' 0 ,  ')
8.01 A                                      COLHDG('Gebyr %-sats')
8.01 A                                      TEXT('Gebyr %-sats')
8.01 A            SFRKOD         1A
8.01 A                                      COLHDG('Returkode')
8.01 A                                      TEXT('Returkode')
8.01 A            SFRTXT        30A         TEXT('Returtekst')
8.01 A                                      COLHDG('Returtekst')
8.01 A            SFORSA        60A         TEXT('Årsak')
8.01 A                                      COLHDG('Årsak')
8.01 A            SFBERE         1S 0       TEXT('Beregn 0/1')
8.01 A                                      COLHDG('Beregn 0/1')
8.01 A                                      EDTCDE(Z)
8.02 A            SFGJKP        11S 2       TEXT('Sum gj.sn kostpris')
8.02 A                                      COLHDG('Sum' 'gj.sn. kostpris')
8.02 A                                      EDTCDE(M)
6.34  * Brukes i Skyggetabell (SSTXPF)
6.34 A            SFTIMS          Z         TEXT('TIMESTAMP')
6.34 A                                      COLHDG('TIMESTAMP')
6.34 A                                      DFT('0001-01-01-00.00.00.000000')
6.34 A            SFTMSB          Z         TEXT('TIMESTAMP butikk ')
6.34 A                                      COLHDG('TIMESTAMP' 'butikk')
6.34 A                                      DFT('0001-01-01-00.00.00.000000')
6.34 A            SFOAKK         1S 0
6.34 A                                      EDTCDE(Z)
6.34 A                                      COLHDG('Kode, akkumulator')
6.34 A                                      TEXT('Kode, akkumulator')
6.34 A            SFITYP         2A
6.34 A                                      COLHDG('OrdreInfo' 'Type')
6.34 A                                      TEXT('Ordre Info Type')
      *
      * Akkumulerings-register (SLAKPF)     (SA)
      *
     A            SHFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            SHHHAA         4S 0       TEXT('År')
     A                                      COLHDG('År')
     A                                      EDTCDE(Z)
     A            SHKODE        12A         TEXT('KeyKode')
     A                                      COLHDG('KeyKode')
      *
     A            SHAVDE         4S 0       TEXT('Avd. salg')
     A                                      COLHDG('Avd.' 'salg')
     A                                      EDTCDE(Z)
      *
     A            SHLAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
      *
     A            SHOTYP         2A         TEXT('Ordretype')
     A                                      COLHDG('Ordretype')
      *
     A            SHLAND         3A         TEXT('Land')
     A                                      COLHDG('Land')
      *
E5.40A            SHDIST         4S 0       TEXT('Distrikt')
     A                                      COLHDG('Distr.')
     A                                      EDTCDE(Z)
      *
5.40 A            SHSELG         4S 0       TEXT('Selger')
     A                                      COLHDG('Selger')
     A                                      EDTCDE(Z)
      *
5.06 A            SHLKAT         4S 0       TEXT('Kundekategori')
     A                                      COLHDG('Kunde' 'kat.')
     A                                      EDTCDE(Z)
      *
     A            SHLDOR         6S 0       TEXT('Fakturakunde')
     A                                      COLHDG('Fakt.' 'kunde')
     A                                      EDTCDE(Z)
      *
     A            SHOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogrp')
     A                                      EDTCDE(Z)
      *
     A            SHHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgrp')
     A                                      EDTCDE(Z)
      *
     A            SHUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugrp')
     A                                      EDTCDE(Z)
      *
     A            SHVARE        15A         TEXT('Varenummer')
     A                                      COLHDG('Varenr')
     A            SHSA01        11  2       TEXT('Brutto salg per. 01')
     A                                      COLHDG('Salg per.01')
     A                                      EDTCDE(K)
     A            SHSA02        11  2       TEXT('Brutto salg per. 02')
     A                                      COLHDG('Salg per.02')
     A                                      EDTCDE(K)
     A            SHSA03        11  2       TEXT('Brutto salg per. 03')
     A                                      COLHDG('Salg per.03')
     A                                      EDTCDE(K)
     A            SHSA04        11  2       TEXT('Brutto salg per. 04')
     A                                      COLHDG('Salg per.04')
     A                                      EDTCDE(K)
     A            SHSA05        11  2       TEXT('Brutto salg per. 05')
     A                                      COLHDG('Salg per.05')
     A                                      EDTCDE(K)
     A            SHSA06        11  2       TEXT('Brutto salg per. 06')
     A                                      COLHDG('Salg per.06')
     A                                      EDTCDE(K)
     A            SHSA07        11  2       TEXT('Brutto salg per. 07')
     A                                      COLHDG('Salg per.07')
     A                                      EDTCDE(K)
     A            SHSA08        11  2       TEXT('Brutto salg per. 08')
     A                                      COLHDG('Salg per.08')
     A                                      EDTCDE(K)
     A            SHSA09        11  2       TEXT('Brutto salg per. 09')
     A                                      COLHDG('Salg per.09')
     A                                      EDTCDE(K)
     A            SHSA10        11  2       TEXT('Brutto salg per. 10')
     A                                      COLHDG('Salg per.10')
     A                                      EDTCDE(K)
     A            SHSA11        11  2       TEXT('Brutto salg per. 11')
     A                                      COLHDG('Salg per.11')
     A                                      EDTCDE(K)
     A            SHSA12        11  2       TEXT('Brutto salg per. 12')
     A                                      COLHDG('Salg per.12')
     A                                      EDTCDE(K)
     A            SHSA13        11  2       TEXT('Brutto salg per. 13')
     A                                      COLHDG('Salg per.13')
     A                                      EDTCDE(K)
     A*
     A            SHRA01        11  2       TEXT('Rabatter per. 01')
     A                                      COLHDG('Rab. per.01')
     A                                      EDTCDE(K)
     A            SHRA02        11  2       TEXT('Rabatter per. 02')
     A                                      COLHDG('Rab. per.02')
     A                                      EDTCDE(K)
     A            SHRA03        11  2       TEXT('Rabatter per. 03')
     A                                      COLHDG('Rab. per.03')
     A                                      EDTCDE(K)
     A            SHRA04        11  2       TEXT('Rabatter per. 04')
     A                                      COLHDG('Rab. per.04')
     A                                      EDTCDE(K)
     A            SHRA05        11  2       TEXT('Rabatter per. 05')
     A                                      COLHDG('Rab. per.05')
     A                                      EDTCDE(K)
     A            SHRA06        11  2       TEXT('Rabatter per. 06')
     A                                      COLHDG('Rab. per.06')
     A                                      EDTCDE(K)
     A            SHRA07        11  2       TEXT('Rabatter per. 07')
     A                                      COLHDG('Rab. per.07')
     A                                      EDTCDE(K)
     A            SHRA08        11  2       TEXT('Rabatter per. 08')
     A                                      COLHDG('Rab. per.08')
     A                                      EDTCDE(K)
     A            SHRA09        11  2       TEXT('Rabatter per. 09')
     A                                      COLHDG('Rab. per.09')
     A                                      EDTCDE(K)
     A            SHRA10        11  2       TEXT('Rabatter per. 10')
     A                                      COLHDG('Rab. per.10')
     A                                      EDTCDE(K)
     A            SHRA11        11  2       TEXT('Rabatter per. 11')
     A                                      COLHDG('Rab. per.11')
     A                                      EDTCDE(K)
     A            SHRA12        11  2       TEXT('Rabatter per. 12')
     A                                      COLHDG('Rab. per.01')
     A                                      EDTCDE(K)
     A            SHRA13        11  2       TEXT('Rabatter per. 13')
     A                                      COLHDG('Rab. per.12')
     A                                      EDTCDE(K)
     A*
     A            SHKO01        11  2       TEXT('Kostpris per. 01')
     A                                      COLHDG('Kost per.01')
     A                                      EDTCDE(K)
     A            SHKO02        11  2       TEXT('Kostpris per. 02')
     A                                      COLHDG('Kost per.02')
     A                                      EDTCDE(K)
     A            SHKO03        11  2       TEXT('Kostpris per. 03')
     A                                      COLHDG('Kost per.03')
     A                                      EDTCDE(K)
     A            SHKO04        11  2       TEXT('Kostpris per. 04')
     A                                      COLHDG('Kost per.04')
     A                                      EDTCDE(K)
     A            SHKO05        11  2       TEXT('Kostpris per. 05')
     A                                      COLHDG('Kost per.05')
     A                                      EDTCDE(K)
     A            SHKO06        11  2       TEXT('Kostpris per. 06')
     A                                      COLHDG('Kost per.06')
     A                                      EDTCDE(K)
     A            SHKO07        11  2       TEXT('Kostpris per. 07')
     A                                      COLHDG('Kost per.07')
     A                                      EDTCDE(K)
     A            SHKO08        11  2       TEXT('Kostpris per. 08')
     A                                      COLHDG('Kost per.08')
     A                                      EDTCDE(K)
     A            SHKO09        11  2       TEXT('Kostpris per. 09')
     A                                      COLHDG('Kost per.09')
     A                                      EDTCDE(K)
     A            SHKO10        11  2       TEXT('Kostpris per. 10')
     A                                      COLHDG('Kost per.10')
     A                                      EDTCDE(K)
     A            SHKO11        11  2       TEXT('Kostpris per. 11')
     A                                      COLHDG('Kost per.11')
     A                                      EDTCDE(K)
     A            SHKO12        11  2       TEXT('Kostpris per. 12')
     A                                      COLHDG('Kost per.12')
     A                                      EDTCDE(K)
     A            SHKO13        11  2       TEXT('Kostpris per. 13')
     A                                      COLHDG('Kost per.13')
     A                                      EDTCDE(K)
     A*
     A            SHAN01        11  2       TEXT('Antall per. 01')
     A                                      COLHDG('Ant. per.01')
     A                                      EDTCDE(K)
     A*
     A            SHAN02        11  2       TEXT('Antall per. 02')
     A                                      COLHDG('Ant. per.02')
     A                                      EDTCDE(K)
     A*
     A            SHAN03        11  2       TEXT('Antall per. 03')
     A                                      COLHDG('Ant. per.03')
     A                                      EDTCDE(K)
     A*
     A            SHAN04        11  2       TEXT('Antall per. 04')
     A                                      COLHDG('Ant. per.04')
     A                                      EDTCDE(K)
     A*
     A            SHAN05        11  2       TEXT('Antall per. 05')
     A                                      COLHDG('Ant. per.05')
     A                                      EDTCDE(K)
     A*
     A            SHAN06        11  2       TEXT('Antall per. 06')
     A                                      COLHDG('Ant. per.06')
     A                                      EDTCDE(K)
     A*
     A            SHAN07        11  2       TEXT('Antall per. 07')
     A                                      COLHDG('Ant. per.07')
     A                                      EDTCDE(K)
     A*
     A            SHAN08        11  2       TEXT('Antall per. 08')
     A                                      COLHDG('Ant. per.08')
     A                                      EDTCDE(K)
     A*
     A            SHAN09        11  2       TEXT('Antall per. 09')
     A                                      COLHDG('Ant. per.09')
     A                                      EDTCDE(K)
     A*
     A            SHAN10        11  2       TEXT('Antall per. 10')
     A                                      COLHDG('Ant. per.10')
     A                                      EDTCDE(K)
     A*
     A            SHAN11        11  2       TEXT('Antall per. 11')
     A                                      COLHDG('Ant. per.11')
     A                                      EDTCDE(K)
     A*
     A            SHAN12        11  2       TEXT('Antall per. 12')
     A                                      COLHDG('Ant. per.12')
     A                                      EDTCDE(K)
     A*
     A            SHAN13        11  2       TEXT('Antall per. 13')
     A                                      COLHDG('Ant. per.13')
     A                                      EDTCDE(K)
      *
      * Innkjøpstatistikk (SISTPF)          (SI)
      *
     A            SIFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A                                      EDTCDE(Z)
     A            SIPAAR         4S 0       TEXT('Periode-år')
     A                                      COLHDG('År')
     A                                      EDTCDE(Z)
     A            SIPMND         2S 0       TEXT('Periode-mnd')
     A                                      COLHDG('Mnd')
     A                                      EDTCDE(Z)
     A            SIVALN         6S 0       TEXT('Vareleverandør')
     A                                      COLHDG('Vare' 'lever')
     A                                      EDTCDE(Z)
     A            SIFALN         6S 0       TEXT('Fakturaleverandør')
     A                                      COLHDG('Fakt.' 'lever')
     A                                      EDTCDE(Z)
     A            SILADR         6S 0       TEXT('Leveringsadr.')
     A                                      COLHDG('Lev.' 'adr.')
     A                                      EDTCDE(Z)
5.06 A            SILKAT         4S 0       TEXT('Leverandørkategori')
     A                                      COLHDG('Lever' 'kat.')
     A                                      EDTCDE(Z)
     A            SIRKAT         3S 0       TEXT('Rabattkategori')
     A                                      COLHDG('Rab.' 'kat.')
     A                                      EDTCDE(Z)
     A            SISELG         4S 0       TEXT('Selger')
     A                                      COLHDG('Selger')
     A                                      EDTCDE(Z)
V5.40A            SILAND         2A         TEXT('Land')
     A                                      COLHDG('Land')
E5.40A            SIDIST         4S 0       TEXT('Distrikt')
     A                                      COLHDG('Distr.')
     A                                      EDTCDE(Z)
     A            SIFRIK         5A         TEXT('Frie koder lever')
     A                                      COLHDG('Frie' 'koder')
      *
     A            SILETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A                                      EDTCDE(Z)
      *
     A            SIVARE        15A         TEXT('Varenummer')
     A                                      COLHDG('Varenr')
     A            SITEK1        35A         TEXT('Varetekst 1')
     A                                      COLHDG('Varetekst 1')
     A            SIOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogrp')
     A                                      EDTCDE(Z)
     A            SIHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgrp')
     A                                      EDTCDE(Z)
     A            SIUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugrp')
     A                                      EDTCDE(Z)
     A            SIRGRP         5S 0       TEXT('Rabattgruppe')
     A                                      COLHDG('Rgrp')
     A                                      EDTCDE(Z)
     A            SIPKOD         1A         TEXT('Priskode')
     A                                      COLHDG('Pris' 'kode')
     A            SILDOR         6S 0       TEXT('Leverandørnr')
     A                                      COLHDG('Lev.')
     A                                      EDTCDE(Z)
6.35 A            SILVAR    R               REFFLD(SÅLVAR)
6.35 A                                      TEXT('Leverandørs varenr.')
     A                                      COLHDG('Lev. varenr.')
     A            SINOBB         8S 0       TEXT('Nobb-nummer')
     A                                      COLHDG('Nobbnr')
     A                                      EDTCDE(Z)
     A            SIAHGR         2S 0       TEXT('Alt.-hovedgruppe')
     A                                      COLHDG('Alt.' 'Hgrp')
     A            SIAUGR         3S 0       TEXT('Alt.-undergruppe')
     A                                      COLHDG('Alt.' 'Ugrp')
     A            SIMODN         8S 0       TEXT('Nobb modulnummer')
     A                                      COLHDG('Nobb' 'Modulnr')
     A                                      EDTCDE(Z)
     A            SIKAMP         5A         TEXT('Kampanje')
     A                                      COLHDG('Kamp.')
     A            SILAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A                                      EDTCDE(Z)
     A            SIPRAN         4A         TEXT('Produktansv.')
     A                                      COLHDG('Prod.' 'ansv.')
6.NU A            SIBINR         8S 0       TEXT('Bilagsnummer')
     A                                      COLHDG('Bil.nr.')
     A                                      EDTCDE(Z)
     A            SILINE         4S 0       TEXT('Bilag linjenummer')
     A                                      COLHDG('Bilag' 'ln')
     A                                      EDTCDE(Z)
     A            SIBIDA          L         TEXT('Bilagsdato')
     A                                      COLHDG('Bil.dato')
     A            SIOTYP         2A         TEXT('Ordretype')
     A                                      COLHDG('Ordretype')
6.NU A            SIORNR         8S 0       TEXT('Best.nummer')
     A                                      COLHDG('Best.nr')
     A                                      EDTCDE(Z)
5.22 A            SIORSU         6S 0       TEXT('Best.suffix')
5.22 A                                      COLHDG('Best.suf.')
5.22 A                                      EDTCDE(Z)
     A            SIORLI         4S 0       TEXT('Best. linje')
     A                                      COLHDG('Best' 'ln')
     A                                      EDTCDE(Z)
     A            SIORDA          L         TEXT('Ordredato')
     A                                      COLHDG('Ordredato')
6.NU A            SIORDR         8S 0       TEXT('Ordrenr.')
5.02 A                                      COLHDG('Ordre' 'nr.')
5.02 A                                      EDTCDE(Z)
5.02 A            SIOSUF         2S 0       TEXT('Ordre-suff')
5.02 A                                      COLHDG('Ordre' 'suff.')
5.02 A                                      EDTCDE(Z)
5.22 A            SIOLIN         4S 0       TEXT('Ordre-linje')
5.22 A                                      COLHDG('Ordre' 'linje.')
5.22 A                                      EDTCDE(Z)
     A            SIKAVD         4S 0       TEXT('Avd. kjøp')
     A                                      COLHDG('Avd.' 'kjøp')
     A                                      EDTCDE(Z)
     A            SIKKON         6S 0       TEXT('Konto kjøp')
     A                                      COLHDG('Konto' 'kjøp')
     A                                      EDTCDE(Z)
5.07 A            SIKSPS         4S 0       TEXT('Spes. kjøp')
     A                                      COLHDG('Spes.' 'kjøp')
     A                                      EDTCDE(Z)
     A            SIANTA        11S 3       TEXT('Antall')
     A                                      COLHDG('Antall')
     A                                      EDTCDE(M)
     A            SIVENH         3A         TEXT('Enhet fra Vare')
     A                                      COLHDG('Enhet' 'vare')
     A            SIOANT        11S 3       TEXT('Antall i best')
     A                                      COLHDG('Antall' 'best')
     A                                      EDTCDE(M)
     A            SIOENH         3A         TEXT('Enhet fra best.')
     A                                      COLHDG('Enhet' 'best.')
     A            SIFAKR         1A         TEXT('Debet/Kredit')
     A                                      COLHDG('D/K')
     A            SISUMO        11S 2       TEXT('Sum opprinnlig')
     A                                      COLHDG('Sum opprinnlig')
     A                                      EDTCDE(M)
     A            SISUMB        11S 2       TEXT('Sum brutto')
     A                                      COLHDG('Sum brutto')
     A                                      EDTCDE(M)
     A            SISUMK        11S 2       TEXT('Sum kost')
     A                                      COLHDG('Sum kost')
     A                                      EDTCDE(M)
     A            SIRAB1        11S 2       TEXT('Sum rabatt 1')
     A                                      COLHDG('Sum rabatt 1')
     A                                      EDTCDE(M)
     A            SIRAB2        11S 2       TEXT('Sum rabatt 2')
     A                                      COLHDG('Sum rabatt 2')
     A                                      EDTCDE(M)
     A            SIRABO        11S 2       TEXT('Sum ordrerabatt')
     A                                      COLHDG('Sum ordrerabatt')
     A                                      EDTCDE(M)
5.50 A            SILEBO        11S 2       TEXT('Bonus fra leverandør')
5.50 A                                      COLHDG('Lev.bonus')
5.50 A                                      EDTCDE(M)
      *
6.33 A            SISUMM        11S 2       TEXT('Sum mva')
6.33 A                                      COLHDG('Sum mva')
6.33 A                                      EDTCDE(M)
      *
     A            SIMVAK         1S 0       TEXT('Mva-kode')
     A                                      COLHDG('Mva' 'kode')
     A                                      EDTCDE(Z)
6.33 A            SIOMVA         1A         TEXT('Økonomi MVA-kode')
6.33 A                                      COLHDG('OKON' 'MVA')
6.33  *
     A            SIKRES         1S 0       TEXT('Restkode')
     A                                      COLHDG('Rest' 'kode')
     A                                      EDTCDE(Z)
     A            SIKBON         1S 0       TEXT('Bonuskode')
     A                                      COLHDG('Bonus' 'kode')
     A                                      EDTCDE(Z)
     A            SILDAT          L         TEXT('Leveringsdato')
     A                                      COLHDG('Leveringsdato')
6.30 A            SIVIDA          L         TEXT('Virkelig lev.dato')
6.30 A                                      DFT('0001-01-01')
6.30 A                                      COLHDG('Virk.lev.dato')
6.30 A            SIMODA          L         TEXT('Bekreftet lev.dato')
6.30 A                                      DFT('0001-01-01')
6.30 A                                      COLHDG('Bekr.lev.dato')
     A            SIPUKE         2S 0       TEXT('Prognose uke')
     A                                      COLHDG('Uke')
     A                                      EDTCDE(Z)
6.31 A            SIBITX      0025
6.31 A                                      COLHDG('Bilagstekst')
6.31 A                                      TEXT('Bilagstekst')
6.31 A            SIKIDI      0025A
6.31 A                                      COLHDG('Kid-Felt')
6.31 A                                      TEXT('Kid-Felt')
6.31 A            SIKREF      0006S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      COLHDG('Kreditt-ref.')
6.31 A                                      TEXT('Kreditt-ref.')
6.31 A            SIBETB      0002S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      COLHDG('Bet.betingelser')
6.31 A                                      TEXT('Bet.betingelser')
6.31 A            SILMAT      0002S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      COLHDG('Leveringsmåte')
6.31 A                                      TEXT('Leveringsmåte')
6.31 A            SILBET      0002S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      COLHDG('Leveringsbet.')
6.31 A                                      TEXT('Leveringsbet.')
6.31 A            SIVALK      0003A
6.31 A                                      COLHDG('Valuta')
6.31 A                                      TEXT('Valuta')
6.31 A            SISPED      0003S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      COLHDG('Speditør')
6.31 A                                      TEXT('Speditør')
6.31 A            SIKJOR      0002S 0
6.31 A                                      EDTCDE(Z)
6.31 A                                      COLHDG('Kjørerute')
6.31 A                                      TEXT('Kjørerute')
6.31 A            SIPROJ    R               REFFLD(SÅPROJ)
7.NX A            SIUPRO    R               REFFLD(SÅUPRO)
6.31 A            SIAKTI    R               REFFLD(SÅAKTI)
6.31 A            SIVREF      0030A
6.31 A                                      COLHDG('Vår ref.')
6.31 A                                      TEXT('Vår ref.')
6.31 A            SIDREF      0030A
6.31 A                                      COLHDG('Deres ref.')
6.31 A                                      TEXT('Deres ref.')
6.31 A            SILMTX      0020A
6.31 A                                      COLHDG('Lev. måte tekst')
6.31 A                                      TEXT('Lev. måte tekst')
6.31 A            SILBTX      0075A
6.31 A                                      COLHDG('Lev. bet. tekst')
6.31 A                                      TEXT('Lev. bet. tekst')
6.31 A            SINETT      0011S 3
6.31 A                                      EDTCDE(M)
6.31 A                                      COLHDG('Netto vekt')
6.31 A                                      TEXT('Netto vekt')
6.31 A            SIBRUT      0011S 3
6.31 A                                      EDTCDE(M)
6.31 A                                      COLHDG('Brutto vekt')
6.31 A                                      TEXT('Brutto vekt')
6.31 A            SIKOLI      0011S 3
6.31 A                                      EDTCDE(M)
6.31 A                                      COLHDG('Kolli')
6.31 A                                      TEXT('Kolli')
6.31 A            SIFLOW      0010A
6.31 A                                      COLHDG('Workflow')
6.31 A                                      TEXT('Workflow')
6.31 A            SISORN      0015A
6.31 A                                      COLHDG('Selgers ordrenr')
6.31 A                                      TEXT('Selgers ordrenr')
6.31 A            SISFAK      0015A
6.31 A                                      COLHDG('Selgers fakt.nr')
6.31 A                                      TEXT('Selgers fakt.nr')
6.31 A            SIVALB      0011S 2
6.31 A                                      COLHDG('Valutabeløp')
6.31 A                                      TEXT('Valutabeløp')
     A            SITIME          T         TEXT('Klokkeslett')
     A                                      COLHDG('Kl.')
     A            SIWSID        10A         TEXT('WSid skjerm')
     A                                      COLHDG('WSID')
6.10 A            SIODAT    R               REFFLD(SÅODAT)
6.10 A            SIOTIM    R               REFFLD(SÅOTIM)
6.10 A            SIOUSR    R               REFFLD(SÅOUSR)
      *
      * Budsjettnivå-register (SLNIPF)     (SM)
      *
     A            SMFIRM    R               REFFLD(SÅFIRM)
      *
     A            SMKODE        12A         TEXT('KeyKode')
     A                                      COLHDG('KeyKode')
      *
     A            SMKOMM        35A         TEXT('Kommentarer')
     A                                      COLHDG('Komentarer')
      *
     A            SMENDR         1A         TEXT('Slettekode')
     A                                      COLHDG('Slettekode')
      *
     A            SMAKKK         1A         TEXT('Akk.kode')
     A                                      COLHDG('Akk.kode')
      *
     A            SMAKOD        12A         TEXT('Auto KeyKode')
     A                                      COLHDG('Auto KeyKode')
      *
      * Budsjettnivå-register (SKNIPF)     (SN)
      *
     A            SNFIRM    R               REFFLD(SÅFIRM)
      *
     A            SNKODE        12A         TEXT('KeyKode')
     A                                      COLHDG('KeyKode')
      *
     A            SNKOMM        35A         TEXT('Kommentarer')
     A                                      COLHDG('Komentarer')
      *
     A            SNENDR         1A         TEXT('Slettekode')
     A                                      COLHDG('Slettekode')
      *
     A            SNAKKK         1A         TEXT('Akk.kode')
     A                                      COLHDG('Akk.kode')
      *
     A            SNAKOD        12A         TEXT('Auto KeyKode')
     A                                      COLHDG('Auto KeyKode')
      *
      * Parameter-register (SKPMPF)         (SP)
      *
     A            SPFIRM         3S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Firma')
     A            SPTYPE        10A
     A                                      COLHDG('Parametertype')
     A            SPKODE         2S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Parameterkode')
     A            SPVALG        15A
     A                                      COLHDG('Parametervalg')
     A            SPREST       330A
     A                                      COLHDG('Avhengig av kode')
     A            SPSYST         1A
     A                                      COLHDG('System')
      *
      * Parameter-register (SLPMPF)         (SP)
      *
     A            SRFIRM         3S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Firma')
     A            SRTYPE        10A
     A                                      COLHDG('Parametertype')
     A            SRKODE         2S 0
     A                                      EDTCDE(Z)
     A                                      COLHDG('Parameterkode')
     A            SRVALG        15A
     A                                      COLHDG('Parametervalg')
     A            SRREST       330A
     A                                      COLHDG('Avhengig av kode')
     A            SRSYST         1A
     A                                      COLHDG('System')
      *
      * PC-register (SKPCPF)                (SS)
      *
     A            SSFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A            SSTYPE        10A         TEXT('Type')
     A                                      COLHDG('Type')
     A            SSRECT         4S 0       TEXT('Recordtype')
     A                                      COLHDG('Recordtype')
     A            SSLINE         6S 0       TEXT('Linjenummer')
     A                                      COLHDG('Linjenummer')
     A            SSBEG1        15A         TEXT('Begrep 1')
     A                                      COLHDG('Begrep 1')
     A            SSBEG2        15A         TEXT('Begrep 2')
     A                                      COLHDG('Begrep 2')
     A            SSBEG3        15A         TEXT('Begrep 3')
     A                                      COLHDG('Begrep 3')
5.01 A            SSTXT1        35A         TEXT('Begrep 1')
     A                                      COLHDG('Begrep 1')
5.01 A            SSTXT2        35A         TEXT('Begrep 2')
     A                                      COLHDG('Begrep 2')
5.01 A            SSTXT3        35A         TEXT('Begrep 3')
     A                                      COLHDG('Begrep 3')
     A            SSANTA        11S 3       TEXT('Antall')
     A                                      COLHDG('Antall')
     A                                      EDTCDE(M)
     A            SSENHE         3A         TEXT('Enhet')
     A                                      COLHDG('Enh')
     A            SSBRUB        11S 2       TEXT('Sum brutto')
     A                                      COLHDG('Sum brutto')
     A                                      EDTCDE(M)
     A            SSRABB        11S 2       TEXT('Sum rabatt')
     A                                      COLHDG('Sum rabatt')
     A                                      EDTCDE(M)
     A            SSRABP        11S 2       TEXT('Sum rabatt %')
     A                                      COLHDG('Sum rabatt %')
     A                                      EDTCDE(M)
     A            SSNETB        11S 2       TEXT('Sum netto')
     A                                      COLHDG('Sum netto')
     A                                      EDTCDE(M)
     A            SSKSTB        11S 2       TEXT('Sum kost')
     A                                      COLHDG('Sum kost')
     A                                      EDTCDE(M)
     A            SSDEKB        11S 2       TEXT('Sum deking')
     A                                      COLHDG('Sum dekning')
     A                                      EDTCDE(M)
     A            SSDEKP        11S 2       TEXT('Sum deking %')
     A                                      COLHDG('Sum dekning %')
     A                                      EDTCDE(M)
      *
      * Arbeids-register (SKWWPF)           (SW)
      *
     A            SWSSTA         1A
     A                                      COLHDG('Status')
     A            SWSREC       447A
     A                                      COLHDG('Fast = BLANK')
     A            SWSRT1        15A
     A                                      COLHDG('Sorteringsfelt 1')
     A            SWSRT2        15A
     A                                      COLHDG('Sorteringsfelt 2')
     A            SWSRT3        15A
     A                                      COLHDG('Sorteringsfelt 3')
7.01  **
7.01  **  KONV. KODER SKATTUM
7.01  **
7.01 A            SKFILG      0003A
7.01 A                                      COLHDG('Filgruppe')
7.01 A                                      TEXT('Filgruppe')
7.01 A            SKFIRM      0003S 0
7.01 A                                      COLHDG('Firma')
7.01 A                                      TEXT('Firma')
7.01 A                                      EDTCDE(Z)
7.01 A            SKTYPE      0010A
7.01 A                                      COLHDG('Kode-Type')
7.01 A                                      TEXT('Kode-Type')
7.01 A*                       ----------    -------------------  -----
7.01 A*                       BETBET        Betalingsbetingelse  num
7.01 A*                       KUNDE         Kundenummer          num
7.01 A*                       LEVER         Leverandørnummer     num
7.01 A*                       BETMÅTE       Betalingsmåte
7.01 A*                       VARE          Varenummer           alf
7.01 A*                       PROSJEKT      Prosjektnummer       num
7.01 A*                       KONTO         Kontonummer          num
7.01 A*                       BILTXT        Bilagstekst          num
7.01 A*                       MVAKODE       Momskoder            alf
7.01 A*                       RABKAT        Rabattkattegori      num
7.01 A*                       AVD           Avdeling             num
7.01 A*                       DISTR         Distrikt             num
7.01 A*                       SELGER        Selger               num
7.01 A*                       LAGER         Lagernummer          num
7.01 A*                       KUNDEKAT      Kundekategori        num
7.01 A*                       LAND          Landkode             alf
7.01 A*                       FORDEL        Fordelingsnøkkel     num
7.01 A*                       LEVKAT        Leverandørkategori   num
7.01 A*                       VALUTA        Valutakoder          num
7.01 A*                       FORSEND       Forsendelsesmåte     num
7.01 A*                       LEVBET        Leveringsbetingelse  num
7.01 A*                       KONTOKL       Kontoklasse          num
7.01 A*                       KONTOGR       Kontogruppe          num
7.01 A*                       AKTIV         Aktivitet            num
7.01 A*                       REKLAM        Reklamasjonsårsak    alf
7.01 A*                       KJØRE         Kjørerute            num
7.01 A*                       PROD          Produktansvarlig     alf
7.01 A*                       ------        ------------------   ---
7.01 A*                       KONTOH        Kontohensvisninger   alf
7.01 A*                       FSTORDTXT     Faste Ordre Tekster  alf
7.01 A*                       OINFOKODE     Ordreinform.koder    alf
7.01 A*                       ENHET         Enheter i systemet   alf
7.01 A*                       OVGRP         Overgrupper          num
7.01 A*                       HOGRP         Hovedgrupper         num
7.01 A*                       UNGRP         Undergrupper         num
7.01 A*                       KUNDEPRO      Kundeprosjekt        num
7.01 A            SKFNUM      0009S 0
7.01 A                                      COLHDG('Fra Numerisk')
7.01 A                                      TEXT('Fra Numerisk')
7.01 A            SKTNUM      0009S 0
7.01 A                                      COLHDG('Til Numerisk')
7.01 A                                      TEXT('Til Numerisk')
7.01 A            SKFNU2      0009S 0
7.01 A                                      COLHDG('Fra Numerisk 2')
7.01 A                                      TEXT('Fra Numerisk 2')
7.01 A            SKTNU2      0009S 0
7.01 A                                      COLHDG('Til Numerisk 2')
7.01 A                                      TEXT('Til Numerisk 2')
7.01 A            SKFALF      0021A
7.01 A                                      COLHDG('Fra Alfa')
7.01 A                                      TEXT('Fra Alfa')
7.01 A            SKTALF      0021A
7.01 A                                      COLHDG('Til Alfa')
7.01 A                                      TEXT('Til Alfa')
7.01 A            SKNTIL      0009S 2
7.01 A                                      COLHDG('Tillegg num.')
7.01 A                                      TEXT('Tillegg num.')
7.01 A            SKATIL      0020A
7.01 A                                      COLHDG('Tillegg alf.')
7.01 A                                      TEXT('Tillegg alf.')
7.01 A            SKUSER      0010A
7.01 A                                      COLHDG('Endret av')
7.01 A                                      TEXT('Endret av')
7.01 A            SKEDAT          L
7.01 A                                      COLHDG('Endret dato')
7.01 A                                      TEXT('Endret dato')
7.01 A            SKSTAT         1A
7.01 A                                      COLHDG('Status')
7.01 A                                      TEXT('Status')
7.01 A*                                     Blank= Aktiv
7.01 A*                                     'P'  = Passiv
7.01 A*                                     Passiv skal ikke bukes i konv
7.01 A            SDTYPE      0010A
7.01 A                                      COLHDG('KodeType')
7.01 A                                      TEXT('KodeType')
7.01 A            SDTEXT      0030A
7.01 A                                      COLHDG('Tekst')
7.01 A                                      TEXT('Tekst')
7.01 A            SDALNU      0003A
7.01 A                                      COLHDG('Alfa/num.')
7.01 A                                      TEXT('Alfa/num')
7.01 A            SDUSER      0010A
7.01 A                                      COLHDG('Endret av')
7.01 A                                      TEXT('Endret av')
7.01 A            SDEDAT          L
7.01 A                                      COLHDG('Endret dato')
7.01 A                                      TEXT('Endret dato')
7.01 A            SDSTAT         1A
7.01 A                                      COLHDG('Status')
7.01 A                                      TEXT('Status')
7.01 A*                                     Blank= Aktiv
7.01 A*                                     'P'  = Passiv
7.01 A*                                     Passiv skal ikke bukes i konv
