      *
      * Inng_faktura-linje
      *
6.NU  * 220514 UTVIDELSE NUMMERSERIE
9.01  * 250518 LAGT TIL UNDERPROSJEKT
      *
     A                                      REF(*LIBL/LFRF)
     A          R SIDTPFR
     A            SLFIRM    R
     A            SLAARR    R
     A            SLBINR    R
     A            SLNUMM    R
     A            SLSUFF    R
     A            SLKTXT    R
     A            SLLINE    R
     A            SLEXTR    R
     A            SLKVIS    R
     A            SLOTYP    R
     A            SLLTYP    R
     A            SLVARE    R
     A            SLNOBB    R
6.10 A            SLEANN    R
     A            SLENH1    R
     A            SLLAGE    R
     A            SLAVDE    R
     A            SLKONT    R
     A            SLSPES    R
     A            SLPROJ    R
9.01 A            SLUPRO    R
     A            SLAKTI    R
     A            SLTEK1    R
     A            SLTEK2    R
     A            SLTEK3    R
     A            SLANTA    R
     A            SLIPNY    R
     A            SLKPNY    R
     A            SLRAB1    R
     A            SLRAB2    R
     A            SLKJOP    R
     A            SLRKR1    R
     A            SLRKR2    R
     A            SLRKRO    R
     A            SLKOST    R
     A            SLKMVA    R
6.32 A            SLOMVA    R
6.32 A            SLMPRO    R
     A            SLLVRE    R
     A            SLOGRP    R
     A            SLHGRP    R
     A            SLUGRP    R
     A            SLORNR    R
     A            SLORSU    R
     A            SLORLI    R
6.10 A            SLODAT    R
6.10 A            SLOTIM    R
6.10 A            SLOUSR    R
6.10 A            SLEDAT    R
6.10 A            SLETIM    R
6.10 A            SLEUSR    R
