      *
      * Inng_faktura-linje
      *
     A          R SIDTPFR                   PFILE(*LIBL/SIDTPF)
      *
     A          K SLFIRM
     A          K SLVARE
