      *
      *  INNG.Faktura-linje
      *
     A          R SIDTPFR                   PFILE(*LIBL/SIDTPF)
      *
     A          K SLFIRM
     A          K SLPROJ
     A          K SLVARE
