      *
      * Inng_faktura-hode                   Index=Lev.onr
      *
     A          R SIHEPFR                   PFILE(*LIBL/SIHEPF)
      *
     A          K SHFIRM
     A          K SHLONR
     A          K SHAARR                    DESCEND
