      *
      * Inng_faktura-hode
      *
     A          R SIHEPFR                   PFILE(*LIBL/SIHEPF)
      *
     A          K SHFIRM
     A          K SHAARR
     A          K SHNAVN
     A          K SHBINR
     A          K SHNUMM
     A          K SHSUFF
