      *
      * Inng_faktura-hode                   Index=Lev.faknr
      *
     A          R SIHEPFR                   PFILE(*LIBL/SIHEPF)
      *
     A          K SHFIRM
     A          K SHLFNR
     A          K SHAARR                    DESCEND
