      *
      * Innkjøps-statistikk
      *
     A          R SISTPFR                   PFILE(*LIBL/SISTPF)
      *
     A          K SIFIRM
     A          K SIVIDA
     A          K SIVARE
     A          K SILAGE
     A          K SIORNR
