      *
      * Innkjøps-statistikk
      *
     A          R SISTPFR                   PFILE(*LIBL/SISTPF)
      *
     A          K SIFIRM
     A          K SIPAAR
     A          K SIVALN
     A          K SITEK1
     A          K SIVARE
     A          K SILADR
     A          K SIBIDA
