      *
      * Innkjøps-statistikk
      *
6.30  * 260214 BOF Utvidet med virk. og bekr. leveringsdato
6.NU  * 220514 BOF UTVIDELSE NUMMERSERIE
6.33  * 170914 BSA Utvidet med div. ifbm mva håndtering
9.01  * 231017 SST Lagt på underprosjekt
      *
     A                                      REF(*LIBL/SFRF)
     A          R SISTPFR
     A            SIFIRM    R
     A            SIPAAR    R
     A            SIPMND    R
     A            SIVALN    R
     A            SIFALN    R
     A            SILADR    R
     A            SILKAT    R
     A            SIRKAT    R
     A            SISELG    R
     A            SILAND    R
     A            SIDIST    R
     A            SIFRIK    R
     A            SILETY    R
     A            SIVARE    R
     A            SITEK1    R
     A            SIOGRP    R
     A            SIHGRP    R
     A            SIUGRP    R
     A            SIRGRP    R
     A            SIPKOD    R
     A            SILDOR    R
     A            SILVAR    R
     A            SINOBB    R
     A            SIAHGR    R
     A            SIAUGR    R
     A            SIMODN    R
     A            SIKAMP    R
     A            SILAGE    R
     A            SIPRAN    R
     A            SIBINR    R
     A            SILINE    R
     A            SIBIDA    R
     A            SIOTYP    R
     A            SIORNR    R
     A            SIORSU    R
     A            SIORLI    R
     A            SIORDA    R
     A            SIORDR    R
     A            SIOSUF    R
     A            SIOLIN    R
     A            SIKAVD    R
     A            SIKKON    R
     A            SIKSPS    R
     A            SIANTA    R
     A            SIVENH    R
     A            SIOANT    R
     A            SIOENH    R
     A            SIFAKR    R
     A            SISUMO    R
     A            SISUMB    R
     A            SISUMK    R
     A            SIRAB1    R
     A            SIRAB2    R
     A            SIRABO    R
     A            SILEBO    R
6.33 A            SISUMM    R
     A            SIMVAK    R
6.33 A            SIOMVA    R
     A            SIKRES    R
     A            SIKBON    R
     A            SIPUKE    R
     A            SILDAT    R
6.30 A            SIVIDA    R
6.30 A            SIMODA    R
6.31 A            SIBITX    R
6.31 A            SIKIDI    R
6.31 A            SIKREF    R
6.31 A            SIBETB    R
6.31 A            SILMAT    R
6.31 A            SILBET    R
6.31 A            SIVALK    R
6.31 A            SISPED    R
6.31 A            SIKJOR    R
6.31 A            SIPROJ    R
9.01 A            SIUPRO    R
6.31 A            SIAKTI    R
6.31 A            SIVREF    R
6.31 A            SIDREF    R
6.31 A            SILMTX    R
6.31 A            SILBTX    R
6.31 A            SINETT    R
6.31 A            SIBRUT    R
6.31 A            SIKOLI    R
6.31 A            SIFLOW    R
6.31 A            SISORN    R
6.31 A            SISFAK    R
6.31 A            SIVALB    R
     A            SITIME    R
     A            SIWSID    R
6.10 A            SIODAT    R
6.10 A            SIOTIM    R
6.10 A            SIOUSR    R
