      *
      * Innkjøps-statistikk
      *
     A          R SISTPFR                   PFILE(*LIBL/SISTPF)
      *
     A          K SIFIRM
     A          K SIPAAR
     A          K SIBINR
     A          K SILINE
     A          K SIBIDA
