      *
      *  Kunde-akkumlerings-register
      *
     A                                       REF(*LIBL/SFRF)
     A          R SKAKPFR
     A            SAFIRM    R
     A            SAHHAA    R
     A            SAKODE    R
     A            SAAVDE    R
     A            SALAGE    R
     A            SAOTYP    R
     A            SALAND    R
     A            SADIST    R
     A            SASELG    R
     A            SAKKAT    R
     A            SAKUND    R
     A            SAOGRP    R
     A            SAHGRP    R
     A            SAUGRP    R
     A            SAVARE    R
     A            SASA01    R
     A            SASA02    R
     A            SASA03    R
     A            SASA04    R
     A            SASA05    R
     A            SASA06    R
     A            SASA07    R
     A            SASA08    R
     A            SASA09    R
     A            SASA10    R
     A            SASA11    R
     A            SASA12    R
     A            SASA13    R
     A            SARA01    R
     A            SARA02    R
     A            SARA03    R
     A            SARA04    R
     A            SARA05    R
     A            SARA06    R
     A            SARA07    R
     A            SARA08    R
     A            SARA09    R
     A            SARA10    R
     A            SARA11    R
     A            SARA12    R
     A            SARA13    R
     A            SAKO01    R
     A            SAKO02    R
     A            SAKO03    R
     A            SAKO04    R
     A            SAKO05    R
     A            SAKO06    R
     A            SAKO07    R
     A            SAKO08    R
     A            SAKO09    R
     A            SAKO10    R
     A            SAKO11    R
     A            SAKO12    R
     A            SAKO13    R
     A            SAAN01    R
     A            SAAN02    R
     A            SAAN03    R
     A            SAAN04    R
     A            SAAN05    R
     A            SAAN06    R
     A            SAAN07    R
     A            SAAN08    R
     A            SAAN09    R
     A            SAAN10    R
     A            SAAN11    R
     A            SAAN12    R
     A            SAAN13    R
