      *
      *  Kunde-akk.register         Index=PAAR/KKAT/SELG/DIST/KUND/KPRO
      *                                   /OGRP/HGRP/UGRP/RGRP/VARE
      *
     A          R SKAKPFR
     A                                      PFILE(*LIBL/SKAKPF)
      *
     A          K SAFIRM
     A          K SAHHAA
     A          K SAKODE
     A          K SAAVDE
     A          K SALAGE
     A          K SAOTYP
     A          K SALAND
     A          K SADIST
     A          K SASELG
     A          K SAKKAT
     A          K SAKUND
     A          K SAOGRP
     A          K SAHGRP
     A          K SAUGRP
     A          K SAVARE
