      *
      *  Kunde-budsjett-register
      *
     A                                       REF(*LIBL/SFRF)
     A          R SKBUPFR
     A            SBFIRM    R
     A            SBHHAA    R
     A            SBVERS    R
     A            SBKODE    R
     A            SBAABB    R
     A            SBAVDE    R
     A            SBLAGE    R
     A            SBOTYP    R
     A            SBLAND    R
     A            SBDIST    R
     A            SBSELG    R
     A            SBKKAT    R
     A            SBKUND    R
     A            SBOGRP    R
     A            SBHGRP    R
     A            SBUGRP    R
     A            SBVARE    R
     A            SBKOMM    R
     A            SBBU01    R
     A            SBBU02    R
     A            SBBU03    R
     A            SBBU04    R
     A            SBBU05    R
     A            SBBU06    R
     A            SBBU07    R
     A            SBBU08    R
     A            SBBU09    R
     A            SBBU10    R
     A            SBBU11    R
     A            SBBU12    R
     A            SBEDAT    R
     A            SBETIM    R
     A            SBEUSR    R
