      *
      *  Kunde-budsjett-register       Index=Read
      *
     A          R SKBUPFR
     A                                      PFILE(*LIBL/SKBUPF)
      *
     A          K SBFIRM
     A          K SBHHAA
     A          K SBVERS
     A          K SBKODE
     A          K SBAABB
     A          K SBAVDE
     A          K SBLAGE
     A          K SBOTYP
     A          K SBLAND
     A          K SBDIST
     A          K SBSELG
     A          K SBKKAT
     A          K SBKUND
     A          K SBOGRP
     A          K SBHGRP
     A          K SBUGRP
     A          K SBVARE
