      *
      *  Kunde-budsjett-register    Index=Read
      *
     A          R SKNIPFR
     A                                      PFILE(*LIBL/SKNIPF)
      *
     A          K SNFIRM
     A          K SNKODE
