      *
      *  Konverteringstabeller
      *
     A          R SKONPFR                   PFILE(*LIBL/SKONPF)
      *
     A          K SKFALF
     A          K SKTYPE
     A          K SKFILG
