      *
      *  Konverteringstabeller
      *
     A          R SKONPFR                   PFILE(*LIBL/SKONPF)
      *
     A          K SKFILG
     A          K SKFIRM
     A          K SKTYPE
     A          K SKFNUM
     A          K SKFNU2
     A          K SKFALF
