      *
      *  Kunde-statistikk-PC-register  Index=Read
      *
     A          R SKPCPFR
     A                                      PFILE(*LIBL/SKPCPF)
      *
     A          K SSFIRM
     A          K SSTYPE
     A          K SSBEG1
     A          K SSBEG2
     A          K SSBEG3
