      *
      *  Kunde-statistikk-PC-register
      *
     A                                       REF(*LIBL/SFRF)
     A          R SKPCPFR
     A            SSFIRM    R
     A            SSTYPE    R
     A            SSLINE    R
     A            SSBEG1    R
     A            SSBEG2    R
     A            SSBEG3    R
     A            SSTXT1    R
     A            SSTXT2    R
     A            SSTXT3    R
     A            SSANTA    R
     A            SSENHE    R
     A            SSBRUB    R
     A            SSRABB    R
     A            SSRABP    R
     A            SSNETB    R
     A            SSKSTB    R
     A            SSDEKB    R
     A            SSDEKP    R
