      *
      *  Kunde-statistikk-parameter    Index=Read
      *
     A          R SKPMPFR
     A                                      PFILE(*LIBL/SKPMPF)
      *
     A          K SPFIRM
     A          K SPTYPE
     A          K SPKODE
     A          K SPVALG
