      *
      *  Kunde-statistikk-parameter
      *
     A                                      REF(*LIBL/SFRF)
     A          R SKPMPFR
     A            SPFIRM    R
     A            SPTYPE    R
     A            SPKODE    R
     A            SPVALG    R
     A            SPREST    R
     A            SPSYST    R
