      *
      *  Kunde-statistikk-parameter
      *
     A                                      REF(*LIBL/SFRF)
     A          R SKPWPFR
     A            SPFIRM    R
     A            SPTYPE    R
     A            SPKODE    R
     A            SPVALG    R
     A            SPREST    R
     A            SPSYST    R
     A          K SPFIRM
     A          K SPTYPE
     A          K SPKODE
     A          K SPVALG
