      *
      *  Kunde-arbeidsregister         Index=Update
      *
     A          R SKWWPFR
     A                                      PFILE(*LIBL/SKWWPF)
      *
     A          K SFFIRM
     A          K SWSRT1
     A          K SWSRT2
     A          K SWSRT3
     A          K SFPAAR
     A          K SFPMND
