      *
      *  Kunde-arbeidsregister
      *
     A                                      REF(*LIBL/SFRF)
     A          R SKWWPFR
     A            SFFIRM    R
     A            SFPAAR    R
     A            SFPMND    R
     A            SFVKUN    R
     A            SFFKUN    R
     A            SFKPRO    R
     A            SFKKAT    R
     A            SFRKAT    R
     A            SFSELG    R
     A            SFKSEL    R
     A            SFLAND    R
     A            SFDIST    R
     A            SFLMAT    R
     A            SFFRIK    R
     A            SFLETY    R
     A            SFVARE    R
     A            SFTEK1    R
     A            SFTEK2    R
     A            SFOGRP    R
     A            SFHGRP    R
     A            SFUGRP    R
     A            SFRGRP    R
     A            SFKPRI    R
     A            SFVTYP    R
     A            SFLDOR    R
     A            SFLVAR    R
     A            SFEANN    R
     A            SFNOBB    R
     A            SFAHGR    R
     A            SFAUGR    R
     A            SFMODN    R
     A            SFKAMP    R
     A            SFLAGE    R
     A            SFPRAN    R
     A            SFBINR    R
     A            SFLINE    R
     A            SFBIDA    R
     A            SFOTYP    R
     A            SFORNR    R
     A            SFORSU    R
     A            SFORLI    R
     A            SFORDA    R
     A            SFBONG    R
     A            SFBENR    R
     A            SFBSUF    R
     A            SFBLIN    R
     A            SFKBNR    R
     A            SFKBLI    R
     A            SFKHEV    R
     A            SFSAVD    R
     A            SFSKON    R
     A            SFSSPS    R
     A            SFSERI    R
     A            SFALME    R
     A            SFBRTY    R
     A            SFPRIV    R
     A            SFOMVA    R
     A            SFANTO    R
     A            SFENHO    R
     A            SFANTA    R
     A            SFENHE    R
     A            SFAKM3    R
     A            SFNOM3    R
     A            SFFAKR    R
     A            SFSUMO    R
     A            SFSUMB    R
     A            SFSUMK    R
     A            SFSUOK    R
     A            SFRAB1    R
     A            SFRAB2    R
     A            SFBRK1    R
     A            SFBRK2    R
     A            SFRABO    R
     A            SFSUMM    R
     A            SFKMVA    R
     A            SFKRES    R
     A            SFFSYS    R
     A            SFNREF    R
     A            SFLVRE    R
     A            SFERAP    R
     A            SFPDAT    R
     A            SFLDAT    R
     A            SFGAVE    R
     A            SFPUKE    R
     A            SFKODA    R
     A            SFKOTI    R
     A            SFKOUS    R
     A            SFDATE    R
     A            SFTIME    R
     A            SFUSER    R
     A            SFWSID    R
      * Tillegg
     A            SWSRT1    R
     A            SWSRT2    R
     A            SWSRT3    R
      * Nøkkel
     A          K SFFIRM
     A          K SWSRT1
     A          K SWSRT2
     A          K SWSRT3
     A          K SFPAAR
     A          K SFPMND
