      *
      *  Leverandør-akk.register    Index=PAAR/LKAT/SELG/DIST/LDOR/KPRO
      *                                   /OGRP/HGRP/UGRP/RGRP/VARE
      *
     A          R SLAKPFR
     A                                      PFILE(*LIBL/SLAKPF)
      *
     A          K SHFIRM
     A          K SHHHAA
     A          K SHKODE
     A          K SHAVDE
     A          K SHLAGE
     A          K SHOTYP
     A          K SHLAND
     A          K SHDIST
5.40 A          K SHSELG
     A          K SHLKAT
     A          K SHLDOR
     A          K SHOGRP
     A          K SHHGRP
     A          K SHUGRP
     A          K SHVARE
