      *
      *  Leverandør-akkumlerings-register
      *
     A                                       REF(*LIBL/SFRF)
     A          R SLAKPFR
     A            SHFIRM    R
     A            SHHHAA    R
     A            SHKODE    R
     A            SHAVDE    R
     A            SHLAGE    R
     A            SHOTYP    R
     A            SHLAND    R
     A            SHDIST    R
5.40 A            SHSELG    R
     A            SHLKAT    R
     A            SHLDOR    R
     A            SHOGRP    R
     A            SHHGRP    R
     A            SHUGRP    R
     A            SHVARE    R
     A            SHSA01    R
     A            SHSA02    R
     A            SHSA03    R
     A            SHSA04    R
     A            SHSA05    R
     A            SHSA06    R
     A            SHSA07    R
     A            SHSA08    R
     A            SHSA09    R
     A            SHSA10    R
     A            SHSA11    R
     A            SHSA12    R
     A            SHSA13    R
     A            SHRA01    R
     A            SHRA02    R
     A            SHRA03    R
     A            SHRA04    R
     A            SHRA05    R
     A            SHRA06    R
     A            SHRA07    R
     A            SHRA08    R
     A            SHRA09    R
     A            SHRA10    R
     A            SHRA11    R
     A            SHRA12    R
     A            SHRA13    R
     A            SHKO01    R
     A            SHKO02    R
     A            SHKO03    R
     A            SHKO04    R
     A            SHKO05    R
     A            SHKO06    R
     A            SHKO07    R
     A            SHKO08    R
     A            SHKO09    R
     A            SHKO10    R
     A            SHKO11    R
     A            SHKO12    R
     A            SHKO13    R
     A            SHAN01    R
     A            SHAN02    R
     A            SHAN03    R
     A            SHAN04    R
     A            SHAN05    R
     A            SHAN06    R
     A            SHAN07    R
     A            SHAN08    R
     A            SHAN09    R
     A            SHAN10    R
     A            SHAN11    R
     A            SHAN12    R
     A            SHAN13    R
