      *
      *  Leverandør-budsjett-register  Index=Update
      *
     A          R SLBUPFR
     A                                      PFILE(*LIBL/SLBUPF)
      *
     A          K SCFIRM
     A          K SCHHAA
     A          K SCVERS
     A          K SCKODE
     A          K SCAABB
     A          K SCAVDE
     A          K SCLAGE
     A          K SCOTYP
     A          K SCLAND
     A          K SCDIST
5.40 A          K SCSELG
     A          K SCLKAT
     A          K SCLDOR
     A          K SCOGRP
     A          K SCHGRP
     A          K SCUGRP
     A          K SCVARE
