      *
      *  Leverandørr-budsjett-register Index=Update
      *
     A          R SLNIPFR
     A                                      PFILE(*LIBL/SLNIPF)
      *
     A          K SMFIRM
     A          K SMKODE
