      *
      *  Leverandør-budsjettnivå-register
      *
     A                                       REF(*LIBL/SFRF)
     A          R SLNIPFR
     A            SMFIRM    R
     A            SMKODE    R
     A            SMKOMM    R
     A            SMENDR    R
     A            SMAKKK    R
     A            SMAKOD    R
