      *
      *  Leverandør-budsjett-register  Index=Read
      *
     A          R SLNIPFR
     A                                      PFILE(*LIBL/SLNIPF)
      *
     A          K SMFIRM
     A          K SMKODE
