     A*  Endringslogg - alle register   (se ELF4PF)  også felter
     A*
     A          R SLOGPFR                   PFILE(SLOGPF)
     A* Nøkkel
     A          K ELFIRM
     A          K ELREGI
     A          K ELFORE
     A          K ELFORT
     A          K ELRDAT                    DESCEND
     A          K ELFELT
     A          K ELRTIM                    DESCEND
