      *
      *  Endringslogg - alle register   (se ELF4PF)  også felter
      *
     A          R SLOGPFR
     A            ELFIRM         3S 0
     A            ELREGI        10A
     A            ELFORE        10A
     A            ELFORT        10A
     A            ELFELT        10A
     A            ELUSER        10A
     A            ELDATO          L
     A            ELFRAV        30A
     A            ELTILV        30A
     A            ELRDAT          L
     A            ELRTIM          T
     A            ELRUSR        10A
