      *
      *  Leverandør-statistikk-parameter Index=Read
      *
     A          R SLPMPFR
     A                                      PFILE(*LIBL/SLPMPF)
      *
     A          K SRFIRM
     A          K SRTYPE
     A          K SRKODE
     A          K SRVALG
