      *
      *  LEVRe-statistikk-parameter
      *
     A                                      REF(*LIBL/SFRF)
     A          R SLPWPFR
     A            SRFIRM    R
     A            SRTYPE    R
     A            SRKODE    R
     A            SRVALG    R
     A            SRREST    R
     A            SRSYST    R
     A          K SRFIRM
     A          K SRTYPE
     A          K SRKODE
     A          K SRVALG
