      *
      *  Leverandør-arbeidsregister
      *
     A                                      REF(*LIBL/SFRF)
     A          R SLWWPFR
     A            SIFIRM    R
     A            SIPAAR    R
     A            SIPMND    R
     A            SIVALN    R
     A            SIFALN    R
     A            SILADR    R
     A            SILKAT    R
     A            SIRKAT    R
     A            SISELG    R
     A            SILAND    R
     A            SIDIST    R
     A            SIFRIK    R
     A            SILETY    R
     A            SIVARE    R
     A            SITEK1    R
     A            SIOGRP    R
     A            SIHGRP    R
     A            SIUGRP    R
     A            SIRGRP    R
     A            SIPKOD    R
     A            SILDOR    R
     A            SILVAR    R
     A            SINOBB    R
     A            SIAHGR    R
     A            SIAUGR    R
     A            SIMODN    R
     A            SIKAMP    R
     A            SILAGE    R
     A            SIPRAN    R
     A            SIBINR    R
     A            SILINE    R
     A            SIBIDA    R
     A            SIOTYP    R
     A            SIORNR    R
     A            SIORSU    R
     A            SIORLI    R
     A            SIORDA    R
     A            SIORDR    R
     A            SIOSUF    R
     A            SIOLIN    R
     A            SIKAVD    R
     A            SIKKON    R
     A            SIKSPS    R
     A            SIANTA    R
     A            SIVENH    R
     A            SIOANT    R
     A            SIOENH    R
     A            SIFAKR    R
     A            SISUMO    R
     A            SISUMB    R
     A            SISUMK    R
     A            SIRAB1    R
     A            SIRAB2    R
     A            SIRABO    R
     A            SIMVAK    R
     A            SIKRES    R
     A            SIKBON    R
     A            SITIME    R
     A            SIWSID    R
      * Tillegg
     A            SWSRT1    R
     A            SWSRT2    R
     A            SWSRT3    R
      * Nøkkel
     A          K SIFIRM
     A          K SWSRT1
     A          K SWSRT2
     A          K SWSRT3
     A          K SIPAAR
     A          K SIPMND
