      *
      *  Faktura-linje
      *
     A          R SODTPFR                   PFILE(*LIBL/SODTPF)
      *
     A          K SDFIRM
     A          K SDLAGE
     A          K SDVARE
     A          K SDEDAT
