      *
      *  Faktura-linje
      *
     A                                      UNIQUE
     A          R SODTPFR                   PFILE(*LIBL/SODTPF)
      *
     A          K SDFIRM
     A          K SDAARR
     A          K SDBINR
     A          K SDNUMM
     A          K SDSUFF
     A          K SDKTXT
     A          K SDLINE
