      *
      *  Faktura-linje
      *
     A          R SODTPFR                   PFILE(*LIBL/SODTPF)
      *
     A          K SDFIRM
     A          K SDVARE
