      *
      *  Faktura-linje
      *
     A          R SODTPFR                   PFILE(*LIBL/SODTPF)
      *
     A          K SDFIRM
     A          K SDAARR
     A          K SDBINR
     A          K SDLINE
     A          S SDKTXT                    COMP(EQ 01)
