      *
      * Flisekompaniet statistikkfil
      *
     A          R SOFKPFR
6.13 A            NO_RAD      1000A         TEXT('Flisekompaniet')
     A                                      COLHDG('Flisekompaniet')
