      *
      *  Faktura-hode
      *
     A          R SOHEPFR                   PFILE(*LIBL/SOHEPF)
      *
     A          K SOFIRM
     A          K SOAARR
     A          K SONUMM
     A          K SOBINR
     A          K SOSUFF
