      *
      *  Faktura-hode
      *
      *  201211 Utvidet med Pakkseddel dato   Bof
6.NU  *  220514 UTVIDELSE NUMMERSERIE
6.30  *  120914 LAGT TIL FELT FOR KONTAKTPERSON
7.fb  * 240117 Utvidet med felt Forskuddsbet.bof
      *
     A                                      REF(*LIBL/FFRF)
     A          R SOHEPFR
     A            SOFIRM    R
     A            SOAARR    R
     A            SOBINR    R
     A            SONUMM    R
     A            SOSUFF    R
     A            SOOTYP    R
     A            SOLETY    R
     A            SOLAGE    R
     A            SOKREF    R
     A            SOBDAT    R
     A            SOLDAT    R
     A            SOPDAT    R
6.2R A            SOPADA    R
     A            SOFKDA    R
     A            SOFFDA    R
     A            SOBETB    R
     A            SOSELG    R
     A            SODIST    R
     A            SOLMAT    R
     A            SOLBET    R
     A            SOVALK    R
     A            SORKAT    R
     A            SOSPED    R
     A            SOKJOR    R
     A            SOMKOD    R
     A            SOLKUN    R
     A            SOKUND    R
     A            SOKUNA    R
     A            SONAVN    R
     A            SOADR1    R
     A            SOADR2    R
     A            SOSTED    R
     A            SOAVDE    R
     A            SOKONT    R
     A            SOSPES    R
     A            SOPROJ    R
6.27 A            SOUPRO    R
     A            SOAKTI    R
     A            SOVREF    R
     A            SODREF    R
6.30 A            SOKPNR    R
     A            SOREKV    R
     A            SOLMTX    R
     A            SOLBTX    R
     A            SORABP    R
     A            SOPASL    R
     A            SOPASK    R
     A            SOKOLI    R
     A            SOSALP    R
3.34 A            SOSALH    R
     A            SOSALF    R
     A            SORK1P    R
3.34 A            SORK1H    R
     A            SORK1F    R
     A            SORK2P    R
3.34 A            SORK2H    R
     A            SORK2F    R
6.13 A            SOPSKP    R
6.13 A            SOPSKH    R
6.13 A            SOPSKF    R
     A            SORB1P    R
     A            SORB1H    R
     A            SORB1F    R
     A            SORB2P    R
     A            SORB2H    R
     A            SORB2F    R
     A            SOGR1P    R
     A            SOGR1H    R
     A            SOGR1F    R
     A            SOGR2P    R
     A            SOGR2H    R
     A            SOGR2F    R
     A            SORBGP    R
3.34 A            SORBGH    R
     A            SORBGF    R
     A            SORKOP    R
3.34 A            SORKOH    R
     A            SORKOF    R
     A            SOKSTP    R
3.34 A            SOKSTH    R
     A            SOKSTF    R
     A            SOMVGF    R
     A            SOMVGP    R
     A            SOMVGH    R
     A            SOFSUM    R
     A            SOKPRO    R
     A            SOBKUN    R
     A            SOKKUN    R
     A            SONETO    R
     A            SOUTSK    R
     A            SOUSKR    R
     A            SOJOUR    R
     A            SOSHOP    R
     A            SOEDIH    R
     A            SONREF    R
     A            SOFSYS    R
     A            SOKIDD    R
     A            SOKIDR    R
     A            SOBENR    R
     A            SOBSUF    R
     A            SOMOBI    R
     A            SOKBNR    R
6.10 A            SOINF1    R
6.10 A            SOINF2    R
     A            SODEPO    R
     A            SODEPB    R
     A            SODEPT    R
7.fb A            SOFOSA    R
7.fb A            SOFOSI    R
     A            SOFATY    R
     A            SOBONG    R
6.2B A            SOPSUF    R
     A            SOWSID    R
     A            SOUSER    R
     A            SODATE    R
     A            SOTIME    R
6.10 A            SOOUSR    R
6.10 A            SOEDAT    R
6.10 A            SOETIM    R
6.10 A            SOEUSR    R
