      *
      *  Faktura-hode
      *
     A          R SOHEPFR                   PFILE(*LIBL/SOHEPF)
      *
     A          K SOFIRM
     A          K SOSELG
     A          K SOBDAT
