      *
      * Statistikkrapportering, transaksjonsnivå
      *
     A          R SOS1PFR                   PFILE(*LIBL/SOS1PF)
      *
     A          K AAFGRP
     A          K S1OTYP
