      *
      * Statistikkrapportering, kun ordretype = 'T'
      *
     A          R SOT1PFR
     A            AAFGRP         3A         TEXT('Filgruppe')
     A                                      COLHDG('Fil' 'grp')
     A            AAFNAV        30A         TEXT('Forhandler')
     A                                      COLHDG('Forhandler')
     A            AAFFTN         9S 0       TEXT('Forhandler org.nr')
     A                                      COLHDG('Forhandler' 'org.nr')
     A            S1PAAR         4S 0       TEXT('Periode år')
     A                                      COLHDG('Periode' 'år')
     A            S1PMND         2S 0       TEXT('Periode mnd')
     A                                      COLHDG('Periode' 'mnd')
     A            S1SAVD         4S 0       TEXT('Avd. salg')
     A                                      COLHDG('Avd.' 'salg')
     A            RAGTXT        30A         TEXT('Avdeling')
     A                                      COLHDG('Avdeling')
      *
     A            S1VKUN         6S 0       TEXT('Kundenr')
     A                                      COLHDG('Kundenr')
     A            RKNAVN        30A         TEXT('Kunde')
     A                                      COLHDG('Kunde')
     A            S1KPRO         6S 0       TEXT('Kundeprosjektnr')
     A                                      COLHDG('Kunde' 'prosjektnr')
     A            FLNAVN        30A         TEXT('Kundeprosjekt')
     A                                      COLHDG('Kundeprosjekt')
     A            RKFTNR         9S 0       TEXT('Kunde org.nr')
     A                                      COLHDG('Kunde' 'org.nr')
     A            S1KKAT         4S 0       TEXT('Kundekategori')
     A                                      COLHDG('Kundekat.')
     A            RAKTXT        20A         TEXT('Kundekategori beskrivelse')
     A                                      COLHDG('Kundekat.' ' beskrivelse')
     A            S1RKAT         3S 0       TEXT('Rabattkagegori')
     A                                      COLHDG('Rab.kat.')
     A            RAFTXT        20A         TEXT('Rabattkategori beskrivelse')
     A                                      COLHDG('Rab.kat.' ' beskrivelse')
     A            RKSLGR         4S 0       TEXT('Kundeansvarlig selgernr')
     A                                      COLHDG('Kundeansv.' 'selgernr')
     A            S1KANS        20A         TEXT('Kundeansvarlig navn')
     A                                      COLHDG('Kundeansvarlig navn')
      *
     A            S1SELG         4S 0       TEXT('Selger')
     A                                      COLHDG('Selger')
     A            RAITXT        20A         TEXT('Selgernavn')
     A                                      COLHDG('Selgernavn')
     A            S1BINR         8S 0       TEXT('Bilagsnummer')
     A                                      COLHDG('Bil.nr.')
     A            S1LINE         4S 0       TEXT('Bilag linjenummer')
     A                                      COLHDG('Bilag' 'ln')
     A            S1BIDA          L         TEXT('Bilagsdato')
     A                                      COLHDG('Bil.dato')
     A            S1OTYP         2A         TEXT('Ordretype')
     A                                      COLHDG('Ordretype')
     A            S1ORNR         8S 0       TEXT('Ordrenummer')
     A                                      COLHDG('Ordrenr')
     A            S1ORSU         2S 0       TEXT('Ordre suffix')
     A                                      COLHDG('Ordre' 'suff.')
     A            S1ORLI         4S 0       TEXT('Ordre linjenummer')
     A                                      COLHDG('Ordre' 'ln')
     A            S1ORDA          L         TEXT('Ordredato')
     A                                      COLHDG('Ordredato')
     A            S1BONG        12A         TEXT('Bongnr')
     A                                      COLHDG('Bongnr')
     A            S1BENR         8S 0       TEXT('Bestillings-nr')
     A                                      COLHDG('Best' 'nr.')
     A            S1BSUF         2S 0       TEXT('Bestillings-suff')
     A                                      COLHDG('Best' 'suff.')
     A            S1BLIN         4S 0       TEXT('Bestillings-linje')
     A                                      COLHDG('Best' 'linje')
      *
     A            S1VARE        15A         TEXT('Varenummer')
     A                                      COLHDG('Varenr')
     A            S1NOBB         8S 0       TEXT('NOBBnr')
     A                                      COLHDG('NOBBnr')
     A            S1TEK1        35A         TEXT('Varetekst 1')
     A                                      COLHDG('Varetekst 1')
     A            S1TEK2        35A         TEXT('Varetekst 2')
     A                                      COLHDG('Varetekst 2')
     A            S1OGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Ogr')
     A            S1OTXT        50A         TEXT('Overgruppe tekst')
     A                                      COLHDG('Overgruppe tekst')
     A            S1HGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hgr')
     A            S1HTXT        50A         TEXT('Hovedgruppe tekst')
     A                                      COLHDG('Hovedgruppe tekst')
     A            S1UGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Ugr')
     A            S1VGRP         7S 0       TEXT('Varegruppe')
     A                                      COLHDG('Vgr')
     A            S1UTXT        50A         TEXT('Varegruppe tekst')
     A                                      COLHDG('Varegruppe tekst')
     A            S1MODN         8S 0       TEXT('Modulnr/Linjerabattgruppe')
     A                                      COLHDG('Modulnr' 'Lnjerabattgrp')
     A            JUMTE1        35A         TEXT('Modultekst/Gruppetekst')
     A                                      COLHDG('Modulnr' 'Gruppetekst')
     A            S1VTYP         1A         TEXT('Varetype')
     A                                      COLHDG('Vare' 'type')
     A            S1KPRI         1A         TEXT('Priskode')
     A                                      COLHDG('PK')
     A            S1KAMP         5A         TEXT('Kampanjekode')
     A                                      COLHDG('Kamp.')
     A            S1LVRE         1S 0       TEXT('VA-registrert')
     A                                      COLHDG('VA')
     A            S1LDOR         6S 0       TEXT('Leverandørnr')
     A                                      COLHDG('Lev.nr')
     A            RLNAVN        30A         TEXT('Leverandør')
     A                                      COLHDG('Leverandør')
     A            RLNOBB         6S 0       TEXT('NOBB deltakernr')
     A                                      COLHDG('NOBB' ' deltakernr')
     A            S1LVAR        20A         TEXT('Lev.varenr')
     A                                      COLHDG('Lev.varenr')
      *
     A            S1ENHE         3A         TEXT('Stat. enhet')
     A                                      COLHDG('Stat.' 'enh')
     A            S1ANTA        11S 3       TEXT('Antall')
     A                                      COLHDG('Antall')
     A            S1PRGR         2A         TEXT('Prisgruppe')
     A                                      COLHDG('Pg')
     A            S1LETY         1S 0       TEXT('Leveringstype')
     A                                      COLHDG('Lev.' 'type')
     A            S1SUMB        11S 2       TEXT('Sum brutto')
     A                                      COLHDG('Sum brutto')
     A            S1RAB1        11S 2       TEXT('Sum rabatt 1')
     A                                      COLHDG('Sum rabatt 1')
     A            S1RAB2        11S 2       TEXT('Sum rabatt 2')
     A                                      COLHDG('Sum rabatt 2')
     A            S1RABO        11S 2       TEXT('Sum ordrerabatt')
     A                                      COLHDG('Sum ordrerabatt')
     A            S1SUMN        11S 2       TEXT('Sum netto')
     A                                      COLHDG('Sum netto')
     A            S1SUMK        11S 2       TEXT('Sum kost')
     A                                      COLHDG('Sum kost')
     A            S1DEKB        11S 2       TEXT('DB')
     A                                      COLHDG('DB')
     A            S1DEKG         5S 2       TEXT('DG')
     A                                      COLHDG('DG')
      *
     A            S1GKAM         5A         TEXT('Gjeldende kampanje')
     A                                      COLHDG('Gjeldende' 'kampanje')
     A            S1KFDA          L         TEXT('Kampanje fra-dato')
     A                                      COLHDG('Kamp.' 'fra-dato')
     A            S1KTDA          L         TEXT('Kampanje til-dato')
     A                                      COLHDG('Kamp.' 'til-dato')
     A            S1KSAP         9S 2       TEXT('Kampanjepris')
     A                                      COLHDG('Kampanjepris')
     A            S1KKOP         9S 2       TEXT('Kampanje kostpris')
     A                                      COLHDG('Kamp.' 'kostpris')
     A            S1KINP         9S 2       TEXT('Kampanje innkj.pris')
     A                                      COLHDG('Kamp.' 'innkj.pris')
     A            S1SAPR         9S 2       TEXT('Vare salgspris')
     A                                      COLHDG('Vare' 'salgspris')
     A            S1KOPR         9S 2       TEXT('Vare kostpris')
     A                                      COLHDG('Vare' 'kostpris')
     A            S1INPR         9S 2       TEXT('Vare innkj.pris')
     A                                      COLHDG('Vare' 'innkj.pris')
     A            S1PDAT          L         TEXT('Vare prisdato')
     A                                      COLHDG('Vare' 'prisdato')
