      *
      * Statistikkrapportering, ORDRETYPR = 'T'
      *
     A          R SOT1PFR                   PFILE(*LIBL/SOT1PF)
      *
     A          K AAFGRP
     A          K S1PAAR
     A          K S1PMND
     A          K S1SAVD
     A          K S1BINR
     A          K S1LINE
     A          K S1BIDA
     A          K S1ORNR
     A          K S1ORSU
     A          K S1ORLI
     A          K S1ORDA
     A          K S1BONG
