      *
      *  Fil for prisreferanse
      *
      * 220219 Ny tabell for BM
      *
     A          R SREPPFR
     A            SRFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A            SRKUND         6S 0       TEXT('Kunde')
     A                                      COLHDG('Kunde')
     A            SRKDAT          L         TEXT('Siste kjøredato')
     A            SRKTID          T         TEXT('Siste tidspunkt')
      *
     A            SREDAT          L         TEXT('Endret dato')
     A            SRETIM          T         TEXT('Endret tidspunkt')
     A            SREUSR        10A         TEXT('Endret av')
     A            SRODAT          L         TEXT('Opprettet dato')
     A            SROTIM          T         TEXT('Opprettet tidspunkt')
     A            SROUSR        10A         TEXT('Opprettet av')
