      *
      * Kunde-statistikk
      *
     A          R SSTAPFR                   PFILE(*LIBL/SSTAPF)
      *
     A          K SFFIRM
     A          K SFVARE
     A          K SFPAAR
     A          K SFBIDA
