      *
      * Kunde-statistikk
      *
     A          R SSTAPFR                   PFILE(*LIBL/SSTAPF)
      *
     A          K SFFIRM
     A          K SFPAAR
     A          K SFVKUN
     A          K SFKPRO
     A          K SFVARE
