      *
      * Kunde-statistikk
      *
     A          R SSTAPFR                   PFILE(*LIBL/SSTAPF)
      *
     A          K SFFIRM
     A          K SFFKUN
     A          K SFBIDA
     A          K SFVARE
