      *
      * Kunde-statistikk
      *
     A          R SSTXPFR                   PFILE(*LIBL/SSTXPF)
      *
     A          K SFFIRM
     A          K SFPAAR
     A          K SFWSID
     A          K SFBONG
     A          K SFLINE
