      *
      * Kunde-statistikk
      *
     A          R SSTXPFR                   PFILE(*LIBL/SSTXPF)
      *
     A          K SFFIRM
     A          K SFBIDA
