      *
      * Alternativ hovedgruppe
      *
     A                                      REF(*LIBL/FFRF)
     A          R VAHGPFR
     A            VFHFIR    R
     A            VFHHGR    R
     A            VFHTXT    R
6.10 A            VFHODA    R
6.10 A            VFHOTI    R
6.10 A            VFHOUS    R
     A            VFHEDA    R
     A            VFHETI    R
     A            VFHEUS    R
