      *
      * Alternativ undergruppe
      *
     A          R VAUGPFR                   PFILE(*LIBL/VAUGPF)
      *
     A          K VFUFIR
     A          K VFUTXT
