      *
      * Alternativ undergruppe
      *
     A                                      UNIQUE
     A          R VAUGPFR                   PFILE(*LIBL/VAUGPF)
      *
     A          K VFUFIR
     A          K VFUHGR
     A          K VFUUGR
