      *
     A*  Arbeidsregister - Generell definisjon
      *
     A          R VAW1PFR                   PFILE(*LIBL/VAW1PF)
      *
     A          K VWAKEY
