     A*  Arbeidsregister - Generell definisjon
     A*
     A                                      REF(*LIBL/FFRF)
     A          R VAWEPFR
     A*
     A            VWAFIR    R
     A            VWAANT    R
     A            VWATXT    R
     A            VWATVA    R
     A            VWAPRI    R
     A            VWAENH    R
     A            VWADAT    R
     A            VWALAG    R
     A            VWANOB    R
     A            VWAVAR    R
     A            VWAEAN    R
     A            VWALVA    R
     A            VWATK1    R
     A            VWATK2    R
     A            VWAEN1    R
     A            VWAPR1    R
     A            VWAEN2    R
     A            VWAPR2    R
     A            VWABSK    R
     A            VWABPU    R
     A            VWABME    R
     A            VWAHYL    R
     A            VWAVKO    R
     A            VWAPLS    R
     A            VWAETY    R
     A            VWAMIN    R
     A            VWAMAX    R
     A            VWAVTY    R
     A            VWAEIN    R
     A            VWAPSPE   R
     A            VWAPSP    R
      *
     A            VWAKEY    R
     A* Nøkkel
     A          K VWAKEY
