      *
      * Etikettinformasjon
      *
     A          R VAWEPFR                   PFILE(*LIBL/VAWEPF)
      *
     A          K VWAFIR
     A          K VWALAG
     A          K VWAVAR
