      *
      * Bonustype
      *
     A          R VBOTPFR                   PFILE(*LIBL/VBOTPF)
      *
     A          K VATFIR
     A          K VATBES
     A          K VATBOT
