      *
      * Bonustype
      *
     A                                      REF(*LIBL/FFRF)
     A          R VBOTPFR
     A            VATFIR    R
     A            VATBOT    R
     A            VATBES    R
     A            VATSUM    R
     A            VATRED    R
     A            VATBB1    R
     A            VATBB2    R
     A            VATODA    R
     A            VATEDA    R
     A            VATETI    R
     A            VATEUS    R
