      *
      * Bruksrett-knytning
      *
     A                                      REF(*LIBL/FFRF)
     A          R VBRKPFR
     A            VBFIRM    R
     A            VBALME    R
     A            VBOGRP    R
     A            VBHGRP    R
     A            VBUGRP    R
     A            VBMODN    R
     A            VBVARE    R
     A            VBBRTY    R
     A            VBODAT    R
     A            VBEDAT    R
     A            VBETIM    R
     A            VBEUSR    R
      *
