      *
      * Bruksrett-knytning
      *
     A          R VBRKPFR                   PFILE(*LIBL/VBRKPF)
      *
     A          K VBFIRM
     A          K VBVARE
