      *
      * Bruksrett-knytning
      *
     A          R VBRKPFR                   PFILE(*LIBL/VBRKPF)
      *
     A          K VBFIRM
     A          K VBALME
     A          K VBHGRP
     A          K VBOGRP
     A          K VBUGRP
     A          K VBMODN
     A          K VBVARE
