      *
      * Ean-nummer
      *
     A                                      UNIQUE
     A          R VEANPFR                   PFILE(*LIBL/VEANPF)
      *
     A          K VXFIRM
     A          K VXEANN
