      *
      * Ean-nummer
      *
     A          R VEANPFR                   PFILE(*LIBL/VEANPF)
      *
     A          K VXFIRM
     A          K VXVARE
     A          K VXTIME                    DESCEND
