      *
      * Ean-nummer
      *
     A                                      REF(*LIBL/FFRF)
     A          R VEANPFR
     A            VXFIRM    R
     A            VXEANN    R
     A            VXVARE    R
     A            VXENHE    R
     A            VXTIME    R
6.10 A            VXODAT    R
6.10 A            VXOTIM    R
6.10 A            VXOUSR    R
     A            VXEDAT    R
     A            VXETIM    R
     A            VXEUSR    R
