      *
      * Enhet
      *
     A                                      UNIQUE
     A          R VENHPFR                   PFILE(*LIBL/VENHPF)
      *
     A          K VAEFIR
     A          K VAEENH
