      *
      * Enhet
      *
     A                                      REF(*LIBL/FFRF)
     A          R VENHPFR
     A            VAEFIR    R
     A            VAEENH    R
     A            VAETXT    R
6.10 A            VAEODA    R
6.10 A            VAEOTI    R
6.10 A            VAEOUS    R
     A            VAEEDA    R
     A            VAEETI    R
     A            VAEEUS    R
