      *
      * Etikettinformasjon
      *
     A          R VETIPFR                   PFILE(*LIBL/VETIPF)
      *
     A          K VMFIRM
     A          K VMVARE
     A          K VMLAGE
