      *
      * Etikettinformasjon - logg elektroniske hylleetiketter
      *
     A                                      REF(*LIBL/FFRF)
     A          R VETLPFR
     A            VELFIR    R
     A            VELAGE    R
     A            VELVAR    R
     A            VELENH    R
     A            VELTYP    R
      *
     A            VELDAT    R
     A            VELTIM    R
     A            VELSAP    R
     A            VELGTI    R
     A            VELODA    R
     A            VELOTI    R
     A            VELOUS    R
     A            VELEDA    R
     A            VELETI    R
     A            VELEUS    R
