      *
      * Regneark
      *
     A          R VETXPFR
     A            VMXRAD      1024A         TEXT('Regneark')
     A                                      COLHDG('Regneark')
