      *
      *  Fast tekst etiketter
      *
     A                                      UNIQUE
     A          R VFASPFR                   PFILE(*LIBL/VFASPF)
     A* Nøkkel
     A          K VNFIRM
