      *
      * Hovedgruppe
      *
     A                                      UNIQUE
     A          R VHGRPFR                   PFILE(*LIBL/VHGRPF)
      *
     A          K VGHFIR
     A          K VGHOGR
     A          K VGHHGR
