      *
      * Historisk-Lagerbok
      *
     A                                      REF(*LIBL/FFRF)
     A          R VHISPFR
     A            VHFIRM    R
     A            VHVARE    R
     A            VHLAGE    R
     A            VHDATO    R
     A            VHTIME    R
     A            VHSEKV    R
     A            VHUSER    R
     A            VHSYST    R
     A            VHKODE    R
     A            VHTYPE    R
     A            VHREFR    R
     A            VHONUM    R
     A            VHOLIN    R
     A            VHBANR    R
     A            VHBEHL    R
     A            VHANTA    R
     A            VHENHL    R
     A            VHKPRI    R
6.10 A            VHODAT    R
6.10 A            VHOTIM    R
6.10 A            VHOUSR    R
6.10 A            VHEDAT    R
6.10 A            VHETIM    R
6.10 A            VHEUSR    R
