      *
      * Historisk-Lagerbok
      *
     A          R VHISPFR                   PFILE(*LIBL/VHISPF)
      *
     A          K VHFIRM
     A          K VHDATO
     A          K VHTIME
     A          K VHSEKV
     A          K VHLAGE
     A          K VHVARE
      *
