      *
      * Historisk-Lagerbok
      *
     A          R VHISPFR                   PFILE(*LIBL/VHISPF)
      *
     A          K VHFIRM
     A          K VHVARE
     A          K VHLAGE
     A          K VHDATO                    DESCEND
     A          K VHTIME                    DESCEND
     A          K VHSEKV                    DESCEND
      *
