      *
      * Ordre-informasjon
      *
     A          R VINFPFR                   PFILE(*LIBL/VINFPF)
      *
     A          K VAIFIR
     A          K VAITXT
     A          K VAITYP
