      *
      * Ordre-informasjon
      *
     A                                      UNIQUE
     A          R VINFPFR                   PFILE(*LIBL/VINFPF)
      *
     A          K VAIFIR
     A          K VAITYP
