      *
      * Kontohenvisning
      *
     A                                      REF(*LIBL/FFRF)
     A          R VKHVPFR
     A            VAKFIR    R
     A            VAKKOD    R
5.20 A            VAKLTY    R
     A            VAKOTY    R
     A            VAKTXT    R
     A            VAKAV1    R
     A            VAKKO1    R
     A            VAKSP1    R
     A            VAKAV2    R
     A            VAKKO2    R
     A            VAKSP2    R
     A            VAKAV3    R
     A            VAKKO3    R
     A            VAKSP3    R
     A            VAKAV4    R
     A            VAKKO4    R
     A            VAKSP4    R
     A            VAKAV5    R
     A            VAKKO5    R
     A            VAKSP5    R
     A            VAKAV6    R
     A            VAKKO6    R
     A            VAKSP6    R
     A            VAKAV7    R
     A            VAKKO7    R
     A            VAKSP7    R
6.10 A            VAKODA    R
6.10 A            VAKOTI    R
6.10 A            VAKOUS    R
6.10 A            VAKEDA    R
6.10 A            VAKETI    R
6.10 A            VAKEUS    R
