      *
      * Kundeklubb
      *
     A          R VKLUPFR                   PFILE(*LIBL/VKLUPF)
      *
     A          K VTKFIR
     A          K VTKOGR
     A          K VTKHGR
     A          K VTKUGR
     A          K VTKLDO
     A          K VTKVAR
     A          K VTKPRG
     A          K VTKLET
     A          K VTKFDA                    DESCEND
     A          K VTKFTI                    DESCEND
     A          K VTKTDA
     A          K VTKTTI
