      *
      * Kundeklubb
      *
     A          R VKLUPFR                   PFILE(*LIBL/VKLUPF)
      *
     A          K VTKFIR
     A          K VTKPRG
     A          K VTKVAR
     A          K VTKLET
     A          K VTKFDA                    DESCEND
     A          K VTKFTI                    DESCEND
     A          K VTKFDA                    DESCEND
     A          K VTKFTI                    DESCEND
