      *
      * Kundeklubb
      *
      *
     A                                      REF(*LIBL/FFRF)
     A          R VKLUPFR
     A            VTKFIR    R
     A            VTKOGR    R
     A            VTKHGR    R
     A            VTKUGR    R
     A            VTKLDO    R
     A            VTKVAR    R
     A            VTKPRG    R
     A            VTKLET    R
     A            VTKFDA    R
     A            VTKFTI    R
     A            VTKTDA    R
     A            VTKTTI    R
     A            VTKKAM    R
     A            VTKEN1    R
     A            VTKTI1    R
     A            VTKKO1    R
     A            VTKIN1    R
     A            VTKPR1    R
     A            VTKEN2    R
     A            VTKTI2    R
     A            VTKKO2    R
     A            VTKIN2    R
     A            VTKEN3    R
     A            VTKTI3    R
     A            VTKKO3    R
     A            VTKIN3    R
     A            VTKODA    R
     A            VTKOTI    R
     A            VTKOUS    R
     A            VTKEDA    R
     A            VTKETI    R
     A            VTKEUS    R
