      *
      * Kundeklubb
      *
     A          R VKLUPFR                   PFILE(*LIBL/VKLUPF)
      *
     A          K VTKFIR
     A          K VTKLDO
     A          K VTKLET
     A          K VTKFDA                    DESCEND
     A          K VTKFTI                    DESCEND
     A          K VTKTDA
     A          K VTKTTI
