      *
      *  Lager
      *
     A                                      UNIQUE
     A          R VLAGPFR                   PFILE(*LIBL/VLAGPF)
      *
     A          K VLFIRM
     A          K VLVARE
     A          K VLLAGE
