      *
      * Ordre-Logg-Koder
      *
     A                                      REF(*LIBL/FFRF)
     A          R VLKOPFR
     A            VAJFIR    R
     A            VAJTYP    R
     A            VAJTXT    R
     A            VAJSEL    R
     A            VAJKJO    R
6.10 A            VAJODA    R
6.10 A            VAJOTI    R
6.10 A            VAJOUS    R
     A            VAJEDA    R
     A            VAJETI    R
     A            VAJEUS    R
