      *
      * Ordre-Logg-Koder
      *
     A          R VLKOPFR                   PFILE(*LIBL/VLKOPF)
      *
     A          K VAJFIR
     A          K VAJTYP
