      *
      * UGYLDIGE ENHETER
      *
     A          R VLOGPFR
     A            VLFIRM         3S 0       TEXT('Firma')
     A            VLLDOR         6S 0       TEXT('Leverandør')
     A            VLVARE        15A         TEXT('Vare')
     A            VLENHE         3A         TEXT('Enhet')
     A            VLVTXT        35A         TEXT('Varetekst')
     A            VLLTXT        35A         TEXT('Leverandørnavn')
      *
