      *
      * Leveringstype
      *
     A                                      REF(*LIBL/FFRF)
     A          R VLTPPFR
     A            VYFIRM    R
     A            VYLETY    R
     A            VYBESK    R
6.10 A            VYODAT    R
6.10 A            VYOTIM    R
6.10 A            VYOUSR    R
     A            VYEDAT    R
     A            VYETIM    R
     A            VYEUSR    R
