      *
      * Leveringstype
      *
     A          R VLTPPFR                   PFILE(*LIBL/VLTPPF)
      *
     A          K VYFIRM
     A          K VYLETY
