      *
      *  Linjetype
      *
     A                                      REF(*LIBL/FFRF)
     A          R VLTYPFR
     A            VALFIR    R
     A            VALTYP    R
     A            VALTXT    R
     A            VALKTX    R
     A            VALPBB    R
     A            VALLAG    R
     A            VALOKO    R
     A            VALSTA    R
     A            VALKRE    R
     A            VALO01    R
     A            VALO02    R
     A            VALO03    R
     A            VALO04    R
6.10 A            VALODA    R
6.10 A            VALOTI    R
6.10 A            VALOUS    R
6.10 A            VALEDA    R
6.10 A            VALETI    R
6.10 A            VALEUS    R
