      *
      *  Linjetype
      *
     A          R VLTYPFR                   PFILE(*LIBL/VLTYPF)
      *
     A          K VALFIR
     A          K VALTYP
