      *
      * * Koblingstabell for mva
      *
     A                                      UNIQUE
     A          R VMVAPFR                   PFILE(*LIBL/VMVAPF)
      *
     A          K VAMFIR
     A          K VAMKOD
