      *
      * Overgruppe
      *
     A                                      REF(*LIBL/FFRF)
     A          R VOGRPFR
     A            VGOFIR    R
     A            VGOOGR    R
     A            VGOTXT    R
     A            VGOPRA    R
     A            VGOKHV    R
6.10 A            VGOODA    R
6.10 A            VGOOTI    R
6.10 A            VGOOUS    R
     A            VGOEDA    R
     A            VGOETI    R
     A            VGOEUS    R
