      *
      *  Ordretype
      *
     A          R VOTYPFR                   PFILE(*LIBL/VOTYPF)
      *
     A          K VAOFIR
     A          K VAOTYP
