      *
      *  Ordretype
      *
     A                                      REF(*LIBL/FFRF)
     A          R VOTYPFR
     A            VAOFIR    R
     A            VAOTYP    R
     A            VAOTXT    R
     A            VAOSYS    R
     A            VAOAKK    R
5.01 A            VAOBLD    R
5.03 A            VAOFDJ    R
     A            VAOOGR    R
     A            VAOBOO    R
     A            VAOSKA    R
     A            VAOSAM    R
     A            VAOLAG    R
     A            VAOOKO    R
     A            VAOSTA    R
     A            VAOPRO    R
     A            VAOBUT    R
     A            VAOKRE    R
     A            VAOBIL    R
5.32 A            VAONUM    R
5.40 A            VAOMOT    R
     A            VAONXT    R
     A            VAON01    R
     A            VAON02    R
     A            VAON03    R
     A            VAON04    R
     A            VAON05    R
     A            VAON06    R
     A            VAORUT    R
     A            VAORUB    R
6.10 A            VAOODA    R
6.10 A            VAOOTI    R
6.10 A            VAOOUS    R
6.10 A            VAOEDA    R
6.10 A            VAOETI    R
6.10 A            VAOEUS    R
