     A*  Parameter - Generell definisjon
     A*
     A                                      REF(*LIBL/FFRF)
     A          R VPARPFR
     A            VWPFIR    R
     A            VWPREC    R
     A* Nøkkel
     A          K VWPFIR
