      *
      * Påslag-linje
      *
     A          R VPDTPFR                   PFILE(*LIBL/VPDTPF)
      *
     A          K VJFIRM
     A          K VJPASL
     A          K VJVARE
     A          K VJLETY
9.01 A*         K VJPRGR
