      *
      * Påslag-linje
      *
     A          R VPDTPFR                   PFILE(*LIBL/VPDTPF)
      *
     A          K VJFIRM
     A          K VJPASL
     A          K VJUGRP
9.01 A*         K VJPRGR
     A          K VJLDOR
     A          K VJOGRP
     A          K VJHGRP
     A          K VJKPRI
     A          K VJVARE
     A          K VJLETY
