      *
      * Påslag-linje
      *
     A                                      REF(*LIBL/FFRF)
     A          R VPDTPFR
     A            VJFIRM    R
     A            VJPASL    R
9.01 A*           VJPRGR    R
     A            VJLDOR    R
     A            VJOGRP    R
     A            VJHGRP    R
     A            VJUGRP    R
     A            VJKPRI    R
     A            VJVARE    R
     A            VJLETY    R
     A            VJINPA    R
     A            VJINBE    R
     A            VJKOPA    R
     A            VJKOBE    R
     A            VJSAPA    R
     A            VJSABE    R
     A            VJSAPR    R
     A            VJDEKN    R
     A            VJODAT    R
6.10 A            VJOTIM    R
6.10 A            VJOUSR    R
     A            VJEDAT    R
     A            VJETIM    R
     A            VJEUSR    R
