      *
      * Prisgruppe oppslag
      *
     A          R VPGRPFR                   PFILE(*LIBL/VPGRPF)
      *
     A          K VPGFIR
     A          K VPGAVD
