      *
      * Prisgruppe oppslag
      *
8.01  *K00  121121 bof Nytt felt prisgruppe tilbud
      *
     A                                      REF(*LIBL/FFRF)
     A          R VPGRPFR
     A            VPGFIR    R
     A            VPGLAG    R
     A            VPGAVD    R
     A            VPGPRG    R
8.01 A            VPGPRT    R
     A            VPGEDA    R
     A            VPGETI    R
     A            VPGEUS    R
