      *
      * Påslag-hode
      *
     A          R VPHEPFR                   PFILE(*LIBL/VPHEPF)
      *
     A          K VIFIRM
     A          K VIPASL
