      *
      * Priskode
      *
     A                                      REF(*LIBL/FFRF)
     A          R VPKOPFR
     A            VAPFIR    R
     A            VAPKOD    R
     A            VAPTXT    R
6.10 A            VAPODA    R
6.10 A            VAPOTI    R
6.10 A            VAPOUS    R
     A            VAPEDA    R
     A            VAPETI    R
     A            VAPUSR    R
      *
