      *
      * Priskode
      *
     A                                      UNIQUE
     A          R VPKOPFR                   PFILE(*LIBL/VPKOPF)
      *
     A          K VAPFIR
     A          K VAPKOD
