      *
      * Vare-plakat
      *
     A                                      UNIQUE
     A          R VPLAPFR                   PFILE(*LIBL/VPLAPF)
      *
     A          K VRFIRM
     A          K VRVARE
