      *
      * Prioritert leverandør.
      *
     A          R VPRLPFR
      *
     A            PLFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A            PLLAGE         2S 0       TEXT('Lager')
     A                                      COLHDG('Lager')
     A            PLOGRP         2S 0       TEXT('Overgruppe')
     A                                      COLHDG('Overgruppe')
     A            PLHGRP         2S 0       TEXT('Hovedgruppe')
     A                                      COLHDG('Hovedgruppe')
     A            PLUGRP         3S 0       TEXT('Undergruppe')
     A                                      COLHDG('Undergruppe')
     A            PLMODN         8S 0       TEXT('Modulnummer')
     A                                      COLHDG('Modulnummer')
     A            PLVARE        15A         TEXT('Varenummer')
     A                                      COLHDG('Varenummer')
      *
     A            PLPR1L         6S 0       TEXT('Pri leverandør 1')
     A                                      COLHDG('Pri leverandør 1')
     A            PLPR2L         6S 0       TEXT('Pri leverandør 2')
     A                                      COLHDG('Pri leverandør 2')
     A            PLPR3L         6S 0       TEXT('Pri leverandør 3')
     A                                      COLHDG('Pri leverandør 3')
      *
     A            PLODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Opprettet dato')
     A            PLOTIM          T         TEXT('Opprettet tidspunkt')
     A                                      COLHDG('Opprettet tidspunkt')
     A            PLOUSR        10A         TEXT('Opprettet av')
     A                                      COLHDG('Opprettet av')
     A            PLEDAT          L         TEXT('Endret dato')
     A                                      COLHDG('Endret dato')
     A            PLETIM          T         TEXT('Endret tidspunkt')
     A                                      COLHDG('Endret tidspunkt')
     A            PLEUSR        10A         TEXT('Endret av')
     A                                      COLHDG('Endret av')
      *
