      *
      *  Prioritert leverandør                  Index=Read
      *
     A          R VPRLPFR
     A                                      PFILE(*LIBL/VPRLPF)
      *
     A          K PLFIRM
     A          K PLLAGE
     A          K PLOGRP
     A          K PLHGRP
     A          K PLUGRP
     A          K PLMODN
     A          K PLVARE
