      *
      * Varesortiment-linje
      *
     A          R VSDTPFR                   PFILE(*LIBL/VSDTPF)
      *
     A          K VDFIRM
     A          K VDVSOR
6.20 A          K VDLAGE
     A          K VDUGRP
     A          K VDLDOR
     A          K VDOGRP
     A          K VDHGRP
     A          K VDMODN
     A          K VDVARE
