      *
      * Varesortiment-hode
      *
     A          R VSHEPFR                   PFILE(*LIBL/VSHEPF)
      *
     A          K VCFIRM
     A          K VCTYPE
     A          K VCVSOR
     A          K VCLAGE
