      *
      * Søketekst
      *
     A                                      REF(*LIBL/FFRF)
     A          R VSOKPFR
     A            VSFIRM    R
     A            VSVARE    R
     A            VSSTEK    R
