      *
      * Søketekst
      *
     A          R VSOKPFR                   PFILE(*LIBL/VSOKPF)
      *
     A          K VSFIRM
     A          K VSVARE
     A          K VSSTEK
