      *
      * Språktekster
      *
     A          R VSPRPFR                   PFILE(*LIBL/VSPRPF)
      *
     A          K VVTFIR
     A          K VVTSPR
     A          K VVTVAR
