      *
      * SPRÅKTEKSTER
      *
     A                                      REF(*LIBL/FFRF)
     A          R VSPRPFR
     A            VVTFIR    R
     A            VVTVAR    R
     A            VVTSPR    R
     A            VVTTE1    R
     A            VVTTE2    R
     A            VVTODA    R
     A            VVTOTI    R
     A            VVTOUS    R
     A            VVTEDA    R
     A            VVTETI    R
     A            VVTEUS    R
