      *
      * Struktur-vare
      *
     A          R VSTRPFR                   PFILE(*LIBL/VSTRPF)
      *
     A          K VUFIRM
     A          K VUBESK
     A          K VUVARE
     A          K VUVARS
