      *
      * Struktur-vare
      *
     A                                      REF(*LIBL/FFRF)
     A          R VSTRPFR
     A            VUFIRM    R
     A            VUVARE    R
     A            VUVARS    R
     A            VUBESK    R
     A            VUANTA    R
6.15 A            VUENHE    R
6.15 A            VUKSTR    R
6.15 A            VUAVAR    R
     A            VUODAT    R
6.10 A            VUOTIM    R
6.10 A            VUOUSR    R
     A            VUEDAT    R
     A            VUETIM    R
     A            VUEUSR    R
