      *
      * Tilbud
      *
     A                                      REF(*LIBL/FFRF)
     A          R VTI2PFR
     A            VTFIRM    R
6.20 A            VTOGRP    R
6.20 A            VTHGRP    R
6.20 A            VTUGRP    R
6.20 A            VTLDOR    R
     A            VTVARE    R
     A            VTPRGR    R
     A            VTLETY    R
     A            VTFDAT    R
     A            VTFTIM    R
     A            VTTDAT    R
     A            VTTTIM    R
6.37 A            VTVIDF          L         TEXT('Innkjøpsdato fra-dato')
6.37 A                                      COLHDG('Innkjpsdato fra-dato')
6.37 A                                      DFT('0001-01-01')
6.37 A            VTVIDT          L         TEXT('Innkjøpsdato til-dato')
6.37 A                                      COLHDG('Innkjpsdato til-dato')
6.37 A                                      DFT('0001-01-01')
6.10 A            VTODAT    R
6.10 A            VTOTIM    R
6.10 A            VTOUSR    R
     A            VTEDAT    R
     A            VTETIM    R
     A            VTEUSR    R
