      *
      * Tilbud
      *
     A          R VTI2PFR                   PFILE(*LIBL/VTI2PF)
      *
     A          K VTFIRM
6.2E A          K VTOGRP
6.2E A          K VTHGRP
6.2E A          K VTUGRP
6.2E A          K VTLDOR
     A          K VTVARE
     A          K VTPRGR
     A          K VTLETY
     A          K VTFDAT                    DESCEND
     A          K VTFTIM                    DESCEND
     A          K VTTDAT
     A          K VTTTIM
