      *
      * Tilbud
      *
     A          R VTILPFR                   PFILE(*LIBL/VTILPF)
      *
     A          K VTFIRM
6.2E A          K VTLDOR
     A          K VTLETY
     A          K VTFDAT                    DESCEND
     A          K VTFTIM                    DESCEND
     A          K VTTDAT
     A          K VTTTIM
