      *
      * Tilbud
      *
     A          R VTILPFR                   PFILE(*LIBL/VTILPF)
      *
     A          K VTFIRM
     A          K VTPRGR
     A          K VTVARE
     A          K VTLETY
     A          K VTFDAT                    DESCEND
     A          K VTFTIM                    DESCEND
     A          K VTTDAT                    DESCEND
     A          K VTTTIM                    DESCEND
