      *
      * Tilbud
      *
     A                                      UNIQUE
     A          R VTILPFR                   PFILE(*LIBL/VTILPF)
      *
     A          K VTFIRM
6.2E A          K VTOGRP
6.2E A          K VTHGRP
6.2E A          K VTUGRP
6.2E A          K VTLDOR
     A          K VTVARE
     A          K VTPRGR
     A          K VTLETY
     A          K VTFDAT
     A          K VTFTIM
     A          K VTTDAT
     A          K VTTTIM
