      *
      * Undergruppe
      *
     A          R VUGRPFR                   PFILE(*LIBL/VUGRPF)
      *
     A          K VGUFIR
     A          K VGUHGR
     A          K VGUOGR
     A          K VGUUGR
