      *
      * UTSTILLINGSVARER
      *
     A          R VUTSPFR
     A            VUTFIR         3S 0       TEXT('Firma')
     A            VUTLAG         2S 0       TEXT('Lager')
     A            VUTVAR        15A         TEXT('Vare')
      *
     A            VUTLDO         6S 0       TEXT('Leverandør')
     A            VUTGTI        15A         TEXT('GTIN nummer')
     A            VUTENH         3A         TEXT('Enhet')
     A            VUTPLS        35A         TEXT('Plassering')
      *
     A            VUTODA          L
     A                                      TEXT('Opprettet dato')
     A                                      COLHDG('Opprettet dato')
     A                                      DFT('0001-01-01')
     A            VUTOTI          T
     A                                      TEXT('Opprettet tid')
     A                                      COLHDG('Opprettet tid')
     A                                      DFT('00.00.00')
     A            VUTOUS      0010A
     A                                      TEXT('Opprettet av')
     A                                      COLHDG('Opprettet av')
     A            VUTEDA          L
     A                                      TEXT('Endret dato')
     A                                      COLHDG('Endret dato')
     A                                      DFT('0001-01-01')
     A            VUTETI          T
     A                                      TEXT('Endret tid')
     A                                      COLHDG('Endret tid')
     A                                      DFT('00.00.00')
     A            VUTEUS      0010A
     A                                      TEXT('Endret av')
     A                                      COLHDG('Endret av')
      *
