      *
      * Utstillingsvarer
      *
     A          R VUTSPFR                   PFILE(*LIBL/VUTSPF)
      *
     A          K VUTFIR
     A          K VUTLAG
     A          K VUTVAR
