      *
      * Alternativ vare
      *
     A                                      UNIQUE
     A          R VVAAPFR                   PFILE(*LIBL/VVAAPF)
      *
     A          K VVAFIR
     A          K VVANOB
     A          K VVAAVA
