      *
      * Alternativ vare
      *
     A          R VVAAPFR                   PFILE(*LIBL/VVAAPF)
      *
     A          K VVAFIR
     A          K VVAAVA
     A          K VVANOB
