      *
      * Vare-register Query
      *
     A                                      REF(*LIBL/FFRF)
     A          R VVAQPFR
     A            VVFIRM    R
     A            VVVARE    R
     A            VVOGRP    R
     A            VGOTXT    R
     A            VVHGRP    R
     A            VGHTXT    R
     A            VVUGRP    R
     A            VGUTXT    R
     A            VVTEK1    R
     A            VVTEK2    R
     A            VVLDOR    R
     A            RLNAVN        30A         TEXT('Navn')
     A                                      COLHDG('Navn')
     A            VVLVAR    R
     A            VVNOBB    R
     A            VVNMOD    R
     A            VVNLEV    R
     A            VVKPRI    R
     A            VVVTYP    R
     A            VVKHEV    R
     A            VVENHE    R
     A            VVAHGR    R
     A            VFHTXT    R
     A            VVAUGR    R
     A            VFUTXT    R
     A            VVAVAR    R
     A            VVDESI    R
     A            VVKFRI    R
     A            VVFAKO    R
     A            VVKJUS    R
     A            VVKPDI    R
     A            VVKBON    R
     A            VVKORD    R
     A            VVKENH    R
     A            VVKMVA    R
     A            VVKRES    R
     A            VVKSTR    R
     A            VVKABC    R
     A            VVKPME    R
     A            VVKETI    R
     A            VVDEKN    R
     A            VVMINI    R
     A            VVMAKS    R
     A            VVPLAS    R
     A            VVLTID    R
     A            VVBPUN    R
     A            VVBMEN    R
     A            VVSIKL    R
     A            VVGODJ    R
     A            VVENHS    R
     A            VVENHL    R
     A            VVODAT    R
     A            VVEDAT    R
     A            VVETIM    R
     A            VVEUSR    R
      *
     A            VXEANN    R
      *
     A            VEENHE    R
     A            VESAEN    R
     A            VEINEN    R
     A            VEPBEN    R
     A            VEOMRE    R
     A            VELENG    R
     A            VEBRED    R
     A            VEHOYD    R
     A            VEVEKT    R
     A            VEVOLU    R
     A            VEODAT    R
     A            VEEDAT    R
     A            VEETIM    R
     A            VEEUSR    R
      *
     A            VPPRGR    R
     A            VPLETY    R
     A            VPPDAT    R
     A            VPSAPR    R
     A            VPSAIM         9S 2       TEXT('Salgspris inkl.mva')
     A                                      COLHDG('Salgspris' 'inkl.mva')
     A                                      EDTCDE(4)
     A            VPKOPR    R
     A            VPINPR    R
     A            VPBUPR    R
     A            VPDEKN         5S 2       TEXT('DG')
     A                                      COLHDG('DG')
     A                                      EDTCDE(M)
     A            VPEDAT    R
     A            VPETIM    R
     A            VPEUSR    R
      *
     A            VTFDAT    R
     A            VTFTIM    R
     A            VTTDAT    R
     A            VTTTIM    R
     A            VTKAMP    R
     A            VTTIPR         9S 2       TEXT('Tilbudspris')
     A                                      COLHDG('Tilb.pris')
     A                                      EDTCDE(4)
     A            VTTIIM         9S 2       TEXT('Tilbudspris inkl.mva')
     A                                      COLHDG('Tilb.pris' 'inkl.mva')
     A                                      EDTCDE(4)
     A            VTKOPR         9S 2       TEXT('Kostpris i tilbudsperioden')
     A                                      COLHDG('Kostpris' 'tilb.per.')
     A                                      EDTCDE(4)
     A            VTEDAT    R
     A            VTETIM    R
     A            VTEUSR    R
