      *
      * Varer
      *
     A          R VVARPFR                   PFILE(*LIBL/VVARPF)
      *
     A          K VVFIRM
     A          K VVNMOD
     A          K VVTEK1
     A          K VVVARE
