      *
      * Varer                                                          nr
      *
     A          R VVARPFR                   PFILE(*LIBL/VVARPF)
      *
     A          K VVFIRM
     A          K VVLDOR
     A          K VVLVAR
