      *
      * Varer
      *
     A          R VVARPFR                   PFILE(*LIBL/VVARPF)
      *
     A          K VVFIRM
     A          K VVOGRP
     A          K VVHGRP
     A          K VVUGRP
     A          K VVTEK1
     A          K VVVARE
