      *
      * Varer
      *
     A                                      UNIQUE
     A          R VVARPFR                   PFILE(*LIBL/VVARPF)
      *
     A          K VVFIRM
     A          K VVVARE
