      *
      * Slettede varer
      *
     A          R VVASPFR                   PFILE(*LIBL/VVASPF)
      *
     A          K VVFIRM
     A          K VVVARE
