      *
      * Varer work
      *
     A                                      REF(*LIBL/FFRF)
     A          R VVAWPFR
     A            VVFIRM    R
     A            VVVARE    R
     A            VVOGRP    R
     A            VVHGRP    R
     A            VVUGRP    R
     A            VVTEK1    R
     A            VVTEK2    R
     A            VVLDOR    R
     A            VVLVAR    R
     A            VVNOBB    R
     A            VVNMOD    R
     A            VVNLEV    R
     A            VVKPRI    R
     A            VVVTYP    R
     A            VVKHEV    R
     A            VVPRAN    R
     A            VVENHE    R
     A            VVAHGR    R
     A            VVAUGR    R
     A            VVAVAR    R
     A            VVDESI    R
     A            VVHOYD         8S 2
     A            VVBRED         8S 2
     A            VVLENG         8S 2
     A            VVVOLU         9S 3
     A            VVNETT         9S 3
     A            VVBRUT         9S 3
     A            VVKFRI    R
     A            VVFAKO    R
     A            VVKJUS    R
     A            VVKPDI    R
     A            VVKBON    R
     A            VVKORD    R
     A            VVKENH    R
     A            VVKMVA    R
     A            VVKRES    R
     A            VVKSTR    R
     A            VVKABC    R
     A            VVKPME    R
     A            VVKETI    R
     A            VVDEKN    R
     A            VVOMRN    R
     A            VVMINI    R
     A            VVMAKS    R
     A            VVPLAS    R
     A            VVLTID    R
     A            VVBPUN    R
     A            VVBMEN    R
     A            VVANBR    R
     A            VVSIKL    R
     A            VVGODJ    R
     A            VVCRDO    R
     A            VVENHS    R
     A            VVENHL    R
     A            VVNUDA    R
     A            VVUDAT    R
     A            VVODAT    R
     A            VVEDAT    R
     A            VVETIM    R
     A            VVEUSR    R
      *
     A            VWAKEY        64A
      *
      * Nøkkel
      *
     A          K VWAKEY
