      *
      * Vare-erstatningsvare
      *
     A          R VVE2PFR                   PFILE(*LIBL/VVE2PF)
      *
     A          K V2EFIR    R
     A          K V2EGVR    R
      *
