      *
      * Vare-enhet
      *
     A          R VVENPFR                   PFILE(*LIBL/VVENPF)
      *
     A          K VEFIRM
     A          K VEVARE
     A          K VEINEN
     A          K VEENHE
