      *
      * Vare-enhet
      *
     A                                      REF(*LIBL/FFRF)
     A          R VVENPFR
     A            VEFIRM    R
     A            VEVARE    R
     A            VEENHE    R
     A            VESAEN    R
     A            VEINEN    R
     A            VEPBEN    R
     A            VEOMRE    R
     A            VELENG    R
     A            VEBRED    R
     A            VEHOYD    R
     A            VEVEKT    R
     A            VEVOLU    R
     A            VEODAT    R
6.10 A            VEOTIM    R
6.10 A            VEOUSR    R
     A            VEEDAT    R
     A            VEETIM    R
     A            VEEUSR    R
