      *
      * Vare-enhet-prisgiver
      *
     A          R VVEPPFR                   PFILE(*LIBL/VVEPPF)
      *
     A          K VEPFIR
     A          K VEPGTI
