      *
      * Vare-enhet-prisgiver
      *
     A                                      REF(*LIBL/FFRF)
     A          R VVEPPFR
     A            VEPFIR    R
     A            VEPVAR    R
     A            VEPENH    R
     A            VEPLDO    R
     A            VEPGTI    R
     A            VEPBES    R
     A            VEPKLA    R
     A            VEPODA    R
     A            VEPOTI    R
     A            VEPOUS    R
     A            VEPEDA    R
     A            VEPETI    R
     A            VEPEUS    R
