      *
      * Vare-erstatningsvare
      *
     A                                      UNIQUE
     A          R VVERPFR                   PFILE(*LIBL/VVERPF)
      *
     A          K VVEFIR    R
     A          K VVENVR    R
     A          K VVEGVR    R
