      *
      * Vare-erstatningsvare
      *
     A          R VVERPFR                   PFILE(*LIBL/VVERPF)
      *
     A          K VVEFIR    R
     A          K VVENVR    R
