      *
      * Vare-erstatningsvare
      *
     A                                      REF(*LIBL/FFRF)
     A          R VVERPFR
     A            VVEFIR    R
     A            VVEGVR    R
     A            VVEGTX    R
     A            VVENVR    R
6.30 A            VVFIDT    R
6.30 A            VVSIDT    R
6.30 A            VVOMRE    R
6.30 A            VVANTB    R
     A            VVEODA    R
6.10 A            VVEOTI    R
6.10 A            VVEOUS    R
     A            VVEEDA    R
     A            VVEETI    R
     A            VVEEUS    R
