      *
      * Varegruppeknytning
      *
     A          R VVGKPFR                   PFILE(*LIBL/VVGKPF)
      *
     A          K VKFIRM
     A          K VKHGRP
     A          K VKOGRP
     A          K VKUGRP
     A          K VKLDOR
