      *
      * Varegruppeknytning
      *
     A                                      REF(*LIBL/FFRF)
     A          R VVGKPFR
     A            VKFIRM    R
     A            VKOGRP    R
     A            VKHGRP    R
     A            VKUGRP    R
     A            VKLDOR    R
     A            VKAHGR    R
     A            VKAUGR    R
     A            VKODAT    R
6.10 A            VKOTIM    R
6.10 A            VKOUSR    R
     A            VKEDAT    R
     A            VKETIM    R
     A            VKEUSR    R
