      *
      * Vare - leverandør
      *
     A                                      UNIQUE
     A          R VVLEPFR                   PFILE(*LIBL/VVLEPF)
      *
     A          K VVLFIR
     A          K VVLVNR
     A          K VVLLDO
