      *
      * Vare-pris
      *
     A          R VVPRPFR                   PFILE(*LIBL/VVPRPF)
      *
     A          K VPFIRM
     A          K VPLDOR
     A          K VPVARE
