      *
      * Vare-pris
      *
     A                                      REF(*LIBL/FFRF)
     A          R VVPRPFR
     A            VPFIRM    R
     A            VPVARE    R
6.2E A            VPLDOR    R
     A            VPPRGR    R
     A            VPENHE    R
     A            VPLETY    R
     A            VPPDAT    R
     A            VPSAPR    R
     A            VPKOPR    R
     A            VPINPR    R
6.34 A            VPINP2    R
     A            VPBUPR    R
6.16 A            VPNOPR    R
6.2E A            VPNLEV    R
6.2E A            VPLVAR    R
6.10 A            VPODAT    R
6.10 A            VPOTIM    R
6.10 A            VPOUSR    R
     A            VPEDAT    R
     A            VPETIM    R
     A            VPEUSR    R
