      *
      * Vare-søketekst
      *
     A                                      REF(*LIBL/FFRF)
     A          R VVSOPFR
     A            VVSFIR    R
     A            VVSVAR    R
     A            VVSOGR    R
     A            VVSHGR    R
     A            VVSUGR    R
     A            VVSTEK    R
