      *
      * Vare-søketekst
      *
     A          R VVSOPFR                   PFILE(*LIBL/VVSOPF)
      *
     A          K VVSFIR    R
     A          K VVSOGR    R
     A          K VVSTEK    R
     A          K VVSVAR    R
