      *
      * Vare-søketekst
      *
     A                                      UNIQUE
     A          R VVSOPFR                   PFILE(*LIBL/VVSOPF)
      *
     A          K VVSFIR    R
     A          K VVSVAR    R
