      *
      * Varetype
      *
     A          R VVTYPFR                   PFILE(*LIBL/VVTYPF)
      *
     A          K VAVFIR
     A          K VAVTXT
     A          K VAVTYP
