      *
      * Arbeidsregister abcxyz
      *
     A                                      REF(*LIBL/FFRF)
     A          R VWB1PFR
     A            VWBFIR    R
     A            VWBVAR    R
     A            VWBOGR    R
     A            VWBHGR    R
     A            VWBUGR    R
     A            VWBTK1    R
     A            VWBENH    R
     A            VWBANT    R
     A            VWBAOL    R
     A            VWBSMB    R
     A            VWBSMR    R
     A            VWBSMN    R
