      *
      * Arbeidsregister abcxyz
      *
     A          R VWB1PFR                   PFILE(VWB1PF)
      *
     A          K VWBFIR
     A          K VWBSMB                    DESCEND
