      *
      *  Faktura-hode (ARBEIDS-FIL)
      *
     A          R WOHEPFR                   PFILE(*LIBL/WOHEPF)
      *
     A          K FOFIRM
     A          K FOSELG
     A          K FOBDAT
