      *
      * DNBNOR KORT vareSpesifikasjon XML
      *
     A          R XMLGRLPFR
     A            XMLGRL       400A         TEXT('XML DNB Spec')
     A                                      COLHDG('XML DNB Spec')
