      *
      * DNBNOR KORT vareSpesifikasjon XML
      *
     A          R XMLLOGPFR
     A            XMLLOG       400A         TEXT('XML DNB Spec')
     A                                      COLHDG('XML DNB Spec')
