      *
      * EKSTERN BESTILLINGSTEKST
      *
     A          R XOTXPFR                   PFILE(*LIBL/XOTXPF)
      *
     A          K XTFIRM
     A          K XTFSYS
     A          K XTTELL
     A          K XTNREF
     A          K XTTYPE
     A          K XTLINE
