      *
      *  TEKSTLINJER NETTORDRE/BESTILLING
      *
     A          R XOTXPFR
     A            XTFIRM         3S 0       TEXT('FIRMAKODE')
     A            XTFSYS         3A         TEXT('EKETERNT SYSTEM')
     A            XTTELL         6S 0       TEXT('TELLER')
     A            XTNREF        15A         TEXT('EKSTERN REFNR.')
     A            XTTYPE         2A         TEXT('TEKSTTYPE')
     A            XTLINE         4S 0       TEXT('LINJENR')
     A            XTTEXT        78A         TEXT('TEKST')
     A            XTODAT          L         TEXT('OPPRETTET DATO')
     A            XTOTIM          T         TEXT('OPPRETTET TIDSPKT')
     A            XTOUSR        10A         TEXT('OPPRETTET AV')
     A            XTEDAT          L         TEXT('ENDRET DATO')
     A            XTETIM          T         TEXT('ENDRET TIDSPKT')
     A            XTEUSR        10A         TEXT('ENDRET AV')
