      *
      * Tilleggsfelter alle register
      *
     A          R XTILPFR                   PFILE(XTILPF)
      *
      * Nøkkel
      *
     A          K XTFIRM
     A          K XTREGI
     A          K XTFELT
     A          K XTXKEY
