      *
      * Konkurrent koder tilbudsoppfølging
      *
     A          R XTKKPFR                   PFILE(*LIBL/XTKKPF)
      *
     A          K XKFIRM
     A          K XKKKOD
