      *
      * Konkurrent koder tilbudsoppfølging
      *
     A          R XTKKPFR
     A            XKFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A            XKKKOD         2S 0       TEXT('Konkurrentkode')
     A                                      COLHDG('Konkurrentkode')
     A            XKTEKS        30A         TEXT('Konkurrent tekst')
     A                                      COLHDG('Konkurrent tekst')
     A            XKODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Opprettet dato')
     A            XKOTID          T         TEXT('Opprettet tid')
     A                                      COLHDG('Opprettet tid')
     A            XKOUSR        10A         TEXT('Opprettet bruker')
     A                                      COLHDG('Opprettet bruker')
     A            XKEDAT          L         TEXT('Endret dato')
     A                                      COLHDG('Endret dato')
     A            XKETID          T         TEXT('Endret tid')
     A                                      COLHDG('Endret tid')
     A            XKEUSR        10A         TEXT('Endret bruker')
     A                                      COLHDG('Endret bruker')
