      *
      * Loggfil tilbudsoppfølging
      *
     A          R XTLOPFR                   PFILE(*LIBL/XTLOPF)
      *
     A          K XLFIRM
     A          K XLAARR
     A          K XLTILN
     A          K XLAKDA
     A          K XLAKTI
