      *
      * Loggfil tilbudsoppfølging
      *
     A          R XTLOPFR
     A            XLFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A            XLAARR         4S 0       TEXT('Årstall')
     A                                      COLHDG('Årstall')
     A            XLTILN         8S 0       TEXT('Tilbudsnummer')
     A                                      COLHDG('Tilbudsnummer')
     A            XLAKTP        15A         TEXT('Aktivitets type')
     A                                      COLHDG('Aktivitets type')
     A            XLAKDA          L         TEXT('Aktivitets dato')
     A                                      COLHDG('Aktivitets dato')
     A            XLAKTI          T         TEXT('Aktivitets tidspkt')
     A                                      COLHDG('Aktivitets tidspkt')
     A            XLAKUS        10A         TEXT('Aktivitets bruker')
     A                                      COLHDG('Aktivitets bruker')
     A            XLKUNR         6S 0       TEXT('Kundenummer')
     A                                      COLHDG('Kundenummer')
     A            XLKUNA        30A         TEXT('Kundenavn')
     A                                      COLHDG('Kundenavn')
     A            XLSENR         4S 0       TEXT('Selgernr')
     A                                      COLHDG('Selgernr')
     A            XLSENA        30A         TEXT('Selgernavn')
     A                                      COLHDG('Selgernavn')
     A            XLOPDA          L         TEXT('Oppfølgings dato')
     A                                      COLHDG('Oppfølgings dato')
     A            XLUTDA          L         TEXT('Utgår dato')
     A                                      COLHDG('Utgår dato')
     A            XLSLET         2S 0       TEXT('Slettekode')
     A                                      COLHDG('Slettekode')
     A            XLKONK         2S 0       TEXT('Konkurrentkode')
     A                                      COLHDG('Konkurrentkode')
     A            XLSGRU        60A         TEXT('Slettegrunn')
     A                                      COLHDG('Slettegrunn')
