      *
      * Slettekder tilbudsoppfølging
      *
     A          R XTSLPFR
     A            XSFIRM         3S 0       TEXT('Firma')
     A                                      COLHDG('Firma')
     A            XSSKOD         2S 0       TEXT('Slettekode')
     A                                      COLHDG('Slettekode')
     A            XSTEKS        30A         TEXT('Slette tekst')
     A                                      COLHDG('Slette tekst')
     A            XSKKKO         1A         TEXT('KravKonkKode')
     A                                      COLHDG('KravKonkKode')
     A            XSODAT          L         TEXT('Opprettet dato')
     A                                      COLHDG('Opprettet dato')
     A            XSOTID          T         TEXT('Opprettet tid')
     A                                      COLHDG('Opprettet tid')
     A            XSOUSR        10A         TEXT('Opprettet bruker')
     A                                      COLHDG('Opprettet bruker')
     A            XSEDAT          L         TEXT('Endret dato')
     A                                      COLHDG('Endret dato')
     A            XSETID          T         TEXT('Endret tid')
     A                                      COLHDG('Endret tid')
     A            XSEUSR        10A         TEXT('Endret bruker')
     A                                      COLHDG('Endret bruker')
