      *
      * Slettekder tilbudsoppfølging
      *
     A          R XTSLPFR                   PFILE(*LIBL/XTSLPF)
      *
     A          K XSFIRM
     A          K XSSKOD
