      /TITLE  ASPGPL Opprydding i filer
     h option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASPGPL
      * Program . . . . : AA405R
      * Beskrivelse . . : Kopiere firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fafirl1    if   e           k disk    rename(afirpfr:afirpfr)
     fafirlu    o    e           k disk    rename(afirpfr:afirlur)
     fanotl1    if   e           k disk    rename(anotpfr:anotpfr)
     fanotlu    o    e           k disk    rename(anotpfr:anotlur)
     fanuml1    if   e           k disk    rename(anumpfr:anumpfr)
     fanumlu    o    e           k disk    rename(anumpfr:anumlur)
     fakidl1    if   e           k disk    rename(akidpfr:akidpfr)
     fakidlu    o    e           k disk    rename(akidpfr:akidlur)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
     d w_firm          s              3  0
      *
      * Firma
      *
     c     afirl1_key    setll     afirl1
     c     afirl1_key    reade     afirl1                                 90
     c                   dow       *in90 = *off
     c                   eval      aaffir = w_firm
     c                   write     afirlur
     c     afirl1_key    reade     afirl1                                 90
     c                   enddo
      *
      * Notat
      *
     c     anotl1_key    setll     anotl1
     c     anotl1_key    reade     anotl1                                 90
     c                   dow       *in90 = *off
     c                   eval      aufirm = w_firm
     c                   write     anotlur
     c     anotl1_key    reade     anotl1                                 90
     c                   enddo
      *
      * Nummer
      *
     c     anuml1_key    setll     anuml1
     c     anuml1_key    reade     anuml1                                 90
     c                   dow       *in90 = *off
     c                   eval      anfirm = w_firm
     c                   write     anumlur
     c     anuml1_key    reade     anuml1                                 90
     c                   enddo
      *
      * KID-referanse
      *
     c     akidl1_key    setll     akidl1
     c     akidl1_key    reade     akidl1                                 90
     c                   dow       *in90 = *off
     c                   eval      akfirm = w_firm
     c                   write     akidlur
     c     akidl1_key    reade     akidl1                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     afirl1_key    klist
     c                   kfld                    l_firm
      *
     c     anotl1_key    klist
     c                   kfld                    l_firm
      *
     c     anuml1_key    klist
     c                   kfld                    l_firm
      *
     c     akidl1_key    klist
     c                   kfld                    l_firm
      *
     c     *entry        plist
     c                   parm                    w_firm
      *
     c                   endsr
