      /TITLE  ASPGPL Opprydding i filer
     h option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASPGPL
      * Program . . . . : AA400R
      * Beskrivelse . . : Endre firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fafirlu    uf   e           k disk    rename(afirpfr:afirlur)
     fanotlu    uf   e           k disk    rename(anotpfr:anotlur)
     fanumlu    uf   e           k disk    rename(anumpfr:anumlur)
     fakidlu    uf   e           k disk    rename(akidpfr:akidlur)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
     d w_firm          s              3  0
      *
      * Firma
      *
     c     afirlu_key    setll     afirlu
     c     afirlu_key    reade     afirlu                                 90
     c                   dow       *in90 = *off
     c                   eval      aaffir = w_firm
     c                   update    afirlur
     c     afirlu_key    reade     afirlu                                 90
     c                   enddo
      *
      * Notat
      *
     c     anotlu_key    setll     anotlu
     c     anotlu_key    reade     anotlu                                 90
     c                   dow       *in90 = *off
     c                   eval      aufirm = w_firm
     c                   update    anotlur
     c     anotlu_key    reade     anotlu                                 90
     c                   enddo
      *
      * Nummer
      *
     c     anumlu_key    setll     anumlu
     c     anumlu_key    reade     anumlu                                 90
     c                   dow       *in90 = *off
     c                   eval      anfirm = w_firm
     c                   update    anumlur
     c     anumlu_key    reade     anumlu                                 90
     c                   enddo
      *
      * KID-referanse
      *
     c     akidlu_key    setll     akidlu
     c     akidlu_key    reade     akidlu                                 90
     c                   dow       *in90 = *off
     c                   eval      akfirm = w_firm
     c                   update    akidlur
     c     akidlu_key    reade     akidlu                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    w_firm
      *
     c     afirlu_key    klist
     c                   kfld                    l_firm
      *
     c     anotlu_key    klist
     c                   kfld                    l_firm
      *
     c     anumlu_key    klist
     c                   kfld                    l_firm
      *
     c     akidlu_key    klist
     c                   kfld                    l_firm
      *
     c                   endsr
