     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASPGPL
      * Program . . . . : AADOKLIBR
      * Beskrivelse . . : Dokumentere et bibliotek.  hensikt, av hvem +++
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       170423 sst  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
E5.40i/COPY QCPYLESRC,RF020PAR
     d rxupar          s                   like(rxulda)
     d p_lib           s             10
     *                                                                 .
     *  Legge til dokumentasjon om et bibliotek i AKLAPF              .
     *                                                                 .
     c                   eval      rxfirm  = *zero
     c                   eval      rxsyst  = 'A'
     c                   eval      rxpros  = %subst(p_lib:1:6)
     c                   eval      rxakti  = %subst(p_lib:7:4)
     c                   eval      rxkont = *zero
     c                   eval      rxspes = *zero
     c                   eval      rxavde = *zero
     c                   eval      rxlinj = *zeros
     c                   eval      rxtext = *blank
     c                   eval      rxvalg = *blank
     c                   eval      rxtist = *loval
     c                   eval      rxbiln = *zero
     c                   eval      rxrper = *zero
     c                   eval      rxraar = *zero
     c                   eval      rxonr  = *zero
     c                   move      rxulda        rxupar
     c                   call      'RF022R'
     c                   parm                    rxupar
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    p_lib
      *
     c                   endsr
