      /TITLE
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : AS???
      * Program . . . . :
      * Beskrivelse . . : Spør etter passord
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       211102 MHA  Nytt program
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     faf700d    cf   e             workstn
      *
      * Definering av parametre
     d p_bruker        s             10a
     d p_passord       s             10a
     d p_status        s              1
      *
      * Definering av konstanter
      *
      /eject
      *
      *
     c     start         tag
      *
     c                   eval      a1user = p_bruker
     c                   if        p_bruker <> *blank
     c                   eval      *in30 = *on
     c                   endif
     c                   exfmt     a1win
     c                   if        *inkc or *inkl
     c                   eval      p_status = 'A'
     c                   goto      avslutt
     c                   else
     c                   eval      p_passord = a1pass
     c                   eval      p_bruker = a1user
     c                   endif
     c                   if        p_bruker = *blank
     c                   goto      start
     c                   endif
     c                   eval      p_status = ' '
      *
     c     avslutt       tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    p_bruker
     c                   parm                    p_passord
     c                   parm                    p_status
      *
     c                   endsr
      *
