      /TITLE  ASOKON Spørring v.h.a. rapportter (Utvalg)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASFTP
      * Program . . . . : AF710R
      * Beskrivelse . . : Returnerer neste FTP jobb
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       061202 MHA  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     faftpl1    if a e           k disk      rename(aftppfr:aftpl1r)
      *
      *
      * Definering av parametre
     d p_status        s              1
     d p_navn          s                     like(afnavn)
     d p_nxtnavn       s                     like(afnavn)
      *
     d                uds
     d l_firm                944    946  0
      *
      * Definering av variabler
      *
     d aftpl1_navn     s                     like(afnavn)
     d w_firm          s                     like(affirm)
      *
      /eject
      *
     c     aftpl1_key    chain     aftpl1r
     c                   if        not %found
     c                   eval      p_status = 'N'
     c                   goto      slutt
     c                   endif
      *
     c                   eval      p_nxtnavn = afrunf
      *
     c     slutt         tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
     c     *entry        plist
     c                   parm                    p_navn
     c                   parm                    p_nxtnavn
     c                   parm                    p_status
      *
     c     aftpl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    aftpl1_navn
      *
     c                   eval      aftpl1_navn = p_navn
     c                   eval      w_firm = l_firm
      *
     c                   endsr
      *
