      /TITLE  Velger arkiv for henting fra arkiv
     H DECEDIT('0.') DATEDIT(*DMY.) option(*nodebugio)
     h DftActgrp(*No)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Program . . . . : AP623R
      * Beskrivelse . . : Velger hvilket arkiv det skal hentes fra
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- - - - - - - - - - - - - - - - - - - - - - - - - -
      *       220710 BSA  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     fap623d    cf   e             workstn
      *
      * Definering av parametre
      *
     d p_in03          s              1
     d p_arch          s              1
      *
     d w_alin          s              2  0
     d w_apos          s              3  0
      *
      * - - - - - - - - - - - - - -
      * Henter inn data fra LDA
      * - - - - - - - - - - - - - -
      *
     d                uds
     d l_ruti                800    809
     d l_outq                810    819
     d l_wsid                901    910
     d l_user                911    920
     d l_filg                931    933
     d l_firm                944    946  0
      *
      * Definering av variabler i nøkler
      *
      *
      * Definering av variable
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Hovedlogikk                                                     *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Sender opp "ramme" for skjermbildet
      *
     c     a2taga        tag
      *
     c                   eval      a1aarc = 0
     c                   eval      a1marc = 0
      *
     c                   write     s1win
      *
      * Sender opp skjermbildet
      *
     c     a2tagb        tag
      *
     c                   exfmt     a1win
      *
      * Annullere registrering.
      *
     c                   if        *inkc = *on
     c                   eval      p_in03 = '1'
     c                   goto      end_skj_arc
     c                   endif
      *
     c                   if        *inkl = *on
     c                   eval      p_in03 = '1'
     c                   goto      end_skj_arc
     c                   endif
      *
      * Dersom "Forny" er valgt,
      * sendes skjermbildet opp på nytt
      * med opprinnelige verdier
      *
     c                   if        *inke = *on
     c                   goto      a2taga
     c                   endif
      *
     c                   eval      *in30 = *off
     c                   if        a1aarc = a1marc
     c                   eval      *in30 = *on
     c                   endif
      *
      * Sender feilmelding:
      *
     c     *in30         cabeq     *on           a2tagb
      *
      * Oppdatering med verdier fra skjermbildet
      *
     c                   if        a1aarc = 1
     c                   eval      p_arch = 'A'
     c                   else
     c                   eval      p_arch = 'M'
     c                   endif
      *
     c     end_skj_arc   tag
      * ---------------------------------------------------------------*
      * Avslutt program                                                *
      * ---------------------------------------------------------------*
     c                   eval      *inlr = *on
     c                   return
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_arch
     c                   parm                    p_in03
      *
     c                   eval      p_in03 = '0'
     c                   eval      w_alin = 4
     c                   eval      w_apos = 32
      *
     c                   endsr
      *
