      /TITLE  Oppslag mot rutine-register
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Program . . . . : AP632R
      * Beskrivelse . . : Returnerer verdier for arkivoppslag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- - - - - - - - - - - - - - - - - - - - - - - - - -
      *       130313 BSA  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     fakobl1    if   e           k disk    rename(akobpfr:akobl1r)
      *
     d                uds
     d l_firm                944    946  0
     d l_avde                947    950  0
      *
      * Definering av parametre
      *
     d p_firm          s                   like(abfirm)
     d p_bilk          s                   like(abbilk)
     d p_dtyp          s                   like(abdtyp)
     d p_year          s                   like(abyear)
     d p_ok            s              1
      *
      * Definering av variabler i nøkler
      *
     d akobl1_bilk     s                   like(abbilk)
      *
      * Definering av variable
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Hent inn post fra formularregister                              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c                   eval      akobl1_bilk = p_bilk
     c     akobl1_key    chain     akobl1r
     c                   if        %found
     c                   eval      p_ok = '1'
     c                   eval      p_year = abyear
     c                   eval      p_dtyp = abdtyp
     c                   else
     c                   eval      p_ok = '0'
     c                   eval      p_year = *blanks
     c                   eval      p_dtyp = *blanks
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_bilk
     c                   parm                    p_dtyp
     c                   parm                    p_year
     c                   parm                    p_ok
      *
      * Key for arkivoppslag
      *
     c     akobl1_key    klist
     c                   kfld                    p_firm
     c                   kfld                    akobl1_bilk
      *
     c                   endsr
      *
