     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     faxmlut    o    e             disk
      *
      *
      *
     d                uds
     d l_kto                  64     64
     d l_kun                  65     65
     d l_lev                  66     66
     d l_mva                  67     67
     d l_kod                  68     68
      *
     d l_firm                944    946  0
     d l_user                911    920
      *
6.22 d p_kto           s              1
6.22 d p_kun           s              1
6.22 d p_lev           s              1
6.22 d p_mva           s              1
6.22 d p_kod           s              1
6.22 d p_fun           s              1
      *
     c     start         tag
     c                   if        p_fun = 'S'
     c                   eval      xmlrec = '<nl:MasterFiles>'
     c                   write     axmlutr
     c                   endif
      *
     c                   if        p_fun = 'E'
     c                   eval      xmlrec = '</nl:MasterFiles>'
     c                   write     axmlutr
     c                   endif
      *
     c                   if        p_fun = 'A'
     c                   eval      xmlrec = '</nl:AuditFile>'
     c                   write     axmlutr
     c                   endif
      *
     c                   eval      *inlr = *on
     c                   seton                                        lr
     c                   return
      *
      * ----------------------------------------------------------------
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    p_fun
      *
     c     *dtaara       define                  ax000par        100
     c     *lock         in        *dtaara
     c                   eval      p_kto = %subst(ax000par:64:1)
     c                   eval      p_kun = %subst(ax000par:65:1)
     c                   eval      p_lev = %subst(ax000par:66:1)
     c                   eval      p_mva = %subst(ax000par:67:1)
     c                   eval      p_kod = %subst(ax000par:68:1)
     c                   out       *dtaara
      *
     c                   endsr
      *
