      /title  ASPGPL FIX: Oppdaterer rutine og printstyringsregister
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASPGPL
      * Program . . . . : AX800R
      * Beskrivelse . . : FIX: Hjelpprogram
      *
      *                   Leser gjennom rutineregister og printstyrings-
      *                   register og legger ut nye poster
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       151201 AMD  Nytt program
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     faforl1    if   e           k disk    rename(aforpfr:aforl1r)
     fawsdl2    if   e           k disk    rename(awsdpfr:awsdl2r)
     faforlu    uf a e           k disk    rename(aforpfr:aforlur)
     fawsdlu    uf a e           k disk    rename(awsdpfr:awsdlur)
      *
      * Definering av variable i nøkler
      *
     d aforl1_ruti     s                   like(afruti)
     d aforlu_ruti     s                   like(afruti)
     d awsdl2_ruti     s                   like(awruti)
     d awsdlu_wsid     s                   like(awwsid)
     d awsdlu_ruti     s                   like(awruti)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
3.11 c                   exsr      a_ftilb
3.11 c                   exsr      b_ftilb
3.11 c                   exsr      a_fobek
3.11 c                   exsr      b_fobek
3.11 c                   exsr      a_fplukk
3.11 c                   exsr      b_fplukk
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Oppdaterer FFTILB i rutineregister
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     a_ftilb       begsr
3.11 c                   eval      aforl1_ruti = 'FTILB'
3.11 c     aforl1_key    setll     aforl1
3.11 c     aforl1_key    reade     aforl1                                 90
3.11  *
3.11 c                   dow       *in90  = *off
3.11  *
3.11 c                   eval      aforlu_ruti = 'FTILB1'
3.11 c                   eval      afruti = 'FTILB1'
3.11 c                   eval      afprog = 'FO911C'
3.11  *
3.11 c     aforlu_key    chain     aforlur                            91
3.11 c                   if        *in91 = *on
3.11 c                   write     aforlur
3.11 c                   endif
3.11  *
3.11 c                   eval      aforlu_ruti = 'FTILB2'
3.11 c                   eval      afruti = 'FTILB2'
3.11 c                   eval      afprog = 'FO912C'
3.11  *
3.11 c     aforlu_key    chain     aforlur                            91
3.11 c                   if        *in91 = *on
3.11 c                   write     aforlur
3.11 c                   endif
3.11  *
3.11 c                   eval      aforlu_ruti = 'FTILB3'
3.11 c                   eval      afruti = 'FTILB3'
3.11 c                   eval      afprog = 'FO915C'
3.11  *
3.11 c     aforlu_key    chain     aforlur                            91
3.11 c                   if        *in91 = *on
3.11 c                   write     aforlur
3.11 c                   endif
      *
     c     aforl1_key    reade     aforl1r                                90
     c                   enddo
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Oppdaterer FFTILB i printerstyringsregister
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     b_ftilb       begsr
3.11 c                   eval      awsdl2_ruti = 'FTILB'
3.11 c     awsdl2_key    setll     awsdl2
3.11 c     awsdl2_key    reade     awsdl2                                 90
3.11  *
3.11 c                   dow       *in90  = *off
3.11  *
3.11 c                   eval      awsdlu_wsid = awwsid
3.11 c                   eval      awsdlu_ruti = 'FTILB1'
3.11 c                   eval      awruti = 'FTILB1'
3.11  *
3.11 c     awsdlu_key    chain     awsdlur                            91
3.11 c                   if        *in91 = *on
3.11 c                   write     awsdlur
3.11 c                   endif
3.11  *
3.11 c                   eval      awsdlu_wsid = awwsid
3.11 c                   eval      awsdlu_ruti = 'FTILB2'
3.11 c                   eval      awruti = 'FTILB2'
3.11  *
3.11 c     awsdlu_key    chain     awsdlur                            91
3.11 c                   if        *in91 = *on
3.11 c                   write     awsdlur
3.11 c                   endif
3.11  *
3.11 c                   eval      awsdlu_wsid = awwsid
3.11 c                   eval      awsdlu_ruti = 'FTILB3'
3.11 c                   eval      awruti = 'FTILB3'
3.11  *
3.11 c     awsdlu_key    chain     awsdlur                            91
3.11 c                   if        *in91 = *on
3.11 c                   write     awsdlur
3.11 c                   endif
      *
     c     awsdl2_key    reade     awsdl2r                                90
     c                   enddo
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Oppdaterer FOBEK  i rutineregister
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     a_fobek       begsr
3.11 c                   eval      aforl1_ruti = 'FOBEK'
3.11 c     aforl1_key    setll     aforl1
3.11 c     aforl1_key    reade     aforl1                                 90
3.11  *
3.11 c                   dow       *in90  = *off
3.11  *
3.11 c                   eval      aforlu_ruti = 'FOBEK1'
3.11 c                   eval      afruti = 'FOBEK1'
3.11  *
3.11 c     aforlu_key    chain     aforlur                            91
3.11 c                   if        *in91 = *on
3.11 c                   write     aforlur
3.11 c                   endif
      *
     c     aforl1_key    reade     aforl1r                                90
     c                   enddo
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Oppdaterer FOBEK  i printerstyringsregister
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     b_fobek       begsr
3.11 c                   eval      awsdl2_ruti = 'FOBEK'
3.11 c     awsdl2_key    setll     awsdl2
3.11 c     awsdl2_key    reade     awsdl2                                 90
3.11  *
3.11 c                   dow       *in90  = *off
3.11  *
3.11 c                   eval      awsdlu_wsid = awwsid
3.11 c                   eval      awsdlu_ruti = 'FOBEK1'
3.11 c                   eval      awruti = 'FOBEK1'
3.11  *
3.11 c     awsdlu_key    chain     awsdlur                            91
3.11 c                   if        *in91 = *on
3.11 c                   write     awsdlur
3.11 c                   endif
      *
     c     awsdl2_key    reade     awsdl2r                                90
     c                   enddo
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Oppdaterer FPLUKK i rutineregister
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     a_fplukk      begsr
3.11 c                   eval      aforl1_ruti = 'FPLUKK'
3.11 c     aforl1_key    setll     aforl1
3.11 c     aforl1_key    reade     aforl1                                 90
3.11  *
3.11 c                   dow       *in90  = *off
3.11  *
3.11 c                   eval      aforlu_ruti = 'FPLUKK1'
3.11 c                   eval      afruti = 'FPLUKK1'
3.11  *
3.11 c     aforlu_key    chain     aforlur                            91
3.11 c                   if        *in91 = *on
3.11 c                   write     aforlur
3.11 c                   endif
      *
     c     aforl1_key    reade     aforl1r                                90
     c                   enddo
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Oppdaterer FOBEK  i printerstyringsregister
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     b_fplukk      begsr
3.11 c                   eval      awsdl2_ruti = 'FPLUKK'
3.11 c     awsdl2_key    setll     awsdl2
3.11 c     awsdl2_key    reade     awsdl2                                 90
3.11  *
3.11 c                   dow       *in90  = *off
3.11  *
3.11 c                   eval      awsdlu_wsid = awwsid
3.11 c                   eval      awsdlu_ruti = 'FPLUKK1'
3.11 c                   eval      awruti = 'FPLUKK1'
3.11  *
3.11 c     awsdlu_key    chain     awsdlur                            91
3.11 c                   if        *in91 = *on
3.11 c                   write     awsdlur
3.11 c                   endif
      *
     c     awsdl2_key    reade     awsdl2r                                90
     c                   enddo
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for rutineregister - les
      *
     c     aforl1_key    klist
     c                   kfld                    aforl1_ruti
      *
      * Key for rutineregister - update
      *
     c     aforlu_key    klist
     c                   kfld                    aforlu_ruti
      *
      * Key for skjermstyring  - les
      *
     c     awsdl2_key    klist
     c                   kfld                    awsdl2_ruti
      *
      * Key for skjermstyring  - update
      *
     c     awsdlu_key    klist
     c                   kfld                    awsdlu_wsid
     c                   kfld                    awsdlu_ruti
      *
     c                   endsr
