     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Program . . . . : AZ010R
      * Beskrivelse . . : Parameter ved utskrift av FRF
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *              AMD  Nytt program juni-94
      *
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     faz010d    cf   e             workstn
      *                                                                     -
      * Definering av parametere
      *                                                                     -
     d p_bibl          s             10
     d p_brud          s              1  0
     d p_in03          s              1  0
     d p_kod1          s              2
     d p_kod2          s              2
     d p_kod3          s              2
     d p_nfrf          s              4
     d p_sfil          s              8
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * A1BLD Behandle skjermbilde for parameter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     a1taga        tag
      *
     c                   exfmt     a1bld
      *
      * Avslutt ved F03
      *
     c                   if        *inkc = *on
     c                   eval      p_in03 = 1
     c                   goto      xslutt
     c                   endif
      *
      * Avslutt ved F12
      *
     c                   if        *inkl = *on
     c                   eval      p_in03 = 1
     c                   goto      xslutt
     c                   endif
      *
      * Legg over verdier
      *
     c                   eval      p_bibl = a1bibl
     c                   eval      p_sfil = a1sfil
     c                   eval      p_nfrf = a1nfrf
     c                   eval      p_kod1 = a1kod1
     c                   eval      p_kod2 = a1kod2
     c                   eval      p_kod3 = a1kod3
     c                   eval      p_brud = a1brud
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  END OF JOB
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
      *
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   eval      p_bibl = *blank
     c                   eval      p_sfil = *blank
     c                   eval      p_nfrf = *blank
     c                   eval      p_kod1 = *blank
     c                   eval      p_kod2 = *blank
     c                   eval      p_kod3 = *blank
     c                   eval      p_brud = *zero
     c                   eval      p_in03 = *zero
      *
      *  Legger inn default-verdier
      *
     c                   eval      a1sfil = 'QDDFSRC'
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_bibl
     c                   parm                    p_sfil
     c                   parm                    p_nfrf
     c                   parm                    p_kod1
     c                   parm                    p_kod2
     c                   parm                    p_kod3
     c                   parm                    p_brud
     c                   parm                    p_in03
      *
     c                   endsr
