     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASSHOP
      * Program . . . . : BD755R
      * Beskrivelse . . : Bong-linje, bytter navn på enhet på vare
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       161003 HKO  Nytt program
      * 6.10  010709 BSA  Oppdatert med sporingsinformasjon
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fbodtl2    uf   e           k disk    rename(bodtpfr:bodtl2r)
6.10  *
6.10 d                uds
6.10 d l_user                911    920
      *
      * Definering av parametre
      *
     d p_firm          s                   like(bdfirm)
     d p_vare          s                   like(bdvare)
     d p_enhg          s                   like(bdenh1)
     d p_enhn          s                   like(bdenh1)
      *
      * Definering av variable
      *
     d w_firm          s                   like(bdfirm)
     d w_vare          s                   like(bdvare)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Bong-linje
      *
     c     key01         setll     bodtl2
     c     key01         reade     bodtl2r
     c                   dow       not %eof
      *
     c                   if        bdenh1 = p_enhg
     c                   eval      bdenh1 = p_enhn
     c                   endif
      *
6.10 c                   time                    bdedat
6.10 c                   time                    bdetim
6.10 c                   eval      bdeusr = l_user
     c                   update    bodtl2r
      *
     c     key01         reade     bodtl2r
     c                   enddo
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_vare
     c                   parm                    p_enhg
     c                   parm                    p_enhn
      *
      * Key for oppdatering etter oppslag på vare
      *
     c     key01         klist
     c                   kfld                    w_firm
     c                   kfld                    w_vare
      *
      *
      * Henter firma og vare fra parameter
      *
     c                   eval      w_firm = p_firm
     c                   eval      w_vare = p_vare
      *
     c                   endsr
