     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : NXCLOUD
      * Program . . . . : BO131R
      * Beskrivelse . . : Finn aktuelt økosystem's beskrivelse
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       270623 sst  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     frbokl1    if   e           k disk    rename(rbokpfr:rbokl1r)
      *
     d okkode          s              2
     d oktext          s             30
      *
     d                uds
6.10 d l_user                911    920
7.03 d l_filg                931    933
7.06 d  l_firm               944    946  0
     d  l_fnav               951    980
      *
     d rbokl1_kode     s                   like(r00kod)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Henter økonomisystemets beskrivelse
      *
     c                   eval      rbokl1_kode = okkode
     c     rbokl1_key    chain     rbokl1
     c                   if        %found(rbokl1)
     c                   eval      oktext = r00txt
     c                   else
     c                   eval      oktext = 'Ukjent'
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  avslutt program                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
      *
     c                   seton                                        lr
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    okkode
     c                   parm                    oktext
      *
     c     rbokl1_key    klist
     c                   kfld                    rbokl1_kode
      *
     c                   endsr
