     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASSHOP
      * Program . . . . : BO402R
      * Beskrivelse . . : Sletter firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
      *       031104 HKO  Utvidet med tabeller fra ny kasse-løsing
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fbbudlu    uf   e           k disk    rename(bbudpfr:bbudlur)
     fbmdtlu    uf   e           k disk    rename(bmdtpfr:bmdtlur)
     fbmhelu    uf   e           k disk    rename(bmhepfr:bmhelur)
     fbodtlu    uf   e           k disk    rename(bodtpfr:bodtlur)
     fbohelu    uf   e           k disk    rename(bohepfr:bohelur)
     fbpsolu    uf   e           k disk    rename(bpsopfr:bpsolur)
     fbstslu    uf   e           k disk    rename(bstspfr:bstslur)
     fbwsdlu    uf   e           k disk    rename(bwsdpfr:bwsdlur)
      *
     fbkasiu    uf   e           k disk    rename(bkasst:bkasiur)
     fbbheiu    uf   e           k disk    rename(bbhest:bbheiur)
     fbbdtiu    uf   e           k disk    rename(bbdtst:bbdtiur)
     fbbsli2    uf   e           k disk    rename(bbslst:bbsli2r)
     fbgaviu    uf   e           k disk    rename(bgavst:bgaviur)
     fbgakiu    uf   e           k disk    rename(bgakst:bgakiur)
     fbbtxiu    uf   e           k disk    rename(bbtxst:bbtxiur)
     fbusriu    uf   e           k disk    rename(busrst:busriur)
      *
      * Definering av Local data area
      *
     d                uds
     d l_firm                944    946  0
      *
      * Definering av variable
      *
     d w_firm          s              3  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Budsjett
      *
     c     key01         setll     bbudlu
     c     key01         reade     bbudlur
     c                   dow       not %eof
     c                   delete    bbudlur
     c     key01         reade     bbudlur
     c                   enddo
      *
      * Butikk-linje
      *
     c     key01         setll     bmdtlu
     c     key01         reade     bmdtlur
     c                   dow       not %eof
     c                   delete    bmdtlur
     c     key01         reade     bmdtlur
     c                   enddo
      *
      * Butikk-hode
      *
     c     key01         setll     bmhelu
     c     key01         reade     bmhelur
     c                   dow       not %eof
     c                   delete    bmhelur
     c     key01         reade     bmhelur
     c                   enddo
      *
      * Bong-linje
      *
     c     key01         setll     bodtlu
     c     key01         reade     bodtlur
     c                   dow       not %eof
     c                   delete    bodtlur
     c     key01         reade     bodtlur
     c                   enddo
      *
      * Bong-hode
      *
     c     key01         setll     bohelu
     c     key01         reade     bohelur
     c                   dow       not %eof
     c                   delete    bohelur
     c     key01         reade     bohelur
     c                   enddo
      *
      * Plukk S-linje
      *
     c     key01         setll     bpsolu
     c     key01         reade     bpsolur
     c                   dow       not %eof
     c                   delete    bpsolur
     c     key01         reade     bpsolur
     c                   enddo
      *
      * Butikk-kode
      *
     c     key01         setll     bstslu
     c     key01         reade     bstslur
     c                   dow       not %eof
     c                   delete    bstslur
     c     key01         reade     bstslur
     c                   enddo
      *
      * Kasseregister
      *
     c     key01         setll     bwsdlu
     c     key01         reade     bwsdlur
     c                   dow       not %eof
     c                   delete    bwsdlur
     c     key01         reade     bwsdlur
     c                   enddo
      *
      * ButikkKasse
      *
     c     key01         setll     bkasiu
     c     key01         reade     bkasiur
     c                   dow       not %eof
     c                   delete    bkasiur
     c     key01         reade     bkasiur
     c                   enddo
      *
      * ButikkHode
      *
     c     key01         setll     bbheiu
     c     key01         reade     bbheiur
     c                   dow       not %eof
     c                   delete    bbheiur
     c     key01         reade     bbheiur
     c                   enddo
      *
      * ButikkLinje
      *
     c     key01         setll     bbdtiu
     c     key01         reade     bbdtiur
     c                   dow       not %eof
     c                   delete    bbdtiur
     c     key01         reade     bbdtiur
     c                   enddo
      *
      * ButikkLinjeSlettet
      *
     c     key01         setll     bbsli2
     c     key01         reade     bbsli2r
     c                   dow       not %eof
     c                   delete    bbsli2r
     c     key01         reade     bbsli2r
     c                   enddo
      *
      * ButikkGavekort
      *
     c     key01         setll     bgaviu
     c     key01         reade     bgaviur
     c                   dow       not %eof
     c                   delete    bgaviur
     c     key01         reade     bgaviur
     c                   enddo
      *
      * ButikkGavekortKjøp
      *
     c     key01         setll     bgakiu
     c     key01         reade     bgakiur
     c                   dow       not %eof
     c                   delete    bgakiur
     c     key01         reade     bgakiur
     c                   enddo
      *
      * BongTekst
      *
     c     key01         setll     bbtxiu
     c     key01         reade     bbtxiur
     c                   dow       not %eof
     c                   delete    bbtxiur
     c     key01         reade     bbtxiur
     c                   enddo
      *
      * ButikkBruker
      *
     c     key01         setll     busriu
     c     key01         reade     busriur
     c                   dow       not %eof
     c                   delete    busriur
     c     key01         reade     busriur
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Generell key for les på firma
      *
     c     key01         klist
     c                   kfld                    w_firm
      *
      *
      * Henter firma fra LDA
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
