     H/TITLE  Utskrift av uthentede data
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASSHOP
      * Program . . . . : BO520R
      * Beskrivelse . . : Utskrift av butikk-budsjett-register
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *
      *
      *
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     FBO520D    CF   E             WORKSTN
     FBBUDL1    IF   E           K DISK
     F                                     RENAME(BBUDPFR:BBUDL1R)
     FBO520P    O    E             PRINTER
      *
     D VIR             S              2  0 DIM(12)                               VIRKEDAGER
     D KRO             S             11  2 DIM(12)                               KRONER
     D SAL             S             11  2 DIM(12)                               SALG
     D KOS             S             11  2 DIM(12)                               KOST
      *
      * Hente inn firma fra local
      *
      *
     D                UDS
     D  DSFIRM               944    946  0
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av formater                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede formater
      * - - - - - - - - - -
      *
      * A1HDR  - Heading A1 på rapport
      * D1DET  - Detail  D1 på rapport
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * M1WIN Behandle vindu for valg                                   *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C                   Z-ADD     10            WACTLI
     C                   Z-ADD     12            WACTPO
      *
     C                   EXFMT     M1WIN
      *
     C     *INKC         IFEQ      *ON
     C                   GOTO      XSLUTT
     C                   ENDIF
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A1HDR Behandle heading A1                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Skrive heading
      *
     C                   WRITE     A1HDR
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * D1DET Behandle file                                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Lese file
      *
     C                   MOVE      DSFIRM        WWFIRM
     C                   MOVE      M1AARR        WWAARR
     C                   MOVE      M1AARR        D1AARR
     C                   Z-ADD     0             VIR
     C                   Z-ADD     0             KRO
     C                   Z-ADD     0             SAL
     C                   Z-ADD     0             KOS
      *
     C     1             DO        12            N                                       .....
     C                   MOVE      N             WWMMND                                      .
     C     KEY01         CHAIN     BBUDL1                             60                     .
     C     *IN60         IFEQ      *OFF                                                  ... .
     C                   Z-ADD     BUVDAG        VIR(N)                                    . .
     C                   Z-ADD     BUKRON        KRO(N)                                    . .
     C                   Z-ADD     BUSALG        SAL(N)                                    . .
     C                   Z-ADD     BUKOST        KOS(N)                                    . .
     C                   ENDIF                                                           ... .
      *                                                                 .
     C     N             IFEQ      1                                                     ... .
     C                   MOVE      BUTEXT        D1TEXT                                    . .
     C                   ENDIF                                                           ... .
     C                   ENDDO                                                           .....
      *
     C                   MOVE      VIR(1)        D1VI01
     C                   MOVE      VIR(2)        D1VI02
     C                   MOVE      VIR(3)        D1VI03
     C                   MOVE      VIR(4)        D1VI04
     C                   MOVE      VIR(5)        D1VI05
     C                   MOVE      VIR(6)        D1VI06
     C                   MOVE      VIR(7)        D1VI07
     C                   MOVE      VIR(8)        D1VI08
     C                   MOVE      VIR(9)        D1VI09
     C                   MOVE      VIR(10)       D1VI10
     C                   MOVE      VIR(11)       D1VI11
     C                   MOVE      VIR(12)       D1VI12
     C                   MOVE      KRO(1)        D1KR01
     C                   MOVE      KRO(2)        D1KR02
     C                   MOVE      KRO(3)        D1KR03
     C                   MOVE      KRO(4)        D1KR04
     C                   MOVE      KRO(5)        D1KR05
     C                   MOVE      KRO(6)        D1KR06
     C                   MOVE      KRO(7)        D1KR07
     C                   MOVE      KRO(8)        D1KR08
     C                   MOVE      KRO(9)        D1KR09
     C                   MOVE      KRO(10)       D1KR10
     C                   MOVE      KRO(11)       D1KR11
     C                   MOVE      KRO(12)       D1KR12
     C                   MOVE      SAL(1)        D1SA01
     C                   MOVE      SAL(2)        D1SA02
     C                   MOVE      SAL(3)        D1SA03
     C                   MOVE      SAL(4)        D1SA04
     C                   MOVE      SAL(5)        D1SA05
     C                   MOVE      SAL(6)        D1SA06
     C                   MOVE      SAL(7)        D1SA07
     C                   MOVE      SAL(8)        D1SA08
     C                   MOVE      SAL(9)        D1SA09
     C                   MOVE      SAL(10)       D1SA10
     C                   MOVE      SAL(11)       D1SA11
     C                   MOVE      SAL(12)       D1SA12
     C                   MOVE      KOS(1)        D1KO01
     C                   MOVE      KOS(2)        D1KO02
     C                   MOVE      KOS(3)        D1KO03
     C                   MOVE      KOS(4)        D1KO04
     C                   MOVE      KOS(5)        D1KO05
     C                   MOVE      KOS(6)        D1KO06
     C                   MOVE      KOS(7)        D1KO07
     C                   MOVE      KOS(8)        D1KO08
     C                   MOVE      KOS(9)        D1KO09
     C                   MOVE      KOS(10)       D1KO10
     C                   MOVE      KOS(11)       D1KO11
     C                   MOVE      KOS(12)       D1KO12
      *
      * Skrive side
      *
     C                   WRITE     D1DET                                30
      *
     C                   GOTO      XSLUTT
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     XSLUTT        TAG
     C                   SETON                                        LR
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     *INZSR        BEGSR
      *
     C     *LIKE         DEFINE    BUFIRM        WWFIRM
     C     *LIKE         DEFINE    BUMMND        WWMMND
     C     *LIKE         DEFINE    BUAARR        WWAARR
     C     *LIKE         DEFINE    BUAARR        WPAARR
     C                   Z-ADD     0             N                 2 0
      *
      * Parameterliste
      *
     C     *ENTRY        PLIST
     C                   PARM                    WPAARR
      *
      * Key for uthentede data
      *
     C     KEY01         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWAARR
     C                   KFLD                    WWMMND
      *
     C                   ENDSR
      *
