     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASSHOP
      * Program . . . . : BT100R
      * Beskrivelse . . : BongTekst, vedlikehold
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       120804 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fbbtxi1    if   e           k disk    rename(bbtxst:bbtxi1r)
     fbbtxiu    uf a e           k disk    rename(bbtxst:bbtxiur)
      *
     fbt100d    cf   e             workstn
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
      *
      * Definering av variable
      *
     d w_firm          s                   like(btfirm)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   eval      w_arow = 0
     c                   eval      w_acol = 0
      *
     c     bbtxi1_key    chain     bbtxi1
      *
     c                   if        %found
     c                   eval      b1btx1 = btbtx1
     c                   eval      b1btx2 = btbtx2
     c                   eval      b1btx3 = btbtx3
     c                   eval      b1btx4 = btbtx4
     c                   eval      b1btx5 = btbtx5
     c                   else
     c                   eval      b1btx1 = *blank
     c                   eval      b1btx2 = *blank
     c                   eval      b1btx3 = *blank
     c                   eval      b1btx4 = *blank
     c                   eval      b1btx5 = *blank
     c                   endif
      *
     c     b1taga        tag
      *
     c                   exfmt     b1win
      *
     c                   if        *inkc or *inkl
     c                   goto      avslutt
     c                   endif
      *
      * Oppdatering
      *
     c                   clear                   bbtxiur
      *
     c     bbtxiu_key    chain     bbtxiur
      *
     c                   eval      btbtx1 = b1btx1
     c                   eval      btbtx2 = b1btx2
     c                   eval      btbtx3 = b1btx3
     c                   eval      btbtx4 = b1btx4
     c                   eval      btbtx5 = b1btx5
     c                   eval      bteusr = l_user
      *
     c                   time                    btedat
     c                   time                    btetim
      *
     c                   if        %found
     c                   update    bbtxiur
     c                   else
     c                   eval      btfirm = w_firm
     c                   time                    btodat
     c                   write     bbtxiur
     c                   endif
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppslag på BongTekst
      *
     c     bbtxi1_key    klist
     c                   kfld                    w_firm
      *
      * Key for oppdatering av BongTekst
      *
     c     bbtxiu_key    klist
     c                   kfld                    w_firm
      *
      *
      * Henter firma fra LDA
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
