     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASSHOP
      * Program . . . . : BU716R
      * Beskrivelse . . : Butikk, eksport av avdeling
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       160404 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fra07l1    if   e           k disk    rename(ra07pfr:ra07l1r)
      *
     fboavst    uf a e           k disk    rename(boavst:boavstr)
      *
      * Definering av parametre
      *
     d p_firm          s                   like(ragfir)
      *
      * Definering av variable
      *
     d w_firm          s                   like(ragfir)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Initierer fil
      *
     c                   clear                   boavstr
      *
     c                   eval      firm = w_firm
      *
      * Behandler avdeling
      *
     c     ra07l1_key    setll     ra07l1
     c     ra07l1_key    reade     ra07l1
     c                   dow       %eof = *off
      *
     c                   eval      avde = ragkod
     c                   eval      besk = ragtxt
     c                   eval      adr1 = ragadr
     c                   eval      adr2 = ragad2
     c                   eval      ponr = *blank
     c                   eval      sted = ragste
     c                   eval      tlfn = ragtlf
     c                   eval      tlfx = ragfax
     c                   eval      bgir = ragbgi
     c                   eval      eanl = ragean
     c                   eval      kspr = ragspr
     c                   eval      lety = raglty
     c                   eval      odat = ragdat
     c                   eval      edat = ragdat
     c                   eval      etim = ragtim
     c                   eval      eusr = ragusr
      *
     c                   if        ragpnr <> 0
     c                   movel     ragpnr        ponr
     c                   endif
      *
     c                   write     boavstr
      *
     c     ra07l1_key    reade     ra07l1
     c                   enddo
      *
      * Avslutt
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parameter
      *
     c     *entry        plist
     c                   parm                    p_firm
      *
      * Key for les på avdeling
      *
     c     ra07l1_key    klist
     c                   kfld                    w_firm
      *
      *
      * Henter firma fra parameter
      *
     c                   eval      w_firm = p_firm
      *
     c                   endsr
