     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASSHOP
      * Program . . . . : BU717R
      * Beskrivelse . . : Butikk, eksport av lager
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       160404 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fra10l1    if   e           k disk    rename(ra10pfr:ra10l1r)
      *
     fbolgst    uf a e           k disk    rename(bolgst:bolgstr)
      *
      * Definering av parametre
      *
     d p_firm          s                   like(rajfir)
      *
      * Definering av variable
      *
     d w_firm          s                   like(rajfir)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Initierer fil
      *
     c                   clear                   bolgstr
      *
     c                   eval      firm = w_firm
      *
      * Behandler lager
      *
     c     ra10l1_key    setll     ra10l1
     c     ra10l1_key    reade     ra10l1
     c                   dow       %eof = *off
      *
     c                   eval      lage = rajkod
     c                   eval      besk = rajtxt
     c                   eval      adr1 = rajadr
     c                   eval      adr2 = rajad2
     c                   eval      ponr = *blank
     c                   eval      sted = rajste
     c                   eval      tlfn = rajtlf
     c                   eval      tlfx = rajfax
     c                   eval      avde = rajavd
     c***                eval      eanl = rajean
     c                   eval      odat = rajdat
     c                   eval      edat = rajdat
     c                   eval      etim = rajtim
     c                   eval      eusr = rajusr
      *
     c                   if        rajpnr <> 0
     c                   movel     rajpnr        ponr
     c                   endif
      *
     c                   write     bolgstr
      *
     c     ra10l1_key    reade     ra10l1
     c                   enddo
      *
      * Avslutt
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parameter
      *
     c     *entry        plist
     c                   parm                    p_firm
      *
      * Key for les på lager
      *
     c     ra10l1_key    klist
     c                   kfld                    w_firm
      *
      *
      * Henter firma fra parameter
      *
     c                   eval      w_firm = p_firm
      *
     c                   endsr
