     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASSHOP
      * Program . . . . : BU900R
      * Beskrivelse . . : Butikk, eksport av tabeller til PC-kasse
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       220604 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Definering av parametre
      *
     d p_dlib          s             10
     d p_kass          s              3
     d p_firm          s              3
     d p_dato          s              8
     d p_time          s              6
      *
      * Definering av variable
      *
     d w_firm          s              3  0
     d w_dato          s               d   datfmt(*iso)
     d w_time          s               t   timfmt(*iso)
      *
     d w_dato_8        s              8  0
     d w_time_6        s              6  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Utleder parametre for kall av eksport-program
      *
     c                   move      p_firm        w_firm
      *
     c                   move      p_dato        w_dato_8
     c                   if        w_dato_8 <> 0
     c     *ymd0         move      p_dato        w_dato
     c                   endif
      *
     c                   move      p_time        w_time_6
     c                   if        w_time_6 <> 0
     c     *hms          move      w_time_6      w_time
     c                   endif
      *
      * Kaller eksportprogram
      *
     c                   call      'BU700C'
     c                   parm                    p_dlib
     c                   parm                    p_kass
     c                   parm                    w_firm
     c                   parm                    w_dato
     c                   parm                    w_time
      *
      * Avslutt
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parameter
      *
     c     *entry        plist
     c                   parm                    p_dlib
     c                   parm                    p_kass
     c                   parm                    p_firm
     c                   parm                    p_dato
     c                   parm                    p_time
      *
     c                   endsr
