     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASSHOP
      * Program . . . . : BU925R
      * Beskrivelse . . : Butikk, sletter ordre
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       080904 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Definering av parametre
      *
     d p_firm          s              3
     d p_ornr          s              6  0
     d p_suff          s              2  0
      *
      * Definering av variable
      *
     d w_firm          s              3  0
     d w_type          s              4
     d w_kom1          s             30
     d w_kom2          s             30
     d w_opdt          s              1
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Utleder parametre for kall av program
      *
     c                   move      p_firm        w_firm
      *
     c                   eval      w_type = 'SHOP'
     c                   eval      w_kom1 = *blank
     c                   eval      w_kom2 = *blank
     c                   eval      w_opdt = *blank
      *
      * Kaller program i ofak for sletting av ordre
      *
     c                   call      'FO410R'
     c                   parm                    w_firm
     c                   parm                    p_ornr
     c                   parm                    p_suff
     c                   parm                    w_type
     c                   parm                    w_kom1
     c                   parm                    w_kom2
     c                   parm                    w_opdt
      *
      * Avslutt
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parameter
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_ornr
     c                   parm                    p_suff
      *
     c                   endsr
