     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASSHOP
      * Program . . . . : BU930R
      * Beskrivelse . . : Butikk, henter lager-beholdning
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       250604 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Definering av parametre
      *
     d p_firm          s              3
     d p_vare          s             15
     d p_lage          s              2  0
     d p_enhe          s              3
     d p_behl          s             11  3
     d p_bbes          s             11  3
     d p_pakk          s             11  3
     d p_disp          s             11  3
      *
      * Definering av variable
      *
     d w_firm          s              3  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Utleder parametre for kall av program
      *
     c                   move      p_firm        w_firm
      *
      * Kaller program
      *
     c                   call      'VL700R'
     c                   parm                    w_firm
     c                   parm                    p_vare
     c                   parm                    p_lage
     c                   parm                    p_enhe
     c                   parm                    p_behl
     c                   parm                    p_bbes
     c                   parm                    p_pakk
     c                   parm                    p_disp
      *
      * Avslutt
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parameter
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_vare
     c                   parm                    p_lage
     c                   parm                    p_enhe
     c                   parm                    p_behl
     c                   parm                    p_bbes
     c                   parm                    p_pakk
     c                   parm                    p_disp
      *
     c                   endsr
