     h option(*nodebugio) datedit(*dmy)
     h decedit('0.')
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : NXCLOUD
      * Program . . . . : CHKEMAIL
      * Beskrivelse . . : Sjekker at email er riktig utfylt
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * ----- ------ ---- -------------------------------------------------
      *       130223 sst  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Definering av Local data area
      *
     d                uds
     d l_firm                944    946  0
     d l_user                911    920
      *
      * Definering av variable
      *
8.07 d w_sk            s              3  0
8.07 d w_sp            s              3  0
8.07 d w_sb            s              3  0
      *
     d p_emal          s             50
     d p_stat          s              1
      *
8.07  *
8.07  *  Sjekk om gyldig email adresse med @ og . m.m.
8.07  *
      *   Sjekk om email-adresse inneholder minst 1 @
8.07 c                   eval      w_sk = %scan('@':p_emal)
8.07 c                   if        w_sk = 0
8.07 c                   eval      p_stat = 'F'
8.07 c                   goto      end
8.07 c                   endif
8.07 c                   eval      w_sp = %scan('.':p_emal:w_sk)
8.07 c                   eval      w_sb = %scan(' ':p_emal)
      *   Sjekk om @ tidligst står i pos 3
8.07 c                   if        w_sk < 3
      *   Sjekk om . etter @ tidligst står i pos 6
8.07 c                             or w_sp < 6
      *   Sjekk at det minimum er to posisjoner etter @
8.07 c                             or (w_sp - w_sk) < 3
      *   Sjekk at det minimum er to posisjoner etter . etter @
8.07 c                             or (w_sb - w_sp) < 3
8.07 c                   eval      p_stat = 'F'
8.07 c                   goto      end
8.07 c                   endif
8.07  *  Inneholder mail adresse mer enn 1 @
8.07 c                   if        %scan('@':p_emal:w_sk+1) > 1
8.07 c                   eval      p_stat = 'F'
8.07 c                   goto      end
8.07 c                   endif
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     end           tag
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_emal
     c                   parm                    p_stat
      *
     c                   eval      p_stat = *blank
      *
     c                   endsr
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
