     h datedit(*dmy) option(*nodebugio)
      /TITLE  ASBANK Utplukksparametre ADRA AccountMatch
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      * System  . . . . : ASBANK                                        *
      * Program . . . . : DADR1R                                        *
      * Beskrivelse . . : Utplukksparametre ADRA AccountMatch           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      * Spesialversjon. :                                               *
      * Tilpasset for . :                                               *
      *                                                                 *
      * Referanse  Dato   Endringsbeskrivelse                      Sign.*
      * --------- ------  ----------------------------------------------*
      *           251006  Nytt program.                            RHO  *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fdadr1d    cf   e             workstn
      *
      * Henter Firmanavn og Miljø
      *
     d lda            uds
     d l_chgv                844    844
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
     d l_milj               1003   1005
      *
      *
     d w_arow          s              2  0
     d w_acol          s              3  0
     d w_dato          s              8  0
     d inkc            s              1
     d w1fram          s              2
     d w1tilm          s              2
     d w1aar           s              4
      *
      * Send Alt
      *
     c     b2taga        tag
      *
     c                   eval      m1milj = l_milj
     c                   exfmt     a1win
      *
      * Avslutt program ved F03.
      *
     c                   if        *inkc = *on
     c                   movel     '1'           inkc
     c                   goto      xslutt
     c                   endif
      *
     c                   if        m1fram =0
     c                             or m1tilm =0
     c                             or m1aar =0
     c                   goto      b2taga
     c                   endif
      *
     c                   if        m1fram > m1tilm
     c                   goto      b2taga
     c                   endif
      *
     c                   move      m1fram        w1fram
     c                   move      m1tilm        w1tilm
     c                   move      m1aar         w1aar
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      * Parameterliste:
      *
     c     *entry        plist
     c                   parm                    inkc
     c                   parm                    m1milj
     c                   parm                    w1fram
     c                   parm                    w1tilm
     c                   parm                    w1aar
      *
     c                   eval      m1aar  = uyear + 2000
     c     *dtaara       define    *lda          lda
     c                   endsr
      *
