     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
6.22 d w_rutine        s             50
6.22 d wtid            s               T
      *
     c                   eval      w_rutine = 'TEST av debug fra RPG'
     c                   call      'DEBUGCL'
     c                   parm                    w_rutine
     c                   eval      *inlr = *on
     c                   return
      *
     c     *inzsr        begsr
      *
      *
     c                   endsr
      *
