     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : EK711R
      * Beskrivelse . . : Kunde bonus, beregner og oppdaterer bonus
      *
      * Spesialversjon. :
      *
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       251005 HKO  Nytt program
6.10  * 6.10  210711 bsa  Oppdaterer nytt register ifbm utvidet bonusfunksjonalitet
6.11  * 6.10  100811 bsa  Tar hensyn til bonustype.
6.12  * 6.10  020911 bsa  Tar hensyn til kode på bonuselement om det er byggende
6.13  * 6.10  070911 bsa  Henter inn kundekategori fra kunderegister
6.14  * 6.10  270911 bsa  Sjekker mot bonustypen om bonus skal kalkuleres basert på
6.14  *                   totaler eller pr. element.
6.20  * 6.20  261113 bsa  Leses statistikk kun tom periode
6.21  * 6.20  261113 bsa  Leses statistikk også fra periode
6.22  * 6.20  140114 bsa  Legger ikke ut andel på statistikkregister
6.23  * 6.20  140114 bsa  Kalkulerer ikke bonus der det ikke er
6.23  *                   byggende.
7.01  * 6.20  020215 bsa  Trekker ikke ut alm.rabatt
8.01  *PRG2   220622 BOF  Utvidet prisgruppe fra 1 til 2 posisjoner - COMP
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fekboi1    if   e           k disk    rename(ekbost:ekboi1r)
6.14 fekboic    if   e           k disk    rename(ekbost:ekboicr)
     fekboiu    uf   e           k disk    rename(ekbost:ekboiur)
     fekbeiu    uf   e           k disk    rename(ekbest:ekbeiur)
6.10 fekbtiu    uf   e           k disk    rename(ekbtst:ekbtiur)
6.14 fekbtir    if   e           k disk    rename(ekbtst:ekbtirr)
6.14 f                                     prefix(xk:2)
6.14 fekbsir    if   e           k disk    rename(ekbsst:ekbsirr)
     fekbei2    uf   e           k disk    rename(ekbest:ekbei2r)
6.13 frkunl1    if   e           k disk    rename(rkunpfr:rkunl1r)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     fvvasl1    if   e           k disk    rename(vvaspfr:vvasl1r)
6.14 fvbotl1    if   e           k disk    rename(vbotpfr:vbotl1r)
     fsstalk    if   e           k disk    rename(sstapfr:sstalkr)
     fsstalu    uf   e           k disk    rename(sstapfr:sstalur)
     f                                     prefix(su:2)
      *
      * Definering av parametre
      *
     d p_firm          s              3
     d p_bkun          s              6
     d p_paar          s              4
6.11 d p_tbot          s              2
6.20 d p_peri          s              2
6.21 d p_fper          s              2
     d p_inlr          s              1
      *
      * Definering av array
      *
     d a_boty          s              2    dim(99)
      *
      * Definering av variable i nøkler
      *
     d ekboi1_rkat     s                   like(ekrkat)
     d ekboi1_kund     s                   like(ekkund)
     d ekboi1_kpro     s                   like(ekkpro)
     d ekboi1_ogrp     s                   like(ekogrp)
     d ekboi1_hgrp     s                   like(ekhgrp)
     d ekboi1_ugrp     s                   like(ekugrp)
     d ekboi1_ldor     s                   like(ekldor)
     d ekboi1_modn     s                   like(ekmodn)
     d ekboi1_vare     s                   like(ekvare)
     d ekboi1_enhe     s                   like(ekenhe)
     d ekboi1_lety     s                   like(eklety)
     d ekbei2_erka     s                   like(ekerka)
     d ekbei2_ekun     s                   like(ekekun)
     d ekbei2_ekpr     s                   like(ekekpr)
     d ekbei2_eogr     s                   like(ekeogr)
     d ekbei2_ehgr     s                   like(ekehgr)
     d ekbei2_eugr     s                   like(ekeugr)
     d ekbei2_eldo     s                   like(ekeldo)
     d ekbei2_emod     s                   like(ekemod)
     d ekbei2_evar     s                   like(ekevar)
     d ekbei2_eenh     s                   like(ekeenh)
     d ekbei2_elet     s                   like(ekelet)
     d ekbei2_ebot     s                   like(ekebot)
     d ekbei2_efda     s                   like(ekefda)
     d ekbei2_etda     s                   like(eketda)
     d ekboiu_rkat     s                   like(ekrkat)
     d ekboiu_kund     s                   like(ekkund)
     d ekboiu_kpro     s                   like(ekkpro)
     d ekboiu_ogrp     s                   like(ekogrp)
     d ekboiu_hgrp     s                   like(ekhgrp)
     d ekboiu_ugrp     s                   like(ekugrp)
     d ekboiu_ldor     s                   like(ekldor)
     d ekboiu_modn     s                   like(ekmodn)
     d ekboiu_vare     s                   like(ekvare)
     d ekboiu_enhe     s                   like(ekenhe)
     d ekboiu_lety     s                   like(eklety)
     d ekboiu_boty     s                   like(ekboty)
     d ekboiu_fdat     s                   like(ekfdat)
     d ekboiu_tdat     s                   like(ektdat)
     d vvarl1_vare     s                   like(vvvare)
     d vvasl1_vare     s                   like(vvvare)
     d sstalu_binr     s                   like(sfbinr)
     d sstalu_ornr     s                   like(sfornr)
     d sstalu_orsu     s                   like(sforsu)
     d sstalu_orli     s                   like(sforli)
     d sstalu_bong     s                   like(sfbong)
     d sstalu_vare     s                   like(sfvare)
     d sstalu_enhe     s                   like(sfenhe)
     d sstalu_anta     s                   like(sfanta)
     d sstalu_date     s                   like(sfdate)
     d sstalu_time     s                   like(sftime)
      *
6.14 d ekboic_boty     s                   like(ekboty)
6.14 d ekbsir_sbot     s                   like(eksbot)
6.14 d ekbsir_saar     s                   like(eksaar)
6.14 d vbotl1_tbot     s                   like(vatbot)
6.10 d ekbtiu_tbot     s                   like(ektbot)
6.13 d rkunl1_kund     s                   like(rkkund)
      *
      * Definering av variable
      *
     d b_hele          s              1    inz(*off)
     d b_bonu          s              1    inz(*off)
      *
     d w_arnr          s              2  0
      *
     d w_firm          s                   like(ekfirm)
     d w_bkun          s                   like(ekbkun)
     d w_paar          s                   like(sfpaar)
6.11 d w_tbot          s              2
     d w_sumn          s                   like(sfsumb)
6.14 d w_bonu          s                   like(ektsbo)
6.14 d w_bgrl          s                   like(ektbgr)
     d w_tbel          s                   like(ekebgt)
6.14  *
6.14  * Definering av Local data area
6.14  *
6.14 d                uds
6.14 d l_user                911    920
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * "Ekstrarunde" for å stenge åpne filer?
      *
     c                   if        p_inlr = *on
     c                   goto      avslutt
     c                   endif
      *
      * Henter parameter
      *
     c                   move      p_firm        w_firm
     c                   move      p_bkun        w_bkun
     c                   move      p_paar        w_paar
6.11 c                   move      p_tbot        w_tbot
6.13  * Hent inn informasjon fra kunderegister
6.13 c                   eval      rkunl1_kund = w_bkun
6.13 c     rkunl1_key    chain     rkunl1
      *
      * Nullstiller bonusgrunnlag og kalkulet bonus for alle nivåer for
      * bonuskunde
      * Dersom det er lagt inn bonus mot rabattkategori, kunde eller
      * kundeprosjekt settes flagg for å markere at hele salgsstatistkken
      * må leses
      *
     c     ekboiu_key2   setll     ekboiu
     c     ekboiu_key2   reade     ekboiur
     c                   dow       not %eof
6.11 c                   if        w_tbot <> *blank and
6.11 c                             w_tbot <> ekboty
6.11 c                   goto      ny_ekbo
6.11 c                   endif
6.11  *
     c                   if        ekrkat <> 0 or
     c                             ekkund <> 0
     c                   eval      b_hele = *on
     c                   endif
     c                   eval      ekbgru = 0
     c                   eval      eksbon = 0
     c                   eval      ekbdat = *loval
     c                   eval      ekbtim = *loval
     c                   update    ekboiur
6.11 c     ny_ekbo       tag
     c     ekboiu_key2   reade     ekboiur
     c                   enddo
      *
     c     ekbeiu_key2   setll     ekbeiu
     c     ekbeiu_key2   reade     ekbeiur
     c                   dow       not %eof
6.11 c                   if        w_tbot <> *blank and
6.11 c                             w_tbot <> ekebot
6.11 c                   goto      ny_ekbe
6.11 c                   endif
6.11  *
     c                   eval      ekesbo = 0
     c                   eval      ekebda = *loval
     c                   eval      ekebti = *loval
     c                   update    ekbeiur
6.11 c     ny_ekbe       tag
     c     ekbeiu_key2   reade     ekbeiur
     c                   enddo
6.10  * Nullstiller felter på bonustype nivå.
6.10 c     ekbtiu_key2   setll     ekbtiu
6.10 c     ekbtiu_key2   reade     ekbtiur
6.10 c                   dow       not %eof
6.11 c                   if        w_tbot <> *blank and
6.11 c                             w_tbot <> ektbot
6.11 c                   goto      ny_ekbt
6.11 c                   endif
6.11  *
6.14 c                   eval      ektbgr = 0
6.10 c                   eval      ektsbo = 0
6.10 c                   eval      ektbda = *loval
6.10 c                   time                    ekteda
6.10 c                   time                    ekteti
6.10 c                   update    ekbtiur
6.11 c     ny_ekbt       tag
6.10 c     ekbtiu_key2   reade     ekbtiur
6.10 c                   enddo
      *
      * Summerer og lagrer bonusgrunnlag innenfor hvert nivå
      *
     c                   exsr      bonusgrunnlag
      *
      * Kalkulerer bonus for hvert bonuselement
      *
     c                   exsr      bonus
      *
      * Oppdaterer statistikk med andel av kalkulert bonus
      *
6.22  * Ingen grunn til å legge ut andel på stat, da det ikke brukes
6.22  * Sparer mye tid ved kalkulering.
6.22 c                   if        1 = 2
     c                   exsr      statistikk
6.22 c                   endif
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   if        p_inlr = *on
     c                   eval      *inlr = *on
     c                   endif
      *
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Summerer og lagrer bonusgrunnlag innenfor hvert nivå
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bonusgrunnlag begsr
      *
      * Leser og behandler salgsstatistikk for valg år
      * En vare kan ha bonus mot flere bonustyper og hver vare må derfor
      * summeres inn i bonusgrunnlaget pr. nivå/bonustype
      * Takler ikke overlappende datointervall
      *
     c                   if        b_hele = *on
     c     sstalk_key2   setll     sstalk
     c     sstalk_key2   reade     sstalk
     c                   else
     c     sstalk_key    setll     sstalk
     c     sstalk_key    reade     sstalk
     c                   endif
     c                   dow       not %eof
      *
     c                   eval      w_arnr = 0
     c                   eval      a_boty(*) = *blank
      *
     c                   dou       b_bonu = *off
      *
     c                   exsr      bonusnivÅ
      *
     c                   if        b_bonu = *on
     c                   eval      w_arnr = w_arnr + 1
     c                   eval      a_boty(w_arnr) = ekboty
6.11  * Sjekk om bonustype er valgt for oppdatering
6.11 c                   if        w_tbot <> *blank and
6.11 c                             w_tbot <> ekboty
6.11 c                   goto      no_boty
6.11 c                   endif
6.12  * Sjekk om bonuselementet skal være byggende
6.12  * Vil gjerne se grunnlaget, men det skal ikke kalkuleres bonus
6.23 c*                  if        ekebyg = 1
6.23 c*                  goto      no_boty
6.23 c*                  endif
6.23  *
     c                   eval      ekboiu_rkat = ekrkat
     c                   eval      ekboiu_kund = ekkund
     c                   eval      ekboiu_kpro = ekkpro
     c                   eval      ekboiu_ogrp = ekogrp
     c                   eval      ekboiu_hgrp = ekhgrp
     c                   eval      ekboiu_ugrp = ekugrp
     c                   eval      ekboiu_ldor = ekldor
     c                   eval      ekboiu_modn = ekmodn
     c                   eval      ekboiu_vare = ekvare
     c                   eval      ekboiu_enhe = ekenhe
     c                   eval      ekboiu_lety = eklety
     c                   eval      ekboiu_boty = ekboty
     c                   eval      ekboiu_fdat = ekfdat
     c                   eval      ekboiu_tdat = ektdat
     c     ekboiu_key    chain     ekboiur
     c                   eval(h)   w_sumn = sfsumb - sfrab1 - sfrab2 -
7.01 c                                      sfrabo
7.01 c**                                    sfrabo - sfbrk1 - sfbrk2
     c                   eval(h)   ekbgru = ekbgru + w_sumn
     c                   time                    ekbdat
     c                   time                    ekbtim
     c                   update    ekboiur
     c                   endif
6.11  *
6.11 c     no_boty       tag
      *
     c                   enddo
      *
     c                   if        b_hele = *on
     c     sstalk_key2   reade     sstalk
     c                   else
     c     sstalk_key    reade     sstalk
     c                   endif
     c                   enddo
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Kalkulerer bonus for hvert bonuselement
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bonus         begsr
      *
      * Kalkulerer bonusandel pr. bonuskunde-element og lagrer denne
      * Takler ikke overlappende beløpsgrenser
      *
     c     ekboiu_key2   setll     ekboiu
     c     ekboiu_key2   reade     ekboiur
     c                   dow       not %eof
      *
     c                   if        ekbgru <> 0
6.11  * Sjekk om bonustypen er valg for oppdatering
6.11 c                   if        w_tbot <> *blank and
6.11 c                             w_tbot <> ekboty
6.11 c                   goto      no_boty2
6.11 c                   endif
      *
6.12  * Sjekk om bonuselementet er byggende
6.12 c                   if        ekebyg = 1
6.12 c                   goto      no_boty2
6.12 c                   endif
      *
     c                   eval      ekbei2_erka = ekrkat
     c                   eval      ekbei2_ekun = ekkund
     c                   eval      ekbei2_ekpr = ekkpro
     c                   eval      ekbei2_eogr = ekogrp
     c                   eval      ekbei2_ehgr = ekhgrp
     c                   eval      ekbei2_eugr = ekugrp
     c                   eval      ekbei2_eldo = ekldor
     c                   eval      ekbei2_emod = ekmodn
     c                   eval      ekbei2_evar = ekvare
     c                   eval      ekbei2_eenh = ekenhe
     c                   eval      ekbei2_elet = eklety
     c                   eval      ekbei2_ebot = ekboty
     c                   eval      ekbei2_efda = ekfdat
     c                   eval      ekbei2_etda = ektdat
     c     ekbei2_key    setll     ekbei2
     c     ekbei2_key    reade     ekbei2r
     c                   dow       not %eof
      *
     c                   if        ekebgf <= ekbgru
      *
     c                   time                    ekebda
     c                   time                    ekebti
      *
     c                   if        ekebgf = 0 and
     c                             ekebgt = 0
     c                   eval(h)   ekesbo = ekbgru * ekebpr / 100
     c                   update    ekbei2r
     c                   eval      eksbon = eksbon + ekesbo
     c                   leave
     c                   endif
      *
     c                   if        ekebgt < ekbgru
     c                   eval      w_tbel = ekebgt
     c                   else
     c                   eval      w_tbel = ekbgru
     c                   endif
      *
     c                   if        ekektb = 1
     c                   eval(h)   ekesbo = w_tbel * ekebpr / 100
     c                   update    ekbei2r
     c                   eval      eksbon = eksbon + ekesbo
     c                   leave
     c                   endif
      *
     c                   eval(h)   ekesbo = (w_tbel - ekebgf) * ekebpr / 100
      *
     c                   update    ekbei2r
      *
     c                   eval      eksbon = eksbon + ekesbo
      *
     c                   endif
      *
     c     ekbei2_key    reade     ekbei2r
     c                   enddo
      *
     c                   endif
      *
     c                   update    ekboiur
6.11  *
6.11 c     no_boty2      tag
      *
     c     ekboiu_key2   reade     ekboiur
     c                   enddo
6.10  *
6.10  * Kalkulerer bonus pr. bonustype. (nytt register)
6.10  *
6.10 c     ekboiu_key2   setll     ekboi1
6.10 c     ekboiu_key2   reade     ekboi1r
6.10 c                   dow       not %eof
6.11  * Sjekk om bonustypen er valg for oppdatering
6.11 c                   if        w_tbot <> *blank and
6.11 c                             w_tbot <> ekboty
6.11 c                   goto      no_boty3
6.11 c                   endif
6.10  *
6.12  * Sjekk om bonuselementet skal være byggende (1=Nei)
6.12 c                   if        ekebyg = 1
6.12 c                   goto      no_boty3
6.12 c                   endif
6.10  *
6.10 c                   eval      ekbtiu_tbot = ekboty
6.10 c     ekbtiu_key    chain     ekbtiur
6.10 c                   if        %found
6.10 c                   eval      ektsbo = ektsbo + eksbon
6.14 c                   eval      ektbgr = ektbgr + ekbgru
6.13 c                   eval      ektkka = rkkatg
6.10 c                   if        ekbdat > ektbda
6.10 c                   eval      ektbda = ekbdat
6.10 c                   endif
6.10 c                   time                    ekteda
6.10 c                   time                    ekteti
6.10 c                   update    ekbtiur
6.10 c                   endif
6.11  *
6.11 c     no_boty3      tag
6.10  *
6.10 c     ekboiu_key2   reade     ekboi1r
6.10 c                   enddo
6.14  *
6.14  * Sjekk om bousgrunnlaget skal kalkuleres på totalen eller pr element
6.14  *
6.14 c     ekbtir_key    setll     ekbtir
6.14 c     ekbtir_key    reade     ekbtir
6.14 c                   dow       not %eof
6.14  * Sjekk om bonustypen er valg for oppdatering
6.14 c                   if        w_tbot <> *blank and
6.14 c                             w_tbot <> xktbot
6.14 c                   goto      no_boty4
6.14 c                   endif
6.14  *
6.14 c                   eval      vbotl1_tbot = xktbot
6.14 c     vbotl1_key    chain     vbotl1
6.14 c                   if        %found
6.14  * Vatsum = 1, beregne bonus på nytt basert på totaler på avtalen
6.14 c                   if        vatsum = 1
6.14 c                   exsr      sr_kbonus
6.14 c                   endif
6.14 c                   else
6.14  * Summer bonus basert på elementnivå
6.14 c                   exsr      sr_belem
6.14 c                   endif
6.14  * Reduser bonus hvis angitt på bonustypen
6.14 c                   if        vatred <> 0
6.14 c                   exsr      sr_breduk
6.14 c                   endif
6.14  *
6.14 c     no_boty4      tag
6.14  *
6.14 c     ekbtir_key    reade     ekbtir
6.14 c                   enddo
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Oppdaterer salgsstatistkken med andel av bonus pr. salg
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     statistikk    begsr
      *
     c                   if        b_hele = *on
     c     sstalk_key2   setll     sstalk
     c     sstalk_key2   reade     sstalk
     c                   else
     c     sstalk_key    setll     sstalk
     c     sstalk_key    reade     sstalk
     c                   endif
     c                   dow       not %eof
      *
     c                   eval      sfkubo = 0
     c                   eval      w_arnr = 0
     c                   eval      a_boty(*) = *blank
      *
     c                   dou       b_bonu = *off
      *
     c                   exsr      bonusnivÅ
      *
     c                   if        b_bonu = *on
     c                   eval      w_arnr = w_arnr + 1
     c                   eval      a_boty(w_arnr) = ekboty
     c                   eval(h)   w_sumn = sfsumb - sfrab1 - sfrab2 -
7.01 c                                      sfrabo
7.01 c**                                    sfrabo - sfbrk1 - sfbrk2
      *
     c                   if        ekbgru > 0
     c                   eval(h)   sfkubo = sfkubo +
     c                                      eksbon * (w_sumn / ekbgru)
     c                   endif
     c                   eval      sstalu_binr = sfbinr
     c                   eval      sstalu_ornr = sfornr
     c                   eval      sstalu_orsu = sforsu
     c                   eval      sstalu_orli = sforli
     c                   eval      sstalu_bong = sfbong
     c                   eval      sstalu_vare = sfvare
     c                   eval      sstalu_enhe = sfenhe
     c                   eval      sstalu_anta = sfanta
     c                   eval      sstalu_date = sfdate
     c                   eval      sstalu_time = sftime
     c     sstalu_key    chain     sstalur
     c                   eval      sukubo = sfkubo
     c                   update    sstalur
     c                   endif
      *
     c                   enddo
      *
     c                   if        b_hele = *on
     c     sstalk_key2   reade     sstalk
     c                   else
     c     sstalk_key    reade     sstalk
     c                   endif
     c                   enddo
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å finne bonusnivå for vare
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bonusnivÅ     begsr
      *
     c                   eval      b_bonu = *off
      *
      * Avbryter dersom vare er merket med at den ikke skal bonusberegnes
      *
     c                   eval      vvkbon = 0
      *
     c                   eval      vvarl1_vare = sfvare
     c     vvarl1_key    chain     vvarl1
     c                   if        not %found
     c                   eval      vvasl1_vare = sfvare
     c     vvasl1_key    chain     vvasl1
     c                   endif
      *
     c                   if        vvkbon = 1
     c                   leavesr
     c                   endif
6.20  *
6.20  * Hvis perioden er større enn til perioden, skal ikke post være med i grunnlag
6.20  *
6.20 c                   if        sfpmnd > %int(p_peri)
6.20 c                   leavesr
6.20 c                   endif
6.21  *
6.21  * Hvis perioden er mindre enn fra perioden, skal ikke post være med i grunnlag
6.21  *
6.21 c                   if        sfpmnd < %int(p_fper)
6.21 c                   leavesr
6.21 c                   endif
      *
      * Ved testing mot nivå hvor kunde/kundeprosjekt er utfylt, benyttes
      * varekunde fra statistikken. Ved testing mot andre nivåer benyttes
      * fakturakunde
      *
      * Nivårekkefølge:
      *
      *  Rabattkategori
      *    Kunde
      *      Kundeprosjekt
      *        Overgruppe
      *          Hovedgruppe
      *            Undergruppe
      *              Leverandør
      *                Modul
      *                  Vare
      *                    Enhet
      *                      Leveringstype
      *  _____________________
      *  - x x - - - - - x x x    1. Kunde,prosj,vare,enh,lt
      *  - x x - - - - - x - x    2. Kunde,prosj,vare,lt
      *  - x x - - - - - x x 0    3. Kunde,prosj,vare,enh,lt=0
      *  - x x - - - - - x - 0    4. Kunde,prosj,vare,lt=0
      *  - x x - - - - x - x x    5. Kunde,prosj,modul,enh,lt
      *  - x x - - - - x - - x    6. Kunde,prosj,modul,lt
      *  - x x - - - - x - x 0    7. Kunde,prosj,modul,enh,lt=0
      *  - x x - - - - x - - 0    8. Kunde,prosj,modul,lt=0
      *  - x x x x x x - - x x    9. Kunde,prosj,ogr,hgr,ugr,lev,enh,lt
      *  - x x x x x x - - - x   10. Kunde,prosj,ogr,hgr,ugr,lev,lt
      *  - x x x x x x - - x 0   11. Kunde,prosj,ogr,hgr,ugr,lev,enh,lt=0
      *  - x x x x x x - - - 0   12. Kunde,prosj,ogr,hgr,ugr,lev,lt=0
      *  - x x x x - x - - x x   13. Kunde,prosj,ogr,hgr,lev,enh,lt
      *  - x x x x - x - - - x   14. Kunde,prosj,ogr,hgr,lev,lt
      *  - x x x x - x - - x 0   15. Kunde,prosj,ogr,hgr,lev,enh,lt=0
      *  - x x x x - x - - - 0   16. Kunde,prosj,ogr,hgr,lev,lt=0
      *  - x x x - - x - - x x   17. Kunde,prosj,ogr,lev,enh,lt
      *  - x x x - - x - - - x   18. Kunde,prosj,ogr,lev,lt
      *  - x x x - - x - - x 0   19. Kunde,prosj,ogr,lev,enh,lt=0
      *  - x x x - - x - - - 0   20. Kunde,prosj,ogr,lev,lt=0
      *  - x x - - - x - - x x   21. Kunde,prosj,lev,enh,lt
      *  - x x - - - x - - - x   22. Kunde,prosj,lev,lt
      *  - x x - - - x - - x 0   23. Kunde,prosj,lev,enh,lt=0
      *  - x x - - - x - - - 0   24. Kunde,prosj,lev,lt=0
      *  - x x x x x - - - x x   25. Kunde,prosj,ogr,hgr,ugr,enh,lt
      *  - x x x x x - - - - x   26. Kunde,prosj,ogr,hgr,ugr,lt
      *  - x x x x x - - - x 0   27. Kunde,prosj,ogr,hgr,ugr,enh,lt=0
      *  - x x x x x - - - - 0   28. Kunde,prosj,ogr,hgr,ugr,lt=0
      *  - x x x x - - - - x x   29. Kunde,prosj,ogr,hgr,enh,lt
      *  - x x x x - - - - - x   30. Kunde,prosj,ogr,hgr,lt
      *  - x x x x - - - - x 0   31. Kunde,prosj,ogr,hgr,enh,lt=0
      *  - x x x x - - - - - 0   32. Kunde,prosj,ogr,hgr,lt=0
      *  - x x x - - - - - x x   33. Kunde,prosj,ogr,enh,lt
      *  - x x x - - - - - - x   34. Kunde,prosj,ogr,lt
      *  - x x x - - - - - x 0   35. Kunde,prosj,ogr,enh,lt=0
      *  - x x x - - - - - - 0   36. Kunde,prosj,ogr,lt=0
      *  - x x - - - - - - x x   37. Kunde,prosj,enh,lt
      *  - x x - - - - - - - x   38. Kunde,prosj,lt
      *  - x x - - - - - - x 0   39. Kunde,prosj,enh,lt=0
      *  - x x - - - - - - - 0   40. Kunde,prosj,lt=0

      *  - x - - - - - - x x x   41. Kunde,vare,enh,lt
      *  - x - - - - - - x - x   42. Kunde,vare,lt
      *  - x - - - - - - x x 0   43. Kunde,vare,enh,lt=0
      *  - x - - - - - - x - 0   44. Kunde,vare,lt=0
      *  - x - - - - - x - x x   45. Kunde,modul,enh,lt
      *  - x - - - - - x - - x   46. Kunde,modul,lt
      *  - x - - - - - x - x 0   47. Kunde,modul,enh,lt=0
      *  - x - - - - - x - - 0   48. Kunde,modul,lt=0
      *  - x - x x x x - - x x   49. Kunde,ogr,hgr,ugr,lev,enh,lt
      *  - x - x x x x - - - x   50. Kunde,ogr,hgr,ugr,lev,lt
      *  - x - x x x x - - x 0   51. Kunde,ogr,hgr,ugr,lev,enh,lt=0
      *  - x - x x x x - - - 0   52. Kunde,ogr,hgr,ugr,lev,lt=0
      *  - x - x x - x - - x x   53. Kunde,ogr,hgr,lev,enh,lt
      *  - x - x x - x - - - x   54. Kunde,ogr,hgr,lev,lt
      *  - x - x x - x - - x 0   55. Kunde,ogr,hgr,lev,enh,lt=0
      *  - x - x x - x - - - 0   56. Kunde,ogr,hgr,lev,lt=0
      *  - x - x - - x - - x x   57. Kunde,ogr,lev,enh,lt
      *  - x - x - - x - - - x   58. Kunde,ogr,lev,lt
      *  - x - x - - x - - x 0   59. Kunde,ogr,lev,enh,lt=0
      *  - x - x - - x - - - 0   60. Kunde,ogr,lev,lt=0
      *  - x - - - - x - - x x   61. Kunde,lev,enh,lt
      *  - x - - - - x - - - x   62. Kunde,lev,lt
      *  - x - - - - x - - x 0   63. Kunde,lev,enh,lt=0
      *  - x - - - - x - - - 0   64. Kunde,lev,lt=0
      *  - x - x x x - - - x x   65. Kunde,ogr,hgr,ugr,enh,lt
      *  - x - x x x - - - - x   66. Kunde,ogr,hgr,ugr,lt
      *  - x - x x x - - - x 0   67. Kunde,ogr,hgr,ugr,enh,lt=0
      *  - x - x x x - - - - 0   68. Kunde,ogr,hgr,ugr,lt=0
      *  - x - x x - - - - x x   69. Kunde,ogr,hgr,enh,lt
      *  - x - x x - - - - - x   70. Kunde,ogr,hgr,lt
      *  - x - x x - - - - x 0   71. Kunde,ogr,hgr,enh,lt=0
      *  - x - x x - - - - - 0   72. Kunde,ogr,hgr,lt=0
      *  - x - x - - - - - x x   73. Kunde,ogr,enh,lt
      *  - x - x - - - - - - x   74. Kunde,ogr,lt
      *  - x - x - - - - - x 0   75. Kunde,ogr,enh,lt=0
      *  - x - x - - - - - - 0   76. Kunde,ogr,lt=0
      *  - x - - - - - - - x x   77. Kunde,enh,lt
      *  - x - - - - - - - - x   78. Kunde,lt
      *  - x - - - - - - - x 0   79. Kunde,enh,lt=0
      *  - x - - - - - - - - 0   80. Kunde,lt=0

      *  x - - - - - - - x x x   81. Rab.kat,vare,enh,lt
      *  x - - - - - - - x - x   82. Rab.kat,vare,lt
      *  x - - - - - - - x x 0   83. Rab.kat,vare,enh,lt=0
      *  x - - - - - - - x - 0   84. Rab.kat,vare,lt=0
      *  x - - - - - - x - x x   85. Rab.kat,modul,enh,lt
      *  x - - - - - - x - - x   86. Rab.kat,modul,lt
      *  x - - - - - - x - x 0   87. Rab.kat,modul,enh,lt=0
      *  x - - - - - - x - - 0   88. Rab.kat,modul,lt=0
      *  x - - x x x x - - x x   89. Rab.kat,ogr,hgr,ugr,lev,enh,lt
      *  x - - x x x x - - - x   90. Rab.kat,ogr,hgr,ugr,lev,lt
      *  x - - x x x x - - x 0   91. Rab.kat,ogr,hgr,ugr,lev,enh,lt=0
      *  x - - x x x x - - - 0   92. Rab.kat,ogr,hgr,ugr,lev,lt=0
      *  x - - x x - x - - x x   93. Rab.kat,ogr,hgr,lev,enh,lt
      *  x - - x x - x - - - x   94. Rab.kat,ogr,hgr,lev,lt
      *  x - - x x - x - - x 0   95. Rab.kat,ogr,hgr,lev,enh,lt=0
      *  x - - x x - x - - - 0   96. Rab.kat,ogr,hgr,lev,lt=0
      *  x - - x - - x - - x x   97. Rab.kat,ogr,lev,enh,lt
      *  x - - x - - x - - - x   98. Rab.kat,ogr,lev,lt
      *  x - - x - - x - - x 0   99. Rab.kat,ogr,lev,enh,lt=0
      *  x - - x - - x - - - 0  100. Rab.kat,ogr,lev,lt=0
      *  x - - - - - x - - x x  101. Rab.kat,lev,enh,lt
      *  x - - - - - x - - - x  102. Rab.kat,lev,lt
      *  x - - - - - x - - x 0  103. Rab.kat,lev,enh,lt=0
      *  x - - - - - x - - - 0  104. Rab.kat,lev,lt=0
      *  x - - x x x - - - x x  105. Rab.kat,ogr,hgr,ugr,enh,lt
      *  x - - x x x - - - - x  106. Rab.kat,ogr,hgr,ugr,lt
      *  x - - x x x - - - x 0  107. Rab.kat,ogr,hgr,ugr,enh,lt=0
      *  x - - x x x - - - - 0  108. Rab.kat,ogr,hgr,ugr,lt=0
      *  x - - x x - - - - x x  109. Rab.kat,ogr,hgr,enh,lt
      *  x - - x x - - - - - x  110. Rab.kat,ogr,hgr,lt
      *  x - - x x - - - - x 0  111. Rab.kat,ogr,hgr,enh,lt=0
      *  x - - x x - - - - - 0  112. Rab.kat,ogr,hgr,lt=0
      *  x - - x - - - - - x x  113. Rab.kat,ogr,enh,lt
      *  x - - x - - - - - - x  114. Rab.kat,ogr,lt
      *  x - - x - - - - - x 0  115. Rab.kat,ogr,enh,lt=0
      *  x - - x - - - - - - 0  116. Rab.kat,ogr,lt=0
      *  x - - - - - - - - x x  117. Rab.kat,enh,lt
      *  x - - - - - - - - - x  118. Rab.kat,lt
      *  x - - - - - - - - x 0  119. Rab.kat,enh,lt=0
      *  x - - - - - - - - - 0  120. Rab.kat,lt=0
      *
      *  - - - - - - - - x x x  121. Vare,enh,lt
      *  - - - - - - - - x - x  122. Vare,lt
      *  - - - - - - - - x x 0  123. Vare,enh,lt=0
      *  - - - - - - - - x - 0  124. Vare,lt=0
      *  - - - - - - - x - x x  125. Modul,enh,lt
      *  - - - - - - - x - - x  126. Modul,lt
      *  - - - - - - - x - x 0  127. Modul,enh,lt=0
      *  - - - - - - - x - - 0  128. Modul,lt=0
      *  - - - x x x x - - x x  129. Ogr,hgr,ugr,lev,enh,lt
      *  - - - x x x x - - - x  130. Ogr,hgr,ugr,lev,lt
      *  - - - x x x x - - x 0  131. Ogr,hgr,ugr,lev,enh,lt=0
      *  - - - x x x x - - - 0  132. Ogr,hgr,ugr,lev,lt=0
      *  - - - x x - x - - x x  133. Ogr,hgr,lev,enh,lt
      *  - - - x x - x - - - x  134. Ogr,hgr,lev,lt
      *  - - - x x - x - - x 0  135. Ogr,hgr,lev,enh,lt=0
      *  - - - x x - x - - - 0  136. Ogr,hgr,lev,lt=0
      *  - - - x - - x - - x x  137. Ogr,lev,enh,lt
      *  - - - x - - x - - - x  138. Ogr,lev,lt
      *  - - - x - - x - - x 0  139. Ogr,lev,enh,lt=0
      *  - - - x - - x - - - 0  140. Ogr,lev,lt=0
      *  - - - - - - x - - x x  141. Lev,enh,lt
      *  - - - - - - x - - - x  142. Lev,lt
      *  - - - - - - x - - x 0  143. Lev,enh,lt=0
      *  - - - - - - x - - - 0  144. Lev,lt=0
      *  - - - x x x - - - x x  145. Ogr,hgr,ugr,enh,lt
      *  - - - x x x - - - - x  146. Ogr,hgr,ugr,lt
      *  - - - x x x - - - x 0  147. Ogr,hgr,ugr,enh,lt=0
      *  - - - x x x - - - - 0  148. Ogr,hgr,ugr,lt=0
      *  - - - x x - - - - x x  149. Ogr,hgr,enh,lt
      *  - - - x x - - - - - x  150. Ogr,hgr,lt
      *  - - - x x - - - - x 0  151. Ogr,hgr,enh,lt=0
      *  - - - x x - - - - - 0  152. Ogr,hgr,lt=0
      *  - - - x - - - - - x x  153. Ogr,enh,lt
      *  - - - x - - - - - - x  154. Ogr,lt
      *  - - - x - - - - - x 0  155. Ogr,enh,lt=0
      *  - - - x - - - - - - 0  156. Ogr,lt=0
      *  - - - - - - - - - x x  157. Enh,lt
      *  - - - - - - - - - - x  158. Lt
      *  - - - - - - - - - x 0  159. Enh,lt=0
      *  - - - - - - - - - - 0  160. Lt=0
      *
      * Kunde/kundeprosjekt...
      *
     c                   if        sfvkun <> 0 and
     c                             sfkpro <> 0
      *
      * 1.-4.
      *
     c                   eval      ekboi1_rkat = 0
     c                   eval      ekboi1_kund = sfvkun
     c                   eval      ekboi1_kpro = sfkpro
     c                   eval      ekboi1_ogrp = 0
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = sfvare
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 5.-8.
      *
     c                   if        sfmodn <> 0
      *
     c                   eval      ekboi1_modn = sfmodn
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 9.-12.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = sfugrp
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 13.-16.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 17.-20.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 21.-24.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = 0
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 25.-28.
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = sfugrp
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 29.-32.
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 33.-36.
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 37.-40.
      *
     c                   eval      ekboi1_ogrp = 0
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * Kunde...
      *
     c                   if        sfvkun <> 0
      *
      * 41.-44.
      *
     c                   eval      ekboi1_rkat = 0
     c                   eval      ekboi1_kund = sfvkun
     c                   eval      ekboi1_kpro = 0
     c                   eval      ekboi1_ogrp = 0
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = sfvare
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 45.-48.
      *
     c                   if        sfmodn <> 0
      *
     c                   eval      ekboi1_modn = sfmodn
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 49.-52.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = sfugrp
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 53.-56.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 57.-60.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 61.-64.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = 0
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 65.-68.
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = sfugrp
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 69.-72.
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 73.-76.
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 77.-80.
      *
     c                   eval      ekboi1_ogrp = 0
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * Rabattkategori...
      *
     c                   if        sfrkat <> 0
      *
      * 81.-84.
      *
     c                   eval      ekboi1_rkat = sfrkat
     c                   eval      ekboi1_kund = 0
     c                   eval      ekboi1_kpro = 0
     c                   eval      ekboi1_ogrp = 0
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = sfvare
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 85.-88.
      *
     c                   if        sfmodn <> 0
      *
     c                   eval      ekboi1_modn = sfmodn
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 89.-92.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = sfugrp
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 93.-96.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 97.-100.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 101.-104.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = 0
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 105.-108.
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = sfugrp
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 109.-112.
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 113.-116.
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 117.-120.
      *
     c                   eval      ekboi1_ogrp = 0
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * Generell...
      * Behandler kun salg mot bonuskunde som fakturakunde
      *
     c                   if        sffkun <> w_bkun
     c                   leavesr
     c                   endif
      *
      * 121.-124.
      *
     c                   eval      ekboi1_rkat = 0
     c                   eval      ekboi1_kund = 0
     c                   eval      ekboi1_kpro = 0
     c                   eval      ekboi1_ogrp = 0
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = sfvare
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 125.-128.
      *
     c                   if        sfmodn <> 0
      *
     c                   eval      ekboi1_modn = sfmodn
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 129.-132.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = sfugrp
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 133.-136.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 137.-140.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 141.-144.
      *
     c                   if        sfldor <> 0
      *
     c                   eval      ekboi1_ogrp = 0
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = sfldor
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endif
      *
      * 145.-148.
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = sfugrp
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 149.-152.
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = sfhgrp
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 153.-156.
      *
     c                   eval      ekboi1_ogrp = sfogrp
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
      * 157.-160.
      *
     c                   eval      ekboi1_ogrp = 0
     c                   eval      ekboi1_hgrp = 0
     c                   eval      ekboi1_ugrp = 0
     c                   eval      ekboi1_ldor = 0
     c                   eval      ekboi1_modn = 0
     c                   eval      ekboi1_vare = *blank
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = sflety
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   if        sflety <> 0
      *
     c                   eval      ekboi1_enhe = sfenhe
     c                   eval      ekboi1_lety = 0
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   eval      ekboi1_enhe = *blank
     c     ekboi1_key    setll     ekboi1
     c     ekboi1_key    reade     ekboi1
     c                   dow       not %eof
     c                   if        ekfdat = *loval and
     c                             ektdat = *loval or
     c                             sfbida >= ekfdat and
     c                             sfbida <= ektdat
     c                   if        %lookup(ekboty:a_boty) = 0
     c                   eval      b_bonu = *on
     c                   leavesr
     c                   endif
     c                   endif
     c     ekboi1_key    reade     ekboi1
     c                   enddo
      *
     c                   endif
      *
     c                   endsr
6.14  *
6.14  *----------------------------------------------------------------------------
6.14  * Sjekker om bonusen skal kalkuleres basert på totaler eller ikke           *
6.14  *----------------------------------------------------------------------------
6.14 c     sr_kbonus     begsr
6.14  *
6.14  * Kalkulerer bonusandel for totaler
6.14  * Takler ikke overlappende beløpsgrenser
6.14  *
6.14 c                   eval      ekbtiu_tbot = xktbot
6.14 c                   eval      ekbsir_sbot = xktbot
6.14 c                   eval      ekbsir_saar=%subdt(xktbda:*years)
6.14 c     ekbsir_key    setll     ekbsir
6.14 c     ekbsir_key    reade     ekbsirr
6.14 c                   dow       not %eof
6.14  *
6.14 c                   if        eksbgf <= xktbgr
6.14  *
6.14 c                   if        eksbgf = 0 and
6.14 c                             eksbgt = 0
6.14 c     ekbtiu_key    chain     ekbtiu
6.14 c                   if        %found
6.14 c                   eval(h)   ektsbo = xktbgr * eksbpr / 100
6.14 c                   time                    ektbda
6.14 c                   time                    ekteda
6.14 c                   time                    ekteti
6.14 c                   eval      ekteus = l_user
6.14 c                   update    ekbtiur
6.14 c                   leave
6.14 c                   endif
6.14 c                   endif
6.14  *
6.14 c                   if        eksbgt < xktbgr
6.14 c                   eval      w_tbel = eksbgt
6.14 c                   else
6.14 c                   eval      w_tbel = xktbgr
6.14 c                   endif
6.14  *
6.14 c                   if        eksktb = 1
6.14 c                   eval(h)   w_bonu = w_tbel * eksbpr / 100
6.14 c     ekbtiu_key    chain     ekbtiu
6.14 c                   if        %found
6.14 c                   eval      ektsbo = w_bonu
6.14 c                   time                    ektbda
6.14 c                   time                    ekteda
6.14 c                   time                    ekteti
6.14 c                   eval      ekteus = l_user
6.14 c                   update    ekbtiur
6.14 c                   endif
6.14 c                   else
6.14 c                   eval(h)   w_bonu = (w_tbel - eksbgf) * eksbpr / 100
6.14 c     ekbtiu_key    chain     ekbtiu
6.14 c                   if        %found
6.14 c                   eval      ektsbo = ektsbo + w_bonu
6.14 c                   time                    ektbda
6.14 c                   time                    ekteda
6.14 c                   time                    ekteti
6.14 c                   eval      ekteus = l_user
6.14 c                   update    ekbtiur
6.14 c                   endif
6.14 c                   endif
6.14  *
6.14 c                   endif
6.14  *
6.14 c     ekbsir_key    reade     ekbsirr
6.14 c                   enddo
6.14  *
6.14 c                   endsr
6.14  *
6.14  *----------------------------------------------------------------------------
6.14  * Reduserer bonus med prosent. Skal dekkke frakt osv                        *
6.14  *----------------------------------------------------------------------------
6.14 c     sr_breduk     begsr
6.14  *
6.14  * Finner beløp for reduksjon av bonus
6.14  *
6.14 c                   eval      ekbtiu_tbot = xktbot
6.14 c     ekbtiu_key    chain     ekbtiu
6.14 c                   if        %found
6.14 c                   eval(h)   w_bonu = ektsbo * vatred / 100
6.14 c                   eval      ektsbo = ektsbo - w_bonu
6.14 c                   time                    ektbda
6.14 c                   time                    ekteda
6.14 c                   time                    ekteti
6.14 c                   eval      ekteus = l_user
6.14 c                   update    ekbtiur
6.14 c                   endif
6.14  *
6.14 c                   endsr
6.14  *
6.14  *----------------------------------------------------------------------------
6.14  * Summerer opp bonus pr element til EKBOTST                                 *
6.14  *----------------------------------------------------------------------------
6.14 c     sr_belem      begsr
6.14  *
6.14  * Summer opp allle elementer
6.14  *
6.14 c                   eval      w_bonu = 0
6.14 c                   eval      w_bgrl = 0
6.14 c                   eval      ekboic_boty = xktbot
6.14 c     ekboic_key    setll     ekboic
6.14 c     ekboic_key    reade     ekboicr
6.14 c                   dow       not %eof
6.14  *
6.14 c                   if        ekbgru <> 0 or
6.14 c                             eksbon <> 0
6.14 c                   eval      w_bonu = w_bonu + eksbon
6.14 c                   eval      w_bgrl = w_bgrl + ekbgru
6.14 c                   endif
6.14  *
6.14 c     ekboic_key    reade     ekboicr
6.14 c                   enddo
6.14  *
6.14  * Oppdaterer beløpene på bonustype pr kunde
6.14  *
6.14 c                   eval      ekbtiu_tbot = xktbot
6.14 c     ekbtiu_key    chain     ekbtiu
6.14 c                   if        %found
6.14 c                   eval(h)   ektsbo = w_bonu
6.14 c                   eval      ektbgr = w_bgrl
6.14 c                   time                    ektbda
6.14 c                   time                    ekteda
6.14 c                   time                    ekteti
6.14 c                   eval      ekteus = l_user
6.14 c                   update    ekbtiur
6.14 c                   endif
6.14  *
6.14 c                   endsr
6.14  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_bkun
     c                   parm                    p_paar
     c                   parm                    p_tbot
6.21 c                   parm                    p_fper
6.20 c                   parm                    p_peri
     c                   parm                    p_inlr
      *
      * Key for les på kundebonus
      *
     c     ekboi1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_bkun
     c                   kfld                    ekboi1_rkat
     c                   kfld                    ekboi1_kund
     c                   kfld                    ekboi1_kpro
     c                   kfld                    ekboi1_ogrp
     c                   kfld                    ekboi1_hgrp
     c                   kfld                    ekboi1_ugrp
     c                   kfld                    ekboi1_ldor
     c                   kfld                    ekboi1_modn
     c                   kfld                    ekboi1_vare
     c                   kfld                    ekboi1_enhe
     c                   kfld                    ekboi1_lety
      *
     c     ekboi1_key2   klist
     c                   kfld                    w_firm
     c                   kfld                    w_bkun
      *
      * Key for oppdatering av kundebonus
      *
     c     ekboiu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_bkun
     c                   kfld                    ekboiu_rkat
     c                   kfld                    ekboiu_kund
     c                   kfld                    ekboiu_kpro
     c                   kfld                    ekboiu_ogrp
     c                   kfld                    ekboiu_hgrp
     c                   kfld                    ekboiu_ugrp
     c                   kfld                    ekboiu_ldor
     c                   kfld                    ekboiu_modn
     c                   kfld                    ekboiu_vare
     c                   kfld                    ekboiu_enhe
     c                   kfld                    ekboiu_lety
     c                   kfld                    ekboiu_boty
     c                   kfld                    ekboiu_fdat
     c                   kfld                    ekboiu_tdat
      *
     c     ekboiu_key2   klist
     c                   kfld                    w_firm
     c                   kfld                    w_bkun
      *
      * Key for oppdatering av kundebonus-element
      *
     c     ekbei2_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_bkun
     c                   kfld                    ekbei2_erka
     c                   kfld                    ekbei2_ekun
     c                   kfld                    ekbei2_ekpr
     c                   kfld                    ekbei2_eogr
     c                   kfld                    ekbei2_ehgr
     c                   kfld                    ekbei2_eugr
     c                   kfld                    ekbei2_eldo
     c                   kfld                    ekbei2_emod
     c                   kfld                    ekbei2_evar
     c                   kfld                    ekbei2_eenh
     c                   kfld                    ekbei2_elet
     c                   kfld                    ekbei2_ebot
     c                   kfld                    ekbei2_efda
     c                   kfld                    ekbei2_etda
6.10  *
6.10  * Key for oppdatering av kundebonus-element
6.10  *
6.10 c     ekbtiu_key    klist
6.10 c                   kfld                    w_firm
6.10 c                   kfld                    w_bkun
6.10 c                   kfld                    ekbtiu_tbot
6.10  *
6.10 c     ekbtiu_key2   klist
6.10 c                   kfld                    w_firm
6.10 c                   kfld                    w_bkun
6.14  *
6.14  * Key for oppdatering av kundebonus totaler
6.14  *
6.14 c     ekbtir_key    klist
6.14 c                   kfld                    w_firm
6.14 c                   kfld                    w_bkun
6.14  *
6.14  * Key for oppslag mot bonustyper
6.14  *
6.14 c     vbotl1_key    klist
6.14 c                   kfld                    w_firm
6.14 c                   kfld                    vbotl1_tbot
6.14  *
6.14  * Key for oppdatering av kundebonus totaler
6.14  *
6.14 c     ekbsir_key    klist
6.14 c                   kfld                    w_firm
6.14 c                   kfld                    ekbsir_sbot
6.14 c                   kfld                    ekbsir_saar
6.14  *
6.14 c     ekboic_key    klist
6.14 c                   kfld                    w_firm
6.14 c                   kfld                    w_bkun
6.14 c                   kfld                    ekboic_boty
      *
     c     ekbeiu_key2   klist
     c                   kfld                    w_firm
     c                   kfld                    w_bkun
      *
      * Key for oppslag på vare
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarl1_vare
      *
      * Key for oppslag på vare-slettet
      *
     c     vvasl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvasl1_vare
      *
      * Key for les på salgsstatistikk
      *
     c     sstalk_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_paar
     c                   kfld                    w_bkun
      *
     c     sstalk_key2   klist
     c                   kfld                    w_firm
     c                   kfld                    w_paar
      *
      * Key for oppdatering av salgsstaistikk
      *
     c     sstalu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_paar
     c                   kfld                    sstalu_binr
     c                   kfld                    sstalu_ornr
     c                   kfld                    sstalu_orsu
     c                   kfld                    sstalu_orli
     c                   kfld                    sstalu_bong
     c                   kfld                    sstalu_vare
     c                   kfld                    sstalu_enhe
     c                   kfld                    sstalu_anta
     c                   kfld                    sstalu_date
     c                   kfld                    sstalu_time
6.13  *
6.13 c     rkunl1_key    klist
6.13 c                   kfld                    w_firm
6.13 c                   kfld                    rkunl1_kund
      *
     c                   endsr
