     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : EK750R
      * Beskrivelse . . : Kunde bonus, sjekk om bonus
      *
      *                   Returnerer flagg dersom fakturakunde, varekunde
      *                   eller kundeprosjekt inngår i en bonusavtale
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       271005 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fekboi1    if   e           k disk    rename(ekbost:ekboi1r)
     fekboid    if   e           k disk    rename(ekbost:ekboidr)
      *
      * Definering av parametre
      *
     d p_firm          s                   like(ekfirm)
     d p_bkun          s                   like(ekbkun)
     d p_kund          s                   like(ekkund)
     d p_kpro          s                   like(ekkpro)
     d p_bonu          s              1
      *
      * Definering av variabler i nøkler
      *
     d ekboi1_bkun     s                   like(ekbkun)
     d ekboid_kund     s                   like(ekkund)
     d ekboid_kpro     s                   like(ekkpro)
      *
      * Definering av variable
      *
     d w_firm          s                   like(ekfirm)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Initierer output-parameter
      *
     c                   eval      p_bonu = *off
      *
      * Leter etter bonusavtale
      *
     c                   eval      ekboi1_bkun = p_bkun
     c     ekboi1_key    chain     ekboi1
     c                   if        %found
     c                   eval      p_bonu = *on
     c                   goto      avslutt
     c                   endif
      *
     c                   if        p_kund <> 0
      *
     c                   eval      ekboid_kund = p_kund
     c                   eval      ekboid_kpro = p_kpro
     c     ekboid_key    chain     ekboid
     c                   if        %found
     c                   eval      p_bonu = *on
     c                   goto      avslutt
     c                   endif
      *
     c                   if        p_kpro <> 0
     c                   eval      ekboid_kund = p_kund
     c                   eval      ekboid_kpro = 0
     c     ekboid_key    chain     ekboid
     c                   if        %found
     c                   eval      p_bonu = *on
     c                   goto      avslutt
     c                   endif
     c                   endif
      *
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_bkun
     c                   parm                    p_kund
     c                   parm                    p_kpro
     c                   parm                    p_bonu
      *
      * Key for oppslag på kundebonus
      *
     c     ekboi1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ekboi1_bkun
      *
     c     ekboid_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ekboid_kund
     c                   kfld                    ekboid_kpro
      *
      *
      * Henter firma fra parameter
      *
     c                   eval      w_firm = p_firm
      *
     c                   endsr
