     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : EM102R
      * Beskrivelse . . : Bonuselementer, vedlikehold av mal
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       160611 bsa  Nytt program
6.20  *       210212 bsa  Fjernet Mestergruppen tilpasning
6.21  *       081113 bsa  Tilbakeført funksjonalitet for leveringstype
6.22  *       221113 bsa  Henter datointervall fra malen ved opprettelse
6.22  *                   av nye elementer.
6.23  *       130114 bsa  Initiering av skjermbilde feiler ved vedlike-e
6.23  *                   hold.                                        e
6.30  *       160816 bsa  Sjekker også mot vareadm, når den sjekker varer
6.30  *                   i modul.
7.xx  * 7.00  110316 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      *       LR = Avslutt program
      *       10 = Rollup
      *       11 = Rolldown
      *       12 = Sfldsp
      *       13 = Sfldspctl
      *       14 = Sflclr
      *       15 = Sflend
      *       21 = Home-key
      *       22 = Plassering av cursor
      *       30 = Protect av felter ved vise
      *    31-79 = Varsle m/feilmeldinger/skjermindikatorer
      *    80-99 = Arbeidsindikatorer
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fembhi1    if   e           k disk    rename(embhst:embhi1r)
     fembeir    if   e           k disk    rename(embest:embeirr)
     fembeiu    uf a e           k disk    rename(embest:embeiur)
     fembdiu    uf a e           k disk    rename(embdst:embdiur)
     fembei1    if   e           k disk    rename(embest:embei1r)
     fra11l1    if   e           k disk    rename(ra11pfr:ra11l1r)
     fvogrl1    if   e           k disk    rename(vogrpfr:vogrl1r)
     fvhgrl1    if   e           k disk    rename(vhgrpfr:vhgrl1r)
     fvugrl1    if   e           k disk    rename(vugrpfr:vugrl1r)
     frlevl1    if   e           k disk    rename(rlevpfr:rlevl1r)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     fvvarlb    if   e           k disk    rename(vvarpfr:vvarlbr)
     fvenhl1    if   e           k disk    rename(venhpfr:venhl1r)
     fvltpl1    if   e           k disk    rename(vltppfr:vltpl1r)
     fvbotl1    if   e           k disk    rename(vbotpfr:vbotl1r)
     fjvarl1    if   e           k disk    rename(jvarpfr:jvarl1r)
6.30 fjvarlg    if   e           k disk    rename(jvarpfr:jvarlgr)
6.20 f*xhlvst    if   e           k disk    rename(xhlvst:xhlvstr)
      *
     fem102d    cf   e             workstn sfile(b1sfl:w_srrn)
     f                                     infds(dspfbk)
      *
      * Definering av parametre
      *
     d p_firm          s                   like(emefir)
     d p_bbot          s                   like(emebot)
     d p_bmnr          s                   like(ememnr)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_fnav                951    980
      *
      * Definering av Information Data Structure - display feedback
      *
     d dspfbk          ds
     d  d_fcrn               378    379I 0
      *
      * Definering av variable i nøkler
      *
     d embhi1_hbot     s                   like(emhbot)
     d embhi1_hmnr     s                   like(emhmnr)
     d embei1_eogr     s                   like(emeogr)
     d embei1_ehgr     s                   like(emehgr)
     d embei1_eugr     s                   like(emeugr)
     d embei1_eldo     s                   like(emeldo)
     d embei1_emod     s                   like(ememod)
     d embei1_evar     s                   like(emevar)
     d embei1_eenh     s                   like(emeenh)
     d embei1_elet     s                   like(emelet)
     d embei1_efda     s                   like(emefda)
     d embei1_etda     s                   like(emetda)
      *
     d embeiu_eogr     s                   like(emeogr)
     d embeiu_ehgr     s                   like(emehgr)
     d embeiu_eugr     s                   like(emeugr)
     d embeiu_eldo     s                   like(emeldo)
     d embeiu_emod     s                   like(ememod)
     d embeiu_evar     s                   like(emevar)
     d embeiu_eenh     s                   like(emeenh)
     d embeiu_elet     s                   like(emelet)
     d embeiu_efda     s                   like(emefda)
     d embeiu_etda     s                   like(emetda)
     d ra11l1_kkod     s                   like(rakkod)
     d vogrl1_oogr     s                   like(vgoogr)
     d vhgrl1_hogr     s                   like(vghogr)
     d vhgrl1_hhgr     s                   like(vghhgr)
     d vugrl1_uogr     s                   like(vguogr)
     d vugrl1_uhgr     s                   like(vguhgr)
     d vugrl1_uugr     s                   like(vguugr)
     d rlevl1_levr     s                   like(rllevr)
     d vvarl1_vare     s                   like(vvvare)
     d vvarlb_nmod     s                   like(vvnmod)
     d venhl1_enhe     s                   like(vaeenh)
     d vltpl1_lety     s                   like(vylety)
     d vbotl1_tbot     s                   like(vatbot)
     d jvarl1_vare     s                   like(jvvare)
6.30 d jvarlg_modn     s                   like(jvmodn)
      *
      * Definering av variable
      *
     d w_fcrn          s              4  0
     d w_stel          s              4  0
     d w_spge          s              4  0
     d w_srrn          s              4  0
     d w_sfrn          s                   like(w_srrn)
     d w_ssrn          s                   like(w_srrn)
      *
     d w_seqe          s              1
     d b_forn          s              1    inz(*off)
     d b_oppr          s              1    inz(*off)
     d b_anul          s              1    inz(*off)
     d b_feil          s              1    inz(*off)
      *
     d w_fdat_iso      s               d   datfmt(*iso)
     d w_tdat_iso      s               d   datfmt(*iso)
      *
     d w_fdat          s              6  0
     d w_tdat          s              6  0
     d w_mtxt          s             35
      *
     d w_firm          s                   like(emefir)
     d w_bbot          s                   like(emebot)
     d w_bmnr          s                   like(ememnr)
     d w_ogrp          s                   like(emeogr)
     d w_hgrp          s                   like(emehgr)
     d w_ugrp          s                   like(emeugr)
     d w_ldor          s                   like(emeldo)
     d w_modn          s                   like(ememod)
     d w_vare          s                   like(emevar)
     d w_enhe          s                   like(emeenh)
     d x_enhe          s                   like(emeenh)
     d w_lety          s                   like(emelet)
     d x_lety          s                   like(emelet)
     d w_gtxt          s                   like(vgutxt)
     d w_lnav          s                   like(rlnavn)
     d w_vtxt          s                   like(vvtek1)
     d w_etxt          s                   like(vaetxt)
     d w_ltxt          s                   like(vybesk)
     d w_btxt          s                   like(vatbes)
     d w_merk          s                   like(ememrk)
      *
     d s_bbot          s                   like(emebot)
     d s_bmnr          s                   like(ememnr)
     d s_ogrp          s                   like(emeogr)
     d s_hgrp          s                   like(emehgr)
     d s_ugrp          s                   like(emeugr)
     d s_ldor          s                   like(emeldo)
     d s_modn          s                   like(ememod)
     d s_vare          s                   like(emevar)
     d s_enhe          s                   like(emeenh)
     d s_lety          s                   like(emelet)
     d s_fdat          s              6  0
     d s_tdat          s              6  0
      *
     d t_firm          s                   like(emefir)
      *
      * Definering av konstanter
      *
     d c_sfil          s              2  0 inz(13)
      *
      * Forklaring på spesielle felter
      * som benyttes ved sub-files.
      * - - - - - - - - - - - - - - - - -
      * w_fcrn - Første recordnummer på siden
      * w_stel - Subfile-teller
      * w_spge - Sidestørrelse i subfile (page)
      * w_srrn - Relativt recordnummer i subfile
      * w_sfrn - Første recordnummer på siste side
      * w_ssrn - Siste recordnummer på siste side
      * w_curn - Current recordnummer på siden
      * w_virn - Side og cursorplassering som skal vises
      * w_afld - Aktivt feltnavn
      * w_arow - Aktiv rad for cursor
      * w_acol - Aktiv kolonne for cursor
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      * B1SFL  - B1 Subfile - record
      * B2CTL  - B2 Subfile - control record
      * B2CMD  - B2 Eget skjermbilde for CMD-taster
      * C1BLD  - C1 Skjermbilde for innlegging av nøkkel ved oppretting
      * C1MSG  - C1 Meldingsbilde for C1BLD
      * C2BLD  - C2 Skjermbilde for opprette/endre/vise
      * D1WIN  - D1 Vindu for slette (Delete)
      * K1WIN  - K1 Vindu for kopiere
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B2CTL Behandle åpningsbildet med subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Send Alt
      *
     c     b2taga        tag
      *
     c                   write     b2cmd
      *
      * Bare data
      *
     c     b2tagb        tag
      *
     c                   exsr      dsp_subfile
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      b2tagb
     c                   when      *inke
     c                   exsr      forny
     c                   goto      b2tagb
     c                   when      *inkf
     c                   exsr      xc1bld
     c                   goto      b2taga
     c                   when      *inkg
     c                   exsr      xc7bld
     c                   goto      b2taga
     c                   when      *in10
     c                   exsr      crt_subfile
     c                   goto      b2tagb
     c                   when      *in11
     c                   exsr      bck_subfile
     c                   goto      b2tagb
     c                   when      *in21
     c                   eval      *in22 = *on
     c                   goto      b2taga
     c                   endsl
      *
      * Posisjonering
      *
     c                   if        b2ogrp <> 0 or
     c                             b2hgrp <> 0 or
     c                             b2ugrp <> 0 or
     c                             b2ldor <> 0 or
     c                             b2modn <> 0 or
6.21 c                             b2vare <> *blank or
     c**                           b2enhe <> *blank or
6.21 c                             b2lety <> 0
     c                   exsr      posisjoner
     c                   goto      b2tagb
     c                   endif
      *
      * Behandling av subfile
      *
     c                   exsr      subfile
      *
     c                   goto      b2taga
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for fornying av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     forny         begsr
      *
     c                   if        w_fcrn <> 0
     c     w_fcrn        chain     b1sfl
     c                   endif
      *
     c*                  select
     c*                  when      w_seqe = 'K'
     c*                  eval      ekboi2_kund = b1kund
     c*                  eval      ekboi2_kpro = b1kpro
     c*                  eval      ekboi2_ogrp = b1ogrp
     c*                  eval      ekboi2_hgrp = b1hgrp
     c*                  eval      ekboi2_ugrp = b1ugrp
     c*                  eval      ekboi2_ldor = b1ldor
     c*    ekboi2_key    setll     ekboi2
     c*                  when      w_seqe = 'P'
     c*                  eval      ekboi3_kpro = b1kpro
     c*    ekboi3_key    setll     ekboi3
     c*                  when      w_seqe = 'O'
     c*                  eval      ekboi4_ogrp = b1ogrp
     c*                  eval      ekboi4_hgrp = b1hgrp
     c*                  eval      ekboi4_ugrp = b1ugrp
     c*    ekboi4_key    setll     ekboi4
     c*                  when      w_seqe = 'H'
     c*                  eval      ekboi5_hgrp = b1hgrp
     c*                  eval      ekboi5_ugrp = b1ugrp
     c*    ekboi5_key    setll     ekboi5
     c*                  when      w_seqe = 'U'
     c*                  eval      ekboi6_ugrp = b1ugrp
     c*    ekboi6_key    setll     ekboi6
     c*                  when      w_seqe = 'L'
     c*                  eval      ekboi7_ldor = b1ldor
     c*    ekboi7_key    setll     ekboi7
     c*                  when      w_seqe = 'M'
     c*                  eval      ekboi8_modn = b1modn
     c*    ekboi8_key    setll     ekboi8
     c*                  when      w_seqe = 'V'
     c*                  eval      ekboi9_vare = b1vare
     c*                  eval      ekboi9_enhe = b1enhe
     c*                  eval      ekboi9_lety = b1lety
     c*    ekboi9_key    setll     ekboi9
     c*                  when      w_seqe = 'E'
     c*                  eval      ekboia_enhe = b1enhe
     c*    ekboia_key    setll     ekboia
     c*                  when      w_seqe = 'T'
     c*                  eval      ekboib_lety = b1lety
     c*    ekboib_key    setll     ekboib
     c*                  when      w_seqe = 'B'
     c*                  eval      ekboic_boty = b1boty
     c*    ekboic_key    setll     ekboic
     c*                  other
     c*                  eval      ekboi1_rkat = b1rkat
     c*                  eval      ekboi1_kund = b1kund
     c*                  eval      ekboi1_kpro = b1kpro
     c*                  eval      ekboi1_ogrp = b1ogrp
     c*                  eval      ekboi1_hgrp = b1hgrp
     c*                  eval      ekboi1_ugrp = b1ugrp
     c*                  eval      ekboi1_ldor = b1ldor
     c*                  eval      ekboi1_modn = b1modn
     c*                  eval      ekboi1_vare = b1vare
     c*                  eval      ekboi1_enhe = b1enhe
     c*                  eval      ekboi1_lety = b1lety
     c*                  eval      ekboi1_boty = b1boty
     c*                  eval      ekboi1_fdat = *loval
     c*                  eval      ekboi1_tdat = *loval
     c*                  if        b1fdat <> 0
     c*                  eval      ekboi1_fdat = %date(b1fdat:*dmy)
     c*                  endif
     c*                  if        b1tdat <> 0
     c*                  eval      ekboi1_tdat = %date(b1tdat:*dmy)
     c*                  endif
     c*    ekboi1_key    setll     ekboi1
     c*                  endsl
6.23  *
6.23  * Posisjonerer databasen, og fyller opp subfile
6.23  *
6.23 c     embeir_key    setll     embeir
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for posisjonering i subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     posisjoner    begsr
      *
      * Posisjoner startverdi på rabattkategori
      *
      *
      * Posisjoner startverdi på overgruppe
      *
     c*                  if        b2ogrp <> 0
     c*                  eval      w_seqe = 'O'
     c*                  eval      ekboi4_ogrp = b2ogrp
     c*                  eval      ekboi4_hgrp = b2hgrp
     c*                  eval      ekboi4_ugrp = b2ugrp
     c*    ekboi4_key    setll     ekboi4
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på hovedgruppe
      *
     c*                  if        b2hgrp <> 0
     c*                  eval      w_seqe = 'H'
     c*                  eval      ekboi5_hgrp = b2hgrp
     c*                  eval      ekboi5_ugrp = b2ugrp
     c*    ekboi5_key    setll     ekboi5
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på undergruppe
      *
     c*                  if        b2ugrp <> 0
     c*                  eval      w_seqe = 'U'
     c*                  eval      ekboi6_ugrp = b2ugrp
     c*    ekboi6_key    setll     ekboi6
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på leverandør
      *
     c*                  if        b2ldor <> 0
     c*                  eval      w_seqe = 'L'
     c*                  eval      ekboi7_ldor = b2ldor
     c*    ekboi7_key    setll     ekboi7
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på modulnr
      *
     c*                  if        b2modn <> 0
     c*                  eval      w_seqe = 'M'
     c*                  eval      ekboi8_modn = b2modn
     c*    ekboi8_key    setll     ekboi8
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på vare
      *
     c*                  if        b2vare <> *blank
     c*                  eval      w_seqe = 'V'
     c*                  eval      ekboi9_vare = b2vare
     c*                  eval      ekboi9_enhe = b2enhe
     c*                  eval      ekboi9_lety = b2lety
     c*    ekboi9_key    setll     ekboi9
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på enhet
      *
     c*                  if        b2enhe <> *blank
     c*                  eval      w_seqe = 'E'
     c*                  eval      ekboia_enhe = b2enhe
     c*    ekboia_key    setll     ekboia
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på leveringstype
      *
     c*                  if        b2lety <> 0
     c*                  eval      w_seqe = 'T'
     c*                  eval      ekboib_lety = b2lety
     c*    ekboib_key    setll     ekboib
     c*                  goto      end_pos
     c*                  endif
      *
     c     end_pos       tag
      *
      * Blanker subfile, og fyller opp i.h.t. posisjonering
      *
     c                   eval      *in22 = *off
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
      * Blanker posisjoneringsfelter
      *
     c                   eval      b2ogrp = 0
     c                   eval      b2hgrp = 0
     c                   eval      b2ugrp = 0
     c                   eval      b2ldor = 0
     c                   eval      b2modn = 0
     c                   eval      b2vare = *blank
     c**                 eval      b2enhe = *blank
6.21 c                   eval      b2lety = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     subfile       begsr
      *
     c                   eval      b_forn = *off
      *
     c                   if        *in22 = *off
     c                   eval      *in22 = *on
     c                   else
     c                   eval      *in22 = *off
     c                   endif
      *
     c                   eval      w_virn = w_fcrn
      *
      * Leser og behandler subfile
      *
     c                   do        w_ssrn
     c                   readc     b1sfl
      *
     c                   if        %eof
     c                   leave
     c                   endif
      *
     c                   eval      *in22 = *off
     c                   eval      w_virn = w_srrn
      *
      * Endre
      *
     c                   if        b1valg = 2
     c                   eval      c1ogrp = b1ogrp
     c                   eval      c1hgrp = b1hgrp
     c                   eval      c1ugrp = b1ugrp
     c                   eval      c1ldor = b1ldor
     c                   eval      c1modn = b1modn
     c                   eval      c1vare = b1vare
     c**                 eval      c1enhe = b1enhe
6.21 c                   eval      c1lety = b1lety
     c                   eval      c1fdat = b1fdat
     c                   eval      c1tdat = b1tdat
     c                   exsr      xc2bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Kopier
      *
     c                   if        b1valg = 3
     c                   eval      k1ogrp = b1ogrp
     c                   eval      k1hgrp = b1hgrp
     c                   eval      k1ugrp = b1ugrp
     c                   eval      k1ldor = b1ldor
     c                   eval      k1modn = b1modn
     c                   eval      k1vare = b1vare
     c**                 eval      k1enhe = b1enhe
6.21 c                   eval      k1lety = b1lety
     c                   eval      k1fdat = b1fdat
     c                   eval      k1tdat = b1tdat
     c                   exsr      xk1win
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Slett
      *
     c                   if        b1valg = 4
     c                   eval      d1ogrp = b1ogrp
     c                   eval      d1hgrp = b1hgrp
     c                   eval      d1ugrp = b1ugrp
     c                   eval      d1ldor = b1ldor
     c                   eval      d1modn = b1modn
     c                   eval      d1vare = b1vare
     c**                 eval      d1enhe = b1enhe
6.21 c                   eval      d1lety = b1lety
     c                   eval      d1fdat = b1fdat
     c                   eval      d1tdat = b1tdat
     c                   exsr      xd1win
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Vis
      *
     c                   if        b1valg = 5
     c                   eval      c1ogrp = b1ogrp
     c                   eval      c1hgrp = b1hgrp
     c                   eval      c1ugrp = b1ugrp
     c                   eval      c1ldor = b1ldor
     c                   eval      c1modn = b1modn
     c                   eval      c1vare = b1vare
     c**                 eval      c1enhe = b1enhe
6.21 c                   eval      c1lety = b1lety
     c                   eval      c1fdat = b1fdat
     c                   eval      c1tdat = b1tdat
     c                   exsr      xc2bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Bonuselementer
      *
     c                   if        b1valg = 7
     c                   eval      w_vare = b1vare
     c                   eval      x_enhe = *blank
     c                   eval      x_lety = 0
     c                   if        b1fdat <> 0
     c                   eval      w_fdat_iso = %date(b1fdat:*dmy)
     c                   else
     c                   eval      w_fdat_iso = *loval
     c                   endif
     c                   if        b1tdat <> 0
     c                   eval      w_tdat_iso = %date(b1tdat:*dmy)
     c                   else
     c                   eval      w_tdat_iso = *loval
     c                   endif
     c                   call      'EM110R'
     c                   parm                    w_firm
     c                   parm                    p_bbot
     c                   parm                    p_bmnr
     c                   parm                    b1ogrp
     c                   parm                    b1hgrp
     c                   parm                    b1ugrp
     c                   parm                    b1ldor
     c                   parm                    b1modn
     c                   parm                    w_vare
     c**                 parm                    b1enhe
     c                   parm                    x_enhe
6.21 c                   parm                    b1lety
     c                   parm                    w_fdat_iso
     c                   parm                    w_tdat_iso
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      *
     c                   enddo
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av skjermbilde for ny rad (C1BLD)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc1bld        begsr
      *
     c                   eval      b_oppr = *on
     c                   eval      b_forn = *off
      *
     c                   eval      c1ogrp = 0
     c                   eval      c1hgrp = 0
     c                   eval      c1ugrp = 0
     c                   eval      c1ldor = 0
     c                   eval      c1modn = 0
     c                   eval      c1vare = *blank
     c**                 eval      c1enhe = *blank
6.21 c                   eval      c1lety = 0
6.22 c                   eval      c1fdat = 0
6.22 c                   if        emhfra <> *loval
6.22 c     *dmy          move      emhfra        c1fdat
6.22 c                   endif
6.22 c                   eval      c1tdat = 0
6.22 c                   if        emhtil <> *loval
6.22 c     *dmy          move      emhtil        c1tdat
6.22 c                   endif
      *
     c                   exsr      hent_info
      *
     c     c1taga        tag
      *
     c                   exfmt     c1bld
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      end_c1bld
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      c1taga
     c                   endsl
      *
      * Sjekker input
      *
     c                   eval      w_ogrp = c1ogrp
     c                   eval      w_hgrp = c1hgrp
     c                   eval      w_ugrp = c1ugrp
     c                   eval      w_ldor = c1ldor
     c                   eval      w_modn = c1modn
     c                   eval      w_vare = c1vare
     c**                 eval      w_enhe = c1enhe
     c                   eval      w_enhe = *blank
6.21 c                   eval      w_lety = c1lety
     c                   eval      w_fdat = c1fdat
     c                   eval      w_tdat = c1tdat
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      c1taga
     c                   endif
      *
      * Sender opp informasjonsbildet dersom rad finnes fra før
      *
     c                   eval      embei1_eogr = c1ogrp
     c                   eval      embei1_ehgr = c1hgrp
     c                   eval      embei1_eugr = c1ugrp
     c                   eval      embei1_eldo = c1ldor
     c                   eval      embei1_emod = c1modn
     c                   eval      embei1_evar = c1vare
     c**                 eval      embei1_eenh = c1enhe
     c                   eval      embei1_eenh = *blank
6.21 c                   eval      embei1_elet = c1lety
     c                   eval      embei1_efda = *loval
     c                   eval      embei1_etda = *loval
     c                   if        c1fdat <> 0
     c                   eval      embei1_efda = %date(c1fdat:*dmy)
     c                   endif
     c                   if        c1tdat <> 0
     c                   eval      embei1_etda = %date(c1tdat:*dmy)
     c                   endif
     c     embei1_key    chain     embei1
     c                   if        %found
     c                   exsr      xc1msg
     c                   if        b_anul = *on
     c                   goto      c1taga
     c                   endif
     c                   endif
      *
      * Kaller vedlikeholdsprogram
      *
     c                   exsr      xc2bld
      *
     c                   eval      c1ogrp = 0
     c                   eval      c1hgrp = 0
     c                   eval      c1ugrp = 0
     c                   eval      c1ldor = 0
     c                   eval      c1vare = *blank
     c                   eval      c1modn = 0
     c**                 eval      c1enhe = *blank
6.21 c                   eval      c1lety = 0
     c                   eval      c1fdat = 0
     c                   eval      c1tdat = 0
      *
     c                   eval      c1gtxt = *blank
     c                   eval      c1lnav = *blank
     c                   eval      c1mtxt = *blank
     c                   eval      c1vtxt = *blank
     c**                 eval      c1etxt = *blank
6.21 c                   eval      c1ltxt = *blank
     c                   goto      c1taga
      *
     c     end_c1bld     tag
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c                   eval      b_oppr = *off
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for utlegging av opprettelsesmelding
      * Meldingsbildet legges ut dersom det forsøkes å opprette en rad som
      * finnes fra før.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc1msg        begsr
      *
     c                   eval      b_anul = *off
      *
     c                   exfmt     c1msg
      *
      * Behandling av funksjonstaster
      *
     c                   if        *inkc or *inkl
     c                   eval      b_anul = *on
     c                   leavesr
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * C2BLD Behandle bilde for ny - endring - vise
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc2bld        begsr
      *
     c                   eval      w_arow = 0
     c                   eval      w_acol = 0
      *
     c                   eval      embei1_eogr = c1ogrp
     c                   eval      embei1_ehgr = c1hgrp
     c                   eval      embei1_eugr = c1ugrp
     c                   eval      embei1_eldo = c1ldor
     c                   eval      embei1_emod = c1modn
     c                   eval      embei1_evar = c1vare
     c**                 eval      embei1_eenh = c1enhe
     c                   eval      embei1_eenh = *blank
6.21 c                   eval      embei1_elet = c1lety
     c                   eval      embei1_efda = *loval
     c                   eval      embei1_etda = *loval
     c                   if        c1fdat <> 0
     c                   eval      embei1_efda = %date(c1fdat:*dmy)
     c                   endif
     c                   if        c1tdat <> 0
     c                   eval      embei1_etda = %date(c1tdat:*dmy)
     c                   endif
     c     embei1_key    chain     embei1
      *
     c                   if        %found
     c                   eval      c2merk = ememrk
     c                   eval      c2bygg = emebyg
     c**                 eval      c2eusr = emeeus
     c     *dmy          move      emeeda        c2eeda
     c                   else
     c                   eval      c2merk = *blank
     c                   eval      c2bygg = 0
     c**                 eval      c2eusr = *blank
     c                   endif
      *
     c                   if        b1valg = 3
     c                   eval      c1ogrp = k1ogrp
     c                   eval      c1hgrp = k1hgrp
     c                   eval      c1ugrp = k1ugrp
     c                   eval      c1ldor = k1ldor
     c                   eval      c1modn = k1modn
     c                   eval      c1vare = k1vare
     c**                 eval      c1enhe = k1enhe
6.21 c                   eval      c1lety = k1lety
     c                   eval      c1fdat = k1fdat
     c                   eval      c1tdat = k1tdat
     c                   endif
      *
     c                   if        b1valg = 5
     c                   eval      *in30 = *on
     c                   endif
      *
      * Henter beskrivelse av nivå
      *
     c                   exsr      hent_info
      *
     c     c2tagb        tag
      *
     c                   exfmt     c2bld
      *
     c                   if        *inkc or *inkl or *in30
     c                   goto      end_c2bld
     c                   endif
      *
      * Validering av input
      *
      * Oppdatering av kundebonus
      *
     c                   clear                   embeiur
      *
     c                   eval      embeiu_eogr = c1ogrp
     c                   eval      embeiu_ehgr = c1hgrp
     c                   eval      embeiu_eugr = c1ugrp
     c                   eval      embeiu_eldo = c1ldor
     c                   eval      embeiu_emod = c1modn
     c                   eval      embeiu_evar = c1vare
     c**                 eval      embeiu_eenh = c1enhe
     c                   eval      embeiu_eenh = *blank
6.21 c                   eval      embeiu_elet = c1lety
     c                   eval      embeiu_efda = *loval
     c                   eval      embeiu_etda = *loval
     c                   if        c1fdat <> 0
     c                   eval      embeiu_efda = %date(c1fdat:*dmy)
     c                   endif
     c                   if        c1tdat <> 0
     c                   eval      embeiu_etda = %date(c1tdat:*dmy)
     c                   endif
     c     embeiu_key    chain     embeiur
      *
     c                   eval      ememrk = c2merk
     c                   eval      emebyg = c2bygg
     c                   eval      emeeus = l_user
      *
     c                   time                    emeeti
     c                   time                    emeeda
      *
     c                   if        %found(embeiu)
     c                   update    embeiur
     c                   else
     c                   eval      emefir = w_firm
     c                   eval      emebot = p_bbot
     c                   eval      ememnr = p_bmnr
     c                   eval      emeogr = c1ogrp
     c                   eval      emehgr = c1hgrp
     c                   eval      emeugr = c1ugrp
     c                   eval      emeldo = c1ldor
     c                   eval      ememod = c1modn
     c                   eval      emevar = c1vare
     c**                 eval      emeenh = c1enhe
     c                   eval      emeenh = *blank
6.21 c                   eval      emelet = c1lety
     c                   eval      emefda = *loval
     c                   eval      emetda = *loval
     c                   if        c1fdat <> 0
     c                   eval      emefda = %date(c1fdat:*dmy)
     c                   endif
     c                   if        c1tdat <> 0
     c                   eval      emetda = %date(c1tdat:*dmy)
     c                   endif
     c                   time                    emeoda
     c                   time                    emeoti
6.10 c                   eval      emeous = l_user
     c                   write     embeiur
     c                   endif
      *
      * Oppdater subfile
      *
     c                   if        b1valg = 2
     c                   if        ememrk <> *blank
     c                   eval      b1merk = 'X'
     c                   else
     c                   eval      b1merk = *blank
     c                   endif
     c                   endif
      *
      * Kopierer rabattelementer
      *
     c*                  if        b1valg = 3
     c*                  eval      ekbei1_eogr = s_ogrp
     c*                  eval      ekbei1_ehgr = s_hgrp
     c*                  eval      ekbei1_eugr = s_ugrp
     c*                  eval      ekbei1_eldo = s_ldor
     c*                  eval      ekbei1_emod = s_modn
     c*                  eval      ekbei1_evar = s_vare
     c*                  eval      ekbei1_eenh = s_enhe
     c*                  eval      ekbei1_elet = s_lety
     c*                  eval      ekbei1_efda = *loval
     c*                  eval      ekbei1_etda = *loval
     c*                  if        s_fdat <> 0
     c*                  eval      ekbei1_efda = %date(s_fdat:*dmy)
     c*                  endif
     c*                  if        s_tdat <> 0
     c*                  eval      ekbei1_etda = %date(s_tdat:*dmy)
     c*                  endif
     c*    ekbei1_key    setll     ekbei1
     c*    ekbei1_key    reade     ekbei1
     c*                  dow       not %eof
     c*                  eval      ekeogr = ekogrp
     c*                  eval      ekehgr = ekhgrp
     c*                  eval      ekeugr = ekugrp
     c*                  eval      ekeldo = ekldor
     c*                  eval      ekemod = ekmodn
     c*                  eval      ekevar = ekvare
     c*                  eval      ekeenh = ekenhe
     c*                  eval      ekelet = eklety
     c*                  eval      ekefda = ekfdat
     c*                  eval      eketda = ektdat
     c*                  eval      ekesbo = 0
     c*                  eval      ekebda = *loval
     c*                  eval      ekebti = *loval
     c*                  eval      ekeeus = l_user
6.10 c*                  eval      ekeous = l_user
     c*                  time                    ekeoda
     c*                  time                    ekeoti
     c*                  time                    ekeeda
     c*                  time                    ekeeti
     c*                  write     ekbeiur
     c*    ekbei1_key    reade     ekbei1
     c*                  enddo
     c*                  endif
      *
      * Kaller bonuselement-bildet
      *
     c                   if        b_oppr = *on or
     c                             b1valg = 3
     c                   eval      b_forn = *on
     c                   call      'EM110R'
     c                   parm                    w_firm
     c                   parm                    w_bbot
     c                   parm                    w_bmnr
     c                   parm                    emeogr
     c                   parm                    emehgr
     c                   parm                    emeugr
     c                   parm                    emeldo
     c                   parm                    ememod
     c                   parm                    emevar
     c                   parm                    emeenh
     c                   parm                    emelet
     c                   parm                    emefda
     c                   parm                    emetda
     c                   endif
      *
     c     end_c2bld     tag
      *
     c                   eval      *in30  = *off
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av slette-bildet (D1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xd1win        begsr
      *
     c                   eval      embei1_eogr = d1ogrp
     c                   eval      embei1_ehgr = d1hgrp
     c                   eval      embei1_eugr = d1ugrp
     c                   eval      embei1_eldo = d1ldor
     c                   eval      embei1_emod = d1modn
     c                   eval      embei1_evar = d1vare
     c**                 eval      embei1_eenh = d1enhe
     c                   eval      embei1_eenh = *blank
6.21 c                   eval      embei1_elet = d1lety
     c                   eval      embei1_efda = *loval
     c                   eval      embei1_etda = *loval
     c                   if        d1fdat <> 0
     c                   eval      embei1_efda = %date(d1fdat:*dmy)
     c                   endif
     c                   if        d1tdat <> 0
     c                   eval      embei1_etda = %date(d1tdat:*dmy)
     c                   endif
     c     embei1_key    chain     embei1
      *
     c                   exfmt     d1win
      *
     c                   if        *inkc or *inkl
     c                   leavesr
     c                   endif
      *
     c                   eval      b_forn = *on
      *
      * Sletter bonus-nivå
      *
     c                   eval      embeiu_eogr = d1ogrp
     c                   eval      embeiu_ehgr = d1hgrp
     c                   eval      embeiu_eugr = d1ugrp
     c                   eval      embeiu_eldo = d1ldor
     c                   eval      embeiu_emod = d1modn
     c                   eval      embeiu_evar = d1vare
     c**                 eval      embeiu_eenh = d1enhe
     c                   eval      embeiu_eenh = *blank
6.21 c                   eval      embeiu_elet = d1lety
     c                   eval      embeiu_efda = *loval
     c                   eval      embeiu_etda = *loval
     c                   if        d1fdat <> 0
     c                   eval      embeiu_efda = %date(d1fdat:*dmy)
     c                   endif
     c                   if        d1tdat <> 0
     c                   eval      embeiu_etda = %date(d1tdat:*dmy)
     c                   endif
     c     embeiu_key    chain     embeiur
     c                   delete    embeiur
      *
      * sletter bonusedetaljer på elementet
      *
     c     embeiu_key    setll     embdiu
     c     embeiu_key    reade     embdiu
     c                   dow       not %eof(embdiu)
     c                   delete    embdiur
     c     embeiu_key    reade     embdiu
     c                   enddo
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å behandle kopierings-bildet (K1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xk1win        begsr
      *
      * Tar vare på nøkkel til rad det skal kopieres fra
      *
     c                   eval      s_bbot = w_bbot
     c                   eval      s_bmnr = w_bmnr
     c                   eval      s_ogrp = k1ogrp
     c                   eval      s_hgrp = k1hgrp
     c                   eval      s_ugrp = k1ugrp
     c                   eval      s_ldor = k1ldor
     c                   eval      s_modn = k1modn
     c                   eval      s_vare = k1vare
     c**                 eval      s_enhe = k1enhe
6.21 c                   eval      s_lety = k1lety
     c                   eval      s_fdat = k1fdat
     c                   eval      s_tdat = k1tdat
      *
      * Fyller kopierings-bildet
      *
     c                   eval      embei1_eogr = k1ogrp
     c                   eval      embei1_ehgr = k1hgrp
     c                   eval      embei1_eugr = k1ugrp
     c                   eval      embei1_eldo = k1ldor
     c                   eval      embei1_emod = k1modn
     c                   eval      embei1_evar = k1vare
     c**                 eval      embei1_eenh = k1enhe
     c                   eval      embei1_eenh = *blank
6.21 c                   eval      embei1_elet = k1lety
     c                   eval      embei1_efda = *loval
     c                   eval      embei1_etda = *loval
     c                   if        k1fdat <> 0
     c                   eval      embei1_efda = %date(k1fdat:*dmy)
     c                   endif
     c                   if        k1tdat <> 0
     c                   eval      embei1_etda = %date(k1tdat:*dmy)
     c                   endif
      *
     c     embei1_key    chain     embei1
      *
     c                   if        emefda <> *loval
     c     *dmy          move      emefda        k1fda2
     c                   else
     c                   eval      k1fda2 = 0
     c                   endif
      *
     c                   if        emetda <> *loval
     c     *dmy          move      emetda        k1tda2
     c                   else
     c                   eval      k1tda2 = 0
     c                   endif
      *
     c     k1tagb        tag
      *
     c                   exfmt     k1win
      *
     c                   if        *inkc or *inkl
     c                   leavesr
     c                   endif
      *
      * Spørring
      *
     c                   if        *inkd = *on
     c                   exsr      spØrring
     c                   goto      k1tagb
     c                   endif
      *
      * Sjekker om rad finnes fra før
      *
     c                   eval      embei1_eogr = k1ogrp
     c                   eval      embei1_ehgr = k1hgrp
     c                   eval      embei1_eugr = k1ugrp
     c                   eval      embei1_eldo = k1ldor
     c                   eval      embei1_emod = k1modn
     c                   eval      embei1_evar = k1vare
     c**                 eval      embei1_eenh = k1enhe
     c                   eval      embei1_eenh = *blank
6.21 c                   eval      embei1_elet = k1lety
     c                   eval      embei1_efda = *loval
     c                   eval      embei1_etda = *loval
     c                   if        k1fdat <> 0
     c                   eval      embei1_efda = %date(k1fdat:*dmy)
     c                   endif
     c                   if        k1tdat <> 0
     c                   eval      embei1_etda = %date(k1tdat:*dmy)
     c                   endif
     c     embei1_key    chain     embei1
     c                   if        %found
     c                   eval      *in32 = *on
     c                   goto      k1tagb
     c                   endif
      *
      * Sjekker input
      *
     c                   eval      w_ogrp = k1ogrp
     c                   eval      w_hgrp = k1hgrp
     c                   eval      w_ugrp = k1ugrp
     c                   eval      w_ldor = k1ldor
     c                   eval      w_modn = k1modn
     c                   eval      w_vare = k1vare
     c**                 eval      w_enhe = k1enhe
6.21 c                   eval      w_lety = k1lety
     c                   eval      w_fdat = k1fdat
     c                   eval      w_tdat = k1tdat
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      k1tagb
     c                   endif
      *
      * Kaller vedlikeholdsprogram
      *
     c                   eval      c1ogrp = s_ogrp
     c                   eval      c1hgrp = s_hgrp
     c                   eval      c1ugrp = s_ugrp
     c                   eval      c1ldor = s_ldor
     c                   eval      c1modn = s_modn
     c                   eval      c1vare = s_vare
     c**                 eval      c1enhe = s_enhe
6.21 c                   eval      c1lety = s_lety
     c                   eval      c1fdat = s_fdat
     c                   eval      c1tdat = s_tdat
      *
     c                   exsr      xc2bld
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for import av informasjon fra Rapport & Analyse (MGR funk)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.20  * Fjernet subrutine som leser inn og henter info herfra.
     c     xc7bld        begsr
      *
     c                   exfmt     c7bld
      *
     c                   if        *inkc or *inkl
     c                   leavesr
     c                   endif
      *
     c                   eval      b_forn = *on
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for tømming av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     clr_subfile   begsr
      *
     c                   eval      *in14 = *on
     c                   write     b2ctl
     c                   eval      *in14 = *off
      *
     c                   eval      *in15 = *off
     c                   eval      w_srrn = 0
     c                   eval      w_sfrn = 0
     c                   eval      w_ssrn = 0
     c                   eval      w_spge = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Fyll opp subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     crt_subfile   begsr
      *
     c                   eval      w_spge = w_spge + c_sfil
     c                   eval      w_srrn = w_ssrn
      *
     c                   dou       w_srrn = w_spge
      *
     c*                  select
     c*                  when      w_seqe = 'K'
     c*                  read      ekboi2
     c*                  when      w_seqe = 'P'
     c*                  read      ekboi3
     c*                  when      w_seqe = 'O'
     c*                  read      ekboi4
     c*                  when      w_seqe = 'H'
     c*                  read      ekboi5
     c*                  when      w_seqe = 'U'
     c*                  read      ekboi6
     c*                  when      w_seqe = 'L'
     c*                  read      ekboi7
     c*                  when      w_seqe = 'M'
     c*                  read      ekboi8
     c*                  when      w_seqe = 'V'
     c*                  read      ekboi9
     c*                  when      w_seqe = 'E'
     c*                  read      ekboia
     c*                  when      w_seqe = 'T'
     c*                  read      ekboib
     c*                  when      w_seqe = 'B'
     c*                  read      ekboic
     c*                  other
     c                   read      embeir
     c*                  endsl
      *
     c                   if        %eof or
     c                             emefir <> w_firm or
     c                             emebot <> w_bbot or
     c                             ememnr <> w_bmnr
     c                   eval      *in15 = *on
     c                   leave
     c                   endif
      *
     c                   eval      w_srrn = w_srrn + 1
      *
     c*                  select
     c*                  when      w_seqe = 'K'
     c*                  eval      ekboi2_kund = ekkund
     c*                  eval      ekboi2_kpro = ekkpro
     c*                  eval      ekboi2_ogrp = ekogrp
     c*                  eval      ekboi2_hgrp = ekhgrp
     c*                  eval      ekboi2_ugrp = ekugrp
     c*                  eval      ekboi2_ldor = ekldor
     c*                  when      w_seqe = 'P'
     c*                  eval      ekboi3_kpro = ekkpro
     c*                  when      w_seqe = 'O'
     c*                  eval      ekboi4_ogrp = ekogrp
     c*                  eval      ekboi4_hgrp = ekhgrp
     c*                  eval      ekboi4_ugrp = ekugrp
     c*                  when      w_seqe = 'H'
     c*                  eval      ekboi5_hgrp = ekhgrp
     c*                  eval      ekboi5_ugrp = ekugrp
     c*                  when      w_seqe = 'U'
     c*                  eval      ekboi6_ugrp = ekugrp
     c*                  when      w_seqe = 'L'
     c*                  eval      ekboi7_ldor = ekldor
     c*                  when      w_seqe = 'M'
     c*                  eval      ekboi8_modn = ekmodn
     c*                  when      w_seqe = 'V'
     c*                  eval      ekboi9_vare = ekvare
     c*                  eval      ekboi9_enhe = ekenhe
     c*                  eval      ekboi9_lety = eklety
     c*                  when      w_seqe = 'E'
     c*                  eval      ekboia_enhe = ekenhe
     c*                  when      w_seqe = 'T'
     c*                  eval      ekboib_lety = eklety
     c*                  when      w_seqe = 'B'
     c*                  eval      ekboic_boty = ekboty
     c*                  other
     c*                  eval      ekboi1_ogrp = ekogrp
     c*                  eval      ekboi1_hgrp = ekhgrp
     c*                  eval      ekboi1_ugrp = ekugrp
     c*                  eval      ekboi1_ldor = ekldor
     c*                  eval      ekboi1_modn = ekmodn
     c*                  eval      ekboi1_vare = ekvare
     c*                  eval      ekboi1_enhe = ekenhe
     c*                  eval      ekboi1_lety = eklety
     c*                  eval      ekboi1_fdat = ekfdat
     c*                  eval      ekboi1_tdat = ektdat
     c*                  endsl
      *
     c                   eval      b1ogrp = emeogr
     c                   eval      b1hgrp = emehgr
     c                   eval      b1ugrp = emeugr
     c                   eval      b1ldor = emeldo
     c                   eval      b1text = *blank
     c                   if        b1ldor <> 0
     c                   eval      rlevl1_levr = b1ldor
     c     rlevl1_key    chain     rlevl1
     c                   if        %found
     c                   movel     rlnavn        b1text
     c                   endif
     c                   endif
     c                   eval      b1modn = ememod
     c                   eval      b1vare = emevar
     c                   if        b1vare <> *blank
     c                   eval      vvarl1_vare = b1vare
     c     vvarl1_key    chain     vvarl1
     c                   if        %found
     c                   movel     vvtek1        b1text
     c                   endif
     c                   endif
     c**                 eval      b1enhe = emeenh
6.21 c                   eval      b1lety = emelet
     c                   eval      b1fdat = 0
     c                   eval      b1tdat = 0
     c                   eval      b1merk = *blank
      *
     c                   if        emefda <> *loval
     c     *dmy          move      emefda        b1fdat
     c                   endif
     c                   if        emetda <> *loval
     c     *dmy          move      emetda        b1tdat
     c                   endif
     c                   if        ememrk <> *blank
     c                   eval      b1merk = 'X'
     c                   endif
      *
     c                   write     b1sfl
     c                   enddo
      *
     c                   if        w_srrn > w_ssrn
     c                   eval      w_sfrn = w_ssrn + 1
     c                   endif
      *
     c                   eval      w_ssrn = w_srrn
     c                   eval      w_virn = w_sfrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å bla tilbake en side i subfilen
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bck_subfile   begsr
      *
     c                   if        *in15
     c*                  select
     c*                  when      w_seqe = 'K'
     c*    ekboi2_key    setgt     ekboi2
     c*                  readp     ekboi2
     c*                  when      w_seqe = 'P'
     c*    ekboi3_key    setgt     ekboi3
     c*                  readp     ekboi3
     c*                  when      w_seqe = 'O'
     c*    ekboi4_key    setgt     ekboi4
     c*                  readp     ekboi4
     c*                  when      w_seqe = 'H'
     c*    ekboi5_key    setgt     ekboi5
     c*                  readp     ekboi5
     c*                  when      w_seqe = 'U'
     c*    ekboi6_key    setgt     ekboi6
     c*                  readp     ekboi6
     c*                  when      w_seqe = 'L'
     c*    ekboi7_key    setgt     ekboi7
     c*                  readp     ekboi7
     c*                  when      w_seqe = 'M'
     c*    ekboi8_key    setgt     ekboi8
     c*                  readp     ekboi8
     c*                  when      w_seqe = 'V'
     c*    ekboi9_key    setgt     ekboi9
     c*                  readp     ekboi9
     c*                  when      w_seqe = 'E'
     c*    ekboia_key    setgt     ekboia
     c*                  readp     ekboia
     c*                  when      w_seqe = 'T'
     c*    ekboib_key    setgt     ekboib
     c*                  readp     ekboib
     c*                  when      w_seqe = 'B'
     c*    ekboic_key    setgt     ekboic
     c*                  readp     ekboic
     c*                  other
     c     embeir_key    setgt     embeir
     c                   readp     embeir
     c*                  endsl
     c                   endif
      *
      * Leser tilbake en side
      *
     c                   eval      w_stel = 0
      *
     c                   dou       w_stel = w_ssrn + c_sfil
      *
     c*                  select
     c*                  when      w_seqe = 'K'
     c*                  readp     ekboi2
     c*                  when      w_seqe = 'P'
     c*                  readp     ekboi3
     c*                  when      w_seqe = 'O'
     c*                  readp     ekboi4
     c*                  when      w_seqe = 'H'
     c*                  readp     ekboi5
     c*                  when      w_seqe = 'U'
     c*                  readp     ekboi6
     c*                  when      w_seqe = 'L'
     c*                  readp     ekboi7
     c*                  when      w_seqe = 'M'
     c*                  readp     ekboi8
     c*                  when      w_seqe = 'V'
     c*                  readp     ekboi9
     c*                  when      w_seqe = 'E'
     c*                  readp     ekboia
     c*                  when      w_seqe = 'T'
     c*                  readp     ekboib
     c*                  when      w_seqe = 'B'
     c*                  readp     ekboic
     c*                  other
     c                   readp     embeir
     c*                  endsl
      *
     c*                  if        %eof or
     c*                            embfir <> w_firm or
     c*                            embbot <> w_bkun or
     c*                            embmnr <> w_bmnr
     c*                  leave
     c*                  endif
      *
     c                   eval      w_stel = w_stel + 1
      *
     c*                  select
     c*                  when      w_seqe = 'K'
     c*                  eval      ekboi2_kund = ekkund
     c*                  eval      ekboi2_kpro = ekkpro
     c*                  eval      ekboi2_ogrp = ekogrp
     c*                  eval      ekboi2_hgrp = ekhgrp
     c*                  eval      ekboi2_ugrp = ekugrp
     c*                  eval      ekboi2_ldor = ekldor
     c*                  when      w_seqe = 'P'
     c*                  eval      ekboi3_kpro = ekkpro
     c*                  when      w_seqe = 'O'
     c*                  eval      ekboi4_ogrp = ekogrp
     c*                  eval      ekboi4_hgrp = ekhgrp
     c*                  eval      ekboi4_ugrp = ekugrp
     c*                  when      w_seqe = 'H'
     c*                  eval      ekboi5_hgrp = ekhgrp
     c*                  eval      ekboi5_ugrp = ekugrp
     c*                  when      w_seqe = 'U'
     c*                  eval      ekboi6_ugrp = ekugrp
     c*                  when      w_seqe = 'L'
     c*                  eval      ekboi7_ldor = ekldor
     c*                  when      w_seqe = 'M'
     c*                  eval      ekboi8_modn = ekmodn
     c*                  when      w_seqe = 'V'
     c*                  eval      ekboi9_vare = ekvare
     c*                  eval      ekboi9_enhe = ekenhe
     c*                  eval      ekboi9_lety = eklety
     c*                  when      w_seqe = 'E'
     c*                  eval      ekboia_enhe = ekenhe
     c*                  when      w_seqe = 'T'
     c*                  eval      ekboib_lety = eklety
     c*                  when      w_seqe = 'B'
     c*                  eval      ekboic_boty = ekboty
     c*                  other
     c*                  eval      ekboi1_ogrp = ekogrp
     c*                  eval      ekboi1_hgrp = ekhgrp
     c*                  eval      ekboi1_ugrp = ekugrp
     c*                  eval      ekboi1_ldor = ekldor
     c*                  eval      ekboi1_modn = ekmodn
     c*                  eval      ekboi1_vare = ekvare
     c*                  eval      ekboi1_enhe = ekenhe
     c*                  eval      ekboi1_lety = eklety
     c*                  eval      ekboi1_fdat = ekfdat
     c*                  eval      ekboi1_tdat = ektdat
     c*                  endsl
      *
     c                   enddo
      *
     c                   if        %eof
     c*                  select
     c*                  when      w_seqe = 'K'
     c*    ekboi2_key    setll     ekboi2
     c*                  when      w_seqe = 'P'
     c*    ekboi3_key    setll     ekboi3
     c*                  when      w_seqe = 'O'
     c*    ekboi4_key    setll     ekboi4
     c*                  when      w_seqe = 'H'
     c*    ekboi5_key    setll     ekboi5
     c*                  when      w_seqe = 'U'
     c*    ekboi6_key    setll     ekboi6
     c*                  when      w_seqe = 'L'
     c*    ekboi7_key    setll     ekboi7
     c*                  when      w_seqe = 'M'
     c*    ekboi8_key    setll     ekboi8
     c*                  when      w_seqe = 'V'
     c*    ekboi9_key    setll     ekboi9
     c*                  when      w_seqe = 'E'
     c*    ekboia_key    setll     ekboia
     c*                  when      w_seqe = 'T'
     c*    ekboib_key    setll     ekboib
     c*                  when      w_seqe = 'B'
     c*    ekboic_key    setll     ekboic
     c*                  other
     c     embeir_key    setll     embeir
     c*                  endsl
     c                   endif
      *
      * Blanker og fyller opp subfile
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for display av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     dsp_subfile   begsr
      *
     c                   if        w_srrn <> 0
     c                   eval      *in12 = *on
     c                   else
     c                   write     b2cmd
     c                   endif
      *
     c                   eval      *in13 = *on
     c                   exfmt     b2ctl
      *
     c                   eval      *in12 = *off
     c                   eval      *in13 = *off
      *
     c                   eval      w_fcrn = d_fcrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av spørring
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     spØrring      begsr
      *
      * Overgruppe
      *
     c                   if        w_afld = 'B2OGRP'
     c                   call      'VG510R'
     c                   parm                    w_firm
     c                   parm                    b2ogrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1OGRP'
     c                   call      'VG510R'
     c                   parm                    w_firm
     c                   parm                    c1ogrp
     c                   parm                    c1gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1OGRP'
     c                   call      'VG510R'
     c                   parm                    w_firm
     c                   parm                    k1ogrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
      * Hovedgruppe
      *
     c                   if        w_afld = 'B2HGRP'
     c                   call      'VG511R'
     c                   parm                    w_firm
     c                   parm                    b2ogrp
     c                   parm                    b2hgrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1HGRP'
     c                   call      'VG511R'
     c                   parm                    w_firm
     c                   parm                    c1ogrp
     c                   parm                    c1hgrp
     c                   parm                    c1gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1HGRP'
     c                   call      'VG511R'
     c                   parm                    w_firm
     c                   parm                    k1ogrp
     c                   parm                    k1hgrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
      * Undergruppe
      *
     c                   if        w_afld = 'B2UGRP'
     c                   call      'VG512R'
     c                   parm                    w_firm
     c                   parm                    b2ogrp
     c                   parm                    b2hgrp
     c                   parm                    b2ugrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1UGRP'
     c                   call      'VG512R'
     c                   parm                    w_firm
     c                   parm                    c1ogrp
     c                   parm                    c1hgrp
     c                   parm                    c1ugrp
     c                   parm                    c1gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1UGRP'
     c                   call      'VG512R'
     c                   parm                    w_firm
     c                   parm                    k1ogrp
     c                   parm                    k1hgrp
     c                   parm                    k1ugrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
      * Leverandør
      *
     c                   if        w_afld = 'B2LDOR'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    b2ldor
     c                   parm                    w_lnav
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1LDOR'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    c1ldor
     c                   parm                    c1lnav
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1LDOR'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    k1ldor
     c                   parm                    w_lnav
     c                   leavesr
     c                   endif
      *
      * Modulnr
      *
     c                   if        w_afld = 'B2MODN'
     c                   call      'FO707C'
     c                   parm                    w_firm
     c                   parm                    b2modn
     c                   parm                    w_mtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1MODN'
     c                   call      'FO707C'
     c                   parm                    w_firm
     c                   parm                    c1modn
     c                   parm                    c1mtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1MODN'
     c                   call      'FO707C'
     c                   parm                    w_firm
     c                   parm                    k1modn
     c                   parm                    w_mtxt
     c                   leavesr
     c                   endif
      *
      * Varenummer
      *
     c                   if        w_afld = 'B2VARE'
     c                   eval      w_vare = b2vare
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    w_vtxt
     c                   eval      b2vare = w_vare
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1VARE'
     c                   eval      w_vare = c1vare
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    c1vtxt
     c                   eval      c1vare = w_vare
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1VARE'
     c                   eval      w_vare = k1vare
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    w_vtxt
     c                   eval      k1vare = w_vare
     c                   leavesr
     c                   endif
      *
      * Enhet
      *
     c*                  if        w_afld = 'B2ENHE'
     c*                  if        b2vare <> *blank
     c*                  eval      w_vare = b2vare
     c*                  call      'VE550R'
     c*                  parm                    w_firm
     c*                  parm                    w_vare
     c*                  parm                    b2enhe
     c*                  parm                    w_etxt
     c*                  else
     c*                  call      'VA510R'
     c*                  parm                    w_firm
     c*                  parm                    b2enhe
     c*                  parm                    w_etxt
     c*                  endif
     c*                  leavesr
     c*                  endif
      *
     c*                  if        w_afld = 'C1ENHE'
     c*                  if        c1vare <> *blank
     c*                  eval      w_vare = c1vare
     c*                  call      'VE550R'
     c*                  parm                    w_firm
     c*                  parm                    w_vare
     c*                  parm                    c1enhe
     c*                  parm                    c1etxt
     c*                  else
     c*                  call      'VA510R'
     c*                  parm                    w_firm
     c*                  parm                    c1enhe
     c*                  parm                    c1etxt
     c*                  endif
     c*                  leavesr
     c*                  endif
      *
     c*                  if        w_afld = 'K1ENHE'
     c*                  if        k1vare <> *blank
     c*                  eval      w_vare = k1vare
     c*                  call      'VE550R'
     c*                  parm                    w_firm
     c*                  parm                    w_vare
     c*                  parm                    k1enhe
     c*                  parm                    w_etxt
     c*                  else
     c*                  call      'VA510R'
     c*                  parm                    w_firm
     c*                  parm                    k1enhe
     c*                  parm                    w_etxt
     c*                  endif
     c*                  leavesr
     c*                  endif
      *
      * Leveringstype
      *
6.21 c                   if        w_afld = 'B2LETY'
6.21 c                   call      'VY500R'
6.21 c                   parm                    w_firm
6.21 c                   parm                    b2lety
6.21 c                   parm                    w_ltxt
6.21 c                   leavesr
6.21 c                   endif
6.21  *
6.21 c                   if        w_afld = 'C1LETY'
6.21 c                   call      'VY500R'
6.21 c                   parm                    w_firm
6.21 c                   parm                    c1lety
6.21 c                   parm                    c1ltxt
6.21 c                   leavesr
6.21 c                   endif
6.21  *
6.21 c                   if        w_afld = 'K1LETY'
6.21 c                   call      'VY500R'
6.21 c                   parm                    w_firm
6.21 c                   parm                    k1lety
6.21 c                   parm                    w_ltxt
6.21 c                   leavesr
6.21 c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekker inntastede verdier, og henter beskrivelser
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_input   begsr
      *
     c                   eval      b_feil = *off
      *
     c                   eval      w_gtxt = *blank
     c                   eval      w_lnav = *blank
     c                   eval      w_mtxt = *blank
     c                   eval      w_vtxt = *blank
     c                   eval      w_etxt = *blank
     c                   eval      w_ltxt = *blank
     c                   eval      w_btxt = *blank
      *
      * Bonus-nivå
      *
     c                   if        w_modn <> 0
     c                   if        w_ogrp <> 0 or
     c                             w_ldor <> 0 or
     c                             w_vare <> *blank
     c                   eval      *in34 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   endif
      *
     c                   if        w_vare <> *blank
     c                   if        w_ogrp <> 0 or
     c                             w_ldor <> 0 or
     c                             w_modn <> 0
     c                   eval      *in35 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   endif
      *
      * Overgruppe
      *
     c                   if        w_ogrp <> 0 and
     c                             w_hgrp = 0
     c                   eval      vogrl1_oogr = w_ogrp
     c     vogrl1_key    chain     vogrl1                             41
     c                   if        *in41 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_gtxt = vgotxt
     c                   endif
      *
      * Hovedgruppe
      *
     c                   if        w_hgrp <> 0 and
     c                             w_ugrp = 0
     c                   eval      vhgrl1_hogr = w_ogrp
     c                   eval      vhgrl1_hhgr = w_hgrp
     c     vhgrl1_key    chain     vhgrl1                             42
     c                   if        *in42 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_gtxt = vghtxt
     c                   endif
      *
      * Undergruppe
      *
     c                   if        w_ugrp <> 0
     c                   eval      vugrl1_uogr = w_ogrp
     c                   eval      vugrl1_uhgr = w_hgrp
     c                   eval      vugrl1_uugr = w_ugrp
     c     vugrl1_key    chain     vugrl1                             43
     c                   if        *in43 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_gtxt = vgutxt
     c                   endif
      *
      * Leverandør
      *
     c                   if        w_ldor <> 0
     c                   eval      rlevl1_levr = w_ldor
     c     rlevl1_key    chain     rlevl1                             44
     c                   if        *in44 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_lnav = rlnavn
     c                   endif
      *
      * Modul
      *
     c                   if        w_modn <> 0
     c                   eval      vvarlb_nmod = w_modn
     c     vvarlb_key    chain     vvarlb                             45
     c                   if        *in45 = *on
6.30  * Sjekk også mot JVAR før feilmelding sendes
6.30 c                   eval      jvarlg_modn = w_modn
6.30 c     jvarlg_key    chain     jvarlg                             45
6.30 c                   if        *in45 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
6.30 c                   endif
     c                   call      'FO714C'
     c                   parm                    w_firm
     c                   parm                    w_modn
     c                   parm                    w_mtxt
     c                   endif
      *
      * Varenummer
      *
     c                   if        w_vare <> *blank
     c                   eval      vvarl1_vare = w_vare
     c     vvarl1_key    chain     vvarl1
     c                   if        %found
     c                   eval      w_vtxt = vvtek1
     c                   else
     c                   eval      jvarl1_vare = w_vare
     c     jvarl1_key    chain     jvarl1
     c                   if        not %found
     c                   eval      *in46 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_vtxt = jvtek1
     c                   endif
     c                   endif
      *
      * Enhet
      *
     c*                  if        w_enhe <> *blank
     c*                  eval      venhl1_enhe = w_enhe
     c*    venhl1_key    chain     venhl1                             47
     c*                  if        *in47 = *on
     c*                  eval      b_feil = *on
     c*                  leavesr
     c*                  endif
     c*                  eval      w_etxt = vaetxt
     c*                  endif
      *
      * Leveringstype
      *
6.21 c                   if        w_lety <> 0
6.21 c                   eval      vltpl1_lety = w_lety
6.21 c     vltpl1_key    chain     vltpl1                             48
6.21 c                   if        *in48 = *on
6.21 c                   eval      b_feil = *on
6.21 c                   leavesr
6.21 c                   endif
6.21 c                   eval      w_ltxt = vybesk
6.21 c                   endif
      *
      * Bonustype
      *
     c*                  eval      vbotl1_tbot = w_boty
     c*    vbotl1_key    chain     vbotl1                             49
     c*                  if        *in49 = *on
     c*                  eval      b_feil = *on
     c*                  leavesr
     c*                  endif
     c*                  eval      w_btxt = vatbes
      *
      * Dato
      *
     c                   eval      w_fdat_iso = *loval
     c                   eval      w_tdat_iso = *loval
      *
     c                   if        w_fdat <> 0
     c     *dmy          test(d)                 w_fdat                 50
     c                   if        *in50 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_fdat_iso = %date(w_fdat:*dmy)
     c                   endif
      *
     c                   if        w_tdat <> 0
     c     *dmy          test(d)                 w_tdat                 51
     c                   if        *in51 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_tdat_iso = %date(w_tdat:*dmy)
     c                   endif
      *
     c                   if        w_fdat_iso > w_tdat_iso
     c                   eval      *in52 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
      *
     c                   if        w_fdat <> 0 and
     c                             w_tdat = 0 or
     c                             w_fdat = 0 and
     c                             w_tdat <> 0
     c                   eval      *in53 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Henter beskrivelse
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     hent_info     begsr
      *
     c                   eval      c1gtxt = *blank
     c                   eval      c1lnav = *blank
     c                   eval      c1mtxt = *blank
     c                   eval      c1vtxt = *blank
     c**                 eval      c1etxt = *blank
6.21 c                   eval      c1ltxt = *blank
      *
      * Overgruppe
      *
     c                   if        c1ogrp <> 0 and
     c                             c1hgrp = 0
     c                   eval      vogrl1_oogr = c1ogrp
     c     vogrl1_key    chain     vogrl1
     c                   if        %found
     c                   eval      c1gtxt = vgotxt
     c                   endif
     c                   endif
      *
      * Hovedgruppe
      *
     c                   if        c1hgrp <> 0 and
     c                             c1ugrp = 0
     c                   eval      vhgrl1_hogr = c1ogrp
     c                   eval      vhgrl1_hhgr = c1hgrp
     c     vhgrl1_key    chain     vhgrl1
     c                   if        %found
     c                   eval      c1gtxt = vghtxt
     c                   endif
     c                   endif
      *
      * Undergruppe
      *
     c                   if        c1ugrp <> 0
     c                   eval      vugrl1_uogr = c1ogrp
     c                   eval      vugrl1_uhgr = c1hgrp
     c                   eval      vugrl1_uugr = c1ugrp
     c     vugrl1_key    chain     vugrl1
     c                   if        %found
     c                   eval      c1gtxt = vgutxt
     c                   endif
     c                   endif
      *
      * Leverandør
      *
     c                   if        c1ldor <> 0
     c                   eval      rlevl1_levr = c1ldor
     c     rlevl1_key    chain     rlevl1
     c                   if        %found
     c                   eval      c1lnav = rlnavn
     c                   endif
     c                   endif
      *
      * Modul
      *
     c                   if        c1modn <> 0
     c                   call      'FO714C'
     c                   parm                    w_firm
     c                   parm                    c1modn
     c                   parm                    c1mtxt
     c                   endif
      *
      * Varenummer
      *
     c                   if        c1vare <> *blank
     c                   eval      vvarl1_vare = c1vare
     c     vvarl1_key    chain     vvarl1
     c                   if        %found
     c                   eval      c1vtxt = vvtek1
     c                   else
     c                   eval      jvarl1_vare = c1vare
     c     jvarl1_key    chain     jvarl1
     c                   if        %found
     c                   eval      c1vtxt = jvtek1
     c                   endif
     c                   endif
     c                   endif
      *
      * Enhet
      *
     c*                  if        c1enhe <> *blank
     c*                  eval      venhl1_enhe = c1enhe
     c*    venhl1_key    chain     venhl1
     c*                  if        %found
     c*                  eval      c1etxt = vaetxt
     c*                  endif
     c*                  endif
      *
      * Leveringstype
      *
6.21 c                   if        c1lety <> 0
6.21 c                   eval      vltpl1_lety = c1lety
6.21 c     vltpl1_key    chain     vltpl1
6.21 c                   if        %found
6.21 c                   eval      c1ltxt = vybesk
6.21 c                   endif
6.21 c                   endif
      *
      * Bonustype
      *
     c*                  if        c1boty <> *blank
     c*                  eval      vbotl1_tbot = c1boty
     c*    vbotl1_key    chain     vbotl1
     c*                  if        %found
     c*                  eval      c1btxt = vatbes
     c*                  endif
     c*                  endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_bbot
     c                   parm                    p_bmnr
      *
      * Key for posisjonering på overgruppe
      *
     c     embhi1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    embhi1_hbot
     c                   kfld                    embhi1_hmnr
      *
      * Key for posisjonering på overgruppe
      *
     c     embeir_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_bbot
     c                   kfld                    w_bmnr
      *
      * Key for oppslag på kundebonus
      *
     c     embei1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_bbot
     c                   kfld                    w_bmnr
     c                   kfld                    embei1_eogr
     c                   kfld                    embei1_ehgr
     c                   kfld                    embei1_eugr
     c                   kfld                    embei1_eldo
     c                   kfld                    embei1_emod
     c                   kfld                    embei1_evar
     c                   kfld                    embei1_eenh
     c                   kfld                    embei1_elet
     c                   kfld                    embei1_efda
     c                   kfld                    embei1_etda
      *
      * Key for oppslag på kundebonus
      *
     c     embeiu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_bbot
     c                   kfld                    w_bmnr
     c                   kfld                    embeiu_eogr
     c                   kfld                    embeiu_ehgr
     c                   kfld                    embeiu_eugr
     c                   kfld                    embeiu_eldo
     c                   kfld                    embeiu_emod
     c                   kfld                    embeiu_evar
     c                   kfld                    embeiu_eenh
     c                   kfld                    embeiu_elet
     c                   kfld                    embeiu_efda
     c                   kfld                    embeiu_etda
      *
      * Key for oppslag på overgruppe
      *
     c     vogrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vogrl1_oogr
      *
      * Key for oppslag på hovedgruppe
      *
     c     vhgrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vhgrl1_hogr
     c                   kfld                    vhgrl1_hhgr
      *
      * Key for oppslag på undergruppe
      *
     c     vugrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vugrl1_uogr
     c                   kfld                    vugrl1_uhgr
     c                   kfld                    vugrl1_uugr
      *
      * Key for oppslag på leverandør
      *
     c     rlevl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rlevl1_levr
      *
      * Key for oppslag på vare
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarl1_vare
      *
     c     vvarlb_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarlb_nmod
      *
      * Key for oppslag på enhet
      *
     c     venhl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    venhl1_enhe
      *
      * Key for oppslag på leveringstype
      *
     c     vltpl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vltpl1_lety
      *
      * Key for oppslag på bonustype
      *
     c     vbotl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vbotl1_tbot
      *
      * Key for oppslag på vare (VA)
      *
     c     jvarl1_key    klist
     c                   kfld                    jvarl1_vare
6.30  *
6.30  * Key for oppslag på vare (VA)
6.30  *
6.30 c     jvarlg_key    klist
6.30 c                   kfld                    jvarlg_modn
      *
      * Henter firma og bonuskunde fra parameter
      *
     c                   eval      w_firm = p_firm
     c                   eval      w_bbot = p_bbot
     c                   eval      w_bmnr = p_bmnr
      *
      * Initierer skjermbilde
      *
     c                   eval      b2hbot = w_bbot
     c*                  eval      b2hmnr = w_bmnr
     c                   eval      b2hbes = *blanks
      *
     c                   eval      embhi1_hbot = w_bbot
     c                   eval      embhi1_hmnr = w_bmnr
     c     embhi1_key    chain     embhi1
     c                   if        %found
     c                   eval      b2hbes = emhbes
     c                   endif
      *
     c                   eval      *in22 = *on
      *
      * Posisjonerer databasen, og fyller opp subfile
      *
     c     embeir_key    setll     embeir
      *
     c                   exsr      crt_subfile
      *
     c                   endsr
