     h/title  ASOFAK: Jobb-register status, Sjekk om kode er satt
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FA721R
      * Beskrivelse . . : Jobb-register status, Sjekk om kode er satt
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *K000   250820 bsa  Sjekker om kode er satt
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffjobl1    if a e           k disk    rename(fjobpfr:fjobl1r)
      *
      * Definering av parametre
      *
     d p_kode          s              2  0
     d p_onof          s              1  0
      *
      * Definering av variable
      *
     d w_firm          s                   like(fajfir)
     d w_date          s                   like(fada01)
     d w_time          s                   like(fati01)
      *
     d                uds
     d  l_wsid               901    910
     d  l_user               911    920
     d  l_firm               944    946  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Oppdaterer status for igangsatt/avsluttet jobb
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Dersom Jobb-status-register er tomt,
      *  må aktuell record opprettes først
      *
     c                   eval      p_onof = 0
      *
     c     fjobl1_key    chain     fjobl1
      *
     c                   if        %found
      * OFAK overføring til økonomi
     c                   if        p_kode = 01 and
     c                             fajb01 = 1
     c                   eval      p_onof = 1
     c                   goto      xslutt
     c                   endif
      * OKON overføring til økonomi
     c                   if        p_kode = 02 and
     c                             fajb02 = 1
     c                   eval      p_onof = 1
     c                   goto      xslutt
     c                   endif
      * Butikk avstemming
     c                   if        p_kode = 03 and
     c                             fajb03 = 1
     c                   eval      p_onof = 1
     c                   goto      xslutt
     c                   endif
      * Butikk overføring til økonomi
     c                   if        p_kode = 04 and
     c                             fajb04 = 1
     c                   eval      p_onof = 1
     c                   goto      xslutt
     c                   endif
      * LAGR inngående faktura startet
     c                   if        p_kode = 05 and
     c                             fajb05 = 1
     c                   eval      p_onof = 1
     c                   goto      xslutt
     c                   endif
      * LAGR overføring til økonomi
     c                   if        p_kode = 06 and
     c                             fajb06 = 1
     c                   eval      p_onof = 1
     c                   goto      xslutt
     c                   endif
      * LAGR hente EDI meldinger
     c                   if        p_kode = 07 and
     c                             fajb07 = 1
     c                   eval      p_onof = 1
     c                   goto      xslutt
     c                   endif
      * OKON Posteringer til Compello
     c                   if        p_kode = 08 and
     c                             fajb08 = 1
     c                   eval      p_onof = 1
     c                   goto      xslutt
     c                   endif
      * Ledig
     c                   if        p_kode = 09 and
     c                             fajb09 = 1
     c                   eval      p_onof = 1
     c                   goto      xslutt
     c                   endif
      * Ledig
     c                   if        p_kode = 10 and
     c                             fajb10 = 1
     c                   eval      p_onof = 1
     c                   goto      xslutt
     c                   endif
      *
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Avslutt program                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr  = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      *  Tar inn parameter fra forrige program
      *
     c     *entry        plist
     c                   parm                    p_kode
     c                   parm                    p_onof
      *
      * Key for file : Jobb-register
      *
     c     fjobl1_key    klist
     c                   kfld                    w_firm
      *
      * Legger inn firma i nøkkler
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
