     h/title  ASOFAK: Jobb-register status, Tilgangskontroll
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FA730R
      * Beskrivelse . . : Jobb-register status, Tilgangskontroll
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
6.30  * 6.30  150616 bsa  Lagt til ny feilmelding (7)
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffjobl1    if   e           k disk    rename(fjobpfr:fjobl1r)
     ffa730d    cf   e             workstn
      *
      * Definering av array
      *
     d a_meld          s             50    dim(10) ctdata perrcd(1)              MELDINGER
      *
      * Definering av LDA
      *
     d                uds
     d  l_firm               944    946  0
      *
      * Definering av parametre
      *
     d p_kode          s              2  0
     d p_onof          s              1  0
      *
      * Definering av variable
      *
     d w_firm          s                   like(fajfir)
     d w_stop          s              1  0
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekker status og sender svar tilbake
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Sjekker status i Jobb-register
      *
     c     nytest        tag
     c                   eval      w_stop = 0
     c                   eval      a1svar = 1
      *
     c     fjobl1_key    chain     fjobl1r                            90
     c                   if        *in90  = *off
      *
     c                   if        p_kode = 01
     c                   eval      p_onof = fajb01
     c                   eval      w_stop = fajb01
     c                   end
      *
     c                   if        p_kode = 02
     c                   eval      p_onof = fajb02
     c                   eval      w_stop = fajb02
     c                   end
      *
     c                   if        p_kode = 03
     c                   eval      p_onof = fajb03
     c                   eval      w_stop = fajb03
     c                   end
      *
     c                   if        p_kode = 04
     c                   eval      p_onof = fajb04
     c                   eval      w_stop = fajb04
     c                   end
      *
     c                   if        p_kode = 05
     c                   eval      p_onof = fajb05
     c                   eval      w_stop = fajb05
     c                   end
      *
     c                   if        p_kode = 06
     c                   eval      p_onof = fajb06
     c                   eval      w_stop = fajb06
     c                   end
      *
     c                   if        p_kode = 07
     c                   eval      p_onof = fajb07
     c                   eval      w_stop = fajb07
     c                   end
      *
     c                   if        p_kode = 08
     c                   eval      p_onof = fajb08
     c                   eval      w_stop = fajb08
     c                   end
      *
     c                   if        p_kode = 09
     c                   eval      p_onof = fajb09
     c                   eval      w_stop = fajb09
     c                   end
      *
     c                   if        p_kode = 10
     c                   eval      p_onof = fajb10
     c                   eval      w_stop = fajb10
     c                   end
      *
     c                   end
      *
      * Sende melding dersom det ble funnet aktive jobber
      *
     c                   if        w_stop = 1
     c                   eval      a1meld = a_meld(p_kode)
      *
     c                   exfmt     a1win
      *
     c                   if        a1svar = 1
     c                   goto      nytest
     c                   endif
      *
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xslutt        tag
     c                   eval      *inlr  = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      *  Tar inn parameter fra forrige program
      *
     c     *entry        plist
     c                   parm                    p_kode
     c                   parm                    p_onof
      *
      * Key for file : Jobb-register
      *
     c     fjobl1_key    klist
     c                   kfld                    w_firm
      *
      * Legger inn firma i nøkkler
      *
     c                   eval      w_firm = l_firm
      *
     csr                 endsr
      *
**
Fakturering kjøres fra en annen skjerm                ASOFAK
Oppdatering av regnskap kjøres fra en annen skjerm    ASOFAK
Avstemmingsliste kjøres fra en annen skjerm           ASSHOP
Oppdatering av regnskap kjøres fra en annen skjerm    ASSHOP
Inngående pakkseddel kjøres fra en annen skjerm       ASLAGR
Oppdatering av regnskap kjøres fra en annen skjerm    ASLAGR
Henting av EDI meldinger kjøres fra en annen skjerm   ASLAGR
Ledig 8 . . . .                                       ASxxxx
Ledig 9 . . . .                                       ASxxxx
Ledig 10. . . .                                       ASxxxx
