     h/title  ASOFAK: Jobb-register status, Tilgangskontroll
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FA731R
      * Beskrivelse . . : Jobb-register status, Tilgangskontroll
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       200924 bsa  Nytt program sjekking av aktivitet.
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffjobl1    if   e           k disk    rename(fjobpfr:fjobl1r)
      *
      * Definering av LDA
      *
     d                uds
     d  l_firm               944    946  0
      *
      * Definering av parametre
      *
     d p_kode          s              2  0
     d p_onof          s              1  0
      *
      * Definering av variable
      *
     d w_firm          s                   like(fajfir)
     d w_stop          s              1  0
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekker status og sender svar tilbake
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Sjekker status i Jobb-register
      *
      *
     c     fjobl1_key    chain     fjobl1r
     c                   if        %found
      *
     c                   if        p_kode = 01
     c                   eval      p_onof = fajb01
     c                   end
      *
     c                   if        p_kode = 02
     c                   eval      p_onof = fajb02
     c                   end
      *
     c                   if        p_kode = 03
     c                   eval      p_onof = fajb03
     c                   end
      *
     c                   if        p_kode = 04
     c                   eval      p_onof = fajb04
     c                   end
      *
     c                   if        p_kode = 05
     c                   eval      p_onof = fajb05
     c                   end
      *
     c                   if        p_kode = 06
     c                   eval      p_onof = fajb06
     c                   end
      *
     c                   if        p_kode = 07
     c                   eval      p_onof = fajb07
     c                   end
      *
     c                   if        p_kode = 08
     c                   eval      p_onof = fajb08
     c                   end
      *
     c                   if        p_kode = 09
     c                   eval      p_onof = fajb09
     c                   end
      *
     c                   if        p_kode = 10
     c                   eval      p_onof = fajb10
     c                   end
      *
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xslutt        tag
     c                   eval      *inlr  = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      *  Tar inn parameter fra forrige program
      *
     c     *entry        plist
     c                   parm                    p_kode
     c                   parm                    p_onof
      *
      * Key for file : Jobb-register
      *
     c     fjobl1_key    klist
     c                   kfld                    w_firm
      *
      * Legger inn firma i nøkkler
      *
     c                   eval      w_firm = l_firm
     c                   eval      p_onof = 0
      *
     csr                 endsr
      *
