      /TITLE  Fix DHTRPF
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : FIXDHTRPF                                           *
      * Beskrivelse . . :                                                     *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *       110102 HFL  Nytt program
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     fdhtrl1    uf   e           k disk    rename(dhtrpfr:dhtrl1r)
      *
     d                uds
     d lcuser                911    920
     d lcfirm                944    946  0
     d lcnavn                951    980
      *
     d w_firm          s              3  0
      *
T400  * Definering av variable for timestamp
      *
T400 d w_tmst          s               z
T400 d w_tmst_20       s             20
T400 d w_tell          s              6  0
T400 d w_tell_alf      s              6
      *
      * Leser poster
      *
     c     dhtrl1_key    setll     dhtrl1
     c     dhtrl1_key    reade     dhtrl1                                 90
      *
     c                   dow       *in90 = *off
      *
T400  * Teller/Timestamp
      *
T400 c                   eval      w_tell = w_tell + 1
T400 c                   move      w_tell        w_tell_alf
T400 c     *iso0         move      ddtist        w_tmst_20
T400 c                   move      w_tell_alf    w_tmst_20
T400 c     *iso0         move      w_tmst_20     ddtist
      *
     c                   update    dhtrl1r
     c     dhtrl1_key    reade     dhtrl1                                 90
     c                   enddo
      *
     c     slutt         tag
      *
     c                   eval      *inlr = *on
      **
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c     dhtrl1_key    klist
     c                   kfld                    w_firm
      *
     c                   eval      w_firm  = 0
      *
     c                   endsr
