      /TITLE  Fiks GATRPF mhp felt fra XML format
     h dftname(nh120r) datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * System. . . . . : ASOKON                                        *     *
      * Program . . . . : FIXGATRX                                      *
      * Beskrivelse . . : Konvertering
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.31  * 200324 mst  Mangler opplysninger i felt
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     fgatrpf    uf   e           k disk
      *
     d                uds
     d l_wsid                901    910
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      *
     d w_reco          s                   like(gbreco)
      *
T5.00d datas           ds            80
     d w_wss                   1      1
      *
     c     dummy         tag
     c                   read      gatrpfr                                60                   60
     c                   if        *in60 = '1'
     c                   eval      *inlr = '1'
     c                   goto      slutt
     c                   endif
      *
     c                   z-add     l_firm        gbfirm
     c                   clear                   gbgiro
     c                   clear                   gblØpn
     c                   clear                   gbtype
     c                   clear                   gbtell
     c                   clear                   gboppd
     c                   clear                   gbdato
     c                   time                    gbklok
     c                   clear                   gbfgrp
      *                                                                 .
      *
     c                   update    gatrpfr
     c                   goto      dummy
      *
     c     slutt         tag
      *
      *
