      /TITLE  ASOFAK Opprydding i filer
     h option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FO406R
      * Beskrivelse . . : Endre firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
      * 6.10  220609 BSA  Oppdatert med sporingsinformasjon
7.01  *k00  030620 BOF NXS-1195  kompilert pga tab.utvidelse
8.01  *PRG2   210622 bof  Utvidet prisgruppe fra 1 til 2 posisjoner
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffdell1    if   e           k disk    rename(fdelpfr:fdell1r)
     ffdellu    o    e           k disk    rename(fdelpfr:fdellur)
     ffenkl1    if   e           k disk    rename(fenkpfr:fenkl1r)
     ffenklu    o    e           k disk    rename(fenkpfr:fenklur)
     ffftxl1    if   e           k disk    rename(fftxpfr:fftxl1r)
     ffftxlu    o    e           k disk    rename(fftxpfr:fftxlur)
     ffgebl1    if   e           k disk    rename(fgebpfr:fgebl1r)
     ffgeblu    o    e           k disk    rename(fgebpfr:fgeblur)
     ffjobl1    if   e           k disk    rename(fjobpfr:fjobl1r)
     ffjoblu    o    e           k disk    rename(fjobpfr:fjoblur)
     ffkdil1    if   e           k disk    rename(fkdipfr:fkdil1r)
     ffkdilu    o    e           k disk    rename(fkdipfr:fkdilur)
     ffkprl1    if   e           k disk    rename(fkprpfr:fkprl1r)
     ffkprlu    o    e           k disk    rename(fkprpfr:fkprlur)
     ffkpsl1    if   e           k disk    rename(fkpspfr:fkpsl1r)
     ffkpslu    o    e           k disk    rename(fkpspfr:fkpslur)
     fflval1    if   e           k disk    rename(flvapfr:flval1r)
     fflvalu    o    e           k disk    rename(flvapfr:flvalur)
     ffodtl1    if   e           k disk    rename(fodtpfr:fodtl1r)
     ffodtlu    o    e           k disk    rename(fodtpfr:fodtlur)
     ffohel1    if   e           k disk    rename(fohepfr:fohel1r)
     ffohelu    o    e           k disk    rename(fohepfr:fohelur)
     ffotxl1    if   e           k disk    rename(fotxpfr:fotxl1r)
     ffotxlu    o    e           k disk    rename(fotxpfr:fotxlur)
     ffplll1    if   e           k disk    rename(fpllpfr:fplll1r)
     ffplllu    o    e           k disk    rename(fpllpfr:fplllur)
     ffplol1    if   e           k disk    rename(fplopfr:fplol1r)
     ffplolu    o    e           k disk    rename(fplopfr:fplolur)
     ffpm1l1    if   e           k disk    rename(fpm1pfr:fpm1l1r)
     ffpm1lu    o    e           k disk    rename(fpm1pfr:fpm1lur)
     ffpm2l1    if   e           k disk    rename(fpm2pfr:fpm2l1r)
     ffpm2lu    o    e           k disk    rename(fpm2pfr:fpm2lur)
     ffprcl1    if   e           k disk    rename(fprcpfr:fprcl1r)
     ffprclu    o    e           k disk    rename(fprcpfr:fprclur)
     ffpril1    if   e           k disk    rename(fpripfr:fpril1r)
     ffprilu    o    e           k disk    rename(fpripfr:fprilur)
     ffpsol1    if   e           k disk    rename(fpsopfr:fpsol1r)
     ffpsolu    o    e           k disk    rename(fpsopfr:fpsolur)
     ffrabl1    if   e           k disk    rename(frabpfr:frabl1r)
     ffrablu    o    e           k disk    rename(frabpfr:frablur)
     ffstsl1    if   e           k disk    rename(fstspfr:fstsl1r)
     ffstslu    o    e           k disk    rename(fstspfr:fstslur)
     ffusrl1    if   e           k disk    rename(fusrpfr:fusrl1r)
     ffusrlu    o    e           k disk    rename(fusrpfr:fusrlur)
     fsodtl1    if   e           k disk    rename(sodtpfr:sodtl1r)
     fsodtlu    o    e           k disk    rename(sodtpfr:sodtlur)
     fsohel1    if   e           k disk    rename(sohepfr:sohel1r)
     fsohelu    o    e           k disk    rename(sohepfr:sohelur)
      *
     d                uds
     d l_user                911    920
     d l_fgrp                931    933
     d l_firm                944    946  0
     d l_navn                951    980
      *
     d w_firm          s              3  0
      *
      * Ordre-slettet
      *
     c     fdell1_key    setll     fdell1                                 90
     c     fdell1_key    reade     fdell1                                 90
     c                   dow       *in90 = *off
     c                   eval      fyfirm = w_firm
6.10 c                   time                    fyodat
6.10 c                   time                    fyotim
6.10 c                   eval      fyousr = l_user
6.10 c                   time                    fyedat
6.10 c                   time                    fyetim
6.10 c                   eval      fyeusr = l_user
     c                   write     fdellur
     c     fdell1_key    reade     fdell1                                 90
     c                   enddo
      *
      * Enhet konvertering
      *
     c     fenkl1_key    setll     fenkl1                                 90
     c     fenkl1_key    reade     fenkl1                                 90
     c                   dow       *in90 = *off
     c                   eval      fefirm = w_firm
     c                   write     fenklur
     c     fenkl1_key    reade     fenkl1                                 90
     c                   enddo
      *
      * Fast ordre-tekst
      *
     c     fftxl1_key    setll     fftxl1                                 90
     c     fftxl1_key    reade     fftxl1                                 90
     c                   dow       *in90 = *off
     c                   eval      fjfirm = w_firm
6.10 c                   time                    fjodat
6.10 c                   time                    fjotim
6.10 c                   eval      fjousr = l_user
6.10 c                   time                    fjedat
6.10 c                   time                    fjetim
6.10 c                   eval      fjeusr = l_user
     c                   write     fftxlur
     c     fftxl1_key    reade     fftxl1                                 90
     c                   enddo
      *
      * Gebyr
      *
     c     fgebl1_key    setll     fgebl1                                 90
     c     fgebl1_key    reade     fgebl1                                 90
     c                   dow       *in90 = *off
     c                   eval      fgfirm = w_firm
6.10 c                   time                    fgodat
6.10 c                   time                    fgotim
6.10 c                   eval      fgousr = l_user
6.10 c                   time                    fgedat
6.10 c                   time                    fgetim
6.10 c                   eval      fgeusr = l_user
     c                   write     fgeblur
     c     fgebl1_key    reade     fgebl1                                 90
     c                   enddo
      *
      * Job-register
      *
     c     fjobl1_key    setll     fjobl1                                 90
     c     fjobl1_key    reade     fjobl1                                 90
     c                   dow       *in90 = *off
     c                   eval      fajfir = w_firm
6.10 c                   time                    fajoda
6.10 c                   time                    fajoti
6.10 c                   eval      fajous = l_user
6.10 c                   time                    fajeda
6.10 c                   time                    fajeti
6.10 c                   eval      fajeus = l_user
     c                   write     fjoblur
     c     fjobl1_key    reade     fjobl1                                 90
     c                   enddo
      *
      * Kunde distribusjonsliste
      *
     c     fkdil1_key    setll     fkdil1                                 90
     c     fkdil1_key    reade     fkdil1                                 90
     c                   dow       *in90 = *off
     c                   eval      fhfirm = w_firm
6.10 c                   time                    fhodat
6.10 c                   time                    fhotim
6.10 c                   eval      fhousr = l_user
6.10 c                   time                    fhedat
6.10 c                   time                    fhetim
6.10 c                   eval      fheusr = l_user
     c                   write     fkdilur
     c     fkdil1_key    reade     fkdil1                                 90
     c                   enddo
      *
      * Kundeprosjekt
      *
     c     fkprl1_key    setll     fkprl1                                 90
     c     fkprl1_key    reade     fkprl1                                 90
     c                   dow       *in90 = *off
     c                   eval      flfirm = w_firm
6.10 c                   time                    flodat
6.10 c                   time                    flotim
6.10 c                   eval      flousr = l_user
6.10 c                   time                    fledat
6.10 c                   time                    fletim
6.10 c                   eval      fleusr = l_user
     c                   write     fkprlur
     c     fkprl1_key    reade     fkprl1                                 90
     c                   enddo
      *
      * Kundeprosjekt søketekst
      *
     c     fkpsl1_key    setll     fkpsl1                                 90
     c     fkpsl1_key    reade     fkpsl1                                 90
     c                   dow       *in90 = *off
     c                   eval      flsfir = w_firm
6.10 c                   time                    flsoda
6.10 c                   time                    flsoti
6.10 c                   eval      flsous = l_user
6.10 c                   time                    flseda
6.10 c                   time                    flseti
6.10 c                   eval      flseus = l_user
     c                   write     fkpslur
     c     fkpsl1_key    reade     fkpsl1                                 90
     c                   enddo
      *
      * Leverandør vare
      *
     c     flval1_key    setll     flval1                                 90
     c     flval1_key    reade     flval1                                 90
     c                   dow       *in90 = *off
     c                   eval      fwfirm = w_firm
6.10 c                   time                    fwodat
6.10 c                   time                    fwotim
6.10 c                   eval      fwousr = l_user
6.10 c                   time                    fwedat
6.10 c                   time                    fwetim
6.10 c                   eval      fweusr = l_user
     c                   write     flvalur
     c     flval1_key    reade     flval1                                 90
     c                   enddo
      *
      * Orderlinje
      *
     c     fodtl1_key    setll     fodtl1                                 90
     c     fodtl1_key    reade     fodtl1                                 90
     c                   dow       *in90 = *off
     c                   eval      fdfirm = w_firm
6.10 c                   time                    fdodat
6.10 c                   time                    fdotim
6.10 c                   eval      fdoous = l_user
6.10 c                   time                    fdedat
6.10 c                   time                    fdetim
6.10 c                   eval      fdeusr = l_user
     c                   write     fodtlur
     c     fodtl1_key    reade     fodtl1                                 90
     c                   enddo
      *
      * Ordrehode
      *
     c     fohel1_key    setll     fohel1                                 90
     c     fohel1_key    reade     fohel1                                 90
     c                   dow       *in90 = *off
     c                   eval      fofirm = w_firm
6.10 c                   time                    fodate
6.10 c                   time                    fotime
6.10 c                   eval      fooous = l_user
6.10 c                   time                    foedat
6.10 c                   time                    foetim
6.10 c                   eval      foeusr = l_user
     c                   write     fohelur
     c     fohel1_key    reade     fohel1                                 90
     c                   enddo
      *
      * Ordretekst
      *
     c     fotxl1_key    setll     fotxl1                                 90
     c     fotxl1_key    reade     fotxl1                                 90
     c                   dow       *in90 = *off
     c                   eval      ftfirm = w_firm
6.10 c                   time                    ftodat
6.10 c                   time                    ftotim
6.10 c                   eval      ftousr = l_user
6.10 c                   time                    ftedat
6.10 c                   time                    ftetim
6.10 c                   eval      fteusr = l_user
     c                   write     fotxlur
     c     fotxl1_key    reade     fotxl1                                 90
     c                   enddo
      *
      * Utplukk linje
      *
     c     fplll1_key    setll     fplll1                                 90
     c     fplll1_key    reade     fplll1                                 90
     c                   dow       *in90 = *off
     c                   eval      fklfir = w_firm
     c                   write     fplllur
     c     fplll1_key    reade     fplll1                                 90
     c                   enddo
      *
      * Utplukk param
      *
     c     fplol1_key    setll     fplol1                                 90
     c     fplol1_key    reade     fplol1                                 90
     c                   dow       *in90 = *off
     c                   eval      fkpfir = w_firm
     c                   write     fplolur
     c     fplol1_key    reade     fplol1                                 90
     c                   enddo
      *
      * Utplukk Plukk1 linje
      *
     c     fpm1l1_key    setll     fpm1l1                                 90
     c     fpm1l1_key    reade     fpm1l1                                 90
     c                   dow       *in90 = *off
     c                   eval      fk1fir = w_firm
     c                   write     fpm1lur
     c     fpm1l1_key    reade     fpm1l1                                 90
     c                   enddo
      *
      * Utplukk plukk 2 linje
      *
     c     fpm2l1_key    setll     fpm2l1                                 90
     c     fpm2l1_key    reade     fpm2l1                                 90
     c                   dow       *in90 = *off
     c                   eval      fk2fir = w_firm
     c                   write     fpm2lur
     c     fpm2l1_key    reade     fpm2l1                                 90
     c                   enddo
      *
      * Pris record-format
      *
     c     fprcl1_key    setll     fprcl1                                 90
     c     fprcl1_key    reade     fprcl1                                 90
     c                   dow       *in90 = *off
     c                   eval      fcfirm = w_firm
6.10 c                   time                    fcodat
6.10 c                   time                    fcotim
6.10 c                   eval      fcousr = l_user
6.10 c                   time                    fcedat
6.10 c                   time                    fcetim
6.10 c                   eval      fceusr = l_user
     c                   write     fprclur
     c     fprcl1_key    reade     fprcl1                                 90
     c                   enddo
      *
      * Spesialpris
      *
     c     fpril1_key    setll     fpril1                                 90
     c     fpril1_key    reade     fpril1                                 90
     c                   dow       *in90 = *off
     c                   eval      fpfirm = w_firm
6.10 c                   time                    fpodat
6.10 c                   time                    fpotim
6.10 c                   eval      fpousr = l_user
6.10 c                   time                    fpedat
6.10 c                   time                    fpetim
6.10 c                   eval      fpeusr = l_user
     c                   write     fprilur
     c     fpril1_key    reade     fpril1                                 90
     c                   enddo
      *
      * Plukk S-linje
      *
     c     fpsol1_key    setll     fpsol1                                 90
     c     fpsol1_key    reade     fpsol1                                 90
     c                   dow       *in90 = *off
     c                   eval      fksfir = w_firm
     c                   write     fpsolur
     c     fpsol1_key    reade     fpsol1                                 90
     c                   enddo
      *
      * Rabattmatrise
      *
     c     frabl1_key    setll     frabl1                                 90
     c     frabl1_key    reade     frabl1                                 90
     c                   dow       *in90 = *off
     c                   eval      frfirm = w_firm
6.10 c                   time                    frodat
6.10 c                   time                    frotim
6.10 c                   eval      frousr = l_user
6.10 c                   time                    fredat
6.10 c                   time                    fretim
6.10 c                   eval      freusr = l_user
     c                   write     frablur
     c     frabl1_key    reade     frabl1                                 90
     c                   enddo
      *
      * Ofak - kode
      *
     c     fstsl1_key    setll     fstsl1                                 90
     c     fstsl1_key    reade     fstsl1                                 90
     c                   dow       *in90 = *off
     c                   eval      faafir = w_firm
6.10 c                   time                    faaoda
6.10 c                   time                    faaoti
6.10 c                   eval      faaous = l_user
6.10 c                   time                    faaeda
6.10 c                   time                    faaeti
6.10 c                   eval      faaeus = l_user
     c                   write     fstslur
     c     fstsl1_key    reade     fstsl1                                 90
     c                   enddo
      *
      * User
      *
     c     fusrl1_key    setll     fusrl1                                 90
     c     fusrl1_key    reade     fusrl1                                 90
     c                   dow       *in90 = *off
     c                   eval      fbfirm = w_firm
6.10 c                   time                    fbodat
6.10 c                   time                    fbotim
6.10 c                   eval      fbousr = l_user
6.10 c                   time                    fbedat
6.10 c                   time                    fbetim
6.10 c                   eval      fbeusr = l_user
     c                   write     fusrlur
     c     fusrl1_key    reade     fusrl1                                 90
     c                   enddo
      *
      * Faktura-linjer
      *
     c     sodtl1_key    setll     sodtl1                                 90
     c     sodtl1_key    reade     sodtl1                                 90
     c                   dow       *in90 = *off
     c                   eval      sdfirm = w_firm
6.10 c                   time                    sdodat
6.10 c                   time                    sdotim
6.10 c                   eval      sdousr = l_user
6.10 c                   time                    sdedat
6.10 c                   time                    sdetim
6.10 c                   eval      sdeusr = l_user
     c                   write     sodtlur
     c     sodtl1_key    reade     sodtl1                                 90
     c                   enddo
      *
      * Faktura-hode
      *
     c     sohel1_key    setll     sohel1                                 90
     c     sohel1_key    reade     sohel1                                 90
     c                   dow       *in90 = *off
     c                   eval      sofirm = w_firm
6.10 c                   time                    sodate
6.10 c                   time                    sotime
6.10 c                   eval      soousr = l_user
6.10 c                   time                    soedat
6.10 c                   time                    soetim
6.10 c                   eval      soeusr = l_user
     c                   write     sohelur
     c     sohel1_key    reade     sohel1                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    w_firm
      *
     c     fdell1_key    klist
     c                   kfld                    l_firm
      *
     c     fenkl1_key    klist
     c                   kfld                    l_firm
      *
     c     fftxl1_key    klist
     c                   kfld                    l_firm
      *
     c     fgebl1_key    klist
     c                   kfld                    l_firm
      *
     c     fjobl1_key    klist
     c                   kfld                    l_firm
      *
     c     fkdil1_key    klist
     c                   kfld                    l_firm
      *
     c     fkprl1_key    klist
     c                   kfld                    l_firm
      *
     c     fkpsl1_key    klist
     c                   kfld                    l_firm
      *
     c     flval1_key    klist
     c                   kfld                    l_firm
      *
     c     fodtl1_key    klist
     c                   kfld                    l_firm
      *
     c     fohel1_key    klist
     c                   kfld                    l_firm
      *
     c     fotxl1_key    klist
     c                   kfld                    l_firm
      *
     c     fplll1_key    klist
     c                   kfld                    l_firm
      *
     c     fplol1_key    klist
     c                   kfld                    l_firm
      *
     c     fpm1l1_key    klist
     c                   kfld                    l_firm
      *
     c     fpm2l1_key    klist
     c                   kfld                    l_firm
      *
     c     fprcl1_key    klist
     c                   kfld                    l_firm
      *
     c     fpril1_key    klist
     c                   kfld                    l_firm
      *
     c     fpsol1_key    klist
     c                   kfld                    l_firm
      *
     c     frabl1_key    klist
     c                   kfld                    l_firm
      *
     c     fstsl1_key    klist
     c                   kfld                    l_firm
      *
     c     fusrl1_key    klist
     c                   kfld                    l_firm
      *
     c     sodtl1_key    klist
     c                   kfld                    l_firm
      *
     c     sohel1_key    klist
     c                   kfld                    l_firm
      *
     c                   endsr
