     h option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FO405R
      * Beskrivelse . . : Kopier firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
      * 6.10  250609 BSA  Oppdatert med sporingsinformasjon
6.11  * 6.10  070110 bof  Utividet med VVEPPF
6.20  * 6.20  041110 bof  utvidet nøkkel vsdtpf/vshepf
6.21  * 6.20  210311 bof  utvidet nøkkel vvprpf
6.22  * 6.20  020511 bof  utvidet nøkkel vtilpf
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvahgl1    if   e           k disk    rename(vahgpfr:vahgl1r)
     fvahglu    o    e           k disk    rename(vahgpfr:vahglur)
     fvaugl1    if   e           k disk    rename(vaugpfr:vaugl1r)
     fvauglu    o    e           k disk    rename(vaugpfr:vauglur)
     fvbldl1    if   e           k disk    rename(vbldpfr:vbldl1r)
     fvbldlu    o    e           k disk    rename(vbldpfr:vbldlur)
     fveanl1    if   e           k disk    rename(veanpfr:veanl1r)
     fveanlu    o    e           k disk    rename(veanpfr:veanlur)
     fvenhl1    if   e           k disk    rename(venhpfr:venhl1r)
     fvenhlu    o    e           k disk    rename(venhpfr:venhlur)
     fvetil1    if   e           k disk    rename(vetipfr:vetil1r)
     fvetilu    o    e           k disk    rename(vetipfr:vetilur)
     fvfaspf    if   e           k disk    rename(vfaspfr:vfaspfr)
     fvfaslu    o    e           k disk    rename(vfaspfr:vfaslur)
     fvhgrl1    if   e           k disk    rename(vhgrpfr:vhgrl1r)
     fvhgrlu    o    e           k disk    rename(vhgrpfr:vhgrlur)
     fvhisl1    if   e           k disk    rename(vhispfr:vhisl1r)
     fvhislu    o    e           k disk    rename(vhispfr:vhislur)
     fvinfl1    if   e           k disk    rename(vinfpfr:vinfl1r)
     fvinflu    o    e           k disk    rename(vinfpfr:vinflur)
     fvkhvl1    if   e           k disk    rename(vkhvpfr:vkhvl1r)
     fvkhvlu    o    e           k disk    rename(vkhvpfr:vkhvlur)
     fvlagl1    if   e           k disk    rename(vlagpfr:vlagl1r)
     fvlaglu    o    e           k disk    rename(vlagpfr:vlaglur)
     fvltyl1    if   e           k disk    rename(vltypfr:vltyl1r)
     fvltylu    o    e           k disk    rename(vltypfr:vltylur)
     fvltpl1    if   e           k disk    rename(vltppfr:vltpl1r)
     fvltplu    o    e           k disk    rename(vltppfr:vltplur)
     fvogrl1    if   e           k disk    rename(vogrpfr:vogrl1r)
     fvogrlu    o    e           k disk    rename(vogrpfr:vogrlur)
     fvotyl1    if   e           k disk    rename(votypfr:votyl1r)
     fvotylu    o    e           k disk    rename(votypfr:votylur)
     fvparpf    if   e           k disk    rename(vparpfr:vparpfr)
     fvparlu    o    e           k disk    rename(vparpfr:vparlur)
     fvpdtl1    if   e           k disk    rename(vpdtpfr:vpdtl1r)
     fvpdtlu    o    e           k disk    rename(vpdtpfr:vpdtlur)
     fvphel1    if   e           k disk    rename(vphepfr:vphel1r)
     fvphelu    o    e           k disk    rename(vphepfr:vphelur)
     fvpkol1    if   e           k disk    rename(vpkopfr:vpkol1r)
     fvpkolu    o    e           k disk    rename(vpkopfr:vpkolur)
     fvsdtl1    if   e           k disk    rename(vsdtpfr:vsdtl1r)
     fvsdtlu    o    e           k disk    rename(vsdtpfr:vsdtlur)
     fvshel1    if   e           k disk    rename(vshepfr:vshel1r)
     fvshelu    o    e           k disk    rename(vshepfr:vshelur)
     fvstrl1    if   e           k disk    rename(vstrpfr:vstrl1r)
     fvstrlu    o    e           k disk    rename(vstrpfr:vstrlur)
     fvsokl1    if   e           k disk    rename(vsokpfr:vsokl1r)
     fvsoklu    o    e           k disk    rename(vsokpfr:vsoklur)
     fvtill1    if   e           k disk    rename(vtilpfr:vtill1r)
     fvtillu    o    e           k disk    rename(vtilpfr:vtillur)
     fvugrl1    if   e           k disk    rename(vugrpfr:vugrl1r)
     fvugrlu    o    e           k disk    rename(vugrpfr:vugrlur)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     fvvarlu    o    e           k disk    rename(vvarpfr:vvarlur)
     fvvasl1    if   e           k disk    rename(vvaspfr:vvasl1r)
     fvvaslu    o    e           k disk    rename(vvaspfr:vvaslur)
     fvvenl1    if   e           k disk    rename(vvenpfr:vvenl1r)
     fvvenlu    o    e           k disk    rename(vvenpfr:vvenlur)
     fvvepl1    if   e           k disk    rename(vveppfr:vvepl1r)
     fvveplu    o    e           k disk    rename(vveppfr:vveplur)
     fvvgkl1    if   e           k disk    rename(vvgkpfr:vvgkl1r)
     fvvgklu    o    e           k disk    rename(vvgkpfr:vvgklur)
     fvvprl1    if   e           k disk    rename(vvprpfr:vvprl1r)
     fvvprlu    o    e           k disk    rename(vvprpfr:vvprlur)
     fvvsol1    if   e           k disk    rename(vvsopfr:vvsol1r)
     fvvsolu    o    e           k disk    rename(vvsopfr:vvsolur)
     fvvtyl1    if   e           k disk    rename(vvtypfr:vvtyl1r)
     fvvtylu    o    e           k disk    rename(vvtypfr:vvtylur)
      *
     d                uds
     d l_user                911    920
     d l_fgrp                931    933
     d l_firm                944    946  0
     d l_navn                951    980
      *
     d w_firm          s              3  0
      *
      * Alternativ hovedgruppe
      *
     c     vahgl1_key    setll     vahgl1                                 90
     c     vahgl1_key    reade     vahgl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vfhfir = w_firm
6.10 c                   time                    vfhoda
6.10 c                   time                    vfhoti
6.10 c                   eval      vfhous = l_user
6.10 c                   time                    vfheda
6.10 c                   time                    vfheti
6.10 c                   eval      vfheus = l_user
     c                   write     vahglur
     c     vahgl1_key    reade     vahgl1                                 90
     c                   enddo
      *
      * Alternativ undergruppe
      *
     c     vaugl1_key    setll     vaugl1                                 90
     c     vaugl1_key    reade     vaugl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vfufir = w_firm
6.10 c                   time                    vfuoda
6.10 c                   time                    vfuoti
6.10 c                   eval      vfuous = l_user
6.10 c                   time                    vfueda
6.10 c                   time                    vfueti
6.10 c                   eval      vfueus = l_user
     c                   write     vauglur
     c     vaugl1_key    reade     vaugl1                                 90
     c                   enddo
      *
      * Bilde-alternativ
      *
     c     vbldl1_key    setll     vbldl1                                 90
     c     vbldl1_key    reade     vbldl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vabfir = w_firm
6.10 c                   time                    vaboda
6.10 c                   time                    vaboti
6.10 c                   eval      vabous = l_user
6.10 c                   time                    vabeda
6.10 c                   time                    vabeti
6.10 c                   eval      vabeus = l_user
     c                   write     vbldlur
     c     vbldl1_key    reade     vbldl1                                 90
     c                   enddo
      *
      * EAN-register
      *
     c     veanl1_key    setll     veanl1                                 90
     c     veanl1_key    reade     veanl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vxfirm = w_firm
6.10 c                   time                    vxodat
6.10 c                   time                    vxotim
6.10 c                   eval      vxousr = l_user
6.10 c                   time                    vxedat
6.10 c                   time                    vxetim
6.10 c                   eval      vxeusr = l_user
     c                   write     veanlur
     c     veanl1_key    reade     veanl1                                 90
     c                   enddo
      *
      * Enhetsregister
      *
     c     venhl1_key    setll     venhl1                                 90
     c     venhl1_key    reade     venhl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vaefir = w_firm
6.10 c                   time                    vaeoda
6.10 c                   time                    vaeoti
6.10 c                   eval      vaeous = l_user
6.10 c                   time                    vaeeda
6.10 c                   time                    vaeeti
6.10 c                   eval      vaeeus = l_user
     c                   write     venhlur
     c     venhl1_key    reade     venhl1                                 90
     c                   enddo
      *
      * Etikettregister
      *
     c     vetil1_key    setll     vetil1                                 90
     c     vetil1_key    reade     vetil1                                 90
     c                   dow       *in90 = *off
     c                   eval      vmfirm = w_firm
6.10 c                   time                    vmotim
6.10 c                   time                    vmodat
6.10 c                   eval      vmousr = l_user
6.10 c                   time                    vmetim
6.10 c                   time                    vmedat
6.10 c                   eval      vmeusr = l_user
     c                   write     vetilur
     c     vetil1_key    reade     vetil1                                 90
     c                   enddo
      *
      * Fast tekst etiketter
      *
     c     vfaspf_key    setll     vfaspf                                 90
     c     vfaspf_key    reade     vfaspf                                 90
     c                   dow       *in90 = *off
     c                   eval      vnfirm = w_firm
6.10 c                   time                    vnodat
6.10 c                   time                    vnotim
6.10 c                   eval      vnousr = l_user
6.10 c                   time                    vnedat
6.10 c                   time                    vnetim
6.10 c                   eval      vneusr = l_user
     c                   write     vfaslur
     c     vfaspf_key    reade     vfaspf                                 90
     c                   enddo
      *
      * Hovedgruppe
      *
     c     vhgrl1_key    setll     vhgrl1                                 90
     c     vhgrl1_key    reade     vhgrl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vghfir = w_firm
6.10 c                   time                    vghoda
6.10 c                   time                    vghoti
6.10 c                   eval      vghous = l_user
6.10 c                   time                    vgheda
6.10 c                   time                    vgheti
6.10 c                   eval      vgheus = l_user
     c                   write     vhgrlur
     c     vhgrl1_key    reade     vhgrl1                                 90
     c                   enddo
      *
      * Historisk lagerbok
      *
     c     vhisl1_key    setll     vhisl1                                 90
     c     vhisl1_key    reade     vhisl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vhfirm = w_firm
6.10 c                   time                    vhodat
6.10 c                   time                    vhotim
6.10 c                   eval      vhousr = l_user
6.10 c                   time                    vhedat
6.10 c                   time                    vhetim
6.10 c                   eval      vheusr = l_user
     c                   write     vhislur
     c     vhisl1_key    reade     vhisl1                                 90
     c                   enddo
      *
      * Ordreinformasjon
      *
     c     vinfl1_key    setll     vinfl1                                 90
     c     vinfl1_key    reade     vinfl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vaifir = w_firm
6.10 c                   time                    vaioda
6.10 c                   time                    vaioti
6.10 c                   eval      vaious = l_user
6.10 c                   time                    vaieda
6.10 c                   time                    vaieti
6.10 c                   eval      vaieus = l_user
     c                   write     vinflur
     c     vinfl1_key    reade     vinfl1                                 90
     c                   enddo
      *
      * Kontohenvisning
      *
     c     vkhvl1_key    setll     vkhvl1                                 90
     c     vkhvl1_key    reade     vkhvl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vakfir = w_firm
6.10 c                   time                    vakoda
6.10 c                   time                    vakoti
6.10 c                   eval      vakous = l_user
6.10 c                   time                    vakeda
6.10 c                   time                    vaketi
6.10 c                   eval      vakeus = l_user
     c                   write     vkhvlur
     c     vkhvl1_key    reade     vkhvl1                                 90
     c                   enddo
      *
      * Lager
      *
     c     vlagl1_key    setll     vlagl1                                 90
     c     vlagl1_key    reade     vlagl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vlfirm = w_firm
6.10 c                   time                    vlodat
6.10 c                   time                    vlotim
6.10 c                   eval      vlousr = l_user
6.10 c                   time                    vledat
6.10 c                   time                    vletim
6.10 c                   eval      vleusr = l_user
     c                   write     vlaglur
     c     vlagl1_key    reade     vlagl1                                 90
     c                   enddo
      *
      * Leveringstype
      *
     c     vltpl1_key    setll     vltpl1                                 90
     c     vltpl1_key    reade     vltpl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vyfirm = w_firm
6.10 c                   time                    vyodat
6.10 c                   time                    vyotim
6.10 c                   eval      vyousr = l_user
6.10 c                   time                    vyedat
6.10 c                   time                    vyetim
6.10 c                   eval      vyeusr = l_user
     c                   write     vltplur
     c     vltpl1_key    reade     vltpl1                                 90
     c                   enddo
      *
      * Linjetype
      *
     c     vltyl1_key    setll     vltyl1                                 90
     c     vltyl1_key    reade     vltyl1                                 90
     c                   dow       *in90 = *off
     c                   eval      valfir = w_firm
6.10 c                   time                    valoda
6.10 c                   time                    valoti
6.10 c                   eval      valous = l_user
6.10 c                   time                    valeda
6.10 c                   time                    valeti
6.10 c                   eval      valeus = l_user
     c                   write     vltylur
     c     vltyl1_key    reade     vltyl1                                 90
     c                   enddo
      *
      * Overgruppe
      *
     c     vogrl1_key    setll     vogrl1                                 90
     c     vogrl1_key    reade     vogrl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vgofir = w_firm
6.10 c                   time                    vgooda
6.10 c                   time                    vgooti
6.10 c                   eval      vgoous = l_user
6.10 c                   time                    vgoeda
6.10 c                   time                    vgoeti
6.10 c                   eval      vgoeus = l_user
     c                   write     vogrlur
     c     vogrl1_key    reade     vogrl1                                 90
     c                   enddo
      *
      * Ordretype
      *
     c     votyl1_key    setll     votyl1                                 90
     c     votyl1_key    reade     votyl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vaofir = w_firm
6.10 c                   time                    vaooda
6.10 c                   time                    vaooti
6.10 c                   eval      vaoous = l_user
6.10 c                   time                    vaoeda
6.10 c                   time                    vaoeti
6.10 c                   eval      vaoeus = l_user
     c                   write     votylur
     c     votyl1_key    reade     votyl1                                 90
     c                   enddo
      *
      * Parameter
      *
     c     vparpf_key    setll     vparpf                                 90
     c     vparpf_key    reade     vparpf                                 90
     c                   dow       *in90 = *off
     c                   eval      vwpfir = w_firm
     c                   write     vparlur
     c     vparpf_key    reade     vparpf                                 90
     c                   enddo
      *
      * Påslag linje
      *
     c     vpdtl1_key    setll     vpdtl1                                 90
     c     vpdtl1_key    reade     vpdtl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vjfirm = w_firm
6.10 c                   time                    vjodat
6.10 c                   time                    vjotim
6.10 c                   eval      vjousr = l_user
6.10 c                   time                    vjedat
6.10 c                   time                    vjetim
6.10 c                   eval      vjeusr = l_user
     c                   write     vpdtlur
     c     vpdtl1_key    reade     vpdtl1                                 90
     c                   enddo
      *
      * Påslag hode
      *
     c     vphel1_key    setll     vphel1                                 90
     c     vphel1_key    reade     vphel1                                 90
     c                   dow       *in90 = *off
     c                   eval      vifirm = w_firm
6.10 c                   time                    viodat
6.10 c                   time                    viotim
6.10 c                   eval      viousr = l_user
6.10 c                   time                    viedat
6.10 c                   time                    vietim
6.10 c                   eval      vieusr = l_user
     c                   write     vphelur
     c     vphel1_key    reade     vphel1                                 90
     c                   enddo
      *
      * Priskoder
      *
     c     vpkol1_key    setll     vpkol1                                 90
     c     vpkol1_key    reade     vpkol1                                 90
     c                   dow       *in90 = *off
     c                   eval      vapfir = w_firm
6.10 c                   time                    vapoda
6.10 c                   time                    vapoti
6.10 c                   eval      vapous = l_user
6.10 c                   time                    vapeda
6.10 c                   time                    vapeti
6.10 c                   eval      vapusr = l_user
     c                   write     vpkolur
     c     vpkol1_key    reade     vpkol1                                 90
     c                   enddo
      *
      * Varesortiment linje
      *
     c     vsdtl1_key    setll     vsdtl1                                 90
     c     vsdtl1_key    reade     vsdtl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vdfirm = w_firm
6.10 c                   time                    vdodat
6.10 c                   time                    vdotim
6.10 c                   eval      vdousr = l_user
6.10 c                   time                    vdedat
6.10 c                   time                    vdetim
6.10 c                   eval      vdeusr = l_user
     c                   write     vsdtlur
     c     vsdtl1_key    reade     vsdtl1                                 90
     c                   enddo
      *
      * Varesortiment hode
      *
     c     vshel1_key    setll     vshel1                                 90
     c     vshel1_key    reade     vshel1                                 90
     c                   dow       *in90 = *off
     c                   eval      vcfirm = w_firm
6.10 c                   time                    vcodat
6.10 c                   time                    vcotim
6.10 c                   eval      vcousr = l_user
6.10 c                   time                    vcedat
6.10 c                   time                    vcetim
6.10 c                   eval      vceusr = l_user
     c                   write     vshelur
     c     vshel1_key    reade     vshel1                                 90
     c                   enddo
      *
      * Søketekst
      *
     c     vsokl1_key    setll     vsokl1                                 90
     c     vsokl1_key    reade     vsokl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vsfirm = w_firm
     c                   write     vsoklur
     c     vsokl1_key    reade     vsokl1                                 90
     c                   enddo
      *
      * Strukturvarer
      *
     c     vstrl1_key    setll     vstrl1                                 90
     c     vstrl1_key    reade     vstrl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vufirm = w_firm
6.10 c                   time                    vuodat
6.10 c                   time                    vuotim
6.10 c                   eval      vuousr = l_user
6.10 c                   time                    vuedat
6.10 c                   time                    vuetim
6.10 c                   eval      vueusr = l_user
     c                   write     vstrlur
     c     vstrl1_key    reade     vstrl1                                 90
     c                   enddo
      *
      * Tilbud
      *
     c     vtill1_key    setll     vtill1                                 90
     c     vtill1_key    reade     vtill1                                 90
     c                   dow       *in90 = *off
     c                   eval      vtfirm = w_firm
6.10 c                   time                    vtodat
6.10 c                   time                    vtotim
6.10 c                   eval      vtousr = l_user
6.10 c                   time                    vtedat
6.10 c                   time                    vtetim
6.10 c                   eval      vteusr = l_user
     c                   write     vtillur
     c     vtill1_key    reade     vtill1                                 90
     c                   enddo
      *
      * Undergruppe
      *
     c     vugrl1_key    setll     vugrl1                                 90
     c     vugrl1_key    reade     vugrl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vgufir = w_firm
6.10 c                   time                    vguoda
6.10 c                   time                    vguoti
6.10 c                   eval      vguous = l_user
6.10 c                   time                    vgueda
6.10 c                   time                    vgueti
6.10 c                   eval      vgueus = l_user
     c                   write     vugrlur
     c     vugrl1_key    reade     vugrl1                                 90
     c                   enddo
      *
      * Vare
      *
     c     vvarl1_key    setll     vvarl1                                 90
     c     vvarl1_key    reade     vvarl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vvfirm = w_firm
6.10 c                   time                    vvodat
6.10 c                   time                    vvotim
6.10 c                   eval      vvousr = l_user
6.10 c                   time                    vvedat
6.10 c                   time                    vvetim
6.10 c                   eval      vveusr = l_user
     c                   write     vvarlur
     c     vvarl1_key    reade     vvarl1                                 90
     c                   enddo
      *
      * Slettede varer
      *
     c     vvasl1_key    setll     vvasl1                                 90
     c     vvasl1_key    reade     vvasl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vvfirm = w_firm
6.10 c                   time                    vvodat
6.10 c                   time                    vvotim
6.10 c                   eval      vvousr = l_user
6.10 c                   time                    vvedat
6.10 c                   time                    vvetim
6.10 c                   eval      vveusr = l_user
     c                   write     vvaslur
     c     vvasl1_key    reade     vvasl1                                 90
     c                   enddo
      *
      * Vare-enhet
      *
     c     vvenl1_key    setll     vvenl1                                 90
     c     vvenl1_key    reade     vvenl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vefirm = w_firm
6.10 c                   time                    veodat
6.10 c                   time                    veotim
6.10 c                   eval      veousr = l_user
6.10 c                   time                    veedat
6.10 c                   time                    veetim
6.10 c                   eval      veeusr = l_user
     c                   write     vvenlur
     c     vvenl1_key    reade     vvenl1                                 90
     c                   enddo
6.11  *
6.11  * Vare-enhet-prisgiver
6.11  *
6.11 c     vvepl1_key    setll     vvepl1                                 90
6.11 c     vvepl1_key    reade     vvepl1                                 90
6.11 c                   dow       *in90 = *off
6.11 c                   eval      vepfir = w_firm
6.11 c                   time                    vepoda
6.11 c                   time                    vepoti
6.11 c                   eval      vepous = l_user
6.11 c                   time                    vepeda
6.11 c                   time                    vepeti
6.11 c                   eval      vepeus = l_user
6.11 c                   write     vveplur
6.11 c     vvepl1_key    reade     vvepl1                                 90
6.11 c                   enddo
      *
      * Varegruppeknytning
      *
     c     vvgkl1_key    setll     vvgkl1                                 90
     c     vvgkl1_key    reade     vvgkl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vkfirm = w_firm
6.10 c                   time                    vkodat
6.10 c                   time                    vkotim
6.10 c                   eval      vkousr = l_user
6.10 c                   time                    vkedat
6.10 c                   time                    vketim
6.10 c                   eval      vkeusr = l_user
     c                   write     vvgklur
     c     vvgkl1_key    reade     vvgkl1                                 90
     c                   enddo
      *
      * Vare-pris
      *
     c     vvprl1_key    setll     vvprl1                                 90
     c     vvprl1_key    reade     vvprl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vpfirm = w_firm
6.10 c                   time                    vpodat
6.10 c                   time                    vpotim
6.10 c                   eval      vpousr = l_user
6.10 c                   time                    vpedat
6.10 c                   time                    vpetim
6.10 c                   eval      vpeusr = l_user
     c                   write     vvprlur
     c     vvprl1_key    reade     vvprl1                                 90
     c                   enddo
      *
      * Vare-søk
      *
     c     vvsol1_key    setll     vvsol1                                 90
     c     vvsol1_key    reade     vvsol1                                 90
     c                   dow       *in90 = *off
     c                   eval      vvsfir = w_firm
     c                   write     vvsolur
     c     vvsol1_key    reade     vvsol1                                 90
     c                   enddo
      *
      * Varetype
      *
     c     vvtyl1_key    setll     vvtyl1                                 90
     c     vvtyl1_key    reade     vvtyl1                                 90
     c                   dow       *in90 = *off
     c                   eval      vavfir = w_firm
6.10 c                   time                    vavoda
6.10 c                   time                    vavoti
6.10 c                   eval      vavous = l_user
6.10 c                   time                    vaveda
6.10 c                   time                    vaveti
6.10 c                   eval      vaveus = l_user
     c                   write     vvtylur
     c     vvtyl1_key    reade     vvtyl1                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    w_firm
      *
     c     vahgl1_key    klist
     c                   kfld                    l_firm
      *
     c     vaugl1_key    klist
     c                   kfld                    l_firm
      *
     c     vbldl1_key    klist
     c                   kfld                    l_firm
      *
     c     veanl1_key    klist
     c                   kfld                    l_firm
      *
     c     venhl1_key    klist
     c                   kfld                    l_firm
      *
     c     vetil1_key    klist
     c                   kfld                    l_firm
      *
     c     vfaspf_key    klist
     c                   kfld                    l_firm
      *
     c     vhgrl1_key    klist
     c                   kfld                    l_firm
      *
     c     vhisl1_key    klist
     c                   kfld                    l_firm
      *
     c     vinfl1_key    klist
     c                   kfld                    l_firm
      *
     c     vkhvl1_key    klist
     c                   kfld                    l_firm
      *
     c     vlagl1_key    klist
     c                   kfld                    l_firm
      *
     c     vltyl1_key    klist
     c                   kfld                    l_firm
      *
     c     vltpl1_key    klist
     c                   kfld                    l_firm
      *
     c     vogrl1_key    klist
     c                   kfld                    l_firm
      *
     c     votyl1_key    klist
     c                   kfld                    l_firm
      *
     c     vparpf_key    klist
     c                   kfld                    l_firm
      *
     c     vpdtl1_key    klist
     c                   kfld                    l_firm
      *
     c     vphel1_key    klist
     c                   kfld                    l_firm
      *
     c     vpkol1_key    klist
     c                   kfld                    l_firm
      *
     c     vsdtl1_key    klist
     c                   kfld                    l_firm
      *
     c     vshel1_key    klist
     c                   kfld                    l_firm
      *
     c     vsokl1_key    klist
     c                   kfld                    l_firm
      *
     c     vstrl1_key    klist
     c                   kfld                    l_firm
      *
     c     vtill1_key    klist
     c                   kfld                    l_firm
      *
     c     vugrl1_key    klist
     c                   kfld                    l_firm
      *
     c     vvarl1_key    klist
     c                   kfld                    l_firm
      *
     c     vvasl1_key    klist
     c                   kfld                    l_firm
      *
     c     vvenl1_key    klist
     c                   kfld                    l_firm
6.11  *
6.11 c     vvepl1_key    klist
6.11 c                   kfld                    l_firm
      *
     c     vvgkl1_key    klist
     c                   kfld                    l_firm
      *
     c     vvprl1_key    klist
     c                   kfld                    l_firm
      *
     c     vvsol1_key    klist
     c                   kfld                    l_firm
      *
     c     vvtyl1_key    klist
     c                   kfld                    l_firm
      *
     c                   endsr
