      /TITLE  ASOFAK Opprydding i filer
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FO403R
      * Beskrivelse . . : Sletter firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
7.01  *k00  030620 BOF NXS-1195  kompilert pga tab.utvidelse
8.01  *PRG2   210622 bof  Utvidet prisgruppe fra 1 til 2 posisjoner
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffdellu    uf   e           k disk
     ffenklu    uf   e           k disk
     ffftxlu    uf   e           k disk
     ffgeblu    uf   e           k disk
     ffjoblu    uf   e           k disk
     ffkdilu    uf   e           k disk
     ffkprlu    uf   e           k disk
     ffkpslu    uf   e           k disk
     fflvalu    uf   e           k disk
     ffodtlu    uf   e           k disk
     ffohelu    uf   e           k disk
     ffotxlu    uf   e           k disk
     ffplllu    uf   e           k disk
     ffplolu    uf   e           k disk
     ffpm1lu    uf   e           k disk
     ffpm2lu    uf   e           k disk
     ffprclu    uf   e           k disk
     ffprilu    uf   e           k disk
     ffpsolu    uf   e           k disk
     ffrablu    uf   e           k disk
     ffstslu    uf   e           k disk
     ffusrlu    uf   e           k disk
     fsodtlu    uf   e           k disk
     fsohelu    uf   e           k disk
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
     d w_firm          s              3  0
      *
      * Ordre-slettet
      *
     c                   read      fdellu                                 90
     c                   dow       *in90 = *off
     c                   if        fyfirm = l_firm
     c                   delete    fdelpfr
     c                   endif
     c                   read      fdellu                                 90
     c                   enddo
      *
      * Enhet konvertering
      *
     c                   read      fenklu                                 90
     c                   dow       *in90 = *off
     c                   if        fefirm = l_firm
     c                   delete    fenkpfr
     c                   endif
     c                   read      fenklu                                 90
     c                   enddo
      *
      * Fast ordre-tekst
      *
     c                   read      fftxlu                                 90
     c                   dow       *in90 = *off
     c                   if        fjfirm = l_firm
     c                   delete    fftxpfr
     c                   endif
     c                   read      fftxlu                                 90
     c                   enddo
      *
      * Gebyr
      *
     c                   read      fgeblu                                 90
     c                   dow       *in90 = *off
     c                   if        fgfirm = l_firm
     c                   delete    fgebpfr
     c                   endif
     c                   read      fgeblu                                 90
     c                   enddo
      *
      * Job-register
      *
     c                   read      fjoblu                                 90
     c                   dow       *in90 = *off
     c                   if        fajfir = l_firm
     c                   delete    fjobpfr
     c                   endif
     c                   read      fjoblu                                 90
     c                   enddo
      *
      * Kunde distribusjonsliste
      *
     c                   read      fkdilu                                 90
     c                   dow       *in90 = *off
     c                   if        fhfirm = l_firm
     c                   delete    fkdipfr
     c                   endif
     c                   read      fkdilu                                 90
     c                   enddo
      *
      * Kundeprosjekt
      *
     c                   read      fkprlu                                 90
     c                   dow       *in90 = *off
     c                   if        flfirm = l_firm
     c                   delete    fkprpfr
     c                   endif
     c                   read      fkprlu                                 90
     c                   enddo
      *
      * Kundeprosjekt søketekst
      *
     c                   read      fkpslu                                 90
     c                   dow       *in90 = *off
     c                   if        flsfir = l_firm
     c                   delete    fkpspfr
     c                   endif
     c                   read      fkpslu                                 90
     c                   enddo
      *
      * Leverandør vare
      *
     c                   read      flvalu                                 90
     c                   dow       *in90 = *off
     c                   if        fwfirm = l_firm
     c                   delete    flvapfr
     c                   endif
     c                   read      flvalu                                 90
     c                   enddo
      *
      * Orderlinje
      *
     c                   read      fodtlu                                 90
     c                   dow       *in90 = *off
     c                   if        fdfirm = l_firm
     c                   delete    fodtpfr
     c                   endif
     c                   read      fodtlu                                 90
     c                   enddo
      *
      * Ordrehode
      *
     c                   read      fohelu                                 90
     c                   dow       *in90 = *off
     c                   if        fofirm = l_firm
     c                   delete    fohepfr
     c                   endif
     c                   read      fohelu                                 90
     c                   enddo
      *
      * Ordretekst
      *
     c                   read      fotxlu                                 90
     c                   dow       *in90 = *off
     c                   if        ftfirm = l_firm
     c                   delete    fotxpfr
     c                   endif
     c                   read      fotxlu                                 90
     c                   enddo
      *
      * Utplukk linje
      *
     c                   read      fplllu                                 90
     c                   dow       *in90 = *off
     c                   if        fklfir = l_firm
     c                   delete    fpllpfr
     c                   endif
     c                   read      fplllu                                 90
     c                   enddo
      *
      * Utplukk param
      *
     c                   read      fplolu                                 90
     c                   dow       *in90 = *off
     c                   if        fkpfir = l_firm
     c                   delete    fplopfr
     c                   endif
     c                   read      fplolu                                 90
     c                   enddo
      *
      * Utplukk Plukk1 linje
      *
     c                   read      fpm1lu                                 90
     c                   dow       *in90 = *off
     c                   if        fk1fir = l_firm
     c                   delete    fpm1pfr
     c                   endif
     c                   read      fpm1lu                                 90
     c                   enddo
      *
      * Utplukk plukk 2 linje
      *
     c                   read      fpm2lu                                 90
     c                   dow       *in90 = *off
     c                   if        fk2fir = l_firm
     c                   delete    fpm2pfr
     c                   endif
     c                   read      fpm2lu                                 90
     c                   enddo
      *
      * Pris record-format
      *
     c                   read      fprclu                                 90
     c                   dow       *in90 = *off
     c                   if        fcfirm = l_firm
     c                   delete    fprcpfr
     c                   endif
     c                   read      fprclu                                 90
     c                   enddo
      *
      * Spesialpris
      *
     c                   read      fprilu                                 90
     c                   dow       *in90 = *off
     c                   if        fpfirm = l_firm
     c                   delete    fpripfr
     c                   endif
     c                   read      fprilu                                 90
     c                   enddo
      *
      * Plukk S-linje
      *
     c                   read      fpsolu                                 90
     c                   dow       *in90 = *off
     c                   if        fksfir = l_firm
     c                   delete    fpsopfr
     c                   endif
     c                   read      fpsolu                                 90
     c                   enddo
      *
      * Rabattmatrise
      *
     c                   read      frablu                                 90
     c                   dow       *in90 = *off
     c                   if        frfirm = l_firm
     c                   delete    frabpfr
     c                   endif
     c                   read      frablu                                 90
     c                   enddo
      *
      * Ofak - kode
      *
     c                   read      fstslu                                 90
     c                   dow       *in90 = *off
     c                   if        faafir = l_firm
     c                   delete    fstspfr
     c                   endif
     c                   read      fstslu                                 90
     c                   enddo
      *
      * User
      *
     c                   read      fusrlu                                 90
     c                   dow       *in90 = *off
     c                   if        fbfirm = l_firm
     c                   delete    fusrpfr
     c                   endif
     c                   read      fusrlu                                 90
     c                   enddo
      *
      * Faktura-linjer
      *
     c                   read      sodtlu                                 90
     c                   dow       *in90 = *off
     c                   if        sdfirm = l_firm
     c                   delete    sodtpfr
     c                   endif
     c                   read      sodtlu                                 90
     c                   enddo
      *
      * Faktura-hode
      *
     c                   read      sohelu                                 90
     c                   dow       *in90 = *off
     c                   if        sofirm = l_firm
     c                   delete    sohepfr
     c                   endif
     c                   read      sohelu                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   eval      w_firm  = 000
      *
     c                   endsr
