      /TITLE  ASOFAK Opprydding i filer
     h option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FO401R
      * Beskrivelse . . : Endre firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
      * 6.10  220609 BSA  Oppdatert med sporingsinformasjon
7.01  *k00  030620 BOF NXS-1195  kompilert pga tab.utvidelse
8.01  *PRG2   210622 bof  Utvidet prisgruppe fra 1 til 2 posisjoner
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffdellu    uf   e           k disk    rename(fdelpfr:fdellur)
     ffenklu    uf   e           k disk    rename(fenkpfr:fenklur)
     ffftxlu    uf   e           k disk    rename(fftxpfr:fftxlur)
     ffgeblu    uf   e           k disk    rename(fgebpfr:fgeblur)
     ffjoblu    uf   e           k disk    rename(fjobpfr:fjoblur)
     ffkdilu    uf   e           k disk    rename(fkdipfr:fkdilur)
     ffkprlu    uf   e           k disk    rename(fkprpfr:fkprlur)
     ffkpslu    uf   e           k disk    rename(fkpspfr:fkpslur)
     fflvalu    uf   e           k disk    rename(flvapfr:flvalur)
     ffodtlu    uf   e           k disk    rename(fodtpfr:fodtlur)
     ffohelu    uf   e           k disk    rename(fohepfr:fohelur)
     ffotxlu    uf   e           k disk    rename(fotxpfr:fotxlur)
     ffplllu    uf   e           k disk    rename(fpllpfr:fplllur)
     ffplolu    uf   e           k disk    rename(fplopfr:fplolur)
     ffpm1lu    uf   e           k disk    rename(fpm1pfr:fpm1lur)
     ffprclu    uf   e           k disk    rename(fprcpfr:fprclur)
     ffprilu    uf   e           k disk    rename(fpripfr:fprilur)
     ffrablu    uf   e           k disk    rename(frabpfr:frablur)
     ffstslu    uf   e           k disk    rename(fstspfr:fstslur)
     ffusrlu    uf   e           k disk    rename(fusrpfr:fusrlur)
     fsodtlu    uf   e           k disk    rename(sodtpfr:sodtlur)
     fsohelu    uf   e           k disk    rename(sohepfr:sohelur)
      *
     d                uds
     d l_user                911    920
     d l_fgrp                931    933
     d l_firm                944    946  0
     d l_navn                951    980
      *
     d w_firm          s              3  0
      *
      * Ordre-slettet
      *
     c     fdellu_key    setll     fdellu                                 90
     c     fdellu_key    reade     fdellu                                 90
     c                   dow       *in90 = *off
     c                   eval      fyfirm = w_firm
6.10 c                   time                    fyedat
6.10 c                   time                    fyetim
6.10 c                   eval      fyeusr = l_user
     c                   update    fdellur
     c     fdellu_key    reade     fdellu                                 90
     c                   enddo
      *
      * Enhet konvertering
      *
     c     fenklu_key    setll     fenklu                                 90
     c     fenklu_key    reade     fenklu                                 90
     c                   dow       *in90 = *off
     c                   eval      fefirm = w_firm
     c                   update    fenklur
     c     fenklu_key    reade     fenklu                                 90
     c                   enddo
      *
      * Fast ordre-tekst
      *
     c     fftxlu_key    setll     fftxlu                                 90
     c     fftxlu_key    reade     fftxlu                                 90
     c                   dow       *in90 = *off
     c                   eval      fjfirm = w_firm
6.10 c                   time                    fjedat
6.10 c                   time                    fjetim
6.10 c                   eval      fjeusr = l_user
     c                   update    fftxlur
     c     fftxlu_key    reade     fftxlu                                 90
     c                   enddo
      *
      * Gebyr
      *
     c     fgeblu_key    setll     fgeblu                                 90
     c     fgeblu_key    reade     fgeblu                                 90
     c                   dow       *in90 = *off
     c                   eval      fgfirm = w_firm
6.10 c                   time                    fgedat
6.10 c                   time                    fgetim
6.10 c                   eval      fgeusr = l_user
     c                   update    fgeblur
     c     fgeblu_key    reade     fgeblu                                 90
     c                   enddo
      *
      * Job-register
      *
     c     fjoblu_key    setll     fjoblu                                 90
     c     fjoblu_key    reade     fjoblu                                 90
     c                   dow       *in90 = *off
     c                   eval      fajfir = w_firm
6.10 c                   time                    fajeda
6.10 c                   time                    fajeti
6.10 c                   eval      fajeus = l_user
     c                   update    fjoblur
     c     fjoblu_key    reade     fjoblu                                 90
     c                   enddo
      *
      * Kunde distribusjonsliste
      *
     c     fkdilu_key    setll     fkdilu                                 90
     c     fkdilu_key    reade     fkdilu                                 90
     c                   dow       *in90 = *off
     c                   eval      fhfirm = w_firm
6.10 c                   time                    fhedat
6.10 c                   time                    fhetim
6.10 c                   eval      fheusr = l_user
     c                   update    fkdilur
     c     fkdilu_key    reade     fkdilu                                 90
     c                   enddo
      *
      * Kundeprosjekt
      *
     c     fkprlu_key    setll     fkprlu                                 90
     c     fkprlu_key    reade     fkprlu                                 90
     c                   dow       *in90 = *off
     c                   eval      flfirm = w_firm
6.10 c                   time                    fledat
6.10 c                   time                    fletim
6.10 c                   eval      fleusr = l_user
     c                   update    fkprlur
     c     fkprlu_key    reade     fkprlu                                 90
     c                   enddo
      *
      * Kundeprosjekt søketekst
      *
     c     fkpslu_key    setll     fkpslu                                 90
     c     fkpslu_key    reade     fkpslu                                 90
     c                   dow       *in90 = *off
     c                   eval      flsfir = w_firm
6.10 c                   time                    flseda
6.10 c                   time                    flseti
6.10 c                   eval      flseus = l_user
     c                   update    fkpslur
     c     fkpslu_key    reade     fkpslu                                 90
     c                   enddo
      *
      * Leverandør vare
      *
     c     flvalu_key    setll     flvalu                                 90
     c     flvalu_key    reade     flvalu                                 90
     c                   dow       *in90 = *off
     c                   eval      fwfirm = w_firm
6.10 c                   time                    fwedat
6.10 c                   time                    fwetim
6.10 c                   eval      fweusr = l_user
     c                   update    flvalur
     c     flvalu_key    reade     flvalu                                 90
     c                   enddo
      *
      * Orderlinje
      *
     c     fodtlu_key    setll     fodtlu                                 90
     c     fodtlu_key    reade     fodtlu                                 90
     c                   dow       *in90 = *off
     c                   eval      fdfirm = w_firm
6.10 c                   time                    fdedat
6.10 c                   time                    fdetim
6.10 c                   eval      fdeusr = l_user
     c                   update    fodtlur
     c     fodtlu_key    reade     fodtlu                                 90
     c                   enddo
      *
      * Ordrehode
      *
     c     fohelu_key    setll     fohelu                                 90
     c     fohelu_key    reade     fohelu                                 90
     c                   dow       *in90 = *off
     c                   eval      fofirm = w_firm
6.10 c                   time                    foedat
6.10 c                   time                    foetim
6.10 c                   eval      foeusr = l_user
     c                   update    fohelur
     c     fohelu_key    reade     fohelu                                 90
     c                   enddo
      *
      * Ordretekst
      *
     c     fotxlu_key    setll     fotxlu                                 90
     c     fotxlu_key    reade     fotxlu                                 90
     c                   dow       *in90 = *off
     c                   eval      ftfirm = w_firm
6.10 c                   time                    ftedat
6.10 c                   time                    ftetim
6.10 c                   eval      fteusr = l_user
     c                   update    fotxlur
     c     fotxlu_key    reade     fotxlu                                 90
     c                   enddo
      *
      * Utplukk linje
      *
     c     fplllu_key    setll     fplllu                                 90
     c     fplllu_key    reade     fplllu                                 90
     c                   dow       *in90 = *off
     c                   eval      fklfir = w_firm
     c                   update    fplllur
     c     fplllu_key    reade     fplllu                                 90
     c                   enddo
      *
      * Utplukk param
      *
     c     fplolu_key    setll     fplolu                                 90
     c     fplolu_key    reade     fplolu                                 90
     c                   dow       *in90 = *off
     c                   eval      fkpfir = w_firm
     c                   update    fplolur
     c     fplolu_key    reade     fplolu                                 90
     c                   enddo
      *
      * Utplukk Plukk1 linje
      *
     c     fpm1lu_key    setll     fpm1lu                                 90
     c     fpm1lu_key    reade     fpm1lu                                 90
     c                   dow       *in90 = *off
     c                   eval      fk1fir = w_firm
     c                   update    fpm1lur
     c     fpm1lu_key    reade     fpm1lu                                 90
     c                   enddo
      *
      * Pris record-format
      *
     c     fprclu_key    setll     fprclu                                 90
     c     fprclu_key    reade     fprclu                                 90
     c                   dow       *in90 = *off
     c                   eval      fcfirm = w_firm
6.10 c                   time                    fcedat
6.10 c                   time                    fcetim
6.10 c                   eval      fceusr = l_user
     c                   update    fprclur
     c     fprclu_key    reade     fprclu                                 90
     c                   enddo
      *
      * Spesialpris
      *
     c     fprilu_key    setll     fprilu                                 90
     c     fprilu_key    reade     fprilu                                 90
     c                   dow       *in90 = *off
     c                   eval      fpfirm = w_firm
6.10 c                   time                    fpedat
6.10 c                   time                    fpetim
6.10 c                   eval      fpeusr = l_user
     c                   update    fprilur
     c     fprilu_key    reade     fprilu                                 90
     c                   enddo
      *
      * Rabattmatrise
      *
     c     frablu_key    setll     frablu                                 90
     c     frablu_key    reade     frablu                                 90
     c                   dow       *in90 = *off
     c                   eval      frfirm = w_firm
6.10 c                   time                    fredat
6.10 c                   time                    fretim
6.10 c                   eval      freusr = l_user
     c                   update    frablur
     c     frablu_key    reade     frablu                                 90
     c                   enddo
      *
      * Ofak - kode
      *
     c     fstslu_key    setll     fstslu                                 90
     c     fstslu_key    reade     fstslu                                 90
     c                   dow       *in90 = *off
     c                   eval      faafir = w_firm
6.10 c                   time                    faaeda
6.10 c                   time                    faaeti
6.10 c                   eval      faaeus = l_user
     c                   update    fstslur
     c     fstslu_key    reade     fstslu                                 90
     c                   enddo
      *
      * User
      *
     c     fusrlu_key    setll     fusrlu                                 90
     c     fusrlu_key    reade     fusrlu                                 90
     c                   dow       *in90 = *off
     c                   eval      fbfirm = w_firm
6.10 c                   time                    fbedat
6.10 c                   time                    fbetim
6.10 c                   eval      fbeusr = l_user
     c                   update    fusrlur
     c     fusrlu_key    reade     fusrlu                                 90
     c                   enddo
      *
      * Faktura-linjer
      *
     c     sodtlu_key    setll     sodtlu                                 90
     c     sodtlu_key    reade     sodtlu                                 90
     c                   dow       *in90 = *off
     c                   eval      sdfirm = w_firm
6.10 c                   time                    sdedat
6.10 c                   time                    sdetim
6.10 c                   eval      sdeusr = l_user
     c                   update    sodtlur
     c     sodtlu_key    reade     sodtlu                                 90
     c                   enddo
      *
      * Faktura-hode
      *
     c     sohelu_key    setll     sohelu                                 90
     c     sohelu_key    reade     sohelu                                 90
     c                   dow       *in90 = *off
     c                   eval      sofirm = w_firm
6.10 c                   time                    soedat
6.10 c                   time                    soetim
6.10 c                   eval      soeusr = l_user
     c                   update    sohelur
     c     sohelu_key    reade     sohelu                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    w_firm
      *
     c     fdellu_key    klist
     c                   kfld                    l_firm
      *
     c     fenklu_key    klist
     c                   kfld                    l_firm
      *
     c     fftxlu_key    klist
     c                   kfld                    l_firm
      *
     c     fgeblu_key    klist
     c                   kfld                    l_firm
      *
     c     fjoblu_key    klist
     c                   kfld                    l_firm
      *
     c     fkdilu_key    klist
     c                   kfld                    l_firm
      *
     c     fkprlu_key    klist
     c                   kfld                    l_firm
      *
     c     fkpslu_key    klist
     c                   kfld                    l_firm
      *
     c     flvalu_key    klist
     c                   kfld                    l_firm
      *
     c     fodtlu_key    klist
     c                   kfld                    l_firm
      *
     c     fohelu_key    klist
     c                   kfld                    l_firm
      *
     c     fotxlu_key    klist
     c                   kfld                    l_firm
      *
     c     fplllu_key    klist
     c                   kfld                    l_firm
      *
     c     fplolu_key    klist
     c                   kfld                    l_firm
      *
     c     fpm1lu_key    klist
     c                   kfld                    l_firm
      *
     c     fprclu_key    klist
     c                   kfld                    l_firm
      *
     c     fprilu_key    klist
     c                   kfld                    l_firm
      *
     c     frablu_key    klist
     c                   kfld                    l_firm
      *
     c     fstslu_key    klist
     c                   kfld                    l_firm
      *
     c     fusrlu_key    klist
     c                   kfld                    l_firm
      *
     c     fxvglu_key    klist
     c                   kfld                    l_firm
      *
     c     sodtlu_key    klist
     c                   kfld                    l_firm
      *
     c     sohelu_key    klist
     c                   kfld                    l_firm
      *
     c                   endsr
