      /TITLE  ASOFAK Opprydding i filer
     h option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FO402R
      * Beskrivelse . . : Slette firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
6.11  *       070110 bof  Lagt til vveppf
6.20  * 6.20  041110 bof  utvidet nøkkel vsdtpf/vshepf
6.21  * 6.20  210311 bof  utvidet nøkkel vvprpf
6.22  * 6.20  020511 bof  utvidet nøkkel vtilpf
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvahglu    uf   e           k disk
     fvauglu    uf   e           k disk
     fvbldlu    uf   e           k disk
     fveanlu    uf   e           k disk
     fvenhlu    uf   e           k disk
     fvetilu    uf   e           k disk
     fvfaslu    uf   e           k disk
     fvhgrlu    uf   e           k disk
     fvhislu    uf   e           k disk
     fvinflu    uf   e           k disk
     fvkhvlu    uf   e           k disk
     fvlaglu    uf   e           k disk
     fvltylu    uf   e           k disk
     fvltplu    uf   e           k disk
     fvogrlu    uf   e           k disk
     fvotylu    uf   e           k disk
     fvparlu    uf   e           k disk
     fvpdtlu    uf   e           k disk
     fvphelu    uf   e           k disk
     fvpkolu    uf   e           k disk
     fvsdtlu    uf   e           k disk
     fvshelu    uf   e           k disk
     fvsoklu    uf   e           k disk
     fvstrlu    uf   e           k disk
     fvtillu    uf   e           k disk
     fvugrlu    uf   e           k disk
     fvvaqpf    uf   e           k disk
     fvvarlu    uf   e           k disk
     fvvaslu    uf   e           k disk
6.11 fvvenlu    uf   e           k disk
     fvveplu    uf   e           k disk
     fvvgklu    uf   e           k disk
     fvvprlu    uf   e           k disk
     fvvsolu    uf   e           k disk
     fvvtylu    uf   e           k disk
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
      * Alternativ hovedgruppe
      *
     c                   read      vahglu                                 90
     c                   dow       *in90 = *off
     c                   if        vfhfir = l_firm
     c                   delete    vahgpfr
     c                   endif
     c                   read      vahglu                                 90
     c                   enddo
      *
      * Alternativ undergruppe
      *
     c                   read      vauglu                                 90
     c                   dow       *in90 = *off
     c                   if        vfufir = l_firm
     c                   delete    vaugpfr
     c                   endif
     c                   read      vauglu                                 90
     c                   enddo
      *
      * Bilde-alternativ
      *
     c                   read      vbldlu                                 90
     c                   dow       *in90 = *off
     c                   if        vabfir = l_firm
     c                   delete    vbldpfr
     c                   endif
     c                   read      vbldlu                                 90
     c                   enddo
      *
      * EAN-register
      *
     c                   read      veanlu                                 90
     c                   dow       *in90 = *off
     c                   if        vxfirm = l_firm
     c                   delete    veanpfr
     c                   endif
     c                   read      veanlu                                 90
     c                   enddo
      *
      * Enhetsregister
      *
     c                   read      venhlu                                 90
     c                   dow       *in90 = *off
     c                   if        vaefir = l_firm
     c                   delete    venhpfr
     c                   endif
     c                   read      venhlu                                 90
     c                   enddo
      *
      * Etikettregister
      *
     c                   read      vetilu                                 90
     c                   dow       *in90 = *off
     c                   if        vmfirm = l_firm
     c                   delete    vetipfr
     c                   endif
     c                   read      vetilu                                 90
     c                   enddo
      *
      * Fast tekst etiketter
      *
     c                   read      vfaslu                                 90
     c                   dow       *in90 = *off
     c                   if        vnfirm = l_firm
     c                   delete    vfaspfr
     c                   endif
     c                   read      vfaslu                                 90
     c                   enddo
      *
      * Hovedgruppe
      *
     c                   read      vhgrlu                                 90
     c                   dow       *in90 = *off
     c                   if        vghfir = l_firm
     c                   delete    vhgrpfr
     c                   endif
     c                   read      vhgrlu                                 90
     c                   enddo
      *
      * Historisk lagerbok
      *
     c                   read      vhislu                                 90
     c                   dow       *in90 = *off
     c                   if        vhfirm = l_firm
     c                   delete    vhispfr
     c                   endif
     c                   read      vhislu                                 90
     c                   enddo
      *
      * Ordreinformasjon
      *
     c                   read      vinflu                                 90
     c                   dow       *in90 = *off
     c                   if        vaifir = l_firm
     c                   delete    vinfpfr
     c                   endif
     c                   read      vinflu                                 90
     c                   enddo
      *
      * Kontohenvisning
      *
     c                   read      vkhvlu                                 90
     c                   dow       *in90 = *off
     c                   if        vakfir = l_firm
     c                   delete    vkhvpfr
     c                   endif
     c                   read      vkhvlu                                 90
     c                   enddo
      *
      * Lager
      *
     c                   read      vlaglu                                 90
     c                   dow       *in90 = *off
     c                   if        vlfirm = l_firm
     c                   delete    vlagpfr
     c                   endif
     c                   read      vlaglu                                 90
     c                   enddo
      *
      * Leveringstype
      *
     c                   read      vltplu                                 90
     c                   dow       *in90 = *off
     c                   if        vyfirm = l_firm
     c                   delete    vltppfr
     c                   endif
     c                   read      vltplu                                 90
     c                   enddo
      *
      * Linjetype
      *
     c                   read      vltylu                                 90
     c                   dow       *in90 = *off
     c                   if        valfir = l_firm
     c                   delete    vltypfr
     c                   endif
     c                   read      vltylu                                 90
     c                   enddo
      *
      * Overgruppe
      *
     c                   read      vogrlu                                 90
     c                   dow       *in90 = *off
     c                   if        vgofir = l_firm
     c                   delete    vogrpfr
     c                   endif
     c                   read      vogrlu                                 90
     c                   enddo
      *
      * Ordretype
      *
     c                   read      votylu                                 90
     c                   dow       *in90 = *off
     c                   if        vaofir = l_firm
     c                   delete    votypfr
     c                   endif
     c                   read      votylu                                 90
     c                   enddo
      *
      * Parameter
      *
     c                   read      vparlu                                 90
     c                   dow       *in90 = *off
     c                   if        vwpfir = l_firm
     c                   delete    vparpfr
     c                   endif
     c                   read      vparlu                                 90
     c                   enddo
      *
      * Påslag linje
      *
     c                   read      vpdtlu                                 90
     c                   dow       *in90 = *off
     c                   if        vjfirm = l_firm
     c                   delete    vpdtpfr
     c                   endif
     c                   read      vpdtlu                                 90
     c                   enddo
      *
      * Påslag hode
      *
     c                   read      vphelu                                 90
     c                   dow       *in90 = *off
     c                   if        vifirm = l_firm
     c                   delete    vphepfr
     c                   endif
     c                   read      vphelu                                 90
     c                   enddo
      *
      * Priskoder
      *
     c                   read      vpkolu                                 90
     c                   dow       *in90 = *off
     c                   if        vapfir = l_firm
     c                   delete    vpkopfr
     c                   endif
     c                   read      vpkolu                                 90
     c                   enddo
      *
      * Varesortiment linje
      *
     c                   read      vsdtlu                                 90
     c                   dow       *in90 = *off
     c                   if        vdfirm = l_firm
     c                   delete    vsdtpfr
     c                   endif
     c                   read      vsdtlu                                 90
     c                   enddo
      *
      * Varesortiment hode
      *
     c                   read      vshelu                                 90
     c                   dow       *in90 = *off
     c                   if        vcfirm = l_firm
     c                   delete    vshepfr
     c                   endif
     c                   read      vshelu                                 90
     c                   enddo
      *
      * Søketekst
      *
     c                   read      vsoklu                                 90
     c                   dow       *in90 = *off
     c                   if        vsfirm = l_firm
     c                   delete    vsokpfr
     c                   endif
     c                   read      vsoklu                                 90
     c                   enddo
      *
      * Strukturvare
      *
     c                   read      vstrlu                                 90
     c                   dow       *in90 = *off
     c                   if        vufirm = l_firm
     c                   delete    vstrpfr
     c                   endif
     c                   read      vstrlu                                 90
     c                   enddo
      *
      * Tilbud
      *
     c                   read      vtillu                                 90
     c                   dow       *in90 = *off
     c                   if        vtfirm = l_firm
     c                   delete    vtilpfr
     c                   endif
     c                   read      vtillu                                 90
     c                   enddo
      *
      * Undergruppe
      *
     c                   read      vugrlu                                 90
     c                   dow       *in90 = *off
     c                   if        vgufir = l_firm
     c                   delete    vugrpfr
     c                   endif
     c                   read      vugrlu                                 90
     c                   enddo
      *
      * Vare Query
      *
     c                   read      vvaqpf                                 90
     c                   dow       *in90 = *off
     c                   if        vvfirm = l_firm
     c                   delete    vvaqpfr
     c                   endif
     c                   read      vvaqpf                                 90
     c                   enddo
      *
      * Vare
      *
     c                   read      vvarlu                                 90
     c                   dow       *in90 = *off
     c                   if        vvfirm = l_firm
     c                   delete    vvarpfr
     c                   endif
     c                   read      vvarlu                                 90
     c                   enddo
      *
      * Slettede varer
      *
     c                   read      vvaslu                                 90
     c                   dow       *in90 = *off
     c                   if        vvfirm = l_firm
     c                   delete    vvaspfr
     c                   endif
     c                   read      vvaslu                                 90
     c                   enddo
      *
      * Vare-enhet
      *
     c                   read      vvenlu                                 90
     c                   dow       *in90 = *off
     c                   if        vefirm = l_firm
     c                   delete    vvenpfr
     c                   endif
     c                   read      vvenlu                                 90
     c                   enddo
6.11  *
6.11  * Vare-enhet-prisgiver
6.11  *
6.11 c                   read      vveplu                                 90
6.11 c                   dow       *in90 = *off
6.11 c                   if        vepfir = l_firm
6.11 c                   delete    vveppfr
6.11 c                   endif
6.11 c                   read      vveplu                                 90
6.11 c                   enddo
      *
      * Varegruppeknytning
      *
     c                   read      vvgklu                                 90
     c                   dow       *in90 = *off
     c                   if        vkfirm = l_firm
     c                   delete    vvgkpfr
     c                   endif
     c                   read      vvgklu                                 90
     c                   enddo
      *
      * Vare-pris
      *
     c                   read      vvprlu                                 90
     c                   dow       *in90 = *off
     c                   if        vpfirm = l_firm
     c                   delete    vvprpfr
     c                   endif
     c                   read      vvprlu                                 90
     c                   enddo
      *
      * Vare-søk
      *
     c                   read      vvsolu                                 90
     c                   dow       *in90 = *off
     c                   if        vvsfir = l_firm
     c                   delete    vvsopfr
     c                   endif
     c                   read      vvsolu                                 90
     c                   enddo
      *
      * Varetype
      *
     c                   read      vvtylu                                 90
     c                   dow       *in90 = *off
     c                   if        vavfir = l_firm
     c                   delete    vvtypfr
     c                   endif
     c                   read      vvtylu                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
