      /TITLE  ASOFAK: Start utkjøring av ordrepapirer
     h datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FO605R
      * Beskrivelse . . : Start utkjøring av ordrepapirer
      *                   Kopi av FO604R. Fjernet valg for type. Kun
      *                   faktura/kreditnota.
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *K0000  240723 bsa  Nytt program
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvotyl1    if   e           k disk    rename(votypfr:votyl1r)
     ffstsl1    if   e           k disk    rename(fstspfr:fstsl1r)
     fraa1l1    if   e           k disk    rename(raa1pfr:raa1l1r)
     ffpm1lu    uf a e           k disk    rename(fpm1pfr:fpm1lur)
      *
     ffo605d    cf   e             workstn
      *
      * Definering av LDA
      *
     d                uds
     d l_wsid                901    910
     d l_user                911    920
     d l_sfir                944    946  0
     d l_fnav                951    980
      *
      * Datastruktur for navn på member
      *
     d                 ds
     d d_memb                        10
     d  d_alf1                        1    overlay(d_memb)
     d  d_firm                        3  0 overlay(d_memb:2)
     d  d_numm                        6  0 overlay(d_memb:5)
      *
      * Datastruktur for periode
      *
     d                 ds
     d d_peri                         4  0
     d  d_mmnd                        2  0 overlay(d_peri)
     d  d_aaar                        2  0 overlay(d_peri:3)
      *
      * Definering av parametere
      *
     d p_dirk          s              1  0
     d p_firm          s              3  0
     d p_numm          s              8  0
     d p_otyp          s              2
     d p_outq          s             10
     d p_skor          s              1
     d p_suff          s              2  0
      *
      * Definering av variable i nøkler
      *
     d votyl1_otyp     s                   like(vaotyp)
     d fpm1lu_1lst     s                   like(fk1lst)
     d fpm1lu_1usr     s                   like(fk1usr)
     d fpm1lu_1wsd     s                   like(fk1wsd)
      *
      * Definering av variable
      *
     d w_firm          s                   like(faafir)
     d w_valg          s                   like(fk1vg1)
     d w_numm          s              6  0
     d w_alf1          s              1
     d w_mnd1          s              2  0
     d w_mnd2          s              2  0
     d w_aar1          s              4  0
     d w_aar2          s              4  0
     d w_aar3          s              4  0
     d w_avik          s              4  0
     d w_dato          s               d   datfmt(*iso)
     d w_dato_6        s              6  0
     d w_aaar_4        s              4  0
     d w_kode          s              2  0
     d w_onof          s              1  0
     d w_memb          s             10
     d w_stat          s              1
     d w_sp_aar        s                   like(ra1aar)
     d w_sp_mnd        s                   like(ra1per)
     d w_sp_per        s              6  0
     d w_peri          s              6  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Velg om det skal kjøres direkte utskrift
      * Direkte utskrift kjøres dersom ordrenummer er utfylt
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   if        p_numm <> *zero
     c*                  eval      f1otyp =  p_otyp
     c                   goto      f2taga
     c                   endif
      *
     c                   eval      p_dirk = *zero
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * F1 Behandler valg av utskrift
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c*    f1taga        tag
     c*                  eval      f1valg = *zero
      *
      * Send alt
      *
     c*    f1tagb        tag
     c*                  exfmt     f1bld
      *
      * F3=Gå tilbake
      *
     c*    *inkc         cabeq     *on           xslutt
      *
      * F4=Legg jobb i jobbkø
      *
     c*                  if        *inkd  = *on
     c*                  eval      p_dirk = 2
     c*                  endif
      *
      * Finnes ordretype(til) i kode-register
      *
     c*                  if        f1otyp <> *blank
     c*                  eval      votyl1_otyp = f1otyp
     c*    votyl1_key    chain     votyl1r                            90
     c*                  if        *in90 = *on
     c*                  eval      *in31 = *on
     c*                  goto      f1tagb
     c*                  endif
     c*                  endif
      *
      * Benytt ordre-type, eller velg en fra listen
      *        av forhånsdefinerte ordre-typer
      *
     c*                  if        f1otyp = *blank
     c*                  if        f1valg = 0                                   TILBUD
     c*                  eval      f1otyp = f1ot01
     c*                  endif
     c*                  if        f1valg = 1                                   ORDREBEKREFT.
     c*                  eval      f1otyp = f1ot02
     c*                  endif
     c*                  if        f1valg = 2                                   PAKKSEDDEL
     c*                  eval      f1otyp = f1ot03
     c*                  endif
     c*                  if        f1valg = 3
     c*                  eval      f1otyp = f1ot04                              FAKTURA
     c*                  endif
     c*                  if        f1valg = 4
     c*                  eval      f1otyp = f1ot05                              KREDITNOTA
     c*                  endif
     c*                  if        f1valg = 5
     c*                  eval      f1otyp = '99'                                faktura/kreditnota
     c*                  endif
     c*                  endif
      *
     c                   goto      f2taga
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * F2 Innlegging av periode og faktura-dato
      *    Bildet vises bare dersom akk.type=3
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c     f2taga        tag
      *
      * Hent opplysninger fra ORDRETYPE-REGISTER
      *
     c*                  eval      votyl1_otyp = f1otyp
     c*    votyl1_key    chain     votyl1r                            90
      *
      * Er dette en Faktura/Kreditnota, hvis ikke, avslutt
      *
     c*                  if        f1otyp <> '99'
     c*                  if        vaoakk <> 3
     c*                  goto      start
     c*                  endif
     c*                  else
     c*                  eval      vaoakk = 3
     c*                  endif
      *
      * Nullstiller periode og fakturadato
      *
     c                   move      udate         f2peri
     c                   move      udate         f2dato
      *
      * Send alt
      *
     c     f2tagb        tag
     c                   exfmt     f2bld
      *
      * F3=Gå tilabke
      *
     c     *inkc         cabeq     *on           xslutt
      *
      * F4=Legg jobb i jobbkø
      *
     c                   if        *inkd  = *on
     c                   eval      p_dirk = 2
     c                   endif
      *
      * Er periode blanket ut ?
      *
     c                   if        f2peri = 0
     c                   eval      *in31  = *on
     c                   goto      f2tagb
     c                   endif
      *
      * Er periode en gyldig periode
      *
     c                   eval      w_mnd1 = 0
     c                   eval      w_aar1 = 0
      *
     c                   if        f2peri <> 0
     c                   move      f2peri        w_dato_6
     c                   movel     01            w_dato_6
     c     *dmy          test(d)                 w_dato_6               31
     c                   if        *in31 = *on
     c                   goto      f2tagb
     c                   endif
     c     *dmy          move      w_dato_6      w_dato
     c                   extrct    w_dato:*m     w_mnd1
     c                   extrct    w_dato:*y     w_aar1
     c                   endif
      *
      * Sjekk om årstall avviker med mer enn 1 år
      *
     c                   time                    w_dato
     c                   extrct    w_dato:*y     w_aar3
     c                   eval      w_avik = w_aar3 - w_aar1
     c                   if        w_avik < -1 or
     c                             w_avik >  1
     c                   eval      *in34 = *on
     c                   goto      f2tagb
     c                   endif
      *
      * Sjekk om periode er lavere enn "avsluttet periode" fra status
      *
     c                   if        w_sp_per <> 0
     c                   movel     w_aar1        w_peri
     c                   move      w_mnd1        w_peri
     c                   if        w_peri <= w_sp_per
     c                   eval      *in36 = *on
     c                   goto      f2tagb
     c                   endif
     c                   endif
      *
      * Varsle dersom årstall avviker fra dagens
      * m/mulighet for overstyring
      *
     c                   if        *inks = *off
     c                   if        w_avik <> 0
     c                   eval      *in35 = *on
     c                   goto      f2tagb
     c                   endif
     c                   endif
      *
      * Er fakturadato en gyldig dato
      *
     c                   eval      w_mnd2 = 0
     c                   eval      w_aar2 = 0
      *
     c                   if        f2dato <> 0
     c     *dmy          test(d)                 f2dato                 32
     c                   if        *in32 = *on
     c                   goto      f2tagb
     c                   endif
     c     *dmy          move      f2dato        w_dato
     c                   extrct    w_dato:*m     w_mnd2
     c                   extrct    w_dato:*y     w_aar2
     c                   endif
      *
      * Er fakturadato innefor periode
      *
     c                   if        *inks = *off
     c                   if        w_mnd1 <> w_mnd2
     c                   eval      *in33 = *on
     c                   goto      f2tagb
     c                   endif
     c                   endif
      *
     c                   if        *inks = *off
     c                   if        w_aar1 <> w_aar2
     c                   eval      *in33 = *on
     c                   goto      f2tagb
     c                   endif
     c                   endif
      *
      * Er fakturering igang fra en annen skjerm ?
      *
     c                   eval      w_kode = 01
     c                   eval      w_onof = 0
     c                   call      'FA730R'
     c                   parm                    w_kode
     c                   parm                    w_onof
      *
     c                   if        w_onof = 1
     c                   goto      xslutt
     c                   endif
      *
      * Kjøres overføring til regnskap fra en annen skjerm ?
      *
     c                   eval      w_kode = 02
     c                   eval      w_onof = 0
     c                   call      'FA730R'
     c                   parm                    w_kode
     c                   parm                    w_onof
      *
     c                   if        w_onof = 1
     c                   goto      xslutt
     c                   endif
      *
      * Oppdater jobb-register med aktiv-flagg
      *
     c                   eval      w_kode = 01
     c                   eval      w_onof = 1
     c                   call      'FA720R'
     c                   parm                    w_kode
     c                   parm                    w_onof
      *
     c                   goto      start
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * START Behandler danning av parameter før utskrift
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c     start         tag
      *
      * Kaller opp subrutine for utlegging av parameter, for
      * start av utskrift (w_valg=Internt listenummer fra 0 til 3)
      *
     c                   eval      w_valg = *zero
     c                   exsr      param
      *
      * Hopp ut og start utkjøring, dersom kun ett ordrenummer er valgt
      *
     c                   if        p_numm <> *zero
     c                   goto      neste
     c                   endif
      *
      * TILBUD : Subrutinen må kjøres 3 ganger
      *
     c                   if        vaoakk = 0
     c                   eval      w_valg = 1
     c                   exsr      param
     c                   eval      w_valg = 2
     c                   exsr      param
     c                   eval      w_valg = 3
     c                   exsr      param
     c                   goto      neste
     c                   endif
      *
      * ORDREPAPIRER : Subrutinen skal kjøres en gang
      *
     c                   if        vaoakk = 1
     c                   eval      w_valg = 1
     c                   exsr      param
     c                   goto      neste
     c                   endif
      *
      * PAKKSEDDEL : Subrutinen skal ikke kjøres
      *
     c                   if        vaoakk = 2
     c                   goto      neste
     c                   endif
      *
      * FAKTURA/KREDITNOTA: Subrutinen skal ikke kjøres
      *
     c                   if        vaoakk = 3
     c                   goto      neste
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * NESTE Kaller opp 'CL'-programmet for å starte utskriften
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c     neste         tag
      *
     c                   call      'FO612C'
     c                   parm                    d_memb
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Oppdaterer  ORDRE-PLUKK-PARAM1-REGISTER
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c     param         begsr
      *
     c                   eval      fpm1lu_1lst = w_valg
     c     fpm1lu_key    chain     fpm1lur                            90
      *
     c                   eval      fk1utq = p_outq
     c                   eval      fk1oty = '99'
     c                   eval      fk1onr = p_numm
     c                   eval      fk1suf = p_suff
     c                   eval      fk1vg0 = p_dirk
     c                   eval      fk1vg1 = w_valg
     c*                  eval      fk1vg2 = f1vlg2
     c                   eval      fk1vg2 = 0
     c*                  eval      fk1vg3 = f1vlg3
     c                   eval      fk1vg3 = 0
      *
     c                   move      f2peri        d_peri
     c                   move      d_aaar        w_aaar_4
     c                   if        d_aaar < 80
     c                   movel     20            w_aaar_4
     c                   else
     c                   movel     19            w_aaar_4
     c                   endif
     c                   move      d_mmnd        fk1per
     c                   movel     w_aaar_4      fk1per
      *
     c                   if        f2dato <> 0
     c     *dmy          move      f2dato        fk1dat
     c                   endif
      *
     c                   if        *in90 = *off
     c                   update    fpm1lur
     c                   else
     c                   eval      fk1fir = w_firm
     c                   eval      fk1wsd = l_wsid
     c                   eval      fk1usr = l_user
     c                   eval      fk1lst = w_valg
     c                   write     fpm1lur
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c     *inzsr        begsr
      *
      * Nullstilling av felter som ikke kan redefineres
      *
     c                   eval      w_alf1 = *zero
     c                   eval      w_numm = *zero
      *
     c                   eval      w_mnd1 = *zero
     c                   eval      w_mnd2 = *zero
      *
      * Key for file : OFAK-KODE-REGISTER
      *
     c     fstsl1_key    klist
     c                   kfld                    w_firm
      *
      * Key for file : Kode - status 1
      *
     c     raa1l1_key    klist
     c                   kfld                    w_firm
      *
      * Key for file : ORDRETYPE-REGISTER
      *
     c     votyl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    votyl1_otyp
      *
      * Key for file : PLUKK-1-LINJE-REGISTER
      *
     c     fpm1lu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    fpm1lu_1wsd
     c                   kfld                    fpm1lu_1usr
     c                   kfld                    fpm1lu_1lst
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Tar inn parameter fra forrige program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c     *entry        plist
     c                   parm                    p_skor
     c                   parm                    p_firm
     c                   parm                    p_numm
     c                   parm                    p_suff
     c                   parm                    p_otyp
     c                   parm                    p_dirk
     c                   parm                    p_outq
      *
      * Legger inn firmanummer i nøkklene
      *
     c                   eval      w_firm = p_firm
     c                   eval      d_firm = p_firm
      *
      * Legger inn opplysninger i nøkklene
      *
     c                   eval      fpm1lu_1wsd = l_wsid
     c                   eval      fpm1lu_1usr = l_user
      *
      * Hent opplysninger fra OFAK-STATUS-REGISTER
      *
     c     fstsl1_key    chain     fstsl1r                            90
     c                   if        *in90  = *off
     c*                  eval      f1ot01 = faaot1
     c*                  eval      f1ot02 = faaot2
     c*                  eval      f1ot03 = faaot3
     c*                  eval      f1ot04 = faaot4
     c*                  eval      f1ot05 = faaot5
     c                   endif
      *
      * Hent opplysninger fra koder -status 1
      *
     c     raa1l1_key    chain     raa1l1r                            90
     c                   if        %found(raa1l1)
     c                   eval      W_sp_mnd = ra1per
     c                   eval      w_sp_aar = ra1aar
     c                   eval      w_sp_per = w_sp_aar * 100 + w_sp_mnd
     c                   else
     c                   eval      w_sp_per = *zero
     c                   endif
      *
      * Henter siste nummer for File-member
      *
     c     new_memb      tag
      *
     c                   call      'FA920R'
     c                   parm                    w_alf1
     c                   parm                    w_numm
      *
     c                   move      'A'           d_alf1
     c                   move      w_numm        d_numm
      * Sjekk om member ikke er brukt tidligere
     c                   eval      w_stat = *blanks
     c                   eval      w_memb = d_memb
     c                   call      'FO604C'
     c                   parm                    w_memb
     c                   parm                    w_stat
      *
     c                   if        w_stat = '1'
     c                   eval      w_numm = *zeros
     c                   goto      new_memb
     c                   endif
      *
     c                   endsr
      *
