     H/TITLE  ASOFAK: Inntasting av parameter for ordre-utskrift
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FO672R
      * Beskrivelse . . : Inntasting av parametre ved faktura-journal
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
6.nu  * R6.30 280514 bsa  Programmet gjennomgått mtp nummerutvidelser.
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     FFO672D    CF   E             WORKSTN
      *
      *
     D                 DS
6.nu D  DSPARM                 1     32
     D  DSAARR                 1      4  0
     D  DSOTYP                 5      6
6.nu D  DSFBIN                 7     14  0
6.nu D  DSTBIN                15     22  0
6.nu D  DSPROG                23     32
      *
      * - - - - - - - - - - - - - -
      * Henter inn data fra LDA
      * - - - - - - - - - - - - - -
      *
     D                UDS
     D  DSRUTI               800    809
     D  DSSFIR               944    946  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  A1 Behandler valg for utskrift av FAKTURA/KREDITNOTA-kopier    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     A1TAG         TAG
      *
      *  Nullstiller felter som benyttes
      *
     C                   MOVE      UYEAR         A1AARR
     C                   MOVE      *ZERO         A1FBIN
     C                   MOVE      *ZERO         A1TBIN
      *
     C     A1AARR        IFGT      80
     C                   ADD       1900          A1AARR
     C                   ELSE
     C                   ADD       2000          A1AARR
     C                   ENDIF
      *
     C     A1TAGA        TAG
     C                   EXFMT     A1BLD
      *
      *  F3=Avslutt
      *
     C     *INKC         IFEQ      *ON
     C                   Z-ADD     1             WPPF03
     C                   GOTO      XSLUTT
     C                   END
      *
      *  Kontroll om fra
      *  er større enn til
      *  dersom til er oppgitt
      *
     C     A1TBIN        IFNE      *ZERO
     C     A1FBIN        IFGT      A1TBIN
     C                   MOVE      *ON           *IN33
     C                   GOTO      A1TAGA
     C                   ENDIF
     C                   ENDIF
      *
      *  Dersom til ikke er
      *  oppgitt, legges fra
      *  ut i til
      *
     C     A1TBIN        IFEQ      *ZERO
     C                   Z-ADD     A1FBIN        A1TBIN
     C                   ENDIF
      *
     C                   MOVE      A1AARR        DSAARR
     C                   MOVE      A1FBIN        DSFBIN
     C                   MOVE      A1TBIN        DSTBIN
     C                   MOVE      DSPARM        WPPARM
      *
     C                   MOVE      'FO674'       DSRUTI
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Avslutt program                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     C     XSLUTT        TAG
      *
     C                   SETON                                        LR
     C                   RETURN
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     *INZSR        BEGSR
      *
      *  Nullstilling av felter som ikke kan redefineres
      *
     C                   MOVE      *BLANK        WRETUR            1
      *
      *  Parameterliste
      *
     C     *ENTRY        PLIST
6.nu C                   PARM                    WPPARM           32
     C                   PARM                    WPPF03            1 0
      *
     C                   ENDSR
