     H/TITLE  ASOFAK: Utskrift av Tilbud
pdf  h decedit('0.') datedit(*ymd-) option(*nodebugio)
pdf  h DftActgrp(*No) BndDir('CGIDEV2/CGIDEV2')
      *
pdf   /copy hspecsbnd
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Program . . . . : FO910R
      * Beskrivelse . . : Utskrift av Tilbud
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
3.11  * R3.11 180600 KOB  Lagt inn spesifisering av ordrerabatt
3.12  * R3.12 310800 AMD  Lagt inn mulighet for utprint av avdelingsnavn
3.12  *                   i stedet for firmanavn dersom ønskelig
3.13  * R3.13 110900 AMD  Dersom vare er hentet fra LVR settes det inn
3.13  *                   2 desimaler som standard (finnes jo ikke i EVR)
3.33  * R3.33 310501 AMD  Lagt inn utskrift av telefon/fax/mobil.
5.01  * R5.01 221002 AMD  Løsning for å kunne sende e-mail
5.02  * R5.02 260903 AMD  Automatisk opplegg for subject (emne) ved
5.02  *                   sending av mail.
5.21  * R5.21 261103 AMD  Overstyrer med mobilnummer fra ordrehode
5.21  *                   dersom oppgitt.
5.22  * R5.22 031203 AMD  Skrive tekst 2 dersom den finnes i varereg.
5.22  *                   + lagt inn utskrift av leveringstype
5.22  *                   + lagt inn skråstrek mellom telefon / telefax
5.41  * R5.41 150605 AMD  Hente styring på firmaopplysninger fra LDA.
5.50  * R5.50 110307 KOB  Lagt inn ny beregning av mva
5.61  * R5.61 200608 AMD  Tar hensyn til epost-adresse på kundeprosjekt
6.10  * R6.10 070909 BSA  Utskriften endret pga utvidelse av referansefelter.
6.12  * R6.12 200809 AMD  Lagt inn spesifisering av flere mva-satser
pdf   * R6.10 070610 bsa  Lagt inn funksjonalitet for eksport til XML
pdf   *                   format for videre arkivering og utskrift.
6.13  * R6.10 270910 bsa  Tillegg av faste tagger. Display tag + ordrenummer
6.13  *                   hvis den finnes.
6.14  * R6.10 300910 bsa  Hvis konvtertering av spesialtegn, legges til flere tegn
6.14  *                   som kan gjøre at noen av disse faller utenfor pga av felt-
6.14  *                   lengde.
6.15  * R6.10 071010 bsa  Legger inn test om gyldig utkø. Hvis ikke, legger vi ikke
6.15  *                   ut "printer kommand" tagger.
6.16  * R6.10 111010 bsa  Legger default verdi inn for Tendertype.
6.17  * R6.10 211010 bsa  Kaller eget program for scann av tegn.
6.18  * R6.10 041110 bsa  Div. feil. antall kopier + manglende info.
6.19  * R6.10 241110 bsa  Håndtering av linjeskift i e-mail utsendelse
6.20  * R6.10 040111 bsa  Slå sammen tekstlinje 1 og 2 på samme linje
6.21  * R6.10 210111 bsa  Mangler ved scann av strenger
6.22  * R6.10 160311 bsa  Ved valg av *ARKIV som skriver skal den kun arkiveres
6.23  * R6.10 230311 bsa  Faks legges som ledetekst til felt
6.24  * R6.20 100511 bsa  Lagger ut rutinetekst som metatagg.
6.25  * R6.25 240511 NHO  Mobil nr skal legges ut dersom 1 i felt
      *                   FAAMSA i fil FSTSPF
6.26  * R6.20 130212 bsa  Sjekker om det er flere mailmotakere i adressefeltet
6.26  *                   Må være adskilt med ',' (komma).
6.27  * R6.20 210212 bsa  Legger ut forsendelsesmåte
6.28  * R6.20 280312 bsa  Håndetring av "space" mellom tekst 1 og 2 ved tekstlinjer
6.29  * R6.20 290512 bsa  Håndterer riktig MVA ifbm organisasjonsnr.
6.2A  * R6.20 280612 bsa  Strukturendring av og nye xml tagger
6.2B  * R6.20 300412 bof  Legger ut lengdespesifikasjoner - bruker D2DET
6.2C  * R6.20 151012 bsa  Scanner topp og bunntekst
6.2D  * R6.20 251012 bsa  Må hente medianavn, og ikke skuffnummer
6.2E  * R6.20 041212 bsa  Legger ut nytt unikt refno, utvidet metatagger
6.2F  * R6.20 040113 bsa  Endrer logikke i oppbygging av Refno.
6.2G  * R6.20 050413 bsa  Scanner rekvisisjonsnummer
6.2H  * R6.20 180913 bsa  Scanner emnefeltet på mail etter ugyldige tegn
6.2I  * R6.20 201113 bsa  Scanner lev.varenummer
6.2J  * R6.20 140415 bsa  0 stiller minne for gjenbruk av XML info
6.nu  * R6.30 030614 bsa  Programmet gjennomgått mtp nummerutvidelser.
6.30  * R6.30 120914 bsa  Utvidet parameterliste til FO798R. Reversert
6.30  *                   6.26, da det er lagt inn tre separate mailfelter
6.31  * 6.30  051214 Bsa  Utvidet parameterliste til FÅ707R
6.32  * 6.30  280115 bsa  Skriver til datakø for å trigge java sniffer
6.33  * 6.30  030915 bsa  Legger ut avdeling som tagg for arkiveringsformål.
6.34  * 6.30  160915 bsa  Scanner kampanje
6.35  * 6.30  251115 bsa  Leveringinfo ligger feil i sekvensen. Flyttes.
6.36  * 6.30  180319 bsa  Hent inn selgerinfo uansett.
6.37  * 6.30  251119 bof  Bruker FOKUND for å slå opp mot kontaktperson
6.37  *                   skal bruke FOLKUN hvis det ligger noe der
6.38  * 6.30  270220 bsa  Må huske å sende med suffiks
      *
7.01  *K0000  240820 bsa  Utvidet defenisjon av W1NPRI
7.02  * 6.30  260418 bsa  Kaller nytt program for utsendelse av mail
7.03  *K0000  290416 bsa  Legger ut varetype som ekstrainformasjon.
      *
8.01  *K0000  120122 bsa  Hvis varekunde, fakturakunde og kundeprosjekt,
8.01  *K0000              skal varekunde ut på dokumentet.
8.02  *K0000  151122 bsa  Legger ut volum og vekt, totalt og på linjer.
8.03  *K0000  211122 bsa  Nullstille felter vi ikke har verdi for.
8.04  *K0000  051023 bsa  Legger ut eksternt/prosjektnummer.
8.05  *PRG2   210622 bof  Utvidet prisgruppe fra 1 til 2 posisjoner
8.06  *K0000  120924 bsa  Endrer arkiveringsreferanse.
8.07  *K0000  120325 bsa  Skriver inn til tabell for bruk ved søking i arkiv.
      *
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     FFPSOL1    IPE  E             DISK    RENAME(FPSOPFR:FPSOL1R)
     FFSTSL1    IF   E           K DISK    RENAME(FSTSPFR:FSTSL1R)
     FVOTYL1    IF   E           K DISK    RENAME(VOTYPFR:VOTYL1R)
     FVLTYL1    IF   E           K DISK    RENAME(VLTYPFR:VLTYL1R)
     FVPKOL1    IF   E           K DISK    RENAME(VPKOPFR:VPKOL1R)
     FFOHEL1    IF   E           K DISK    RENAME(FOHEPFR:FOHEL1R)
     FFODTL1    IF   E           K DISK    RENAME(FODTPFR:FODTL1R)
     FFOTXL1    IF   E           K DISK    RENAME(FOTXPFR:FOTXL1R)
     FVVARL1    IF   E           K DISK    RENAME(VVARPFR:VVARL1R)
     Frkunl1    IF   E           K DISK    RENAME(RKUNPFR:rkunl1r)
     FAFORL1    IF   E           K DISK    RENAME(AFORPFR:AFORL1R)
6.18 fafirl1    if   e           k disk    rename(afirpfr:afirl1r)
6.25 fra09l1    if   e           k disk    rename(ra09pfr:ra09l1r)
6.2A fra07pf    if   e           k disk
6.2B ffvlsl1    if   e           k disk    rename(fvlspfr:fvlsl1r)
7.03 fvlagl1    if   e           k disk    rename(vlagpfr:vlagl1r)
8.04 ffkprl1    if   e           k disk    rename(fkprpfr:fkprl1r)
      *
     FFO910P    O    E             PRINTER
6.12  *
6.12  * Definering av array's
6.12  *
6.12 d mko             s              1    dim(9)
6.12 d msa             s              5  2 dim(9)
6.12 d mgr             s             11  2 dim(9)
6.12 d mbe             s             11  2 dim(9)
6.12 d mog             s             11  2 dim(9)
6.12 d mor             s             11  2 dim(9)
      *
      * - - - - - - - - - - - - - -
      * Henter inn data fra LDA
      * - - - - - - - - - - - - - -
      *
     D                UDS
pdf  d l_poff                584    584
6.22 d l_utqm                585    594
pdf  d l_bach                595    635
pdf  d l_arch                636    636  0
pdf  d l_skje                637    637  0
pdf  d l_land                638    638  0
pdf  d l_exlp                639    639  0
pdf  d l_mail                640    640  0
5.41 D  l_prfi               750    750  0
     D  l_ruti               800    809
5.01 D  l_outq               810    819
6.18 d l_copy                838    843  0
     D  l_alin               856    858  0
6.2E d  l_wsid               901    910
pdf  d  l_user               911    920
pdf  d  l_filg               931    933
     D  l_firm               944    946  0
6.33 D  l_avde               947    950  0
5.01  *
5.01  * Definering av parametre
5.01  *
5.01 d p_mail          s              1
5.01 d p_kund          s              6  0
5.61 d p_kpro          s              6  0
6.nu d p_numm          s              8  0
6.30 d p_suff          s                   like(fosuff)
5.02 d p_selg          s              4  0
      *
pdf  d p_serv          s             35
pdf  d p_stat          s              1
pdf  d p_kule          s              1
pdf  d p_navn          s             30
pdf  d p_emal          s             50
pdf  d p_ema2          s             50
6.30 d p_ema3          s             50
6.30 d p_kopi          s             50
7.02 d p_e702          s            180
pdf  d p_emne          s             50
pdf  d p_txt1          s             50
pdf  d p_txt2          s             50
pdf  d p_txt3          s             50
pdf  d p_txt4          s             50
pdf  d p_pers          s             50
pdf  d p_inif          s             40
pdf  d p_in03          s              1
6.15 d p_ok            s              1
6.17 d p_lr            s              1
6.17 d p_str_in        s            512
6.17 d p_str_out       s            512
6.32 d p_filg          s             10
6.32 d p_xmlf          s            256
      *
      * Definering av variable
6.25 d ra09l1_ikod     s                   like(raikod)
6.2A d ra07pf_avde     s                   like(ragkod)
6.2B d fvlsl1_numm     s                   like(fvnumm)
6.2B d fvlsl1_suff     s                   like(fvsuff)
6.2B d fvlsl1_line     s                   like(fvline)
7.03 d vlagl1_vare     s                   like(vlvare)
7.03 d vlagl1_lage     s                   like(vllage)
8.04 d fkprl1_kund     s                   like(flkund)
8.04 d fkprl1_kpro     s                   like(flkpro)
      *
6.25 d w_selgn         s             16
6.25 d                 ds
6.25 d x_mobi                        12
6.25 d  d_tegn                        1    overlay(x_mobi:1)
6.25 d  d_mobn                       11    overlay(x_mobi:2)
3.12 d w_prfi          s              1  0
3.12 d w_ffir          s              3  0
3.12 d w_avde          s              4  0
3.12 d w_fnav          s             30
3.12 d w_fad1          s             30
3.12 d w_fad2          s             30
3.12 d w_fste          s             30
3.12 d w_fftx          s             30
3.12 d w_tfax          s              8
3.12 d w_ftlf          s             11
3.12 d w_ffax          s             11
3.33 d w_tlfn          s             20
3.33 d w_tlfx          s             20
3.33 d w_mobn          s             20
6.2E d w_refn          s             50
     d wpcbda          s               d   datfmt(*iso)
     d wpcfda          s               d   datfmt(*iso)
7.01 d w1npri          s             13  2
      *
5.50 d w_stat          s              1
5.50 d w_mvak          s              1
5.50 d w_mvtx          s             30
5.50 d w_dato          s               d   datfmt(*iso)
5.50 d w_mvas          s              6  2
5.50 d w_mvat          s              5  4
5.50 d w_mvaf          s             10  9
5.50 d w_bpro          s              5  2
6.31 d w_mail          s             50
6.31 d w_weba          s             50
      *
6.12 d m               s              2  0
6.12 d w_xmbe          s             11  2
5.50 d w_mvab          s             13  2
6.2B d w_leng          s              6  0
6.2B d w_anta          s              6  0
      *
6.2B d b_leng          s              1    inz(*off)
8.02 d b_avvi          s              1    inz(*off)
      *
pdf  d b_pdfp          s              1    inz(*off)
pdf  d b_topt          s              1    inz(*off)
pdf  d b_bott          s              1    inz(*off)
pdf  d x_numm          s             15
pdf  d x_vref          s             25
pdf  d x_betb          s             42
pdf  d w_bdat          s               d   datfmt(*iso)
pdf  d w_date          s               d   datfmt(*iso)
pdf  d w_kode          s              1
pdf  d w_firm          s                   like(fofirm)
pdf  d w_fell          s              6
pdf  d w_type          s              2
pdf  d w_fast          s             10
pdf  d w_ruti          s             10
6.nu d w_numm          s              8  0
pdf  d w_pdf           s              1  0
pdf  d w_jnav          s             15
pdf  d w_jkey          s             41
pdf  d w_jtxt          s             35
pdf  d w_pdf_ds        s            512
pdf  d w_mtxt          s            300
pdf  d w_jstat         s              2  0
pdf  d w_jtext         s            200
pdf  d w_land          s              9
pdf  d w_mark          s              5
pdf  d w_spol          s              5
pdf  d w_str_in        s            512
pdf  d w_str_out       s            512
pdf  d w_x             s              3  0
pdf  d w_path          s            256
pdf  d w_ema2          s             50
pdf  d w_ttype         s              1
6.2D d w_draw1         s             25
6.2D d w_draw2         s             25
6.13 d w_dspl          s            250
6.17 d w_tek1          s            512
6.17 d w_tek2          s            512
6.21 d w_1dref         s            512
6.21 d w_1vref         s            512
6.20 d w_tek0          s            512
6.14 d w_1fnav         s             50
6.14 d w_1fad1         s             50
6.14 d w_1fad2         s             50
6.14 d w_1navn         s             50
6.14 d w_1gate         s             50
6.14 d w_1adr2         s             50
6.14 d w_2navn         s             50
6.14 d w_2adr1         s             50
6.14 d w_2adr2         s             50
6.18 d w_copy          s              3  0
6.23 d w_faks          s             30
6.19 d w_ptxt1         s             75
6.19 d w_ptxt2         s             75
6.19 d w_ptxt3         s             75
6.19 d w_ptxt4         s             75
6.19 d w_ppers         s             75
7.02 d w_pe702         s            256
6.2H d w_pemne         s             75
6.26 d w_emal1         s             50
6.26 d w_emal2         s             50
6.26 d w_emal3         s             50
6.26 d w_emal4         s             50
6.26 d w_posi          s              3  0
6.27 d w_lmtx          s             50
6.2A d w_lbtx          s             50
6.2A d w_ddeno         s                   like(ragkod)
6.2A d w_dnavn         s             50
6.2A d w_dadr1         s             50
6.2A d w_dadr2         s             50
6.2A d w_dpcde         s                   like(ragpnr)
6.2A d w_dpstd         s             50
6.2A d w_dphon         s                   like(ragtlf)
6.2A d w_dfaxn         s                   like(ragfax)
6.2A d w_ldat          s              6  0
6.2A d w_lddt          s              6  0
6.2C d w_ttext         s            100
6.2C d w_btext         s            100
6.2D d w_skuf          s             25
6.2D d w_dtray         s             10
6.2D d w_gtray         s             10
6.2G d w_rekv          s             50
6.2I d w_lvar          s             50
6.34 d w_kamp          s             50
7.03 d w_vltx          s             23
8.02 d w_vekt          s              9  3
8.02 d w_volu          s              9  3
8.02 d w_tvekt         s              9  3
8.02 d w_tvolu         s              9  3
8.04 d w_kpro          s              6  0
8.04 d w_epro          s             25
8.07 d w_year          s              4  0
8.07 d w_stmp          s               z
pdf   *
pdf  d XML_Output      s            256a   Varying
pdf  d XML_path        s            256a   Varying
pdf  d                                     Inz('/home/asp/print/adb')
pdf  d jasper_mal      s            256a   inz('file:/home/asp/print/maler/+
pdf  d                                     tilbud/TILBUD.jasper')
pdf  d jasper_logo     s            256a   varying
pdf  d tmpdate         s               D
pdf  d tmptime         s               T
6.19 d crlf            c                   const(X'0d25')
pdf   *
pdf  d d_pdf_ds        ds
pdf  d  d_xmlm                       75
pdf  d  d_jasm                       75
pdf  d  d_logo                       75
pdf  d  d_path                      100
pdf  d  d_emal                       50
6.32 d  d_fifo                       75
6.32 d  d_kopi                        1
6.32 d  d_dtaq                        1
6.32 d  d_sign                        1
pdf   /copy prototypeb
pdf   /copy usec
pdf   *
7.02 d u_s702          s              1    inz(*off)                            Nulle fakturatype
7.02  *
7.02  * Definering av eksterne prg
7.02  *
7.02   dcl-s co402_verdi1  char(1);
7.02   dcl-s co402_verdi2  char(2048);
7.02   DCL-PR CO402R EXTPGM('CO402R');
7.02     p_filgrp            char(3)     const;
7.02     p_firm              packed(3:0) const;
7.02     p_lager             packed(2:0) const;
7.02     p_nokkel            char(50)    const;
7.02     p_verdi1            char(1);
7.02     p_verdi2            char(2048);
7.02   END-PR;
7.02  *
      *
     IFPSOL1R       01
     I                                          FKSSRT        L4
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av formater                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede formater
      * - - - - - - - - - -
      *
      * A1HDR  - Heading A1 på rapport
      * A2HDR  - Heading A2 på rapport
      * A4HDR  - Heading A4 på rapport, Ordrehode over varelinje
      * D1DET  - Detail  D1 på rapport, Varelinje
      * E1DET  - Detail  E1 på rapport, Tekstlinje
      * O1DET  - Detail  O1 på rapport, Overføring til/fra neste side
3.11  * R1RAB  - Total   R1 på rapport
      * T1TOT  - Total   T1 på rapport
      *
      *
      * Forklaring på variabler
      * - - - - - - - - - - - -
      *
      * D1ANT0 - Antall med 0 desimaler
      * D1ANT1 - Antall med 1 desimaler
      * D1ANT2 - Antall med 2 desimaler
      * D1ANT3 - Antall med 3 desimaler
      * D1NPRI - Netto  pris
      * D1BPRI - Brutto pris
      * D1NBEL - Netto  beløp
      * D1BBEL - Brutto beløp
      * D1RABP - Rabatt i prosent (Sum prosent 1 og 2)
      * D1RABB - Rabatt i beløp
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Styre-rutine                                                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
8.07  *
8.07 C/Exec SQL
8.07 C+  Set Option DatFmt=*ISO, DlyPrp=*YES, SRTSEQ=*LANGIDUNQ, LANGID=NOR,
8.07 C+             commit=*none
8.07 C/End-Exec
      *
      * Initierings-rutine
      *
     C   01FCYCLE        CASEQ     *ZERO         XSTRSR
     C                   ENDCS
      *
      * Ordrehode
      *
     C     FKSKOD        CABEQ     'H'           TAG01
      *
      * Varelinje
      *
     C     FKSKOD        CABEQ     'V'           TAG02
      *
      * Kommentar/
      * tekstlinje
      *
     C     FKSKOD        CABEQ     'K'           TAG03
      *
      * Ferdig
      *
     C                   GOTO      XSLUTT
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A1HDR Behandle heading A1 + A2                                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG01         TAG
      *
      * Null-stilling av variabler
      *
     C                   Z-ADD     0             O1TRSP
      *
      * Hent ordre-heading
      *
     C                   MOVE      FKSONR        WWNUMM
     C                   MOVE      FKSSUF        WWSUFF
     C     KEY01         CHAIN     FOHEL1R                            61
      *
      * Snu dato
      *
     c                   if        fobdat <> *loval
     c     *dmy          move      fobdat        a1bdat
     c                   endif
      *
     c                   if        fotdat <> *loval
     c     *dmy          move      fotdat        a1tdat
     c                   endif
6.2A  *
6.2A c                   if        foldat <> *loval
6.2A c     *dmy          move      foldat        w_ldat
6.2A c                   endif
      *
      * Legg inn ordrenummer
      *
     C                   MOVE      FONUMM        A1NUMM
     C                   MOVEL     '/'           A1SUFF
     C                   MOVE      FOSUFF        A1SUFF
      *
      * Flere ordre på samme
      * blankett ?
      *
     C  NL4              GOTO      TAG01A
      *
      * Hente inn kunderegister
      *
     C                   MOVE      FOKUND        WWKUND
     C     KEY04         CHAIN     rkunl1r                            64
     C                   MOVE      FOKUND        A1KUND
     C                   MOVE      RKKATG        A1KATG
     C                   MOVE      RKNAVN        A1NAVN
     C                   MOVE      RKGATE        A1GATE
     C                   MOVE      RKADR2        A1ADR2
     C                   MOVE      RKSTED        A1STED
8.01  *
8.01  * Sjekk hvilken kunde som skal ut på dokumentet
8.01  *
8.01 c                   if        fokund <> 0 and
8.01 c                             folkun <> 0 and
8.01 c                             fokund <> folkun and
8.01 c                             fokpro <> 0
8.01 c                   eval      wwkund = folkun
8.01 c     key04         chain     rkunl1r
8.01 c                   if        %found
8.01 c                   eval      a1kund = folkun
8.01 c                   eval      a1katg = rkkatg
8.01 c                   eval      a1navn = rknavn
8.01 c                   eval      a1gate = rkgate
8.01 c                   eval      a1adr2 = rkadr2
8.01 c                   eval      a1sted = rksted
8.01 c                   endif
8.01 c                   endif
      *
      * Sjekke tilbuds-kunden
      *
     C     FOKUND        IFEQ      W0KUND
     C                   MOVE      FOLKUN        FOKUND
     C                   MOVE      FONAVN        A1NAVN
     C                   MOVE      FOADR1        A1GATE
     C                   MOVE      FOADR2        A1ADR2
     C                   MOVE      FOSTED        A1STED
     C                   MOVE      *ZERO         FOLKUN
     C                   MOVE      *BLANK        FONAVN
     C                   MOVE      *BLANK        FOADR1
     C                   MOVE      *BLANK        FOADR2
     C                   MOVE      *BLANK        FOSTED
     C                   END
      *
      * Finner hvilken mva-sats
      * som skal benyttes
      *
5.50 c*                  call      'FÅ705R'
5.50 c*                  parm                    wwfirm
5.50 c*                  parm                    fobdat
5.50 c*                  parm                    wpmvas
5.50 c*                  parm                    wpmvat
5.50 c*                  parm                    wpmvaf
      *
      * Hente inn betalingsbetingelser
      *
     C                   exsr      sbbetb
      *
      * Er det registrert
      * leveringsadresse?
      *
     C                   MOVE      *OFF          *IN31
     C     FONAVN        IFNE      *BLANK
     C                   MOVE      *ON           *IN31
     C                   MOVE      FONAVN        A2NAVN
     C                   MOVE      FOADR1        A2ADR1
     C                   MOVE      FOADR2        A2ADR2
     C                   MOVE      FOSTED        A2STED
     C                   ENDIF
      *
      * Er det registrert
      * leveringsdato?
      *
     C                   MOVE      *OFF          *IN32
     C     FOLDAT        IFNE      *loval
     C                   MOVE      *ON           *IN32
     C                   ENDIF
      *
      * Er det registrert
      * kundens referanse?
      *
     C                   MOVE      *OFF          *IN33
     C     FODREF        IFNE      *BLANK
     C                   MOVE      *ON           *IN33
     C                   MOVE      FODREF        A1DREF
     C                   ENDIF
      *
      * Er det registrert
      * leveringsmåte?
      *
     C                   MOVE      *OFF          *IN34
     C     FOLMTX        IFNE      *BLANK
     C                   MOVE      *ON           *IN34
     C                   MOVE      FOLMTX        A1LMTX
     C                   ENDIF
      *
      * Er det registrert
      * rekvisisjon?
      *
     C                   MOVE      *OFF          *IN35
     C     FOREKV        IFNE      *BLANK
     C                   MOVE      *ON           *IN35
     C                   MOVE      FOREKV        A1REKV
     C                   ENDIF
3.33  *
3.33  * Hente inn telefon/fax/mobil fra kunde
3.33  *
3.33 c                   call      'FÅ710R'
3.33 c                   parm                    wwfirm
3.33 c                   parm                    a1kund
3.33 c                   parm                    fokpro
3.33 c                   parm                    w_tlfn
3.33 c                   parm                    w_tlfx
3.33 c                   parm                    w_mobn
3.33 c                   eval      a1tlfn = w_tlfn
3.33 c                   eval      a1tlfx = w_tlfx
3.33 c                   eval      a1mobn = w_mobn
5.21  *
5.21  * Overstyre med mobilnummer fra ordrehode
5.21  * dersom oppgitt
5.21  *
5.21 c                   if        fomobi <> *blank
5.21 c                   eval      a1mobn = 'Mob: ' + fomobi
5.21 c                   endif
      *
6.23 c                   eval      w_faks = *blank
6.23 c                   if        rktlfx <> *blank
6.23 c                   eval      w_faks = 'Faks: ' + rktlfx
6.23 c                   endif
      *
      * Flytte øvrige felter
      *
      *
     C     *hms          MOVE      FOTIME        A1TIME
     C                   MOVE      FOSELG        A1SELG
     C                   MOVE      FOVREF        A1VREF
6.25  *
6.25 C                   eval      x_mobi = *blank
6.25 C                   eval      x_mobn = *blank
6.25  *
6.25 c*6.36              if        faamsa = 1
6.25 c                   eval      ra09l1_ikod = foselg
6.25 c     ra09l1_key    chain     ra09l1
6.25 c                   if        raimob <> *blank
6.25 c                   move      '/'           d_tegn
6.25 c                   move      raimob        d_mobn
6.25 c                   move      x_mobi        x_mobn
6.25 c                   endif
6.25 c*6.36              endif
6.25  *
5.01  *
5.01  * Legg ut kundenummer i parameter
5.01  *
5.01 c                   if        l_outq = 'E_MAIL_ASP'
5.01 c                   eval      p_kund = fokund
5.61 c                   eval      p_kpro = fokpro
5.02 c                   eval      p_numm = fonumm
5.02 c                   eval      p_selg = foselg
5.01 c                   endif
3.12  *
3.12  *  Hent inn firma/avd. opplysninger dersom
3.12  *  kode for det er satt i rutineregister
3.12  *
5.41 c                   if        l_prfi = 1 or
5.41 c                             l_prfi = 2
5.41 c                   eval      w_prfi = l_prfi
3.12 c                   eval      w_ffir = wwfirm
3.12 c                   eval      w_avde = foavde
3.12  *
3.12 c                   call      'FÅ707R'
3.12 c                   parm                    w_prfi
3.12 c                   parm                    w_ffir
3.12 c                   parm                    w_avde
3.12 c                   parm                    w_fnav
3.12 c                   parm                    w_fad1
3.12 c                   parm                    w_fad2
3.12 c                   parm                    w_fste
3.12 c                   parm                    w_fftx
3.12 c                   parm                    w_tfax
3.12 c                   parm                    w_ftlf
3.12 c                   parm                    w_ffax
6.31 c                   parm                    w_mail
6.31 c                   parm                    w_weba
3.12  *
3.12 c                   eval      a1fnav = w_fnav
3.12 c                   eval      a1fad1 = w_fad1
3.12 c                   eval      a1fad2 = w_fad2
3.12 c                   eval      a1fste = w_fste
3.12 c                   eval      a1fftx = w_fftx
3.12 c                   eval      a1tfax = w_tfax
3.12 c                   eval      a1ftlf = w_ftlf
3.12 c                   eval      a1ffax = w_ffax
3.12 c                   endif
5.22  *
5.22  * Legger inn '/' mellom
5.22  * telefon og telefax
5.22  *
5.22 c                   eval      a1skra =  ' '
5.22 c                   if        a1ftlf <> *blank and
5.22 c                             a1ffax <> *blank
5.22 c                   eval      a1skra =  '/'
5.22 c                   endif
6.2A  * Hent inn avdelingsinfo - uavhengig av om dette ligger i firmatagger
6.2A c                   exsr      hnt_avde
      *
      * Skrive heading
      *
pdf  c                   if        b_pdfp = *off
     C                   Z-ADD     0             WLTELL
     C                   WRITE     A1HDR
     C                   WRITE     A2HDR
pdf  c                   else
pdf   * Vi skriver til XML taggene for heading
pdf  c                   exsr      xml_head
pdf  c                   endif
      *
      * Skriv heading over
      * varelinjer
      *
pdf  c                   if        b_pdfp = *off
     C     VAOSAM        IFEQ      1
     C                   ADD       2             WLTELL
     C                   WRITE     A4HDR                                30
     C                   ENDIF
pdf  c                   endif
      *
     C                   GOTO      XSLUTT
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Heading U/L4-brudd                                              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG01A        TAG
      *
      * Skriv heading over
      * varelinjer
      *
pdf  c                   if        b_pdfp = *off
     C     VAOSAM        IFEQ      1
     C                   ADD       2             WLTELL
     C                   WRITE     A4HDR                                30
     C                   ENDIF
pdf  c                   endif
      *
     C                   GOTO      XSLUTT
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * D1DET Behandle detail D1                                        *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG02         TAG
      *
      * Nullstilling av variabler
      *
      *
     C                   MOVE      *BLANK        D1VARE
     C                   MOVE      *BLANK        D1TEK1
     C                   MOVE      *BLANK        D1TEK2
     C                   MOVE      *BLANK        D1ENH1
     C                   MOVE      *BLANK        D1TINE
5.22 c                   move      *zero         d1lety
     C                   MOVE      *ZERO         D1ANT0
     C                   MOVE      *ZERO         D1ANT1
     C                   MOVE      *ZERO         D1ANT2
     C                   MOVE      *ZERO         D1ANT3
     C                   MOVE      *OFF          *IN44
     C                   MOVE      *OFF          *IN46
      *
     C                   MOVE      FKSONR        WWNUMM
     C                   MOVE      FKSSUF        WWSUFF
     C                   MOVE      FKSLIN        WWLINE
     C     KEY02         CHAIN     FODTL1R                            62
      *
      * Hent linje-type
      *
     C                   MOVE      FDLTYP        WWLTYP
     C     KEY08         CHAIN     VLTYL1R                            68
      *
      * Sjekker om linjen ikke skrives på ordretypen
      *
     C     FOOTYP        CABEQ     VALO01        XSLUTT
      *
     C     FOOTYP        CABEQ     VALO02        XSLUTT
      *
     C     FOOTYP        CABEQ     VALO03        XSLUTT
      *
     C     FOOTYP        CABEQ     VALO04        XSLUTT
      *
      * Sjekker om tekstlinjer
      *
     C     VALKTX        CABEQ     1             TAG02A
      *
      * Oppslag mot vareregister
      *
     C                   MOVE      FDVARE        WWVARE
     C     KEY11         CHAIN     VVARL1R                            69
      *
      * Sjekk om tilbud/netto-pris
      *
     C     FDSUMR        IFEQ      *ZERO
     C                   MOVE      *ON           *IN46
     C                   MOVE      *BLANK        D1TINE
     C                   MOVE      FDkpri        WWPKOD
     C     KEY19         CHAIN     VPKOL1R                            69
     C     *IN69         IFEQ      *OFF
     C                   MOVE      vaptxt        D1TINE
     C                   END
     C                   END
3.13  *
3.13  * Dersom vare er hentet fra LVR,
3.13  * sett inn  2 desimaler som std.
3.13  *
3.13 c                   if        fdlvre = 1
3.13 c                   eval      vvdesi = 2
3.13 c                   endif
      *
      * Test på antall desimaler
      *
     C     VVDESI        COMP      0                                      40
     C     VVDESI        COMP      1                                      41
     C     VVDESI        COMP      2                                      42
     C     VVDESI        COMP      3                                      43
     C   40              Z-ADD     FDANTA        D1ANT0
     C   41              Z-ADD     FDANTA        D1ANT1
     C   42              Z-ADD     FDANTA        D1ANT2
     C   43              Z-ADD     FDANTA        D1ANT3
      *
      * Varelinje
      *
     C                   MOVE      FDVARE        D1VARE
     C                   MOVEL     FDTEK1        D1TEK1
     C                   MOVE      FDENH1        D1ENH1
     C                   Z-ADD     FDsapr        D1BPRI
5.22 c                   z-add     fdlety        d1lety
      *
      * Beregne snittrabatt
      *
     C     100           SUB       FDRAB1        W1RAB1
     C                   MULT      FDRAB2        W1RAB1
     C                   DIV       100           W1RAB1
     C                   ADD       FDRAB1        W1RAB1
3.11  *
3.11  * Beregne varelinjerabatt
3.11  *
3.11 C     FDSUMS        DIV       100           W1BELX           13 4
3.11 C     W1BELX        MULT(H)   W1RAB1        W1SUMR
3.11  *
3.11  * Netto pris
3.11  *
3.11 C                   Z-ADD     FDANTA        W1ANTA
3.11 C     W1ANTA        IFEQ      0
3.11 C                   Z-ADD     1             W1ANTA
3.11 C                   ENDIF
3.11  *
pdf   * Avhengig av rapporttype, skal vi legge ut "riktig" nettopris
pdf  c                   if        w_ttype = '2'
pdf  c     fdsums        sub       fdsumr        w1npri
pdf  c                   else
3.11 C     FDSUMS        SUB       w1SUMR        W1NPRI
pdf  c                   endif
3.11 C     W1NPRI        DIV       W1ANTA        D1NPRI
3.11 C                   Z-ADD     W1SUMR        D1RABB
3.11 C                   Z-ADD     W1RAB1        D1RABP
      *
      * Sum Beløp
      *
     C                   Z-ADD     FDSUMS        D1BBEL
3.11 C     FDSUMS        SUB       w1SUMR        D1NBEL
      *
      * Skal mva. beregnes ?
      *
     C     AFMVAK        IFEQ      1
     C                   MOVE      *ON           *IN37
5.50 C                   ENDIF
      *
5.50  * Henter mva-kode, beregn mva
5.50  * + legger ut riktig sats på varlinje
5.50  *
6.12 c                   eval      d1mvap = 0
6.12 c                   eval      w_mvas = 0
6.12  *
5.50 c                   if        fdomva <> *blank
5.50 c                   eval      w_stat = *blank
5.50 c                   eval      w_mvak = fdomva
5.50 c                   time                    w_dato
5.50  *
5.50 c                   call      'RS205R'
5.50 c                   parm                    w_stat
5.50 c                   parm                    w_mvak
5.50 c                   parm                    w_mvtx
5.50 c                   parm                    w_dato
5.50 c                   parm                    w_mvas
5.50 c                   parm                    w_mvat
5.50 c                   parm                    w_mvaf
5.50 c                   parm                    w_bpro
5.50  *
5.50 c                   if        w_mvas > 0
5.50 c                   eval(h)   w_mvab = w_mvab + (d1nbel * w_mvas / 100)
5.50 c                   eval(h)   d1mvap = w_mvas
6.12 c                   exsr      xarray
5.50 c                   endif
5.50 c                   endif
      *
      * Akkumuler til overføringssum
      *
     C                   ADD       D1NBEL        O1TRSP
3.11  *
3.11  * Med i ordrerabattgrunnlaget ?
3.11  *
3.11 c     FORABP        IFGT      *ZEROS
3.11 c     VVKORD        ANDEQ     *ZEROS
3.11 c                   ADD       D1NBEL        W1RABG
3.11 c                   ENDIF
3.11  *
3.11  * Varsle linjer som ikke inngår
3.11  *
3.11 c                   MOVE      *BLANK        D1INFO
3.11 c     FORABP        IFGT      *ZEROS
3.11 c     VVKORD        ANDEQ     1
3.11 c                   MOVE      '*'           D1INFO
3.11 c                   ENDIF
      *
      * Skriv varelinjer
      *
     C     TAG02A        TAG
pdf   *
pdf  c                   if        b_pdfp = *off
pdf   *
     C                   ADD       1             WLTELL
     C     VALKTX        IFNE      1
     C                   WRITE     D1DET                                30
     C                   ELSE
     C                   MOVEL     FDTEK1        D1TEK1
     C                   MOVEL     FDTEK2        D1TEK2
     C                   MOVE      *ON           *IN44
     C                   WRITE     D2DET                                30
     C                   END
      *
      * Er det overflow ?
      *
     C     *IN30         CASEQ     *ON           XOVRFL
     C                   ENDCS
5.22  *
5.22  * Skriv varelinje for tekst 2
5.22  * dersom den er oppgitt
5.22  *
5.22 c                   if        fdtek2 <> *blank
5.22 c                   if        valktx <> 1
5.22 c                   add       1             wltell
5.22 c                   eval      d1tek2 = fdtek2
5.22 c                   write     d1det2                               30
5.22  *
5.22  * Er det overflow ?
5.22  *
5.22 c                   if        *in30 = *on
5.22 c                   exsr      xovrfl
5.22 c                   endif
5.22  *
5.22 c                   endif
5.22 c                   endif
pdf   * Skriver XML tagger for detaljer
pdf  c                   else
pdf  c                   exsr      xml_deta
pdf  c                   endif
6.2B  *
6.2B  * sjekker om det er lengdespesifikasjoner
6.2B  *
6.2B c                   exsr      skr_leng
      *
     C                   GOTO      XSLUTT
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Behandling av tekstlinjer                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG03         TAG
      *
     C                   MOVE      FKSONR        WWNUMM
     C                   MOVE      FKSSUF        WWSUFF
     C                   MOVE      FKSLIN        WWLINE
     C     KEY03         CHAIN     FOTXL1R                            63
      *
      * Gå ut dersom det
      * ikke er oppsamling,
      * og linje-nummer er
      * større enn 5000.
      * Da skal print fore-
      * gå tilslutt på L4.
      *
     C     VAOSAM        IFEQ      0
     C     FKSLIN        IFGE      5000
     C                   GOTO      XSLUTT
     C                   END
     C                   ENDIF
      *
     C                   MOVEL     FTTEXT        E1TEXT
pdf  c                   if        b_pdfp = *off
pdf   *
     C                   ADD       1             WLTELL
     C                   WRITE     E1DET                                30
      *
      * Er det overflow ?
      *
     C     *IN30         CASEQ     *ON           XOVRFL
     C                   ENDCS
pdf   * Skriver XML tagger for tekstlinjer
pdf  c                   else
pdf  c                   if        fkslin < 5000
pdf  c                   if        b_topt = *off
pdf  c                   exsr      xml_topt_str
pdf  c                   eval      b_topt = *on
pdf  c                   endif
pdf  c                   exsr      xml_topptxt
pdf  c                   else
pdf  c                   if        b_bott = *off
pdf  c                   exsr      xml_bott_str
pdf  c                   eval      b_bott = *on
pdf  c                   endif
pdf  c                   exsr      xml_bunntxt
pdf  c                   endif
pdf  c                   endif
      *
     C     XSLUTT        TAG
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * T1TOT Behandle total T1                                         *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Null-stille variabler
      *
     CL4                 Z-ADD     0             T1TOTB
     CL4                 Z-ADD     0             T1TMVA
      *
      * Netto beløp
      *
     CL4   FOTOTS        SUB       FOTOTR        T1TNET
3.11  *
3.11  * BEHANDLE ORDRERABATT
3.11  *
3.11 CL4   W1RABG        IFGT      *ZEROS
3.11 CL4   W1RABG        MULT      FORABP        W1RABB
3.11 CL4                 DIV       100           W1RABB
3.11 CL4                 Z-ADD     FORABP        R1RABP
3.11 CL4                 Z-ADD     W1RABG        R1RABG
3.11 CL4                 Z-ADD(H)  W1RABB        R1RABB
3.11 CL4                 MULT      -1            R1RABB
pdf  cl4                 if        b_pdfp = *off
3.11 CL4                 WRITE     R1RAB
pdf  cl4                 else
pdf  cl4                 exsr      xml_rabatt
pdf  cl4                 endif
3.11 CL4                 Z-ADD     0             W1RABB
3.11 CL4                 Z-ADD     0             W1RABG
3.11 CL4                 ENDIF
      *
      * Skal mva. beregnes ?
      *
     CL4                 MOVE      *ON           *IN37
5.50 C*4   T1TNET        MULT      WPMVAT        T1TOTB
5.50 C*4   T1TOTB        SUB       T1TNET        T1TMVA
      *
      * Finne ut om det er
      * plass til å skrive
      * avslutning uten å
      * skifte til ny side
      * først.
      *
      * Trekker ut heading
      *
     CL4   l_alin        SUB       24            WLTEST
      *
      * Trekker ut antall
      * linjer skrevet
      *
     CL4                 SUB       WLTELL        WLTEST
      *
      * Trekker ut plassbehov
      * for avslutning
      *
     CL4                 SUB       10            WLTEST
      *
      * Skrive ny heading ?
      *
pdf  cl4                 if        b_pdfp = *off
     CL4   WLTEST        IFLT      0
     CL4                 WRITE     A1HDR
     CL4                 WRITE     A2HDR
     CL4                 Z-ADD     0             WLTELL
     CL4                 ENDIF
      *
      * Skrive totalsum
      *
     CL4                 WRITE     T1TOT                                30
pdf  cl4                 else
pdf  cl4                 exsr      xml_netto
pdf  cl4                 endif
6.12  *
6.12  * Beregner mva for de forskjellige satser
6.12  *
6.12 cl4                 eval      mbe = (mgr - mor) * msa / 100
6.12 cl4                 xfoot     mbe           w_xmbe
6.12 cl4                 eval      t1totb = t1tnet + w_xmbe
6.12  *
6.12 cl4   1             do        9             m
6.12 cl4                 if        mko(m) <> ' '
6.12 cl4                 eval      t1mvas = msa(m)
6.12 cl4                 eval      t1mvag = mgr(m) - mor(m)
6.12 cl4                 eval      t1tmva = mbe(m)
pdf  cl4                 if        b_pdfp = *off
6.12 cl4                 write     t1tot2                               30
pdf  cl4                 else
pdf  cl4                 exsr      xml_vat
pdf  cl4                 endif
6.12 cl4                 endif
6.12 cl4                 enddo
6.12  *
pdf  cl4                 if        b_pdfp = *off
6.12 cl4                 write     t1tot3                               30
pdf  cl4                 else
pdf  cl4                 exsr      xml_totaler
pdf  cl4                 endif
6.12  *
      *
      * Skrive tekstlinjer
      * dersom det ikke er
      * oppsamling og linje
      * nummer er større enn
      * 5000.
      *
     CL4   VAOSAM        IFEQ      0
     CL4                 MOVE      FKSONR        WWNUMM
     CL4                 MOVE      FKSSUF        WWSUFF
     CL4                 Z-ADD     5000          WWLINE
     CL4   KEY03         SETLL     FOTXL1R
     CL4                 READ      FOTXL1R                                63
     CL4   *IN63         CABEQ     *ON           TAG99
      *                                                                 .
     CL4   WWNUMM        DOWEQ     FTNUMM
     CL4   WWSUFF        IFEQ      FTSUFF
      *                                                               . .
     CL4                 MOVEL     FTTEXT        E1TEXT
pdf  cl4                 if        b_pdfp = *off
     CL4                 ADD       1             WLTELL
     CL4                 WRITE     E1DET                                30
      *                                                               . .
      * Er det overflow ?                                             . .
      *                                                               . .
     CL4   *IN30         IFEQ      *ON
     CL4                 WRITE     A1HDR
     CL4                 WRITE     A2HDR
     CL4                 Z-ADD     0             WLTELL
     CL4                 ENDIF
pdf   *
pdf   * Skriver XML tagger for tekstlinjer
pdf  cl4                 else
pdf  cl4                 if        b_bott = *off
pdf  cl4                 exsr      xml_bott_str
pdf  cl4                 eval      b_bott = *on
pdf  cl4                 endif
pdf  cl4                 exsr      xml_bunntxt
pdf  cl4                 endif
     CL4                 ENDIF
      *                                                               . .
     CL4                 READ      FOTXL1R                                63
     CL4   *IN63         CABEQ     *ON           TAG99
     CL4                 ENDDO
     CL4                 ENDIF
      *
     CL4   TAG99         TAG
pdf   *
pdf  cl4                 if        b_pdfp = *on
pdf   * Skriv xml fila på disk
pdf  cl4                 exsr      xml_end
pdf   * Hvis forhåndvisning må vi kjøre linken
pdf  cl4                 if        l_skje = 1 and
pdf   * Kun preview hvis en ordre er valgt
pdf  c                             l_bach = w_jkey
pdf  cl4                 exsr      pdf_preview
pdf  cl4                 endif
pdf   * Avslutt jobbiden
pdf  cl4                 call      'AB710R'
pdf  cl4                 parm                    l_bach
pdf   *
pdf   * Hvis utskrift av nytt tilbud må vi finne ny id til xml og java
pdf  cl4                 if        *inlr = *off
pdf   *
pdf  cl4                 eval      w_kode = '0'
pdf  cl4                 eval      w_firm = l_firm
pdf  cl4                 eval      w_fell = 'NXTKLI'
pdf  cl4                 eval      w_type = *blank
pdf  cl4                 eval      w_fast = *blank
pdf  cl4                 eval      w_numm = *zero
pdf   *
pdf  cl4                 call      'AS100R'
pdf  cl4                 parm                    w_kode
pdf  cl4                 parm                    w_firm
pdf  cl4                 parm                    w_fell
pdf  cl4                 parm                    w_type
pdf  cl4                 parm                    w_fast
pdf  cl4                 parm                    w_numm
pdf   *
pdf  cl4                 eval      w_jnav = 'PDF' + %char(w_numm)
pdf  cl4                 eval      w_jtxt = 'Utskrift av tilbud via Jasper'
pdf  cl4                 call      'AB700R'
pdf  cl4                 parm                    w_jnav
pdf  cl4                 parm                    w_jkey
pdf  cl4                 parm                    w_jtxt
pdf   * Vi logger at utskriftprogrammet har startet
pdf  cl4                 eval      w_jstat = 10
pdf  cl4                 eval      w_jtext = 'Utskrift av tilbud har startet'
pdf  cl4                 call      'AB705R'
pdf  cl4                 parm                    l_bach
pdf  cl4                 parm                    w_jstat
pdf  cl4                 parm                    w_jtext
pdf   * Vi skriver xml for miljø formater
pdf  cl4                 exsr      xml_envm
pdf  cl4                 endif
pdf  cl4                 endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Sjekk/Hent tekst for betalingsbetingelser         RS203R       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     C     SBBETB        BEGSR
      *
     c                   eval      wpcbda = *loval
     c                   eval      wpcfda = *loval
      *
     c                   call      'FÅ703R'
     c                   parm                    wwfirm
     c                   parm                    fobetb
     c                   parm                    wpcbda
     c                   parm                    wpretk
     c                   parm                    wpcfda
     c                   parm                    wpctx1
     c                   parm                    wpctx2
      *
     C                   MOVE      *BLANK        A1BTX1
     C                   MOVE      *BLANK        A1BTX2
      *
     C     WPRETK        IFEQ      *BLANK
     C                   MOVEL     WPCTX1        A1BTX1
     C                   MOVEL     WPCTX2        A1BTX2
     C                   ENDIF
      *
     C                   ENDSR
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for overflow                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     XOVRFL        BEGSR
      *
pdf  c                   if        b_pdfp = *off
pdf   *
     C                   MOVE      *ON           *IN45
     C                   WRITE     O1DET
     C                   WRITE     A1HDR
     C                   WRITE     A2HDR
     C                   MOVE      *OFF          *IN45
     C                   WRITE     O1DET
     C                   Z-ADD     0             WLTELL
      *
pdf  c                   endif
      *
     C                   ENDSR
6.12  *
6.12  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.12  * Subrutine for array-håndtering av mva
6.12  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.12  *
6.12 c     xarray        begsr
6.12  *
6.12 c     1             do        9             m
6.12 c                   if        mko(m) = w_mvak or
6.12 c                             mko(m) = ' '
6.12 c                   eval      mko(m) = w_mvak
6.12 c                   eval      msa(m) = w_mvas
6.12 c                   eval      mgr(m) = mgr(m) + d1nbel
6.12  *
6.12 c                   if        forabp > 0
6.12 c                   if        vvkord = 0
6.12 c                   eval      mog(m) = mog(m) + d1nbel
6.12 c                   eval      mor(m) = mog(m) * forabp / 100
6.12 c                   endif
6.12 c                   endif
6.12  *
6.12 c                   leave
6.12 c                   endif
6.12 c                   enddo
6.12  *
6.12 c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for oppstart                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     XSTRSR        BEGSR
      *
     C                   Z-ADD     1             FCYCLE            1 0
      *
      * Legger inn firma i nøkkel
      *
     C                   MOVE      FKSFIR        WWFIRM
      *
      * Hente Kunde-tilbuds-nummer
      *
     C     KEY09         CHAIN     FSTSL1R                            69
      *
     C     *IN69         IFEQ      *OFF
     C                   MOVE      FAAKUN        W0KUND
     C                   END
      *
      * Slår opp ordretype
      *
     C                   MOVE      FKSOTY        WWOTYP
     C     KEY07         CHAIN     VOTYL1R                            67
      *
      * Er ordretype negativ ?
      *
     C     VAOKRE        IFEQ      '-'
     C                   MOVE      *ON           *IN36
     C                   ENDIF
6.12  *
6.12  * Nullstilling av array's
6.12  *
6.12 c                   eval      mko = *blank
6.12 c                   eval      msa = *zero
6.12 c                   eval      mgr = *zero
6.12 c                   eval      mbe = *zero
6.12 c                   eval      mog = *zero
6.12 c                   eval      mor = *zero
6.18  *
6.18  * Slår opp etter firmainformasjon
6.18  *
6.18 c                   if        afprfi = 1 or
6.18 c                             afprfi = 2
6.18 c     afirl1_key    chain     afirl1r
6.18 c                   endif
6.18  *
     C                   ENDSR
      *
      *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Miljø variabler         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_envm      begsr
pdf   *
pdf   * Hvis skjermvisning skal vi ikke lagre i spoolfile
pdf  c                   if        l_skje = 1
pdf  c                   eval      w_spol = 'true'
pdf  c                   else
pdf  c                   eval      w_spol = 'false'
pdf  c                   endif
pdf   *
pdf   /Free
pdf        // Finne nytt batch nummer
pdf            UpdHTMLVar('BatchNo':             w_jkey);
pdf            UpdHTMLVar('Batchtype':         'TILBUD');
pdf            UpdHTMLVar('Username':            l_user);
pdf            WrtSection('Topp');
pdf        // Finn credential variabler
pdf            UpdHTMLVar('IPAdr':                  ' ');
pdf            UpdHTMLVar('User':                l_user);
pdf            UpdHTMLVar('PW':                     ' ');
pdf            UpdHTMLVar('Schema':        'ADB'+l_filg);
pdf            UpdHTMLVar('Companyno':    %char(l_firm));
6.33           UpdHTMLVar('Departmentnoarkiv': %char(l_avde));
pdf            WrtSection('Credential');
pdf        // Finn report command variabler
pdf            UpdHTMLVar('Jaspertemplate':      d_jasm);
pdf            UpdHTMLVar('Logo':           jasper_logo);
pdf            UpdHTMLVar('Keepspool':           w_spol);
pdf            WrtSection('ReportCommand');
pdf   /End-free
pdf   *
pdf   * Hvis skjermvisning eller e-mail skal ikke PDF skrives
pdf   *
pdf  c                   if        l_skje = 0 and
pdf  c                             l_mail = 0
6.22  * Hvis *ARKIV er valgt som skriver, skal det ikke skrives ut
6.22 c                   if        l_utqm <> '*ARKIV'
pdf   *
pdf  c                   if        l_land = 1
pdf  c                   eval      w_land = 'LANDSCAPE'
pdf  c                   else
pdf  c                   eval      w_land = 'PORTRAIT'
pdf  c                   endif
6.15  * Sjekk at valgt outq støttes av skriveren. Kan skli gjennom hvis
6.15  * jobben legges på jobbkø.
6.15 c                   eval      p_ok = '0'
6.15 c                   call      'AP612R'
6.15 c                   parm                    l_filg
6.15 c                   parm                    l_outq
6.15 c                   parm                    p_ok
6.15  * Hvis feil utkø, logges dette i transaksjonsloggen
6.15 c                   if        p_ok = '0'
6.15 c                   eval      w_jstat = 20
6.15 c                   eval      w_jtext = 'Ugyldig utkø '+ l_outq + ' er val+
6.15 c                             gt. Ingen utskrift er generert. Utskrift kan+
6.15 c                              arkiveres.'
6.15 c                   call      'AB705R'
6.15 c                   parm                    l_bach
6.15 c                   parm                    w_jstat
6.15 c                   parm                    w_jtext
6.15 c                   else
pdf   * Hent inn skuffinformasjon for skriveren
6.2D c                   eval      w_dtray = *blank
6.2D c                   eval      w_gtray = *blank
pdf  c                   call      'AP611R'
pdf  c                   parm                    l_filg
pdf  c                   parm                    l_outq
6.2D c                   parm                    w_dtray
pdf  c                   parm                    w_gtray
6.2D  * Hent inn skuffinformasjon for skriveren - default inskuff
6.2D c                   eval      w_draw1 = *blank
6.2D c                   movel     w_dtray       w_skuf
6.2D c                   call      'AP614R'
6.2D c                   parm                    l_outq
6.2D c                   parm                    w_skuf
6.2D c                   parm                    w_draw1
6.18  *
6.18 c                   if        l_copy > 0
6.18 c                   eval      w_copy = l_copy
6.18 c                   else
6.18 c                   eval      w_copy = 1
6.18 c                   endif
pdf   *
pdf   /Free
pdf        // Finn print informasjon
pdf            UpdHTMLVar('Printername':         l_outq);
618            UpdHTMLVar('Copies':        %char(w_copy));
pdf            UpdHTMLVar('Papersource':        w_draw1);
pdf            UpdHTMLVar('Lastpagedrawer':         ' ');
pdf            UpdHTMLVar('Duplex':             'false');
pdf            UpdHTMLVar('Quality':                ' ');
pdf            UpdHTMLVar('Sorting':                ' ');
pdf            UpdHTMLVar('Staple':              'true');
pdf            UPDHTMLVar('Alignment':           w_land);
pdf            WrtSection('PrintCommand');
pdf   /End-free
6.15 c                   endif
6.22 c                   endif
pdf  c                   endif
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Heading                 *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_head      begsr
pdf   *
pdf  c                   eval      w_str_in = *blanks
pdf  c                   eval      w_str_out = *blanks
pdf  c                   eval      w_mtxt = *blanks
pdf  c                   eval      x_numm = %char(a1numm)+a1suff
6.25    //               eval      x_vref = %char(a1selg)+' '+a1vref
6.25 c                   eval      w_selgn = %trim(%char(a1selg) + x_mobi)
pdf  c                   eval      x_betb = a1btx1 + ' ' + a1btx2
pdf   *
pdf   * Hvis mail skal skrives, må vi hente mail informasjon
pdf   *
pdf  c                   if        l_mail = 1
pdf  c                   eval      p_kule = 'K'
6.37 c                   if        folkun <> 0
6.37 c                   eval      p_kund = folkun
6.37 c                   else
pdf  c                   eval      p_kund = fokund
6.37 c                   endif
pdf  c                   eval      p_kpro = fokpro
pdf  c                   eval      p_numm = fonumm
6.38 c                   eval      p_suff = fosuff
pdf  c                   eval      p_selg = foselg
pdf  c                   eval      p_in03 = *off
pdf   * Henter tilbake mailserver
pdf  c                   eval      p_serv = *blank
pdf  c                   eval      p_stat = *blank
pdf  c                   call      'AM705C'
pdf  c                   parm                    p_serv
pdf  c                   parm                    p_stat
pdf   *
7.02 c                   if        u_s702 = *off
pdf   *
pdf  c                   call      'FO798R'
pdf  c                   parm                    p_kule
pdf  c                   parm                    p_kund
pdf  c                   parm                    p_kpro
pdf  c                   parm                    p_numm
6.30 c                   parm                    p_suff
pdf  c                   parm                    p_selg
pdf  c                   parm                    p_navn
pdf  c                   parm                    p_emal
6.30 c                   parm                    p_ema2
6.30 c                   parm                    p_ema3
pdf  c                   parm                    p_emne
pdf  c                   parm                    p_txt1
pdf  c                   parm                    p_txt2
pdf  c                   parm                    p_txt3
pdf  c                   parm                    p_txt4
pdf  c                   parm                    p_pers
6.30 c                   parm                    p_kopi
pdf  c                   parm                    p_inif
pdf  c                   parm                    p_in03
      *
7.02 c                   else
7.02 c                   call      'FM798R'
7.02 c                   parm                    p_kule
7.02 c                   parm                    p_kund
7.02 c                   parm                    p_kpro
7.02 c                   parm                    p_numm
7.02 c                   parm                    p_suff
7.02 c                   parm                    p_selg
7.02 c                   parm                    p_navn
7.02 c                   parm                    p_emal
7.02 c                   parm                    p_ema2
7.02 c                   parm                    p_ema3
7.02 c                   parm                    p_e702
7.02 c                   parm                    p_txt1
7.02 c                   parm                    p_txt2
7.02 c                   parm                    p_txt3
7.02 c                   parm                    p_txt4
7.02 c                   parm                    p_pers
7.00 c                   parm                    p_kopi
7.02 c                   parm                    p_inif
7.02 c                   parm                    p_in03
7.02  *
7.02 c                   endif
      *
6.2H  * Scann av strenger
6.2H  *
6.2H c                   eval      p_str_in = *blank
6.2H c                   eval      p_lr = '0'
6.2H c                   movel     p_emne        p_str_in
6.2H c                   call      'AP613R'
6.2H c                   parm                    p_str_in
6.2H c                   parm                    p_str_out
6.2H c                   parm                    p_lr
6.2H c                   movel     p_str_out     w_pemne
7.02  *
7.02  * Scann av strenger
7.02  *
7.02 c                   movel     p_str_out     w_pe702
7.02 c                   if        u_s702 = *on
7.02 c                   eval      p_str_in = *blank
7.02 c                   eval      p_lr = '0'
7.02 c                   movel     p_e702        p_str_in
7.02 c                   call      'AP613R'
7.02 c                   parm                    p_str_in
7.02 c                   parm                    p_str_out
7.02 c                   parm                    p_lr
7.02 c                   movel     p_str_out     w_pe702
7.02 c                   endif
6.19  * Scann av strenger
6.19  *
6.19 c                   eval      p_str_in = *blank
6.19 c                   eval      p_lr = '0'
6.19 c                   movel     p_txt1        p_str_in
6.19 c                   call      'AP613R'
6.19 c                   parm                    p_str_in
6.19 c                   parm                    p_str_out
6.19 c                   parm                    p_lr
6.19 c                   movel     p_str_out     w_ptxt1
6.19  *
6.19 c                   eval      p_str_in = *blank
6.19 c                   eval      p_lr = '0'
6.19 c                   movel     p_txt2        p_str_in
6.19 c                   call      'AP613R'
6.19 c                   parm                    p_str_in
6.19 c                   parm                    p_str_out
6.19 c                   parm                    p_lr
6.19 c                   movel     p_str_out     w_ptxt2
6.19  *
6.19 c                   eval      p_str_in = *blank
6.19 c                   eval      p_lr = '0'
6.19 c                   movel     p_txt3        p_str_in
6.19 c                   call      'AP613R'
6.19 c                   parm                    p_str_in
6.19 c                   parm                    p_str_out
6.19 c                   parm                    p_lr
6.19 c                   movel     p_str_out     w_ptxt3
6.19  *
6.19 c                   eval      p_str_in = *blank
6.19 c                   eval      p_lr = '0'
6.19 c                   movel     p_txt4        p_str_in
6.19 c                   call      'AP613R'
6.19 c                   parm                    p_str_in
6.19 c                   parm                    p_str_out
6.19 c                   parm                    p_lr
6.19 c                   movel     p_str_out     w_ptxt4
6.19  *
6.19 c                   eval      p_str_in = *blank
6.19 c                   eval      p_lr = '0'
6.19 c                   movel     p_pers        p_str_in
6.19 c                   call      'AP613R'
6.19 c                   parm                    p_str_in
6.19 c                   parm                    p_str_out
6.19 c                   parm                    p_lr
6.19 c                   movel     p_str_out     w_ppers
6.19  *
6.19 c                   eval      w_mtxt = %trim(w_ptxt1) + crlf +
6.19 c                                      %trim(w_ptxt2) + crlf +
6.19 c                                      %trim(w_ptxt3) + crlf +
6.19 c                                      %trim(w_ptxt4) + crlf +
6.19 c                                      %trim(w_ppers)
6.19 c**
6.19 c**                 eval      w_mtxt = %trim(p_txt1) + crlf +
6.19 c**                                    %trim(p_txt2) + crlf +
6.19 c**                                    %trim(p_txt3) + crlf +
6.19 c**                                    %trim(p_txt4) + crlf +
6.19 c**                                    %trim(p_pers)
pdf   *
6.30 c                   if        p_kopi = *blanks
6.30 c                   eval      p_kopi = d_emal
pdf  c                   endif
pdf   *
pdf  c                   if        p_in03 = *off
pdf   *
pdf   /Free
pdf        // Skriv mailinformasjon
6.26           WrtSection('MailCommandStart');
6.26       //  UpdHTMLVar('Receivers':           p_emal);
6.30           if %Trim(p_emal)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_emal);
6.26           WrtSection('MailReceiver');
6.26           endif;
6.30           if %Trim(p_ema2)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_ema2);
6.26           WrtSection('MailReceiver');
6.26           endif;
6.30           if %Trim(p_ema3)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_ema3);
6.26           WrtSection('MailReceiver');
6.26           endif;
6.26
pdf            UpdHTMLVar('CC':                     ' ');
6.30           UpdHTMLVar('BCC':                 p_kopi);
6.30           UpdHTMLVar('Sender':              p_kopi);
6.2H      //   UpdHTMLVar('Subject':             p_emne);
6.2H      //   UpdHTMLVar('Subject':            w_pemne);
7.02           UpdHTMLVar('Subject':            w_pe702);
pdf            UpdHTMLVar('Message':             w_mtxt);
pdf            UpdHTMLVar('Message1':            p_pers);
pdf            UpdHTMLVar('SMTPServer':          p_serv);
pdf            UPDHTMLVar('SMTPUser':               ' ');
pdf            UPDHTMLVar('SMTPPw':                 ' ');
6.26      //   WrtSection('MailCommand');
6.26           WrtSection('MailCommandEnd');
pdf   /End-free
pdf  c                   endif
pdf  c                   endif
pdf   *
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Firma
6.14 c                   eval      w_1fnav = *blank
6.14 c                   eval      w_1fad1 = *blank
6.14 c                   eval      w_1fad2 = *blank
6.14 c                   eval      w_1navn = *blank
6.14 c                   eval      w_1gate = *blank
6.14 c                   eval      w_1adr2 = *blank
6.14 c                   eval      w_2navn = *blank
6.14 c                   eval      w_2adr1 = *blank
6.14 c                   eval      w_2adr2 = *blank
6.2A  * Avdelingsinfo
6.2A  *
6.17 c                   eval      p_str_in = *blank
6.17 c                   movel     a1fnav        p_str_in
6.17 c                   eval      p_lr = '0'
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_1fnav
      *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a1fad1        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_1fad1
      *
6.17 c                   eval      p_lr = '0'
6.17 c                   eval      p_str_in = *blank
6.17 c                   movel     a1fad2        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_1fad2
      *
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Partner
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a1navn        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_1navn
      *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a1gate        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_1gate
      *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a1adr2        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_1adr2
      * Derer referanse
6.21 c                   eval      p_str_in = *blank
6.21 c                   eval      p_lr = '0'
6.21 c                   movel     a1dref        p_str_in
6.21 c                   call      'AP613R'
6.21 c                   parm                    p_str_in
6.21 c                   parm                    p_str_out
6.21 c                   parm                    p_lr
6.21 c                   movel     p_str_out     w_1dref
      * Vår referanse
6.21 c                   eval      p_str_in = *blank
6.21 c                   eval      p_lr = '0'
6.21 c                   movel     a1vref        p_str_in
6.21 c                   call      'AP613R'
6.21 c                   parm                    p_str_in
6.21 c                   parm                    p_str_out
6.21 c                   parm                    p_lr
6.21 c                   movel     p_str_out     w_1vref
      *
6.25 c                   eval      p_str_in = *blank
6.25 c                   eval      p_lr = '0'
6.25 c                   movel     a1vref        P_str_in
6.25 c                   call      'AP613R'
6.25 c                   parm                    p_str_in
6.25 c                   parm                    p_str_out
6.25 c                   parm                    p_lr
6.25 c                   movel     p_str_out     w_1vref
      * Avdelingsinformasjon - navn
6.2A c                   eval      p_str_in = *blank
6.2A c                   eval      p_lr = '0'
6.2A c                   movel     w_dnavn       P_str_in
6.2A c                   call      'AP613R'
6.2A c                   parm                    p_str_in
6.2A c                   parm                    p_str_out
6.2A c                   parm                    p_lr
6.2A c                   movel     p_str_out     w_dnavn
      * Avdelingsinformasjon - adresse
6.2A c                   eval      p_str_in = *blank
6.2A c                   eval      p_lr = '0'
6.2A c                   movel     w_dadr1       P_str_in
6.2A c                   call      'AP613R'
6.2A c                   parm                    p_str_in
6.2A c                   parm                    p_str_out
6.2A c                   parm                    p_lr
6.2A c                   movel     p_str_out     w_dadr1
      * Avdelingsinformasjon - adresse 2
6.2A c                   eval      p_str_in = *blank
6.2A c                   eval      p_lr = '0'
6.2A c                   movel     w_dadr2       P_str_in
6.2A c                   call      'AP613R'
6.2A c                   parm                    p_str_in
6.2A c                   parm                    p_str_out
6.2A c                   parm                    p_lr
6.2A c                   movel     p_str_out     w_dadr2
      * Avdelingsinformasjon - poststed
6.2A c                   eval      p_str_in = *blank
6.2A c                   eval      p_lr = '0'
6.2A c                   movel     w_dpstd       P_str_in
6.2A c                   call      'AP613R'
6.2A c                   parm                    p_str_in
6.2A c                   parm                    p_str_out
6.2A c                   parm                    p_lr
6.2A c                   movel     p_str_out     w_dpstd
      * Rekvisisjonsnummer
6.2G c                   eval      p_str_in = *blank
6.2G c                   eval      p_lr = '0'
6.2G c                   movel     forekv        P_str_in
6.2G c                   call      'AP613R'
6.2G c                   parm                    p_str_in
6.2G c                   parm                    p_str_out
6.2G c                   parm                    p_lr
6.2G c                   movel     p_str_out     w_rekv
      * Sjekk hvilken rapporttype som skal skrives
      *
     c                   eval      w_ttype = '0'
     c                   if        l_ruti = 'FTILB    '
     c                   eval      w_ttype = '0'
     c                   elseif    l_ruti = 'FTILB1   '
     c                   eval      w_ttype = '1'
     c                   elseif    l_ruti = 'FTILB2   '
     c                   eval      w_ttype = '2'
     c                   elseif    l_ruti = 'FTILB3   '
     c                   eval      w_ttype = '3'
     c                   elseif    l_ruti = 'FTILB4   '
     c                   eval      w_ttype = '4'
     c                   elseif    l_ruti = 'FTILB6   '
     c                   eval      w_ttype = '1'
     c                   elseif    l_ruti = 'FTILB7   '
     c                   eval      w_ttype = '2'
     c                   elseif    l_ruti = 'FTILB8   '
     c                   eval      w_ttype = '3'
     c                   endif
pdf   *
pdf   /Free
pdf
pdf        // Skriv firmavariabler
pdf
6.24           UpdHTMLVar('Reporttext':            a1txt1);
6.14           UpdHTMLVar('CompanyName':          w_1fnav);
6.14           UpdHTMLVar('Companyadress1':       w_1fad1);
6.14           UpdHTMLVar('Companyadress2':       w_1fad2);
pdf            UpdHTMLVar('Companypostalcode':        ' ');
pdf            UpdHTMLVar('Companypostoffice':     a1fste);
pdf            UpdHTMLVar('Companyphone':          a1ftlf);
618            UpdHTMLVar('Companyfax':            a1ffax);
6.29           UpdHTMLVar('Companyorgno':          a1fftx);
618            UpdHTMLVar('Companygiro':    %char(aafbgi));
6.31           UpdHTMLVar('Companyemail':   %trim(w_mail));
6.31           UpdHTMLVar('Companywebpage': %trim(w_weba));
6.2A           WrtSection('Company');
6.2A
6.2A           UpdHTMLVar('Departmentno':    %char(foavde));
6.2A           UpdHTMLVar('Departmentname':        w_dnavn);
6.2A           UpdHTMLVar('Departmentadress1':     w_dadr1);
6.2A           UpdHTMLVar('Departmentadress2':     w_dadr2);
6.2A           UpdHTMLVar('Departmentpostalcode':      ' ');
6.2A           UpdHTMLVar('Departmentpostoffice':  w_dpstd);
6.2A           UpdHTMLVar('Departmentphone':       w_dphon);
6.2A           UpdHTMLVar('Departmentfax':         w_dfaxn);
6.2A           WrtSection('Department');
pdf
pdf            test(de) *dmy a1bdat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(a1bdat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Creationdate':   %char(tmpdate : *iso));
pdf            test(te) *hms a1time;
pdf            if %error;
pdf            tmptime = *loval;
pdf            else;
pdf            tmptime = %time(a1time : *hms);
pdf            endif;
pdf            UpdHTMLVar('Creationtime': %char(tmptime : *hms));
6.2A           WrtSection('Creation');
pdf
pdf        // Skriv partnerinfo (kunde)
pdf            UpdHTMLVar('Partnerno':      %char(a1kund));
pdf            UpdHTMLVar('Partnercategory':%char(a1katg));
6.14           UpdHTMLVar('Partnername':          w_1navn);
6.14           UpdHTMLVar('Partneradress1':       w_1gate);
6.14           UpdHTMLVar('Partneradress2':       w_1adr2);
pdf            UpdHTMLVar('Partnerpostalcode':        ' ');
pdf            UpdHTMLVar('Partnerpostoffice':     a1sted);
pdf            UpdHTMLVar('Partnerphone':          a1tlfn);
pdf            UpdHTMLVar('Partnercellphone':      a1mobn);
6.23           UpdHTMLVar('Partnerfax':            w_faks);
pdf            UpdHTMLVar('Salesdocumentno':       x_numm);
6.21           UpdHTMLVar('Partnerrefname':       w_1dref);
pdf            UpdHTMLVar('Partnerrefphone':       fomobi);
pdf            UpdHTMLVar('Partnerrefmail':           ' ');
6.2G     //    UpdHTMLVar('Requisitionno':         forekv);
6.2G           UpdHTMLVar('Requisitionno':         w_rekv);
pdf            WrtSection('Partner');
pdf
pdf        // Selger informasjon
6.25           UpdHTMLVar('Salesrefno':           w_selgn);
6.21           UpdHTMLVar('Salesrefname':         w_1vref);
6.2A           UpdHTMLVar('Salesrefemail':         raiema);
6.2A           UpdHTMLVar('Salesrefcellphone':     raimob);
pdf            WrtSection('SalesRef');
pdf   /End-free
6.35  *
6.35  *  Flyttet ut fra betingelsen om a2navn må være utfyllt
6.35  *
6.27 c                   eval      p_str_in = *blank
6.27 c                   eval      p_lr = '0'
6.27 c                   movel     a1lmtx        p_str_in
6.27 c                   call      'AP613R'
6.27 c                   parm                    p_str_in
6.27 c                   parm                    p_str_out
6.27 c                   parm                    p_lr
6.27 c                   movel     p_str_out     w_lmtx
      *
6.2A c                   eval      p_str_in = *blank
6.2A c                   eval      p_lr = '0'
6.2A c                   movel     folbtx        p_str_in
6.2A c                   call      'AP613R'
6.2A c                   parm                    p_str_in
6.2A c                   parm                    p_str_out
6.2A c                   parm                    p_lr
6.2A c                   movel     p_str_out     w_lbtx
6.35  *
6.35  *  Sekvensen over er flyttet
6.35  *
pdf  c                   if        %trim(a2navn) <> *blank
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Prosjekt
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a2navn        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_2navn
      *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a2adr1        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_2adr1
      *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a2adr2        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_2adr2
8.02  *
8.02  * Hent totaler for vekt og volum
8.02  *
8.02 c                   eval      w_tvekt = 0
8.02 c                   eval      w_tvolu = 0
8.02  *
8.02 c                   call      'FO780R'
8.02 c                   parm                    w_firm
8.02 c                   parm                    fonumm
8.02 c                   parm                    fosuff
8.02 c                   parm                    w_tvekt
8.02 c                   parm                    w_tvolu
8.02 c                   parm                    b_avvi
8.04 c                   endif
pdf   *
8.04 c                   eval      w_epro = *blanks
8.04 c                   if        fokpro <> 0
8.04 c                   eval      fkprl1_kund = fokund
8.04 c                   eval      fkprl1_kpro = fokpro
8.04 c     fkprl1_key    chain     fkprl1
8.04 c                   if        %found and
8.04 c                             flepro <> *blanks
8.04  * Scann etter ugyldige tegn
8.04 c                   eval      p_str_in = *blank
8.04 c                   eval      p_lr = '0'
8.04 c                   movel     flepro        p_str_in
8.04 c                   call      'AP613R'
8.04 c                   parm                    p_str_in
8.04 c                   parm                    p_str_out
8.04 c                   parm                    p_lr
8.04 c                   movel     p_str_out     w_epro
8.04 c                   endif
8.04 c                   endif
pdf   *
pdf   /Free
pdf        // Prosjekt informasjon
8.04       // Free def
8.04           UpdHTMLVar('Externalprojectno': %char(w_epro));
8.04       //  Stanndard
8.04       //  UpdHTMLVar('Projectno':                '0');
8.04           UpdHTMLVar('Projectno':      %char(fokpro));
6.14       //  UpdHTMLVar('Projectname':           a2navn);
6.14           UpdHTMLVar('Projectname':          w_2navn);
6.14       //  UpdHTMLVar('Projectadress1':        a2adr1);
6.14           UpdHTMLVar('Projectadress1':       w_2adr1);
6.14       //  UpdHTMLVar('Projectadress2':        a2adr2);
6.14           UpdHTMLVar('Projectadress2':       w_2adr2);
pdf            UpdHTMLVar('Projectpostalcode':        ' ');
pdf            UpdHTMLVar('Projectpostoffice':     a2sted);
pdf            WrtSection('Project');
pdf   /End-free
8.04 c**                 endif
pdf   /Free
6.2A           UpdHTMLVar('Currency':              fovalk);
6.2A           UpdHTMLVar('Discountcat':    %char(forkat));
6.2A           UpdHTMLVar('Agent':          %char(fosped));
6.2A           WrtSection('InfoHead1');
8.02
8.02           UpdHTMLVar('Weight':         %char(w_tvekt));
8.02           UpdHTMLVar('Volume':         %char(w_tvolu));
8.03           UpdHTMLVar('Height':                    '0');
8.03           UpdHTMLVar('Lenght':                    '0');
8.03           UpdHTMLVar('Packagecount':              '0');
8.02           WrtSection('Meassurements');
8.02
6.27           UpdHTMLVar('Deliverymethod':               w_lmtx);
6.2A           test(de) *dmy w_ldat;
6.2A           if %error;
6.2A           tmpdate = *loval;
6.2A           else;
6.2A           tmpdate = %date(w_ldat : *dmy);
6.2A           endif;
6.2A           UpdHTMLVar('Deliverydate':   %char(tmpdate : *iso));
6.2A           UpdHTMLVar('Deliverytype':           %char(folety));
6.2A           UpdHTMLVar('Deliveryterms':                 w_lbtx);
6.2A           UpdHTMLVar('Drivingroute':           %char(fokjor));
6.2A           WrtSection('DeliveryInfo');
pdf
6.2A           UpdHTMLVar('District':       %char(fodist));
6.2A           UpdHTMLVar('Warehouse':      %char(folage));
6.2A           UpdHTMLVar('Documenttype':          footyp);
pdf            test(de) *dmy a1tdat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(a1tdat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Noticedate':     %char(tmpdate : *iso));
pdf            UpdHTMLVar('Paymentcondition':             a1btx1);
pdf            UpdHTMLVar('Tendertype':           w_ttype);
6.2A           WrtSection('InfoHead2');
pdf   /End-free
pdf
pdf   /Free
pdf
pdf        //  Legg ut 'heading' på linje
pdf            WrtSection('TenderLines');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Detaljer                *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_deta      begsr
pdf   * Sørg for at vi har skrevet siste tag for topptext før vi begynner
pdf   * med detaljer.
pdf  c                   if        b_topt = *on
pdf  c                   exsr      xml_topt_end
pdf  c                   eval      b_topt = *off
pdf  c                   endif
pdf   *
pdf  c                   if        valktx <> 1
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Varetekster
6.2I c                   eval      w_lvar = *blank
6.14 c                   eval      w_tek1 = *blank
6.14 c                   eval      w_tek2 = *blank
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     d1tek1        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_tek1
      *
pdf  c                   if        fdtek2 <> *blank
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     fdtek2        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_tek2
pdf  c                   endif
      * Lev.varenummer
6.2I c                   eval      p_str_in = *blank
6.2I c                   eval      p_lr = '0'
6.2I c                   movel     fdlvar        P_str_in
6.2I c                   call      'AP613R'
6.2I c                   parm                    p_str_in
6.2I c                   parm                    p_str_out
6.2I c                   parm                    p_lr
6.2I c                   movel     p_str_out     w_lvar
      *
6.34 c                   eval      w_kamp = *blank
6.34 c                   if        fdkamp <> *blank
6.34 c                   eval      p_str_in = *blank
6.34 c                   eval      p_lr = '0'
6.34 c                   movel     fdkamp        p_str_in
6.34 c                   call      'AP613R'
6.34 c                   parm                    p_str_in
6.34 c                   parm                    p_str_out
6.34 c                   parm                    p_lr
6.34 c                   movel     p_str_out     w_kamp
6.34 c                   endif
pdf   *
pdf  c                   eval      w_mark = 'false'
pdf  c                   if        d1info = '*'
pdf  c                   eval      w_mark = 'true '
pdf  c                   endif
pdf   * Håndtere riktig antall desimaler
pdf  c                   if        *in40 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant0))
pdf  c                   callp     updHTMLVar('NoDecimals':        '0')
pdf  c                   elseif    *in41 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant1))
pdf  c                   callp     updHTMLVar('NoDecimals':        '1')
pdf  c                   elseif    *in42 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant2))
pdf  c                   callp     updHTMLVar('NoDecimals':        '2')
pdf  c                   elseif    *in43 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant3))
pdf  c                   callp     updHTMLVar('NoDecimals':        '3')
pdf  c                   endif
6.2A  *
6.2A c                   if        fdldat <> *loval
6.2A c     *dmy          move      fdldat        w_lddt
6.2A c                   endif
7.03  * Finn varetypen
7.03 c                   eval      w_vltx = *blanks
7.03 c                   eval      vlagl1_vare = fdvare
7.03 c                   eval      vlagl1_lage = fdlage
7.03 c     vlagl1_key    chain     vlagl1
7.03 c                   if        %found
7.03 c                   if        vlvtyp = 'S'
7.03 c                   eval      w_vltx = '*** BESTILLINGSVARE ***'
7.03 c                   endif
7.03 c                   endif
7.03  * Også hvis varen er hentet fra VA
7.03 c                   if        fdlvre = 1
7.03 c                   eval      w_vltx = '*** BESTILLINGSVARE ***'
7.03 c                   endif
8.02  *
8.02  * Hent vekt og volum for linja
8.02  *
8.02 c                   eval      w_vekt = 0
8.02 c                   eval      w_volu = 0
8.02  *
8.02 c                   call      'FO781R'
8.02 c                   parm                    w_firm
8.02 c                   parm                    fonumm
8.02 c                   parm                    fosuff
8.02 c                   parm                    fdline
8.02 c                   parm                    w_vekt
8.02 c                   parm                    w_volu
8.02 c                   parm                    b_avvi
pdf   *
pdf   /Free
8.02       // Freedef tag
8.02           UpdHTMLVar('Lineweight':  %char(w_vekt));
8.02           UpdHTMLVar('Linevolume':  %char(w_volu));
pdf
pdf        // Skriv detaljer
7.03           UpdHTMLVar('Varetype':    %trim(w_vltx));
pdf            UpdHTMLVar('Itemno':             d1vare);
6.14           UpdHTMLVar('Text1':              w_tek1);
6.14           UpdHTMLVar('Text2':              w_tek2);
pdf            UpdHTMLVar('Unit':                d1enh1);
pdf            UpdHTMLVar('Vat':          %char(d1mvap));
pdf            UpdHTMLVar('Netprice':      %char(d1npri));
pdf            UpdHTMLVar('Grossprice':    %char(d1bpri));
pdf            UpdHTMLVar('Discount':      %char(d1rabp));
618            UpdHTMLVar('Discountremark':      d1tine);
pdf            UpdHTMLVar('Discountamount':%char(d1rabb));
pdf            UpdHTMLVar('Discounttext':         d1tine);
pdf            UpdHTMLVar('Grossamount':   %char(d1bbel));
pdf            UpdHTMLVar('Totalsum':      %char(d1nbel));
pdf            UpdHTMLVar('Linetype':      %char(d1lety));
pdf            UpdHTMLVar('DiscountAccounting': %trim(w_mark));
6.2A           UpdHTMLVar('Currency':            fovalk);
6.2A           UpdHTMLVar('Nobbno':        %char(fdnobb));
6.2A           UpdHTMLVar('Lineno':        %char(fdline));
6.2A           UpdHTMLVar('Warehouse':     %char(fdlage));
6.2A           test(de) *dmy w_lddt;
6.2A           if %error;
6.2A           tmpdate = *loval;
6.2A           else;
6.2A           tmpdate = %date(w_lddt : *dmy);
6.2A           endif;
6.2A           UpdHTMLVar('Deliverydate': %char(tmpdate : *iso));
6.2I     //    UpdHTMLVar('Partneritemno':       fdlvar);
6.2I           UpdHTMLVar('Partneritemno':%trim(w_lvar));
6.34     //    UpdHTMLVar('Campaign':            fdkamp);
6.34           UpdHTMLVar('Campaign':     %trim(w_kamp));
6.2A           UpdHTMLVar('Gtin':           %char(fdeann));
pdf            WrtSection('Line');
pdf
pdf   /End-free
pdf   *
pdf  c                   else
6.14 c                   eval      w_tek1 = *blank
6.14 c                   eval      w_tek2 = *blank
pdf  c                   movel     fdtek1        d1tek1
pdf  c                   movel     fdtek2        d1tek2
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Tekstlinjer
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     d1tek1        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     w_str_out     w_tek1
6.17 c                   movel     p_str_out     w_tek1
pdf   *
6.17 c                   eval      p_lr = '0'
6.17 c                   eval      p_str_in = *blank
6.17 c                   movel     d1tek2        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_tek2
6.20 c**6.28             eval      w_tek0 = %trim(w_tek1) + ' ' + %trim(w_tek2)
6.28 c                   if        %subst(d1tek1:35:1) = ' ' or
6.28 c                             %subst(d1tek2:1:1) = ' '
6.28 c                   eval      w_tek0 = %trim(w_tek1) + ' ' + %trim(w_tek2)
6.28 c                   else
6.28 c                   eval      w_tek0 = %trim(w_tek1) + %trimr(w_tek2)
6.28 c                   endif
pdf   *
pdf   /Free
6.14      //   UpdHTMLVar('Text1':              d1tek1);
6.20      //   UpdHTMLVar('Text1':              w_tek1);
6.20           UpdHTMLVar('Text1':       %trim(w_tek0));
6.14     //    UpdHTMLVar('Text2':              d1tek2);
6.20           UpdHTMLVar('Text2':                 ' ');
pdf            WrtSection('TextLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endif
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Rabatt                  *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_rabatt    begsr
pdf   * Sørg for at vi har skrevet siste tag for bunntext før vi
pdf   * avslutter.
pdf  c                   if        b_bott = *on
pdf  c                   exsr      xml_bott_end
pdf  c                   eval      b_bott = *off
pdf  c                   endif
pdf   *
pdf   /Free
pdf        // Skriv rabattlinjer
pdf            UpdHTMLVar('Discountinpercent':   %char(r1rabp));
pdf            UpdHTMLVar('Discountbasis':       %char(r1rabg));
pdf            UpdHTMLVar('Sumdiscount':         %char(r1rabb));
pdf            WrtSection('DiscountLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Netto                   *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_netto     begsr
pdf   * Sørg for at vi har skrevet siste tag for bunntext før vi
pdf   * avslutter.
pdf  c                   if        b_bott = *on
pdf  c                   exsr      xml_bott_end
pdf  c                   eval      b_bott = *off
pdf  c                   endif
pdf   *
pdf   /Free
pdf        // Skriv nettolinje
pdf            UpdHTMLVar('Sumnettoexcvat':       %char(t1tnet));
pdf            WrtSection('NettoLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Vat linjer              *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_vat       begsr
pdf   *
pdf   /Free
pdf
pdf        // Skriv vatlinje
pdf            UpdHTMLVar('Vatpercent':           %char(t1mvas));
pdf            UpdHTMLVar('Vatbasis':             %char(t1mvag));
pdf            UpdHTMLVar('Sumvat':               %char(t1tmva));
pdf            WrtSection('VatLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Totaler                 *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_totaler   begsr
pdf   *
pdf   /Free
pdf        //  UpdHTMLVar('Totrabkat':       %char(t1rkat));
pdf        // Skriv totallinje
pdf            UpdHTMLVar('Sumtotal':             %char(t1totb));
6.2A           UpdHTMLVar('Rounding':                      '0');
pdf            WrtSection('TotalLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Topptekst start         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_topt_str  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('TopTextStart');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Topptekst               *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_topptxt   begsr
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Topptekst
6.2C c                   eval      w_ttext = *blank
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     e1text        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.2C c**                 movel     p_str_out     e1text
6.2C c                   movel     p_str_out     w_ttext
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
6.2C   //      UpdHTMLVar('Toptext':     e1text);
6.2C           UpdHTMLVar('Toptext':    w_ttext);
pdf            WrtSection('TopTextLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Topptekst slutt         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_topt_end  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('TopTextEnd');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Bunntekst start         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_bott_str  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('BottomTextStart');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Bunntekst               *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_bunntxt   begsr
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Bunntekst
6.2C c                   eval      w_btext = *blank
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     e1text        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.2C c**                 movel     p_str_out     e1text
6.2C c                   movel     p_str_out     w_btext
pdf   *
pdf   /Free
pdf        // Skriv bunntekst
6.2C    //     UpdHTMLVar('Bottomtext':  e1text);
6.2C           UpdHTMLVar('Bottomtext': w_btext);
pdf            WrtSection('BottomTextLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Bunntekst slutt         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_bott_end  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('BottomTextEnd');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Slutt                   *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_end       begsr
pdf   * Sørg for at vi har skrevet siste tag for bunntext før vi begynner
pdf   * avslutter.
pdf  c                   if        b_bott = *on
pdf  c                   exsr      xml_bott_end
pdf  c                   eval      b_bott = *off
pdf  c                   endif
pdf   * Skriv xmlfila til disk
pdf   /Free
pdf            WrtSection('EndTenderLines');
pdf   /End-free
pdf   *
pdf   * Hvis denne ikke skal arkiveres, lages ikke archive tagg.
pdf   *
pdf  c                   if        l_arch = 1
6.13  * Lag tag for vising i arkivklienten
6.13 c                   eval      w_dspl = *blank
6.13 c                   eval      w_dspl = 'Tilbud: ' + %char(a1numm) +
8.01 c                             ' Kunde: ' +  %trim(%char(a1kund) + ' - ' +
8.01 c**                           ' Kunde: ' +  %trim(%char(fokund) + ' - ' +
6.13 c                             %trim(a1navn) + '  Beløp ' + %char(t1totb))
6.14  *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '1'
6.17 c                   movel     w_dspl        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_dspl
6.2E  * Referansetagg
6.2E c                   eval      w_refn = *blank
6.2F c*                  eval      w_refn = 'TI-' + %char(a1numm) +
6.2F c*                            '-' + %char(%subdt(w_date:*years))
6.2F c                   eval      w_refn = %char(%subdt(w_date:*years)) +
8.06 c                             %char(a1numm) + '-' + %char(fosuff)
pdf   /Free
pdf
pdf        // Skriv metattags
6.13
6.23           UpdHTMLVar('Refno':          %trim(w_refn));
6.13           UpdHTMLVar('Displaytag':     %trim(w_dspl));
pdf            WrtSection('ArchiveCommandStart');
6.13
pdf            UpdHTMLVar('Metavalue':      %char(a1numm));
pdf            UpdHTMLVar('Metakey':       'TILBUDNUMMER');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':      %char(a1kund));
pdf            UpdHTMLVar('Metakey':        'KUNDENUMMER');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':            w_1navn);
pdf            UpdHTMLVar('Metakey':          'KUNDENAVN');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':      %char(t1totb));
pdf            UpdHTMLVar('Metakey':              'BELOP');
pdf            WrtSection('MetaTag');
6.13
6.13           UpdHTMLVar('Metavalue':      %char(fonumm));
6.13           UpdHTMLVar('Metakey':        'ORDRENUMMER');
6.13           WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue': %char(w_date:*iso));
pdf            UpdHTMLVar('Metakey':               'DATO');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':             l_user);
pdf            UpdHTMLVar('Metakey':             'BRUKER');
pdf            WrtSection('MetaTag');
6.24
6.24           UpdHTMLVar('Metavalue':             a1txt1);
6.24           UpdHTMLVar('Metakey':         'RUTINETEKST');
6.24           WrtSection('MetaTag');
6.2E
6.2E           UpdHTMLVar('Metavalue':             l_ruti);
6.2E           UpdHTMLVar('Metakey':             'RUTINE');
6.2E           WrtSection('MetaTag');
6.2E
6.2E           UpdHTMLVar('Metavalue':      %char(l_firm));
6.2E           UpdHTMLVar('Metakey':              'FIRMA');
6.2E           WrtSection('MetaTag');
6.2E
6.2E           UpdHTMLVar('Metavalue':             l_wsid);
6.2E           UpdHTMLVar('Metakey':             'SKJERM');
6.2E           WrtSection('MetaTag');
pdf
pdf            WrtSection('ArchiveCommandEnd');
pdf   /End-free
8.07  *
8.07  * Skriv inn i tabell for bruk til søk i arkiv.
8.07  *
8.07         exec sql
8.07         insert into xlkost
8.07           (xofirm,xoyear,xodocn,xosuff,xobatc,
8.07            xobatt,xorefn,xostmp)
8.07         values(:w_firm,:w_year,:a1numm,:fosuff,:w_jkey,
8.07                'TILBUD',:w_refn,:w_stmp);
8.07         commit;
8.07  *
pdf  c                   endif
pdf   *
pdf   /Free
pdf
pdf            WrtSection('Footer');
pdf   /End-free
pdf   *
pdf   * Så legge vi ut xml fila
pdf  c                   eval      XML_Output = XML_path + l_filg +'/'+
pdf  c                             'Tilb_'+ %trim(w_jkey) + '.xml'
pdf   *
pdf  c                   callp     WrtHtmlToStmf(XML_Output: 819)
6.32  * Skriver til datakø for å aktivere sniffer, hvis dataq er aktiv
6.32 c                   if        d_dtaq = '1'
6.32 c                   eval      p_xmlf = xml_output
6.32 c                   eval      p_filg = 'ADB'+l_filg
6.32 c                   call      'AP629C'
6.32 c                   parm                    p_filg
6.32 c                   parm                    p_xmlf
6.32 c                   endif
pdf   *
pdf  c                   endsr
pdf   *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Skjermvisning           *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     pdf_preview   begsr
pdf   * Vi kaller program for launch av PDF i browser
pdf  c                   call      'AP621R'
pdf  c                   parm                    w_jkey
pdf   *
pdf  c                   endsr
pdf   *
6.2A  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.2A  * Subrutiner for XML/jasper integrasjon - Detaljer                *
6.2A  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.2A c     hnt_avde      begsr
6.2A  * Hent inn avdelingsinformasjon
6.2A c
6.2A c                   eval      w_ddeno = foavde
6.2A c                   eval      w_dnavn = *blank
6.2A c                   eval      w_dadr1 = *blank
6.2A c                   eval      w_dadr2 = *blank
6.2A c                   eval      w_dpcde = *zeros
6.2A c                   eval      w_dpstd = *blank
6.2A c                   eval      w_dphon = *blank
6.2A c                   eval      w_dfaxn = *blank
6.2A  *
6.2A c                   eval      ra07pf_avde = foavde
6.2A c     ra07pf_key    chain     ra07pfr                            90
6.2A c                   if        *in90  = *off
6.2A c                   eval      w_dnavn = ragtxt
6.2A c                   eval      w_dadr1 = ragadr
6.2A c                   eval      w_dadr2 = ragad2
6.2A c                   eval      w_dpcde = ragpnr
6.2A c                   eval      w_dpstd = (%char(ragpnr) + ' ' + ragste)
6.2A c                   if        ragtlf <> *blank
6.2A c                   eval      w_dphon = ragtlf
6.2A c                   endif
6.2A c                   if        ragfax <> *blank
6.2A c                   eval      w_dfaxn = ragfax
6.2A c                   endif
6.2A c                   endif
6.2A  *
6.2A c                   endsr
6.2B  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.2B  * Subrutine for utskrift av lengdespesifikasjoner
6.2B  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.2B  *
6.2B c     skr_leng      begsr
6.2B  *
6.2B c                   eval      b_leng = *off
6.2B  *
6.2B c                   eval      fvlsl1_numm = wwnumm
6.2B c                   eval      fvlsl1_suff = wwsuff
6.2B c                   eval      fvlsl1_line = wwline
6.2B c     fvlsl1_key    setll     fvlsl1
6.2B c     fvlsl1_key    reade     fvlsl1
6.2B  *
6.2B c                   dow       not %eof
6.2B c                   eval(h)   w_leng = fvleng
6.2B c                   eval(h)   w_anta = fvanta
6.2B c                   eval      d1tek1 = %char(w_leng) + ' mm x ' +
6.2B c                                      %char(w_anta) + ' stk'
6.2B c                   eval      d1tek2 = *blank
6.2B c                   if        b_leng = *off
6.2B c                   eval      b_leng = *on
6.2B c                   endif
6.2B  *
6.2B c                   if        b_leng = *on
6.2B c                   if        b_pdfp = *off
6.2B  *
6.2B c                   write     d2det                                30
6.2B c     *in30         caseq     *on           xovrfl
6.2B c                   endcs
6.2B  * Vi skriver til XML taggene for lengdeinformasjon
6.2B c                   else
6.2B c                   exsr      xml_spec
6.2B c                   endif
6.2B c                   endif
6.2B c     fvlsl1_key    reade     fvlsl1
6.2B c                   enddo
6.2B  *
6.2B c     end_leng      endsr
6.2B  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.2B  * Subrutiner for XML/jasper integrasjon - Spesifikasjoner         *
6.2B  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.2B c     xml_spec      begsr
6.2B  *
6.2B c                   eval      w_tek1 = *blank
6.2B c                   eval      w_tek2 = *blank
6.2B  * Vi må oversette aktuelle tekster til "xml" tegn - Tekstlinjer
6.2B c                   eval      p_str_in = *blank
6.2B c                   eval      p_lr = '0'
6.2B c                   movel     d1tek1        p_str_in
6.2B c                   call      'AP613R'
6.2B c                   parm                    p_str_in
6.2B c                   parm                    p_str_out
6.2B c                   parm                    p_lr
6.2B c                   movel     w_str_out     w_tek1
6.2B c                   movel     p_str_out     w_tek1
6.2B  *
6.2B c                   eval      p_lr = '0'
6.2B c                   eval      p_str_in = *blank
6.2B c                   movel     d1tek2        p_str_in
6.2B c                   call      'AP613R'
6.2B c                   parm                    p_str_in
6.2B c                   parm                    p_str_out
6.2B c                   parm                    p_lr
6.2B c                   movel     p_str_out     w_tek2
6.2B c                   eval      w_tek0 = %trim(w_tek1) + %trim(w_tek2)
6.2B  *
6.2B  /Free
6.2B           UpdHTMLVar('Text1':       %trim(w_tek0));
6.2B           UpdHTMLVar('Text2':                 ' ');
6.2B           WrtSection('TextLine');
6.2B
6.2B  /End-free
6.2B  *
6.2B c                   endsr
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     *INZSR        BEGSR
5.01  *
5.01  * Parametre
5.01  *
5.01 c     *entry        plist
5.01 c                   parm                    p_mail
5.01 c                   parm                    p_kund
5.61 c                   parm                    p_kpro
6.nu c                   parm                    p_numm
5.02 c                   parm                    p_selg
      *
     C     *LIKE         DEFINE    A1BTX1        WPCTX1
     C     *LIKE         DEFINE    A1BTX2        WPCTX2
     C     *LIKE         DEFINE    FAAKUN        W0KUND
     C     *LIKE         DEFINE    VAOTYP        WWOTYP
     C     *LIKE         DEFINE    FOKUND        WWKUND
     C     *LIKE         DEFINE    FOFIRM        WWFIRM
     C     *LIKE         DEFINE    FOWSID        WWWSID
     C     *LIKE         DEFINE    FONUMM        WWNUMM
     C     *LIKE         DEFINE    FOSUFF        WWSUFF
     C     *LIKE         DEFINE    FDLINE        WWLINE
     C     *LIKE         DEFINE    FDLTYP        WWLTYP
     C     *LIKE         DEFINE    VAPKOD        WWPKOD
     C     *LIKE         DEFINE    FDNUMM        SANUMM
     C     *LIKE         DEFINE    VVVARE        WWVARE
     C     *LIKE         DEFINE    FDANTA        W1ANTA
     C     *LIKE         DEFINE    FDsapr        W1RAB1
7.01 C**   *LIKE         DEFINE    FDsapr        W1NPRI
     C     *LIKE         DEFINE    FDsapr        D1RABB
3.11 C     *LIKE         DEFINE    FDsapr        W1SUMR
      *
     C     *LIKE         DEFINE    FDsapr        D1NPRI
      *
      *
     C     *LIKE         DEFINE    FDSUMS        D1BBEL
      *
      *  Nullstilling av felter som ikke kan redefineres
      *
      *
     C                   MOVE      *BLANK        WPRETK            1
     C                   MOVE      *ZERO         WPMVAS            6 2
     C                   MOVE      *ZERO         WPMVAT            5 4
     C                   MOVE      *ZERO         WPMVAF           10 9
      *
     C                   MOVE      *BLANK        WWRUTI           10
     C                   MOVE      *ZERO         WLTELL            3 0
     C                   MOVE      *ZERO         WLTEST            3 0
      *
3.11 C                   MOVE      *ZERO         W1RABB           11 3
3.11 C                   MOVE      *ZERO         W1RABG           11 2
      *
6.25  * Key for posisjonering på selgere
6.25  *
6.25 c     ra09l1_key    klist
6.25 c                   kfld                    wwfirm
6.25 c                   kfld                    ra09l1_ikod
      * Key for Heading-file
      *
     C     KEY01         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWNUMM
     C                   KFLD                    WWSUFF
      *
      * Key for Detalj-file
      *
     C     KEY02         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWNUMM
     C                   KFLD                    WWSUFF
     C                   KFLD                    WWLINE
      *
      * Key for Tekst-linjer
      *
     C     KEY03         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWNUMM
     C                   KFLD                    WWSUFF
     C                   KFLD                    WWLINE
      *
      * Key for kunderegister
      *
     C     KEY04         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWKUND
      *
      * Key for firmaregister
      *
     C     KEY06         KLIST
     C                   KFLD                    WWFIRM
      *
      * Key for ordretyper
      *
     C     KEY07         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWOTYP
      *
      * Key for linjetyper
      *
     C     KEY08         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWLTYP
      *
      * Key for statusregister
      *
     C     KEY09         KLIST
     C                   KFLD                    WWFIRM
      *
      * Key for formular-register
      *
     C     KEY10         KLIST
     C                   KFLD                    WWRUTI
      *
      * Key for vare-register
      *
     C     KEY11         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWVARE
      *
      * Key for priskode-register
      *
     C     KEY19         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWPKOD
6.18  *
6.18  * Key for firmaregister
6.18  *
6.18 c     afirl1_key    klist
6.18 c                   kfld                    wwfirm
6.2A  *
6.2A  * Key for oppslag på avdelings-register
6.2A  *
6.2A c     ra07pf_key    klist
6.2A c                   kfld                    w_firm
6.2A c                   kfld                    ra07pf_avde
6.2B  *
6.2B  * Key for oppslag på lengdespesif.linje
6.2B  *
6.2B c     fvlsl1_key    klist
6.2B c                   kfld                    wwfirm
6.2B c                   kfld                    fvlsl1_numm
6.2B c                   kfld                    fvlsl1_suff
6.2B c                   kfld                    fvlsl1_line
7.03  *
7.03  * Key for oppslag på lager-register
7.03  *
7.03 c     vlagl1_key    klist
7.03 c                   kfld                    w_firm
7.03 c                   kfld                    vlagl1_vare
7.03 c                   kfld                    vlagl1_lage
8.04  *
8.04  * Key for oppslag på kundeprosjekttabell
8.04  *
8.04 c     fkprl1_key    klist
8.04 c                   kfld                    w_firm
8.04 c                   kfld                    fkprl1_kund
8.04 c                   kfld                    fkprl1_kpro
      *
      * Hente inn rutinenavn
      * og meldingstekst
      *
     C                   MOVE      l_ruti        WWRUTI
7.03 c                   eval      w_firm = l_firm
      *
     C     KEY10         CHAIN     AFORL1R                            69
     C  N69              MOVE      AFTXT1        A1TXT1
     C  N69              MOVE      AFMLD1        T1MLD1
5.01  *
5.01  * Sjekker om dette skal sendes
5.01  * som e-mail
5.01  *
5.01 c                   if        l_outq = 'E_MAIL_ASP'
5.01 c                   eval      p_mail = 'J'
5.01 c                   endif
pdf   *
pdf   * Sjekk om vi skal bruke JASPER og XML generering av dokumenter
pdf  c                   if        l_poff = '1'
pdf  c                   eval      b_pdfp = *off
pdf  c                   eval      b_topt = *off
pdf  c                   eval      b_bott = *off
pdf  c                   eval      w_pdf = 0
pdf  c                   eval      w_pdf_ds = *blanks
pdf  c                   eval      w_ruti = l_ruti
pdf   *
pdf  c                   call      'AP609R'
pdf  c                   parm                    w_ruti
pdf  c                   parm                    w_pdf
pdf  c                   parm                    w_pdf_ds
pdf  c                   eval      d_pdf_ds = w_pdf_ds
pdf   * Vi skal kjøre med jasper
pdf  c                   if        w_pdf = 1 and
pdf  c                             %trim(d_xmlm) <> *blanks
pdf  c                   eval      p_mail = '0'
pdf  c                   eval      w_jkey = l_bach
pdf   * Hent inn xml templaten
pdf  c                   callp     GetHTMLIFS(d_xmlm :'<AS400>')
6.2J c                   callp     ClrHtmlBuffer
pdf   *
pdf   * Hent hvor xml'en skal ligge
pdf   *
pdf  c                   eval      XML_path = *blanks
pdf  c                   eval      XML_path = %trim(d_path)
pdf   *
pdf   * Finn path til logo
pdf   *
pdf  c                   eval      jasper_logo = *blanks
pdf  c                   eval      jasper_logo = %trim(d_logo)
pdf   *
pdf   * Jobbnummer er allerede generert i AP600R. Overføres i *lda
pdf   *
pdf  c                   time                    w_date
8.07 c                   eval      w_year = %subdt(w_date:*years)
8.07 c                   time                    w_stmp
pdf   * Vi logger at utskriftprogrammet har startet
pdf  c                   eval      w_jstat = 10
pdf  c                   eval      w_jtext = 'Utskrift av tilbud har startet'
pdf  c                   call      'AB705R'
pdf  c                   parm                    l_bach
pdf  c                   parm                    w_jstat
pdf  c                   parm                    w_jtext
pdf   * Vi skriver xml for miljø formater
pdf  c                   exsr      xml_envm
pdf  c                   eval      b_pdfp = *on
pdf  c                   endif
pdf   * Hvis et eller annet er galt med parametrene, logges og kjør uten PROA
pdf  c                   if        %trim(d_xmlm) = *blanks
pdf  c                   eval      b_pdfp = *off
pdf   * Vi logger at noe er galt med parametrene
pdf  c                   eval      w_jstat = 20
pdf  c                   eval      w_jtext = 'Finner ikke path til xml !!! +
pdf  c                             Sjekk rutineregister !'
pdf  c                   call      'AB705R'
pdf  c                   parm                    l_bach
pdf  c                   parm                    w_jstat
pdf  c                   parm                    w_jtext
pdf  c                   endif
pdf   *
pdf  c                   else
pdf  c                   eval      b_pdfp = *off
pdf  c                   endif
7.02  *
7.02  * Kaller spesielt mailprogram med logikk
7.02  *
7.02   CallP CO402R(l_filg:w_firm:0:'SPESIAL_MAILLOGIKK':
7.02   co402_verdi1:co402_verdi2);
7.02   if co402_verdi1 = '1';
7.02     u_s702 = *on;
7.02   endif;
7.02  *
      *
     C                   ENDSR
      *
