pdf  h option(*nodebugio) datedit(*dmy.) decedit('0.')
pdf  h DftActgrp(*No) BndDir('CGIDEV2/CGIDEV2')
pdf   /copy hspecsbnd
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Program . . . . : FO925R
      * Beskrivelse . . : Utskrift av Plukkliste
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
3.12  * R3.12 310800 AMD  Lagt inn mulighet for utprint av avdelingsnavn
3.12  *                   i stedet for firmanavn dersom ønskelig
3.13  * R3.13 110900 AMD  Dersom vare er hentet fra LVR settes det inn
3.13  *                   2 desimaler som standard (finnes jo ikke i EVR)
3.32  * R3.32 020401 AMD  Lagt inn utskrift av bestillingsnummer.
3.33  * R3.33 310501 AMD  Lagt inn utskrift av telefon/fax/mobil.
3.34  * R3.34 140602 AMD  Lagt inn utskrift av lassnr.
      *
5.01  * R5.01 221002 AMD  Løsning for å kunne sende e-mail
5.02  * R5.02 260903 AMD  Automatisk opplegg for subject (emne) ved
5.02  *                   sending av mail.
5.21  * R5.21 261103 AMD  Overstyrer med mobilnummer fra ordrehode
5.21  *                   dersom oppgitt.
5.22  * R5.22 031203 AMD  Lagt inn utskrift av leveringstype
5.22  *                   + lagt inn skråstrek mellom telefon / telefax
5.23  * R5.23 150104 AMD  Lagt inn utskrift av lager på linjenivå
5.32  * R5.32 040604 GRO  Lagt til utskrift av lengdespesifikasjoner
5.41  * R5.41 150605 AMD  Hente styring på firmaopplysninger fra LDA.
5.42  * R5.42 140905 AMD  Lagt inn utskrift av eksternt kundeprosjekt
5.43  * R5.43 220806 AMD  Lagt inn utskrift av leveringsbetingelser
5.51  * R5.51 251905 AMD  Plukkliste skal ikke skrives dersom ordre-
      *                   type matcher den som er oppgitt i status-
      *                   record, og plukket dato ikke er oppdatert.
      *                   Utskrift av ordreinfo 1 og 2
      *                   Utskrift av lagerplass
5.52  * R5.52 280307 AMD  Lagt inn automatisk oppdatering av logg for
      *                   plukkliste ved kjørekontor-løsning
5.60  * R5.60 310108 bof  Oppd. logg kun hvis det er valgt plukking
5.61  * R5.61 200608 AMD  Tar hensyn til epost-adresse på kundeprosjekt
      *
6.10  * R6.10 070909 BSA  Utskriften endret pga utvidelse av referansefelter.
pdf   * R6.10 130710 bsa  Lagt inn funksjonalitet for eksport til XML
pdf   *                   format for videre arkivering og utskrift.
6.11  * R6.10 270910 bsa  Tillegg av faste tagger. Display tag + ordrenummer
6.11  *                   hvis den finnes.
6.12  * R6.10 300910 bsa  Hvis konvtertering av spesialtegn, legges til flere tegn
6.12  *                   som kan gjøre at noen av disse faller utenfor pga av felt-
6.12  *                   lengde.
6.13  * R6.10 071010 bsa  Legger inn test om gyldig utkø. Hvis ikke, legger vi ikke
6.13  *                   ut "printer kommand" tagger.
6.14  * R6.10 211010 bsa  Kaller eget program for scann av tegn.
6.15  * R6.10 041110 bsa  Div. manglende info.
6.16  * R6.10 261110 bsa  Håndtering av linjeskift i e-mail utsendelse
6.17  * R6.10 040111 bsa  Slå sammen tekstlinje 1 og 2 på samme linje
6.18  * R6.10 210111 bsa  Utelatt scann av streng.
6.19  * R6.10 210111 bsa  Status for om pris skal legges ut eller ei
6.20  * R6.10 100211 bsa  Utelatt scann av ordreinfo strenger
6.21  * R6.10 160311 bsa  Ved valg av *ARKIV som skriver skal den kun arkiveres
6.22  * R6.20 100511 bsa  Lagger ut rutinetekst som metatagg.
6.23  * R6.20 260511 NHO  Mobil nr skal legges ut dersom 1 i felt
      *                   FAAMSA i fil FSTSPF
6.24  * R6.20 130212 bsa  Manglende tagger ved utskift av tomme dokumenter
6.25  * R6.20 280312 bsa  Håndetring av "space" mellom tekst 1 og 2 ved tekstlinjer
6.26  * R6.10 290512 bsa  Håndterer riktig MVA ifbm organisasjonsnr.
6.27  * R6.20 020712 bsa  Strukturendring av og nye xml tagger
6.28  * R6.20 251012 bsa  Må hente medianavn, og ikke skuffnummer
6.29  * R6.20 041212 bsa  Legger ut nytt unikt refno, utvidet metatagger
6.2A  * R6.20 040113 bsa  Endrer logikken for oppbygging av refno
6.2B  * R6.20 201113 bsa  Scanner lev.varenummer
6.2C  * R6.20 140415 bsa  0 stiller minne for gjenbruk av XML info
6.nu  * R6.30 030614 bsa  Programmet gjennomgått mtp nummerutvidelser.
6.30  * R6.30 120914 bsa  Utvidet parameterliste til FO798R. Håndtering av
6.30  *                   flere mailfelter.
6.31  * 6.30  120914 BKV  Henter overstyrt info fra kundeprosjekt
6.32  * 6.30  051214 Bsa  Utvidet parameterliste til FÅ707R
6.33  * 6.30  280115 bsa  Skriver til datakø for å trigge java sniffer
6.34  * 6.30  040915 bsa  Legger ut avdeling som tagg for arkiveringsformål.
6.35  * 6.30  160915 bsa  Scanner kampanje
6.36  * 6.30  210916 bsa  Scanner flere felter
6.37  * 6.30  171016 bsa  Feltet for topp/bunn tekst er for kort etter scanning
6.38  * 6.30  241016 bsa  Flytttet sekvens for leveringsmåte
6.39  * 6.30  251119 bof  Bruker FOKUND for å slå opp mot kontaktperson
6.39  *                   skal bruke FOLKUN hvis det ligger noe der
6.3a  * 6.30  270220 bsa  Må huske å sende med suffiks
      *
7.01  * K000  260418 bsa  Kaller nytt program for utsendelse av mail
7.02  * K000  290620 bsa  Legger ut fysisk beholdning på plukklista.
      *
8.01  *K0000  120122 bsa  Hvis varekunde, fakturakunde og kundeprosjekt,
8.01  *K0000              skal varekunde ut på dokumentet.
8.02  *K0000  151122 bsa  Legger ut volum og vekt, totalt og på linjer.
8.03  *K0000  211122 bsa  Nullstille felter vi ikke har verdi for.
8.04  *K0000  031123 bsa  Sjekker vareadresse.
8.05  *PRG2   210622 bof  Utvidet prisgruppe fra 1 til 2 posisjoner
8.06  *K0000  120924 bsa  Endrer arkiveringsreferanse.
8.07  *K0000  120325 bsa  Skriver inn til tabell for bruk ved søking i arkiv.
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     FFPSOL1    IPE  E             DISK    RENAME(FPSOPFR:FPSOL1R)
     FFSTSL1    IF   E           K DISK    RENAME(FSTSPFR:FSTSL1R)
     FVOTYL1    IF   E           K DISK    RENAME(VOTYPFR:VOTYL1R)
     FVLTYL1    IF   E           K DISK    RENAME(VLTYPFR:VLTYL1R)
     FVPKOL1    IF   E           K DISK    RENAME(VPKOPFR:VPKOL1R)
     FFOHEL1    IF   E           K DISK    RENAME(FOHEPFR:FOHEL1R)
     FFODTL1    IF   E           K DISK    RENAME(FODTPFR:FODTL1R)
     FFOTXL1    IF   E           K DISK    RENAME(FOTXPFR:FOTXL1R)
     FVVARL1    IF   E           K DISK    RENAME(VVARPFR:VVARL1R)
5.51 fvlagl1    if   e           k disk    rename(vlagpfr:vlagl1r)
     Fvvenl1    if   e           k disk    rename(vvenpfr:vvenl1r)
     Frkunl1    IF   E           K DISK    RENAME(RKUNPFR:rkunl1r)
     FAFORL1    IF   E           K DISK    RENAME(AFORPFR:AFORL1R)
5.32 ffvlsl1    if   e           k disk    rename(fvlspfr:fvlsl1r)
5.42 ffkprl1    if   e           k disk    rename(fkprpfr:fkprl1r)
6.15 fafirl1    if   e           k disk    rename(afirpfr:afirl1r)
6.23 fra09l1    if   e           k disk    rename(ra09pfr:ra09l1r)
6.27 fra07pf    if   e           k disk
     FFO925P    O    E             PRINTER
      *
      * Definering av variabler i nøkler
6.23 d ra09l1_ikod     s                   like(raikod)
6.27 d ra07pf_avde     s                   like(ragkod)
6.23 d w_selgn         s             16
6.23 d                 ds
6.23 d x_mobi                        12
6.23 d  d_tegn                        1    overlay(x_mobi:1)
6.23 d  d_mobn                       11    overlay(x_mobi:2)
      *
     d vvenl1_vare     s                   like(vevare)
     d vvenl1_enhe     s                   like(veenhe)
5.32 d fvlsl1_numm     s                   like(fvnumm)
5.32 d fvlsl1_suff     s                   like(fvsuff)
5.32 d fvlsl1_line     s                   like(fvline)
5.42 d fkprl1_kund     s                   like(flkund)
5.42 d fkprl1_kpro     s                   like(flkpro)
5.51 d vlagl1_vare     s                   like(vlvare)
5.51 d vlagl1_lage     s                   like(vllage)
      *
      * Definering av variable
      *
     d w_omrl          s                   like(veomre)
     d w_omrs          s                   like(veomre)
     d w_ant2          s                   like(fdanta)
5.32 d w_leng          s              6  0
5.32 d w_anta          s              6  0
5.51 d w_drop          s              1  0
5.51 d w_numm          s                   like(fonumm)
5.51 d w_suff          s                   like(fosuff)
5.52 d w_stat          s              1
5.60 d w_aarr          s              4  0
5.60 d w_kod2          s              1
6.31 d w_prpa          s                   like(rkprpa)
      *
      * - - - - - - - - - - - - - -
      * Henter inn data fra LDA
      * - - - - - - - - - - - - - -
      *
     d                uds
pdf  d l_poff                584    584
6.21 d l_utqm                585    594
pdf  d l_bach                595    635
pdf  d l_arch                636    636  0
pdf  d l_skje                637    637  0
pdf  d l_land                638    638  0
pdf  d l_exlp                639    639  0
pdf  d l_mail                640    640  0
5.41 d  l_prfi               750    750  0
     d  l_ruti               800    809
5.01 d  l_outq               810    819
6.15 d l_copy                838    843  0
     d  l_alin               856    858  0
5.52 d  l_wsid               901    910
5.52 d  l_user               911    920
pdf  d  l_filg               931    933
     d  l_firm               944    946  0
6.34 d  l_avde               947    950  0
5.52  *
5.52  * Definering av datastruktur
5.52  *
5.52 d                 ds
5.52 d d_urec                        80
5.52 d  d_firm                        3  0 overlay(d_urec)
5.60 d  d_aarr                        4  0 overlay(d_urec:4)
6.nu d  d_numm                        8  0 overlay(d_urec:8)
6.nu d  d_suff                        2  0 overlay(d_urec:16)
6.nu d  d_kode                        1    overlay(d_urec:18)
6.nu d  d_date                         d   overlay(d_urec:19) datfmt(*iso)
6.nu d  d_time                         t   overlay(d_urec:29) timfmt(*iso)
6.nu d  d_user                       10    overlay(d_urec:37)
6.nu d  d_wsid                       10    overlay(d_urec:47)
5.01  *
5.01  * Definering av parametre
5.01  *
5.01 d p_mail          s              1
5.01 d p_kund          s              6  0
5.61 d p_kpro          s              6  0
6.nu d p_numm          s              8  0
6.30 d p_suff          s                   like(fosuff)
5.02 d p_selg          s              4  0
pdf  d p_serv          s             35
pdf  d p_stat          s              1
pdf  d p_kule          s              1
pdf  d p_navn          s             30
pdf  d p_emal          s             50
pdf  d p_ema2          s             50
6.30 d p_ema3          s             50
6.30 d p_kopi          s             50
pdf  d p_emne          s             50
7.01 d p_e702          s            180
pdf  d p_txt1          s             50
pdf  d p_txt2          s             50
pdf  d p_txt3          s             50
pdf  d p_txt4          s             50
pdf  d p_pers          s             50
pdf  d p_inif          s             40
pdf  d p_in03          s              1
6.13 d p_ok            s              1
6.14 d p_lr            s              1
6.14 d p_str_in        s            512
6.14 d p_str_out       s            512
6.33 d p_filg          s             10
6.33 d p_xmlf          s            256
      *
      * Definering av variable
      *
3.12 d w_prfi          s              1  0
3.12 d w_ffir          s              3  0
3.12 d w_avde          s              4  0
3.12 d w_fnav          s             30
3.12 d w_fad1          s             30
3.12 d w_fad2          s             30
3.12 d w_fste          s             30
3.12 d w_fftx          s             30
3.12 d w_tfax          s              8
3.12 d w_ftlf          s             11
3.12 d w_ffax          s             11
3.33 d w_tlfn          s             20
3.33 d w_tlfx          s             20
3.33 d w_mobn          s             20
     d w_jtxt          s             20
5.43 d w_rtx1          s             25
5.43 d w_rtx2          s             25
5.43 d w_rtx3          s             25
5.43 d w_retk          s              1
     d wpcbda          s               d   datfmt(*iso)
     d wpcfda          s               d   datfmt(*iso)
6.32 d w_mail          s             50
6.32 d w_weba          s             50
6.37 d w_tbxt          s            100
      *
5.32 d b_flin          s              1    inz(*off)
pdf  d b_pdfp          s              1    inz(*off)
pdf  d b_topt          s              1    inz(*off)
pdf  d b_bott          s              1    inz(*off)
8.02 d b_avvi          s              1    inz(*off)
      *
pdf  d x_numm          s             15
pdf  d x_vref          s             25
pdf  d x_betb          s             42
pdf  d w_bdat          s               d   datfmt(*iso)
pdf  d w_date          s               d   datfmt(*iso)
pdf  d w_kode          s              1
pdf  d w_firm          s                   like(fofirm)
pdf  d w_fell          s              6
pdf  d w_type          s              2
pdf  d w_fast          s             10
pdf  d w_ruti          s             10
6.nu d w_tell          s              8  0
pdf  d w_pdf           s              1  0
pdf  d w_jnav          s             15
pdf  d w_jkey          s             41
pdf  d w_txt           s             35
pdf  d w_pdf_ds        s            512
pdf  d w_mtxt          s            300
pdf  d w_spol          s              5
pdf  d w_land          s              9
pdf  d w_jstat         s              2  0
pdf  d w_jtext         s            200
pdf  d w_str_in        s            512
pdf  d w_str_out       s            512
pdf  d w_x             s              3  0
pdf  d w_path          s            256
pdf  d w_emal          s             50
6.11 d w_dspl          s            250
6.14 d w_tek1          s            512
6.14 d w_tek2          s            512
6.17 d w_tek0          s            512
6.18 d w_1dref         s            512
6.18 d w_1vref         s            512
6.12 d w_1fnav         s             50
6.12 d w_1fad1         s             50
6.12 d w_1fad2         s             50
6.12 d w_1navn         s             50
6.12 d w_1gate         s             50
6.12 d w_1adr2         s             50
6.12 d w_2navn         s             50
6.12 d w_2adr1         s             50
6.12 d w_2adr2         s             50
6.20 d w_1inf1         s             50
6.20 d w_1inf2         s             50
6.15 d w_copy          s              3  0
6.19 d w_pris          s              5
6.16 d w_pemne         s             75
7.01 d w_pe702         s            256
6.16 d w_ptxt1         s             75
6.16 d w_ptxt2         s             75
6.16 d w_ptxt3         s             75
6.16 d w_ptxt4         s             75
6.16 d w_ppers         s             75
6.18 d w_rekv          s             75
6.27 d w_lbtx          s             50
6.27 d w_lmtx          s             50
6.27 d w_ddeno         s                   like(ragkod)
6.27 d w_dnavn         s             50
6.27 d w_dadr1         s             50
6.27 d w_dadr2         s             50
6.27 d w_dpcde         s                   like(ragpnr)
6.27 d w_dpstd         s             50
6.27 d w_dphon         s                   like(ragtlf)
6.27 d w_dfaxn         s                   like(ragfax)
6.27 d w_ldat          s              6  0
6.27 d w_lddt          s              6  0
6.28 d w_draw1         s             25
6.28 d w_draw2         s             25
6.28 d w_skuf          s             25
6.28 d w_dtray         s             10
6.28 d w_gtray         s             10
6.29 d w_refn          s             50
6.2B d w_lvar          s             50
6.35 d w_kamp          s             10
6.36 d w_csted         s             50
6.36 d w_psted         s             50
8.02 d w_vekt          s              9  3
8.02 d w_volu          s              9  3
8.02 d w_tvekt         s              9  3
8.02 d w_tvolu         s              9  3
8.07 d w_year          s              4  0
8.07 d w_stmp          s               z
pdf   *
pdf  d XML_Output      s            256a   Varying
pdf  d XML_path        s            256a   Varying
pdf  d                                     Inz('/home/asp/print/adb')
pdf  d jasper_mal      s            256a   inz('file:/home/asp/print/maler/+
pdf  d                                     plukkliste/PLUKKLISTE.jasper')
pdf  d jasper_logo     s            256a   Varying
pdf  d tmpdate         s               D
pdf  d tmptime         s               T
6.16 d crlf            c                   const(X'0d25')
pdf   *
pdf  d d_pdf_ds        ds
pdf  d  d_xmlm                       75
pdf  d  d_jasm                       75
pdf  d  d_logo                       75
pdf  d  d_path                      100
pdf  d  d_emal                       50
6.33 d  d_fifo                       75
6.33 d  d_kopi                        1
6.33 d  d_dtaq                        1
6.33 d  d_sign                        1
pdf   /copy prototypeb
pdf   /copy usec
pdf   *
7.01 d u_s701          s              1    inz(*off)                            Nulle fakturatype
7.01  *
7.01  * Definering av eksterne prg
7.01  *
7.01   dcl-s co402_verdi1  char(1);
7.01   dcl-s co402_verdi2  char(2048);
7.01   DCL-PR CO402R EXTPGM('CO402R');
7.01     p_filgrp            char(3)     const;
7.01     p_firm              packed(3:0) const;
7.01     p_lager             packed(2:0) const;
7.01     p_nokkel            char(50)    const;
7.01     p_verdi1            char(1);
7.01     p_verdi2            char(2048);
7.01   END-PR;
7.01  *
pdf   *
     IFPSOL1R       01
     I                                          FKSSRT        L4
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av formater                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede formater
      * - - - - - - - - - -
      *
      * A1HDR  - Heading A1 på rapport
      * A2HDR  - Heading A2 på rapport
      * A4HDR  - Heading A4 på rapport, Ordrehode over varelinje
5.51  * A5HDR  - Heading A5 på rapport, Ordreinfo 1 og 2
      * D1DET  - Detail  D1 på rapport, Varelinje
      * E1DET  - Detail  E1 på rapport, Tekstlinje
      * O1DET  - Detail  O1 på rapport, Overføring til/fra neste side
      * T1TOT  - Total   T1 på rapport
      *
      *
      * Forklaring på variabler
      * - - - - - - - - - - - -
      *
      * D1ANT0 - Antall med 0 desimaler
      * D1ANT1 - Antall med 1 desimaler
      * D1ANT2 - Antall med 2 desimaler
      * D1ANT3 - Antall med 3 desimaler
      * D1NPRI - Netto  pris
      * D1BPRI - Brutto pris
      *
      *
      * D1RABP - Rabatt i prosent (Sum prosent 1 og 2)
      * D1RABB - Rabatt i beløp
      * D1SBEL - Sum linjebeløp
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Styre-rutine                                                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
8.07  *
8.07 C/Exec SQL
8.07 C+  Set Option DatFmt=*ISO, DlyPrp=*YES, SRTSEQ=*LANGIDUNQ, LANGID=NOR,
8.07 C+             commit=*none
8.07 C/End-Exec
      *
      * Initierings-rutine
      *
     C   01FCYCLE        CASEQ     *ZERO         XSTRSR
     C                   ENDCS
      *
      * Ordrehode
      *
     C     FKSKOD        CABEQ     'H'           TAG01
      *
      * Varelinje
      *
     C     FKSKOD        CABEQ     'V'           TAG02
      *
      * Kommentar/
      * tekstlinje
      *
     C     FKSKOD        CABEQ     'K'           TAG03
      *
      * Ferdig
      *
     C                   GOTO      XSLUTT
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A1HDR Behandle heading A1 + A2                                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG01         TAG
      *
      * Hent ordre-heading
      *
     C                   MOVE      FKSONR        WWNUMM
     C                   MOVE      FKSSUF        WWSUFF
     C     KEY01         CHAIN     FOHEL1R                            61
5.51  *
5.51  * Nullstilling av ordrevariabel
5.51  *
5.51 c                   if        fonumm <> w_numm or
5.51 c                             fosuff <> w_suff
5.51 c                   eval      w_drop  = 0
5.51 c                   endif
5.51  *
5.51 c                   eval      w_numm  = fonumm
5.51 c                   eval      w_suff  = fosuff
6.19  *
6.19 c                   eval      *in55 = *off
5.51  *
5.51  * Sjekke om plukkliste skal skrives
5.51  *
5.51 c*?                 if        footyp = faaota or
5.51 c*?                           footyp = faaotb or
5.51 c*?                           footyp = faaotc or
5.51 c*?                           footyp = faaotd or
5.51 c*?                           footyp = faaote
5.51 c*?                 goto      x_nex1
5.51 c*?                 else
5.51 c*?                 goto      x_goon
5.51 c*?                 endif
5.51  *
5.51 c*?   x_nex1        tag
5.51 c*?                 if        foplda <> *loval
5.51 c*?                 goto      x_goon
5.51 c*?                 else
5.51 c*?                 eval      w_drop = 1
5.51 c*?                 goto      xslutt
5.51 c*?                 endif
5.51  *
5.51 c*?   x_goon        tag
      *
      * Snu dato
      *
     c                   if        fobdat <> *loval
     c     *dmy          move      fobdat        a1bdat
     c                   endif
      *
     c                   if        foldat <> *loval
     c     *dmy          move      foldat        a1ldat
6.27 c     *dmy          move      foldat        w_ldat
     c                   endif
      *
      * Legg inn ordrenummer
      *
     C                   MOVE      FONUMM        A1NUMM
     C                   MOVEL     '/'           A1SUFF
     C                   MOVE      FOSUFF        A1SUFF
      *
      * Flere ordre på samme
      * blankett ?
      *
     C  NL4              GOTO      TAG01A
      *
      * Hente inn kunderegister
      *
     C                   MOVE      FOKUND        WWKUND
     C     KEY04         CHAIN     rkunl1r                            64
     C                   MOVE      FOKUND        A1KUND
     C                   MOVE      RKKATG        A1KATG
     C                   MOVE      RKNAVN        A1NAVN
     C                   MOVE      RKGATE        A1GATE
     C                   MOVE      RKADR2        A1ADR2
     C                   MOVE      RKSTED        A1STED
6.31 c                   eval      w_prpa = rkprpa
8.01  *
8.01  * Sjekk hvilken kunde som skal ut på dokumentet
8.01  *
8.01 c                   if        fokund <> 0 and
8.01 c                             folkun <> 0 and
8.01 c                             fokund <> folkun and
8.01 c                             fokpro <> 0
8.01 c                   eval      wwkund = folkun
8.01 c     key04         chain     rkunl1r
8.01 c                   if        %found
8.01 c                   eval      a1kund = folkun
8.01 c                   eval      a1katg = rkkatg
8.01 c                   eval      a1navn = rknavn
8.01 c                   eval      a1gate = rkgate
8.01 c                   eval      a1adr2 = rkadr2
8.01 c                   eval      a1sted = rksted
8.01 c                   endif
8.01 c                   endif
      *
6.31  * Slå opp på kundeprosjekt for å finne om prosjekt er
6.31  * overstyrer verdi på kunde
6.31 c                   if        fokpro > 0
6.31 c                   eval      fkprl1_kund = fokund
6.31 c                   eval      fkprl1_kpro = fokpro
6.31 c     fkprl1_key    chain     fkprl1
6.31 c                   if        %found(fkprl1)
6.31 c                   eval      w_prpa = flprpa
6.31 c                   endif
6.31 c                   endif
6.31  *
6.19  * Sjekk om pris skal vise
6.31 c                   if        w_prpa = 1
6.19 c                   eval      *in55  = *on
6.19 c                   endif
      *
      * Sjekke tilbuds-kunden
      *
     C     FOKUND        IFEQ      W0KUND
     C                   MOVE      FOLKUN        FOKUND
     C                   MOVE      FONAVN        A1NAVN
     C                   MOVE      FOADR1        A1GATE
     C                   MOVE      FOADR2        A1ADR2
     C                   MOVE      FOSTED        A1STED
     C                   MOVE      *ZERO         FOLKUN
     C                   MOVE      *BLANK        FONAVN
     C                   MOVE      *BLANK        FOADR1
     C                   MOVE      *BLANK        FOADR2
     C                   MOVE      *BLANK        FOSTED
     C                   END
5.42  *
5.42  * Hente inn kundeprosjekt
5.42  * (eksternt kundeprosjekt)
5.42  *
5.42 c                   eval      *in59  = *off
5.42 c                   eval      a1epro = *blank
5.42 c                   eval      a1kpro = 0
5.42 c                   if        fokpro <> 0
5.42 c                   eval      *in59  = *on
5.42 c                   eval      fkprl1_kund = fokund
5.42 c                   eval      fkprl1_kpro = fokpro
5.42 c     fkprl1_key    chain     fkprl1r
5.42 c                   if        %found
5.42 c                   eval      a1epro = flepro
5.42 c                   eval      a1kpro = fokpro
5.42 c                   endif
5.42 c                   endif
      *
      * Finner hvilken mva-sats
      * som skal benyttes
      *
     c                   call      'FÅ705R'
     c                   parm                    wwfirm
     c                   parm                    fobdat
     c                   parm                    wpmvas
     c                   parm                    wpmvat
     c                   parm                    wpmvaf
      *
      * Hente inn betalingsbetingelser
      *
     C                   exsr      sbbetb
      *
      * Hente inn tekst
      * for lager
      *
     C                   CALL      'RS710R'
     C                   PARM                    w_retk
     C                   PARM                    folage
     C                   PARM                    w_jtxt
      *
     C                   MOVE      *BLANK        A1LATX
     C     w_retk        IFEQ      *BLANK
     C                   MOVEL     w_jtxt        A1LATX
     C                   ENDIF
      *
     C     FOLAGE        IFEQ      00
     C                   MOVE      *OFF          *IN49
     C                   ELSE
     C                   MOVE      *ON           *IN49
     C                   ENDIF
      *
      *
      * Er det registrert
      * leveringsadresse?
      *
     C                   MOVE      *OFF          *IN31
8.04 C*    FONAVN        IFNE      *BLANK
8.04 c                   if        %trim(fonavn) <> *blanks or
8.04 c                             %trim(foadr1) <> *blanks or
8.04 c                             %trim(foadr2) <> *blanks
     C                   MOVE      *ON           *IN31
     C                   MOVE      FONAVN        A2NAVN
     C                   MOVE      FOADR1        A2ADR1
     C                   MOVE      FOADR2        A2ADR2
     C                   MOVE      FOSTED        A2STED
     C                   ENDIF
      *
      * Er det registrert
      * leveringsdato?
      *
     C                   MOVE      *OFF          *IN32
     C     FOLDAT        IFNE      *loval
     C                   MOVE      *ON           *IN32
     C                   ENDIF
5.43  *
5.43  * Er det registrert
5.43  * leveringsbetingelser
5.43  *
5.43 c                   eval      w_retk = *blank
5.43 c                   eval      w_rtx1 = *blank
5.43 c                   eval      w_rtx2 = *blank
5.43 c                   eval      w_rtx3 = *blank
5.43 c                   if        folbet <> 0
5.43 c                   call      'RS718R'
5.43 c                   parm                    w_retk
5.43 c                   parm                    folbet
5.43 c                   parm                    w_rtx1
5.43 c                   parm                    w_rtx2
5.43 c                   parm                    w_rtx3
5.43 c                   eval      a1lbet = w_rtx1
5.43 c                   endif
      *
      * Er det registrert
      * kundens referanse?
      *
     C                   MOVE      *OFF          *IN33
     C     FODREF        IFNE      *BLANK
     C                   MOVE      *ON           *IN33
     C                   MOVE      FODREF        A1DREF
     C                   ENDIF
      *
      * Er det registrert
      * leveringsmåte?
      *
     C                   MOVE      *OFF          *IN34
     C     FOLMTX        IFNE      *BLANK
     C                   MOVE      *ON           *IN34
     C                   MOVE      FOLMTX        A1LMTX
     C                   ENDIF
      *
      * Er det registrert
      * rekvisisjon?
      *
     C                   MOVE      *OFF          *IN35
     C     FOREKV        IFNE      *BLANK
     C                   MOVE      *ON           *IN35
     C                   MOVE      FOREKV        A1REKV
     C                   ENDIF
      *
      * Er det registrert
      * prosjekt ?
      *
     C                   MOVE      *OFF          *IN39
     C     FOPROJ        IFNE      *ZERO
     C                   MOVE      *ON           *IN39
     C                   MOVE      FOPROJ        A1PROJ
     C                   ENDIF
3.33  *
3.33  * Hente inn telefon/fax/mobil fra kunde
3.33  *
3.33 c                   call      'FÅ710R'
3.33 c                   parm                    wwfirm
3.33 c                   parm                    a1kund
3.33 c                   parm                    fokpro
3.33 c                   parm                    w_tlfn
3.33 c                   parm                    w_tlfx
3.33 c                   parm                    w_mobn
3.33 c                   eval      a1tlfn = w_tlfn
3.33 c                   eval      a1tlfx = w_tlfx
3.33 c                   eval      a1mobn = w_mobn
5.21  *
5.21  * Overstyre med mobilnummer fra ordrehode
5.21  * dersom oppgitt
5.21  *
5.21 c                   if        fomobi <> *blank
5.21 c                   eval      a1mobn = 'Mob: ' + fomobi
5.21 c                   endif
      *
      * Flytte øvrige felter
      *
     C                   MOVE      FOREKV        A1REKV
     C     *hms          MOVE      FOTIME        A1TIME
     C                   MOVE      FOSELG        A1SELG
     C                   MOVE      FOVREF        A1VREF
6.23  *
6.23 C                   eval      x_mobi = *blank
6.23 C                   eval      x_mobn = *blank
6.23  *
6.23 C                   if        faamsa = 1
6.23 C                   eval      ra09l1_ikod = foselg
6.23 C     ra09l1_key    chain     ra09l1
6.23 C                   if        raimob <> *blank
6.23 C                   move      '/'           d_tegn
6.23 C                   move      raimob        d_mobn
6.23 C                   move      x_mobi        x_mobn
6.23 C                   endif
6.23 C                   endif
6.23  *
5.51 c                   eval      a1inf1 = foinf1
5.51 c                   eval      a1inf2 = foinf2
5.01  *
5.01  * Legg ut kundenummer i parameter
5.01  *
5.01 c                   if        l_outq = 'E_MAIL_ASP'
5.01 c                   eval      p_kund = fokund
5.61 c                   eval      p_kpro = fokpro
5.02 c                   eval      p_numm = fonumm
5.02 c                   eval      p_selg = foselg
5.01 c                   endif
3.12  *
3.12  *  Hent inn firma/avd. opplysninger dersom
3.12  *  kode for det er satt i rutineregister
3.12  *
5.41 c                   if        l_prfi = 1 or
5.41 c                             l_prfi = 2
5.41 c                   eval      w_prfi = l_prfi
3.12 c                   eval      w_ffir = wwfirm
3.12 c                   eval      w_avde = foavde
3.12  *
3.12 c                   call      'FÅ707R'
3.12 c                   parm                    w_prfi
3.12 c                   parm                    w_ffir
3.12 c                   parm                    w_avde
3.12 c                   parm                    w_fnav
3.12 c                   parm                    w_fad1
3.12 c                   parm                    w_fad2
3.12 c                   parm                    w_fste
3.12 c                   parm                    w_fftx
3.12 c                   parm                    w_tfax
3.12 c                   parm                    w_ftlf
3.12 c                   parm                    w_ffax
6.32 c                   parm                    w_mail
6.32 c                   parm                    w_weba
3.12  *
3.12 c                   eval      a1fnav = w_fnav
3.12 c                   eval      a1fad1 = w_fad1
3.12 c                   eval      a1fad2 = w_fad2
3.12 c                   eval      a1fste = w_fste
3.12 c                   eval      a1fftx = w_fftx
3.12 c                   eval      a1tfax = w_tfax
3.12 c                   eval      a1ftlf = w_ftlf
3.12 c                   eval      a1ffax = w_ffax
3.12 c                   endif
5.22  *
5.22  * Legger inn '/' mellom
5.22  * telefon og telefax
5.22  *
5.22 c                   eval      a1skra =  ' '
5.22 c                   if        a1ftlf <> *blank and
5.22 c                             a1ffax <> *blank
5.22 c                   eval      a1skra =  '/'
5.22 c                   endif
6.27  * Hent inn avdelingsinfo - uavhengig av om dette ligger i firmatagger
6.27 c                   exsr      hnt_avde
      *
      * Skrive heading
      *
pdf  c                   if        b_pdfp = *off
     C                   Z-ADD     0             WLTELL
     C                   WRITE     A1HDR
     C                   WRITE     A2HDR
pdf  c                   else
pdf   * Vi skriver til XML taggene for heading
pdf  c                   exsr      xml_head
pdf  c                   endif
      *
      * Skriv heading over
      * varelinjer
      *
     C**>> VAOSAM        IFEQ      1
     C                   ADD       2             WLTELL
pdf  c                   if        b_pdfp = *off
     C                   WRITE     A4HDR                                30
pdf  c                   endif
     C**>>               ENDIF
5.51  *
5.51  * Skriv ordreinfo 1 og 2
5.51  *
5.51 c**>>               if        vaosam = 1
5.51 c                   if        foinf1 <> *blank or
5.51 c                             foinf2 <> *blank
5.51 c                   eval      wltell = wltell + 1
pdf  c                   if        b_pdfp = *off
5.51 c                   write     a5hdr                                30
pdf  c                   endif
5.51 c                   endif
5.51 c**>>               endif
      *
5.52  *
5.52  * Behandling dersom kjørekontorløsning
5.52  *
5.52  * Er kjørekontorløsning aktivert ?
5.52  *
5.52 c                   if        faakjk <> 1
5.52 c                   goto      xslutt
5.52 c                   endif
5.60  *
5.60 c                   eval      w_kod2 = *blank
5.60 c                   eval      w_aarr = %subdt(fobdat:*years)
5.60 c                   call      'FU706R'
5.60 c                   parm                    w_aarr
5.60 c                   parm                    fonumm
5.60 c                   parm                    fosuff
5.60 c                   parm                    w_kod2
5.60  *
5.60  * Dersom siste kode sier at den er valgt til plukking eller
5.60  * høyere så oppdateres det at plukkliste er kjørt
5.60  *
5.60 c                   if                      w_kod2 =  '2'
5.52  *
5.52  * Oppdaterer loggfile med at
5.52  * plukkliste er kjørt
5.52  *
5.52 c                   eval      d_firm = l_firm
5.52 c                   eval      d_user = l_user
5.52 c                   eval      d_wsid = l_wsid
5.52 c                   eval      d_numm = fonumm
5.52 c                   eval      d_suff = fosuff
5.52 c                   eval      d_kode = '3'
5.52 c                   time                    d_date
5.52 c                   time                    d_time
5.60 c                   eval      d_aarr = %subdt(fobdat:*years)
5.52  *
5.52  * Kaller program for oppdatering
5.52  *
5.52 c                   call      'FU900R'
5.52 c                   parm                    w_stat
5.52 c                   parm                    d_urec
5.52  *
5.60 c                   endif
5.60  *
     C                   GOTO      XSLUTT
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Heading U/L4-brudd                                              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG01A        TAG
      *
      * Skriv heading over
      * varelinjer
      *
     C**>> VAOSAM        IFEQ      1
     C                   ADD       2             WLTELL
pdf  c                   if        b_pdfp = *off
     C                   WRITE     A4HDR                                30
pdf  c                   endif
     C**>>               ENDIF
5.51  *
5.51  * Skriv ordreinfo 1 og 2
5.51  *
5.51 c**>>               if        vaosam = 1
5.51 c                   if        foinf1 <> *blank or
5.51 c                             foinf2 <> *blank
5.51 c                   eval      wltell = wltell + 1
pdf  c                   if        b_pdfp = *off
5.51 c                   write     a5hdr                                30
pdf  c                   endif
5.51 c                   endif
5.51 c**>>               endif
      *
     C                   GOTO      XSLUTT
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * D1DET Behandle detail D1                                        *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG02         TAG
5.51  *
5.51  * Går forbi dersom utskrift skal droppes
5.51  *
5.51 c                   if        w_drop = 1
5.51 c                   goto      xslutt
5.51 c                   endif
      *
      * Nullstilling av variabler
      *
      *
     C                   MOVE      *BLANK        D1VARE
     C                   MOVE      *BLANK        D1TEK1
     C                   MOVE      *BLANK        D1TEK2
     C                   MOVE      *BLANK        D1ENH1
     C                   MOVE      *BLANK        D1TINE
5.51 c                   move      *blank        d1plas
3.32 c                   move      *zero         d1benr
5.22 c                   move      *zero         d1lety
     C                   MOVE      *ZERO         D1ANT0
     C                   MOVE      *ZERO         D1ANT1
     C                   MOVE      *ZERO         D1ANT2
     C                   MOVE      *ZERO         D1ANT3
     C                   MOVE      *OFF          *IN44
     C                   MOVE      *OFF          *IN46
      *
     c                   eval      d2enh1 = *blank
     c                   eval      d2ant0 = *zero
     c                   eval      d2ant1 = *zero
     c                   eval      d2ant2 = *zero
     c                   eval      d2ant3 = *zero
     c                   eval      w_omrl = *zero
     c                   eval      w_omrs = *zero
     c                   eval      w_ant2 = *zero
3.34 c                   eval      d1lass = *zero
5.23 c                   eval      d1lage = *zero
      *
     C                   MOVE      FKSONR        WWNUMM
     C                   MOVE      FKSSUF        WWSUFF
     C                   MOVE      FKSLIN        WWLINE
     C     KEY02         CHAIN     FODTL1R                            62
      *
      * Hent linje-type
      *
     C                   MOVE      FDLTYP        WWLTYP
     C     KEY08         CHAIN     VLTYL1R                            68
      *
      * Sjekker om linjen ikke skrives på ordretypen
      *
     C     FOOTYP        CABEQ     VALO01        XSLUTT
      *
     C     FOOTYP        CABEQ     VALO02        XSLUTT
      *
     C     FOOTYP        CABEQ     VALO03        XSLUTT
      *
     C     FOOTYP        CABEQ     VALO04        XSLUTT
      *
      * Sjekker om tekstlinjer
      *
     C     VALKTX        CABEQ     1             TAG02A
      *
      * Oppslag mot vareregister
      *
     C                   MOVE      FDVARE        WWVARE
     C     KEY11         CHAIN     VVARL1R                            69
5.51  *
5.51  * Oppslag mot lagerregister
5.51  *
7.02 c                   eval      d1behl = 0
5.51 c                   eval      vlagl1_vare = fdvare
5.51 c                   eval      vlagl1_lage = fdlage
5.51 c     vlagl1_key    chain     vlagl1r
5.51 c                   if        %found
5.51 c                   eval      d1plas = vlplas
7.02 c                   eval      d1behl = vlbehl
5.51 c                   endif
      *
      * Sjekk om tilbud/netto-pris
      *
     C     FDSUMR        IFEQ      *ZERO
     C                   MOVE      *ON           *IN46
     C                   MOVE      *BLANK        D1TINE
     C                   MOVE      FDkpri        WWPKOD
     C     KEY19         CHAIN     VPKOL1R                            69
     C     *IN69         IFEQ      *OFF
     C                   MOVE      vaptxt        D1TINE
     C                   END
     C                   END
3.13  *
3.13  * Dersom vare er hentet fra LVR,
3.13  * sett inn  2 desimaler som std.
3.13  *
3.13 c                   if        fdlvre = 1
3.13 c                   eval      vvdesi = 2
3.13 c                   endif
      *
      * Test på antall desimaler
      *
     C     VVDESI        COMP      0                                      40
     C     VVDESI        COMP      1                                      41
     C     VVDESI        COMP      2                                      42
     C     VVDESI        COMP      3                                      43
     C   40              Z-ADD     FDANTA        D1ANT0
     C   41              Z-ADD     FDANTA        D1ANT1
     C   42              Z-ADD     FDANTA        D1ANT2
     C   43              Z-ADD     FDANTA        D1ANT3
      *
      * Varelinje
      *
      *
     C                   MOVE      FDVARE        D1VARE
     C                   MOVEL     FDTEK1        D1TEK1
     C                   MOVEL     FDTEK2        D1TEK2
     C                   MOVE      FDENH1        D1ENH1
3.32 c                   move      fdbenr        d1benr
     C                   Z-ADD     FDsapr        D1BPRI
5.22 c                   z-add     fdlety        d1lety
      *
3.34 c                   eval      d1lass = fdlass
5.23 c                   eval      d1lage = fdlage
      *
      * Beregne snittrabatt
      *
     C     100           SUB       FDRAB1        W1RAB1
     C                   MULT      FDRAB2        W1RAB1
     C                   DIV       100           W1RAB1
     C                   ADD       FDRAB1        W1RAB1
     C                   Z-ADD     W1RAB1        D1RABP
      *
      * Skal mva. beregnes ?
      *
     C     AFMVAK        IFEQ      1
     C                   MOVE      *ON           *IN37
     C     FDsapr        MULT      WPMVAT        D1BPRI
     C                   ENDIF
      *
      * Finne lagerenhet og beregne volum
      * dersom lagerenhet <> salgsenhet
      *
     c                   if        vvenhl <> *blank
     c                   if        vvenhl <> fdenh1
      *
     c                   eval      vvenl1_vare = fdvare
     c                   eval      vvenl1_enhe = vvenhl
     c     vvenl1_key    chain     vvenl1r                            70
      *
     c                   if        *in70  = *off
     c                   eval      w_omrl = veomre
     c                   endif
      *
     c                   eval      vvenl1_vare = fdvare
     c                   eval      vvenl1_enhe = fdenh1
     c     vvenl1_key    chain     vvenl1r                            70
      *
     c                   if        *in70  = *off
     c                   eval      w_omrs = veomre
     c                   endif
      *
     c                   if        w_omrs <> *zero
     c                   if        w_omrl <> *zero
     c                   eval      w_ant2 = (fdanta * w_omrs) / w_omrl
     C   40              eval      d2ant0 = w_ant2
     C   41              eval      d2ant1 = w_ant2
     C   42              eval      d2ant2 = w_ant2
     C   43              eval      d2ant3 = w_ant2
     C                   eval      d2enh1 = vvenhl
     c                   endif
     c                   endif
      *
     c                   endif
     c                   endif
      *
      * Skriv varelinjer
      *
     C     TAG02A        TAG
pdf   *
pdf  c                   if        b_pdfp = *off
pdf   *
     C                   ADD       1             WLTELL
     C     VALKTX        IFNE      1
     C                   WRITE     D1DET                                30
     C                   ELSE
     C                   MOVEL     FDTEK1        D1TEK1
     C                   MOVEL     FDTEK2        D1TEK2
     C                   MOVE      *ON           *IN44
     C                   WRITE     D2DET                                30
     C                   END
      *
      * Er det overflow ?
      *
     C     *IN30         CASEQ     *ON           XOVRFL
     C                   ENDCS
pdf   * Skriver XML tagger for detaljer
pdf  c                   else
pdf  c                   exsr      xml_deta
pdf  c                   endif
      *
5.32 c                   exsr      skr_leng
5.32  *
     C                   GOTO      XSLUTT
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Behandling av tekstlinjer                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
5.51  *
5.51  * Går forbi dersom utskrift skal droppes
5.51  *
5.51 c                   if        w_drop = 1
5.51 c                   goto      xslutt
5.51 c                   endif
      *
     C     TAG03         TAG
      *
     C                   MOVE      FKSONR        WWNUMM
     C                   MOVE      FKSSUF        WWSUFF
     C                   MOVE      FKSLIN        WWLINE
     C     KEY03         CHAIN     FOTXL1R                            63
      *
      * Gå ut dersom det
      * ikke er oppsamling,
      * og linje-nummer er
      * større enn 5000.
      * Da skal print fore-
      * gå tilslutt på L4.
      *
     C     VAOSAM        IFEQ      0
     C     FKSLIN        IFGE      5000
     C                   GOTO      XSLUTT
     C                   END
     C                   ENDIF
      *
     C                   MOVEL     FTTEXT        E1TEXT
pdf  c                   if        b_pdfp = *off
     C                   ADD       1             WLTELL
     C                   WRITE     E1DET                                30
      *
      * Er det overflow ?
      *
     C     *IN30         CASEQ     *ON           XOVRFL
     C                   ENDCS
pdf   * Skriver XML tagger for tekstlinjer
pdf  c                   else
pdf  c                   if        b_topt = *off
pdf  c                   exsr      xml_topt_str
pdf  c                   eval      b_topt = *on
pdf  c                   endif
pdf  c                   exsr      xml_topptxt
pdf  c                   endif
      *
     C     XSLUTT        TAG
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * T1TOT Behandle total T1                                         *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
5.51  *
5.51  * Går forbi dersom utskrift skal droppes
5.51  *
5.51 cl4                 if        w_drop = 1
5.51 cl4                 goto      tag99
5.51 cl4                 endif
      *
      * Finne ut om det er
      * plass til å skrive
      * avslutning uten å
      * skifte til ny side
      * først.
      *
      * Trekker ut heading
      *
     CL4   l_alin        SUB       24            WLTEST
      *
      * Trekker ut antall
      * linjer skrevet
      *
     CL4                 SUB       WLTELL        WLTEST
      *
      * Trekker ut plassbehov
      * for avslutning
      *
     CL4                 SUB       15            WLTEST
      *
      * Skrive ny heading ?
      *
pdf  cl4                 if        b_pdfp = *off
     CL4   WLTEST        IFLT      0
     CL4                 WRITE     A1HDR
     CL4                 WRITE     A2HDR
     CL4                 Z-ADD     0             WLTELL
     CL4                 ENDIF
      *
      * Skrive totalsum
      *
     CL4                 WRITE     T1TOT                                30
pdf  cl4                 endif
      *
      * Skrive tekstlinjer
      * dersom det ikke er
      * oppsamling og linje
      * nummer er større enn
      * 5000.
      *
     CL4   VAOSAM        IFEQ      0
     CL4                 MOVE      FKSONR        WWNUMM
     CL4                 MOVE      FKSSUF        WWSUFF
     CL4                 Z-ADD     5000          WWLINE
     CL4   KEY03         SETLL     FOTXL1R
     CL4                 READ      FOTXL1R                                63
     CL4   *IN63         CABEQ     *ON           TAG99
      *                                                                 .
     CL4   WWNUMM        DOWEQ     FTNUMM
     CL4   WWSUFF        IFEQ      FTSUFF
      *                                                               . .
     CL4                 MOVEL     FTTEXT        E1TEXT
pdf  cl4                 if        b_pdfp = *off
     CL4                 ADD       1             WLTELL
     CL4                 WRITE     E1DET                                30
      *                                                               . .
      * Er det overflow ?                                             . .
      *                                                               . .
     CL4   *IN30         IFEQ      *ON
     CL4                 WRITE     A1HDR
     CL4                 WRITE     A2HDR
     CL4                 Z-ADD     0             WLTELL
     CL4                 ENDIF
pdf   * Skriver XML tagger for tekstlinjer
pdf  cl4                 else
pdf  cl4                 if        b_bott = *off
pdf  cl4                 exsr      xml_bott_str
pdf  cl4                 eval      b_bott = *on
pdf  cl4                 endif
pdf  cl4                 exsr      xml_bunntxt
pdf  cl4                 endif
     CL4                 ENDIF
      *                                                               . .
     CL4                 READ      FOTXL1R                                63
     CL4   *IN63         CABEQ     *ON           TAG99
     CL4                 ENDDO
     CL4                 ENDIF
      *
     CL4   TAG99         TAG
pdf   * Hvis xml gen, må vi kvittere med siste vanlige linjetag
pdf  cl4                 if        b_pdfp = *on
pdf  cl4                 exsr      xml_endpackl
pdf  cl4                 endif
pdf   *
pdf  cl4                 if        b_pdfp = *on
pdf   * Skriv xml fila på disk
pdf  cl4                 exsr      xml_end
pdf   * Hvis forhåndvisning må vi kjøre linken
pdf  cl4                 if        l_skje = 1 and
pdf  c                             l_bach = w_jkey
pdf  cl4                 exsr      pdf_preview
pdf  cl4                 endif
pdf   * Avslutt jobbiden
pdf  cl4                 call      'AB710R'
pdf  cl4                 parm                    l_bach
pdf   * Hvis utskrift av ny plukkliste må vi finne ny id til xml og java
pdf  cl4                 if        *inlr = *off
pdf   *
pdf  cl4                 eval      w_kode = '0'
pdf  cl4                 eval      w_firm = l_firm
pdf  cl4                 eval      w_fell = 'NXTKLI'
pdf  cl4                 eval      w_type = *blank
pdf  cl4                 eval      w_fast = *blank
pdf  cl4                 eval      w_tell = *zero
pdf   *
pdf  cl4                 call      'AS100R'
pdf  cl4                 parm                    w_kode
pdf  cl4                 parm                    w_firm
pdf  cl4                 parm                    w_fell
pdf  cl4                 parm                    w_type
pdf  cl4                 parm                    w_fast
pdf  cl4                 parm                    w_tell
pdf   *
pdf  cl4                 eval      w_jnav = 'PDF' + %char(w_tell)
pdf  cl4                 eval      w_jtext = 'Utskrift av plukkliste har starte+
pdf  c                                       t'
pdf  cl4                 call      'AB700R'
pdf  cl4                 parm                    w_jnav
pdf  cl4                 parm                    w_jkey
pdf  cl4                 parm                    w_txt
pdf   * Vi logger at utskriftprogrammet har startet
pdf  cl4                 eval      w_jstat = 10
pdf  cl4                 eval      w_jtext = 'Utskrift av plukkliste har starte+
pdf  c                                       t'
pdf  cl4                 call      'AB705R'
pdf  cl4                 parm                    l_bach
pdf  cl4                 parm                    w_jstat
pdf  cl4                 parm                    w_jtext
pdf   * Vi skriver xml for miljø formater
pdf  cl4                 exsr      xml_envm
pdf  cl4                 endif
pdf  cl4                 endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Sjekk/Hent tekst for betalingsbetingelser         RS203R       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     SBBETB        BEGSR
      *
     c                   eval      wpcbda = *loval
     c                   eval      wpcfda = *loval
      *
     c                   call      'FÅ703R'
     c                   parm                    wwfirm
     c                   parm                    fobetb
     c                   parm                    wpcbda
     c                   parm                    w_retk
     c                   parm                    wpcfda
     c                   parm                    wpctx1
     c                   parm                    wpctx2
      *
     C                   MOVE      *BLANK        A1BTX1
     C                   MOVE      *BLANK        A1BTX2
      *
     C     w_retk        IFEQ      *BLANK
     C                   MOVEL     WPCTX1        A1BTX1
     C                   MOVEL     WPCTX2        A1BTX2
     C                   ENDIF
      *
     C                   ENDSR
5.32  *
5.32  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
5.32  * Subrutine for utskrift av lengdespesifikasjoner
5.32  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
5.32  *
5.32 c     skr_leng      begsr
5.32  *
5.32 c                   eval      b_flin = *off
5.32  *
5.32 c                   eval      fvlsl1_numm = wwnumm
5.32 c                   eval      fvlsl1_suff = wwsuff
5.32 c                   eval      fvlsl1_line = wwline
5.32 c     fvlsl1_key    setll     fvlsl1
5.32 c     fvlsl1_key    reade     fvlsl1
5.32  *
5.32 c                   dow       not %eof
5.32 c                   if        b_flin = *off
5.32 c                   exsr      skr_l_init
5.32 c                   endif
5.32  *
5.32 c                   eval(h)   w_leng = fvleng
5.32 c                   eval(h)   w_anta = fvanta
5.32 c                   eval      f1text = %char(w_leng) + ' mm x ' +
5.32 c                                      %char(w_anta) + ' stk'
pdf   *
pdf  c                   if        b_pdfp = *off
5.32 C                   write     f1det                                30
5.32 C     *in30         caseq     *on           xovrfl
5.32 C                   endcs
pdf   * Vi skriver til XML taggene for lengdeinformasjon
pdf  c                   else
pdf  c                   exsr      xml_spec
pdf  c                   endif
5.32 c     fvlsl1_key    reade     fvlsl1
5.32 c                   enddo
5.32  *
5.32 c     end_leng      endsr
5.32  *
5.32  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
5.32  * Subrutine for init ved utskrift av lengdespes.
5.32  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
5.32  *
5.32 c     skr_l_init    begsr
5.32  *
5.32 c                   if        valktx <> 1
5.32 c                   if        d1tek2 <> *blank
5.32 c                   eval      f1text = *blank
pdf  c                   if        b_pdfp = *off
5.32 C                   write     f1det                                30
pdf  c                   endif
5.32 C     *in30         caseq     *on           xovrfl
5.32 c                   endcs
5.32 c                   endif
5.32 c                   endif
5.32  *
5.32 c                   eval      b_flin = *on
5.32  *
5.32 c     end_init      endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for overflow                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     XOVRFL        BEGSR
      *
pdf  c                   if        b_pdfp = *off
     C                   WRITE     A1HDR
     C                   WRITE     A2HDR
pdf  c                   endif
      *
     C                   Z-ADD     0             WLTELL
      *
     C                   ENDSR
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for oppstart                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     XSTRSR        BEGSR
      *
     C                   Z-ADD     1             FCYCLE            1 0
      *
      * Legger inn firma i nøkkel
      *
     C                   MOVE      FKSFIR        WWFIRM
      *
      * Hente Kunde-tilbuds-nummer
      *
     C     KEY09         CHAIN     FSTSL1R                            69
      *
     C     *IN69         IFEQ      *OFF
     C                   MOVE      FAAKUN        W0KUND
     C                   END
      *
      * Slår opp ordretype
      *
     C                   MOVE      FKSOTY        WWOTYP
     C     KEY07         CHAIN     VOTYL1R                            67
      *
      * Er ordretype negativ ?
      *
     C     VAOKRE        IFEQ      '-'
     C                   MOVE      *ON           *IN36
     C                   ENDIF
6.18  *
6.18  * Slår opp etter firmainformasjon
6.18  *
6.18 c                   if        afprfi = 1 or
6.18 c                             afprfi = 2
6.18 c     afirl1_key    chain     afirl1r
6.18 c                   endif
      *
     C                   ENDSR
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Miljø variabler         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_envm      begsr
pdf   * Hvis skjermvisning skal vi ikke lagre i spoolfile
pdf  c                   if        l_skje = 1
pdf  c                   eval      w_spol = 'true'
pdf  c                   else
pdf  c                   eval      w_spol = 'false'
pdf  c                   endif
pdf   *
pdf   /Free
pdf        // Finne nytt batch nummer
pdf            UpdHTMLVar('BatchNo':               w_jkey);
pdf            UpdHTMLVar('Batchtype':       'PLUKKLISTE');
pdf            UpdHTMLVar('Username':              l_user);
pdf            WrtSection('Topp');
pdf        // Finn report command variabler
pdf            UpdHTMLVar('User':                l_user);
pdf            UpdHTMLVar('PW':                     ' ');
pdf            UpdHTMLVar('IPAdr':                  ' ');
pdf            UpdHTMLVar('Schema':        'ADB'+l_filg);
pdf            UpdHTMLVar('Companyno':    %char(l_firm));
6.34           UpdHTMLVar('Departmentnoarkiv': %char(l_avde));
pdf            WrtSection('Credential');
pdf        // Finn report command variabler
pdf            UpdHTMLVar('Jaspertemplate':      d_jasm);
pdf            UpdHTMLVar('Logo':           jasper_logo);
pdf            UpdHTMLVar('Keepspool':           w_spol);
pdf            WrtSection('ReportCommand');
pdf   /End-free
pdf   *
pdf   * Hvis skjermvisning skal ikke PDF skrives
pdf   *
pdf  c                   if        l_skje = 0 and
pdf  c                             l_mail = 0
6.21  * Hvis *ARKIV er valgt som skriver, skal det ikke skrives ut
6.21 c                   if        l_utqm <> '*ARKIV'
pdf   *
pdf  c                   if        l_land = 1
pdf  c                   eval      w_land = 'LANDSCAPE'
pdf  c                   else
pdf  c                   eval      w_land = 'PORTRAIT'
pdf  c                   endif
6.13  * Sjekk at valgt outq støttes av skriveren. Kan skli gjennom hvis
6.13  * jobben legges på jobbkø.
6.13 c                   eval      p_ok = '0'
6.13 c                   call      'AP612R'
6.13 c                   parm                    l_filg
6.13 c                   parm                    l_outq
6.13 c                   parm                    p_ok
6.13  * Hvis feil utkø, logges dette i transaksjonsloggen
6.13 c                   if        p_ok = '0'
6.13 c                   eval      w_jstat = 20
6.13 c                   eval      w_jtext = 'Ugyldig utkø '+ l_outq + ' er val+
6.13 c                             gt. Ingen utskrift er generert. Utskrift kan+
6.13 c                              arkiveres.'
6.13 c                   call      'AB705R'
6.13 c                   parm                    l_bach
6.13 c                   parm                    w_jstat
6.13 c                   parm                    w_jtext
6.13 c                   else
pdf   * Hent inn skuffinformasjon for skriveren
6.28 c                   eval      w_dtray = *blank
6.28 c                   eval      w_gtray = *blank
pdf  c                   call      'AP611R'
pdf  c                   parm                    l_filg
pdf  c                   parm                    l_outq
6.28 c                   parm                    w_dtray
6.28 c                   parm                    w_gtray
6.28  * Hent inn skuffinformasjon for skriveren - default inskuff
6.28 c                   eval      w_draw1 = *blank
6.28 c                   movel     w_dtray       w_skuf
6.28 c                   call      'AP614R'
6.28 c                   parm                    l_outq
6.28 c                   parm                    w_skuf
6.28 c                   parm                    w_draw1
6.15  *
6.15 c                   if        l_copy > 0
6.15 c                   eval      w_copy = l_copy
6.15 c                   else
6.15 c                   eval      w_copy = 1
6.15 c                   endif
pdf   *
pdf   /Free
pdf        // Finn print informasjon
pdf            UpdHTMLVar('Printername':         l_outq);
615            UpdHTMLVar('Copies':        %char(w_copy));
pdf            UpdHTMLVar('Papersource':        w_draw1);
pdf            UpdHTMLVar('Lastpagedrawer':         ' ');
pdf            UpdHTMLVar('Duplex':             'false');
pdf            UpdHTMLVar('Quality':                ' ');
pdf            UpdHTMLVar('Sorting':                ' ');
pdf            UpdHTMLVar('Staple':              'true');
pdf            UPDHTMLVar('Alignment':           w_land);
pdf            WrtSection('PrintCommand');
pdf   /End-free
6.13 c                   endif
6.21 c                   endif
pdf  c                   endif
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Heading                 *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_head      begsr
pdf   *
pdf  c                   eval      w_str_in = *blanks
pdf  c                   eval      w_str_out = *blanks
pdf  c                   eval      w_mtxt = *blanks
pdf  c                   eval      x_numm = %char(a1numm)+a1suff
6.23    //               eval      x_vref = %char(a1selg)+' '+a1vref
6.23 c                   eval      w_selgn = %trim(%char(a1selg) + x_mobi)
pdf  c                   eval      x_betb = a1btx1 + ' ' + a1btx2
pdf   *
pdf   * Hvis mail skal skrives, må vi hente mail informasjon
pdf   *
pdf  c                   if        l_mail = 1
pdf  c                   eval      p_kule = 'K'
6.39 c                   if        folkun <> 0
6.39 c                   eval      p_kund = folkun
6.39 c                   else
pdf  c                   eval      p_kund = fokund
6.39 c                   endif
pdf  c                   eval      p_kpro = fokpro
pdf  c                   eval      p_numm = fonumm
6.3a c                   eval      p_suff = fosuff
pdf  c                   eval      p_selg = foselg
pdf  c                   eval      p_in03 = *off
pdf   * Henter ut mailserver
pdf  c                   eval      p_serv = *blank
pdf  c                   eval      p_stat = *blank
pdf  c                   call      'AM705C'
pdf  c                   parm                    p_serv
pdf  c                   parm                    p_stat
pdf   *
7.01 c                   if        u_s701 = *off
pdf   *
pdf  c                   call      'FO798R'
pdf  c                   parm                    p_kule
pdf  c                   parm                    p_kund
pdf  c                   parm                    p_kpro
pdf  c                   parm                    p_numm
6.30 c                   parm                    p_suff
pdf  c                   parm                    p_selg
pdf  c                   parm                    p_navn
pdf  c                   parm                    p_emal
6.30 c                   parm                    p_ema2
6.30 c                   parm                    p_ema3
pdf  c                   parm                    p_emne
pdf  c                   parm                    p_txt1
pdf  c                   parm                    p_txt2
pdf  c                   parm                    p_txt3
pdf  c                   parm                    p_txt4
pdf  c                   parm                    p_pers
6.30 c                   parm                    p_kopi
pdf  c                   parm                    p_inif
pdf  c                   parm                    p_in03
7.01 c                   else
7.01 c                   call      'FM798R'
7.01 c                   parm                    p_kule
7.01 c                   parm                    p_kund
7.01 c                   parm                    p_kpro
7.01 c                   parm                    p_numm
7.01 c                   parm                    p_suff
7.01 c                   parm                    p_selg
7.01 c                   parm                    p_navn
7.01 c                   parm                    p_emal
7.01 c                   parm                    p_ema2
7.01 c                   parm                    p_ema3
7.01 c                   parm                    p_e702
7.01 c                   parm                    p_txt1
7.01 c                   parm                    p_txt2
7.01 c                   parm                    p_txt3
7.01 c                   parm                    p_txt4
7.01 c                   parm                    p_pers
7.01 c                   parm                    p_kopi
7.01 c                   parm                    p_inif
7.01 c                   parm                    p_in03
7.01  *
7.01 c                   endif
6.16  * Scann av strenger
6.16  *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     p_emne        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_pemne
7.01  *
7.01  * Scann av strenger
7.01  *
7.01 c                   movel     p_str_out     w_pe702
7.01 c                   if        u_s701 = *on
7.01 c                   eval      p_str_in = *blank
7.01 c                   eval      p_lr = '0'
7.01 c                   movel     p_e702        p_str_in
7.01 c                   call      'AP613R'
7.01 c                   parm                    p_str_in
7.01 c                   parm                    p_str_out
7.01 c                   parm                    p_lr
7.01 c                   movel     p_str_out     w_pe702
7.01 c                   endif
6.16  * Scann av strenger
6.16  *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     p_txt1        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_ptxt1
6.16  *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     p_txt2        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_ptxt2
6.16  *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     p_txt3        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_ptxt3
6.16  *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     p_txt4        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_ptxt4
6.16  *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     p_pers        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_ppers
6.16  *
6.16 c                   eval      w_mtxt = %trim(w_ptxt1) + crlf +
6.16 c                                      %trim(w_ptxt2) + crlf +
6.16 c                                      %trim(w_ptxt3) + crlf +
6.16 c                                      %trim(w_ptxt4) + crlf +
6.16 c                                      %trim(w_ppers)
6.16 c**                 eval      w_mtxt = %trim(p_txt1) + crlf +
6.16 c**                                    %trim(p_txt2) + crlf +
6.16 c**                                    %trim(p_txt3) + crlf +
6.16 c**                                    %trim(p_txt4) + crlf +
6.16 c**                                    %trim(p_pers)
pdf   *
6.30 c                   if        p_kopi = *blanks
6.30 c                   eval      p_kopi = d_emal
pdf  c                   endif
pdf   *
pdf  c                   if        p_in03 = *off
pdf   *
pdf   /Free
pdf        // Skriv mailinformasjon
6.30           WrtSection('MailCommandStart');
6.30       //  UpdHTMLVar('Receivers':           p_emal);
6.30           if %Trim(p_emal)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_emal);
6.30           WrtSection('MailReceiver');
6.30           endif;
6.30           if %Trim(p_ema2)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_ema2);
6.30           WrtSection('MailReceiver');
6.30           endif;
6.30           if %Trim(p_ema3)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_ema3);
6.30           WrtSection('MailReceiver');
6.30           endif;
pdf            UpdHTMLVar('CC':                     ' ');
6.30           UpdHTMLVar('BCC':                 p_kopi);
6.30           UpdHTMLVar('Sender':              p_kopi);
6.16      //   UpdHTMLVar('Subject':             p_emne);
7.01      //   UpdHTMLVar('Subject':            w_pemne);
7.01           UpdHTMLVar('Subject':            w_pe702);
pdf            UpdHTMLVar('Message':             w_mtxt);
pdf            UpdHTMLVar('SMTPServer':          p_serv);
pdf            UPDHTMLVar('SMTPUser':               ' ');
pdf            UPDHTMLVar('SMTPPw':                 ' ');
6.30       //  WrtSection('MailCommand');
6.30           WrtSection('MailCommandEnd');
pdf   /End-free
pdf  c                   endif
pdf  c                   endif
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Firma
6.12 c                   eval      w_1fnav = *blank
6.12 c                   eval      w_1fad1 = *blank
6.12 c                   eval      w_1fad2 = *blank
6.12 c                   eval      w_1navn = *blank
6.12 c                   eval      w_1gate = *blank
6.12 c                   eval      w_1adr2 = *blank
6.12 c                   eval      w_2navn = *blank
6.12 c                   eval      w_2adr1 = *blank
6.12 c                   eval      w_2adr2 = *blank
6.18 c                   eval      w_rekv = *blank
      *
6.14 c                   eval      p_str_in = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     a1fnav        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_1fnav
      *
6.14 c                   eval      p_str_in = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     a1fad1        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_1fad1
      *
6.14 c                   eval      p_str_in = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     a1fad2        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_1fad2
      *
      * Vi må oversette aktuelle tekster til "xml" tegn - Partner
      *
6.14 c                   eval      p_str_in = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     a1navn        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_1navn
      *
6.14 c                   eval      p_str_in = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     a1gate        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_1gate
      *
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     a1adr2        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_1adr2
      *
6.18 c                   eval      p_lr = '0'
6.18 c                   movel     a1dref        p_str_in
6.18 c                   call      'AP613R'
6.18 c                   parm                    p_str_in
6.18 c                   parm                    p_str_out
6.18 c                   parm                    p_lr
6.18 c                   movel     p_str_out     w_1dref
      *
6.18 c                   eval      p_lr = '0'
6.18 c                   movel     a1vref        p_str_in
6.18 c                   call      'AP613R'
6.18 c                   parm                    p_str_in
6.18 c                   parm                    p_str_out
6.18 c                   parm                    p_lr
6.18 c                   movel     p_str_out     w_1vref
      * Rekvisisjonsnummer
6.18 c                   eval      p_lr = '0'
6.18 c                   movel     forekv        p_str_in
6.18 c                   call      'AP613R'
6.18 c                   parm                    p_str_in
6.18 c                   parm                    p_str_out
6.18 c                   parm                    p_lr
6.18 c                   movel     p_str_out     w_rekv
6.19  * Vise priser ??
6.19 c                   if        *in55 = *on
6.19 c                   eval      w_pris = 'false'
6.19 c                   else
6.19 c                   eval      w_pris = 'true'
6.19 c                   endif
      * Avdelingsinformasjon - navn
6.27 c                   eval      p_str_in = *blank
6.27 c                   eval      p_lr = '0'
6.27 c                   movel     w_dnavn       P_str_in
6.27 c                   call      'AP613R'
6.27 c                   parm                    p_str_in
6.27 c                   parm                    p_str_out
6.27 c                   parm                    p_lr
6.27 c                   movel     p_str_out     w_dnavn
      * Avdelingsinformasjon - adresse
6.27 c                   eval      p_str_in = *blank
6.27 c                   eval      p_lr = '0'
6.27 c                   movel     w_dadr1       P_str_in
6.27 c                   call      'AP613R'
6.27 c                   parm                    p_str_in
6.27 c                   parm                    p_str_out
6.27 c                   parm                    p_lr
6.27 c                   movel     p_str_out     w_dadr1
      * Avdelingsinformasjon - adresse 2
6.27 c                   eval      p_str_in = *blank
6.27 c                   eval      p_lr = '0'
6.27 c                   movel     w_dadr2       P_str_in
6.27 c                   call      'AP613R'
6.27 c                   parm                    p_str_in
6.27 c                   parm                    p_str_out
6.27 c                   parm                    p_lr
6.27 c                   movel     p_str_out     w_dadr2
      * Avdelingsinformasjon - poststed
6.27 c                   eval      p_str_in = *blank
6.27 c                   eval      p_lr = '0'
6.27 c                   movel     w_dpstd       P_str_in
6.27 c                   call      'AP613R'
6.27 c                   parm                    p_str_in
6.27 c                   parm                    p_str_out
6.27 c                   parm                    p_lr
6.27 c                   movel     p_str_out     w_dpstd
      * Poststed-informasjon
6.36 c                   eval      p_str_in = *blank
6.36 c                   eval      p_lr = '0'
6.36 c                   movel     a1fste        P_str_in
6.36 c                   call      'AP613R'
6.36 c                   parm                    p_str_in
6.36 c                   parm                    p_str_out
6.36 c                   parm                    p_lr
6.36 c                   movel     p_str_out     w_csted
pdf   /Free
pdf
pdf        // Skriv firmavariabler
6.22           UpdHTMLVar('Reporttext':            a1txt1);
6.12      //   UpdHTMLVar('CompanyName':           a1fnav);
6.12           UpdHTMLVar('CompanyName':          w_1fnav);
6.12      //   UpdHTMLVar('Companyadress1':        a1fad1);
6.12           UpdHTMLVar('Companyadress1':       w_1fad1);
6.12      //   UpdHTMLVar('Companyadress2':        a1fad2);
6.12           UpdHTMLVar('Companyadress2':       w_1fad2);
pdf            UpdHTMLVar('Companypostalcode':        ' ');
6.36     //    UpdHTMLVar('Companypostoffice':     a1fste);
6.36           UpdHTMLVar('Companypostoffice':    w_csted);
pdf            UpdHTMLVar('Companyphone':          a1ftlf);
pdf            UpdHTMLVar('Companyfax':            a1ffax);
6.26     //    UpdHTMLVar('Companyorgno':   %char(aafftn));
6.26           UpdHTMLVar('Companyorgno':          a1fftx);
615            UpdHTMLVar('Companygiro':    %char(aafbgi));
6.32           UpdHTMLVar('Companyemail':   %trim(w_mail));
6.32           UpdHTMLVar('Companywebpage': %trim(w_weba));
6.27           WrtSection('Company');
6.27
6.27           UpdHTMLVar('Departmentno':    %char(foavde));
6.27           UpdHTMLVar('Departmentname':        w_dnavn);
6.27           UpdHTMLVar('Departmentadress1':     w_dadr1);
6.27           UpdHTMLVar('Departmentadress2':     w_dadr2);
6.27           UpdHTMLVar('Departmentpostalcode':      ' ');
6.27           UpdHTMLVar('Departmentpostoffice':  w_dpstd);
6.27           UpdHTMLVar('Departmentphone':       w_dphon);
6.27           UpdHTMLVar('Departmentfax':         w_dfaxn);
6.27           WrtSection('Department');
pdf
pdf            test(de) *dmy a1bdat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(a1bdat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Creationdate':   %char(tmpdate : *iso));
pdf            test(te) *hms a1time;
pdf            if %error;
pdf            tmptime = *loval;
pdf            else;
pdf            tmptime = %time(a1time : *hms);
pdf            endif;
pdf            UpdHTMLVar('Creationtime': %char(tmptime : *hms));
6.27           WrtSection('Creation');
pdf
pdf        // Skriv partnerinfo (kunde)
pdf            UpdHTMLVar('Partnerno':      %char(a1kund));
pdf            UpdHTMLVar('Partnercategory':%char(a1katg));
6.12       //  UpdHTMLVar('Partnername':           a1navn);
6.12           UpdHTMLVar('Partnername':          w_1navn);
6.12       //  UpdHTMLVar('Partneradress1':        a1gate);
6.12           UpdHTMLVar('Partneradress1':       w_1gate);
6.12       //  UpdHTMLVar('Partneradress2':        a1adr2);
6.12           UpdHTMLVar('Partneradress2':       w_1adr2);
pdf            UpdHTMLVar('Partnerpostalcode':        ' ');
pdf            UpdHTMLVar('Partnerpostoffice':     a1sted);
pdf            UpdHTMLVar('Partnerphone':          a1tlfn);
pdf            UpdHTMLVar('Partnercellphone':      a1mobn);
pdf            UpdHTMLVar('Partnerfax':            rktlfx);
pdf            UpdHTMLVar('Salesdocumentno':       x_numm);
6.18       //  UpdHTMLVar('Partnerrefname':        a1dref);
6.18           UpdHTMLVar('Partnerrefname':       w_1dref);
pdf            UpdHTMLVar('Partnerrefphone':       fomobi);
pdf            UpdHTMLVar('Partnerrefmail':           ' ');
6.18           UpdHTMLVar('Requisitionno':         w_rekv);
pdf            WrtSection('Partner');
pdf
pdf        // Selger informasjon
6.23      //   UpdHTMLVar('Salesrefno':     %char(a1selg));
6.23           UpdHTMLVar('Salesrefno':           w_selgn);
6.18      //   UpdHTMLVar('Salesrefname':          a1vref);
6.18           UpdHTMLVar('Salesrefname':         w_1vref);
6.27           UpdHTMLVar('Salesrefemail':         raiema);
6.27           UpdHTMLVar('Salesrefcellphone':     raimob);
pdf            WrtSection('SalesRef');
pdf   /End-free
6.38  * Sekvens under flyttet
6.27 c                   eval      p_str_in = *blank
6.27 c                   eval      p_lr = '0'
6.27 c                   movel     folmtx        p_str_in
6.27 c                   call      'AP613R'
6.27 c                   parm                    p_str_in
6.27 c                   parm                    p_str_out
6.27 c                   parm                    p_lr
6.27 c                   movel     p_str_out     w_lmtx
      *
6.27 c                   eval      p_str_in = *blank
6.27 c                   eval      p_lr = '0'
6.27 c                   movel     folbtx        p_str_in
6.27 c                   call      'AP613R'
6.27 c                   parm                    p_str_in
6.27 c                   parm                    p_str_out
6.27 c                   parm                    p_lr
6.27 c                   movel     p_str_out     w_lbtx
6.38  * Sekvens flyttet slutt
      *
8.04 c*                  if        %trim(a2navn) <> *blank
8.04 c                   if        %trim(a2navn) <> *blank or
8.04 c                             %trim(a2adr1) <> *blank or
8.04 c                             %trim(a2adr2) <> *blank
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Prosjekt
6.14 c                   eval      p_str_in = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     a2navn        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_2navn
      *
6.14 c                   eval      p_lr = '0'
6.14 c                   eval      p_str_in = *blank
6.14 c                   movel     a2adr1        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_2adr1
      *
6.14 c                   eval      p_str_in = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     a2adr2        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_2adr2
      *
6.36 c                   eval      p_str_in = *blank
6.36 c                   eval      p_lr = '0'
6.36 c                   movel     a2sted        p_str_in
6.36 c                   call      'AP613R'
6.36 c                   parm                    p_str_in
6.36 c                   parm                    p_str_out
6.36 c                   parm                    p_lr
6.36 c                   movel     p_str_out     w_psted
8.02  *
8.02  * Hent totaler for vekt og volum
8.02  *
8.02 c                   eval      w_tvekt = 0
8.02 c                   eval      w_tvolu = 0
8.02  *
8.02 c                   call      'FO780R'
8.02 c                   parm                    w_firm
8.02 c                   parm                    fonumm
8.02 c                   parm                    fosuff
8.02 c                   parm                    w_tvekt
8.02 c                   parm                    w_tvolu
8.02 c                   parm                    b_avvi
pdf   *
pdf   /Free
pdf        // Prosjekt informasjon
pdf            UpdHTMLVar('Projectno':      %char(a1kpro));
6.12       //  UpdHTMLVar('Projectname':           a2navn);
6.12           UpdHTMLVar('Projectname':          w_2navn);
6.12       //  UpdHTMLVar('Projectadress1':        a2adr1);
6.12           UpdHTMLVar('Projectadress1':       w_2adr1);
6.12       //  UpdHTMLVar('Projectadress2':        a2adr2);
6.12           UpdHTMLVar('Projectadress2':       w_2adr2);
pdf            UpdHTMLVar('Projectpostalcode':        ' ');
6.36       //  UpdHTMLVar('Projectpostoffice':     a2sted);
6.36           UpdHTMLVar('Projectpostoffice':    w_psted);
pdf            WrtSection('Project');
pdf   /End-free
pdf  c                   endif
pdf   /Free
6.27           UpdHTMLVar('Currency':              fovalk);
6.27           UpdHTMLVar('Discountcat':    %char(forkat));
6.27           UpdHTMLVar('Agent':          %char(fosped));
6.27           WrtSection('InfoHead1');
8.02
8.02           UpdHTMLVar('Weight':         %char(w_tvekt));
8.02           UpdHTMLVar('Volume':         %char(w_tvolu));
8.04           UpdHTMLVar('Height':                    '0');
8.04           UpdHTMLVar('Lenght':                    '0');
8.04           UpdHTMLVar('Packagecount':              '0');
8.02           WrtSection('Meassurements');
8.02
6.27           UpdHTMLVar('Deliverymethod':              w_lmtx);
pdf            test(de) *dmy a1ldat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(a1ldat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Deliverydate': %char(tmpdate : *iso));
6.27           UpdHTMLVar('Deliverytype':         %char(folety));
6.27           UpdHTMLVar('Deliveryterms':               w_lbtx);
6.27           UpdHTMLVar('Drivingroute':         %char(fokjor));
6.27           WrtSection('DeliveryInfo');

6.27           UpdHTMLVar('District':             %char(fodist));
6.27           UpdHTMLVar('Warehouse':            %char(folage));
6.27           UpdHTMLVar('Documenttype':                footyp);
6.27           UpdHTMLVar('Deliverydate': %char(tmpdate : *iso));
pdf            UpdHTMLVar('Paymentcondition':            x_betb);
6.27           UpdHTMLVar('Deliverymethod':              w_lmtx);
pdf            test(de) *dmy a1bdat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(a1bdat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Orderdate':    %char(tmpdate : *iso));
6.19           UpdHTMLVar('Showprice':                   w_pris);
6.27           WrtSection('InfoHead2');
pdf   /End-free
pdf
pdf   * Vi må legge ut ytligere ordreinfo hvis finnes
pdf  c                   if        %trim(a1inf1) <> *blank or
pdf  c                             %trim(a1inf2) <> *blank
6.20 c                   eval      w_1inf1 = *blank
6.20 c                   eval      w_1inf2 = *blank
6.20  *
6.20 c                   eval      p_str_in = *blank
6.20 c                   eval      p_lr = '0'
6.20 c                   movel     a1inf1        p_str_in
6.20 c                   call      'AP613R'
6.20 c                   parm                    p_str_in
6.20 c                   parm                    p_str_out
6.20 c                   parm                    p_lr
6.20 c                   movel     p_str_out     w_1inf1
6.20  *
6.20 c                   eval      p_str_in = *blank
6.20 c                   eval      p_lr = '0'
6.20 c                   movel     a1inf2        p_str_in
6.20 c                   call      'AP613R'
6.20 c                   parm                    p_str_in
6.20 c                   parm                    p_str_out
6.20 c                   parm                    p_lr
6.20 c                   movel     p_str_out     w_1inf2
pdf   *
pdf   /Free
pdf
6.20     //    UpdHTMLVar('Orderinfo1':            a1inf1);
6.20           UpdHTMLVar('Orderinfo1':           w_1inf1);
6.20     //    UpdHTMLVar('Orderinfo2':            a1inf2);
6.20           UpdHTMLVar('Orderinfo2':           w_1inf2);
pdf            WrtSection('OrderInfo');
pdf
pdf   /End-free
pdf   *
pdf  c                   endif
pdf   *
pdf   /Free
pdf
pdf        //  Legg ut 'heading' på linje
pdf            WrtSection('PicklistLines');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Detaljer                *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_deta      begsr
pdf   * Sørg for at vi har skrevet siste tag for topptext før vi begynner
pdf   * med detaljer.
pdf  c                   if        b_topt = *on
pdf  c                   exsr      xml_topt_end
pdf  c                   eval      b_topt = *off
pdf  c                   endif
pdf   *
6.2B c                   eval      w_lvar = *blank
pdf   *
pdf  c                   if        valktx <> 1
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Varetekster
6.12 c                   eval      w_tek1 = *blank
6.12 c                   eval      w_tek2 = *blank
6.14 c                   eval      p_str_in = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     d1tek1        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_tek1
pdf   *
pdf  c                   if        fdtek2 <> *blank
6.14 c                   eval      p_str_in = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     fdtek2        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_tek2
pdf  c                   endif
6.2B  * Lev.varenummer
6.2B c                   eval      p_str_in = *blank
6.2B c                   eval      p_lr = '0'
6.2B c                   movel     fdlvar        P_str_in
6.2B c                   call      'AP613R'
6.2B c                   parm                    p_str_in
6.2B c                   parm                    p_str_out
6.2B c                   parm                    p_lr
6.2B c                   movel     p_str_out     w_lvar
      *
6.35 c                   eval      w_kamp = *blank
6.35 c                   if        fdkamp <> *blank
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     fdkamp        p_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_kamp
6.35 c                   endif
pdf   * Håndtere riktig antall desimaler
pdf  c                   if        *in40 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant0))
pdf  c                   callp     updHTMLVar('NoDecimals':        '0')
pdf  c                   callp     updHTMLVar('Stockqty':%char(d2ant0))
pdf  c                   callp     updHTMLVar('QtyNoDecimals':     '0')
pdf  c                   elseif    *in41 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant1))
pdf  c                   callp     updHTMLVar('NoDecimals':        '1')
pdf  c                   callp     updHTMLVar('Stockqty':%char(d2ant1))
pdf  c                   callp     updHTMLVar('QtyNoDecimals':     '1')
pdf  c                   elseif    *in42 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant2))
pdf  c                   callp     updHTMLVar('NoDecimals':        '2')
pdf  c                   callp     updHTMLVar('Stockqty':%char(d2ant2))
pdf  c                   callp     updHTMLVar('QtyNoDecimals':     '2')
pdf  c                   elseif    *in43 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant3))
pdf  c                   callp     updHTMLVar('NoDecimals':        '3')
pdf  c                   callp     updHTMLVar('Stockqty':%char(d2ant3))
pdf  c                   callp     updHTMLVar('QtyNoDecimals':     '3')
pdf  c                   endif
8.02  *
8.02  * Hent vekt og volum for linja
8.02  *
8.02 c                   eval      w_vekt = 0
8.02 c                   eval      w_volu = 0
8.02  *
8.02 c                   call      'FO781R'
8.02 c                   parm                    w_firm
8.02 c                   parm                    fonumm
8.02 c                   parm                    fosuff
8.02 c                   parm                    fdline
8.02 c                   parm                    w_vekt
8.02 c                   parm                    w_volu
8.02 c                   parm                    b_avvi
pdf   *
pdf   /Free
8.02       // Freedef tag
8.02           UpdHTMLVar('Lineweight':  %char(w_vekt));
8.02           UpdHTMLVar('Linevolume':  %char(w_volu));
pdf
pdf        // Skriv detaljer
7.02           UpdHTMLVar('Stockqtynow': %char(d1behl));
7.02           UpdHTMLVar('StockQtyNoDecimals':     '2');
6.12       //  UpdHTMLVar('Text1':              d1tek1);
6.12           UpdHTMLVar('Text1':              w_tek1);
6.12       //  UpdHTMLVar('Text2':              d1tek2);
6.12           UpdHTMLVar('Text2':              w_tek2);
pdf            UpdHTMLVar('Itemno':             d1vare);
pdf            UpdHTMLVar('Bookingno':   %char(d1benr));
pdf        //  UpdHTMLVar('Quantity':     %char(d1ant2));
pdf            UpdHTMLVar('Unit':                d1enh1);
pdf            UpdHTMLVar('Stockunit':           d2enh1);
pdf            UpdHTMLVar('Linetype':    %char(d1lety));
pdf            UpdHTMLVar('Storage':     %char(d1lage));
pdf            UpdHTMLVar('Storagelocation':     d1plas);
pdf            UpdHTMLVar('Nobbno':      %char(fdnobb));
pdf            UpdHTMLVar('Cargounit':   %char(d1lass));
6.27           UpdHTMLVar('Currency':           fovalk);
6.27           UpdHTMLVar('Lineno':      %char(fdline));
6.27           UpdHTMLVar('Warehouse':   %char(fdlage));
6.27           test(de) *dmy w_lddt;
6.27           if %error;
6.27           tmpdate = *loval;
6.27           else;
6.27           tmpdate = %date(w_lddt : *dmy);
6.27           endif;
6.27           UpdHTMLVar('Deliverydate': %char(tmpdate : *iso));
6.2B      //   UpdHTMLVar('Partneritemno':       fdlvar);
6.2B           UpdHTMLVar('Partneritemno':%trim(w_lvar));
6.35           UpdHTMLVar('Campaign':            fdkamp);
6.35           UpdHTMLVar('Campaign':     %trim(w_kamp));
6.27           UpdHTMLVar('Gtin':           %char(fdeann));
pdf            WrtSection('Line');
pdf
pdf   /End-free
pdf   *
pdf  c                   else
6.12 c                   eval      w_tek1 = *blank
6.12 c                   eval      w_tek2 = *blank
pdf  c                   movel     fdtek1        d1tek1
pdf  c                   movel     fdtek2        d1tek2
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Tekstlinjer
6.14 c                   eval      p_str_in = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     d1tek1        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_tek1
pdf   *
6.14 c                   eval      p_str_in = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     d1tek2        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_tek2
6.17 c**6.25             eval      w_tek0 = %trim(w_tek1) + ' ' + %trim(w_tek2)
6.25 c                   if        %subst(d1tek1:35:1) = ' ' or
6.25 c                             %subst(d1tek2:1:1) = ' '
6.25 c                   eval      w_tek0 = %trim(w_tek1) + ' ' + %trim(w_tek2)
6.25 c                   else
6.25 c                   eval      w_tek0 = %trim(w_tek1) + %trimr(w_tek2)
6.25 c                   endif
pdf   *
pdf   /Free
6.12      //   UpdHTMLVar('Text1':              d1tek1);
6.17      //   UpdHTMLVar('Text1':              w_tek1);
6.17           UpdHTMLVar('Text1':       %trim(w_tek0));
6.12     //    UpdHTMLVar('Text2':              d1tek2);
6.17           UpdHTMLVar('Text2':                 ' ');
pdf            WrtSection('TextLine');
pdf   /End-free
pdf   *
pdf  c                   endif
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Siste tagg for plukkl   *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_endpackl  begsr
6.24  * Sørg for at vi har skrevet siste tag for topptext før vi begynner
6.24  * med detaljer. Kan forekomme ved utskrift av tomme dokumenter
6.24 c                   if        b_topt = *on
6.24 c                   exsr      xml_topt_end
6.24 c                   eval      b_topt = *off
6.24 c                   endif
pdf   * Sørg for at vi har skrevet siste tag for bunntext før vi fortsetter
pdf  c                   if        b_bott = *on
pdf  c                   exsr      xml_bott_end
pdf  c                   eval      b_bott = *off
pdf  c                   endif
pdf   *
pdf   /Free
pdf        // Skriv siste ordinære linjetagg
pdf            WrtSection('EndPickLines');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Spesifikasjoner         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_spec      begsr
pdf   *
pdf   /Free
pdf        // Skriv spesifikasjoner
pdf            UpdHTMLVar('Text1':    f1text);
pdf            UpdHTMLVar('Text2':       ' ');
pdf
pdf            WrtSection('TextLine');
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Topptekst start         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_topt_str  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('TopTextStart');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Topptekst               *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_topptxt   begsr
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Topptekst
6.14 c                   eval      p_str_in = *blank
6.37 c                   eval      w_tbxt = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     e1text        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.37 c**                 movel     p_str_out     e1text
6.37 c                   movel     p_str_out     w_tbxt
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
6.37    //     UpdHTMLVar('Toptext':     e1text);
6.37           UpdHTMLVar('Toptext':   %trim(w_tbxt));
pdf            WrtSection('TopTextLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Topptekst slutt         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_topt_end  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('TopTextEnd');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Bunntekst start         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_bott_str  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('BottomTextStart');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Bunntekst               *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_bunntxt   begsr
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Bunntekst
6.14 c                   eval      p_str_in = *blank
6.37 c                   eval      w_tbxt = *blank
6.14 c                   eval      p_lr = '0'
6.14 c                   movel     e1text        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.37 c**                 movel     p_str_out     e1text
6.37 c                   movel     p_str_out     w_tbxt
pdf   *
pdf   /Free
pdf        // Skriv bunntekst
6.37   //      UpdHTMLVar('Bottomtext':  e1text);
6.37           UpdHTMLVar('Bottomtext':    %trim(w_tbxt));
pdf            WrtSection('BottomTextLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Bunntekst slutt         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_bott_end  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('BottomTextEnd');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Slutt                   *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_end       begsr
pdf   * Sørg for at vi har skrevet siste tag for bunntext før vi begynner
pdf   * avslutter.
pdf  c                   if        b_bott = *on
pdf  c                   exsr      xml_bott_end
pdf  c                   eval      b_bott = *off
pdf  c                   endif
pdf   *
pdf   /Free
pdf            WrtSection('EndPickDocument');
pdf   /End-free
pdf   *
pdf   * Hvis denne ikke skal arkiveres, lages ikke archive tagg.
pdf   *
pdf  c                   if        l_arch = 1
6.12  * Lag tag for visning i arkivklienten
6.12 c                   eval      w_dspl = *blank
6.12 c                   eval      w_dspl = 'Plukkliste: ' + %char(a1numm) +
8.01 c                             ' Kunde: ' +  %trim(%char(a1kund) + ' - ' +
8.01 c**                           ' Kunde: ' +  %trim(%char(fokund) + ' - ' +
6.12 c                             %trim(a1navn))
6.12  *
6.14 c                   eval      p_str_in = *blank
6.14 c                   eval      p_lr = '1'
6.14 c                   movel     w_dspl        p_str_in
6.14 c                   call      'AP613R'
6.14 c                   parm                    p_str_in
6.14 c                   parm                    p_str_out
6.14 c                   parm                    p_lr
6.14 c                   movel     p_str_out     w_dspl
6.29  * Referansetagg
6.29 c                   eval      w_refn = *blank
6.2A c**                 eval      w_refn = 'PL-' + %char(a1numm) +
6.2A c**                           '-'+ %char(%subdt(w_date:*years))
6.2A c                   eval      w_refn = %char(%subdt(w_date:*years)) +
8.06 c                             %char(a1numm) + '-' + %char(fosuff)
6.29  *
pdf   /Free
pdf        // Skriv metattags
6.12
6.29           UpdHTMLVar('Refno':          %trim(w_refn));
6.12           UpdHTMLVar('Displaytag':     %trim(w_dspl));
pdf            WrtSection('ArchiveCommandStart');
6.12
pdf            UpdHTMLVar('Metavalue':      %char(a1numm));
pdf            UpdHTMLVar('Metakey':   'PLUKKLISTENUMMER');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':      %char(a1kund));
pdf            UpdHTMLVar('Metakey':         'KUNDENUMMER');
pdf            WrtSection('MetaTag');
pdf
6.12           UpdHTMLVar('Metavalue':            w_1navn);
pdf            UpdHTMLVar('Metakey':          'KUNDENAVN');
pdf            WrtSection('MetaTag');
6.12
6.12           UpdHTMLVar('Metavalue':      %char(fonumm));
6.12           UpdHTMLVar('Metakey':        'ORDRENUMMER');
6.12           WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':             l_user);
pdf            UpdHTMLVar('Metakey':             'BRUKER');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue': %char(w_date:*iso));
pdf            UpdHTMLVar('Metakey':               'DATO');
pdf            WrtSection('MetaTag');
6.22
6.22           UpdHTMLVar('Metavalue':             a1txt1);
6.22           UpdHTMLVar('Metakey':         'RUTINETEKST');
6.22           WrtSection('MetaTag');
6.29
6.29           UpdHTMLVar('Metavalue':             l_ruti);
6.29           UpdHTMLVar('Metakey':             'RUTINE');
6.29           WrtSection('MetaTag');
6.29
6.29           UpdHTMLVar('Metavalue':      %char(l_firm));
6.29           UpdHTMLVar('Metakey':              'FIRMA');
6.29           WrtSection('MetaTag');
6.29
6.29           UpdHTMLVar('Metavalue':             l_wsid);
6.29           UpdHTMLVar('Metakey':             'SKJERM');
6.29           WrtSection('MetaTag');
pdf
pdf            WrtSection('ArchiveCommandEnd');
pdf   /End-free
8.07  *
8.07  * Skriv inn i tabell for bruk til søk i arkiv.
8.07  *
8.07         exec sql
8.07         insert into xlkost
8.07           (xofirm,xoyear,xodocn,xosuff,xobatc,
8.07            xobatt,xorefn,xostmp)
8.07         values(:w_firm,:w_year,:a1numm,:fosuff,:w_jkey,
8.07                'PLUKKLISTE',:w_refn,:w_stmp);
8.07         commit;
8.07  *
pdf   *
pdf  c                   endif
pdf   *
pdf   /Free
pdf            WrtSection('Footer');
pdf   /End-free
pdf   *
pdf  c                   eval      XML_Output = XML_path + l_filg +'/'+
pdf  c                             'Plukk_'+ %trim(w_jkey) + '.xml'
pdf   *
pdf  c                   callp     WrtHtmlToStmf(XML_Output: 819)
6.33  * Skriver til datakø for å aktivere sniffer, hvis dataq er aktiv
6.33 c                   if        d_dtaq = '1'
6.33 c                   eval      p_xmlf = xml_output
6.33 c                   eval      p_filg = 'ADB'+l_filg
6.33 c                   call      'AP629C'
6.33 c                   parm                    p_filg
6.33 c                   parm                    p_xmlf
6.33 c                   endif
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Skjermvisning           *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     pdf_preview   begsr
pdf   *
pdf   * Vi kaller program for launch av PDF i browser
pdf  c                   call      'AP621R'
pdf  c                   parm                    w_jkey
pdf   *
pdf  c                   endsr
pdf   *
6.27  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.27  * Subrutiner for XML/jasper integrasjon - Detaljer                *
6.27  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.27 c     hnt_avde      begsr
6.27  * Hent inn avdelingsinformasjon
6.27 c
6.27 c                   eval      w_ddeno = foavde
6.27 c                   eval      w_dnavn = *blank
6.27 c                   eval      w_dadr1 = *blank
6.27 c                   eval      w_dadr2 = *blank
6.27 c                   eval      w_dpcde = *zeros
6.27 c                   eval      w_dpstd = *blank
6.27 c                   eval      w_dphon = *blank
6.27 c                   eval      w_dfaxn = *blank
6.27  *
6.27 c                   eval      ra07pf_avde = foavde
6.27 c     ra07pf_key    chain     ra07pfr                            90
6.27 c                   if        *in90  = *off
6.27 c                   eval      w_dnavn = ragtxt
6.27 c                   eval      w_dadr1 = ragadr
6.27 c                   eval      w_dadr2 = ragad2
6.27 c                   eval      w_dpcde = ragpnr
6.27 c                   eval      w_dpstd = (%char(ragpnr) + ' ' + ragste)
6.27 c                   if        ragtlf <> *blank
6.27 c                   eval      w_dphon = ragtlf
6.27 c                   endif
6.27 c                   if        ragfax <> *blank
6.27 c                   eval      w_dfaxn = ragfax
6.27 c                   endif
6.27 c                   endif
6.27  *
6.27 c                   endsr
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     *INZSR        BEGSR
5.01  *
5.01  * Parametre
5.01  *
5.01 c     *entry        plist
5.01 c                   parm                    p_mail
5.01 c                   parm                    p_kund
5.61 c                   parm                    p_kpro
5.02 c                   parm                    p_numm
5.02 c                   parm                    p_selg
      *
     C     *LIKE         DEFINE    A1BTX1        WPCTX1
     C     *LIKE         DEFINE    A1BTX2        WPCTX2
     C     *LIKE         DEFINE    FAAKUN        W0KUND
     C     *LIKE         DEFINE    VAOTYP        WWOTYP
     C     *LIKE         DEFINE    FOKUND        WWKUND
     C     *LIKE         DEFINE    FOFIRM        WWFIRM
     C     *LIKE         DEFINE    FOWSID        WWWSID
     C     *LIKE         DEFINE    FONUMM        WWNUMM
     C     *LIKE         DEFINE    FOSUFF        WWSUFF
     C     *LIKE         DEFINE    FDLINE        WWLINE
     C     *LIKE         DEFINE    FDLTYP        WWLTYP
     C     *LIKE         DEFINE    VAPKOD        WWPKOD
     C     *LIKE         DEFINE    FDNUMM        SANUMM
     C     *LIKE         DEFINE    VVVARE        WWVARE
      *
     C     *LIKE         DEFINE    FDsapr        W1RAB1
      *
      *
      *
      *
     C     *LIKE         DEFINE    FDsapr        D1BPRI
     C     *LIKE         DEFINE    FDRAB1        D1RABP
      *
      *
      *
      *  Nullstilling av felter som ikke kan redefineres
      *
     C                   MOVE      *BLANK        w_retk            1
     C                   MOVE      *BLANK        D1TINE            4
      *
     C                   MOVE      *ZERO         WPMVAS            6 2
     C                   MOVE      *ZERO         WPMVAT            5 4
     C                   MOVE      *ZERO         WPMVAF           10 9
      *
     C                   MOVE      *BLANK        WWRUTI           10
     C                   MOVE      *ZERO         WLTELL            3 0
     C                   MOVE      *ZERO         WLTEST            3 0
6.23  * Key for posisjonering på selgere
6.23  *
6.23 c     ra09l1_key    klist
6.23 c                   kfld                    wwfirm
6.23 c                   kfld                    ra09l1_ikod
      *
      * Key for Heading-file
      *
     C     KEY01         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWNUMM
     C                   KFLD                    WWSUFF
      *
      * Key for Detalj-file
      *
     C     KEY02         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWNUMM
     C                   KFLD                    WWSUFF
     C                   KFLD                    WWLINE
      *
      * Key for Tekst-linjer
      *
     C     KEY03         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWNUMM
     C                   KFLD                    WWSUFF
     C                   KFLD                    WWLINE
      *
      * Key for kunderegister
      *
     C     KEY04         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWKUND
      *
      * Key for firmaregister
      *
     C     KEY06         KLIST
     C                   KFLD                    WWFIRM
      *
      * Key for ordretyper
      *
     C     KEY07         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWOTYP
      *
      * Key for linjetyper
      *
     C     KEY08         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWLTYP
      *
      * Key for statusregister
      *
     C     KEY09         KLIST
     C                   KFLD                    WWFIRM
      *
      * Key for formular-register
      *
     C     KEY10         KLIST
     C                   KFLD                    WWRUTI
      *
      * Key for vare-register
      *
     C     KEY11         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWVARE
      *
      * Key for vare-enhets-register
      *
     C     vvenl1_key    klist
     C                   kfld                    wwfirm
     C                   kfld                    vvenl1_vare
     C                   kfld                    vvenl1_enhe
      *
      * Key for priskode-register
      *
     C     KEY19         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWPKOD
5.32  *
5.32  * Key for oppslag på lengdespesif.linje
5.32  *
5.32 c     fvlsl1_key    klist
5.32 c                   kfld                    wwfirm
5.32 c                   kfld                    fvlsl1_numm
5.32 c                   kfld                    fvlsl1_suff
5.32 c                   kfld                    fvlsl1_line
5.42  *
5.42  * Key for oppslag på kundeprosjekt
5.42  *
5.42 c     fkprl1_key    klist
5.42 c                   kfld                    wwfirm
5.42 c                   kfld                    fkprl1_kund
5.42 c                   kfld                    fkprl1_kpro
5.51  *
5.51  * Key for oppslag på lager
5.51  *
5.51 c     vlagl1_key    klist
5.51 c                   kfld                    wwfirm
5.51 c                   kfld                    vlagl1_vare
5.51 c                   kfld                    vlagl1_lage
6.15  *
6.15  * Key for firmaregister
6.15  *
6.15 c     afirl1_key    klist
6.15 c                   kfld                    wwfirm
6.27  *
6.27  * Key for oppslag på avdelings-register
6.27  *
6.27 c     ra07pf_key    klist
6.27 c                   kfld                    w_firm
6.27 c                   kfld                    ra07pf_avde
      *
      * Hente inn rutinenavn
      * og meldingstekst
      *
     C                   MOVE      l_ruti        WWRUTI
      *
     C     KEY10         CHAIN     AFORL1R                            69
     C  N69              MOVE      AFTXT1        A1TXT1
      **N69              MOVE      AFMLD1        T1MLD1
5.01  *
5.01  * Sjekker om dette skal sendes
5.01  * som e-mail
5.01  *
5.01 c                   if        l_outq = 'E_MAIL_ASP'
5.01 c                   eval      p_mail = 'J'
5.01 c                   endif
pdf   *
pdf   * Sjekk om vi skal bruke JASPER og XML generering av dokumenter
pdf  c                   if        l_poff = '1'
pdf  c                   eval      b_pdfp = *off
pdf  c                   eval      b_topt = *off
pdf  c                   eval      b_bott = *off
pdf  c                   eval      w_pdf = 0
pdf  c                   eval      w_pdf_ds = *blanks
pdf  c                   eval      w_ruti = l_ruti
pdf   *
pdf  c                   call      'AP609R'
pdf  c                   parm                    w_ruti
pdf  c                   parm                    w_pdf
pdf  c                   parm                    w_pdf_ds
pdf  c                   eval      d_pdf_ds = w_pdf_ds
pdf   * Vi skal kjøre med jasper
pdf  c                   if        w_pdf = 1 and
pdf  c                             %trim(d_xmlm) <> *blanks
pdf  c                   eval      p_mail = '0'
pdf  c                   eval      w_jkey = l_bach
pdf   *
pdf   * Hent inn xml templaten
pdf   *
pdf  c                   callp     GetHTMLIFS(d_xmlm :'<AS400>')
6.2C c                   callp     ClrHtmlBuffer
pdf   *
pdf   * Finn hvor xml'en skal legges
pdf   *
pdf  c                   eval      XML_path = *blanks
pdf  c                   eval      XML_path = %trim(d_path)
pdf   *
pdf   * Finn path til logo
pdf   *
pdf  c                   eval      jasper_logo = *blanks
pdf  c                   eval      jasper_logo = %trim(d_logo)
pdf   *
pdf   * Jobbnummer er allerede generert i AP600R. Overføres i *lda
pdf   *
pdf  c                   time                    w_date
8.07 c                   eval      w_year = %subdt(w_date:*years)
8.07 c                   time                    w_stmp
pdf   * Vi logger ar utskriftprogrammet har startet
pdf  c                   eval      w_jstat = 10
pdf  c                   eval      w_jtext = 'Utskrift av pakkseddel har starte+
pdf  c                                       t'
pdf  c                   call      'AB705R'
pdf  c                   parm                    l_bach
pdf  c                   parm                    w_jstat
pdf  c                   parm                    w_jtext
pdf   * Vi skriver xml for miljø formater
pdf  c                   exsr      xml_envm
pdf  c                   eval      b_pdfp = *on
pdf   *
pdf  c                   endif
pdf   * Hvis et eller annet er galt med parametrene, logges og kjør uten PROA
pdf  c                   if        %trim(d_xmlm) = *blanks
pdf  c                   eval      b_pdfp = *off
pdf   * Vi logger at noe er galt med parametrene
pdf  c                   eval      w_jstat = 20
pdf  c                   eval      w_jtext = 'Finner ikke path til xml !!! +
pdf  c                             Sjekk rutineregister !'
pdf  c                   call      'AB705R'
pdf  c                   parm                    l_bach
pdf  c                   parm                    w_jstat
pdf  c                   parm                    w_jtext
pdf  c                   endif
pdf   *
pdf  c                   else
pdf  c                   eval      b_pdfp = *off
pdf  c                   endif
7.01  *
7.01  * Kaller spesielt mailprogram med logikk
7.01  *
7.01   CallP CO402R(l_filg:w_firm:0:'SPESIAL_MAILLOGIKK':
7.01   co402_verdi1:co402_verdi2);
7.01   if co402_verdi1 = '1';
7.01     u_s701 = *on;
7.01   endif;
7.01  *
      *
     C                   ENDSR
      *
