      /TITLE  ASOFAK: Skriver hylle etiketter
     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FP218R
      * Beskrivelse . . : Skriver hylle etiketter - 48x38 mm
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       250499 KOB  Nytt program - varetekst 1 & 2 = 20 pos.
      * V3.30 231200 KOB  Lagt inn støtte for Eltron-skriver
      * V3.30 010501 KOB  Lagt inn støtte for Meto mi-4
      * V5.00 040303 JAF  Meto mi-4 ta HEAT og PRTSPEED fra
      *                   styrestreng 1 og 2 i Enhetsreg
      * V5.50 030507 KOB  Utvidet lagerplass til 8 poisjoner
      * V5.50 110607 KOB  Fjernet støtte for Eltron-skriver
      * V5.60 210109 KOB  Lagt inn støtte for Datamax EX-2 som egen skrivertype
6.10  * V6.10 151211 bsa  Diverse justeringer
6.11  * V6.10 240112 bsa  Feiler ved alfanumeriske lev.varenummer
6.30  * 6.30  280514 BKV  LVAR økt fra 15 til 20
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvaw1pf    if   f  512    64aidisk
      *
     fEtikett   o    f  132        Printer oflind(*inof)
     *
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *               :  LOCAL DATA AREA                                 +
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     D                uds
     *
     d l_hex1                760    779
     d l_hex2                780    799
     d lctype                891    891  0
     d lcuser                911    920
     d lcfirm                944    946  0
     d l_fnav                951    980
     *
      * Definering av variable
      *
     d w_skty          s                   like(lctype)
     d w_hyle          s                   like(vahyle)
      *
     d w_best          s              7
     d w_dato          s              8
     d*w_altv          s             15
     d w_altv          s             10
     d w_leng          s              2  0
     d w_lvar          s             15
     d w_lvar_5        s              5  0
     d w_lvar_6        s              6  0
     d w_lvar_7        s              7  0
     d w_lvar_8        s              8  0
     d w_lvar_u        s             21
     d w_tek1          s             20
     d w_tek2          s             20
      *
     d digits          c                   ' 0123456789'
      *
     d w_anta_1        s              1  0
     d w_anta_2        s              2  0
     d w_anta_3        s              3  0
      *
     ivaw1pf    ns  01
      *
     i                                  1    4 0vaanta
     i                                  5   19  vattxt
     i                                 20   25  vatvar
     i                                 26   30  vatenh
     i                                 31   37  vatpri
     i                                 38   45  vadato
     i                                 46   53 0vanobb
     i                                 59   66 0vavare
     i                                 74   86 0vaeann
     i                                 87  101  valvar
6.30 i                                107  141  vatek1
6.30 i                                142  176  vatek2
6.30 i                                177  179  vaenh1
6.30 i                                180  187  vapri1
6.30 i                                188  190  vaenh2
6.30 i                                191  198  vapri2
6.30 i                                199  203  vabesk
6.30 i                                204  208 0vabpun                          Bestillingspunkt
6.10 i* Legges ut med en des i utpl   204  208 0vabmen                          Bestillingsmengde
6.30 i                                209  212 0vabmen                          Bestillingsmengde
6.30 i                                214  214 0vahyle                          Type etikett
6.30 i                                215  215 0valvko                          Skriv i div. felt
6.30 i                                216  223  vaplas                          Lagerplass
6.30 i                                224  224 0vaetyp                          Etikettype
6.30 i                                225  227  vamini                          Minimumsbeholdn.(L)
6.30 i                                228  230  vamaks                          Maksimumbeholdn.(L)
6.30 i                                231  231  vavtyp                          Varetype
6.30 i                                232  234  vaenin                          Bestillingsenhet
6.30 i                                235  237  vaenps                          Sammenligningsenhet
6.30 i                                238  245  vapspr                          Pris sammenligning
      *
     i                                256  256  vadumy
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   read      vaw1pf                                 61
      *
     c                   dow       *in61 = *off
      *
      * Sjekk om riktig etikettype
      *
     c                   if        vaetyp <> 6
     c                   goto      neste
     c                   endif
      *
     c                   if        *in60 = *off
      *
     c                   eval      w_hyle = 9
      *
      * Hent skriverinformasjon
      *
     c                   eval      w_skty = lctype
      *
      * Skrivertype Meto 8100 Twinax
      *
     c     w_skty        ifeq      0
     c                   except    Æclr0
     c                   endif
      *
      * Skrivertype Meto 8100 Standard
      *
     C     w_skty        ifeq      1
     c                   except    Æclr1
     c                   endif
      *
      * Skrivertype Meto Bandit
      *
     c     w_skty        ifeq      2
     c                   except    Æpgm2
     c                   endif
      *
     c                   eval      *in60 = *on
      *
     c                   endif
      *
     c                   eval      w_dato = vadato
      *
      * Klargjør varetekst
      *
     c                   movel     vatek1        w_tek1
     c                   movel     vatek2        w_tek2
      *
      * Klargjør alternativt varenummer
      *
     c                   select
     c                   when      valvko = 1
     c                   movel     valvar        w_altv
     c                   when      valvko = 2
     c                   movel     vavare        w_altv
     c                   when      valvko = 3
     c                   movel     vanobb        w_altv
     c                   other
     c                   move      *blank        w_altv
     c                   endsl
      *
      * Klargjør bestillingsdata
      *
     c***                eval      w_best = vabpun+'-'+vabmen
      *
      * Sjekk om lev.varenr. er nummerisk
      * og flytt til felt med riktig lengde
      *
     c     digits        check     valvar                                 90
      *
     c                   if        *in90 = *on
     c                   move      *zeros        w_lvar
6.10 c                   else
6.10 c                   eval      w_lvar = %trim(valvar)
     c                   endif
      *
      * Finn lengden på lev-varenummer
      *
     c                   move      *off          *in35
     c                   move      *off          *in36
     c                   move      *off          *in37
     c                   move      *off          *in38
     c                   move      *off          *in39
      *
6.10 c**                 eval      w_lvar = %trim(valvar)
6.10 c**                 eval      w_leng = %len(%trim(valvar))
6.10 c                   eval      w_leng = %len(%trim(w_lvar))
      *
     c                   select
     c                   when      w_leng = 5
     c                   movel     w_lvar        w_lvar_5
     c                   move      *on           *in35
     c                   when      w_leng = 6
     c                   movel     w_lvar        w_lvar_6
     c                   move      *on           *in36
     c                   when      w_leng = 7
     c                   movel     w_lvar        w_lvar_7
     c                   move      *on           *in37
     c                   when      w_leng = 8
     c                   movel     w_lvar        w_lvar_8
     c                   move      *on           *in38
     c                   other
     c                   movel     w_lvar        w_lvar_u
     c                   move      *on           *in39
     c                   endsl
      *
      * Legg ut nytt program
      * hvis skifte av etikettype
      *
     c                   if        vahyle <> w_hyle
      *
      * Valg av strekkode
      *
     c                   eval      *in20 =*off
     c                   eval      *in21 =*off
     c                   eval      *in22 =*off
     c                   eval      *in23 =*off
      *
     c                   select
     c                   when      vahyle = 0
     c                   eval      *in20 =*on
     c                   when      vahyle = 1
     c                   eval      *in21 =*on
     c                   when      vahyle = 2
     c                   eval      *in22 =*on
     c                   when      vahyle = 3
     c                   eval      *in23 =*on
     c                   endsl
      *
      * Skrivertype Meto 8100 Twinax
      *
     c     w_skty        ifeq      0
     c                   except    Æpgm0
     c                   endif
      *
      * Skrivertype Meto 8100 Standard
      *
     c     w_skty        ifeq      1
     c                   except    Æpgm1
     c                   endif
      *
     c                   eval      w_hyle = vahyle
      *
     c                   endif
      *
      * Skrivertype Meto 8100 Twinax
      *
     c     w_skty        ifeq      0
     c                   eval      w_lvar_u = %trim(w_lvar) + '&0D&04'
     c                   except    Ædata0
     c                   endif
      *
      * Skrivertype Meto 8100 Standard
      *
     c     w_skty        ifeq      1
     c                   eval      w_lvar_u = %trim(w_lvar) + '\!'
     c                   except    Ædata1
     c                   endif
      *
      * Skrivertype Meto Bandit
      *
     c     w_skty        ifeq      2
     c                   eval      w_lvar_u = %trim(w_lvar) + '"'
      *
     c                   eval      *in81 = *off
     c                   eval      *in82 = *off
     c                   eval      *in83 = *off
      *
     c                   select
     c                   when      vaanta <= 9
     c                   eval      w_anta_1 = vaanta
     c                   eval      *in81 = *on
     c                   when      vaanta <= 99
     c                   eval      w_anta_2 = vaanta
     c                   eval      *in82 = *on
     c                   when      vaanta <= 500
     c                   eval      w_anta_3 = vaanta
     c                   eval      *in83 = *on
     c                   other
     c                   eval      w_anta_3 = 500
     c                   eval      *in83 = *on
     c                   endsl
      *
     c                   except    Ædata2
     c                   endif
      *
      * Skrivertype Meto mi-4
      *
     c     w_skty        ifeq      4
     c                   except    Ædata4
     c                   endif
      *
      * Skrivertype Datamax Ex-2 (Bruker samme utskrift som  Meto mi-4)
      *
     c     w_skty        ifeq      6
     c                   eval      *in66 = *on
     c                   except    Ædata4
     c                   endif
      *
     c     neste         tag
      *
     c                   read      vaw1pf                                 61
     c                   enddo
      *
     c                   goto      avslutt
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Ami-4tt
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c     w_skty        ifeq      2
     c                   except    Æend2
     c                   endif
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
      *
      * Twinax-skriver
      *                                                                ***
     oEtikett   e            Æclr0
      *
      * Halo printer here am I, are you ready?
      *
     o                                              '&02&20&03'
      *
      * Clear LLU 000005
      *
     o          e            Æclr0
     o                                              '&02&53000005&03'
      *
      * Clear PGM-buffer 05
      *
     o          e            Æclr0
     o                                              '&02&5405&03'
      *
      * Program
      *
     o          e            Æpgm0
     o                                              '&02&4405102'
     o                                              '&04'
      *
      * Varetekst 1
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D003003020015112'
     o                                              '&04'
      *
      * Varetekst 2
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D006003020015112'
     o                                              '&04'
      *
      * Bestillingsinformasjon
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D010004007006112'
     o                                              '&04'
      *
      * Alternativt varenummer
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D010019015006112'
     o                                              '&04'
      *
      * Dato
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D010044008006122'
     o                                              '&04'
      *
      * Lagerplass
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D015003006006122'
     o                                              '&04'
      *
      * Priskode
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D014026005006112'
     o                                              '&04'
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Æpgm0
     o                                              '&02'
     o                                              '&0D0260100000101115200'
     o                                              '&04'
      *
      * "Bar-code" (Lev. varenr.)
      *
     O          e    21      Æpgm0
     o                                              '&02'
     o                                              '&0D0260100000101115200'
     o                                              '&04'
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Æpgm0
     o                                              '&02'
     o                                              '&0D0260050080101111200'
     o                                              '&04'
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Æpgm0
     o                                              '&02'
     o                                              '&0D0260100000100116200'
     o                                              '&04'
      *
      * Pris1
      *
     O          e            Æpgm0
     o                                              '&02'
     o                                              '&0D019007008009612'
     o                                              '&04'
      *
      * Dummy
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D001001001006112'
     o                                              '&04'
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&03'
      *
      * Write data to  LLU-000005
      *
     o          e            Ædata0
     o                                              '&02&4300000505&0D'
     o                                              '&04'
      *
      * Varetekst 1
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_tek1
     o                                              '&0D'
     o                                              '&04'
      *
      * Varetekst 2
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_tek2
     o                                              '&0D'
     o                                              '&04'
      *
      * Bestillingsinformasjon
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_best
     o                                              '&0D'
     o                                              '&04'
      *
      * Alternativt varenummer
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_altv
     o                                              '&0D'
     o                                              '&04'
      *
      * Dato
      *
     O          e            Ædata0
     o                                              '&02'
     O                       w_dato
     o                                              '&0D'
     o                                              '&04'
      *
      * Lagerplass
      *
     O          e            Ædata0
     o                                              '&02'
     O                       vaplas
     o                                              '&0D'
     o                                              '&04'
      *
      * Priskode
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vabesk
     o                                              '&0D'
     o                                              '&04'
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Ædata0
     o                                              '&02'
     o                       vavare
     o                                              '&0D'
     o                                              '&04'
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     o          e    21      Ædata0
     o                                              '&02'
     o                       w_lvar_u
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Ædata0
     o                                              '&02'
     O                       vaeann
     o                                              '&0D'
     o                                              '&04'
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Ædata0
     o                                              '&02'
     o                       vanobb
     o                                              '&0D'
     o                                              '&04'
      *
      * Pris1
      *
     O          e            Ædata0
     o                                              '&02'
     O                       vapri1
     o                                              '&0D'
     o                                              '&04'
      *
      * Dummy
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vadumy
     o                                              '&0D'
     o                                              '&04'
      *
     o          e            Ædata0
     o                                              '&02'
     o                                              '&0D'
     o                                              '&03'
      *
     o          e            Ædata0
      * Write data to label
     o                                              '&02&66'
     o                       vaanta
     o                                              '&03'
      *
      * Behandle standard-skriver
      *                                                                ***
     O          e            Æclr1
     O                                              '{ & } '
      *
      * Clear LLU 000005
      *
     O          e            Æclr1
     O                                              '{&S000005} '
      *
      * Clear PGM-buffer 05
      *
     O          e            Æclr1
     O                                              '{&T05} '
      *
      * Program
      *
     O          e            Æpgm1
     O                                              '{&D05102'
     O                                              '! '
      *
      * Varetekst 1
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\002003020000312'
     O                                              '! '
      *
      * Varetekst 2
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\007003020000112'
     O                                              '! '
      *
      * Bestillingsinformasjon
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\010003007006112'
     O                                              '! '
      *
      * Alternativt varenummer
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\010020015006112'
     O                                              '! '
      *
      * Dato
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\012042008006122'
     O                                              '! '
      *
      * Lagerplas
      *
     o          e            Æpgm1
     O                                              '{'
     o                                              '\017003006006222'
     O                                              '! '
      *
      * Priskode
      *
     o          e            Æpgm1
     O                                              '{'
     o                                              '\014026005006212'
     O                                              '! '
      *
      * "Bar-code" (Eget varenr.)
      *
     O          e    20      Æpgm1
     O                                              '{'
     O                                              '\0260100000101115200'
     O                                              '! '
      *
      * "Bar-code" (Lev. varenr.)
      *
     O          e    21      Æpgm1
     O                                              '{'
     O                                              '\0260100000101115200'
     O                                              '! '
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Æpgm1
     O                                              '{'
     O                                              '\0260050080101111200'
     O                                              '! '
      *
      * "Bar-code" (Nobb-nr.)
      *
     O          e    23      Æpgm1
     O                                              '{'
     O                                              '\0260100000100116200'
     O                                              '! '
      *
      * Pris1
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\019007008009612'
     O                                              '! '
      *
      * Dummy
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\001001001006112'
     O                                              '! '
     O          e            Æpgm1
     O                                              '{\\\\\\\\\\}'
      *
      * Write data to  LLU-000005
      *
     O          e            Ædata1
     O                                              '{&C00000505\'
     O                                              '! '
      *
      * Varetekst 1
      *
     O          e            Ædata1
     O                                              '{'
     O                       w_tek1
     O                                              '\'
     O                                              '! '
      *
      * Varetekst 2
      *
     O          e            Ædata1
     O                                              '{'
     O                       w_tek2
     O                                              '\'
     O                                              '! '
      *
      * Bestillingsinformasjon
      *
     O          e            Ædata1
     O                                              '{'
     O                       w_best
     O                                              '\'
     O                                              '! '
      *
      * Alternativt varenummer
      *
     O          e            Ædata1
     O                                              '{'
     O                       w_altv
     O                                              '\'
     O                                              '! '
      *
      * Dato
      *
     O          e            Ædata1
     O                                              '{'
     O                       w_dato
     O                                              '\'
     O                                              '! '
      *
      * Lagerplass
      *
     O          e            Ædata1
     O                                              '{'
     O                       vaplas
     O                                              '\'
     O                                              '! '
      *
      * Priskode
      *
     O          e            Ædata1
     O                                              '{'
     O                       vabesk
     O                                              '\'
     O                                              '! '
      *
      * "Bar-code" (Eget varenr.)
      *
     O          e    20      Ædata1
     O                                              '{'
     O                       vavare
     O                                              '\'
     O                                              '! '
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     O          e    21      Ædata1
     O                                              '{'
     O                       w_lvar_u
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Ædata1
     O                                              '{'
     O                       vaeann
     O                                              '\'
     O                                              '! '
      *
      * "Bar-code" (Nobb-nr.)
      *
     O          e    23      Ædata1
     O                                              '{'
     O                       vanobb
     O                                              '\'
     O                                              '! '
      *
      * Pris1
      *
     O          e            Ædata1
     O                                              '{'
     O                       vapri1
     O                                              '\'
     O                                              '! '
      *
      * Dummy
      *
     O          e            Ædata1
     O                                              '{'
     O                       vadumy
     O                                              '\'
     O                                              '! '
     O          e            Ædata1
     O                                              '{'
     O                                              '\'
     O                                              '} '
      *
      * Write data to label
      *
     O          e            Ædata1
     O                                              '{&f'
     O                       vaanta
     O                                              '} '
      *
      * Behandle Bandit-skrive
      *                                                                ***
     oEtikett   e            Æpgm2
     O                                              '{'
      *
     O          e            Æpgm2
     O                                              '[Ct "0"]'
      *
     O          e            Æpgm2
     O                                              '[N m "m"]'
      *
     O          e            Æpgm2
     O                                              '[M n "swpaper"]'
      *
     O          e            Æpgm2
     O                                              '[M w "38.0:0:0:1"]'
     O          e            Æpgm2
     O                                              '[M l "48.0:0:0:1:direct '
     O                                              'table 100"]'
     O          e            Æpgm2
     O                                              '[M c "0"]'
     O          e            Æpgm2
     O                                              '[M m "0:00:1"]'
     O          e            Æpgm2
     O                                              '[M a "swpaper"]'
     O          e            Æpgm2
     O                                              '[D W "1" "09" "3" '
     O                                              '"swpaper" "0,0:0,0" "\N"'
      *
      * Avslutt innhold
      *
     O          e            Æpgm2
     O                                              '"\N"]'
      *
      * Etiketter
      *
     O          e            Ædata2
     O                                              '[D W "1" "09" "3" '
     O                                              '"swpaper" "0,0:0,0" "\N"'
      *
      * Varetekst 1
      *
     O          e            Ædata2
     O                                              '"C" "5.0:3.0:1" "90" '
     O                                              '"4000001:03" "20:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Varetekst 2
      *
     O          e            Ædata2
     O                                              '"C" "08.0:3.0:1" "90" '
     O                                              '"4000001:01" "20:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Bestillingsinformasjon
      *
     O          e            Ædata2
     O                                              '"C" "13.0:04.0:1" "90" '
     O                                              '"4000001:01" "07:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Alternativt varenummer
      *
     O          e            Ædata2
     O                                              '"C" "13.0:20.0:1" "90" '
     O                                              '"4000001:01" "15:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Dato
      *
     O          e            Ædata2
     O                                              '"C" "12.0:43.0:1" "00" '
     O                                              '"4000001:01" "8:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Lagerplass
      *
     O          e            Ædata2
     O                                              '"C" "16.0:03.0:1" "00" '
     O                                              '"4000001:01" "6:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Priskode
      *
     O          e            Ædata2
     O                                              '"C" "16.0:18.0:1" "90" '
     O                                              '"4000001:01" "5:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * "Bar-code" (Eget varenr.)
      *
     O          e    20      Ædata2
     O                                              '"A" "34.0:8.0:1" "90" '
     O                                              '"21:+:0" "125" "10:0" '
     O                                              '"9" "\N"'
      *
      * "Bar-code" (Lev. varenr.)
      *
     O          e    21      Ædata2
     O                                              '"A" "34.0:8.0:1" "90" '
     O                                              '"21:+:0" "125" "10:0" '
     O                                              '"9" "\N"'
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Ædata2
     O                                              '"A" "34.0:8.0:1" "90" '
     O                                              '"00:+:2" "76" "10:0" '
     O                                              '"\N"'
      *
      * "Bar-code" (Nobb-nr.)
      *
     O          e    23      Ædata2
     O                                              '"A" "34.0:8.0:1" "90" '
     O                                              '"21:+:0" "125" "10:0" '
     O                                              '"9" "\N"'
      *
      * Pris1
      *
     O          e            Ædata2
     O                                              '"C" "23.0:14.0:1" "90" '
     O                                              '"4000001:04" "8:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Avslutt program
      *
     O          e            Ædata2
     O                                              '"\N"]'
      *
      * Start innhold
      *
     O          e            Ædata2
     O                                              '[ D w "LLU" "1" "\N"'
      *
      * Varetekst 1
      *
     O          e            Ædata2
     O                                              '"'
     O                       w_tek1
     O                                              '"'
      *
      * Varetekst 2
      *
     O          e            Ædata2
     O                                              '"'
     O                       w_tek2
     O                                              '"'
      *
      * Bestillingsinformasjon
      *
     O          e            Ædata2
     O                                              '"'
     O                       w_best
     O                                              '"'
      *
      * Alternativt varenummer
      *
     O          e            Ædata2
     O                                              '"'
     O                       w_altv
     O                                              '"'
      *
      * Dato
      *
     O          e            Ædata2
     O                                              '"'
     O                       w_dato
     O                                              '"'
      *
      * Lagerplass
      *
     O          e            Ædata2
     O                                              '"'
     O                       vaplas
     O                                              '"'
      *
      * Priskode
      *
     O          e            Ædata2
     O                                              '"'
     O                       vabesk
     O                                              '"'
      *
      * "Bar-code" (Eget varenr.)
      *
     O          e    20      Ædata2
     O                                              '"'
     O                       vavare
     O                                              '"'
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     O          e    21      Ædata2
     O                                              '"'
     O                       w_lvar_u
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Ædata2
     O                                              '"'
     O                       vaeann
     O                                              '"'
      *
      * "Bar-code" (Nobb-nr.)
      *
     O          e    23      Ædata2
     O                                              '"'
     O                       vanobb
     O                                              '"'
      *
      * Pris1
      *
     O          e            Ædata2
     O                                              '"'
     O                       vapri1
     O                                              '"'
      *
      * Avslutt innhold
      *
     O          e            Ædata2
     O                                              '"\N"]'
      *
      * Antall etiketter
      *
     O          e            Ædata2
     O                                            6 '[P b "'
     O               81      w_anta_1             7
     O               82      w_anta_2             8
     O               83      w_anta_3             9
     O               81                          19 ':1:swpaper"]'
     O               82                          20 ':1:swpaper"]'
     O               83                          21 ':1:swpaper"]'
      *
     O          e            Æend2
     O                                              '}'
      *
      * Behandle Meto mi-4
      *                                                                ***
     oEtikett   e            Ædata4
     O                                              '~n'
      *
     o          e            Ædata4
     O                                              '~c0000'
      *
     O          e            Ædata4
     O                                              '~e'
      *
     O          e            Ædata4
     O                                              '~M0500'
      *
     O          e            Ædata4
     O                                              '~ySPM'
      *
     O          e            Ædata4
     O                                              '~Kf0040'
      *
      * Kode for Datamax Ex-2
      *
     O          e    66      Ædata4
6.10 O**                                            '~KcLW100'
6.10 O                                              '~KcLW140'
      *
     O          e            Ædata4
     O                                              '~L'
      *
     O          e            Ædata4
     O                                              'z'
      *
     O          e            Ædata4
     O                                              'D11'
      *
     O          e            Ædata4
     O                       l_hex1
      *
     O          e            Ædata4
     O                       l_hex2
      *
      * Antall etiketter
      *
     O          e            Ædata4
     O                                              'Q'
     O                       vaanta
      *
      * Varetekst 1
      *
     O          e            Ædata4
     O                                           15 '4311A1000010018'
     O                       w_tek1
      *
      * Varetekst 2
      *
     O          e            Ædata4
     O                                           15 '4211A1000010030'
     O                       W_tek2
      *
      * Bestillingsinformasjon
      *
6.10 O*         e            Ædata4
6.10 O*                                          15 '4211A1000010040'
6.10 O*                      w_best
      *
      * Bestillingsmengde - strekkode
      *
     O          e            Ædata4
6.10 O**                                         15 '4D2201901400050'
6.10 O                                           15 '4211A1001400050'
     O                       vabmen
      *
      * Alternativt varenummer
      *
     O          e            Ædata4
     O                                           15 '4211A1000650040'
     O                       w_altv
      *
      * Dato
      *
     O          e            Ædata4
     O                                           15 '1211A1001650070'
     O                       w_dato
      *
      * Lagerplass
      *
     O          e            Ædata4
     O                                           15 '1211A1000010060'
     O                       vaplas
      *
      * Priskode
      *
     O          e            Ædata4
     O                                           15 '4211A1000800060'
     O                       vabesk
      *
      * "Bar-code" (Eget varenr.)
      *
     O          e    20      Ædata4
     O                                           15 '4D0002800200130'
     O                       vavare
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     O          e    21      Ædata4
     O                                           15 '4D0002800200130'
     O                       w_lvar
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Ædata4
     O                                           15 '4F1202800200130'
     O                       vaeann
      *
      * "Bar-code" (Nobb-nr.)
      *
     O          e    23      Ædata4
     O                                           15 '4D0002800200130'
     O                       vanobb
6.10  *
6.10  * Enhet1
6.10  *
6.10 o          e            Ædata4
6.10 o                                           15 '4411A1000010085'
6.10 o                       vaenh1
      *
      * Pris1
      *
     O          e            Ædata4
     O                                           15 '4411A1000350085'
     O                       vapri1
      *
     O          e            Ædata4
     O                                              'E'
      *
