      /TITLE  ASOFAK: Skriver hylle etiketter
     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FP214R
      * Beskrivelse . . : Skriver hylle etiketter - 75 mm
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       201098 KOB  Nytt program
      * V3.30 231200 KOB  Lagt inn støtte for Eltron-skriver
      * V3.30 010501 KOB  Lagt inn støtte for Meto mi-4
      * V5.00 040303 JAF  Meto mi-4 ta HEAT og PRTSPEED fra
      *                   styrestreng 1 og 2 i Enhetsreg
      * V5.20 071103 KOB  Lagt ut varekode
      * V5.30 251104 KOB  Lagt ut prissammenligningsenhet
      * V5.40 230305 KOB  Endret antall pos. i w_altv fra 10 til 15
      * V5.41 101005 KOB  Lagt inn støtte for Zebra QL320
      * V5.41 050506 KOB  Redusert varetekst til 30 pos på Bandit
      * V5.50 030507 KOB  Utvidet lagerplass til 8 poisjoner
      * V5.50 110607 KOB  Fjernet støtte for Eltron skriver
      * V5.60 280308 JAF  La til en kode som brukes kun av Datamax EX-2
      * V5.60 210109 KOB  Lagt inn støtte for Datamax EX-2 som egen skrivertype
      * V5.60 241110 AMD  Fant en endring i ASKORR560 som ikke var med
      * V5.60             i V6.10 Legger den derfor inn i ASKORR610
6.30  * 6.30  280514 BKV  LVAR økt fra 15 til 20
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvaw1pf    if   f  512    64aidisk
     fEtikett   o    f  132        Printer oflind(*inof)
     *
     d                uds
     d l_hex1                760    779
     d l_hex2                780    799
     d l_type                891    891  0
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
     *
      * Definering av variable
      *
     d w_skty          s                   like(l_type)
     d w_hyle          s                   like(vahyle)
      *
     d w_dato          s              8
     d w_altv          s             15
     d w_lvar          s             13
     d w_lvar_u        s             19
     d w_tek1          s             35
     d w_tek2          s             35
     d w_tek3          s             30
     d w_tek4          s             30
     d w_best          s              7
     d w_spri          s             12
      *
     d digits          c                   ' 0123456789'
     d nuller          c                   '00000000     '
      *
     d w_anta_1        s              1  0
     d w_anta_2        s              2  0
     d w_anta_3        s              3  0
      *
     ivaw1pf    ns  01
      *
     i                                  1    4 0vaanta                          Antall etiketter
     i                                  5   19  vattxt                          Tekst fra fastreg.
     i                                 20   25  vatvar                          Varenr. (Fast tekst)
     i                                 26   32  vatpri                          Pris (Fast tekst)
     i                                 33   37  vatenh                          Enhet (Fast tekst)
     i                                 38   45  vadato                          Dato
     i                                 46   53 0vanobb                          Nobb varenr.
     i                                 59   66 0vavare                          Eget varenr.
     i                                 74   86 0vaeann                          EAN nummer
     i                                 87  101  valvar                          Leverandørens varenr
6.30 i                                107  141  vatek1                          Varetekst 1
6.30 i                                142  176  vatek2                          Varetekst 2
6.30 i                                177  179  vaenh1                          Salgsenhet 1
6.30 i                                180  187  vapri1                          Pris salgsenhet 1
6.30 i                                188  190  vaenh2                          Salgsenhet 2
6.30 i                                191  198  vapri2                          Pris salgsenhet 2
6.30 i                                199  203  vabesk                          Tekst priskode
6.30 i                                204  208 0vabpun                          Bestillingspunkt
6.30 i                                209  213 0vabmen                          Bestillingsmengde
6.30 i                                214  214 0vahyle                          Type etikett
6.30 i                                215  215 0valvko                          Skriv i div. felt
6.30 i                                216  223  vaplas                          Lagerplass
6.30 i                                224  224 0vaetyp                          Etikettype
6.30 i                                225  227  vamini                          Minimumsbeholdn.(L)
6.30 i                                228  230  vamaks                          Maksimumbeholdn.(L)
6.30 i                                231  231  vavtyp                          Varetype
6.30 i                                232  234  vaenin                          Bestillingsenhet
6.30 i                                235  237  vaenps                          Sammenligningsenhet
6.30 i                                238  245  vapspr                          Pris sammenligning
      *
     i                                256  256  vadumy
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   read      vaw1pf                                 61
      *
     c                   dow       *in61 = *off
      *
      * Sjekk om riktig etikettype
      *
     c                   if        vaetyp <> 2
     c                   goto      neste
     c                   endif
      *
      * Skriv start program
      *
     c                   if        *in60 = *off
      *
     c                   eval      w_hyle = 9
      *
      * Hent skriverinformasjon
      *
     c                   eval      w_skty = l_type
      *
      * Skrivertype Meto 8100 Twinax
      *
     c     w_skty        ifeq      0
     c                   except    Æclr0
     c                   endif
      *
      * Skrivertype Meto 8100 Standard
      *
     C     w_skty        ifeq      1
     c                   except    Æclr1
     c                   endif
      *
      * Skrivertype Meto Bandit
      *
     c     w_skty        ifeq      2
     c                   except    Æpgm2
     c                   endif
      *
     c                   eval      *in60 =*on
      *
     c                   endif
      *
     c                   eval      w_dato = vadato
      *
      * Klargjør varetekst
      *
     c                   movel     vatek1        w_tek1
     c                   movel     vatek2        w_tek2
      *
     c                   movel     vatek1        w_tek3
     c                   movel     vatek2        w_tek4
      *
      * Klargjør alternativt varenummer
      *
     c                   select
     c                   when      valvko = 1
     c                   movel     valvar        w_altv
     c                   when      valvko = 2
     c                   movel     vavare        w_altv
     c                   when      valvko = 3
     c                   movel     vanobb        w_altv
     c                   other
     c                   move      *blanks       w_altv
     c                   endsl
      *
      * Klargjør bestilingsinformasjon
      *
     c                   eval      *in24 = *off
     c                   eval      *in25 = *off
     c                   eval      *in26 = *off
     c                   eval      *in27 = *off
     c                   eval      w_best = *blank
5.60 c                   eval      w_best = %char(vabpun)+' - '+%char(vabmen)
      *
     c                   if        vabpun <> 0
     c                   eval      *in24 = *on
     c                   endif
      *
     c                   if        vabmen <> 0
     c                   eval      *in25 = *on
     c                   endif
      *
     c                   if        vabpun <> 0 or
     c                             vabmen <> 0
     c                   eval      *in26 = *on
     c                   endif
      *
      * Klargjør sammenligningspris
      *
     c                   if        vapspr <> *blank
     c                   eval      *in27 = *on
     c                   eval      w_spri = vapspr+'/'+vaenps
     c                   endif
      *
      * Sjekk om lev.varenr. er nummerisk
      * og flytt til felt med riktig lengde
      *
     c     digits        check     valvar                                 90
      *
     c                   if        *in90 = *off
     c                   eval      w_lvar = %trim(valvar)
     c                   else
     c                   movel     nuller        w_lvar
     c                   endif
      *
      * Legg ut nytt program
      * hvis skifte av etikettype
      *
     c     vahyle        ifne      w_hyle
      *
      * Valg av strekkode
      *
     c                   eval      *in20 = *off
     c                   eval      *in21 = *off
     c                   eval      *in22 = *off
     c                   eval      *in23 = *off
      *
     c                   select
     c                   when      vahyle = 0
     c                   eval      *in20  = *on
     c                   when      vahyle = 1
     c                   eval      *in21  = *on
     c                   when      vahyle = 2
     c                   eval      *in22  = *on
     c                   when      vahyle = 3
     c                   eval      *in23  = *on
     c                   endsl
      *
      * Skrivertype Meto 8100 Twinax
      *
     c     w_skty        ifeq      0
     c                   except    Æpgm0
     c                   endif
      *
      * Skrivertype Meto 8100 Standard
      *
     c     w_skty        ifeq      1
     c                   except    Æpgm1
     c                   endif
      *
     c                   eval      w_hyle = vahyle
      *
     c                   endif
      *
      * Skrivertype Meto 8100 Twinax
      *
     c     w_skty        ifeq      0
     c                   eval      w_lvar_u = %trim(w_lvar) + '&0D&04'
     c                   except    Ædata0
     c                   endif
      *
      * Skrivertype Meto 8100 Standard
      *
     c     w_skty        ifeq      1
     c                   eval      w_lvar_u = %trim(w_lvar) + '\!'
     c                   except    Ædata1
     c                   endif
      *
      * Skrivertype Meto Bandit
      *
     c     w_skty        ifeq      2
     c                   eval      w_lvar_u = %trim(w_lvar) + '"'
      *
     c                   eval      *in81 = *off
     c                   eval      *in82 = *off
     c                   eval      *in83 = *off
      *
     c                   select
     c                   when      vaanta <= 9
     c                   eval      w_anta_1 = vaanta
     c                   eval      *in81 = *on
     c                   when      vaanta <= 99
     c                   eval      w_anta_2 = vaanta
     c                   eval      *in82 = *on
     c                   when      vaanta <= 500
     c                   eval      w_anta_3 = vaanta
     c                   eval      *in83 = *on
     c                   other
     c                   eval      w_anta_3 = 500
     c                   eval      *in83 = *on
     c                   endsl
      *
     c                   except    Ædata2
     c                   endif
      *
      * Skrivertype Meto mi-4
      *
     c     w_skty        ifeq      4
     c                   except    Ædata4
     c                   endif
      *
      * Skrivertype Zebra QL320
      *
     c     w_skty        ifeq      5
     c                   except    Ædata5
     c                   endif
      *
      * Skrivertype Datamax Ex-2 (Bruker samme utskrift som  Meto mi-4)
      *
     c     w_skty        ifeq      6
     c                   eval      *in66 = *on
     c                   except    Ædata4
     c                   endif
      *
     c     neste         tag
      *
     c                   read      vaw1pf                                 61
     c                   enddo
      *
     c                   goto      avslutt
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c     w_skty        ifeq      2
     c                   except    Æend2
     c                   endif
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
      *
      * Twinax-skriver
      *                                                                ***
     oEtikett   e            Æclr0
      *
      * Halo printer here am I, are you ready?
      *
     o                                              '&02&20&03'
      *
      * Clear LLU 000005
      *
     o          e            Æclr0
     o                                              '&02&53000005&03'
      *
      * Clear PGM-buffer 05
      *
     o          e            Æclr0
     o                                              '&02&5405&03'
      *
      * Program
      *
     o          e            Æpgm0
     o                                              '&02&4405132'
     o                                              '&04'
      *
      * Varetekst 1
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D001005030000312'
     o                                              '&04'
      *
      * Varetekst 2
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D006005030000112'
     o                                              '&04'
      *
      * Bestillingsinformasjon
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D010003007006112'
     o                                              '&04'
      *
      * Alternativt varenummer
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D010020015006112'
     o                                              '&04'
      *
      * Dato
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D006069008006122'
     o                                              '&04'
      *
      * Lagerplass
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D014005006006122'
     o                                              '&04'
      *
      * Priskode
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D010057005006112'
     o                                              '&04'
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Æpgm0
     o                                              '&02'
     o                                              '&0D0140080000101115200'
     o                                              '&04'
      *
      * "Bar-code" (Lev. varenr.)
      *
     o          e    21      Æpgm0
     o                                              '&02'
     o                                              '&0D0140050000101115200'
     o                                              '&04'
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Æpgm0
     o                                              '&02'
     o                                              '&0D0140080000100111200'
     o                                              '&04'
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Æpgm0
     o                                              '&02'
     o                                              '&0D0140080000101115200'
     o                                              '&04'
      *
      * Enhet2
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D013040003018412'
     o                                              '&04'
      *
      * Pris2
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D013050008009512'
     o                                              '&04'
      *
      * Enhet1
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D020040003018412'
     o                                              '&04'
      *
      * Pris1
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D020050008009512'
     o                                              '&04'
      *
      * Dummy
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D001001001006112'
     o                                              '&04'
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&03'
      *
      * Write data to  LLU-000005
      *
     o          e            Ædata0
     o                                              '&02&4300000505&0D'
     o                                              '&04'
      *
      * Varetekst 1
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_tek1
     o                                              '&0D'
     o                                              '&04'
      *
      * Varetekst 2
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_tek2
     o                                              '&0D'
     o                                              '&04'
      *
      * Bestillingsinformasjon
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_best
     o                                              '&0D'
     o                                              '&04'
      *
      * Alternativt varenummer
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_altv
     o                                              '&0D'
     o                                              '&04'
      *
      * Dato
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_dato
     o                                              '&0D'
     o                                              '&04'
      *
      * Lagerplass
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vaplas
     o                                              '&0D'
     o                                              '&04'
      *
      * Priskode
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vabesk
     o                                              '&0D'
     o                                              '&04'
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Ædata0
     o                                              '&02'
     o                       vavare
     o                                              '&0D'
     o                                              '&04'
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     o          e    21      Ædata0
     o                                              '&02'
     o                       w_lvar_u
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Ædata0
     o                                              '&02'
     o                       vaeann
     o                                              '&0D'
     o                                              '&04'
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Ædata0
     o                                              '&02'
     o                       vanobb
     o                                              '&0D'
     o                                              '&04'
      *
      * Enhet2
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vaenh2
     o                                              '&0D'
     o                                              '&04'
      *
      * Pris2
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vapri2
     o                                              '&0D'
     o                                              '&04'
      *
      * Enhet1
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vaenh1
     o                                              '&0D'
     o                                              '&04'
      *
      * Pris1
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vapri1
     o                                              '&0D'
     o                                              '&04'
      *
      * Dummy
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vadumy
     o                                              '&0D'
     o                                              '&04'
      *
     o          e            Ædata0
     o                                              '&02'
     o                                              '&0D'
     o                                              '&03'
      *
     o          e            Ædata0
      * Write data to label
     o                                              '&02&66'
     o                       vaanta
     o                                              '&03'
      *
      * Behandle standard-skriver
      *                                                                ***
     o          e            Æclr1
     o                                              '{ & } '
      *
      * Clear LLU 000005
      *
     o          e            Æclr1
     o                                              '{&S000005} '
      *
      * Clear PGM-buffer 05
      *
     o          e            Æclr1
     o                                              '{&T05} '
      *
      * Program
      *
     o          e            Æpgm1
     o                                              '{&D05122'
     o                                              '! '
      *
      * Varetekst 1
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\001005030000312'
     o                                              '! '
      *
      * Varetekst 2
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\006005030000112'
     o                                              '! '
      *
      * Bestillingsinformasjon
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\010003007006112'
     o                                              '! '
      *
      * Alternativt varenummer
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\010020015006112'
     o                                              '! '
      *
      * Dato
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\006069008006122'
     o                                              '! '
      *
      * Lagerplass
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\014003006006122'
     o                                              '! '
      *
      *
      * Priskode
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\010057005006112'
     o                                              '! '
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Æpgm1
     o                                              '{'
     o                                              '\0140080000101115200'
     o                                              '! '
      *
      * "Bar-code" (Lev. varenr.)
      *
     o          e    21      Æpgm1
     o                                              '{'
     o                                              '\0140050000101115200'
     o                                              '! '
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Æpgm1
     o                                              '{'
     o                                              '\0140080000100111200'
     o                                              '! '
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Æpgm1
     o                                              '{'
     o                                              '\0140080000101115200'
     o                                              '! '
      *
      * Enhet2
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\013040003018412'
     o                                              '! '
      *
      * Pris2
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\013050008009512'
     o                                              '! '
      *
      * Enhet1
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\020040003018412'
     o                                              '! '
      *
      * Pris1
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\020050008009512'
     o                                              '! '
      *
      * Dummy
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\001001001006112'
     o                                              '! '
     o          e            Æpgm1
     o                                              '{\\\\\\\\\\\\\\}'
      *
      * Write data to  LLU-000005
      *
     o          e            Ædata1
     o                                              '{&C00000505\'
     o                                              '! '
      *
      * Varetekst 1
      *
     o          e            Ædata1
     o                                              '{'
     o                       w_tek1
     o                                              '\'
     o                                              '! '
      *
      * Varetekst 2
      *
     o          e            Ædata1
     o                                              '{'
     o                       w_tek2
     o                                              '\'
     o                                              '! '
      *
      * Bestillingsinformasjon
      *
     o          e            Ædata1
     o                                              '{'
     o                       w_best
     o                                              '\'
     o                                              '! '
      *
      * Alternativt varenummer
      *
     o          e            Ædata1
     o                                              '{'
     o                       w_altv
     o                                              '\'
     o                                              '! '
      *
      * Dato
      *
     o          e            Ædata1
     o                                              '{'
     o                       w_dato
     o                                              '\'
     o                                              '! '
      *
      * Lagerplass
      *
     o          e            Ædata1
     o                                              '{'
     o                       vaplas
     o                                              '\'
     o                                              '! '
      *
      * Priskode
      *
     o          e            Ædata1
     o                                              '{'
     o                       vabesk
     o                                              '\'
     o                                              '! '
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Ædata1
     o                                              '{'
     o                       vavare
     o                                              '\'
     o                                              '! '
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     o          e    21      Ædata1
     o                                              '{'
     o                       w_lvar_u
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Ædata1
     o                                              '{'
     o                       vaeann
     o                                              '\'
     o                                              '! '
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Ædata1
     o                                              '{'
     o                       vanobb
     o                                              '\'
     o                                              '! '
      *
      * Enhet2
      *
     o          e            Ædata1
     o                                              '{'
     o                       vaenh2
     o                                              '\'
     o                                              '! '
      *
      * Pris2
      *
     o          e            Ædata1
     o                                              '{'
     o                       vapri2
     o                                              '\'
     o                                              '! '
      *
      * Enhet1
      *
     o          e            Ædata1
     o                                              '{'
     o                       vaenh1
     o                                              '\'
     o                                              '! '
      *
      * Pris1
      *
     o          e            Ædata1
     o                                              '{'
     o                       vapri1
     o                                              '\'
     o                                              '! '
      *
      * Dummy
      *
     o          e            Ædata1
     o                                              '{'
     o                       vadumy
     o                                              '\'
     o                                              '! '
     o          e            Ædata1
     o                                              '{'
     o                                              '\'
     o                                              '} '
      *
      * Write data to label
      *
     o          e            Ædata1
     o                                              '{&f'
     o                       vaanta
     o                                              '} '
      *
      * Behandle Bandit-skriver
      *                                                                ***
     oEtikett   e            Æpgm2
     o                                              '{'
      *
     O          e            Æpgm2
     O                                              '[Ct "0"]'
      *
     o          e            Æpgm2
     o                                              '[N m "m"]'
      *
     o          e            Æpgm2
     o                                              '[M n "swpaper"]'
      *
     o          e            Æpgm2
     o                                              '[M w "27.0:0:0:1"]'
     o          e            Æpgm2
     o                                              '[M l "78.0:0:0:1:direct '
     o                                              'table 100"]'
     o          e            Æpgm2
     o                                              '[M c "0"]'
     o          e            Æpgm2
     o                                              '[M m "0:00:1"]'
     o          e            Æpgm2
     o                                              '[M a "swpaper"]'
     o          e            Æpgm2
     o                                              '[D W "1" "12" "3" '
     o                                              '"swpaper" "0,0:0,0" "\N"'
      *
      * Avslutt innhold
      *
     o          e            Æpgm2
     o                                              '"\N"]'
      *
      * Etiketter
      *
     o          e            Ædata2
     o                                              '[D W "1" "12" "3" '
     o                                              '"swpaper" "0,0:0,0" "\N"'
      *
      * Varetekst 1
      *
     o          e            Ædata2
     o                                              '"C" "5.0:2.0:1" "90" '
     O                                              '"4000001:03" "30:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Varetekst 2
      *
     o          e            Ædata2
     o                                              '"C" "8.0:2.0:1" "90" '
     o                                              '"4000001:01" "30:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Bestillingsinformasjon
      *
     o          e            Ædata2
     o                                              '"C" "12.0:2.0:1"  "90" '
     o                                              '"4000001:01" "07:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Alternativt varenummer
      *
     o          e            Ædata2
     o                                              '"C" "12.0:20.0:1"  "90"'
     o                                              '"4000001:01" "15:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Dato
      *
     o          e            Ædata2
     o                                              '"C" "08.0:67.0:1" "00" '
     o                                              '"4000001:01" "08:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Lagerplass
      *
     o          e            Ædata2
     o                                              '"C" "14.0:03.0:1" "00" '
     o                                              '"4000001:01" "08:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Priskode
      *
     o          e            Ædata2
     o                                              '"C" "12.0:50.0:1" "90" '
     o                                              '"4000001:01" "5:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Ædata2
     o                                              '"A" "24.0:8.0:1" "90" '
     o                                              '"21:+:0" "125" "10:0" '
     o                                              '"9" "\N"'
      *
      * "Bar-code" (Lev. varenr.)
      *
     o          e    21      Ædata2
     o                                              '"A" "24.0:3.0:1" "90" '
     o                                              '"21:+:0" "125" "10:0" '
     o                                              '"9" "\N"'
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Ædata2
     o                                              '"A" "24.0:8.0:1" "90" '
     o                                              '"00:+:2" "76" "10:0" '
     o                                              '"\N"'
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Ædata2
     o                                              '"A" "24.0:8.0:1" "90" '
     o                                              '"21:+:0" "125" "10:0" '
     o                                              '"9" "\N"'
      *
      * Enhet2
      *
     o          e            Ædata2
     o                                              '"C" "18.0:40.0:1" "90" '
     o                                              '"4000001:04" "3:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Pris2
      *
     o          e            Ædata2
     o                                              '"C" "18.0:48.0:1" "90" '
     o                                              '"4000001:04" "8:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Enhet1
      *
     o          e            Ædata2
     o                                              '"C" "25.0:40.0:1" "90" '
     o                                              '"4000001:04" "3:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Pris1
      *
     o          e            Ædata2
     o                                              '"C" "25.0:48.0:1" "90" '
     o                                              '"4000001:04" "8:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Avslutt program
      *
     o          e            Ædata2
     o                                              '"\N"]'
      *
      * Start innhold
      *
     o          e            Ædata2
     o                                              '[ D w "LLU" "1" "\N"'
      *
      * Varetekst 1
      *
     o          e            Ædata2
     o                                              '"'
     o                       w_tek3
     o                                              '"'
      *
      * Varetekst 2
      *
     o          e            Ædata2
     o                                              '"'
     o                       w_tek4
     o                                              '"'
      *
      * Bestillingsinformasjon
      *
     o          e            Ædata2
     o                                              '"'
     o                       w_best
     o                                              '"'
      *
      * Alternativt varenummer
      *
     o          e            Ædata2
     o                                              '"'
     o                       w_altv
     o                                              '"'
      *
      * Dato
      *
     o          e            Ædata2
     o                                              '"'
     o                       w_dato
     o                                              '"'
      *
      * Lagerplass
      *
     o          e            Ædata2
     o                                              '"'
     o                       vaplas
     o                                              '"'
      *
      * Priskode
      *
     o          e            Ædata2
     o                                              '"'
     o                       vabesk
     o                                              '"'
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Ædata2
     o                                              '"'
     o                       vavare
     o                                              '"'
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     o          e    21      Ædata2
     o                                              '"'
     o                       w_lvar_u
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Ædata2
     o                                              '"'
     o                       vaeann
     o                                              '"'
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Ædata2
     o                                              '"'
     o                       vanobb
     o                                              '"'
      *
      * Enhet2
      *
     o          e            Ædata2
     o                                              '"'
     o                       vaenh2
     o                                              '"'
      *
      * Pris2
      *
     o          e            Ædata2
     o                                              '"'
     o                       vapri2
     o                                              '"'
      *
      * Enhet1
      *
     o          e            Ædata2
     o                                              '"'
     o                       vaenh1
     o                                              '"'
      *
      * Pris1
      *
     o          e            Ædata2
     o                                              '"'
     o                       vapri1
     o                                              '"'
      *
      * Avslutt innhold
      *
     o          e            Ædata2
     o                                              '"\N"]'
      *
      * Antall etiketter
      *
     o          e            Ædata2
     o                                            6 '[P b "'
     o               81      w_anta_1             7
     o               82      w_anta_2             8
     o               83      w_anta_3             9
     o               81                          19 ':1:swpaper"]'
     o               82                          20 ':1:swpaper"]'
     o               83                          21 ':1:swpaper"]'
      *
     o          e            Æend2
     o                                              '}'
      *
      * Behandle Meto mi-4
      *                                                                ***
     oEtikett   e            Ædata4
     O                                              '~n'
      *
     o          e            Ædata4
     O                                              '~c0000'
      *
     O          e            Ædata4
     O                                              '~e'
      *
     O          e            Ædata4
     O                                              '~M2055'
      *
     O          e            Ædata4
     O                                              '~ySPM'
      *
     O          e            Ædata4
     O                                              '~Kf0040'
      *
      * Kode for Datamax Ex-2
      *
     O          e    66      Ædata4
     O                                              '~KcLW100'
      *
     O          e            Ædata4
     O                                              '~L'
      *
     O          e            Ædata4
     O                                              'z'
      *
     O          e            Ædata4
     O                                              'D11'
      *
     O          e            Ædata4
     O                       l_hex1
      *
     O          e            Ædata4
     O                       l_hex2
      *
      * Antall etiketter
      *
     O          e            Ædata4
     O                                              'Q'
     O                       vaanta
      *
      * Varetekst 1
      *
     O          e            Ædata4
     O                                           15 '4212A1000150018'
     O                       w_tek1
      *
      * Varetekst 2
      *
     O          e            Ædata4
     O                                           15 '4211A1000150030'
     O                       w_tek2
      *
      * Bestillingspunkt
      *
     O          e    24      Ædata4
     O                                           15 '4211A1000100040'
     O                       vabpun                 '  0 , '
      *
     O          e    26      Ædata4
     O                                           15 '4211A1000480040'
     O                                              '/'
      *
      * Bestillingsmengde
      *
     O          e    25      Ædata4
     O                                           15 '4211A1000490040'
     O                       vabmen                 '  0 , '
      *
      * Bestillingsenhet
      *
     O          e    26      Ædata4
     O                                           15 '4211A1000890040'
     O                       vaenin
      *
      * Alternativt varenummer
      *
     O          e            Ædata4
     O                                           15 '4211A1000400055'
     O                       w_altv
      *
      * Dato
      *
     O          e            Ædata4
     O                                           15 '1211A1002550025'
     O                       w_dato
      *
      * Lagerplass
      *
     O          e            Ædata4
     O                                           15 '1211A1000010030'
     O                       vaplas
      *
      * Priskode
      *
     O          e            Ædata4
     O                                           15 '4211A1002000045'
     O                       vabesk
      *
      * "Bar-code" (Eget varenr.)
      *
     O          e    20      Ædata4
     O                                           15 '4d6302900200085'
     O                       vavare
      *
      * Eget varenr.
      *
     O          e    20      Ædata4
     O                                           15 '4211A1000600095'
     O                       vavare
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     O          e    21      Ædata4
     O                                           15 '4d6302900200085'
     O                       w_lvar
      *
      * Leverandørens varenr.
      *
     O          e    21      Ædata4
     O                                           15 '4211A1000400095'
     O                       w_lvar
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Ædata4
     O                                           15 '4f0202900100085'
     O                       vaeann
      *
      * EAN-nummer
      *
     O          e    22      Ædata4
     O                                           15 '4211A1000200095'
     O                       vaeann
      *
      * "Bar-code" (Nobb-nr.)
      *
     O          e    23      Ædata4
     O                                           15 '4d6302900200085'
     O                       vanobb
      *
      * Nobb-nr.
      *
     O          e    23      Ædata4
     O                                           15 '4211A1000400095'
     O                       vanobb
      *
      * Enhet1
      *
     O          e            Ædata4
     O                                           15 '4411A1801350070'
     O                       vaenh1
      *
      * Pris1
      *
     O          e            Ædata4
     O                                           15 '4411A1801650070'
     O                       vapri1
      *
      * Sammenligningspris/enhet
      *
     O          e    27      Ædata4
     O                                           15 '4211A1801650090'
     O                       w_spri
      *
      * Boks rundt prissammenligning
      *
     O          e    27      Ædata4
     O                                           25 '1X1100001700075B020070001'
     O                                           28 '001'
      *
      * Varetype
      *
     O          e            Ædata4
     O                                           15 '4211A1002570095'
     O                       vavtyp
      *
      * Sirkel rundt varetype
      *
     O          e            Ædata4
     O                                           23 '1X1100002580090C0010001'
     O                                           27 '0010'
      *
     O          e            Ædata4
     O                                              'E'
      *
      * Behandle Zebra QL320
      *                                                                ***
     oEtikett   e            Ædata5
     O                                              '~n'
      *
     o          e            Ædata5
     O                                              '~c0000'
      *
     O          e            Ædata5
     O                                              '~e'
      *
     O          e            Ædata5
     O                                              '~M0500'
      *
     O          e            Ædata5
     O                                              '~ySPM'
      *
     O          e            Ædata5
     O                                              '~Kf0040'
      *
     O          e            Ædata5
     O                                              '~L'
      *
     O          e            Ædata5
     O                                              'z'
      *
     O          e            Ædata5
     O                                              'D11'
      *
     O          e            Ædata5
     O                       l_hex1
      *
     O          e            Ædata5
     O                       l_hex2
      *
      * Antall etiketter
      *
     O          e            Ædata5
     O                                              'Q'
     O                       vaanta
      *
      * Varetekst 1
      *
     O          e            Ædata5
     O                                           15 '4212A1000150018'
     O                       w_tek1
      *
      * Varetekst 2
      *
     O          e            Ædata5
     O                                           15 '4211A1000150030'
     O                       w_tek2
      *
      * Bestillingspunkt
      *
     O          e    24      Ædata5
     O                                           15 '4211A1000100040'
     O                       vabpun                 '  0 , '
      *
     O          e    26      Ædata5
     O                                           15 '4211A1000480040'
     O                                              '/'
      *
      * Bestillingsmengde
      *
     O          e    25      Ædata5
     O                                           15 '4211A1000490040'
     O                       vabmen                 '  0 , '
      *
      * Bestillingsenhet
      *
     O          e    26      Ædata5
     O                                           15 '4211A1000890040'
     O                       vaenin
      *
      * Alternativt varenummer
      *
     O          e            Ædata5
     O                                           15 '4211A1000400055'
     O                       w_altv
      *
      * Dato
      *
     O          e            Ædata5
     O                                           15 '1211A1002550025'
     O                       w_dato
      *
      * Lagerplass
      *
     O          e            Ædata5
     O                                           15 '1211A1000010030'
     O                       vaplas
      *
      * Priskode
      *
     O          e            Ædata5
     O                                           15 '4211A1002000045'
     O                       vabesk
      *
      * "Bar-code" (Eget varenr.)
      *
     O          e    20      Ædata5
     O                                           15 '4d6302900200090'
     O                       vavare
      *
      * Eget varenr.
      *
     O          e    20      Ædata5
     O                                           15 '4211A1000600100'
     O                       vavare
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     O          e    21      Ædata5
     O                                           15 '4d6302900200090'
     O                       w_lvar
      *
      * Leverandørens varenr.
      *
     O          e    21      Ædata5
     O                                           15 '4211A1000400100'
     O                       w_lvar
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Ædata5
     O                                           15 '4f0202900100090'
     O*                                          15 '4F0202900100090'
     O                       vaeann
      *
      * EAN-nummer
      *
     O          e    22      Ædata5
     O                                           15 '4211A1000200100'
     O                       vaeann
      *
      * "Bar-code" (Nobb-nr.)
      *
     O          e    23      Ædata5
     O                                           15 '4d6302900200090'
     O                       vanobb
      *
      * Nobb-nr.
      *
     O          e    23      Ædata5
     O                                           15 '4211A1000400100'
     O                       vanobb
      *
      * Enhet1
      *
     O          e            Ædata5
     O                                           15 '4411A1801350070'
     O                       vaenh1
      *
      * Pris1
      *
     O          e            Ædata5
     O                                           15 '4411A1801650070'
     O                       vapri1
      *
      * Sammenligningspris/enhet
      *
     O          e    27      Ædata5
     O                                           15 '4211A1801650090'
     O                       w_spri
      *
      * Boks rundt prissammenligning
      *
     O          e    27      Ædata5
     O                                           25 '1X1100001700075B020070001'
     O                                           28 '001'
      *
      * Varetype
      *
     O          e            Ædata5
     O                                           15 '4211A1002570095'
     O                       vavtyp
      *
      * Sirkel rundt varetype
      *
     O          e            Ædata5
     O                                           23 '1X1100002580090C0010001'
     O                                           27 '0010'
      *
     O          e            Ædata5
     O                                              'E'
