      /TITLE  ASOFAK: Skriver reoletiketter
     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FP216R
      * Beskrivelse . . : Skriver reoletiketter
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       201098 KOB  Nytt program
      * V3.30 231200 KOB  Lagt inn støtte for Eltron-skriver
      * V3.30 010501 KOB  Lagt inn støtte for Meto mi-4
      * V5.00 040303 JAF  Meto mi-4 ta HEAT og PRTSPEED fra
      *                   styrestreng 1 og 2 i Enhetsreg
      *       071103 KOB  Lagt ut varekode
      * V5.40 260305 KOB  Lagt ut prissammenligningsenhet mi-4
      * V5.40 260305 KOB  Lagt ut bestillingsinformasjon  mi-4
      * V5.41 190506 KOB  Midlertidig stjernet ut prissammenligning
      * V5.50 030507 KOB  Utvidet lagerplass til 8 poisjoner
      * V5.50 210507 KOB  Fjernet støtte for Eltron-skriver
      * V5.60 280308 JAF  La til en kode som brukes kun av Datamax EX-2
      * V5.60 210109 KOB  Lagt inn støtte for Datamax EX-2 som egen skrivertype
6.30  * 6.30  280514 BKV  LVAR økt fra 15 til 20
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvaw1pf    if   f  512    64aidisk
     fEtikett   o    f  132        Printer oflind(*inof)
     *
     D                uds
     d l_hex1                760    779
     d l_hex2                780    799
     d l_type                891    891  0
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
     *
      * Definering av variable
      *
     d w_skty          s                   like(l_type)
     d w_hyle          s                   like(vahyle)
      *
     d w_best          s              7
     d w_spri          s             12
     d w_dato          s              8
     d w_altv          s             15
     d w_lvar          s             15
     d w_lvar_u        s             21
      *
     d digits          c                   ' 0123456789'
      *
     d w_anta_1        s              1  0
     d w_anta_2        s              2  0
     d w_anta_3        s              3  0
      *
     ivaw1pf    ns  01
      *
     i                                  1    4 0vaanta                          Antall etiketter
     i                                  5   19  vattxt                          Tekst fra fastreg.
     i                                 20   25  vatvar                          Varenr. (Fast tekst)
     i                                 26   32  vatpri                          Pris (Fast tekst)
     i                                 33   37  vatenh                          Enhet (Fast tekst)
     i                                 38   45  vadato                          Dato
     i                                 46   53 0vanobb                          Nobb varenr.
     i                                 59   66 0vavare                          Eget varenr.
     i                                 74   86 0vaeann                          EAN nummer
     i                                 87  101  valvar                          Leverandørens varenr
6.30 i                                107  141  vatek1                          Varetekst 1
6.30 i                                142  176  vatek2                          Varetekst 2
6.30 i                                177  179  vaenh1                          Salgsenhet 1
6.30 i                                180  187  vapri1                          Pris salgsenhet 1
6.30 i                                188  190  vaenh2                          Salgsenhet 2
6.30 i                                191  198  vapri2                          Pris salgsenhet 2
6.30 i                                199  203  vabesk                          Tekst priskode
6.30 i                                204  208 0vabpun                          Bestillingspunkt
6.30 i                                209  213 0vabmen                          Bestillingsmengde
6.30 i                                214  214 0vahyle                          Type etikett
6.30 i                                215  215 0valvko                          Skriv i div. felt
6.30 i                                216  223  vaplas                          Lagerplass
6.30 i                                224  224 0vaetyp                          Etikettype
6.30 i                                225  227  vamini                          Minimumsbeholdn.(L)
6.30 i                                228  230  vamaks                          Maksimumbeholdn.(L)
6.30 i                                231  231  vavtyp                          Varetype
6.30 i                                232  234  vaenin                          Bestillingsenhet
6.30 i                                235  237  vaenps                          Sammenligningsenhet
6.30 i                                238  245  vapspr                          Pris sammenligning
      *
     i                                256  256  vadumy
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   read      vaw1pf                                 61
      *
     c                   dow       *in61 = *off
      *
      * Sjekk om riktig etikettype
      *
     c                   if        vaetyp <> 4
     c                   goto      neste
     c                   endif
      *
     c                   if        *in60 = *off
      *
     c                   eval      w_hyle = 9
      *
      * Sett faste verdier (Overstyrer data fra fil)
      *
      * Hent skriverinformasjon
      *
     c                   eval      w_skty = l_type
      *
      * Skrivertype Meto 8100 Twinax
      *
     c     w_skty        ifeq      0
     c                   except    Æclr0
     c                   endif
      *
      * Skrivertype Meto 8100 Standard
      *
     C     w_skty        ifeq      1
     c                   except    Æclr1
     c                   endif
      *
      * Skrivertype Meto Bandit
      *
     c     w_skty        ifeq      2
     c                   except    Æpgm2
     c                   endif
      *
     c                   eval      *in60 = *on
      *
     c                   endif
      *
     c                   eval      w_dato = vadato
      *
      * Klargjør alternativt varenummer
      *
     c                   select
     c                   when      valvko = 1
     c                   movel     valvar        w_altv
     c                   when      valvko = 2
     c                   movel     vavare        w_altv
     c                   when      valvko = 3
     c                   movel     vanobb        w_altv
     c                   other
     c                   move      *blank        w_altv
     c                   endsl
      *
      * Klargjør bestilingsinformasjon
      *
     c                   eval      w_best = *blank
      *
     c                   eval      *in24 = *off
     c                   eval      *in25 = *off
     c                   eval      *in26 = *off
     c                   eval      *in27 = *off
      *
     c                   if        vabpun <> 0
     c                   eval      *in24 = *on
     c                   endif
      *
     c                   if        vabmen <> 0
     c                   eval      *in25 = *on
     c                   endif
      *
     c                   if        vabpun <> 0 or
     c                             vabmen <> 0
     c                   eval      *in26 = *on
     c                   endif
      *
      * Klargjør sammenligningspris
      *
     c                   if        vapspr <> *blank
     c                   eval      *in27 = *on
     c                   eval      w_spri = vapspr+'/'+vaenps
     c                   endif
      *
      * Sjekk om lev.varenr. er nummerisk
      * og flytt til felt med riktig lengde
      *
     c     digits        check     valvar                                 90
      *
     c                   if        *in90 = *off
      *
     c                   eval      w_lvar = %trim(valvar)
     c                   else
     c                   move      *zeros        w_lvar
      *
     c                   endif
      *
      * Legg ut nytt program
      * hvis skifte av etikettype
      *
     c     vahyle        ifne      w_hyle
      *
      * Valg av strekkode
      *
     c                   eval      *in20 =*off
     c                   eval      *in21 =*off
     c                   eval      *in22 =*off
     c                   eval      *in23 =*off
      *
     c                   select
     c                   when      vahyle = 0
     c                   eval      *in20 =*on
     c                   when      vahyle = 1
     c                   eval      *in21 =*on
     c                   when      vahyle = 2
     c                   eval      *in22 =*on
     c                   when      vahyle = 3
     c                   eval      *in23 =*on
     c                   endsl
      *
     c                   eval      w_hyle = vahyle
      *
      * Skrivertype Meto 8100 Twinax
      *
     c     w_skty        ifeq      0
     c                   except    Æpgm0
     c                   endif
      *
      * Skrivertype Meto 8100 Standard
      *
     c     w_skty        ifeq      1
     c                   except    Æpgm1
     c                   endif
      *
     c                   endif
      *
      * Skrivertype Meto 8100 Twinax
      *
     c     w_skty        ifeq      0
     c                   eval      w_lvar_u = %trim(w_lvar) + '&0D&04'
     c                   except    Ædata0
     c                   endif
      *
      * Skrivertype Meto 8100 Standard
      *
     c     w_skty        ifeq      1
     c                   eval      w_lvar_u = %trim(w_lvar) + '\!'
     c                   except    Ædata1
     c                   endif
      *
      * Skrivertype Meto Bandit
      *
     c     w_skty        ifeq      2
     c                   eval      w_lvar_u = %trim(w_lvar) + '"'
      *
     c                   eval      *in81 = *off
     c                   eval      *in82 = *off
     c                   eval      *in83 = *off
      *
     c                   select
     c                   when      vaanta <= 9
     c                   eval      w_anta_1 = vaanta
     c                   eval      *in81 = *on
     c                   when      vaanta <= 99
     c                   eval      w_anta_2 = vaanta
     c                   eval      *in82 = *on
     c                   when      vaanta <= 500
     c                   eval      w_anta_3 = vaanta
     c                   eval      *in83 = *on
     c                   other
     c                   eval      w_anta_3 = 500
     c                   eval      *in83 = *on
     c                   endsl
      *
     c                   except    Ædata2
     c                   endif
      *
      * Skrivertype Meto mi-4
      *
     c     w_skty        ifeq      4
     c                   except    Ædata4
     c                   endif
      *
      * Skrivertype Datamax Ex-2 (Bruker samme utskrift som  Meto mi-4)
      *
     c     w_skty        ifeq      6
     c                   eval      *in66 = *on
     c                   except    Ædata4
     c                   endif
      *
     c     neste         tag
      *
     c                   read      vaw1pf                                 61
     c                   enddo
      *
     c                   goto      avslutt
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c     w_skty        ifeq      2
     c                   except    Æend2
     c                   endif
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
      *
      * Behandle Twinax-skriver
      *                                                                ***
     oEtikett   e            Æclr0
     o                                              '&02&20&03'
      *
      * Clear LLU 000002
      *
     o          e            Æclr0
     o                                              '&02&53000002&03'
      *
      * Clear PGM-buffer 02
      *
     o          e            Æclr0
     o                                              '&02&5402&03'
      *
      * Program
      *
     o          e            Æpgm0
     o                                              '&02&4402162'
     o                                              '&04'
      *
      * Varetekst 1
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D005003003518712'
     o                                              '&04'
      *
      * Varetekst 2
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D020010035009512'
     o                                              '&04'
      *
      * Pris tekst
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D005168007000712'
     o                                              '&04'
      *
      * Varenummertekst
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D042010006018612'
     o                                              '&04'
      *
      * Varenummer
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D050005010018612'
     o                                              '&04'
      *
      * Bestillingsinformasjon
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D035015007010312'
     o                                              '&04'
      *
      * Alternativt varenummer
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D035060015010312'
     o                                              '&04'
      *
      * Dato
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D035140008000222'
     o                                              '&04'
      *
      * Lagerplass
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D036003006010222'
     o                                              '&04'
      *
      * Priskode
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D020175005010312'
     o                                              '&04'
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Æpgm0
     o                                              '&02'
     o                                              '&0D0420480080121116200'
     o                                              '&04'
      *
      * "Bar-code" (Lev. varenr.)
      *
     o          e    21      Æpgm0
     o                                              '&02'
     o                                              '&0D0420480080121116200'
     o                                              '&04'
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Æpgm0
     o                                              '&02'
     o                                              '&0D0420480060121111200'
     o                                              '&04'
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Æpgm0
     o                                              '&02'
     o                                              '&0D0420480080121116200'
     o                                              '&04'
      *
      * Enhet2
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D027150003018712'
     o                                              '&04'
      *
      * Pris2
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D027165010009712'
     o                                              '&04'
      *
      * Enhet1
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D042150003018712'
     o                                              '&04'
      *
      * Pris1
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D042165010009712'
     o                                              '&04'
      *
      * Dummy
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D001002001006112'
     o                                              '&04'
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&03'
      *
      * Write data to  LLU-000002
      *
     o          e            Ædata0
     o                                              '&02&4300000202&0D'
     o                                              '&04'
      *
      * Varetekst1
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vatek1
     o                                              '&0D'
     o                                              '&04'
      *
      * Varetekst2
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vatek2
     o                                              '&0D'
     o                                              '&04'
      *
      * Pristekst
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vatpri
     o                                              '&0D'
     o                                              '&04'
      *
      * Varenummertekst
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vatvar
     o                                              '&0D'
     o                                              '&04'
      *
      * Varenummer
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vavare
     o                                              '&0D'
     o                                              '&04'
      *
      * Bestillingsinformasjon
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_best
     o                                              '&0D'
     o                                              '&04'
      *
      * Alternativt varenummer
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_altv
     o                                              '&0D'
     o                                              '&04'
      *
      * Dato
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_dato
     o                                              '&0D'
     o                                              '&04'
      *
      * Lagerplass
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vaplas
     o                                              '&0D'
     o                                              '&04'
      *
      * Priskode
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vabesk
     o                                              '&0D'
     o                                              '&04'
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Ædata0
     o                                              '&02'
     o                       vavare
     o                                              '&0D'
     o                                              '&04'
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     o          e    21      Ædata0
     o                                              '&02'
     o                       w_lvar_u
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Ædata0
     o                                              '&02'
     o                       vaeann
     o                                              '&0D'
     o                                              '&04'
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Ædata0
     o                                              '&02'
     o                       vanobb
     o                                              '&0D'
     o                                              '&04'
      *
      * Enhet2
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vaenh2
     o                                              '&0D'
     o                                              '&04'
      *
      * Pris2
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vapri2
     o                                              '&0D'
     o                                              '&04'
      *
      * Enhet1
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vaenh1
     o                                              '&0D'
     o                                              '&04'
      *
      * Pris1
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vapri1
     o                                              '&0D'
     o                                              '&04'
      *
      * Dummy
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vadumy
     o                                              '&0D'
     o                                              '&04'
     o          e            Ædata0
     o                                              '&02'
     o                                              '&0D'
     o                                              '&03'
      *
      * Write data to label
      *
     o          e            Ædata0
     o                                              '&02&66'
     o                       vaanta
     o                                              '&03'
      *
      * Behandle standard-skriver
      *                                                                ***
     oEtikett   e            Æclr1
     o                                              '{ & } '
      *
      * Clear LLU 000002
      *
     o          e            Æclr1
     o                                              '{&S000002} '
      *
      * Clear PGM-buffer 05
      *
     o          e            Æclr1
     o                                              '{&T02} '
      *
      * Programnavn
      *
     o          e            Æpgm1
     o                                              '{&D02162'
     o                                              '! '
      *
      * Varetekst 1
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\005003003518712'
     o                                              '! '
      *
      * Varetekst 2
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\020003035009512'
     o                                              '! '
      *
      * Pris tekst
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\005168007000712'
     o                                              '! '
      *
      * Varenummertekst
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\042010006018612'
     o                                              '! '
      *
      * Varenummer
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\050005010018612'
     o                                              '! '
      *
      * Bestillingsinformasjon
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\035015007010312'
     o                                              '! '
      *
      * Alternativt varenummer
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\035060015010312'
     o                                              '! '
      *
      * Dato
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\035140008000222'
     o                                              '! '
      *
      * Lagerplass
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\036003006010222'
     o                                              '! '
      *
      * Priskode
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\020175005010312'
     o                                              '! '
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Æpgm1
     o                                              '{'
     o                                              '\0420480080121116200'
     o                                              '! '
      *
      * "Bar-code" (Lev. varenr.)
      *
     o          e    21      Æpgm1
     o                                              '{'
     o                                              '\0420480080121116200'
     o                                              '! '
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Æpgm1
     o                                              '{'
     o                                              '\0420480060121111200'
     o                                              '! '
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Æpgm1
     o                                              '{'
     o                                              '\0420480080121116200'
     o                                              '! '
      *
      * Enhet2
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\027150003018712'
     o                                              '! '
      *
      * Pris2
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\027165010009712'
     o                                              '! '
      *
      * Enhet1
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\042150003018712'
     o                                              '! '
      *
      * Pris1
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\042165010009712'
     o                                              '! '
      *
      * Dummy
      *
     o          e            Æpgm1
     o                                              '{'
     o                                              '\001002001006112'
     o                                              '! '
     o          e            Æpgm1
     o                                              '{\\\\\\\\\\\\\\\\\}'
      *
      * Write data to  LLU-000002
      *
     o          e            Ædata1
     o                                              '{&C00000202\'
     o                                              '! '
      *
      * Varetekst1
      *
     o          e            Ædata1
     o                                              '{'
     o                       vatek1
     o                                              '\'
     o                                              '! '
      *
      * Varetekst2
      *
     o          e            Ædata1
     o                                              '{'
     o                       vatek2
     o                                              '\'
     o                                              '! '
      *
      * Pristekst
      *
     o          e            Ædata1
     o                                              '{'
     o                       vatpri
     o                                              '\'
     o                                              '! '
      *
      * Varenummertekst
      *
     o          e            Ædata1
     o                                              '{'
     o                       vatvar
     o                                              '\'
     o                                              '! '
      *
      * Varenummer
      *
     o          e            Ædata1
     o                                              '{'
     o                       vavare
     o                                              '\'
     o                                              '! '
      *
      * Bestillingsinformasjon
      *
     o          e            Ædata1
     o                                              '{'
     o                       w_best
     o                                              '\'
     o                                              '! '
      *
      * Alternativt varenummer
      *
     o          e            Ædata1
     o                                              '{'
     o                       w_altv
     o                                              '\'
     o                                              '! '
      *
      * Dato
      *
     o          e            Ædata1
     o                                              '{'
     o                       w_dato
     o                                              '\'
     o                                              '! '
      *
      * Lagerplass
      *
     o          e            Ædata1
     o                                              '{'
     o                       vaplas
     o                                              '\'
     o                                              '! '
      *
      * Priskode
      *
     o          e            Ædata1
     o                                              '{'
     o                       vabesk
     o                                              '\'
     o                                              '! '
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Ædata1
     o                                              '{'
     o                       vavare
     o                                              '\'
     o                                              '! '
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     o          e    21      Ædata1
     o                                              '{'
     o                       w_lvar_u
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Ædata1
     o                                              '{'
     o                       vaeann
     o                                              '\'
     o                                              '! '
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Ædata1
     o                                              '{'
     o                       vanobb
     o                                              '\'
     o                                              '! '
      *
      * Enhet2
      *
     o          e            Ædata1
     o                                              '{'
     o                       vaenh2
     o                                              '\'
     o                                              '! '
      *
      * Pris2
      *
     o          e            Ædata1
     o                                              '{'
     o                       vapri2
     o                                              '\'
     o                                              '! '
      *
      * Enhet1
      *
     o          e            Ædata1
     o                                              '{'
     o                       vaenh1
     o                                              '\'
     o                                              '! '
      *
      * Pris1
      *
     o          e            Ædata1
     o                                              '{'
     o                       vapri1
     o                                              '\'
     o                                              '! '
      *
      * Dummy
      *
     o          e            Ædata1
     o                                              '{'
     o                       vadumy
     o                                              '\'
     o                                              '! '
     o          e            Ædata1
     o                                              '{'
     o                                              '\'
     o                                              '} '
      *
      * Write data to label
      *
     o          e            Ædata1
     o                                              '{&f'
     o                       vaanta
     o                                              '} '
      *
      * Behandle Bandit-skriver
      *                                                                ***
     oEtikett   e            Æpgm2
     o                                              '{'
      *
     o          e            Æpgm2
     o                                              '[Ct "0"]'
      *
     o          e            Æpgm2
     o                                              '[N m "m"]'
      *
     o          e            Æpgm2
     o                                              '[M n "swpaper"]'
      *
     o          e            Æpgm2
     o                                              '[M w "60.0:0:0:1"]'
     o          e            Æpgm2
     o                                              '[M l "208.0:0:0:1:direct '
     o                                              'table 100"]'
     o          e            Æpgm2
     o                                              '[M c "0"]'
     o          e            Æpgm2
     o                                              '[M m "0:00:1"]'
     o          e            Æpgm2
     o                                              '[M a "swpaper"]'
     o          e            Æpgm2
     o                                              '[D W "1" "15" "3" '
     o                                              '"swpaper" "0,0:0,0" "\N"'
      *
      * Avslutt innhold
      *
     o          e            Æpgm2
     o                                              '"\N"]'
      *
      * Etiketter
      *
     o          e            Ædata2
     o                                              '[D W "1" "15" "3" '
     o                                              '"swpaper" "0,0:0,0" "\N"'
      *
      * Varetekst 1
      *
     o          e            Ædata2
     o                                              '"C" "13.0:3.0:1" "90" '
     o                                              '"4000001:7" "35:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Varetekst 2
      *
     o          e            Ædata2
     o                                              '"C" "22.0:5.0:1" "90" '
     o                                              '"4000001:5" "35:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Bestillingsinformasjon
      *
     o          e            Ædata2
     o****                                          '"C" "28.0:05.0:1" "90" '
     o                                              '"C" "35.0:15.0:1" "90" '
     o                                              '"4000001:3" "07:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Alternativt varenummer
      *
     o          e            Ædata2
     o****                                          '"C" "28.0:50.0:1" "90" '
     o                                              '"C" "35.0:60.0:1" "90" '
     o                                              '"4000001:3" "15:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Dato
      *
     o          e            Ædata2
     o****                                          '"C" "20.0:203.0:1" "0"'
     o                                              '"C" "35.0:140.0:1" "0"'
     o                                              '"4000001:2" "8:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Lagerplass
      *
     o          e            Ædata2
     o****                                          '"C" "20.0:143.0:1" "0"'
     o                                              '"C" "30.0:003.0:1" "0"'
     o                                              '"4000001:2" "6:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Priskode
      *
     o          e            Ædata2
     o                                              '"C" "22.0:168.0:1" "90" '
     o                                              '"4000001:3" "6:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Pris tekst
      *
     o          e            Ædata2
     o                                              '"C" "15.0:168.0:1" "90" '
     o                                              '"4000001:7" "7:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Varenummertekst
      *
     o          e            Ædata2
     o****                                          '"C" "38.0:5.0:1"   "90" '
     o                                              '"C" "42.0:10.0:1"   "90" '
     o                                              '"4000001:6" "6:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Varenummer
      *
     o          e            Ædata2
     o****                                          '"C" "50.0:5.0:1" "90"  '
     o                                              '"C" "50.0:05.0:1" "90"  '
     o                                              '"4000001:6" "08:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Ædata2
     o****                                          '"A" "42.0:48.0:1" "90" '
     o                                              '"A" "50.0:48.0:1" "90" '
     o                                              '"21:+:0" "150" "12:0" '
     o                                              '"9" "\N"'
      *
      * "Bar-code" (Lev. varenr.)
      *
     o          e    21      Ædata2
     o                                              '"A" "48.0:48.0:1" "90" '
     o                                              '"21:+:0" "150" "12:0" '
     o                                              '"9" "\N"'
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Ædata2
     o                                              '"A" "48.0:48.0:1" "90" '
     o                                              '"00:+:2" "125" "12" '
     o                                              '"\N"'
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Ædata2
     o                                              '"A" "48.0:48.0:1" "90" '
     o                                              '"21:+:0" "150" "12:0" '
     o                                              '"9" "\N"'
      *
      * Enhet2
      *
     o          e            Ædata2
     o                                              '"C" "37.0:150.0:1" "90" '
     o                                              '"4000001:7" "3:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Pris2
      *
     o          e            Ædata2
     o                                              '"C" "37.0:165.0:1" "90" '
     o                                              '"4000001:7" "8:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Enhet1
      *
     o          e            Ædata2
     o                                              '"C" "52.0:150.0:1" "90" '
     o                                              '"4000001:7" "3:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Pris1
      *
     o          e            Ædata2
     o                                              '"C" "52.0:165.0:1" "90" '
     o                                              '"4000001:7" "8:0" '
     o                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Avslutt program
      *
     o          e            Ædata2
     o                                              '"\N"]'
      *
      * Start innhold
      *
     o          e            Ædata2
     o                                              '[ D w "LLU" "1" "\N"'
      *
      * Varetekst 1
      *
     o          e            Ædata2
     o                                              '"'
     o                       vatek1
     o                                              '"'
      *
      * Varetekst 2
      *
     o          e            Ædata2
     o                                              '"'
     o                       vatek2
     o                                              '"'
      *
      * Bestillingsinformasjon
      *
     o          e            Ædata2
     o                                              '"'
     o                       w_best
     o                                              '"'
      *
      * Alternativt varenummer
      *
     o          e            Ædata2
     o                                              '"'
     o                       w_altv
     o                                              '"'
      *
      * Dato
      *
     o          e            Ædata2
     o                                              '"'
     o                       w_dato
     o                                              '"'
      *
      * Lagerplass
      *
     o          e            Ædata2
     o                                              '"'
     o                       vaplas
     o                                              '"'
      *
      * Priskode
      *
     o          e            Ædata2
     o                                              '"'
     o                       vabesk
     o                                              '"'
      *
      * Pris tekst
      *
     o          e            Ædata2
     o                                              '"'
     o                       vatpri
     o                                              '"'
      *
      * Varenummertekst
      *
     o          e            Ædata2
     o                                              '"'
     o                       vatvar
     o                                              '"'
      *
      * Varenummer
      *
     o          e            Ædata2
     o                                              '"'
     o                       vavare
     o                                              '"'
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Ædata2
     o                                              '"'
     o                       vavare
     o                                              '"'
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     o          e    21      Ædata2
     o                                              '"'
     o                       w_lvar_u
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Ædata2
     o                                              '"'
     o                       vaeann
     o                                              '"'
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Ædata2
     o                                              '"'
     o                       vanobb
     o                                              '"'
      *
      * Enhet2
      *
     o          e            Ædata2
     o                                              '"'
     o                       vaenh2
     o                                              '"'
      *
      * Pris2
      *
     o          e            Ædata2
     o                                              '"'
     o                       vapri2
     o                                              '"'
      *
      * Enhet1
      *
     o          e            Ædata2
     o                                              '"'
     o                       vaenh1
     o                                              '"'
      *
      * Pris1
      *
     o          e            Ædata2
     o                                              '"'
     o                       vapri1
     o                                              '"'
      *
      * Avslutt innhold
      *
     o          e            Ædata2
     o                                              '"\N"]'
      *
      * Antall etiketter
      *
     o          e            Ædata2
     o                                            6 '[P b "'
     o               81      w_anta_1             7
     o               82      w_anta_2             8
     o               83      w_anta_3             9
     o               81                          19 ':1:swpaper"]'
     o               82                          20 ':1:swpaper"]'
     o               83                          21 ':1:swpaper"]'
      *
     o          e            Æend2
     o                                              '}'
      *
      * Behandle Meto mi-4
      *                                                                ***
     oEtikett   e            Ædata4
     o                                              '~n'
      *
     o          e            Ædata4
     o                                              '~c0000'
      *
     o          e            Ædata4
     o                                              '~e'
      *
     O          e            Ædata4
     O                                              '~M2055'
      *
     o          e            Ædata4
     o                                              '~ySPM'
      *
     o          e            Ædata4
     o                                              '~Kf0040'
      *
      * Kode for Datamax Ex-2
      *
     O          e    66      Ædata4
     o                                              '~KcLW210'
      *
     o          e            Ædata4
     o                                              '~L'
      *
     o          e            Ædata4
     o                                              'z'
      *
     o          e            Ædata4
     o                                              'D11'
      *
     o          e            Ædata4
     o                       l_hex1
      *
     o          e            Ædata4
     o                       l_hex2
      *
      * Antall etiketter
      *
     o          e            Ædata4
     o                                              'Q'
     o                       vaanta
      *
      * Varetekst 1
      *
     o          e            Ædata4
     o                                           15 '4912A1800010052'
     o                       vatek1
      *
      * Varetekst 2
      *
     o          e            Ædata4
     o*                                          15 '4912A1400010090'
     o                                           15 '4912A1800010090'
     o                       vatek2
      *
      * Bestillingspunkt
      *
     o          e    24      Ædata4
     o                                           15 '4911A1400010110'
     o                       vabpun                 '  0 , '
      *
     o          e    26      Ædata4
     o                                           15 '4911A1400550110'
     o                                              '/'
      *
      * Bestillingsmengde
      *
     o          e    25      Ædata4
     o                                           15 '4911A1400630110'
     o                       vabmen                 '  0 , '
      *
      * Bestillingsenhet
      *
     o          e    26      Ædata4
     o                                           15 '4911A1401300110'
     o                       vaenin
      *
      * Alternativt varenummer
      *
     o          e            Ædata4
     o                                           15 '4911A1201900150'
     o                       w_altv
      *
      * Dato
      *
     o          e            Ædata4
     o                                           15 '1911A1005300150'
     o                       w_dato
      *
      * Lagerplass
      *
     o          e            Ædata4
     o                                           15 '1911A1000010140'
     o                       vaplas
      *
      * Priskode
      *
     o          e            Ædata4
     o                                           15 '4912A1206800120'
     o                       vabesk
      *
      * Pristekst
      *
     o          e            Ædata4
     o                                           15 '4912A1806800060'
     o                       vatpri
      *
      * Varenr.tekst
      *
     o          e            Ædata4
     o                                           15 '4911A1800300180'
     o                       vatvar
      *
      * Eget varenr.
      *
     o          e            Ædata4
     o                                           15 '4911A1800200210'
     o                       vavare
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Ædata4
     o                                           15 '4d6305001900195'
     o                       vavare
      *
      * Eget varenr.
      *
     o          e    20      Ædata4
     o                                           15 '4911A1002100210'
     o                       vavare
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     o          e    21      Ædata4
     o                                           15 '4d6305001900195'
     o                       w_lvar
      *
      * Leverandørens varenummer
      *
     o          e    21      Ædata4
     o                                           15 '4911A1002100210'
     o                       w_lvar
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Ædata4
     o                                           15 '4F3303501900200'
     o                       vaeann
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Ædata4
     o                                           15 '4d6305001900195'
     o                       vanobb
      *
      * Nobb-nr.
      *
     o          e    23      Ædata4
     o                                           15 '4911A1002100210'
     o                       vanobb
      *
      * Enhet2
      *
     o          e            Ædata4
     o                                           15 '4611A1805900170'
     o                       vaenh2
      *
      * Pris2
      *
     o          e            Ædata4
     o                                           15 '4611A1806400170'
     o                       vapri2
      *
      * Enhet1
      *
     o          e            Ædata4
     o                                           15 '4611A1805900210'
     o                       vaenh1
      *
      * Pris1
      *
     o          e            Ædata4
     o                                           15 '4611A1806400210'
     o                       vapri1
      *
      * Sammenligningspris/enhet
      *
     o***       e    27      Ædata4
     o***                                        15 '4911A1801650090'
     o***                    w_spri
      *
      * Boks rundt prissammenligning
      *
     o***       e    27      Ædata4
     o***                                        25 '1X1100001700075B020070001'
     o***                                        28 '001'
      *
      * Varetype
      *
     o***       e            Ædata4
     o***                                        15 '4911A1002570095'
     o***                    vavtyp
      *
      * Sirkel rundt varetype
      *
     o***       e            Ædata4
     o***                                        23 '1X1100002580090C0010001'
     o***                                        27 '0010'
      *
     o          e            Ædata4
     o                                              'E'
