      /TITLE  ASOFAK: Skriver hylle etiketter
     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FP219R
      * Beskrivelse . . : Skriver hylle etiketter - 100x36 mm
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       250499 KOB  Nytt program
      * V3.30 231200 KOB  Lagt inn støtte for Eltron-skriver
      * V3.30 010501 KOB  Lagt inn støtte for Meto mi-4
      * V5.00 040303 JAF  Meto mi-4 ta HEAT og PRTSPEED fra
      *                   styrestreng 1 og 2 i Enhetsreg
      *       240604 GRO  Korr. numerisk test lev.varenr.
      * V5.50 030507 KOB  Utvidet lagerplass til 8 poisjoner
      * V5.50 110607 KOB  Fjernet støtte for Eltron-skriver
      * V5.60 210109 KOB  Lagt inn støtte for Datamax EX-2 som egen skrivertype
6.30  * 6.30  280514 BKV  LVAR økt fra 15 til 20
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvaw1pf    if   f  512    64aidisk
      *
     fEtikett   o    f  132        Printer oflind(*inof)
     *
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *               :  LOCAL DATA AREA                                 +
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     D                uds
     *
     d l_hex1                760    779
     d l_hex2                780    799
     d lctype                891    891  0
     d lcuser                911    920
     d lcfirm                944    946  0
     d l_fnav                951    980
     *
      * Definering av variable
      *
     d w_skty          s                   like(lctype)
     d w_hyle          s                   like(vahyle)
      *
     d w_best          s              7
     d w_spri          s             12
     d w_dato          s              8
     d w_altv          s             15
     d w_leng          s              2  0
     d w_lvar          s             15
     d w_lvar_5        s              5  0
     d w_lvar_6        s              6  0
     d w_lvar_7        s              7  0
     d w_lvar_8        s              8  0
     d w_lvar_u        s             19
      *
     d digits          c                   ' 0123456789'
     d nuller          c                   '00000000     '
      *
     d w_anta_1        s              1  0
     d w_anta_2        s              2  0
     d w_anta_3        s              3  0
      *
     ivaw1pf    ns  01
      *
     i                                  1    4 0vaanta
     i                                  5   19  vattxt
     i                                 20   25  vatvar
     i                                 26   30  vatenh
     i                                 31   37  vatpri
     i                                 38   45  vadato
     i                                 46   53 0vanobb
     i                                 59   66 0vavare
     i                                 74   86 0vaeann
     i                                 87  101  valvar
6.30 i                                107  141  vatek1
6.30 i                                142  176  vatek2
6.30 i                                177  179  vaenh1
6.30 i                                180  187  vapri1
6.30 i                                188  190  vaenh2
6.30 i                                191  198  vapri2
6.30 i                                199  203  vabesk
6.30 i                                204  208 0vabpun                          Bestillingspunkt
6.30 i                                209  213 0vabmen                          Bestillingsmengde
6.30 i                                214  214 0vahyle                          Type etikett
6.30 i                                215  215 0valvko                          Skriv i div. felt
6.30 i                                216  223  vaplas                          Lagerplass
6.30 i                                224  224 0vaetyp                          Etikettype
6.30 i                                225  227  vamini                          Minimumsbeholdn.(L)
6.30 i                                228  230  vamaks                          Maksimumbeholdn.(L)
6.30 i                                231  231  vavtyp                          Varetype
6.30 i                                232  234  vaenin                          Bestillingsenhet
6.30 i                                235  237  vaenps                          Sammenligningsenhet
6.30 i                                238  245  vapspr                          Pris sammenligning
      *
     i                                256  256  vadumy
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   read      vaw1pf                                 61
      *
     c                   dow       *in61 = *off
      *
      * Sjekk om riktig etikettype
      *
     c                   if        vaetyp <> 7
     c                   goto      neste
     c                   endif
      *
     c                   if        *in60 = *off
      *
     c                   eval      w_hyle = 9
      *
      * Hent skriverinformasjon
      *
     c                   eval      w_skty = lctype
      *
      * Skrivertype Meto 8100 Twinax
      *
     c     w_skty        ifeq      0
     c                   except    Æclr0
     c                   endif
      *
      * Skrivertype Meto 8100 Standard
      *
     C     w_skty        ifeq      1
     c                   except    Æclr1
     c                   endif
      *
      * Skrivertype Meto Bandit
      *
     c     w_skty        ifeq      2
     c                   except    Æpgm2
     c                   endif
      *
     c                   endif
      *
     c                   eval      *in60 = *on
      *
     c                   eval      w_dato = vadato
      *
      * Klargjør alternativt varenummer
      *
     c                   select
     c                   when      valvko = 1
     c                   movel     valvar        w_altv
     c                   when      valvko = 2
     c                   movel     vavare        w_altv
     c                   when      valvko = 3
     c                   movel     vanobb        w_altv
     c                   other
     c                   move      *blank        w_altv
     c                   endsl
      *
      * Klargjør bestillingsinformasjon
      *
     c                   eval      *in24 = *off
     c                   eval      *in25 = *off
     c                   eval      *in26 = *off
     c                   eval      *in27 = *off
     c                   eval      w_best = *blank
      *
     c                   if        vabpun <> 0
     c                   eval      *in24 = *on
     c                   endif
      *
     c                   if        vabmen <> 0
     c                   eval      *in25 = *on
     c                   endif
      *
     c                   if        vabpun <> 0 or
     c                             vabmen <> 0
     c                   eval      *in26 = *on
     c                   endif
      *
      * Klargjør sammenligningspris
      *
     c                   if        vapspr <> *blank
     c                   eval      *in27 = *on
     c                   eval      w_spri = vapspr+'/'+vaenps
     c                   endif
      *
      * Sjekk om lev.varenr. er nummerisk
      * og flytt til felt med riktig lengde
      *
     c     digits        check     valvar                                 90
      *
     c                   if        *in90 = *on
     c                   movel     nuller        w_lvar
     c                   else
     c                   eval      w_lvar = %trim(valvar)
     c                   endif
      *
      * Finn lengden på lev-varenummer
      *
     c                   move      *off          *in35
     c                   move      *off          *in36
     c                   move      *off          *in37
     c                   move      *off          *in38
     c                   move      *off          *in39
      *
     c*                  eval      w_lvar = %trim(valvar)
     c*                  eval      w_leng = %len(%trim(valvar))
     c                   eval      w_leng = %len(%trim(w_lvar))
      *
     c                   select
     c                   when      w_leng = 5
     c                   movel     w_lvar        w_lvar_5
     c                   move      *on           *in35
     c                   when      w_leng = 6
     c                   movel     w_lvar        w_lvar_6
     c                   move      *on           *in36
     c                   when      w_leng = 7
     c                   movel     w_lvar        w_lvar_7
     c                   move      *on           *in37
     c                   when      w_leng = 8
     c                   movel     w_lvar        w_lvar_8
     c                   move      *on           *in38
     c                   other
     c                   movel     w_lvar        w_lvar_u
     c                   move      *on           *in39
     c                   endsl
      *
      * Legg ut nytt program
      * hvis skifte av etikettype
      *
     c                   if        vahyle <> w_hyle
      *
      * Valg av strekkode
      *
     c                   eval      *in20 =*off
     c                   eval      *in21 =*off
     c                   eval      *in22 =*off
     c                   eval      *in23 =*off
      *
     c                   select
     c                   when      vahyle = 0
     c                   eval      *in20 =*on
     c                   when      vahyle = 1
     c                   eval      *in21 =*on
     c                   when      vahyle = 2
     c                   eval      *in22 =*on
     c                   when      vahyle = 3
     c                   eval      *in23 =*on
     c                   endsl
      *
      * Skrivertype Meto 8100 Twinax
      *
     c     w_skty        ifeq      0
     c                   except    Æpgm0
     c                   endif
      *
      * Skrivertype Meto 8100 Standard
      *
     c     w_skty        ifeq      1
     c                   except    Æpgm1
     c                   endif
      *
     c                   eval      w_hyle = vahyle
      *
     c                   endif
      *
      * Skrivertype Meto 8100 Twinax
      *
     c     w_skty        ifeq      0
     c                   eval      w_lvar_u = %trim(w_lvar) + '&0D&04'
     c                   except    Ædata0
     c                   endif
      *
      * Skrivertype Meto 8100 Standard
      *
     c     w_skty        ifeq      1
     c                   eval      w_lvar_u = %trim(w_lvar) + '\!'
     c                   except    Ædata1
     c                   endif
      *
      * Skrivertype Meto Bandit
      *
     c     w_skty        ifeq      2
     c                   eval      w_lvar_u = %trim(w_lvar) + '"'
      *
     c                   eval      *in81 = *off
     c                   eval      *in82 = *off
     c                   eval      *in83 = *off
      *
     c                   select
     c                   when      vaanta <= 9
     c                   eval      w_anta_1 = vaanta
     c                   eval      *in81 = *on
     c                   when      vaanta <= 99
     c                   eval      w_anta_2 = vaanta
     c                   eval      *in82 = *on
     c                   when      vaanta <= 500
     c                   eval      w_anta_3 = vaanta
     c                   eval      *in83 = *on
     c                   other
     c                   eval      w_anta_3 = 500
     c                   eval      *in83 = *on
     c                   endsl
      *
     c                   except    Ædata2
     c                   endif
      *
      * Skrivertype Meto mi-4
      *
     c     w_skty        ifeq      4
     c                   except    Ædata4
     c                   endif
      *
      * Skrivertype Datamax Ex-2 (Bruker samme utskrift som  Meto mi-4)
      *
     c     w_skty        ifeq      6
     c                   eval      *in66 = *on
     c                   except    Ædata4
     c                   endif
      *
     c     neste         tag
      *
     c                   read      vaw1pf                                 61
     c                   enddo
      *
     c                   goto      avslutt
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c     w_skty        ifeq      2
     c                   except    Æend2
     c                   endif
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
      *
      * Twinax-skriver
      *                                                                ***
     oEtikett   e            Æclr0
      *
      * Halo printer here am I, are you ready?
      *
     o                                              '&02&20&03'
      *
      * Clear LLU 000005
      *
     o          e            Æclr0
     o                                              '&02&53000005&03'
      *
      * Clear PGM-buffer 05
      *
     o          e            Æclr0
     o                                              '&02&5405&03'
      *
      * Program
      *
     o          e            Æpgm0
     o                                              '&02&4405132'
     o                                              '&04'
      *
      * Varetekst 1
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D002008035018512'
     o                                              '&04'
      *
      * Varetekst 2
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D009008035018212'
     o                                              '&04'
      *
      * Bestillingsinformasjon
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D015008007006112'
     o                                              '&04'
      *
      * Alternativt varenummer
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D015015015006112'
     o                                              '&04'
      *
      * Dato
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D010095008306122'
     o                                              '&04'
      *
      * Lagerplass
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D005083006006112'
     o                                              '&04'
      *
      * Priskode
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D009078008006112'
     o                                              '&04'
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Æpgm0
     o                                              '&02'
     O                                              '&0D0230080060101116200'
     o                                              '&04'
      *
      * "Bar-code" (Lev. varenr.)
      *
     O          e    21      Æpgm0
     o                                              '&02'
     O                                              '&0D0230080060101116200'
     o                                              '&04'
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Æpgm0
     o                                              '&02'
     O                                              '&0D0230080080121111200'
     o                                              '&04'
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Æpgm0
     o                                              '&02'
     O                                              '&0D0230030060101116200'
     o                                              '&04'
      *
      * Enhet2
      *
     O          e            Æpgm0
     o                                              '&02'
     o                                              '&0D017053003018512'
     o                                              '&04'
      *
      * Pris2
      *
     O          e            Æpgm0
     o                                              '&02'
     o                                              '&0D017061008009612'
     o                                              '&04'
      *
      * Enhet1
      *
     O          e            Æpgm0
     o                                              '&02'
     o                                              '&0D024053003018512'
     o                                              '&04'
      *
      * Pris1
      *
     O          e            Æpgm0
     o                                              '&02'
     o                                              '&0D024061008009612'
     o                                              '&04'
      *
      * Dummy
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D001001001006112'
     o                                              '&04'
      *
     o          e            Æpgm0
     o                                              '&02'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&0D'
     o                                              '&03'
      *
      * Write data to  LLU-000005
      *
     o          e            Ædata0
     o                                              '&02&4300000505&0D'
     o                                              '&04'
      *
      * Varetekst 1
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vatek1
     o                                              '&0D'
     o                                              '&04'
      *
      * Varetekst 2
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vatek2
     o                                              '&0D'
     o                                              '&04'
      *
      * Bestillingsinformasjon
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_best
     o                                              '&0D'
     o                                              '&04'
      *
      * Alternativt varenummer
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_altv
     o                                              '&0D'
     o                                              '&04'
      *
      * Dato
      *
     o          e            Ædata0
     o                                              '&02'
     o                       w_dato
     o                                              '&0D'
     o                                              '&04'
      *
      * Lagerplass
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vaplas
     o                                              '&0D'
     o                                              '&04'
      *
      * Priskode
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vabesk
     o                                              '&0D'
     o                                              '&04'
      *
      * "Bar-code" (Eget varenr.)
      *
     o          e    20      Ædata0
     o                                              '&02'
     o                       vavare
     o                                              '&0D'
     o                                              '&04'
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     o          e    21      Ædata0
     o                                              '&02'
     o                       w_lvar_u
      *
      * "Bar-code" (EAN-nr.)
      *
     o          e    22      Ædata0
     o                                              '&02'
     O                       vaeann
     o                                              '&0D'
     o                                              '&04'
      *
      * "Bar-code" (Nobb-nr.)
      *
     o          e    23      Ædata0
     o                                              '&02'
     o                       vanobb
     o                                              '&0D'
     o                                              '&04'
      *
      * Enhet2
      *
     O          e            Ædata0
     o                                              '&02'
     O                       vaenh2
     o                                              '&0D'
     o                                              '&04'
      *
      * Pris2
      *
     O          e            Ædata0
     o                                              '&02'
     O                       vapri2
     o                                              '&0D'
     o                                              '&04'
      *
      * Enhet1
      *
     O          e            Ædata0
     o                                              '&02'
     O                       vaenh1
     o                                              '&0D'
     o                                              '&04'
      *
      * Pris1
      *
     O          e            Ædata0
     o                                              '&02'
     O                       vapri1
     o                                              '&0D'
     o                                              '&04'
      *
      * Dummy
      *
     o          e            Ædata0
     o                                              '&02'
     o                       vadumy
     o                                              '&0D'
     o                                              '&04'
      *
     o          e            Ædata0
     o                                              '&02'
     o                                              '&0D'
     o                                              '&03'
      *
      * Write data to label
      *
     o          e            Ædata0
     o                                              '&02&66'
     o                       vaanta
     o                                              '&03'
      *                                                                ***
      * Behandle standard-skriver
      *                                                                ***
     O          e            Æclr1
     O                                              '{ & } '
      *
      * Clear LLU 000005
      *
     O          e            Æclr1
     O                                              '{&S000005} '
      *
      * Clear PGM-buffer 05
      *
     O          e            Æclr1
     O                                              '{&T05} '
      *
      * Program
      *
     O          e            Æpgm1
     O                                              '{&D05132'
     O                                              '! '
      *
      * Varetekst 1
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\002008035018512'
     O                                              '! '
      *
      * Varetekst 2
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\009008035018212'
     O                                              '! '
      *
      * Bestillingsinformasjon
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\015008007006112'
     O                                              '! '
      *
      * Alternativt varenummer
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\015026015006112'
     O                                              '! '
      *
      * Dato
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\012094008006122'
     O                                              '! '
      *
      * Lagerplass
      *
     O          e            Æpgm1
     O                                              '{'
     o                                              '\020005006006222'
     O                                              '! '
      *
      * Priskode
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\012078005006212'
     O                                              '! '
      *
      * "Bar-code" (Eget varenr.)
      *
     O          e    20      Æpgm1
     O                                              '{'
     O                                              '\0230080060101116200'
     O                                              '! '
      *
      * "Bar-code" (Lev. varenr.)
      *
     O          e    21      Æpgm1
     O                                              '{'
     O                                              '\0230080060101116200'
     O                                              '! '
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Æpgm1
     O                                              '{'
     O                                              '\0230080080121111200'
     O                                              '! '
      *
      * "Bar-code" (Nobb-nr.)
      *
     O          e    23      Æpgm1
     O                                              '{'
     O                                              '\0230030060101116200'
     O                                              '! '
      *
      * Enhet2
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\017052003018512'
     O                                              '! '
      *
      * Pris2
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\017060008009612'
     O                                              '! '
      *
      * Enhet1
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\024052003018512'
     O                                              '! '
      *
      * Pris1
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\024060008009612'
     O                                              '! '
      *
      * Dummy
      *
     O          e            Æpgm1
     O                                              '{'
     O                                              '\001001001006112'
     O                                              '! '
     O          e            Æpgm1
     O                                              '{\\\\\\\\\\\\\\}'
      *
      * Write data to  LLU-000005
      *
     O          e            Ædata1
     O                                              '{&C00000505\'
     O                                              '! '
      *
      * Varetekst
      *
     O          e            Ædata1
     O                                              '{'
     O                       vatek1
     O                                              '\'
     O                                              '! '
      *
      * Varetekst 2
      *
     O          e            Ædata1
     O                                              '{'
     O                       vatek2
     O                                              '\'
     O                                              '! '
      *
      * Bestillingsdata
      *
     O          e            Ædata1
     O                                              '{'
     O                       w_best
     O                                              '\'
     O                                              '! '
      *
      * Alternativt varenummer
      *
     O          e            Ædata1
     O                                              '{'
     O                       w_altv
     O                                              '\'
     O                                              '! '
      *
      * Dato
      *
     O          e            Ædata1
     O                                              '{'
     O                       w_dato
     O                                              '\'
     O                                              '! '
      *
      * Lagerplass
      *
     O          e            Ædata1
     O                                              '{'
     O                       vaplas
     O                                              '\'
     O                                              '! '
      *
      * Priskode
      *
     O          e            Ædata1
     O                                              '{'
     O                       vabesk
     O                                              '\'
     O                                              '! '
      *
      * "Bar-code" (Eget varenr.)
      *
     O          e    20      Ædata1
     O                                              '{'
     O                       vavare
     O                                              '\'
     O                                              '! '
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     O          e    21      Ædata1
     O                                              '{'
     O                       w_lvar_u
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Ædata1
     O                                              '{'
     O                       vaeann
     O                                              '\'
     O                                              '! '
      *
      * "Bar-code" (Nobb-nr.)
      *
     O          e    23      Ædata1
     O                                              '{'
     O                       vanobb
     O                                              '\'
     O                                              '! '
      *
      * Enhet2
      *
     O          e            Ædata1
     O                                              '{'
     O                       vaenh2
     O                                              '\'
     O                                              '! '
      *
      * Pris2
      *
     O          e            Ædata1
     O                                              '{'
     O                       vapri2
     O                                              '\'
     O                                              '! '
      *
      * Enhet1
      *
     O          e            Ædata1
     O                                              '{'
     O                       vaenh1
     O                                              '\'
     O                                              '! '
      *
      * Pris1
      *
     O          e            Ædata1
     O                                              '{'
     O                       vapri1
     O                                              '\'
     O                                              '! '
      *
      * Dummy
      *
     O          e            Ædata1
     O                                              '{'
     O                       vadumy
     O                                              '\'
     O                                              '! '
     O          e            Ædata1
     O                                              '{'
     O                                              '\'
     O                                              '} '
      *
      * Write data to label
      *
     O          e            Ædata1
     O                                              '{&f'
     O                       vaanta
     O                                              '} '
      *
      * Behandle Bandit-skriver
      *                                                                ***
     oEtikett   e            Æpgm2
     O                                              '{'
      *
     O          e            Æpgm2
     O                                              '[Ct "0"]'
      *
     O          e            Æpgm2
     O                                              '[N m "m"]'
      *
     O          e            Æpgm2
     O                                              '[M n "swpaper"]'
      *
     O          e            Æpgm2
     O                                              '[M w "38.0:0:0:1"]'
     O          e            Æpgm2
     O                                              '[M l "100.0:0:0:1:direct '
     O                                              'table 100"]'
     O          e            Æpgm2
     O                                              '[M c "0"]'
     O          e            Æpgm2
     O                                              '[M m "0:00:1"]'
     O          e            Æpgm2
     O                                              '[M a "swpaper"]'
     O          e            Æpgm2
     O                                              '[D W "1" "12" "3" '
     O                                              '"swpaper" "0,0:0,0" "\N"'
      *
      * Avslutt innhold
      *
     O          e            Æpgm2
     O                                              '"\N"]'
      *
      * Etiketter
      *
     O          e            Ædata2
     O                                              '[D W "1" "12" "3" '
     O                                              '"swpaper" "0,0:0,0" "\N"'
      *
      * Varetekst 1
      *
     O          e            Ædata2
     O                                              '"C" "5.0:3.0:1" "90" '
     O                                              '"4000001:03" "35:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Varetekst 2
      *
     O          e            Ædata2
     O                                              '"C" "9.0:3.0:1" "90" '
     O                                              '"4000001:01" "35:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Bestillingsinformasjon
      *
     O          e            Ædata2
     O                                              '"C" "15.0:3.0:1" "90"  '
     O                                              '"4000001:01" "07:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Alternativt varenummer
      *
     O          e            Ædata2
     O                                              '"C" "15.0:20.0:1" "90" '
     O                                              '"4000001:01" "15:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Dato
      *
     O          e            Ædata2
     O                                              '"C" "12.0:93.0:1" "00" '
     O                                              '"4000001:01" "8:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Lagerplass
      *
     O          e            Ædata2
     O                                              '"C" "16.0:03.0:1" "00" '
     O                                              '"4000001:01" "6:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Priskode
      *
     O          e            Ædata2
     O                                              '"C" "11.0:70.0:1" "90" '
     O                                              '"4000001:01" "5:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * "Bar-code" (Eget varenr.)
      *
     O          e    20      Ædata2
     O                                              '"A" "32.0:8.0:1" "90" '
     O                                              '"21:+:0" "125" "12:0" '
     O                                              '"9" "\N"'
      *
      * "Bar-code" (Lev. varenr.)
      *
     O          e    21      Ædata2
     O                                              '"A" "32.0:8.0:1" "90" '
     O                                              '"21:+:0" "125" "12:0" '
     O                                              '"9" "\N"'
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Ædata2
     O                                              '"A" "32.0:8.0:1" "90" '
     O                                              '"00:+:2" "125" "12:0" '
     O                                              '"\N"'
      *
      * "Bar-code" (Nobb-nr.)
      *
     O          e    23      Ædata2
     O                                              '"A" "32.0:8.0:1" "90" '
     O                                              '"21:+:0" "125" "12:0" '
     O                                              '"9" "\N"'
      *
      * Enhet2
      *
     O          e            Ædata2
     O                                              '"C" "17.0:55.0:1" "90" '
     O                                              '"4000001:04" "3:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Pris2
      *
     O          e            Ædata2
     O                                              '"C" "17.0:68.0:1" "90" '
     O                                              '"4000001:04" "8:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Enhet1
      *
     O          e            Ædata2
     O                                              '"C" "25.0:55.0:1" "90" '
     O                                              '"4000001:04" "3:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Pris1
      *
     O          e            Ædata2
     O                                              '"C" "25.0:68.0:1" "90" '
     O                                              '"4000001:04" "8:0" '
     O                                              '"" "" "1:1:2:1:1" "\N"'
      *
      * Avslutt program
      *
     O          e            Ædata2
     O                                              '"\N"]'
      *
      * Start innhold
      *
     O          e            Ædata2
     O                                              '[ D w "LLU" "1" "\N"'
      *
      * Varetekst 1
      *
     O          e            Ædata2
     O                                              '"'
     O                       vatek1
     O                                              '"'
      *
      * Varetekst 2
      *
     O          e            Ædata2
     O                                              '"'
     O                       vatek2
     O                                              '"'
      *
      * Bestillingsinformasjon
      *
     O          e            Ædata2
     O                                              '"'
     O                       w_best
     O                                              '"'
      *
      * Alternativt varenummer
      *
     O          e            Ædata2
     O                                              '"'
     O                       w_altv
     O                                              '"'
      *
      * Dato
      *
     O          e            Ædata2
     O                                              '"'
     O                       w_dato
     O                                              '"'
      *
      * Lagerplass
      *
     O          e            Ædata2
     O                                              '"'
     O                       vaplas
     O                                              '"'
      *
      * Priskode
      *
     O          e            Ædata2
     O                                              '"'
     O                       vabesk
     O                                              '"'
      *
      * "Bar-code" (Eget varenr.)
      *
     O          e    20      Ædata2
     O                                              '"'
     O                       vavare
     O                                              '"'
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     O          e    21      Ædata2
     O                                              '"'
     O                       w_lvar_u
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Ædata2
     O                                              '"'
     O                       vaeann
     O                                              '"'
      *
      * "Bar-code" (Nobb-nr.)
      *
     O          e    23      Ædata2
     O                                              '"'
     O                       vanobb
     O                                              '"'
      *
      * Enhet2
      *
     O          e            Ædata2
     O                                              '"'
     O                       vaenh2
     O                                              '"'
      *
      * Pris2
      *
     O          e            Ædata2
     O                                              '"'
     O                       vapri2
     O                                              '"'
      *
      * Enhet1
      *
     O          e            Ædata2
     O                                              '"'
     O                       vaenh1
     O                                              '"'
      *
      * Pris1
      *
     O          e            Ædata2
     O                                              '"'
     O                       vapri1
     O                                              '"'
      *
      * Avslutt innhold
      *
     O          e            Ædata2
     O                                              '"\N"]'
      *
      * Antall etiketter
      *
     O          e            Ædata2
     O                                            6 '[P b "'
     O               81      w_anta_1             7
     O               82      w_anta_2             8
     O               83      w_anta_3             9
     O               81                          19 ':1:swpaper"]'
     O               82                          20 ':1:swpaper"]'
     O               83                          21 ':1:swpaper"]'
      *
     O          e            Æend2
     O                                              '}'
      *
      * Behandle Meto mi-4
      *                                                                ***
     oEtikett   e            Ædata4
     O                                              '~n'
      *
     o          e            Ædata4
     O                                              '~c0000'
      *
     O          e            Ædata4
     O                                              '~e'
      *
     O          e            Ædata4
     O                                              '~M0500'
      *
     O          e            Ædata4
     O                                              '~ySPM'
      *
     O          e            Ædata4
     O                                              '~Kf0040'
      *
      * Kode for Datamax Ex-2
      *
     O          e    66      Ædata4
     O                                              '~KcLW135'
      *
     O          e            Ædata4
     O                                              '~L'
      *
     O          e            Ædata4
     O                                              'z'
      *
     O          e            Ædata4
     O                                              'D11'
      *
     O          e            Ædata4
     O                       l_hex1
      *
     O          e            Ædata4
     O                       l_hex2
      *
      * Antall etiketter
      *
     O          e            Ædata4
     O                                              'Q'
     O                       vaanta
      *
      * Varetekst 1
      *
     O          e            Ædata4
     O                                           15 '4311A1000010018'
     O                       vatek1
      *
      * Varetekst 2
      *
     O          e            Ædata4
     O                                           15 '4211A1000010030'
     O                       vatek2
      *
      * Bestillingsinformasjon
      *
     O          e            Ædata4
     O                                           15 '4211A1000010050'
     O                       w_best
      *
      * Bestillingsmengde - strekkode
      *
     O          e            Ædata4
     O                                           15 '4D2201903400040'
     O                       vabmen
      *
      * Alternativt varenummer
      *
     O          e            Ædata4
     O                                           15 '4211A1000650050'
     O                       w_altv
      *
      * Dato
      *
     O          e            Ædata4
     O                                           15 '1211A1003550070'
     O                       w_dato
      *
      * Lagerplass
      *
     O          e            Ædata4
     O                                           15 '1211A1000010060'
     O                       vaplas
      *
      * Priskode
      *
     O          e            Ædata4
     O                                           15 '4211A1002750060'
     O                       vabesk
      *
      * "Bar-code" (Eget varenr.)
      *
     O          e    20      Ædata4
     O                                           15 '4D0000000400120'
     O                       vavare
      *
      * "Bar-code" (Leverandørens varenr.)
      *
     O          e    21      Ædata4
     O                                           15 '4D0000000400120'
     O                       w_lvar
      *
      * "Bar-code" (EAN-nr.)
      *
     O          e    22      Ædata4
     O                                           15 '4F2203500400120'
     O                       vaeann
      *
      * "Bar-code" (Nobb-nr.)
      *
     O          e    23      Ædata4
     O                                           15 '4D0000000400120'
     O                       vanobb
      *
      * Enhet2
      *
     O          e            Ædata4
     O                                           15 '4411A1802350090'
     O                       vaenh2
      *
      * Pris2
      *
     O          e            Ædata4
     O                                           15 '4411A1802650090'
     O                       vapri2
      *
      * Enhet1
      *
     O          e            Ædata4
     O                                           15 '4411A1802350120'
     O                       vaenh1
      *
      * Pris1
      *
     O          e            Ædata4
     O                                           15 '4411A1802650120'
     O                       vapri1
      *
     O          e            Ædata4
     O                                              'E'
      *
