     /TITLE       ---  FP220R  ----       ASP a.s
     * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     *                                                                       *
     * System. . . . . : ASOFAK                                              *
     * Program . . . . : FP220R                                              *
     * Beskrivelse . . : Reg. parameter, for reklame-etiketer                *
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     *                                                                       *
     * Spesialversjon. :                                                     *
     * Tilpasset for . :                                                     *
     *                                                                       *
     * Referanse  Dato   Endringsbeskrivelse                            Sign *
     * --------- ------  ----------------------------------------------------*
     *                                                                       *
     *                                                                       *
     *                                                                       *
     * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     *
     Ffp225d    cf   e             workstn
     Fvfaspf    if   e           k disk
     Fparam     o  a f  128        disk
     *
     D mld             s             70    dim(5) ctdata perrcd(1)              MELDINGER
     *
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *               :  LOCAL DATA AREA                                 +
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     D                uds
     D lcskty                110    110  0
     D lcvalg                111    111  0
     D lcetpr                112    112  0
     D lckenh                113    113  0
     D lcken2                114    114  0
     D lcdato                115    122  0
     D lcsort                123    123  0
     *
     D lcruti                800    809
     D lcuser                911    920
     D l_firm                944    946  0
     D l_fnav                951    980
     *
     D faskey          s              3  0
     D wmeld           s                   like(mld)
     D wpin03          s              1  0
     *
     *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *  A1BLD, RUTINEN BEHANDLER INNTASTING AV FIRMANUMMER             +
     *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     C     a1tag         tag
     *
     C                   exfmt     a1bld
     *
B001 C                   if        *inkc = *on
 001 C                   move      1             wpin03
 001 C                   goto      slutt
E001 C                   endif
     *
     * Sjekk hvilket utskrifts-
     * program som skal benyttes
     *
     C                   movel     'FP226 '      lcruti
     *
     C                   move      a1skty        lcskty
     *
     C                   except    addrec
     *
     *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *  END OF JOB                                                     +
     *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     C     slutt         tag
     *
     C                   eval      *inlr = *on
     *
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     * Subrutine for initiering av program                             *
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     *
     C     *inzsr        begsr
     *
     * Parameterliste
     *
     C     *entry        plist
     C                   parm                    wpin03
     *
     C                   move      0             wpin03
     *
     * Hent skriverinformasjon
     *
     C                   eval      faskey = *zero
     C                   move      l_firm        faskey
     C     faskey        chain     vfaspf                             60
     *
B001 C                   if        *in60 = *on
 001 C                   eval      a1skty = *zero
 001 C                   eval      a1fas1 = *blank
 001 C                   eval      a1fas2 = *blank
 001 C                   eval      a1fas3 = *blank
 001 C                   eval      a1fas4 = *blank
X001 C                   else
 001 C                   move      vnskty        a1skty
 001 C                   move      vnfas1        a1fas1
 001 C                   move      vnfas2        a1fas2
 001 C                   move      vnfas3        a1fas3
 001 C                   move      vnfas4        a1fas4
E001 C                   endif
     *
     C                   endsr
      *
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *                   O   U   T   P   U   T                          +
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     Oparam     eadd         addrec
     O                       a1anta               4
     O                       a1fas1              19
     O                       a1fas2              34
     O                       a1fas3              49
     O                       a1fas4              64
     *
     *++++++++++++++++++++++  T A B E L L E R  +++++++++++++++++++++++++
**     M E L D I N G E R :
01
02
03
04
05
