     /TITLE  ASOFAK: Utskrift av talletiketter
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     *                                                                 *
     *  System. . . . . : ASOFAK                                       *
     *  Program . . . . : FP227R                                       *
     *  Beskrivelse . . : Reg. parameter, for talletiketter                  *
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     *                                                                 *
     *  Spesialversjon. :                                              *
     *  Tilpasset for . :                                              *
     *                                                                 *
     *  Referanse  Dato   Endringsbeskrivelse                     Sign.*
     *  --------- ------  ---------------------------------------------*
     *                                                                 *
     *                                                                 *
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     *
     Fvfaspf    if   e           k disk
     Fparam     o  a f  128        disk
     *
     *
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *               :  LOCAL DATA AREA                                 +
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     D                uds
     D lcskty                110    110  0
     D lcvalg                111    111  0
     D lcetpr                112    112  0
     D lckenh                113    113  0
     D lcken2                114    114  0
     D lcdato                115    122  0
     D lcsort                123    123  0
     *
     D lcruti                800    809
     D lcuser                911    920
     D lcfirm                944    946  0
     D l_fnav                951    980
     *
     D faskey          s              3  0
     *
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *          C   A   L   C   U   L   A   T   I   O   N               +
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     * Hent skriverinformasjon
     *
     C                   eval      faskey = *zero
     C                   move      lcfirm        faskey
     C     faskey        chain     vfaspf                             60
B001 C                   if        *in60 = *on
 001 C                   eval      lcskty = *zero
X001 C                   else
 001 C                   move      vnskty        lcskty
E001 C                   endif
     *
     * Sjekk hvilket utskrifts-
     * program som skal benyttes
     *
     C                   movel     'FP228 '      lcruti
     *
     C                   except    utput0
     *
     C                   eval      *inlr = *on
     *
     *
     Oparam     eadd         utput0
     O                                            4 '0001'
     O                                            6 '01'
     O                                           11 '00001'
     O          eadd         utput0
     O                                            4 '0001'
     O                                            6 '02'
     O                                           11 '00002'
     O          eadd         utput0
     O                                            4 '0001'
     O                                            6 '03'
     O                                           11 '00003'
     O          eadd         utput0
     O                                            4 '0001'
     O                                            6 '04'
     O                                           11 '00004'
     O          eadd         utput0
     O                                            4 '0001'
     O                                            6 '05'
     O                                           11 '00005'
     O          eadd         utput0
     O                                            4 '0001'
     O                                            6 '10'
     O                                           11 '00010'
     O          eadd         utput0
     O                                            4 '0001'
     O                                            6 '15'
     O                                           11 '00015'
     O          eadd         utput0
     O                                            4 '0001'
     O                                            6 '20'
     O                                           11 '00020'
     O          eadd         utput0
     O                                            4 '0001'
     O                                            6 '30'
     O                                           11 '00030'
     O          eadd         utput0
     O                                            4 '0001'
     O                                            6 '50'
     O                                           11 '00050'
     O          eadd         utput0
     O                                            4 '0001'
     O                                            6 '99'
     O                                           11 '00099'
