     /TITLE       Utskrift av etiketter fra radioterminal (ny versjon)
     H DATEDIT(*DMY) OPTION(*NODEBUGIO)
     * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     *                                                                       *
     * System. . . . . : ASOFAK                                              *
     * Program . . . . : FP255R                                              *
     * Beskrivelse . . : Utskrift av etiketter, parameter                    *
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     *                                                                       *
     * Spesialversjon. :                                                     *
     * Tilpasset for . :                                                     *
     *                                                                       *
     * Ref.   Dato  Sign Endringsbeskrivelse                               n *
     * ----- ------ ---- ------------------------------------------------- --*
     * V5.60 050110 BSA  Nytt program                                        *
     *                                                                       *
     *                                                                       *
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - * *
     *
     Fvfaspf    if   e           k disk
     Fparam     o  a f  128        disk
     *
     *
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *               :  LOCAL DATA AREA                                 +
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     *
     D                uds
     D l_etyp                111    111  0
     D l_etpr                112    112  0
     D l_ken1                113    113  0
     D l_ken2                114    114  0
     D l_dato                115    120  0
     D l_sort                121    121  0
     *
     D l_ruti                800    809
     D l_user                911    920
     D l_firm                944    946  0
     D l_fnav                951    980
      *
      * Definering av variable
      *
     D wpin03          s              1
     D w_firm          s              3  0
     d w_dato          s               d   datfmt(*iso)
     D w_anta          s              1  0 inz(1)
     D p_vare          s             15
     D p_type          s              1
     D w_type          s              1  0
     D p_pris          s              1
     D w_pris          s              1  0
     *
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *          C   A   L   C   U   L   A   T   I   O   N               +
     *
     *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *  A1BLD, Rutinen behandler utvalggstype                          +
     *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     C                   except    add001
     *
     * Oppdater local
     *
     C                   eval      l_etyp = w_type
     C                   eval      l_etpr = w_pris
     C                   eval      l_sort = vnsort
     C                   eval      l_ken1 = 1
     C                   eval      l_ken2 = 2
     C     *dmy          move      w_dato        l_dato
     *
     * Sjekker hvilket utskriftsprogram som skal benyttes
     *
 001 C                   move      *blanks       l_ruti
     *
     * Prisetikett
     *
B001 C                   if        l_etyp = 1
 001 C                   movel     'FP213 '      l_ruti
E001 C                   endif
     *
     * Hylle-etikett   75x28 mm
     *
B001 C                   if        l_etyp = 2
 001 C                   movel     'FP214 '      l_ruti
E001 C                   endif
     *
     *  Hylle-etikett  100x28 mM
     *
B001 C                   if        l_etyp = 3
 001 C                   movel     'FP215 '      l_ruti
E001 C                   endif
     *
     * Reol-etikett  202x60 mm
     *
B001 C                   if        l_etyp = 4
 001 C                   movel     'FP216 '      l_ruti
E001 C                   endif
     *
     * Hylle-etikett   76x39 mm
     *
B001 C                   if        l_etyp = 5
 001 C                   movel     'FP217 '      l_ruti
E001 C                   endif
     *
     * Hylle-etikett   48x38 mm
     *
B001 C                   if        l_etyp = 6
 001 C                   movel     'FP218 '      l_ruti
E001 C                   endif
     *
     * Hylle-etikett  100x38 mm
     *
B001 C                   if        l_etyp = 7
 001 C                   movel     'FP219 '      l_ruti
E001 C                   endif
     *
     * Reol-etikett   210x60 mm
     *
B001 C                   if        l_etyp = 8
 001 C                   movel     'FP220 '      l_ruti
E001 C                   endif
     *
     * Hylle-etikett   76x39 mm  Laser/Interform
     *
B001 C                   if        l_etyp = 9
 001 C                   movel     'FP221 '      l_ruti
E001 C                   endif
     *
     *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *  END OF JOB                                                     +
     *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     C     slutt         tag
     *
     C                   eval      *inlr = *on
     *
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     * Subrutine for initiering av program                             *
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     *
     C     *inzsr        begsr
     *
     C                   time                    w_dato
     *
     C                   move      l_firm        w_firm
     *
     * Parameterliste
     *
     C     *entry        plist
     C                   parm                    p_vare
     C                   parm                    p_type
     C                   parm                    p_pris
     *
     * Hent etikettinformasjon
     *
     c                   if        p_type = '0'
     C     vfaspf_key    chain     vfaspf                             60
B001 C                   if        *in60 = *on
 001 C                   move      1             w_type
X001 C                   else
 001 C                   move      vnetyp        w_type
E001 C                   endif
     c                   else
     c                   eval      w_type = %int(p_type)
     c                   endif
     c                   eval      w_pris = %int(p_pris)
     *
     *
     * Key for faste data etiketter
     *
     C     vfaspf_key    klist
     C                   kfld                    w_firm
     *
     C                   endsr
     *
     Oparam     eadd         add001
     O                                            1 'A'
     O                       w_firm               4
     O                       p_vare              19
     O                       w_anta              20
