     /TITLE       ---  FP410R  ----       ASP a.s
     * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     *                                                                       *
     * System. . . . . : ASOFAK                                              *
     * Program . . . . : FP410R                                              *
     * Beskrivelse . . : Vedlikehold av fast informasjon                     *
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     *                                                                       *
     * Spesialversjon. :                                                     *
     * Tilpasset for . :                                                     *
     *                                                                       *
     * Ref.   Dato  Sign Endringsbeskrivelse                               n *
     * ----- ------ ---- ------------------------------------------------- --*
     * V5.50 030407 KOB  Lagt inn kode for styring av etikett i varemottak   *
      * 6.10  260609 BSA  Oppdatert med sporingsinformasjon
6.11 * 6.10  150310 BSA  Utvidet sortering på etiketter til leverandør. Lagt *
6.11 *                   til nytt felt for prishorisont ved innhenting av    *
6.11 *                   priser.                                             *
6.12 * 6.10  160710 BSA  Utvidet sortering på etiketter med varegruppe       *
     *                                                                       *
     *                                                                       *
     * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     *
     Ffp410d    cf   e             workstn
     Fvfaspf    uf a e           k disk
     *
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *               :  DATASTRUKTURER                                  +
     *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     *
     D                uds
     D lcuser                911    920
     D l_firm                944    946  0
     D l_fnav                951    980
     *
     D w_firm          s                   like(l_firm)
     *
     *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *  A1BLD,  FASTE OPPLYSNINGER ORDRE                               +
     *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     C     a1tag         tag
     *
     C                   if        *in60 = *on
     C                   eval      a1fas1 = *blank
     C                   eval      a1fas2 = *blank
     C                   eval      a1fas3 = *blank
     C                   eval      a1fas4 = *blank
     C                   eval      a1vtxt = *blank
     C                   eval      a1etyp = *zero
     C                   eval      a1sort = *zero
5.50 C                   eval      a1motk = *zero
6.11 C                   eval      a1phor = *zero
     C                   endif
     *
     C                   if        *in60 = *off
     C                   move      vnfas1        a1fas1
     C                   move      vnfas2        a1fas2
     C                   move      vnfas3        a1fas3
     C                   move      vnfas4        a1fas4
     C                   move      vnvtxt        a1vtxt
     C                   move      vnetyp        a1etyp
     C                   move      vnsort        a1sort
5.50 C                   move      vnmotk        a1motk
6.11 C                   eval      a1phor = vnphor
     C                   endif
     *
     C     a1taga        tag
     *
     C                   exfmt     a1bld
     *
     C                   if        *inkc = *on
     C                   goto      slutt
     C                   endif
     C                   goto      slutt
     *
     C                   goto      a1taga
     *
     *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *  END OF JOB                                                     +
     *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     *
     *
     C     slutt         tag
     *
     *  OPPDATERER REGISTERET
     *
     C                   move      a1vtxt        vnvtxt
     C                   move      a1fas1        vnfas1
     C                   move      a1fas2        vnfas2
     C                   move      a1fas3        vnfas3
     C                   move      a1fas4        vnfas4
     C                   move      a1etyp        vnetyp
     C                   move      a1sort        vnsort
5.50 C                   move      a1motk        vnmotk
6.11 C                   eval      vnphor = a1phor
     *
6.10 c                   time                    vnedat
6.10 c                   time                    vnetim
6.10 c                   eval      vneusr = lcuser
     C                   if        *in60 = *off
     C                   update    vfaspfr
     C                   endif
     C                   if        *in60 = *on
6.10 c                   time                    vnodat
6.10 c                   time                    vnotim
6.10 c                   eval      vnousr = lcuser
     C                   write     vfaspfr
     C                   endif
     *
     C                   eval      *inlr = *on
     *
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     * Subrutine for initiering av program                             *
     * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     *
     C     *inzsr        begsr
     *
     *
     C                   move      l_firm        vnfirm
     C                   move      l_firm        w_firm
     *
     C     faskey        chain     vfaspf                             60
     *
     * Key for faste data etiketter
     *
     C     faskey        klist
     C                   kfld                    w_firm
     *
     C                   endsr
