     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : FP550R
      * Beskrivelse . . : Spesialpris notat, vis
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       180904 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffprnl1    if   e           k disk    rename(fprnpfr:fprnl1r)
      *
     ffp550d    cf   e             workstn
      *
      * Definering av parametre
      *
     d p_firm          s                   like(fpnfir)
     d p_kund          s                   like(fpnkun)
     d p_kpro          s                   like(fpnkpr)
     d p_vare          s                   like(fpnvar)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
      *
      * Definering av variable
      *
     d w_firm          s                   like(fpnfir)
     d w_kund          s                   like(fpnkun)
     d w_kpro          s                   like(fpnkpr)
     d w_vare          s                   like(fpnvar)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     fprnl1_key    chain     fprnl1
     c                   if        not %found                                   Ny
     c                   goto      avslutt
     c                   endif
      *
     c                   eval      c2nno1 = fpnno1
     c                   eval      c2nno2 = fpnno2
     c                   eval      c2nno3 = fpnno3
     c                   eval      c2nno4 = fpnno4
     c                   eval      c2nno5 = fpnno5
      *
      * Viser bildet
      *
     c                   exfmt     c2bld
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_kund
     c                   parm                    p_kpro
     c                   parm                    p_vare
      *
      * Key for oppslag på spesialpris notat
      *
     c     fprnl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_kund
     c                   kfld                    w_kpro
     c                   kfld                    w_vare
      *
      *
      * Henter variable fra paramter
      *
     c                   eval      w_firm = p_firm
     c                   eval      w_kund = p_kund
     c                   eval      w_kpro = p_kpro
     c                   eval      w_vare = p_vare
      *
     c                   endsr
