     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : FU700R
      * Beskrivelse . . : Henter inn høyeste kode fra loggfilen
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       160307 AMD  Nytt program
5.60  *       070108 bof  Utvidet nøkkel med år
6.nu  * R6.30 030614 bsa  Programmet gjennomgått mtp nummerutvidelser.
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
3.32 fflogl1    if   e           k disk    rename(flogpfr:flogl1r)
      *
      * Definering av parametre
      *
5.60 d p_aarr          s                   like(fuaarr)
6.nu d p_numm          s                   like(funumm)
     d p_suff          s                   like(fusuff)
     d p_kode          s                   like(fukode)
      *
      * Definering av Local data area (LDA)
      *
     d                uds
     d l_wsid                901    910
     d l_user                911    920
     d l_firm                944    946  0
      *
      * Definering av variable i nøkler
      *
5.60 d flogl1_aarr     s                   like(fuaarr)
     d flogl1_numm     s                   like(funumm)
     d flogl1_suff     s                   like(fusuff)
     d flogl1_kode     s                   like(fukode)
     d flogl1_date     s                   like(fudate)
     d flogl1_time     s                   like(futime)
      *
      * Definering av variable
      *
     d w_firm          s                   like(fufirm)
      *
      * --------------------------------------------------------------------
      * Hoved - logikk
      * --------------------------------------------------------------------
      *
      * Finner høyeste kode i loggfilen
      * og returnerer denne.
      *
     c                   exsr      hent_logg
      *
     c                   goto      avslutt
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for henting av siste transaksjon i logg - file
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     hent_logg     begsr
     c                   eval      p_kode = *blank
      *
      * Henter siste post fra logg - filen
      *
5.60 c                   eval      flogl1_aarr = p_aarr
     c                   eval      flogl1_numm = p_numm
     c                   eval      flogl1_suff = p_suff
     c                   eval      flogl1_kode = '9'
     c                   eval      flogl1_date = *hival
     c                   eval      flogl1_time = *hival
      *
     c     flogl1_key    setll     flogl1r
     c                   readp     flogl1r
      *
     c                   if        %eof
     c                   eval      p_kode = *blank
     c                   goto      end_sr
     c                   endif
      *
5.60 c                   if        fuaarr = p_aarr and
     c                             funumm = p_numm and
     c                             fusuff = p_suff
     c                   eval      p_kode = fukode
     c                   endif
      *
     c     end_sr        endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
5.60 c                   parm                    p_aarr
6.nu c                   parm                    p_numm
     c                   parm                    p_suff
     c                   parm                    p_kode
      *
      * Key for logg - filen
      *
     c     flogl1_key    klist
     c                   kfld                    w_firm
5.60 c                   kfld                    flogl1_aarr
     c                   kfld                    flogl1_numm
     c                   kfld                    flogl1_suff
     c                   kfld                    flogl1_kode
     c                   kfld                    flogl1_date
     c                   kfld                    flogl1_time
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
