     H/TITLE  ASOFAK: Vedlikehold av status-koder
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FV103R
      * Beskrivelse . . : Vedlikehold av status-koder, Ordretyper
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
5.01  * R5.01 041002 AMD  Lagt inn ordretype for internett-ordre
5.51  * R5.51 251005 AMD  Lagt inn ordretyper for plukklister
      *       030407 AMD  Fjernet igjen
      * 6.10  250609 BSA  Oppdatert med sporingsinformasjon
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     FFV103D    CF   E             WORKSTN
      *
     FFSTSL1    IF   E           K DISK
     F                                     RENAME(FSTSPFR:FSTSL1R)
     FFSTSLU    UF A E           K DISK
     F                                     RENAME(FSTSPFR:FSTSLUR)
      *
     D                UDS
6.10 d l_user                911    920
     D  DSSFIR               944    946  0
     D  l_fnav               951    980
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  A1BLD Behandle bildet for valg                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     C     A1TAGA        TAG
      *
      *  Hent opplysninger fra OFAK-KODE-REGISTER
      *
     C     STSKEY        CHAIN     FSTSL1                             90
     C     *IN90         IFEQ      *OFF
     C                   MOVE      FAAOT1        A1OT01
     C                   MOVE      FAAOT2        A1OT02
     C                   MOVE      FAAOT3        A1OT03
     C                   MOVE      FAAOT4        A1OT04
     C                   MOVE      FAAOT5        A1OT05
     C                   MOVE      FAAOT6        A1OT06
     C                   MOVE      FAAOT7        A1OT07
5.01 C                   MOVE      FAAOT8        A1OT08
5.51  *                  MOVE      FAAOTA        A1OTYA
5.51  *                  MOVE      FAAOTB        A1OTYB
5.51  *                  MOVE      FAAOTC        A1OTYC
5.51  *                  MOVE      FAAOTD        A1OTYD
5.51  *                  MOVE      FAAOTE        A1OTYE
     C                   ELSE
     C                   MOVE      *BLANK        A1OT01
     C                   MOVE      *BLANK        A1OT02
     C                   MOVE      *BLANK        A1OT03
     C                   MOVE      *BLANK        A1OT04
     C                   MOVE      *BLANK        A1OT05
     C                   MOVE      *BLANK        A1OT06
     C                   MOVE      *BLANK        A1OT07
5.01 C                   MOVE      *BLANK        A1OT08
5.51  *                  MOVE      *BLANK        A1OTYA
5.51  *                  MOVE      *BLANK        A1OTYB
5.51  *                  MOVE      *BLANK        A1OTYC
5.51  *                  MOVE      *BLANK        A1OTYD
5.51  *                  MOVE      *BLANK        A1OTYE
     C                   ENDIF
      *
      *  Vis bilde
      *
     C                   EXFMT     A1BLD
      *
      *  F3=Avslutt
      *
     C     *INKC         CABEQ     *ON           XSLUTT
      *
      *  Oppdater OFAK-KODE-REGISTER
      *
     C     STSKEY        CHAIN     FSTSLUR                            90
      *
     C                   MOVE      A1OT01        FAAOT1
     C                   MOVE      A1OT02        FAAOT2
     C                   MOVE      A1OT03        FAAOT3
     C                   MOVE      A1OT04        FAAOT4
     C                   MOVE      A1OT05        FAAOT5
     C                   MOVE      A1OT06        FAAOT6
     C                   MOVE      A1OT07        FAAOT7
5.01 C                   MOVE      A1OT08        FAAOT8
5.51  *                  MOVE      A1OTYA        FAAOTA
5.51  *                  MOVE      A1OTYB        FAAOTB
5.51  *                  MOVE      A1OTYC        FAAOTC
5.51  *                  MOVE      A1OTYD        FAAOTD
5.51  *                  MOVE      A1OTYE        FAAOTE
      *
     C     *IN90         IFEQ      *OFF
6.10 c                   time                    faaeda
6.10 c                   time                    faaeti
6.10 c                   eval      faaeus = l_user
     C                   UPDATE    FSTSLUR
     C                   ELSE
     C                   MOVE      DSSFIR        FAAFIR
6.10 c                   time                    faaoda
6.10 c                   time                    faaoti
6.10 c                   eval      faaous = l_user
6.10 c                   time                    faaeda
6.10 c                   time                    faaeti
6.10 c                   eval      faaeus = l_user
     C                   WRITE     FSTSLUR
     C                   ENDIF
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Avslutt program                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     C     XSLUTT        TAG
      *
     C                   SETON                                        LR
     C                   RETURN
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     C     *INZSR        BEGSR
      *
      *  Redefinering av nøkler
      *
     C     *LIKE         DEFINE    FAAFIR        STSFIR
      *
      *  Key for file : OFAK-KODE-REGISTER
      *
     C     STSKEY        KLIST
     C                   KFLD                    STSFIR
      *
      *  Legger inn firmanummer i nøkklene
      *
     C                   MOVE      DSSFIR        STSFIR
      *
     C                   ENDSR
