      /TITLE  ASOFAK Lev.vare, innlesing av varer - param. 1
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : FW100R
      * Beskrivelse . . : Innlesing av varer/priser fra leverandør,
      *                   parameterprogram 1
      *
      *                   Velger leverandør
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       060699 HKO  Nytt program
      *       040100 HKO  Lagt inn Andvord
      *       250200 HKO  Lagt inn Ole Moe Engros
      *       280200 HKO  Lagt inn Coward
      *       100800 HKO  Lagt inn Sørbø
      *       220800 HKO  Lagt inn Sandvik
      *       290800 HKO  Lagt inn Felleskjøpet Maskin
      *       090101 HKO  Lagt inn Smith
      *       270301 HKO  Lagt inn Norske Røtter
      *       240601 HKO  Lagt inn Emco
      *       280408 bof  Lagt inn Generelt SDV, format
5.61  *       090309 bof  Lagt inn integ.dat     format
5.62  *       110810 bof  Lagt inn kontroll-liste integ.dat     format
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffw100d    cf   e             workstn
      *
      * Definering av Local data area
      *
     d                uds
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av variable
      *
     d b_feil          s              1    inz(*off)
      *
     d w_firm          s              3  0
      *
      * Definering av konstanter
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Viser bildet
      *
     c     b1taga        tag
      *
     c                   exfmt     b1bld
      *
      * Behandling av standard funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   endsl
      *
      * Validering av input
      *
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      b1taga
     c                   endif
      *
      * Kaller program for valg av parametre
      *
     c                   call      'FW101R'
     c                   parm                    w_firm
     c                   parm                    b1valg
      *
     c                   goto      b1taga
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for sjekking av input-felter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_input   begsr
      *
     c                   eval      b_feil = *off
      *
      * Valg
      *
     c                   if        b1valg <> 1 and
     c                             b1valg <> 4 and
     c                             b1valg <> 5 and
     c                             b1valg <> 6 and
     c                             b1valg <> 7 and
     c                             b1valg <> 8 and
     c                             b1valg <> 9 and
     c                             b1valg <> 10 and
     c                             b1valg <> 11 and
     c                             b1valg <> 12 and
     c                             b1valg <> 13 and
     c                             b1valg <> 14 and
     c                             b1valg <> 15 and
     c                             b1valg <> 16 and
     c                             b1valg <> 20 and
     c                             b1valg <> 21 and
     c                             b1valg <> 22 and
     c                             b1valg <> 23 and
     c                             b1valg <> 24 and
     c                             b1valg <> 25 and
     c                             b1valg <> 27 and
     c                             b1valg <> 28 and
     c                             b1valg <> 29
     c                   eval      *in31 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
      *
     c     end_sjekk     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
