      /TITLE  ASOFAK Lev.vare, oppretter nye varer, start overføring
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : FW124R
      * Beskrivelse . . : Oppretting av nye varer, start overføring
      *
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       011198 HKO  Nytt program
      *       161103 HKO  Fjernet behandling av rabattgruppe
6.30  * 6.30  290514 BKV  LVAR økt fra 15 til 20
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffw124d    cf   e             workstn
      *
      *
      * Datastruktur for parameterliste -ut
      *
     d                 ds
     d d_list                       120
     d  d_firm                        3  0 overlay(d_list)
     d  d_ldor                        6  0 overlay(d_list:4)
6.30 d  d_lvaf                       20    overlay(d_list:10)
6.30 d  d_lvat                       20    overlay(d_list:30)
6.30 d  d_dato                         d   overlay(d_list:50) datfmt(*iso)
6.30 d  d_ipro                        5  2 overlay(d_list:60)
6.30 d  d_kpro                        5  2 overlay(d_list:65)
6.30 d  d_spro                        5  2 overlay(d_list:70)
6.30 d  d_ogrp                        2  0 overlay(d_list:75)
6.30 d  d_hgrp                        2  0 overlay(d_list:77)
6.30 d  d_ugrp                        3  0 overlay(d_list:79)
6.30 d  d_vtyp                        1    overlay(d_list:89)
6.30 d  d_kpri                        1    overlay(d_list:90)
6.30 d  d_varf                       15    overlay(d_list:91)
6.30 d  d_kvar                        1  0 overlay(d_list:106)
6.30 d  d_oppd                        1  0 overlay(d_list:107)
      *
      * Definering av parametre
      *
     d p_firm          s              3  0
     d p_ldor          s              6  0
6.30 d p_lvaf          s             20
6.30 d p_lvat          s             20
     d p_dato          s               d   datfmt(*iso)
     d p_ipro          s              5  2
     d p_kpro          s              5  2
     d p_spro          s              5  2
     d p_ogrp          s              2  0
     d p_hgrp          s              2  0
     d p_ugrp          s              3  0
     d p_vtyp          s              1
     d p_kpri          s              1
     d p_varf          s             15
     d p_kvar          s              1  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Behandler bildet
      *
     c     b1taga        tag
      *
     c                   exfmt     b1bld
      *
      * Behandling av standard funksjonstaster
      *
     c                   if        *inkc or *inkl
     c                   goto      avslutt
     c                   endif
      *
      * Henter oppdateringsvalg til datastruktur
      *
     c                   eval      d_oppd = b1valg
      *
      * Kaller overføringsprogram
      *
     c                   call      'FW620C'
     c                   parm                    d_list
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_ldor
     c                   parm                    p_lvaf
     c                   parm                    p_lvat
     c                   parm                    p_dato
     c                   parm                    p_ipro
     c                   parm                    p_kpro
     c                   parm                    p_spro
     c                   parm                    p_ogrp
     c                   parm                    p_hgrp
     c                   parm                    p_ugrp
     c                   parm                    p_vtyp
     c                   parm                    p_kpri
     c                   parm                    p_varf
     c                   parm                    p_kvar
      *
      * Flytter inngående parametre til utgående.
      *
     c                   eval      d_firm = p_firm
     c                   eval      d_ldor = p_ldor
     c                   eval      d_lvaf = p_lvaf
     c                   eval      d_lvat = p_lvat
     c                   eval      d_dato = p_dato
     c                   eval      d_ipro = p_ipro
     c                   eval      d_kpro = p_kpro
     c                   eval      d_spro = p_spro
     c                   eval      d_ogrp = p_ogrp
     c                   eval      d_hgrp = p_hgrp
     c                   eval      d_ugrp = p_ugrp
     c                   eval      d_vtyp = p_vtyp
     c                   eval      d_kpri = p_kpri
     c                   eval      d_varf = p_varf
     c                   eval      d_kvar = p_kvar
      *
      * Initiering av skjermfelter
      *
     c                   eval      b1valg = 1
      *
     c                   endsr
