      /TITLE  ASOFAK Lev.vare, oppdaterer varer/priser - start overf.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : FW128R
      * Beskrivelse . . : Oppdatering av varer/priser, start overføring
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       060699 HKO  Nytt program
6.30  * 6.30  290514 BKV  LVAR økt fra 15 til 20
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffw128d    cf   e             workstn
      *
      *
      * Datastruktur for parameterliste -ut
      *
     d                 ds
     d d_list                        96
     d  d_firm                        3  0 overlay(d_list)
     d  d_otyp                        1  0 overlay(d_list:4)
     d  d_ldor                        6  0 overlay(d_list:5)
     d  d_ogrp                        2  0 overlay(d_list:11)
     d  d_hgrp                        2  0 overlay(d_list:13)
     d  d_ugrp                        3  0 overlay(d_list:15)
6.30 d  d_lvaf                       20    overlay(d_list:18)
6.30 d  d_lvat                       20    overlay(d_list:38)
6.30 d  d_dato                         d   overlay(d_list:58) datfmt(*iso)
6.30 d  d_ipro                        5  2 overlay(d_list:68)
6.30 d  d_kpro                        5  2 overlay(d_list:73)
6.30 d  d_spro                        5  2 overlay(d_list:78)
6.30 d  d_inio                        1  0 overlay(d_list:83)
6.30 d  d_koio                        1  0 overlay(d_list:84)
6.30 d  d_saio                        1  0 overlay(d_list:85)
6.30 d  d_nypo                        1  0 overlay(d_list:86)
6.30 d  d_ltyo                        1  0 overlay(d_list:87)
6.30 d  d_oppd                        1  0 overlay(d_list:88)
      *
      * Definering av parametre
      *
     d p_firm          s              3  0
     d p_otyp          s              1  0
     d p_ldor          s              6  0
     d p_ogrp          s              2  0
     d p_hgrp          s              2  0
     d p_ugrp          s              3  0
6.30 d p_lvaf          s             20
6.30 d p_lvat          s             20
     d p_dato          s               d   datfmt(*iso)
     d p_ipro          s              5  2
     d p_kpro          s              5  2
     d p_spro          s              5  2
     d p_inio          s              1  0
     d p_koio          s              1  0
     d p_saio          s              1  0
     d p_nypo          s              1  0
     d p_ltyo          s              1  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Behandler bildet
      *
     c     b1taga        tag
      *
     c                   exfmt     b1bld
      *
      * Behandling av standard funksjonstaster
      *
     c                   if        *inkc or *inkl
     c                   goto      avslutt
     c                   endif
      *
      * Henter oppdateringsvalg til datastruktur
      *
     c                   eval      d_oppd = b1valg
      *
      * Kaller overføringsprogram
      *
     c                   call      'FW625C'
     c                   parm                    d_list
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_otyp
     c                   parm                    p_ldor
     c                   parm                    p_ogrp
     c                   parm                    p_hgrp
     c                   parm                    p_ugrp
     c                   parm                    p_lvaf
     c                   parm                    p_lvat
     c                   parm                    p_dato
     c                   parm                    p_ipro
     c                   parm                    p_kpro
     c                   parm                    p_spro
     c                   parm                    p_inio
     c                   parm                    p_koio
     c                   parm                    p_saio
     c                   parm                    p_nypo
     c                   parm                    p_ltyo
      *
      * Flytter inngående parametre til utgående.
      *
     c                   eval      d_firm = p_firm
     c                   eval      d_otyp = p_otyp
     c                   eval      d_ldor = p_ldor
     c                   eval      d_ogrp = p_ogrp
     c                   eval      d_hgrp = p_hgrp
     c                   eval      d_ugrp = p_ugrp
     c                   eval      d_lvaf = p_lvaf
     c                   eval      d_lvat = p_lvat
     c                   eval      d_dato = p_dato
     c                   eval      d_ipro = p_ipro
     c                   eval      d_kpro = p_kpro
     c                   eval      d_spro = p_spro
     c                   eval      d_inio = p_inio
     c                   eval      d_koio = p_koio
     c                   eval      d_saio = p_saio
     c                   eval      d_nypo = p_nypo
     c                   eval      d_ltyo = p_ltyo
      *
      * Initiering av skjermfelter
      *
     c                   eval      b1valg = 1
      *
     c                   endsr
