     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FX719R
      * Beskrivelse . . : Konv560: Konv560: Legger inn riktig å i loggfil
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       080108 bof  Nytt program
      * 6.10  230609 BSA  Oppdatert med sporingsinformasjon
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffloglu    uf   e           k disk    rename(flogpfr:floglur)
     ffohelr    uf   e           k disk    rename(fohepfr:fohelrr)
      *
6.10 d                uds
6.10 d l_user                911    920
      *
     d fohelr_firm     s                   like(fofirm)
     d fohelr_numm     s                   like(fonumm)
     d fohelr_suff     s                   like(fosuff)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Ordre-hode
      *
     c                   read      floglur
     c                   dow       not %eof
      *
     c                   eval      fohelr_firm = fufirm
     c                   eval      fohelr_numm = funumm
     c                   eval      fohelr_suff = fusuff
     c     fohelr_key    chain     fohelr
     c                   if        %found(fohelr)
5.60 c                   eval      fuaarr = %subdt(fobdat:*years)
6.10 c                   time                    fuedat
6.10 c                   time                    fuetim
6.10 c                   eval      fueusr = l_user
     c                   update    floglur
     c                   endif
      *
     c                   read      floglur
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppslag på ordre-hode
      *
     c     fohelr_key    klist
     c                   kfld                    fohelr_firm
     c                   kfld                    fohelr_numm
     c                   kfld                    fohelr_suff
      *
     c                   endsr
