      /TITLE  ASOFAK Konvertering, konvertering av rutineregister
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FX785R
      * Beskrivelse . . : Konvertering, konvertering av rutineregister
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       141199 HKO  Nytt program
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     faforlu    uf   e           k disk    rename(aforpfr:aforlur)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Leser og oppdaterer rutineregister
      *
     c                   read      aforlur                                90
     c                   dow       *in90 = *off
      *
     c                   select
      *
     c                   when      afruti = 'FTILB'
     c                   eval      afacpi = 15
     c                   when      afruti = 'FOBEK'
     c                   eval      afacpi = 15
     c                   when      afruti = 'FPLUKK'
     c                   eval      afacpi = 15
     c                   when      afruti = 'FPAKK'
     c                   eval      afacpi = 15
     c                   when      afruti = 'FPAKKNEG'
     c                   eval      afacpi = 15
     c                   when      afruti = 'FBEST'
     c                   eval      afacpi = 15
     c                   when      afruti = 'BPLUKK'
     c                   eval      afacpi = 15
     c                   when      afruti = 'BPAKK'
     c                   eval      afacpi = 15
     c                   when      afruti = 'BPAKKNEG'
     c                   eval      afacpi = 15
      *
     c                   when      afruti = 'FP651'
     c                   eval      afruti = 'FH601'
     c                   when      afruti = 'FO202'
     c                   eval      afruti = 'FR612'
     c                   when      afruti = 'FO204'
     c                   eval      afruti = 'FR602'
     c                   when      afruti = 'FO206'
     c                   eval      afruti = 'FR604'
     c                   when      afruti = 'FO221'
     c                   eval      afruti = 'VG601'
     c                   eval      afacpi = 15
     c                   when      afruti = 'FP601'
     c                   eval      afruti = 'VP601'
     c                   when      afruti = 'FP612'
     c                   eval      afruti = 'VP612'
     c                   when      afruti = 'FV603'
     c                   eval      afruti = 'VV603'
     c                   when      afruti = 'FV605'
     c                   eval      afruti = 'VV605'
     c                   when      afruti = 'FV611'
     c                   eval      afruti = 'VV611'
     c                   when      afruti = 'FV621'
     c                   eval      afruti = 'VV621'
     c                   when      afruti = 'FV651'
     c                   eval      afruti = 'VT601'
      *
     c                   endsl
      *
     c                   update    aforlur
      *
     c                   read      aforlur                                90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
