     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Program . . . . : FX795R
      * Beskrivelse . . : Kontroll / oppdatering / spørring loggfil
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       190307 AMD  Nytt program
5.60  * R5.60 070108 bof  Utvidet logg med år
      *
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  BRUK AV INDIKATORER
      *
      *       LR = Avslutt program
      *       30 = Protect av felter ved vise
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer
      *    60-69 = Fileindikatorer chain etc.
      *    70-79 = Arbeidsindikatorer i sub-rutiner
      *    80-89 = Arbeidsindikatorer ordinære
      *    90-99 = Benyttes ved std. sub-rutiner
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffx795d    cf   e             workstn
      *
      * Definering av Local data area
      *
     d                uds
     d l_wsid                901    910
     d l_user                911    920
     d l_firm                944    946  0
      *
      * Definering av datastruktur
      *
     d                 ds
     d d_urec                        80
     d  d_firm                        3  0 overlay(d_urec)
5.60 d  d_aarr                        4  0 overlay(d_urec:4)
5.60 d  d_numm                        6  0 overlay(d_urec:8)
5.60 d  d_suff                        2  0 overlay(d_urec:14)
5.60 d  d_kode                        1    overlay(d_urec:16)
5.60 d  d_date                         d   overlay(d_urec:17) datfmt(*iso)
5.60 d  d_time                         t   overlay(d_urec:27) timfmt(*iso)
5.60 d  d_user                       10    overlay(d_urec:35)
5.60 d  d_wsid                       10    overlay(d_urec:45)
      *
      * Definering av variable
      *
     d w_stat          s              1
     d w_firm          s              3  0
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A1WIN  - A1 Bilde for registrering av ordrenr.
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * A1WIN Behandle bilde for ordrenummer
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   z-add     10            w_acli
     c                   z-add     12            w_acpo
      *
     c     a1tag1        tag
     c                   exfmt     a1win
      *
     c                   if        *inkc = *on
     c                   goto      avslutt
     c                   endif
      *
      * Oppdatering av loggfil
      *
     c                   if        a1spop = 'O'
     c                   eval      d_firm = l_firm
     c                   eval      d_user = l_user
     c                   eval      d_wsid = l_wsid
     c                   eval      d_aarr = a1aarr
     c                   eval      d_numm = a1numm
     c                   eval      d_suff = a1suff
     c                   eval      d_kode = a1kode
     c                   time                    d_date
     c                   time                    d_time
      *
      * Kaller program for oppdatering
      *
     c                   call      'FU900R'
     c                   parm                    w_stat
     c                   parm                    d_urec
     c                   endif
      *
      * Kaller program for spørring
      *
     c                   if        a1spop = ' '
     c                   call      'FU500R'
     c                   parm                    w_firm
     c                   parm                    a1numm
     c                   parm                    a1suff
     c                   endif
      *
     c                   eval      a1numm = 0
     c                   eval      a1suff = 0
     c                   eval      a1kode = ' '
     c                   eval      a1spop = ' '
     c                   goto      a1tag1
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   eval      w_acli = 0
     c                   eval      w_acpo = 0
     c                   eval      w_firm = l_firm
      *
     c                   endsr
      *
