     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : FX890R
      * Beskrivelse . . : FIX: Bytter enhet til enhet på vare.....
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       061103 HKO  Nytt program
5.70  * prgr  121208 bof  Utvidet med prisgruppe/ varetype lager
      * 6.10  170609 BSA  Oppdatert med sporingsinformasjon
6.21  * 6.20  190511 bø   Utvidet vl710r med div. info
6.30  * 6.30  170918 bkv  Utvidet med trelast sortiment
8.01  *PRG2   100622 BOF  Utvidet prisgruppe fra 1 til 2 posisjoner
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     fvvenl1    if   e           k disk    rename(vvenpfr:vvenl1r)
      *
     fvtillu    uf   e           k disk    rename(vtilpfr:vtillur)
     fvetilu    uf   e           k disk    rename(vetipfr:vetilur)
     ffrablu    uf   e           k disk    rename(frabpfr:frablur)
     ffprilu    uf   e           k disk    rename(fpripfr:fprilur)
     ffodtlu    uf   e           k disk    rename(fodtpfr:fodtlur)
     flodtlu    uf   e           k disk    rename(lodtpfr:lodtlur)
     flfdtlu    uf   e           k disk    rename(lfdtpfr:lfdtlur)
6.30 fvvlel1    if   e           k disk    rename(vvlepfr:vvlel1r)
      *
      * Definering av Local data area
      *
     d                uds
6.10 d l_user                911    920
     d l_firm                944    946  0
5.70 d l_lage               1001   1002  0
      *
      * Definering av variable
      *
     d b_bytt          s              1    inz(*off)
      *
     d w_anta          s              2  0
      *
     d w_firm          s                   like(vefirm)
     d w_vare          s                   like(vevare)
     d w_enhe          s                   like(veenhe)
     d w_enhn          s                   like(veenhe)
5.70 d w_lage          s              2  0
5.70 d p_vtyp          s                   like(vvvtyp)
6.21 d w_udat          s                   like(vvudat)
6.21 d w_ldor          s                   like(vvldor)
6.21 d b_inlr          s              1    inz(*off)
6.30 d w_lv_nobb       s                   like(vvlnob)
6.30 d w_lv_modn       s                   like(vvlmod)
6.30 d w_lv_lldo       s                   like(vvlnle)
6.30 d w_lv_llva       s                   like(vvllva)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Tilbud
      *
     c     key01         setll     vtillu
     c     key01         reade     vtillur
     c                   dow       not %eof
      *
     c                   eval      w_vare = vtvare
     c                   eval      w_enhe = vtenh1
      *
     c                   exsr      bytt_enhet
     c                   if        b_bytt = *on
     c                   eval      vtenh1 = w_enhn
     c                   endif
      *
6.10 c                   time                    vtedat
6.10 c                   time                    vtetim
6.10 c                   eval      vteusr = l_user
     c                   update    vtillur
      *
     c     key01         reade     vtillur
     c                   enddo
      *
      * Etikett
      *
     c     key01         setll     vetilu
     c     key01         reade     vetilur
     c                   dow       not %eof
      *
     c                   eval      w_vare = vmvare
     c                   eval      w_enhe = vmenhe
      *
     c                   exsr      bytt_enhet
     c                   if        b_bytt = *on
     c                   eval      vmenhe = w_enhn
     c                   endif
      *
6.10 c                   time                    vmedat
6.10 c                   time                    vmetim
6.10 c                   eval      vmeusr = l_user
     c                   update    vetilur
      *
     c     key01         reade     vetilur
     c                   enddo
      *
      * Rabattmatrise
      *
     c     key01         setll     frablu
     c     key01         reade     frablur
     c                   dow       not %eof
      *
     c                   eval      w_vare = frvare
     c                   eval      w_enhe = frenhe
      *
     c                   exsr      bytt_enhet
     c                   if        b_bytt = *on
     c                   eval      frenhe = w_enhn
     c                   endif
      *
6.10 c                   time                    fredat
6.10 c                   time                    fretim
6.10 c                   eval      freusr = l_user
     c                   update    frablur
      *
     c     key01         reade     frablur
     c                   enddo
      *
      * Spesialpriser
      *
     c     key01         setll     fprilu
     c     key01         reade     fprilur
     c                   dow       not %eof
      *
     c                   eval      w_vare = fpvare
     c                   eval      w_enhe = fpenhe
      *
     c                   exsr      bytt_enhet
     c                   if        b_bytt = *on
     c                   eval      fpenhe = w_enhn
     c                   endif
      *
6.10 c                   time                    fpedat
6.10 c                   time                    fpetim
6.10 c                   eval      fpeusr = l_user
     c                   update    fprilur
      *
     c     key01         reade     fprilur
     c                   enddo
      *
      * Ordre-linje
      *
     c     key01         setll     fodtlu
     c     key01         reade     fodtlur
     c                   dow       not %eof
      *
     c                   eval      w_vare = fdvare
     c                   eval      w_enhe = fdenh1
      *
     c                   exsr      bytt_enhet
     c                   if        b_bytt = *on
     c                   eval      fdenh1 = w_enhn
     c                   endif
      *
6.10 c                   time                    fdedat
6.10 c                   time                    fdetim
6.10 c                   eval      fdeusr = l_user
     c                   update    fodtlur
      *
     c     key01         reade     fodtlur
     c                   enddo
      *
      * Betilling-linje
      *
     c     key01         setll     lodtlu
     c     key01         reade     lodtlur
     c                   dow       not %eof
      *
     c                   eval      w_vare = ldvare
     c                   eval      w_enhe = ldenh1
      *
     c                   exsr      bytt_enhet
     c                   if        b_bytt = *on
     c                   eval      ldenh1 = w_enhn
     c                   endif
      *
6.10 c                   time                    ldedat
6.10 c                   time                    ldetim
6.10 c                   eval      ldeusr = l_user
     c                   update    lodtlur
      *
     c     key01         reade     lodtlur
     c                   enddo
      *
      * Bestillingsforslag-linje
      *
     c     key01         setll     lfdtlu
     c     key01         reade     lfdtlur
     c                   dow       not %eof
      *
     c                   eval      w_vare = lfvare
     c                   eval      w_enhe = lfenh1
      *
     c                   exsr      bytt_enhet
     c                   if        b_bytt = *on
     c                   eval      lfenh1 = w_enhn
     c                   endif
      *
6.10 c                   time                    lfedat
6.10 c                   time                    lfetim
6.10 c                   eval      lfeusr = l_user
     c                   update    lfdtlur
      *
     c     key01         reade     lfdtlur
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Returnerer enhet det skal byttes til
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bytt_enhet    begsr
      *
     c                   eval      b_bytt = *off
      *
     c                   eval      w_anta = 0
     c                   eval      w_enhn = *blank
      *
     c                   if        w_vare = *blank
     c                   leavesr
     c                   endif
      *
     c     vvarl1_key    chain     vvarl1
     c                   if        not %found
     c                   leavesr
     c                   endif
5.70  *
5.70 c                   call      'VL710R'
5.70 c                   parm                    w_firm
5.70 c                   parm                    vvvare
5.70 c                   parm                    w_lage
5.70 c                   parm                    p_vtyp
6.21 c                   parm                    w_udat
6.21 c                   parm                    w_ldor
6.21 c                   parm                    b_inlr
6.30 c                   parm                    w_lv_nobb
6.30 c                   parm                    w_lv_modn
6.30 c                   parm                    w_lv_lldo
6.30 c                   parm                    w_lv_llva
     *
      *
5.70 c                   if        p_vtyp <> 'L' and
5.70 c                             p_vtyp <> 'S'
     c                   leavesr
     c                   endif
      *
     c     vvenl1_key    chain     vvenl1
     c                   if        not %found
      *
     c     vvenl1_key2   setll     vvenl1
     c     vvenl1_key2   reade     vvenl1
     c                   dow       not %eof
     c                   eval      w_anta = w_anta + 1
     c     vvenl1_key2   reade     vvenl1
     c                   enddo
      *
     c                   if        w_anta = 1 and
     c                             veenhe <> *blank
     c                   eval      b_bytt = *on
     c                   eval      w_enhn = veenhe
     c                   endif
      *
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppslag på vare
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_vare
      *
      * Key for oppslag på vare-enhet
      *
     c     vvenl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_vare
     c                   kfld                    w_enhe
      *
     c     vvenl1_key2   klist
     c                   kfld                    w_firm
     c                   kfld                    w_vare
      *
      * Key for les på fil
      *
     c     key01         klist
     c                   kfld                    w_firm
      *
      *
      * Henter firma fra LDA
      *
     c                   eval      w_firm = l_firm
5.70 c                   eval      w_lage = l_lage
      *
     c                   endsr
