     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Program . . . . : FX901R
      * Beskrivelse . . : FIX: Legger inn vvldor inn i vvprpf
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       310311 bof  Nytt program
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
6.23 fvvarlr    if   e           k disk    rename(vvarpfr:vvarlrr)
     fvvprlu    uf   e           k disk    rename(vvprpfr:vvprlur)
      *
      * Definering av LDA
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
      *
      * Definering av variable i nøkler
      *
     d w_firm          s                   like(vpfirm)
     d vvprlu_firm     s                   like(vpfirm)
     d vvprlu_vare     s                   like(vpvare)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c                   read      vvarlrr
     c                   dow       not %eof(vvarlr)
      *
      *
     c                   eval      vvprlu_firm = vvfirm
     c                   eval      vvprlu_vare = vvvare
      *
     c     vvprlu_key    setll     vvprlu
     c     vvprlu_key    reade     vvprlu
     c                   dow       not %eof(vvprlu)
     c                   eval      vpldor = vvldor
     c                   time                    vpedat
     c                   time                    vpetim
     c                   eval      vpeusr = l_user
     c                   update    vvprlur
     c     vvprlu_key    reade     vvprlu
     c                   enddo
      *
     c                   read      vvarlrr
     c                   enddo
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   eval      w_firm  = l_firm
      *
     c     vvprlu_key    klist
     c                   kfld                    vvprlu_firm
     c                   kfld                    vvprlu_vare
      *
     c                   endsr
