      /TITLE  Spesial program - lageroppdatering
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System  . . . . : ASOFAK
      *  Program . . . . : galkod
      *  Beskrivelse . . : Leser ark (PRN) med unspc, og legger på
      *                    undergruppe
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.
      * --------- ------  --------------------------------------------------
      *           260413  Nytt program                             BOF
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     flwexpf    if   e           k disk
     fvugrlu    uf a e           k disk    rename(vugrpfr:vugrlur)
      *
      *  Datastruktur - excel-fil
      *
     d                 ds
     d d_ex                         512
     d  d_vgrp                        7    overlay(d_ex:1)
     d  d_ogrp                        2    overlay(d_vgrp:1)
     d  d_hgrp                        2    overlay(d_vgrp:3)
     d  d_ugrp                        3    overlay(d_vgrp:5)
     d  d_unsp                        8    overlay(d_ex:38)
      *
      *  UDS Local Data Area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
      *
      *  Definering av variable i nøkler
      *
     d vugrlu_uogr     s                   like(vguogr)
     d vugrlu_uhgr     s                   like(vguhgr)
     d vugrlu_uugr     s                   like(vguugr)
      *
      *  Definering av variable
      *
     d w_firm          s                   like(vgufir)
     d digits          c                   ' 0123456789'
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Lese ekstern fil for å hente neste vare for behandling
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
      *  Lese file
      *
     c                   read      lwexpf                                 90
     c                   dow       *in90 = *off
     c                   eval      d_ex = exclin
     c                   if        %check(digits : d_ogrp) = 0 and
     c                             d_unsp <> *blank
     c                   exsr      behand
     c                   endif
      *
     c
      *
     c                   read      lwexpf                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Oppdatering av LAGER-informasjon
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     behand        begsr
      *
      *
     c                   move      d_ogrp        vugrlu_uogr
     c                   move      d_hgrp        vugrlu_uhgr
     c                   move      d_ugrp        vugrlu_uugr
     c     vugrlu_key    chain     vugrlu
     c                   if        %found(vugrlu)
     c                   eval      vgufri = d_unsp
     c                   time                    vgueda
     c                   time                    vgueti
     c                   eval      vgueus = l_user
     c                   write     vugrlur
     c                   endif
      *
     c     behand_ut     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Key for les av VARE
      *
     c     vugrlu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vugrlu_uogr
     c                   kfld                    vugrlu_uhgr
     c                   kfld                    vugrlu_uugr
      *
      *  Legge inn opplysninger i nøklene
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
