      /TITLE  Fix : konv. noen spes. tegn på vvarpf
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System  . . . . : ASOFAK
      *  Program . . . . : FX986R
      *  Beskrivelse . . : Leser hele FODTPF og konv. spes.tegn som
      *                    skaper problemer
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.
      * --------- ------  --------------------------------------------------
      *           180319  Nytt program                             BKV
8.01  *PRG2   210622 bof  Utvidet prisgruppe fra 1 til 2 posisjoner
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffodtlu    uf   e           k disk    rename(fodtpfr:fodtlur)
     f                                     prefix(xx:2)
     ffodtl1    if   e           k disk    rename(fodtpfr:fodtl1r)
      *
      *  UDS Local Data Area
      *
     d                uds
     d l_firm                944    946  0
      *
      *  Definering av variable i nøkler
      *
      *
      *  Definering av variable
      *
     d w_tek1          s                   like(fdtek1)
     d w_tek2          s                   like(fdtek2)
     d w_firm          s                   like(fdfirm)
     d w_numm          s                   like(fdnumm)
     d w_suff          s                   like(fdsuff)
     d w_line          s                   like(fdline)
     d b_oppd          s              1    inz(*off)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
      *  Lese file
      *
     c                   read      fodtl1                                 90
     c                   dow       *in90 = *off
     c
     c                   eval      b_oppd = *off
     c                   eval      w_tek1 = fdtek1
     c                   eval      w_tek2 = fdtek2
     c
     c     x'1C':' '     xlate     fdtek1        fdtek1
     c     x'1C':' '     xlate     fdtek2        fdtek2
     c
     c                   if        (w_tek1 <> fdtek1 or
     c                              w_tek2 <> fdtek2)
     c                   eval      w_firm = fdfirm
     c                   eval      w_numm = fdnumm
     c                   eval      w_suff = fdsuff
     c                   eval      w_line = fdline
     c
     c     fodtlu_key    chain     fodtlu
     c                   if        %found
     c                   eval      xxtek1 = fdtek1
     c                   eval      xxtek2 = fdtek2
     c                   eval      b_oppd = *on
     c                   update    fodtlur
     c                   endif
     c                   endif
     c                   read      fodtl1                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Legge inn opplysninger i nøklene
      *
      *
      * Key for oppslag på ordre-linje
      *
     c     fodtlu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_numm
     c                   kfld                    w_suff
     c                   kfld                    w_line
      *
     c
     c                   endsr
