     H/TITLE    Program : knvknroi   ASSERV     Sist endret: 14.10.97
     H DEBUG
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASSERV                                              *
      * Program . . . . : knvknroi                                            *
      * Beskrivelse . . : Legger nytt kundenr på register                     *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
4.61  * 150801 bø  Justert parametere                                       - *
      *                                                                     - *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     Fupdfil    o  a f  256        disk
      **
     d rec             s            256
     d p1              s             10
     d p2              s             10
     d p3              s             10
     d p4              s             10
     d p5              s             10
     d p6              s             10
      **
     c                   eval      rec = P2 + ';'
     c*                  if        p3 <> *blank
     c                   eval      rec = %trim(rec) + %trim(P3) + ';'
     c*                  endif
     c*                  if        p4 <> *blank
     c                   eval      rec = %trim(rec) + %trim(P4) + ';'
     c*                  endif
     c*                  if        p5 <> *blank
     c                   eval      rec = %trim(rec) + %trim(P5) + ';'
     c*                  endif
     c*                  if        p6 <> *blank
     c                   eval      rec = %trim(rec) + %trim(P6) + ';'
     c*                  endif
     c                   eval      rec = %trim(rec) + %trim(P1) + ';'
      *
     c                   except    ut
      *
     c                   eval      *inlr = *on
     c                   return
      *
     c     *inzsr        begsr
     c     *entry        plist
     c                   parm                    p1
     c                   parm                    p2
     c                   parm                    p3
     c                   parm                    p4
     c                   parm                    p5
     c                   parm                    p6
     c                   endsr
      *
     oupdfil    eadd         ut
     o                       rec
