      /TITLE  ASOKON Tømmer filer.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      * System  . . . . : ASOKON                                        *
      * Program . . . . : GL116R                                        *
      * Beskrivelse . . : Tømmer returfiler.                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      * Spesialversjon. :                                               *
      * Tilpasset for . :                                               *
      *                                                                 *
      * Referanse  Dato   Endringsbeskrivelse                      Sign.*
      * --------- ------  ----------------------------------------------*
      *           040195  Nytt program januar-1995.                RH   *
      *                                                                 *
      *                                                                 *
      *                                                                 *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *    60-69 = Fileindikatorer chain etc.                           *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fgur1pf    uf   e           k disk
     fgur2pf    uf   e           k disk
     fgurfpf    uf   e           k disk
     fgul1pf    uf   e           k disk
     fgul2pf    uf   e           k disk
     fgulfpf    uf   e           k disk
      *
      * Henter firmanummer:
      *
     d                uds
     d dsfirm                944    946  0
      /EJECT
      * GUR1PF:
     c                   dow       *in60 = *off
     c                   delete    gur1pfr
     c     dsfirm        reade     gur1pf                                 60
     c                   enddo
      * GUR2PF:
     c     dsfirm        setll     gur2pf
     c     dsfirm        reade     gur2pf                                 60
      *
     c                   dow       *in60 = *off
     c                   delete    gur2pfr
     c     dsfirm        reade     gur2pf                                 60
     c                   enddo
      * GURFPF:
     c     dsfirm        setll     gurfpf
     c     dsfirm        reade     gurfpf                                 60
     c                   dow       *in60 = *off
     c                   delete    gurfpfr
     c     dsfirm        reade     gurfpf                                 60
     c                   enddo
      * GULFPF:
     c     dsfirm        setll     gulfpf
     c     dsfirm        reade     gulfpf                                 60
      *
     c                   dow       *in60 = *off
     c                   delete    gulfpfr
     c                   read      gulfpf                                 60
     c                   enddo
      * GUL1PF:
     c     dsfirm        setll     gul1pf
     c     dsfirm        reade     gul1pf                                 60
      *
     c                   dow       *in60 = *off
     c                   delete    gul1pfr
     c     dsfirm        reade     gul1pf                                 60
     c                   enddo
      * GUL2PF:
     c     dsfirm        setll     gul2pf
     c     dsfirm        reade     gul2pf                                 60
      *
     c                   dow       *in60 = *off
     c                   delete    gul2pfr
     c     dsfirm        reade     gul2pf                                 60
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     *inzsr        begsr
      *
      * Starter les av GUR1PF:
      *
     c     dsfirm        setll     gur1pf
     c     dsfirm        reade     gur1pf                                 60
      *
     c                   endsr
      *
