     H/TITLE    Konvertering av ÆØÅ
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASTELE                                              *
      * Program . . . . : GL1X9R                                              *
      * Beskrivelse . . : Konvertering av ÆØÅ i GATRPF                        *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *                                                                       *
T400  * V4.00     170402  Nytt pgm. (Fil fra KLINK gir ugyldige data)    HFL  *
80701 * 80701     010708  Flere tester                                        *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     fgatrpf    uf   e           k disk
      *
     d w_reco          s                   like(gbreco)
      *
     c                   read      gatrpfr                                60                   60
      *
     C     *in60         doweq     *off
      *
     c     X'46':'Æ'     xlate     gbreco        gbreco
     c     X'77':'Ø'     xlate     gbreco        gbreco
80701c     X'14':'Ø'     xlate     gbreco        gbreco
     c     X'2A':'Å'     xlate     gbreco        gbreco
80701c     X'1B':'Å'     xlate     gbreco        gbreco
     c     X'A0':'æ'     xlate     gbreco        gbreco
     c     X'90':'ø'     xlate     gbreco        gbreco
     c     X'EF':'å'     xlate     gbreco        gbreco
     c                   update    gatrpfr
     c                   read      gatrpfr                                60
     c                   enddo
      *
     c     slutt         tag
     c                   seton                                        lr
      **
