      /TITLE  ASTELE Opprydding i filer
     h option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASTELE
      * Program . . . . : GL402R
      * Beskrivelse . . : Slette firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
      * V5.40 241106 HFL  GFASPF tas med.
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
T5.40fgfaspf    uf   e           k disk
     fglonpf    uf   e           k disk
     fgtrtpf    uf   e           k disk
     fgubfpf    uf   e           k disk
     fgulfpf    uf   e           k disk
     fgul1pf    uf   e           k disk
     fgul2pf    uf   e           k disk
     fgurfpf    uf   e           k disk
     fgur1pf    uf   e           k disk
     fgur2pf    uf   e           k disk
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
T5.40 * Status betalingsformidling
      *
T5.40c                   read      gfaspf                                 90
T5.40c                   dow       *in90 = *off
T5.40c                   if        geffir = l_firm
T5.40c                   delete    gfaspfr
T5.40c                   endif
T5.40c                   read      gfaspf                                 90
T5.40c                   enddo
      *
      * Utbetaling lønn
      *
     c                   read      glonpf                                 90
     c                   dow       *in90 = *off
     c                   if        glfirm = l_firm
     c                   delete    glonpfr
     c                   endif
     c                   read      glonpf                                 90
     c                   enddo
      *
      * Telegiro returer
      *
     c                   read      gtrtpf                                 90
     c                   dow       *in90 = *off
     c                   if        gdqfir = l_firm
     c                   delete    gtrtpfr
     c                   endif
     c                   read      gtrtpf                                 90
     c                   enddo
      *
      * Utbetalingsforslag
      *
     c                   read      gubfpf                                 90
     c                   dow       *in90 = *off
     c                   if        gafirm = l_firm
     c                   delete    gabfpfr
     c                   endif
     c                   read      gubfpf                                 90
     c                   enddo
      *
      * Feilretur
      *
     c                   read      gulfpf                                 90
     c                   dow       *in90 = *off
     c                   if        gdvfir = l_firm
     c                   delete    gulfpfr
     c                   endif
     c                   read      gulfpf                                 90
     c                   enddo
      *
      * 1. gangs retur
      *
     c                   read      gul1pf                                 90
     c                   dow       *in90 = *off
     c                   if        gdsfir = l_firm
     c                   delete    gul1pfr
     c                   endif
     c                   read      gul1pf                                 90
     c                   enddo
      *
      * 2. gangs retur
      *
     c                   read      gul2pf                                 90
     c                   dow       *in90 = *off
     c                   if        gdsfir = l_firm
     c                   delete    gul2pfr
     c                   endif
     c                   read      gul2pf                                 90
     c                   enddo
      *
      * Feilretur
      *
     c                   read      gurfpf                                 90
     c                   dow       *in90 = *off
     c                   if        gdpfir = l_firm
     c                   delete    gurfpfr
     c                   endif
     c                   read      gurfpf                                 90
     c                   enddo
      *
      * 1. gangs retur
      *
     c                   read      gur1pf                                 90
     c                   dow       *in90 = *off
     c                   if        gdnfir = l_firm
     c                   delete    gur1pfr
     c                   endif
     c                   read      gur1pf                                 90
     c                   enddo
      *
      * 2. gangs retur
      *
     c                   read      gur2pf                                 90
     c                   dow       *in90 = *off
     c                   if        gdofir = l_firm
     c                   delete    gur2pfr
     c                   endif
     c                   read      gur2pf                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
