     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : Nexstep
      * Program . . . . : XS500R
      * Beskrivelse . . : Slettekoder, spørring
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       221116 ASK  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      *       LR = Avslutt program
      *       10 = Roll
      *       11 = Rolldown
      *       12 = Sfldsp
      *       13 = Sfldspctl
      *       14 = Sflclr
      *       15 = Sflend
      *       21 = Home-key
      *       22 = Plassering av cursor
      *       30 = Protect av felter ved vise
      *    31-79 = Varsle m/feilmeldinger/skjermindikatorer
      *    80-99 = Arbeidsindikatorer
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fhentifsw  if   f  132        disk
      *
     fhentifsd  cf   e             workstn sfile(b1sfl:w_srrn)
      *
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      * Definering av parametre
      *
     d p_bane          s             60
     d p_valg          s              1
     d p_in03          s              1
     d p_fil           s             10
     d p_lib           s             10
      *
      * Definering av variabler i nøkler
      *
     d*xtsll1_kkod     s                   like(xsskod)
      *
      * Definering av variable
      *
     d w_stel          s              4  0
     d w_spge          s              4  0
     d w_srrn          s              4  0
     d w_sfrn          s                   like(w_srrn)
     d w_ssrn          s                   like(w_srrn)
     d i               s              3  0
     d j               s              3  0
ad   d w_tilgko        s             10
ad   d w_rutine        s             10
ad   d w_adv           s              3
ad   d w_status        s             10
      *
     d b_valg_ok       s              1    inz(*off)
      *
      * Definering av konstanter
      *
     d c_sfil          s              2  0 inz(10)
      *
     Ihentifsw  NS  01
     I                                  1  132  h_rec
     I                                  2   21  h_bane
     I                                 26   29  h_type
      * Forklaring på spesielle felter
      * som benyttes ved sub-files.
      * - - - - - - - - - - - - - - - - -
      * w_stel - Subfile-teller
      * w_spge - Sidestørrelse i subfile (page)
      * w_srrn - Relativt recordnummer i subfile
      * w_sfrn - Første recordnummer på siden
      * w_ssrn - Siste  recordnummer på siden
      * w_curn - Current recordnummer på siden
      * w_virn - Side og cursorplassering som skal vises
      * w_afld - Aktivt feltnavn
      * w_arow - Aktiv rad for cursor
      * w_acol - Aktiv kolonne for cursor
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      * B1SFL  - B1 Subfile - record
      * B2CTL  - B2 Subfile - control record
      * B2CMD  - B2 Eget skjermbilde for CMD-taster
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B2CTL Behandle åpningsbildet med subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Send Alt
      *
     c     b2taga        tag
      *
     c                   write     b2cmd
      *
      * Bare data
      *
     c     b2tagb        tag
      *
     c                   exsr      dsp_subfile
      *
     c                   if        w_curn > 0
     c                   eval      w_sfrn = w_curn / c_sfil
     c                   eval      w_sfrn = w_sfrn * c_sfil + 1
     c                   endif
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   eval      i = 59
     c                   dow       i > 1
     c*                  if        %subst(p_bane:9:10) = '/*' or
     c                   if        %subst(p_bane:5:10) = '/*' or
     c*                            %subst(p_bane:9:10) = '\*'
     c                             %subst(p_bane:5:10) = '\*'
     c                   eval      p_in03 = '1'
     c                   goto      avslutt
     c                   endif
     c                   if        %subst(p_bane:i:2) = '\*'
     c                   eval      i = i - 1
     c                   iter
     c                   endif
     c                   if        %subst(p_bane:i:1) = '\' or
     c                             %subst(p_bane:i:1) = '/'
     c                   eval      %subst(p_bane:i:61-i) = '\*'
     c                   leave
     c                   endif
     c                   eval      i = i - 1
     c                   enddo
     c                   goto      avslutt
     c                   when      *inke
     c                   exsr      forny
     c                   goto      b2tagb
     c                   when      *in10
     c                   exsr      crt_subfile
     c                   goto      b2tagb
     c                   when      *in11
     c                   exsr      bck_subfile
     c                   goto      b2tagb
     c                   when      *in21
     c                   eval      *in22 = *on
     c                   goto      b2taga
     c                   endsl
      *
      * Ny fil
      *
     c                   if        b2nyfi <> ' '
     c                   eval      i = %scan('*':p_bane)
     c                   if        i > 0
     c                   eval      p_bane = %subst(p_bane:1:i-1) +
     c                             %trim(b2nyfi)
     c                   else
     c                   eval      i = %scan('/':p_bane)
     c                   if        i = 0
     c                   eval      i = %scan('\':p_bane)
     c                   endif
     c                   dow       i > 0
     c                   eval      j = i
     c                   eval      i = %scan('/':p_bane:j+1)
     c                   if        i = 0
     c                   eval      i = %scan('\':p_bane:j+1)
     c                   endif
     c                   enddo
     c                   if        j > 0
     c                   eval      %subst(p_bane:j+1:60-j) = *blank
     c                   eval      p_bane = %subst(p_bane:1:j) +
     c                             %trim(b2nyfi)
     c                   endif
     c                   endif
     c                   move      '1'           p_valg
     c                   eval      b_valg_ok = *on
      *
     c                   goto      avslutt
     c                   endif
      *
      * Behandling av subfile
      *
     c                   exsr      subfile
     c                   if        b_valg_ok = *on
     c                   goto      avslutt
     c                   endif
      *
     c                   goto      b2taga
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for fornying av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     forny         begsr
      *
     c*                  if        w_sfrn <> 0
     c*    w_sfrn        chain     b1sfl
     c*                  endif
      *
     c*                  eval      xtsll1_kkod = b1kkod
     c*    xtsll1_key    setll     xtsll1
      *
     c*                  exsr      clr_subfile
     c*                  exsr      crt_subfile
      *
     c     end_forny     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for posisjonering i subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     posisjoner    begsr
      *
      * Kode
      *
     c*                  if        b2kkod <> 0
     c*                  eval      xtsll1_kkod = b2kkod
     c*    xtsll1_key    setll     xtsll1
     c*                  goto      end_pos
     c*                  endif
      *
     c*    end_pos       tag
      *
      * Blanker subfile, og fyller opp i.h.t. posisjonering
      *
     c*                  eval      *in22 = *off
      *
     c*                  exsr      clr_subfile
     c*                  exsr      crt_subfile
      *
      * Blanker posisjoneringsfelter
      *
     c*                  eval      b2kkod = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     subfile       begsr
      *
     c                   if        *in22 = *off
     c                   eval      *in22 = *on
     c                   else
     c                   eval      *in22 = *off
     c                   endif
      *
     c                   eval      w_virn = w_sfrn
      *
      * Leser og behandler subfile
      *
     c                   do        w_ssrn
     c                   readc     b1sfl
      *
     c                   if        %eof
     c                   leave
     c                   endif
      *
     c                   eval      *in22 = *off
     c                   eval      w_virn = w_srrn
      *
      * Velg
ad    *
ad    * Sjekk om denne bruker har tilgang til dette valg
ad    *
ad   c                   movel     b1valg        w_adv
     c                   eval      w_adv = '0' + w_adv
ad   c                   eval      w_tilgko = l_user
ad   c                   eval      w_rutine = 'HENTIFSR'
ad   c                   eval      w_status = *blank
ad   c                   call      'AD005R'
ad   c                   parm                    w_tilgko
ad   c                   parm                    w_rutine
ad   c                   parm                    w_adv
ad   c                   parm                    w_status
ad   c                   if        w_status = 'Sperret'
ad   c                   eval      b1valg   = *zero
     c                   update    b1sfl
ad   c                   iter
ad   c                   endif
      *
     c                   if        b1valg = 1
      *
     c                   if        b1type = 'DIR'
     c                   eval      i = %scan('*':p_bane)
     c                   eval      p_bane = %subst(p_bane:1:i-1) +
     c                             %trim(b1bane) + '\*'
     c                   eval      p_valg = ' '
     c                   eval      b_valg_ok = *on
     c                   leave
     c                   endif
      *
     c                   if        b1type = 'STMF'
     c                   eval      i = %scan('*':p_bane)
     c                   if        i > 0
     c                   eval      p_bane = %subst(p_bane:1:i-1) +
     c                             %trim(b1bane)
     c                   endif
     c                   move      b1valg        p_valg
     c                   eval      b_valg_ok = *on
     c                   leave
     c                   endif
      *
     c                   endif
      *
     c                   enddo
      *
     c     end_subfile   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for tømming av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     clr_subfile   begsr
      *
     c                   eval      *in14 = *on
     c                   write     b2ctl
     c                   eval      *in14 = *off
      *
     c                   eval      *in15 = *off
     c                   eval      w_srrn = 0
     c                   eval      w_sfrn = 0
     c                   eval      w_ssrn = 0
     c                   eval      w_spge = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å fylle opp subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     crt_subfile   begsr
      *
     c                   eval      w_spge = w_spge + c_sfil
     c                   eval      w_srrn = w_ssrn
      *
     c                   dou       w_srrn = w_spge
      *
     c                   read      HentIfsW
      *
     c                   if        %eof
     c                   eval      *in15 = *on
     c                   leave
     c                   endif
      *
     c                   if        h_type <> 'DIR'    and
     c                             h_type <> 'STMF'
     c                   iter
     c                   endif
      *
     c                   eval      w_srrn = w_srrn + 1
      *
     c*                  eval      xtsll1_kkod = xsskod
      *
     c                   eval      b1bane = h_bane
     c                   eval      b1type = h_type
      *
     c                   write     b1sfl
      *
     c                   enddo
      *
     c                   if        w_srrn > w_ssrn
     c                   eval      w_sfrn = w_ssrn + 1
     c                   endif
      *
     c                   eval      w_ssrn = w_srrn
     c                   eval      w_virn = w_sfrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å bla tilbake en side i subfilen
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bck_subfile   begsr
      *
     c                   if        *in15
     c*    xtsll1_key    setgt     xtsll1
     c                   readp     hentifsw
     c                   endif
      *
      * Leser tilbake en side
      *
     c                   eval      w_stel = 0
      *
     c                   dou       w_stel = w_ssrn + c_sfil
      *
     c                   readp     hentifsw
      *
     c                   if        %eof
     c                   leave
     c                   endif
      *
     c                   if        h_type <> 'DIR'     and
     c                             h_type <> 'STMF'
     c                   iter
     c                   endif
      *
     c                   eval      w_stel = w_stel + 1
      *
     c*                  eval      xtsll1_kkod = xsskod
      *
     c                   enddo
      *
     c                   if        %eof
     c                   close     hentifsw
     c                   open      hentifsw
     c                   endif
      *
      * Blanker og fyller opp subfile
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for display av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     dsp_subfile   begsr
      *
     c                   if        w_srrn <> 0
     c                   eval      *in12 = *on
     c                   else
     c                   write     b2cmd
     c                   endif
      *
     c                   eval      *in13 = *on
     c                   exfmt     b2ctl
      *
     c                   eval      *in12 = *off
     c                   eval      *in13 = *off
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_bane
     c                   parm                    p_valg
     c                   parm                    p_in03
     c                   parm                    p_fil
     c                   parm                    p_lib
      *
      *
      * Henter parametre, og initierer skjermbildet
      *
     c                   eval      *in22 = *on
     c                   movel     p_bane        b2bane
      *
      * Posisjonerer databasen, og fyller opp subfile
      *
     c*                  eval      xtsll1_kkod = 0
     c*    xtsll1_key    setll     xtsll1
      *
     c                   exsr      crt_subfile
      *
     c                   endsr
