      /TITLE  ASLAGR:  Håndterminalrutiner
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASLAGR
      * Program . . . . : HT702R
      * Beskrivelse . . : Overfører fil til bunt-register, PSI
      *
      * Mottar varenummer, enhet og antall i håndterminalfilen
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       020600 ASK  Nytt program
      * 6.10  160609 BSA  Oppdatert med sporingsinformasjon
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fhbtepf    if   e           k disk
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     flbdtlu    uf a e           k disk    rename(lbdtpfr:lbdtlur)
      *
6.10  * Definering av Local data area
6.10  *
6.10 d                uds
6.10 d l_user                911    920
6.10  *
      * Definering av datastrukturer
      *
      *  Datastruktur - parameter inn
      *
     d                 ds
     d d_list                        65
     d  d_firm                        3  0 overlay(d_list)
     d  d_batc                       10    overlay(d_list:4)
     d  d_numm                        6  0 overlay(d_list:14)
      *
      *  Datastruktur - håndterminalfil
      *
     d                 ds
     d d_ht                          59
     d  d_ht_head                    37    overlay(d_ht)
     d  d_ht_vare                     8    overlay(d_ht:38)
     d  d_ht_sep1                     1    overlay(d_ht:46)
     d  d_ht_enhe                     3    overlay(d_ht:47)
     d  d_ht_sep2                     1    overlay(d_ht:50)
     d  d_ht_anta                     9    overlay(d_ht:51)
      *
      * Definering av parametre
      *
     d p_list          s             64
      *
      * Definering av variable i nøkler
      *
     d vvarl1_var      s                   like(vvvare)
      *
      * Definering av variable
      *
     d w_anta_alf      s              9
      *
     d w_firm          s                   like(lvfirm)
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Leser alle rader i håndterminalfilen
      *
     c                   read      hbtepf                                 60
     c                   dow       *in60 = *off
      *
     c                   exsr      behandling
      *
     c                   read      hbtepf                                 60
     c                   enddo
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av innlest rad
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     behandling    begsr
      *
     c                   eval      d_ht = htinfo
      *
     c                   if        d_ht_vare = *blank
     c                   goto      end_behand
     c                   endif
      *
      * Finner vare
      *
     c                   eval      vvarl1_var = d_ht_vare
     c     vvarl1_key    chain     vvarl1                             61
     c                   if        *in61 = *on
     c                   goto      end_behand
     c                   endif
      *
      * Oppretter vare i lager-telle-linje-register
      *
     c                   eval      lvfirm = w_firm
     c                   eval      lvbatc = d_batc
     c                   eval      lvnumm = d_numm
     c                   eval      lvline = lvline + 4
      *
     c                   eval      lvvare = vvvare
     c                   eval      lvenh1 = d_ht_enhe
      *
     c                   eval      w_anta_alf = %subst(d_ht_anta:1:6) +
     c                                          %subst(d_ht_anta:8:2) + '0'
     c                   move      w_anta_alf    lvantt
     c                   eval      lvtek1 = vvtek1
      *
6.10 c                   time                    lvodat
6.10 c                   time                    lvotim
6.10 c                   eval      lvousr = l_user
6.10 c                   time                    lvedat
6.10 c                   time                    lvetim
6.10 c                   eval      lveusr = l_user
      *
     c                   write     lbdtlur
      *
     c     end_behand    endsr
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_list
      *
      * Key for oppslag på vare
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarl1_var
      *
      *
      * Kopierer parameterliste til datastruktur, og henter firmanummer
      *
     c                   eval      d_list = p_list
      *
     c                   eval      w_firm = d_firm
      *
     c                   endsr
