     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASLAGR
      * Program . . . . : HV700R
      * Beskrivelse . . : Vareinfo håndterminal, produsere fil - param.
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *
6.20  *       121110 BOF  Utvidet med lager på sortiment
7.xx  * 7.00  220316 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvshel1    if   e           k disk    rename(vshepfr:vshel1r)
      *
     fhv700d    cf   e             workstn
      *
      * Definering av Local data area
      *
     d                uds
     d l_firm                944    946  0
      *
      * Definering av variabler i nøkler
      *
     d vshel1_vsor     s                   like(vcvsor)
6.20 d vshel1_lage     s                   like(vclage)
      *
      * Definering av variable
      *
     d b_feil          s              1    inz(*off)
      *
     d w_udat          s               d   datfmt(*iso)
     d w_dato          s               d   datfmt(*iso)
     d w_tmst          s               z
     d w_tmst_20       s             20
     d w_memb          s             10
      *
     d w_firm          s                   like(vcfirm)
     d w_kata          s              4
     d w_katn          s              4  0
     d w_stat          s              1
     d w_text          s             20
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B1 Behandle åpningsbildet
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Behandler bilde for utvalgskriteria
      *
     c     b1tag         tag
     c                   exfmt     b1bld
      *
      * Behandling av standard funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      b1tag
     c                   when      *inki
     c                   exsr      sortiment
     c                   goto      b1tag
     c                   endsl
      *
      * Sjekker input-felter
      *
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      b1tag
     c                   endif
      *
      * Behandler bilde for håndterminaltype
      *
     c     b2tag         tag
     c                   exfmt     b2bld
      *
      * Behandling av standard funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      b1tag
     c                   endsl
      *
      * Kaller genereringsprogram avhengig av håndterminaltype
      *
     c     *dmy          move      b1dato        w_dato
      *
     c                   time                    w_tmst
     c     *iso0         move      w_tmst        w_tmst_20
      *
     c                   eval      w_memb = 'H' + %subst(w_tmst_20:9:9)
      *
     c                   select
     c                   when      b2valg = 1
     c                   call      'HV701C'
     c                   parm                    w_firm
     c                   parm                    b1vsor
     c                   parm                    w_dato
     c                   parm                    b1kat1
     c                   parm                    b1kat2
     c                   parm                    b1kat3
     c                   parm                    b1kat4
     c                   parm                    b1kat5
     c                   parm                    w_memb
6.20 c                   parm                    b1lage
     c                   when      b2valg = 2
     c                   call      'HV702C'
     c                   parm                    w_firm
     c                   parm                    b1vsor
     c                   parm                    w_dato
     c                   parm                    b1kat1
     c                   parm                    b1kat2
     c                   parm                    b1kat3
     c                   parm                    b1kat4
     c                   parm                    b1kat5
     c                   parm                    w_memb
6.20 c                   parm                    b1lage
     c                   when      b2valg = 3
     c                   call      'HV703C'
     c                   parm                    w_firm
     c                   parm                    b1vsor
     c                   parm                    w_dato
     c                   parm                    b1kat1
     c                   parm                    b1kat2
     c                   parm                    b1kat3
     c                   parm                    b1kat4
     c                   parm                    b1kat5
     c                   parm                    w_memb
6.20 c                   parm                    b1lage
     c                   other
     c                   goto      b2tag
     c                   endsl
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Behandling av spørringer
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     spØrring      begsr
      *
      * Varesortiment
      *
     c                   if        wactfe = 'B1VSOR'
     c                   call      'VC500R'
     c                   parm                    w_firm
     c                   parm                    b1vsor
     c                   parm                    b1besk
     c                   goto      end_spØrr
     c                   endif
6.20  *
6.20  * Lager
6.20  *
6.20 c                   if        wactfe = 'B1LAGE'
6.20 c                   call      'RA510R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    b1lage
6.20 c                   parm                    b1ltxt
6.20 c                   goto      end_spØrr
6.20 c                   endif
      *
      * Kundekategori
      *
     c                   if        wactfe = 'B1KAT1'
     c                   move      b1kat1        w_katn
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    w_katn
     c                   parm                    b1kte1
     c                   move      w_katn        b1kat1
     c                   goto      end_spØrr
     c                   endif
      *
     c                   if        wactfe = 'B1KAT2'
     c                   move      b1kat2        w_katn
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    w_katn
     c                   parm                    b1kte2
     c                   move      w_katn        b1kat2
     c                   goto      end_spØrr
     c                   endif
      *
     c                   if        wactfe = 'B1KAT3'
     c                   move      b1kat3        w_katn
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    w_katn
     c                   parm                    b1kte3
     c                   move      w_katn        b1kat3
     c                   goto      end_spØrr
     c                   endif
      *
     c                   if        wactfe = 'B1KAT4'
     c                   move      b1kat4        w_katn
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    w_katn
     c                   parm                    b1kte4
     c                   move      w_katn        b1kat4
     c                   goto      end_spØrr
     c                   endif
      *
     c                   if        wactfe = 'B1KAT5'
     c                   move      b1kat5        w_katn
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    w_katn
     c                   parm                    b1kte5
     c                   move      w_katn        b1kat5
     c                   goto      end_spØrr
     c                   endif
      *
     c     end_spØrr     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekker input-felter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_input   begsr
      *
     c                   eval      b_feil = *off
     c                   eval      b1besk = *blank
      *
      * Varesortiment
      *
     c                   if        b1vsor = *blank
     c                   eval      *in31  = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
      *
     c                   eval      vshel1_vsor = b1vsor
6.20 c                   eval      vshel1_lage = b1lage
     c     vshel1_key    chain     vshel1                             32
     c                   if        *in32 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
      *
     c                   eval      b1besk = vcbesk
6.20  *
6.20  * Lager
6.20  *
6.20 c                   if        b1lage <>0
6.20 c                   call      'RS710R '
6.20 c                   parm                    w_stat
6.20 c                   parm                    b1lage
6.20 c                   parm                    b1ltxt
6.20 c                   if        w_stat <> *blank
6.20 c                   eval      *in33  = *on
6.20 c                   eval      b_feil = *on
6.20 c                   goto      end_sjekk
6.20 c                   endif
6.20 c                   endif
      *
      * Dato
      *
     c                   if        b1dato = 0
     c     *dmy          move      w_udat        b1dato
     c                   endif
      *
     c     *dmy          test(d)                 b1dato                 33
     c                   if        *in33
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
      *
      * Kundekategori
      *
     c                   if        b1kat1 <> *blank and
     c                             b1kat1 <> 'ALLE'
     c                   eval      w_kata = b1kat1
     c                   exsr      kat_alf
     c                   eval      b1kat1 = w_kata
     c                   move      b1kat1        w_katn
     c                   call      'RS711R'
     c                   parm                    w_stat
     c                   parm                    w_katn
     c                   parm                    w_text
      *
     c                   if        w_stat = 'N'
     c                   eval      *in34 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
     c                   endif
      *
     c                   if        b1kat2 <> *blank and
     c                             b1kat2 <> 'ALLE'
     c                   eval      w_kata = b1kat2
     c                   exsr      kat_alf
     c                   eval      b1kat2 = w_kata
     c                   move      b1kat2        w_katn
     c                   call      'RS711R'
     c                   parm                    w_stat
     c                   parm                    w_katn
     c                   parm                    w_text
      *
     c                   if        w_stat = 'N'
     c                   eval      *in35 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
     c                   endif
      *
     c                   if        b1kat3 <> *blank and
     c                             b1kat3 <> 'ALLE'
     c                   eval      w_kata = b1kat3
     c                   exsr      kat_alf
     c                   eval      b1kat3 = w_kata
     c                   move      b1kat2        w_katn
     c                   call      'RS711R'
     c                   parm                    w_stat
     c                   parm                    w_katn
     c                   parm                    w_text
      *
     c                   if        w_stat = 'N'
     c                   eval      *in36 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
     c                   endif
      *
     c                   if        b1kat4 <> *blank and
     c                             b1kat4 <> 'ALLE'
     c                   eval      w_kata = b1kat4
     c                   exsr      kat_alf
     c                   eval      b1kat4 = w_kata
     c                   move      b1kat4        w_katn
     c                   call      'RS711R'
     c                   parm                    w_stat
     c                   parm                    w_katn
     c                   parm                    w_text
      *
     c                   if        w_stat = 'N'
     c                   eval      *in37 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
     c                   endif
      *
     c                   if        b1kat5 <> *blank and
     c                             b1kat5 <> 'ALLE'
     c                   eval      w_kata = b1kat5
     c                   exsr      kat_alf
     c                   eval      b1kat5 = w_kata
     c                   move      b1kat5        w_katn
     c                   call      'RS711R'
     c                   parm                    w_stat
     c                   parm                    w_katn
     c                   parm                    w_text
      *
     c                   if        w_stat = 'N'
     c                   eval      *in38 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
     c                   endif
      *
     c     end_sjekk     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Overgang til vedlikhold av varesortiment
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sortiment     begsr
      *
     c                   call      'VC100R'
      *
     c     end_sortiment endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for redigering av alfanumerisk kundekategori
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     kat_alf       begsr
      *
     c                   select
     c                   when      %len(%trim(w_kata)) = 1
     c                   eval      w_kata = '000' + %trim(w_kata)
     c                   when      %len(%trim(w_kata)) = 2
     c                   eval      w_kata = '00' + %trim(w_kata)
     c                   when      %len(%trim(w_kata)) = 3
     c                   eval      w_kata = '0' + %trim(w_kata)
     c                   endsl
      *
     c     end_kat_alf   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppslag på varesortiment-hode
      *
     c     vshel1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vshel1_vsor
6.20 c                   kfld                    vshel1_lage
      *
      *
      * Henter firma fra parameter
      *
     c                   eval      w_firm = l_firm
      *
      * Initierer skjerm-felter
      *
     c                   time                    w_udat
     c     *dmy          move      w_udat        b1dato
      *
     c                   endsr
