     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASNAVIOKO
      * Program . . . . : IG099R
      * Beskrivelse . . : Setter kode for NAV at økonomi er satt
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      * 6.20  070714 ASK  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffstsl1    uf   e           k disk    rename(fstspfr:fstspfr)
      *
     fig099d    cf   e             workstn
      *
      * Local Data Area
      *
     d                uds
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av variable
      *
     d w_firm          s                   like(faafir)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Leser statusrecord og setter kode for økonomisystem til Navision
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   eval      navoko = 0
     c                   eval      nxtoko = 0
      *
     c     stskey        chain     fstsl1
     c                   if        %found
     c                   if        faak03 = 5
     c                   eval      navoko = 1
     c                   endif
     c                   eval      nxtoko = faak04
     c                   exfmt     a1bld
     c                   else
     c                   goto      slutt
     c                   endif
      *
      *  F3=Avslutt
      *
     c                   if        *inkc = *on
     c                   goto      slutt
     c                   endif
      *
     c                   if        navoko = 1
     c                   eval      faak03 = 5
     c                   else
     c                   eval      faak03 = 0
     c                   endif
     c                   eval      faak04 = nxtoko
     c                   update    fstspfr
      *
      *  Avslutt program
      *
     c     slutt         tag
     c                   seton                                        lr
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Key for file : OFAK-KODE-REGISTER
      *
     c     stskey        klist
     c                   kfld                    w_firm
      *
      * Setter inn parameterverdier
      *
     c                   eval      w_firm = l_firm
     c                   eval      a1fnav = l_fnav
      *
     c                   endsr
