     h/Title  ASVADM: Oppretter standardverdier
     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASVADM
      * Program . . . . : JA901R
      * Beskrivelse . . : Oppretter standardverdier i rutineregisteret
      *
      * spesialversjon. :
      * tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      * V5.40 150406 KOB  Oppdatert med nye rutiner
      * V5.50 021107 KOB  Fjernet oppdatering hvis rutinen finnes fra før
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     faforlu    uf a e           k disk    rename(aforpfr:aforlur)
      *
     d rut1            s             80    dim(14) ctdata perrcd(1)              rutiner-1
     d rut2            s             80    dim(14) ctdata perrcd(1)              rutiner-2
      *
     d                 ds
     d  a2rec1                 1     80
     d  a2ruti                 1     10
     d  a2prog                11     20
     d  a2txt1                21     60
     d  a2form                61     70
     d  a2outq                71     80
      *
     d                 ds
     d  a2rec2                 1     80
     d  a2acpi                 1      2  0
     d  a2alin                 3      5  0
     d  a2oflw                 6      8  0
     d  a2akop                 9     11  0
     d  a2hldq                12     12
     d  a2prty                13     13
     d  a2inst                14     14  0
     d  a2prfi                15     15  0
     d  a2bgir                16     16  0
     d  a2mvak                19     19  0
     d  a2ocrk                20     20  0
     d  a2apos                21     23  0
     d  a2kidd                24     24  0
     d  a2chgv                25     25  0
      *
     d                uds
     d  l_firm               944    946  0
     d  l_fnav               951    980
      *
      * Definering av variabler i nøkler
      *
     d aforlu_ruti     s                   like(afruti)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Oppretter standard rutiner                                     *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c                   move      *zero         i
     c     i             doueq     14
     c                   add       1             i
     c                   move      rut1(i)       a2rec1
     c                   move      rut2(i)       a2rec2
      *
     c                   move      a2ruti        aforlu_ruti
     c     aforlu_key    chain     aforlur                            90
      *
     c                   if        not%found
     c                   move      a2ruti        afruti
     c                   move      a2txt1        aftxt1
     c                   move      *blank        aftxt2
     c                   move      *blank        afmld1
     c                   move      *blank        afmld2
     c                   move      *blank        afmld3
     c                   move      a2form        afform
     c                   move      a2outq        afoutq
     c                   move      a2acpi        afacpi
     c                   move      a2alin        afalin
     c                   move      a2apos        afapos
     c                   move      a2oflw        afoflw
     c                   move      a2akop        afakop
     c                   move      a2hldq        afhldq
     c                   move      *zeros        afsave
     c                   move      a2prty        afprty
     c                   move      a2inst        afinst
     c                   move      a2prfi        afprfi
     c                   move      a2bgir        afbgir
     c                   move      a2mvak        afmvak
     c                   move      a2kidd        afkidk
     c                   move      a2ocrk        afocrk
     c                   move      *zeros        afipds
     c                   move      *blank        afhex1
     c                   move      *blank        afhex2
     c                   move      a2prog        afprog
     c                   move      a2chgv        afchgv
     c                   move      *blank        aftvbt
     c                   move      *blank        af0rot
     c                   move      *zeros        afskin
     c                   move      *zeros        afskut
     c                   move      *blank        afpkva
     c                   move      *blank        afdplx
     c                   move      *zeros        afarki
     c                   move      *zeros        afetik
     c                   move      *zeros        afwork
     c                   move      *zeros        afpdfa
      *
     c                   write     aforlur
     c                   endif
      *
     c***                if        %found
     c***                move      a2txt1        aftxt1
     c***                move      a2acpi        afacpi
     c***                move      a2alin        afalin
     c***                move      a2apos        afapos
     c***                move      a2oflw        afoflw
     c***                move      a2chgv        afchgv
      *
     c***                update    aforlur
     c***                endif
      *
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Avslutt program                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
      *
     c                   seton                                        lr
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     csr   *inzsr        begsr
      *
      *  Nullstilling av felter som ikke kan redefineres
      *
     c                   move      *zero         i                 2 0
      *
      *  Key for file : Formular-rutine-register
      *
     c     aforlu_key    klist
     c                   kfld                    aforlu_ruti
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Tar inn parameter fra forrige program                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     csr                 endsr
      *
**     R u t i n e r  (1)
JH601               Utskrift av vareavtaler                 *STD      *JOB
JM601               Kampanje-vare, utskrift                 *STD      *JOB
JM621               Kampanje-vare, kontr-/journal ovføring  *STD      *JOB
JO601               Matching, Utskrift matchede varer       *STD      *JOB
JO611               Matching, Utskrift ikke matchede varer  *STD      *JOB
JO651               Matching, Oppdatering av EVR - kontr/jrn*STD      *JOB
JP601               Utskrift av betingelser                 *STD      *JOB
JU601               Modultekst, utskrift                    *STD      *JOB
JV601               Utskrift av vareregister, pris-/vareinfo*STD      *JOB
JV602               Utskrift av vareregister, vare-/søketeks*STD      *JOB
JV621               Overføring av nye varer til EVR, kontr./*STD      *JOB
JV626               Oppdatering av pris/vare til EVR, kontr.1XA4      *JOB
JV681               Vare, forkastede varer v/innl. spesialpr1XA4      *JOB
JX601               Utskrift av priser for prisgivende lev. *STD      *JOB
**     R u t i n e r  (2)
1008206800100000000008001  JH601    Utskrift av vareavtaler
1004804400100000000012001  JM601    Kampanje-vare, utskrift
1504804400100000000019801  JM621    Kampanje-vare, kontr-/journal ovføring
1504804400100000000019801  JO601    Matching, Utskrift matchede varer
1504804400100000000019801  JO611    Matching, Utskrift ikke matchede varer
1504804400100000000019801  JO651    Matching, Oppdatering av EVR - kontr/jrn
1504804400100000000019801  JP601    Utskrift av betingelser
1507206800100000000008001  JU601    Modultekst, utskrift
1504804400100000000019801  JV601    Utskrift av vareregister, pris-/vareinfo
1504804400100000000019801  JV602    Utskrift av vareregister, vare-/søketeks
1504804400100000000019801  JV621    Overføring av nye varer til EVR, kontr./
1504804400100000000019801  JV626    Oppdatering av pris/vare til EVR, kontr.
1504804400100000000019801  JV681    Vare, forkastede varer v/innl. spesialpr
1504804400100000000019801  JX601    Utskrift av priser for prisgivende lev.
