     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASVADM
      * Program . . . . : JP511R
      * Beskrivelse . . : Vise rabattelement
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       040816 Bof  Nytt program  (kopi av JP510R)
8.01  *PRG2   140622 BOF  Utvidet prisgruppe fra 1 til 2 posisjoner
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      *       LR = Avslutt program
      *       10 = Roll
      *       12 = Sfldsp
      *       13 = Sfldspctl
      *       14 = Sflclr
      *       15 = Sflend
      *       16 = Readc 16 on, no more records
      *       21 = Home
      *       22 = Plassering av cursor
      *       30 = Protect av felter ved vise
      *    31-79 = Varsle m/feilmeldinger/skjermindikatorer
      *    80-99 = Arbeidsindikatorer
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fjrael1    if   e           k disk    rename(jraepfr:jraelr1)
     fjraelu    uf   e           k disk    rename(jraepfr:jraelur)
     fjraelr    if   e           k disk    rename(jraepfr:jraelrr)
     fjbetl1    if   e           k disk    rename(jbetpfr:jbetl1r)
     fjlevl1    if   e           k disk    rename(jlevpfr:jlevl1r)
     fvogrl1    if   e           k disk    rename(vogrpfr:vogrl1r)
     fvhgrl1    if   e           k disk    rename(vhgrpfr:vhgrl1r)
     fvugrl1    if   e           k disk    rename(vugrpfr:vugrl1r)
6.3x fra30l1    if   e           k disk    rename(ra30pfr:ra30l1r)
     fjmodl1    if   e           k disk    rename(jmodpfr:jmodl1r)
     fjvarl1    if   e           k disk    rename(jvarpfr:jvarl1r)
      *
     fjp511d    cf   e             workstn sfile(b1sfl:w_srrn)
     f                                     infds(dspfbk)
      *
      * Definering av parametre
      *
     d p_firm          s                   like(jpefir)
     d p_ldor          s                   like(jpeldo)
6.3x d p_prgr          s                   like(jpeprg)
     d p_ogrp          s                   like(jpeogr)
     d p_hgrp          s                   like(jpehgr)
     d p_ugrp          s                   like(jpeugr)
     d p_modn          s                   like(jpemod)
     d p_vare          s                   like(jpevar)
     d p_vtyp          s                   like(jpevty)
     d p_lety          s                   like(jpelet)
     d p_rsts          s                   like(jperst)
     d p_line          s                   like(jpelin)
      *
      * Definering av Local data area
      *
     d                uds
     d l_fnav                951    980
      *
      * Definering av Information Data Structure - display feedback
      *
     d dspfbk          ds
     d  d_fcrn               378    379I 0
      *
      * Definering av variabler i nøkler
      *
     d jraelr_erst     s                   like(jperst)
     d jraelr_elin     s                   like(jpelin)
     d jraelu_erst     s                   like(jperst)
     d jraelu_elin     s                   like(jpelin)
     d jlevl1_ldor     s                   like(jlldor)
     d vogrl1_oogr     s                   like(vgoogr)
     d vhgrl1_hogr     s                   like(vghogr)
     d vhgrl1_hhgr     s                   like(vghhgr)
     d vugrl1_uogr     s                   like(vguogr)
     d vugrl1_uhgr     s                   like(vguhgr)
     d vugrl1_uugr     s                   like(vguugr)
6.3x d ra30l1_ekod     s                   like(redkod)
     d jmodl1_modn     s                   like(jumodn)
     d jvarl1_vare     s                   like(jvvare)
      *
      * Definering av variable
      *
     d w_fcrn          s              4  0
     d w_stel          s              4  0
     d w_spge          s              4  0
     d w_srrn          s              4  0
     d w_sfrn          s                   like(w_srrn)
     d w_ssrn          s                   like(w_srrn)
      *
     d w_seqe          s              1
      *
     d b_feil          s              1    inz(*off)
      *
     d w_firm          s                   like(jpefir)
     d w_ldor          s                   like(jpeldo)
6.3x d w_prgr          s                   like(jpeprg)
     d w_ogrp          s                   like(jpeogr)
     d w_hgrp          s                   like(jpehgr)
     d w_ugrp          s                   like(jpeugr)
     d w_modn          s                   like(jpemod)
     d w_vare          s                   like(jpevar)
     d w_vtyp          s                   like(jpevty)
     d w_lety          s                   like(jpelet)
     d w_rsts          s                   like(jpebrs)
     d w_line          s                   like(jpebli)
      *
      * Definering av konstanter
      *
     d c_sfil          s              2  0 inz(7)
      *
      * Forklaring på spesielle felter
      * som benyttes ved sub-files.
      * - - - - - - - - - - - - - - - - -
      * w_fcrn - Første recordnummer på siden
      * w_stel - Subfile-teller
      * w_spge - Sidestørrelse i subfile (page)
      * w_srrn - Relativt recordnummer i subfile
      * w_sfrn - Første recordnummer på siste side
      * w_ssrn - Siste recordnummer på siste side
      * w_curn - Current recordnummer på siden
      * w_virn - Side og cursorplassering som skal vises
      * w_afld - Aktivt feltnavn
      * w_arow - Aktiv rad for cursor
      * w_acol - Aktiv kolonne for cursor
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      * B1SFL  - B1 Subfile - record
      * B2CTL  - B2 Subfile - control record
      * B2CMD  - B2 Eget skjermbilde for CMD-taster
      * C2BLD  - C2 Skjermbilde for vise
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Behandle åpningsbildet med subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Send Alt
      *
     c     b2taga        tag
      *
     c                   write     b2cmd
      *
      * Bare data
      *
     c     b2tagb        tag
      *
     c                   exsr      dsp_subfile                                  DSP SFL
      *
      * Behandling av standard funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      b2taga
     c                   when      *inke
     c                   exsr      forny
     c                   goto      b2tagb
     c                   when      *in10
     c                   exsr      crt_subfile                                  CRT SFL
     c                   goto      b2tagb
     c                   when      *in11
     c                   exsr      bck_subfile
     c                   goto      b2tagb
     c                   when      *in21
     c                   eval      *in22 = *on
     c                   goto      b2taga
     c                   endsl
      *
      * Behandling av subfile
      *
     c                   exsr      subfile
      *
     c                   goto      b2taga
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for fornying av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     forny         begsr
      *
     c     jrael1_key    setll     jrael1
      *
     c                   exsr      clr_subfile                                  TØM SFL
     c                   exsr      crt_subfile                                  CRT SFL
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     subfile       begsr
      *
     c                   if        *in22 = *off
     c                   eval      *in22 = *on
     c                   else
     c                   eval      *in22 = *off
     c                   endif
      *
     c                   eval      w_virn = w_fcrn
      *
      * Leser og behandler subfile
      *
     c                   do        w_ssrn
     c                   readc     b1sfl                                  16
      *
     c                   if        *in16
     c                   leave
     c                   endif
      *
     c                   eval      *in22 = *off
     c                   eval      w_virn = w_srrn
      *
      * Vis
      *
     c                   if        b1valg = 5
     c                   exsr      xc2bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Aktiviser/passiviser
      *
     c                   if        b1valg = 9
     c                   exsr      aktiviser
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
     c                   enddo
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å behandle skjermbilde for å vise rabattelement
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc2bld        begsr
      *
     c                   eval      jraelr_erst = b1erst
     c                   eval      jraelr_elin = b1elin
     c     jraelr_key    chain     jraelr
      *
     c                   eval      c2erae = jperae
     c                   eval      c2ereg = jpereg
     c                   eval      c2ever = jpever
     c                   eval      c2eeus = jpeeus
     c                   eval      c2efda = 0
     c                   eval      c2etda = 0
     c                   eval      c2eeda = 0
      *
     c     *dmy          move      jpeoda        c2eoda
     c     *dmy          move      jpeeda        c2eeda
      *
     c                   if        jpefda <> *loval
     c     *dmy          move      jpefda        c2efda
     c                   endif
     c                   if        jpetda <> *loval
     c     *dmy          move      jpetda        c2etda
     c                   endif
      *
     c     c2tagb        tag
      *
     c                   exfmt     c2bld
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for tømming av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     clr_subfile   begsr
      *
     c                   eval      *in14 = *on
     c                   write     b2ctl
     c                   eval      *in14 = *off
      *
     c                   eval      *in15 = *off
     c                   eval      w_srrn = 0
     c                   eval      w_sfrn = 0
     c                   eval      w_ssrn = 0
     c                   eval      w_spge = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å fylle opp subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     crt_subfile   begsr
      *
     c                   eval      w_spge = w_spge + c_sfil                     SFL END
     c                   eval      w_srrn = w_ssrn
      *
     c                   dou       w_srrn = w_spge
      *
     c                   read      jrael1                                 15
      *
     c                   if        *in15                                        EOF
     c                   leave
     c                   endif
      *
     c                   if        jpefir <> p_firm or
     c                             jpeldo <> p_ldor or
6.3x c                             jpeprg <> p_prgr or
     c                             jpeogr <> p_ogrp or
     c                             jpehgr <> p_hgrp or
     c                             jpeugr <> p_ugrp or
     c                             jpemod <> p_modn or
     c                             jpevar <> p_vare or
     c                             jpebrs <> p_rsts or
     c                             jpebli <> p_line
     c                   eval      *in15 = *on
     c                   leave
     c                   endif
      *
     c                   eval      w_srrn = w_srrn + 1
      *
     c                   eval      b1valg = 0
     c                   eval      b1erst = jperst
     c                   eval      b1elin = jpelin
     c                   eval      b1erae = jperae
     c                   eval      b1ereg = jpereg
     c                   eval      b1ever = jpever
     c                   eval      b1efda = 0
     c                   eval      b1etda = 0
     c                   eval      b1akti = *blank
     c                   eval      b1rkod = *blank
      *
     c                   if        jpefda <> *loval
     c     *dmy          move      jpefda        b1efda
     c                   endif
      *
     c                   if        jpetda <> *loval
     c     *dmy          move      jpetda        b1etda
     c                   endif
      *
     c                   if        jperst = 1
     c                   eval      b1rkod = 'L'
     c                   endif
      *
     c                   if        jpeakt = 1
     c                   eval      b1akti = 'A'
     c                   endif
      *
     c                   write     b1sfl
      *
     c                   enddo
      *
     c                   if        w_srrn > w_ssrn
     c                   eval      w_sfrn = w_ssrn + 1
     c                   endif
      *
     c                   eval      w_ssrn = w_srrn
     c                   eval      w_virn = w_sfrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å bla tilbake en side i subfilen
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bck_subfile   begsr
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for display av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     dsp_subfile   begsr
      *
     c                   if        w_srrn <> 0
     c                   eval      *in12 = *on
     c                   else
     c                   write     b2cmd
     c                   endif
      *
     c                   eval      *in13 = *on
     c                   exfmt     b2ctl
      *
     c                   eval      *in12 = *off
     c                   eval      *in13 = *off
      *
     c                   eval      w_fcrn = d_fcrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av spørring
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     spØrring      begsr
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for aktivisering/passivisering av element
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     aktiviser     begsr
      *
     c                   eval      jraelu_erst =  b1erst
     c                   eval      jraelu_elin =  b1elin
     c     jraelu_key    chain     jraelur                            91
     c                   if        *in91 = *on
     c                   goto      end_aktiviser
     c                   endif
      *
      * Oppdaterer element med valg
      *
     c                   if        jpeakt = 1
     c                   eval      jpeakt = 0
     c                   else
     c                   eval      jpeakt = 1
     c                   endif
      *
     c                   update    jraelur
      *
      * Oppdater subfile
      *
     c                   if        b1valg <> 0
     c                   if        jpeakt = 1
     c                   eval      b1akti = 'A'
     c                   else
     c                   eval      b1akti = *blank
     c                   endif
     c                   endif
      *
     c     end_aktiviser endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_ldor
6.3x c                   parm                    p_prgr
     c                   parm                    p_ogrp
     c                   parm                    p_hgrp
     c                   parm                    p_ugrp
     c                   parm                    p_modn
     c                   parm                    p_vare
     c                   parm                    p_vtyp
     c                   parm                    p_lety
     c                   parm                    p_rsts
     c                   parm                    p_line
      *
      * Key for les på rabattelement
      *
     c     jrael1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_ldor
6.3x c                   kfld                    w_prgr
     c                   kfld                    w_ogrp
     c                   kfld                    w_hgrp
     c                   kfld                    w_ugrp
     c                   kfld                    w_modn
     c                   kfld                    w_vare
     c                   kfld                    w_vtyp
     c                   kfld                    w_lety
     c                   kfld                    w_rsts
     c                   kfld                    w_line
      *
      * Key for oppslag på rabattelement
      *
     c     jraelr_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_ldor
6.3x c                   kfld                    w_prgr
     c                   kfld                    w_ogrp
     c                   kfld                    w_hgrp
     c                   kfld                    w_ugrp
     c                   kfld                    w_modn
     c                   kfld                    w_vare
     c                   kfld                    w_vtyp
     c                   kfld                    w_lety
     c                   kfld                    w_rsts
     c                   kfld                    w_line
     c                   kfld                    jraelr_erst
     c                   kfld                    jraelr_elin
      *
      * Key for oppdatering av rabattelemet
      *
     c     jraelu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_ldor
6.3x c                   kfld                    w_prgr
     c                   kfld                    w_ogrp
     c                   kfld                    w_hgrp
     c                   kfld                    w_ugrp
     c                   kfld                    w_modn
     c                   kfld                    w_vare
     c                   kfld                    w_vtyp
     c                   kfld                    w_lety
     c                   kfld                    w_rsts
     c                   kfld                    w_line
     c                   kfld                    jraelu_erst
     c                   kfld                    jraelu_elin
      *
      * Key for oppslag på betingelse
      *
     c     jbetl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_ldor
6.3x c                   kfld                    w_prgr
     c                   kfld                    w_ogrp
     c                   kfld                    w_hgrp
     c                   kfld                    w_ugrp
     c                   kfld                    w_modn
     c                   kfld                    w_vare
     c                   kfld                    w_vtyp
     c                   kfld                    w_lety
     c                   kfld                    w_rsts
     c                   kfld                    w_line
      *
      * Key for oppslag på leverandør
      *
     c     jlevl1_key    klist
     c                   kfld                    jlevl1_ldor
      *
      * Key for oppslag på overgruppe
      *
     c     vogrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vogrl1_oogr
      *
      * Key for oppslag på hovedgruppe
      *
     c     vhgrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vhgrl1_hogr
     c                   kfld                    vhgrl1_hhgr
      *
      * Key for oppslag på undergruppe
      *
     c     vugrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vugrl1_uogr
     c                   kfld                    vugrl1_uhgr
     c                   kfld                    vugrl1_uugr
6.3x  *
6.3x  * Key for oppslag på prisgruppe
6.3x  *
6.3x c     ra30l1_key    klist
6.3x c                   kfld                    w_firm
6.3x c                   kfld                    ra30l1_ekod
      *
      * Key for oppslag på modul
      *
     c     jmodl1_key    klist
     c                   kfld                    jmodl1_modn
      *
      * Key for oppslag på vare
      *
     c     jvarl1_key    klist
     c                   kfld                    jvarl1_vare
      *
      *
      * Henter parametre, og fyller opp skjermbilde og subfile
      *
     c                   eval      w_firm = p_firm
     c                   eval      w_ldor = p_ldor
6.3x c                   eval      w_prgr = p_prgr
     c                   eval      w_ogrp = p_ogrp
     c                   eval      w_hgrp = p_hgrp
     c                   eval      w_ugrp = p_ugrp
     c                   eval      w_modn = p_modn
     c                   eval      w_vare = p_vare
     c                   eval      w_vtyp = p_vtyp
     c                   eval      w_lety = p_lety
     c                   eval      w_rsts = p_rsts
     c                   eval      w_line = p_line
      *
     c                   eval      b2eldo = p_ldor
6.3x c                   eval      b2eprg = p_prgr
     c                   eval      b2eogr = p_ogrp
     c                   eval      b2ehgr = p_hgrp
     c                   eval      b2eugr = p_ugrp
     c                   eval      b2emod = p_modn
     c                   eval      b2evar = p_vare
     c                   eval      b2evty = p_vtyp
     c                   eval      b2elet = p_lety
      *
     c     jbetl1_key    chain     jbetl1
     c                   eval      b2beti = jpbeti
      *
     c                   eval      jlevl1_ldor = b2eldo
     c     jlevl1_key    chain     jlevl1
     c                   eval      b2lnav = jlnavn
6.3x  *
6.3x c                   if        b2eprg <> *blank
6.3x c                   eval      ra30l1_ekod = b2eprg
6.3x c     ra30l1_key    chain     ra30l1
6.3x c                   eval      b2ptxt = redtxt
6.3x c                   endif
      *
     c                   if        b2eogr <> 0 and
     c                             b2ehgr =  0 and
     c                             b2eugr =  0
     c                   eval      vogrl1_oogr = b2eogr
     c     vogrl1_key    chain     vogrl1
     c                   eval      b2utxt = vgotxt
     c                   endif
      *
     c                   if        b2ehgr <> 0 and
     c                             b2eugr =  0
     c                   eval      vhgrl1_hogr = b2eogr
     c                   eval      vhgrl1_hhgr = b2ehgr
     c     vhgrl1_key    chain     vhgrl1
     c                   eval      b2utxt = vghtxt
     c                   endif
      *
     c                   if        b2eugr <> 0
     c                   eval      vugrl1_uogr = b2eogr
     c                   eval      vugrl1_uhgr = b2ehgr
     c                   eval      vugrl1_uugr = b2eugr
     c     vugrl1_key    chain     vugrl1
     c                   eval      b2utxt = vgutxt
     c                   endif
      *
     c                   if        b2emod <> 0
     c                   eval      jmodl1_modn = b2emod
     c     jmodl1_key    chain     jmodl1
     c                   eval      b2mte1 = jumte1
     c                   endif
      *
     c                   if        b2evar <> *blank
     c                   eval      jvarl1_vare = b2evar
     c     jvarl1_key    chain     jvarl1
     c                   eval      b2tek1 = jvtek1
     c                   eval      b2nobb = jvnobb
     c                   endif
      *
      * Posisjonerer databasen, og fyller opp subfile
      *
     c     jrael1_key    setll     jrael1
      *
     c                   eval      *in22 = *on
     c                   exsr      crt_subfile
      *
     c                   endsr
