     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASVADM
      * Program . . . . : JR153R
      * Beskrivelse . . : Innlesing av varer/priser fra rapportør,
      *                   styreprogram
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       111099 HKO  Nytt program
      *       150200 HKO  Lagt inn innlesing fra NKL
      *       101000 HKO  Lagt inn innlesing fra LALUND
      *       061100 HKO  Lagt inn innlesing fra ANDVORD
      *       121200 HKO  Lagt inn innlesing fra OLEMOE
      *       260301 HKO  Lagt inn innlesing fra IND.SALG
      *       040901 HKO  Lagt inn innlesing fra NIB_KAMP
      *       011101 HKO  Lagt inn innlesing fra IKD
      *       200202 HKO  Lagt inn innlesing fra MELLBYE
      *       050302 HKO  Lagt inn innlesing fra GUNNEBO
      *       110302 HKO  Lagt inn innlesing fra ESAB
      *       140302 HKO  Lagt inn innlesing fra PRINCESS
      *       150302 HKO  Lagt inn innlesing fra SCENARIO
      *       220502 HKO  Lagt inn innlesing fra FARVEGLEDE
      *       270502 HKO  Lagt inn innlesing fra OSJORD
      *       071102 HKO  Lagt inn innlesing fra HEIDENREIC
      *       021202 HKO  Lagt inn innlesing fra LØVENSKIOL
      *       100203 HKO  Lagt inn innlesing fra FJELLAND
      *       150903 HKO  Lagt inn innlesing fra TG, EMO og MESTERGRP
      *       250903 HKO  Lagt inn innlesing fra FUGGER
      *       141103 GRO  Lagt inn innlesing fra SKYDDA
      *       141103 GRO  Lagt inn innlesing fra LUNA
      *       241103 GRO  Lagt inn innlesing fra KRAFTIXX og KWB
      *       240504 GRO  Lagt inn innlesing fra Verktøy Engros Bergen(VEB)
      *       020604 GRO  Lagt inn innlesing fra Kolberg Caspary Maskin(KCM)
      *       031104 GRO  Lagt inn innlesing fra Arnøy Engros (ARNOY)
      *       231104 GRO  Lagt inn innlesing fra Felleskjøpet (FELLESKJOP)
      *       160305 GRO  Lagt inn innlesing fra Flisforum (FLISFORUM)
      *       270905 HKO  Lagt inn innlesing fra LUNA_AVT
      *       231105 HKO  Lagt inn innlesing fra OPTIMERA
      *       190406 GRO  Lagt inn innlesing fra S4/Felleskj. (orig. 110405)
      *       190406 GRO  Lagt inn innlesing fra Brio         (orig. 030505)
      *       190406 GRO  Lagt inn innlesing fra Ahlsell      (orig. 110106)
      *       240407 HKO  Kaller program for oppdatering av bestillings-
      *                   antall ved innlesing fra S4
      *       071107 BOF  Lagt inn innlesing fra F&H
      *       250408 BOF  Lagt inn innlesing fra T.M.Bergersen
      *       120508 bof  Lagt inn innlesing fra Optimera Øst OPTI_OST
      *       120508 bof  Lagt inn innlesing fra Optimera Sør OPTI_SOR
      *       110810 bof  Lagt inn innlesing for std. CSV bare priser STD_PRIS
      *       110810 bof  Lagt inn innlesing for std. CSV hele varen  STD_HELE
6.11  *       081010 bof  Lagt inn innlesing for std. TMC og TJÆRALIN
6.12  *       230410 bof  Lagt inn innlesing fra Luna priser LUNA_PRIS (oppgrade
6.13  *       031211 bof  Lagt inn innlesing fra integ.dat - priser
6.14  *       170412 bof  Lagt inn innlesing fra VISMA CS-format
6.15  *       070512 bof  Lagt inn innlesing fra integ.dat - varer /priser
6.31  *       241115 bof  Lagt inn innlesing for std. CSV opd.beting. STD_BETI
7.01  *       021116 bof  Lagt inn innlesing for nobb frakt.bet. FRAKTBETI
8.01  *PRG2   140622 BOF  Utvidet prisgruppe fra 1 til 2 posisjoner
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fjrappf    if   e             disk
      *
      * Definering av parametre
      *
     d p_parm          s             32
      *
      * Definering av parameterliste -inn
      *
     d                 ds
     d d_parm                        32
     d  d_pfir                        3  0 overlay(d_parm)
     d  d_prap                        2  0 overlay(d_parm:4)
     d  d_prfm                       10    overlay(d_parm:6)
     d  d_pdat                         d   overlay(d_parm:16) datfmt(*iso)
8.01 d  d_pprg                        2    overlay(d_parm:30)
      *
      * Definering av parameterliste -ut
      *
     d                 ds
     d d_list                        32
     d  d_firm                        3  0 overlay(d_list)
     d  d_rapp                        2  0 overlay(d_list:4)
     d  d_dato                         d   overlay(d_list:6) datfmt(*iso)
6.31 d  d_prgr                        1    overlay(d_list:30)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Fyller datastruktur som output-parameter
      *
     c                   eval      d_firm = d_pfir
     c                   eval      d_rapp = d_prap
     c                   eval      d_dato = d_pdat
6.31 c                   eval      d_prgr = d_pprg
      *
      * Behandling avhengig av recordformat
      *
     c                   select
     c                   when      d_prfm = 'JERNIA'
     c                   call      'JR754R'
     c                   parm                    d_list
     c                   when      d_prfm = 'CHRIST'
     c                   call      'JR755R'
     c                   parm                    d_list
     c                   when      d_prfm = 'FARVERING'
     c                   call      'JR756R'
     c                   parm                    d_list
     c                   when      d_prfm = 'FM_NORD'
     c                   call      'JR757R'
     c                   parm                    d_list
     c                   when      d_prfm = 'AE_OLSEN'
     c                   call      'JR758R'
     c                   parm                    d_list
     c                   when      d_prfm = 'BR_DAHL_VP'
     c                   call      'JR759R'
     c                   parm                    d_list
     c                   when      d_prfm = 'BR_DAHL_R'
     c                   call      'JR760R'
     c                   parm                    d_list
     c                   when      d_prfm = 'ELFO'
     c                   call      'JR761R'
     c                   parm                    d_list
     c                   when      d_prfm = 'FAGFLIS'
     c                   call      'JR762R'
     c                   parm                    d_list
     c                   when      d_prfm = 'S4'
     c                   call      'JR763R'
     c                   parm                    d_list
     c                   call      'JR890R'
     c                   when      d_prfm = 'NKL'
     c                   call      'JR764R'
     c                   parm                    d_list
     c                   when      d_prfm = 'LALUND'
     c                   call      'JR765R'
     c                   parm                    d_list
     c                   when      d_prfm = 'ANDVORD'
     c                   call      'JR766R'
     c                   parm                    d_list
     c                   when      d_prfm = 'OLEMOE'
     c                   call      'JR767R'
     c                   parm                    d_list
     c                   when      d_prfm = 'IND.SALG'
     c                   call      'JR768R'
     c                   parm                    d_list
     c                   when      d_prfm = 'NIB_KAMP'
     c                   call      'JR769R'
     c                   parm                    d_list
     c                   when      d_prfm = 'IKD'
     c                   call      'JR770R'
     c                   parm                    d_list
     c                   when      d_prfm = 'MELLBYE'
     c                   call      'JR771R'
     c                   parm                    d_list
     c                   when      d_prfm = 'GUNNEBO'
     c                   call      'JR772R'
     c                   parm                    d_list
     c                   when      d_prfm = 'ESAB'
     c                   call      'JR773R'
     c                   parm                    d_list
     c                   when      d_prfm = 'PRINCESS'
     c                   call      'JR774R'
     c                   parm                    d_list
     c                   when      d_prfm = 'SCENARIO'
     c                   call      'JR775R'
     c                   parm                    d_list
     c                   when      d_prfm = 'FARVEGLEDE'
     c                   call      'JR776R'
     c                   parm                    d_list
     c                   when      d_prfm = 'OSJORD'
     c                   call      'JR777R'
     c                   parm                    d_list
     c                   when      d_prfm = 'HEIDENREIC'
     c                   call      'JR778R'
     c                   parm                    d_list
     c                   when      d_prfm = 'LØVENSKIOL'
     c                   call      'JR779R'
     c                   parm                    d_list
     c                   when      d_prfm = 'TG'
     c                   call      'JR780R'
     c                   parm                    d_list
     c                   when      d_prfm = 'MESTERGRP'
     c                   call      'JR781R'
     c                   parm                    d_list
     c                   when      d_prfm = 'FJELLAND'
     c                   call      'JR782R'
     c                   parm                    d_list
     c                   when      d_prfm = 'EMO'
     c                   call      'JR783R'
     c                   parm                    d_list
     c                   when      d_prfm = 'FUGGER'
     c                   call      'JR784R'
     c                   parm                    d_list
     c                   when      d_prfm = 'SKYDDA'
     c                   call      'JR785R'
     c                   parm                    d_list
     c                   when      d_prfm = 'LUNA'
     c                   call      'JR786R'
     c                   parm                    d_list
     c                   when      d_prfm = 'LUNA_AVT'
     c                   call      'JR787R'
     c                   parm                    d_list
     c                   when      d_prfm = 'KRAFTIXX'
     c                   call      'JR788R'
     c                   parm                    d_list
     c                   when      d_prfm = 'KWB'
     c                   call      'JR789R'
     c                   parm                    d_list
     c                   when      d_prfm = 'VEB'
     c                   call      'JR791R'
     c                   parm                    d_list
     c                   when      d_prfm = 'KCM'
     c                   call      'JR792R'
     c                   parm                    d_list
     c                   when      d_prfm = 'ARNOY'
     c                   call      'JR793R'
     c                   parm                    d_list
     c                   when      d_prfm = 'FELLESKJOP'
     c                   call      'JR794R'
     c                   parm                    d_list
     c                   when      d_prfm = 'FLISFORUM'
     c                   call      'JR796R'
     c                   parm                    d_list
     c                   when      d_prfm = 'OPTIMERA'
     c                   call      'JR797R'
     c                   parm                    d_list
     c                   when      d_prfm = 'BRIO'
     c                   call      'JR798R'
     c                   parm                    d_list
     c                   when      d_prfm = 'AHLSELL'
     c                   call      'JR799R'
     c                   parm                    d_list
     c                   when      d_prfm = 'S4/FELLESK'
     c                   call      'JR801R'
     c                   parm                    d_list
     c                   when      d_prfm = 'F&H       '
     c                   call      'JR803R'
     c                   parm                    d_list
     c                   when      d_prfm = 'TMBERG    '
     c                   call      'JR804R'
     c                   parm                    d_list
     c                   when      d_prfm = 'OPTI_OST  '
     c                   call      'JR805R'
     c                   parm                    d_list
     c                   when      d_prfm = 'OPTI_SOR  '
     c                   call      'JR806R'
     c                   parm                    d_list
     c                   when      d_prfm = 'STD_HELE  '
     c                   call      'JR808R'
     c                   parm                    d_list
     c                   when      d_prfm = 'STD_PRIS  '
     c                   call      'JR809R'
     c                   parm                    d_list
6.11 c                   when      d_prfm = 'TMC       '
6.11 c                   call      'JR810R'
6.11 c                   parm                    d_list
6.11 c                   when      d_prfm = 'TJÆRALIN  '
6.11 c                   call      'JR811R'
6.11 c                   parm                    d_list
6.12 c                   when      d_prfm = 'LUNA_PRIS '
6.12 c                   call      'JR815R'
6.12 c                   parm                    d_list
6.13 c                   when      d_prfm = 'INTEG'
6.13 c                   call      'JR817R'
6.13 c                   parm                    d_list
6.14 c                   when      d_prfm = 'VISMA'
6.14 c                   call      'JR818R'
6.14 c                   parm                    d_list
6.15 c                   when      d_prfm = 'NOBB_INT'
6.15 c                   call      'JR819R'
6.15 c                   parm                    d_list
6.31 c                   when      d_prfm = 'STD_BETI  '
6.31 c                   call      'JR839R'
6.31 c                   parm                    d_list
7.01 c                   when      d_prfm = 'FRAKTBETI '
7.01 c                   call      'JR840R'
7.01 c                   parm                    d_list
6.31 c                   other
     c                   goto      avslutt
     c                   endsl
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_parm
      *
      *
      * Splitter datastruktur i parametre
      *
     c                   eval      d_parm = p_parm
      *
     c                   endsr
