     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASVADM
      * Program . . . . : jv146R
      * Beskrivelse . . : Overføring til EVR, filter (Nye varer)
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       110814 bof  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fjv146d    cf   e             workstn
      *
      * Definering av parametre
      *
     d p_vsts          s              1  0
6.30 d p_modn          s              8  0
6.30 d p_ko01          s              8
6.30 d p_firm          s              3  0
      *
      * Definering av variable
      *
6.30 d w_firm          s              3  0
     d w_mte1          s             30
     d b_feil          s              1    inz(*off)
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B1 Behandle åpningsbildet
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Behandler bildet
      *
     c     b1tag         tag
      *
     c                   exfmt     b1bld
      *
      * Funksjonstaster
      *
     c                   if        *inkc or *inkl
     c                   goto      avslutt
     c                   endif
6.30 c                   if        *inkd
6.30 c                   exsr      spØrring
6.30 c                   goto      b1tag
6.30 c                   endif
      *
      * Returnerer verdi
      *
     c                   eval      p_vsts = b1vsts
6.30 c                   eval      p_modn = b1modn
6.30 c                   eval      p_ko01 = b1ko01
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
6.30  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.30  * Subrutine for behandling av spørring
6.30  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.30  *
6.30 c     spØrring      begsr
6.30  *
6.30 c                   if        w_afld = 'B1MODN'
6.30 c                   call      'JU500R'
6.30 c                   parm                    w_firm
6.30 c                   parm                    b1modn
6.30 c                   parm                    b1mtxt
6.30 c                   leavesr
6.30 c                   endif
6.30  *
6.30 c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_vsts
6.30 c                   parm                    p_modn
6.30 c                   parm                    p_ko01
      *
      * Initierer skjermbildet
      *
     c                   eval      b1vsts = p_vsts
6.30 c                   eval      b1modn = p_modn
6.30 c                   eval      b1ko01 = p_ko01
      *
6.30 c                   eval      w_firm = p_firm
      *
     c                   endsr
