     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASVADM
      * Program . . . . : JV160R
      * Beskrivelse . . : Vare, registrering fra ordre
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       250100 HKO  Nytt program
      *       050400 HKO  Lagt inn funksjonstast for vising av spesialpriser
      *       060103 HKO  Lagt inn grossistløsning
      *       050203 HKO  Splittet varedetaljer i eget bilde
      *       141003 HKO  Utelater utgåtte varer
      *       140504 HKO  Dersom søk er foretatt i ofak vises varene i.h.t.
      *                   dette søket
      *       140905 HKO  Lagt inn frisøk
os71  * os71  161210 bsa  Lagt inn korreksjoner på SQL pga. OS/400 feil
os71  *                   Det er også lagt inn endring på SQL,
os71  *                   som er nødvendig ved overgang til v6.1
6.NU  * R6.30 230514 bsa  Programmet gjennomgått mtp nummerutvidelser.
6.30  * 6.30  060814 bsa  Returnerer uten å ta F3.
6.31  *       208155 bof  Endret test på utgått når sql
6.32  *       031215 nho  Cursor ved int. 23
6.3q  *       260515 bof  Datoformat sql
6.33  *       310117 bof  sjekke utgått mot jvlepf
6.34  *       260718 bof  Endret på sql for å den mer riktig og raskere.
6.35  *       031018 bof  Innføring av logistikk-varenr
6.37  *       301018 bkv  Farger på TLS
      *
7.xx  * 7.00  220116 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
Q.02  * 7.00  260319 bsa  Quick wins - synker ordrelinje mot bestilling
7.01  * K000  060720 bsa  Utvider bilde til 132 bredde
7.02  * K000  060720 bsa  Utvider søk i bildet med leverandør
7.03  * K000  301219 bkv  Newlook vask
7.04  * K000  280920 bsa  Hvis søket ikke er endret, hopp videre.
      *
7.fb  * 7.00  300320 bsa  Parameter som styrer om depositum er betalt på ordren.
7.fb  *                   Kun nye varer av type "T" (tjenestevarer)
      *
8.01  *       240123 bof  Behandle frisøk på logistikknr med egen søk (w_seqe)
8.02  *       133123 mst  8.01 feiler hvis fritekstfelt er for stort
8.03  *PRG2   210622 bof  Utvidet prisgruppe fra 1 til 2 posisjoner
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fjvsost    if   e           k disk    rename(jvsost:jvsostr)
      *
     fjvarla    if   e           k disk    rename(jvarpfr:jvarlar)
     fjvarlb    if   e           k disk    rename(jvarpfr:jvarlbr)
     fjvarlc    if   e           k disk    rename(jvarpfr:jvarlcr)
     fjvarl1    if   e           k disk    rename(jvarpfr:jvarl1r)
     fjvarl2    if   e           k disk    rename(jvarpfr:jvarl2r)
     fjvarl3    if   e           k disk    rename(jvarpfr:jvarl3r)
     fjvarl4    if   e           k disk    rename(jvarpfr:jvarl4r)
7.02 fjvarl6    if   e           k disk    rename(jvarpfr:jvarl6r)
     fjsokl3    if   e           k disk    rename(jsokpfr:jsokl3r)
     fjlevl1    if   e           k disk    rename(jlevpfr:jlevl1r)
6.33 fjvlel1    if   e           k disk    rename(jvlepfr:jvlel1r)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     ffstsl1    if   e           k disk    rename(fstspfr:fstsl1r)
     frkunl1    if   e           k disk    rename(rkunpfr:rkunl1r)
     ffkprl1    if   e           k disk    rename(fkprpfr:fkprl1r)
     fvltpl1    if   e           k disk    rename(vltppfr:vltpl1r)
     ffohel1    if   e           k disk    rename(fohepfr:fohel1r)
     ffodtl1    if   e           k disk    rename(fodtpfr:fodtl1r)
7.02 frlevl1    if   e           k disk    rename(rlevpfr:rlevl1r)
7.02 fjlevl3    if   e           k disk    rename(jlevpfr:jlevl3r)
      *
     fjv160d    cf   e             workstn sfile(b1sfl:w_srrn)
     f                                     infds(dspfbk)
      *
      * Definering av parametre
      *
     d p_kode          s              1
     d p_firm          s                   like(fofirm)
     d p_numm          s                   like(fonumm)
     d p_suff          s                   like(fosuff)
     d p_line          s                   like(fdline)
     d p_ltyp          s                   like(fdltyp)
     d p_lety          s                   like(fdlety)
     d p_ogrp          s                   like(fdogrp)
     d p_hgrp          s                   like(fdhgrp)
     d p_ugrp          s                   like(fdugrp)
     d p_stek          s             35
7.fb d p_depo          s              1
      *
      * Definering av Local data area
      *
     d                uds
     d l_fnav                951    980
      *
      * Definering av Information Data Structure - display feedback
      *
     d dspfbk          ds
     d  d_fcrn               378    379I 0
      *
      * Definering av variabler i nøkler
      *
     d jvarla_ogrp     s                   like(jvogrp)
     d jvarlb_ogrp     s                   like(jvogrp)
     d jvarlb_hgrp     s                   like(jvhgrp)
     d jvarlc_ogrp     s                   like(jvogrp)
     d jvarlc_hgrp     s                   like(jvhgrp)
     d jvarlc_ugrp     s                   like(jvugrp)
     d jvarl1_vare     s                   like(jvvare)
     d jvarl2_tek1     s                   like(jvtek1)
     d jvarl3_nobb     s                   like(jvnobb)
     d jvarl4_lvar     s                   like(jvlvar)
     d jsokl3_vare     s                   like(jsvare)
     d jsokl3_stek     s                   like(jsstek)
     d jlevl1_ldor     s                   like(jlldor)
     d vvarl1_vare     s                   like(vvvare)
     d rkunl1_kund     s                   like(rkkund)
     d fkprl1_kund     s                   like(flkund)
     d fkprl1_kpro     s                   like(flkpro)
     d vltpl1_lety     s                   like(vylety)
6.33 d jvlel1_lvnr     s                   like(jvlvnr)
7.02 d rlevl1_levr     s                   like(rllevr)
7.02 d jvarl6_ldor     s                   like(jvldor)
7.02 d jlevl3_enum     s                   like(jlenum)
      *
      * Definering av variable
      *
     d w_fcrn          s              4  0
     d w_stel          s              4  0
     d w_spge          s              4  0
     d w_srrn          s              4  0
     d w_sfrn          s                   like(w_srrn)
     d w_ssrn          s                   like(w_srrn)
      *
     d b_open_sok      s              1    inz(*off)
6.33 d b_utgv          s              1    inz(*off)
7.02 d b_reset         s              1    inz(*off)
7.04 d b_regl          s              1    inz(*off)
     d w_seqe          s              2
      *
     d w_ste1          s             35
     d w_ste2          s             35
     d w_ste3          s             35
     d w_ste4          s             35
     d w_ste5          s             35
     d w_posi          s              3  0
     d w_leng          s              2  0
     d w_otxt          s             35
     d w_htxt          s             35
     d w_utxt          s             35
     d w_udat          s               d   datfmt(*iso)
6.33 d w_loda          s               d   datfmt(*iso)
6.30 d w_stek          s             35
6.35 d w_logi          s              9  0
7.02 d w_enum          s                   like(rllevr)
      *
     d s_stek          s             35
     d s_ftek          s             35
7.02 d s_ldor          s                   like(rllevr)
7.02 d s_enum          s                   like(rllevr)
      *
     d w_firm          s                   like(fofirm)
     d w_numm          s                   like(fonumm)
     d w_suff          s                   like(fosuff)
     d w_line          s                   like(fdline)
     d w_anta          s                   like(fdanta)
     d w_tots          s                   like(fdsums)
     d w_totr          s                   like(fdsumr)
6.37 d w_undv          s              8  0
6.37 d w_logl          s             15
6.37 d w_vare          s             15
6.37 d w_jvqvnr        s                   like(jvvare)
6.33 d w_jvquno        s              8  0
7.03 d w_len           s              3  0
7.fb d w_mld1          s             50
      *
     d s_vare          s                   like(jvvare)
     d s_ogrp          s                   like(jvogrp)
     d s_hgrp          s                   like(jvhgrp)
     d s_ugrp          s                   like(jvugrp)
      *
      * Konstanter
      *
7.01 d c_sfil          s              2  0 inz(15)
8.02 d w_pos           s              9  0
8.02 d digits          c                   '0123456789'
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B2 Behandle åpningsbildet med subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
6.3q C/Exec SQL
6.3q C+  Set Option DatFmt=*ISO, DlyPrp=*YES, SRTSEQ=*LANGIDUNQ, LANGID=NOR
6.3q C/End-Exec
      *
      * Send Alt
      *
     c     b2taga        tag
      *
     c                   write     b2cmd
      *
      * Bare data
      *
     c     b2tagb        tag
      *
     c                   exsr      dsp_subfile
      *
      * Behandling av standard funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      b2taga
     c                   when      *inke
     c                   exsr      forny
     c                   goto      b2tagb
     c                   when      *in10
     c                   exsr      crt_subfile
     c                   goto      b2tagb
     c                   when      *in11
     c                   exsr      bck_subfile
     c                   goto      b2tagb
7.xx c*                  when      *in21
7.xx c*                  eval      *in22 = *on
7.xx c*                  goto      b2taga
     c                   endsl
7.02  *
7.02  * Nullstiller søkefelter
7.02  *
7.02 c                   if        b2null = 1
7.02 c                   eval      b2ogrp = 0
7.02 c                   eval      s_ogrp = 0
7.02 c                   eval      b2hgrp = 0
7.02 c                   eval      s_hgrp = 0
7.02 c                   eval      b2ugrp = 0
7.02 c                   eval      s_ugrp = 0
7.02 c                   eval      b2stek = *blank
7.02 c                   eval      b2ftek = *blank
7.02 c                   eval      b2ldor = 0
7.02 c                   eval      s_ldor = 0
7.02 c                   eval      s_enum = 0
7.02 c                   eval      b2lnvn = *blanks
7.02 c                   eval      b1tek1 = *blanks
7.02 c                   eval      w_seqe = *blanks
7.02 c                   eval      b_reset = *on
7.02 c                   eval      b2null = 0
7.02 c                   exsr      forny
7.02 c                   goto      b2tagb
7.02 c                   endif
      *
      * F2=Registrering av tekstlinjer
      *
     c                   if        *inkb = *on
     c                   exsr      tekstlinje
     c                   goto      b2tagb
     c                   endif
      *
      * F9=Gjenta søk
      *
     c                   if        *inki = *on
     c                   eval      *in22 = *on
     c
     c                   eval      b2hgrp = s_hgrp
     c                   eval      b2ugrp = s_ugrp
     c                   eval      b2stek = s_stek
     c                   eval      b2ftek = s_ftek
7.02 c                   eval      b2ldor = s_ldor
6.32 c                   if        fØrste = 0
6.32 c                   eval      *in23 = *on
6.32 c                   eval      *in22 = *off
6.32 c                   eval      b2ftek = s_stek
6.32 c                   eval      b2stek = *blank
6.32 c                   add       1             fØrste            1 0
6.32 c                   else
6.32 c                   eval      *in23 = *on
6.32 c                   eval      *in22 = *off
6.32 c                   eval      b2ftek = s_ftek
6.32 c                   endif
     c                   goto      b2tagb
     c                   endif
      *
      * F14=Vis kunde-/kundeprosjekt-informasjon
      *
     c                   if        *inkn = *on
     c                   call      'FL510R'
     c                   parm                    w_firm
     c                   parm                    fokund
     c                   parm                    fokpro
     c                   goto      b2tagb
     c                   endif
      *
      * F15=Rabattmatrise for kunde/kundeprosjekt
      *
     c                   if        *inkp = *on
     c                   call      'FR510R'
     c                   parm                    w_firm
     c                   parm                    fokund
     c                   parm                    fokpro
     c                   goto      b2tagb
     c                   endif
      *
      * F16=Spesialpriser for kunde/kundeprosjekt
      *
     c                   if        *inkq = *on
     c                   call      'FP510R'
     c                   parm                    w_firm
     c                   parm                    fokund
     c                   parm                    fokpro
     c                   goto      b2tagb
     c                   endif
      *
      * F23=Bytt informasjon (Varenr/Nobbnr/Lev.varenr)
      *
     c                   if        *inkx = *on
      *
     c                   if        *in80 = *on
     c                   eval      *in80 = *off
     c                   eval      *in81 = *on
     c                   exsr      forny
     c                   goto      b2taga
     c                   endif
      *
     c                   if        *in81 = *on
     c                   eval      *in81 = *off
     c                   eval      *in82 = *on
     c                   exsr      forny
     c                   goto      b2taga
     c                   endif
      *
     c                   if        *in82 = *on
     c                   eval      *in82 = *off
     c                   eval      *in80 = *on
     c                   exsr      forny
     c                   goto      b2taga
     c                   endif
      *
     c                   endif
      *
      * Søking
      *
7.04 c                   eval      b_regl = *off
     c                   if        b2ogrp <> 0 or
     c                             b2hgrp <> 0 or
     c                             b2ugrp <> 0 or
     c                             b2stek <> *blank or
7.02 c                             b2ftek <> *blank or
7.02 c                             b2ldor <> 0
     c                   exsr      sØk
7.04 c                   if        b_regl = *on
7.04 c                   goto      xs_subfile
7.04 c                   endif
     c                   goto      b2tagb
     c                   endif
      *
      * Posisjonering
      *
     c                   if        b2tek1 <> *blank or
     c                             b2vare <> 0 or
     c                             b2nobb <> 0 or
     c                             b2lvar <> *blank
     c                   exsr      posisjoner
     c                   goto      b2taga
     c                   endif
      *
      * Behandling av subfile
      *
7.04 c     xs_subfile    tag
      *
     c                   exsr      subfile
      *
7.fb c                   if        *in33 = *on
7.fb c                   goto      b2taga
7.fb c                   endif
      *
      * Plasserer cursor, og viser bildet på nytt
      *
6.30  * Returnerer hvis det ble kalt med søkestreng
6.30 c                   if        w_stek = *blanks
     c                   eval      *in22 = *on
      *
     c                   goto      b2taga
6.30 c                   endif
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for fornying av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     forny         begsr
      *
     c                   if        w_fcrn <> 0
     c     w_fcrn        chain     b1sfl
     c                   endif
7.02  *
7.02  * Det er valgt nullstilling av filter. Må starte på nytt
7.02  *
7.02 c                   if        b_reset = *on
7.02 c                   eval      b1tek1 = *blanks
7.02 c                   eval      b_reset = *off
7.02 c                   endif
7.02  *
      *
     c                   select
     c                   when      w_seqe = 'O '
     c     jvarla_key    setll     jvarla
     c                   when      w_seqe = 'H '
     c     jvarlb_key    setll     jvarlb
     c                   when      w_seqe = 'U '
     c     jvarlc_key    setll     jvarlc
     c                   when      w_seqe = 'S ' or
     c                             w_seqe = 'SO' or
     c                             w_seqe = 'SH' or
     c                             w_seqe = 'SU' or
     c                             w_seqe = 'F ' or
     c                             w_seqe = 'FO' or
     c                             w_seqe = 'FH' or
     c                             w_seqe = 'FU'
     c                   eval      b_open_sok = *on
     c                   when      w_seqe = 'V '
     c                   eval      jvarl1_vare = b1vare
     c     jvarl1_key    setll     jvarl1
     c                   when      w_seqe = 'N '
     c                   eval      jvarl3_nobb = b1nobb
     c     jvarl3_key    setll     jvarl3
     c                   when      w_seqe = 'L '
     c                   eval      jvarl4_lvar = b1lvar
     c     jvarl4_key    setll     jvarl4
7.02 c                   when      w_seqe = 'LE'
7.02 c                   eval      jvarl6_ldor = s_enum
7.02 c     jvarl6_key    setll     jvarl6
     c                   other
     c                   eval      jvarl2_tek1 = b1tek1
     c     jvarl2_key    setll     jvarl2
     c                   endsl
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for søking i subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sØk           begsr
      *
7.04  * Hvis samme søk, og ikke nullstilt, sjekk om det er registrert antall
      *
7.04 c                   if        b2ogrp = s_ogrp and
7.04 c                             b2hgrp = s_hgrp and
7.04 c                             b2ugrp = s_ugrp and
7.04 c                             b2stek = s_stek and
7.04 c                             b2ftek = s_ftek and
7.04 c                             b2ldor = s_ldor
7.04 c                   eval      b_regl = *on
7.04 c                   goto      end_sØk2
7.04 c                   endif
      *
      * Validering av varegruppe
      *
     c                   if        b2ogrp = 0 and
     c                             b2hgrp <> 0
     c                   eval      *in31 = *on
     c                   leavesr
     c                   endif
      *
     c                   if        b2hgrp = 0 and
     c                             b2ugrp <> 0
     c                   eval      *in32 = *on
     c                   leavesr
     c                   endif
      *
      * Tar vare på søk
      *
     c                   eval      s_ogrp = b2ogrp
     c                   eval      s_hgrp = b2hgrp
     c                   eval      s_ugrp = b2ugrp
     c                   eval      s_stek = b2stek
     c                   eval      s_ftek = b2ftek
7.02 c                   eval      s_ldor = b2ldor
      *
      * Søk via søketekst
      *
     c                   if        b2stek <> *blank
      *
     c                   eval      b_open_sok = *on
      *
     c                   call      'AS702R'
     c                   parm                    b2stek
     c                   parm                    w_ste1
     c                   parm                    w_ste2
     c                   parm                    w_ste3
     c                   parm                    w_ste4
     c                   parm                    w_ste5
      *
     c                   select
     c                   when      b2ogrp = 0 and
     c                             b2hgrp = 0 and
     c                             b2ugrp = 0
     c                   eval      w_seqe = 'S '
     c                   when      b2ogrp <> 0 and
     c                             b2hgrp = 0 and
     c                             b2ugrp = 0
     c                   eval      w_seqe = 'SO'
     c                   when      b2ogrp <> 0 and
     c                             b2hgrp <> 0 and
     c                             b2ugrp = 0
     c                   eval      w_seqe = 'SH'
     c                   when      b2ogrp <> 0 and
     c                             b2hgrp <> 0 and
     c                             b2ugrp <> 0
     c                   eval      w_seqe = 'SU'
     c                   endsl
      *
     c                   goto      end_sØk
      *
     c                   endif
      *
      * Søk via fritekst
8.01 c                   if        b2ftek <> *blank
8.01  * sjekker om logistikk-vare
8.01 c                   eval      w_jvqvnr = %trim(b2ftek)
8.02  * Sjekker om søkebegrep er numerisk
8.02 c     digits        check     w_jvqvnr      w_pos
8.02 c                   if        w_pos  <> 0
8.02 c                   clear                   w_jvqvnr
8.02 c                   endif
8.02  *
8.01 c                   exsr      finn_logivar
8.01 c                   if        *in27 = *on or
8.01 c                             *in28 = *on
8.01 c                   eval      w_vare = w_logl
8.01 c                   eval      b_open_sok = *on
8.01 c                   eval      w_seqe = 'LO'
8.01 c                   goto      end_sØk
8.01 c                   else
      *
     c                   eval      b_open_sok = *on
      *
     c                   call      'AS701R'
     c                   parm                    b2ftek
     c                   parm                    w_ste1
     c                   parm                    w_ste2
     c                   parm                    w_ste3
     c                   parm                    w_ste4
     c                   parm                    w_ste5
      *
     c                   select
     c                   when      b2ogrp = 0 and
     c                             b2hgrp = 0 and
     c                             b2ugrp = 0
     c                   eval      w_seqe = 'F '
     c                   when      b2ogrp <> 0 and
     c                             b2hgrp = 0 and
     c                             b2ugrp = 0
     c                   eval      w_seqe = 'FO'
     c                   when      b2ogrp <> 0 and
     c                             b2hgrp <> 0 and
     c                             b2ugrp = 0
     c                   eval      w_seqe = 'FH'
     c                   when      b2ogrp <> 0 and
     c                             b2hgrp <> 0 and
     c                             b2ugrp <> 0
     c                   eval      w_seqe = 'FU'
     c                   endsl

      *
     c                   goto      end_sØk
      *
     c                   endif
8.01 c                   endif
      *
      * Søk på overgruppe
      *
     c                   if        b2ogrp <> 0 and
     c                             b2hgrp =  0 and
     c                             b2ugrp =  0
     c                   eval      w_seqe = 'O '
     c                   eval      jvarla_ogrp = b2ogrp
     c     jvarla_key    setll     jvarla
     c                   goto      end_sØk
     c                   endif
      *
      * Søk på hovedgruppe
      *
     c                   if        b2ogrp <> 0 and
     c                             b2hgrp <> 0 and
     c                             b2ugrp =  0
     c                   eval      w_seqe = 'H '
     c                   eval      jvarlb_ogrp = b2ogrp
     c                   eval      jvarlb_hgrp = b2hgrp
     c     jvarlb_key    setll     jvarlb
     c                   goto      end_sØk
     c                   endif
      *
      * Søk på undergruppe
      *
     c                   if        b2ogrp <> 0 and
     c                             b2hgrp <> 0 and
     c                             b2ugrp <> 0
     c                   eval      w_seqe = 'U '
     c                   eval      jvarlc_ogrp = b2ogrp
     c                   eval      jvarlc_hgrp = b2hgrp
     c                   eval      jvarlc_ugrp = b2ugrp
     c     jvarlc_key    setll     jvarlc
     c                   goto      end_sØk
     c                   endif
7.02  *
7.02  * Søk på leverandør
7.02  *
7.02 c**                 if        b2ldor <> s_ldor
7.02 c                   if        b2ldor <> 0
7.02  *
7.02 c                   eval      b2lnvn = *blanks
7.02 c                   if        b2ldor <> 0
7.02 c                   eval      rlevl1_levr = b2ldor
7.02 c     rlevl1_key    chain     rlevl1
7.02 c                   if        not %found
7.02 c                   eval      b2lnvn = 'Koden er ugyldig'
7.02 c                   goto      end_sØk
7.02 c                   else
7.02 c                   eval      s_ldor = b2ldor
7.02 c                   eval      b2lnvn = rlnavn
7.02 c                   eval      jlevl3_enum = b2ldor
7.02 c     jlevl3_key    chain     jlevl3
7.02 c                   if        not %found
7.02 c                   eval      b2lnvn = 'Koden er ugyldig'
7.02 c                   goto      end_sØk
7.02 c                   else
7.02 c                   eval      w_seqe = 'LE'
7.02 c                   eval      s_enum = jlldor
7.02 c                   eval      jvarl6_ldor = jlldor
7.02 c     jvarl6_key    setll     jvarl6
7.02 c                   goto      end_sØk
7.02 c                   endif
7.02 c                   endif
7.02 c                   endif
7.02  *
7.02 c                   endif
      *
     c     end_sØk       tag
      *
      * Blanker subfile, og fyller opp i.h.t. søk
      *
     c                   eval      *in22 = *off
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
      * Blanker søkefelt
      *
7.02 c                   if        b2null = 1
     c                   eval      b2ogrp = 0
     c                   eval      b2hgrp = 0
     c                   eval      b2ugrp = 0
     c                   eval      b2stek = *blank
     c                   eval      b2ftek = *blank
7.02 c                   eval      b2ldor = 0
7.02 c                   eval      b2lnvn = *blanks
7.02 c                   endif
      *
7.04 c     end_sØk2      endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for posisjonering i subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     posisjoner    begsr
      *
      * Varetekst
      *
     c                   if        b2tek1 <> *blank
     c                   eval      w_seqe = *blank
     c                   eval      jvarl2_tek1 = b2tek1
     c     jvarl2_key    setll     jvarl2
     c                   goto      end_pos
     c                   endif
      *
      * Varenummer
      *
     c                   if        b2vare <> 0
     c                   eval      w_seqe = 'V '
     c                   eval      *in80 = *on
     c                   eval      *in81 = *off
     c                   eval      *in82 = *off
     c                   movel     b2vare        jvarl1_vare
     c     jvarl1_key    setll     jvarl1
     c                   goto      end_pos
     c                   endif
      *
      * Nobbnummer
      *
     c                   if        b2nobb <> 0
     c                   eval      w_seqe = 'N '
     c                   eval      *in80 = *off
     c                   eval      *in81 = *on
     c                   eval      *in82 = *off
     c                   eval      jvarl3_nobb = b2nobb
     c     jvarl3_key    setll     jvarl3
     c                   goto      end_pos
     c                   endif
      *
      * Lev. varenummer
      *
     c                   if        b2lvar <> *blank
     c                   eval      w_seqe = 'L '
     c                   eval      *in80 = *off
     c                   eval      *in81 = *off
     c                   eval      *in82 = *on
     c                   eval      jvarl4_lvar = b2lvar
     c     jvarl4_key    setll     jvarl4
     c                   goto      end_pos
     c                   endif
      *
     c     end_pos       tag
      *
      * Blanker subfile, og fyller opp i.h.t. posisjonering
      *
     c                   eval      *in22 = *off
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
      * Blanker posisjoneringsfelter
      *
     c                   eval      b2tek1 = *blank
     c                   eval      b2vare = 0
     c                   eval      b2nobb = 0
     c                   eval      b2lvar = *blank
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     subfile       begsr
      *
7.fb c                   eval      *in33 = *off
     c                   if        *in22 = *off
     c                   eval      *in22 = *on
     c                   else
     c                   eval      *in22 = *off
     c                   endif
      *
     c                   eval      w_virn = w_fcrn
      *
      * Leser og behandler subfile
      *
     c                   do        w_ssrn
     c                   readc     b1sfl                                  16
      *
     c                   if        *in16
     c                   leave
     c                   endif
      *
     c                   eval      *in22 = *off
     c                   eval      w_virn = w_srrn
      *
      * Antall er utfylt, linje skal registreres
      *
     c                   if        b1anta <> 0
      *
7.fb c                   if        p_depo = *on
7.fb c                   eval      w_mld1 = 'Depositum finnes, kun +
7.fb c                                       tjenestevarer kan registreres'
7.fb c                   call      'AA005R'
7.fb c                   parm                    w_mld1
7.fb c                   eval      *in33 = *on
7.fb c                   eval      b1anta = 0
7.fb c                   update    b1sfl
7.fb c                   leavesr
7.fb c                   endif
      *
     c                   move      '->'          b1tek1
      *
     c                   eval      w_line = w_line + 10
     c                   eval      w_anta = b1anta
      *
     c                   call      'FD120R'
     c                   parm                    p_kode
     c                   parm                    w_firm
     c                   parm                    w_numm
     c                   parm                    w_suff
     c                   parm                    w_line
     c                   parm                    p_ltyp
     c                   parm                    p_lety
     c                   parm                    b1vare
     c                   parm                    w_anta
Q.02  *
Q.02  * Kall program for synking med bestilling
Q.02  *
Q.02 c                   call      'QD100R'
Q.02 c                   parm                    w_firm
Q.02 c                   parm                    w_numm
Q.02 c                   parm                    w_suff
Q.02 c                   parm                    w_line
      *
     c                   exsr      hent_total
      *
     c                   eval      b1anta = 0
6.37  * sjekk farge
6.37 c                   eval      w_jvqvnr = b1vare
6.37 c                   exsr      finn_logivar
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
     c                   enddo
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for registrering av tekstlinje
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     tekstlinje    begsr
      *
     c                   eval      w_line = w_line + 10
      *
     c                   call      'FD110R'
     c                   parm                    p_kode
     c                   parm                    w_firm
     c                   parm                    w_numm
     c                   parm                    w_suff
     c                   parm                    w_line
     c                   parm                    faatty
Q.02  *
Q.02  * Kall program for synking med bestilling
Q.02  *
Q.02 c                   call      'QD100R'
Q.02 c                   parm                    w_firm
Q.02 c                   parm                    w_numm
Q.02 c                   parm                    w_suff
Q.02 c                   parm                    w_line
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for tømming av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     clr_subfile   begsr
      *
     c                   eval      *in14 = *on
     c                   write     b2ctl
     c                   eval      *in14 = *off
      *
     c                   eval      *in15 = *off
     c                   eval      w_srrn = 0
     c                   eval      w_sfrn = 0
     c                   eval      w_ssrn = 0
     c                   eval      w_spge = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å fylle opp subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     crt_subfile   begsr
      *
     c                   eval      w_spge = w_spge + c_sfil
     c                   eval      w_srrn = w_ssrn
      *
     c                   eval      s_vare = *blank
      *
      * Initierer SQL for søk
      *
     c                   if        b_open_sok = *on
      *
     c                   select
     c                   when      w_seqe = 'SO'
     c/exec sql
     c+                  declare sok_so cursor for
os71 c+                  select s.jsvare,
os71 c+                         s.jsstek,
os71 c+                         v.jvvare,
os71 c+                         v.jvogrp,
os71 c+                         v.jvtek1,
7.xx c+                         v.jvtek2,
os71 c+                         v.jvnobb,
os71 c+                         v.jvlvar,
6.34 c+                         p.jvluda,
os71 c+                         v.jvldor
os71 c+                  from   jsokpf as s inner join
os71 c+                         jvarpf as v on
os71 c+                         s.jsvare = v.jvvare
6.35 c+                         inner join jvlepf as p
6.35 c+                         on v.jvvare  = p.jvlvnr and
6.35 c+                            v.jvldor  = p.jvlldo
os71 c+                  where  v.jvogrp = :b2ogrp and
6.34 c*                         v.jvstat <> 4 and
6.34 c+                         p.jvluda < :w_udat and
6.33 c+                         s.jsstek like :w_ste1 and
6.35 c+                              (p.jvluda = :w_loda or
6.35 c+                               p.jvluda > :w_udat) and
6.35 c+                         v.jvnobb not in
6.35 c+                         (select jvquno from jvklpf
6.e4 c+                         where jvqfir = :w_firm)
os71 c+                  order by v.jvtek1, v.jvvare
     c+                  for read only
     c/end-exec
     c/exec sql
     c+                  close sok_so
     c/end-exec
     c/exec sql
     c+                  open sok_so
     c/end-exec
      *
     c                   when      w_seqe = 'SH'
     c/exec sql
     c+                  declare sok_sh cursor for
os71 c+                  select s.jsvare,
os71 c+                         s.jsstek,
os71 c+                         v.jvvare,
os71 c+                         v.jvogrp,
os71 c+                         v.jvhgrp,
os71 c+                         v.jvtek1,
7.xx c+                         v.jvtek2,
os71 c+                         v.jvnobb,
os71 c+                         v.jvlvar,
6.34 c+                         p.jvluda,
os71 c+                         v.jvldor
os71 c+                  from   jsokpf as s inner join
os71 c+                         jvarpf as v on
os71 c+                         s.jsvare = v.jvvare
6.35 c+                         inner join jvlepf as p
6.35 c+                         on v.jvvare  = p.jvlvnr and
6.35 c+                            v.jvldor  = p.jvlldo
os71 c+                  where  v.jvogrp = :b2ogrp and
os71 c+                         v.jvhgrp = :b2hgrp and
6.34 c*                         v.jvstat <> 4 and
6.34 c+                         p.jvluda < :w_udat and
6.33 c+                         s.jsstek like :w_ste1  and
6.35 c+                              (p.jvluda = :w_loda or
6.35 c+                               p.jvluda > :w_udat) and
6.35 c+                         v.jvnobb not in
6.35 c+                         (select jvquno from jvklpf
6.e4 c+                         where jvqfir = :w_firm)
os71 c+                  order by v.jvtek1, v.jvvare
     c+                  for read only
     c/end-exec
     c/exec sql
     c+                  close sok_sh
     c/end-exec
     c/exec sql
     c+                  open sok_sh
     c/end-exec
      *
     c                   when      w_seqe = 'SU'
     c/exec sql
     c+                  declare sok_su cursor for
os71 c+                  select s.jsvare,
os71 c+                         s.jsstek,
os71 c+                         v.jvvare,
os71 c+                         v.jvogrp,
os71 c+                         v.jvhgrp,
os71 c+                         v.jvugrp,
os71 c+                         v.jvtek1,
7.xx c+                         v.jvtek2,
os71 c+                         v.jvnobb,
os71 c+                         v.jvlvar,
6.34 c+                         p.jvluda,
os71 c+                         v.jvldor
os71 c+                  from   jsokpf as s inner join
os71 c+                         jvarpf as v on
os71 c+                         s.jsvare = v.jvvare
6.35 c+                         inner join jvlepf as p
6.35 c+                         on v.jvvare  = p.jvlvnr and
6.35 c+                            v.jvldor  = p.jvlldo
os71 c+                  where  v.jvogrp = :b2ogrp and
os71 c+                         v.jvhgrp = :b2hgrp and
os71 c+                         v.jvugrp = :b2ugrp and
6.34 c*                         v.jvstat <> 4 and
6.34 c+                         p.jvluda < :w_udat and
6.33 c+                         s.jsstek like :w_ste1  and
6.35 c+                            (p.jvluda = :w_loda or
6.35 c+                             p.jvluda > :w_udat) and
6.35 c+        v.jvvare not in
6.35 c+        (select vvvare from vvarpf
6.35 c+         where vvfirm = :w_firm)  and
6.35 c+                         v.jvnobb not in
6.35 c+                         (select jvquno from jvklpf
6.e4 c+                         where jvqfir = :w_firm)
os71 c+                  order by v.jvtek1, v.jvvare
     c+                  for read only
     c/end-exec
     c/exec sql
     c+                  close sok_su
     c/end-exec
     c/exec sql
     c+                  open sok_su
     c/end-exec
      *
     c                   when      w_seqe = 'S '
     c/exec sql
     c+                  declare sok_s cursor for
os71 c+                  select s.jsvare,
os71 c+                         s.jsstek,
os71 c+                         v.jvvare,
os71 c+                         v.jvtek1,
7.xx c+                         v.jvtek2,
os71 c+                         v.jvnobb,
os71 c+                         v.jvlvar,
6.34 c+                         p.jvluda,
os71 c+                         v.jvldor
os71 c+                  from   jsokpf as s inner join
os71 c+                         jvarpf as v on
os71 c+                         s.jsvare = v.jvvare
6.35 c+                         inner join jvlepf as p
6.35 c+                         on v.jvvare  = p.jvlvnr and
6.35 c+                            v.jvldor  = p.jvlldo
6.34 c*                  where  v.jvstat <> 4 and
6.34 c+                  where  p.jvluda < :w_udat and
6.33 c+                         s.jsstek like :w_ste1  and
6.35 c+                            (p.jvluda = :w_loda or
6.35 c+                             p.jvluda > :w_udat) and
6.35 c+        v.jvvare not in
6.35 c+        (select vvvare from vvarpf
6.35 c+         where vvfirm = :w_firm)  and
6.35 c+                         v.jvnobb not in
6.35 c+                         (select jvquno from jvklpf
6.e4 c+                         where jvqfir = :w_firm)
os71 c+                  order by v.jvtek1, v.jvvare
     c+                  for read only
     c/end-exec
     c/exec sql
     c+                  close sok_s
     c/end-exec
     c/exec sql
     c+                  open sok_s
     c/end-exec
      *
     c                   when      w_seqe = 'FO'
     c/exec sql
     c+                  declare sok_fo cursor for
os71 c+                  select s.jvsvar,
os71 c+                         s.jvstek,
os71 c+                         v.jvvare,
os71 c+                         v.jvogrp,
os71 c+                         v.jvtek1,
7.xx c+                         v.jvtek2,
os71 c+                         v.jvnobb,
os71 c+                         v.jvlvar,
6.34 c+                         p.jvluda,
os71 c+                         v.jvldor
os71 c+                  from   jvsost as s inner join
os71 c+                         jvarpf as v on
os71 c+                         s.jvsvar = v.jvvare
6.35 c+                         inner join jvlepf as p
6.35 c+                         on v.jvvare  = p.jvlvnr and
6.35 c+                            v.jvldor  = p.jvlldo
os71 c+                  where  v.jvogrp = :b2ogrp and
6.34 c*                         v.jvstat <> 4 and
6.34 c+                         p.jvluda < :w_udat and
os71 c+                         s.jvstek like :w_ste1 and
os71 c+                         s.jvstek like :w_ste2 and
os71 c+                         s.jvstek like :w_ste3 and
os71 c+                         s.jvstek like :w_ste4 and
6.33 c+                         s.jvstek like :w_ste5 and
6.35 c+                            (p.jvluda = :w_loda or
6.35 c+                             p.jvluda > :w_udat) and
6.35 c+        v.jvvare not in
6.35 c+        (select vvvare from vvarpf
6.35 c+         where vvfirm = :w_firm)  and
6.35 c+                         v.jvnobb not in
6.35 c+                         (select jvquno from jvklpf
6.e4 c+                         where jvqfir = :w_firm)
os71 c+                  order by s.jvstek, s.jvsvar
     c+                  for read only
     c/end-exec
     c/exec sql
     c+                  close sok_fo
     c/end-exec
     c/exec sql
     c+                  open sok_fo
     c/end-exec
      *
     c                   when      w_seqe = 'FH'
     c/exec sql
     c+                  declare sok_fh cursor for
os71 c+                  select s.jvsvar,
os71 c+                         s.jvstek,
os71 c+                         v.jvvare,
os71 c+                         v.jvogrp,
os71 c+                         v.jvhgrp,
os71 c+                         v.jvtek1,
7.xx c+                         v.jvtek2,
os71 c+                         v.jvnobb,
os71 c+                         v.jvlvar,
6.34 c+                         p.jvluda,
os71 c+                         v.jvldor
os71 c+                  from   jvsost as s inner join
os71 c+                         jvarpf as v on
os71 c+                         s.jvsvar = v.jvvare
6.35 c+                         inner join jvlepf as p
6.35 c+                         on v.jvvare  = p.jvlvnr and
6.35 c+                            v.jvldor  = p.jvlldo
os71 c+                  where  v.jvogrp = :b2ogrp and
os71 c+                         v.jvhgrp = :b2hgrp and
6.34 c*                         v.jvstat <> 4 and
6.34 c+                         p.jvluda < :w_udat and
os71 c+                         s.jvstek like :w_ste1 and
os71 c+                         s.jvstek like :w_ste2 and
os71 c+                         s.jvstek like :w_ste3 and
os71 c+                         s.jvstek like :w_ste4 and
6.33 c+                         s.jvstek like :w_ste5 and
6.35 c+                            (p.jvluda = :w_loda or
6.35 c+                             p.jvluda > :w_udat) and
6.35 c+        v.jvvare not in
6.35 c+        (select vvvare from vvarpf
6.35 c+         where vvfirm = :w_firm)  and
6.35 c+                         v.jvnobb not in
6.35 c+                         (select jvquno from jvklpf
6.35 c+                         where jvqfir = :w_firm)
os71 c+                  order by s.jvstek, s.jvsvar
     c+                  for read only
     c/end-exec
     c/exec sql
     c+                  close sok_fh
     c/end-exec
     c/exec sql
     c+                  open sok_fh
     c/end-exec
      *
     c                   when      w_seqe = 'FU'
     c/exec sql
     c+                  declare sok_fu cursor for
os71 c+                  select s.jvsvar,
os71 c+                         s.jvstek,
os71 c+                         v.jvvare,
os71 c+                         v.jvogrp,
os71 c+                         v.jvhgrp,
os71 c+                         v.jvugrp,
os71 c+                         v.jvtek1,
7.xx c+                         v.jvtek2,
os71 c+                         v.jvnobb,
os71 c+                         v.jvlvar,
6.34 c+                         p.jvluda,
os71 c+                         v.jvldor
os71 c+                  from   jvsost as s inner join
os71 c+                         jvarpf as v on
os71 c+                         s.jvsvar = v.jvvare
6.35 c+                         inner join jvlepf as p
6.35 c+                         on v.jvvare  = p.jvlvnr and
6.35 c+                            v.jvldor  = p.jvlldo
os71 c+                  where  v.jvogrp = :b2ogrp and
os71 c+                         v.jvhgrp = :b2hgrp and
os71 c+                         v.jvugrp = :b2ugrp and
6.34 c*                         v.jvstat <> 4 and
6.34 c+                         p.jvluda < :w_udat and
os71 c+                         s.jvstek like :w_ste1 and
os71 c+                         s.jvstek like :w_ste2 and
os71 c+                         s.jvstek like :w_ste3 and
os71 c+                         s.jvstek like :w_ste4 and
6.33 c+                         s.jvstek like :w_ste5 and
6.35 c+                            (p.jvluda = :w_loda or
6.35 c+                             p.jvluda > :w_udat)  and
6.35 c+        v.jvvare not in
6.35 c+        (select vvvare from vvarpf
6.35 c+         where vvfirm = :w_firm)  and
6.35 c+                         v.jvnobb not in
6.35 c+                         (select jvquno from jvklpf
6.e4 c+                         where jvqfir = :w_firm)
os71 c+                  order by s.jvstek, s.jvsvar
     c+                  for read only
     c/end-exec
     c/exec sql
     c+                  close sok_fu
     c/end-exec
     c/exec sql
     c+                  open sok_fu
     c/end-exec
      *
     c                   when      w_seqe = 'F '
     c/exec sql
     c+                  declare sok_f cursor for
os71 c+                  select s.jvsvar,
os71 c+                         s.jvstek,
os71 c+                         v.jvvare,
os71 c+                         v.jvtek1,
7.xx c+                         v.jvtek2,
os71 c+                         v.jvnobb,
os71 c+                         v.jvlvar,
6.34 c+                         p.jvluda,
os71 c+                         v.jvldor
os71 c+                  from   jvsost as s inner join
os71 c+                         jvarpf as v on
os71 c+                         s.jvsvar = v.jvvare
6.35 c+                         inner join jvlepf as p
6.35 c+                         on v.jvvare  = p.jvlvnr and
6.35 c+                            v.jvldor  = p.jvlldo
6.34 c*                  where  v.jvstat <> 4 and
6.34 c+                  where  p.jvluda < :w_udat and
os71 c+                         s.jvstek like :w_ste1 and
os71 c+                         s.jvstek like :w_ste2 and
os71 c+                         s.jvstek like :w_ste3 and
os71 c+                         s.jvstek like :w_ste4 and
6.33 c+                         s.jvstek like :w_ste5 and
6.35 c+                         (p.jvluda = :w_loda or
6.35 c+                          p.jvluda > :w_udat)  and
6.35 c+        v.jvvare not in
6.35 c+        (select vvvare from vvarpf
6.35 c+         where vvfirm = :w_firm)  and
6.35 c+                         v.jvnobb not in
6.35 c+                         (select jvquno from jvklpf
6.e4 c+                         where jvqfir = :w_firm)
os71 c+                  order by s.jvstek, s.jvsvar
     c+                  for read only
     c/end-exec
     c/exec sql
     c+                  close sok_f
     c/end-exec
     c/exec sql
     c+                  open sok_f
     c/end-exec
8.01 c                   when      w_seqe = 'LO'
8.01 c/exec sql
8.01 c+                  declare sok_lo cursor for
8.01 c+                  select v.jvvare,
8.01 c+                         v.jvtek1,
8.01 c+                         v.jvtek2,
8.01 c+                         v.jvnobb,
8.01 c+                         v.jvlvar,
8.01 c+                         v.jvldor
8.01 c+                  from   jvarpf as v
8.01 c+                  where  v.jvvare = :w_vare  and
8.01 c+                         v.jvvare not in
8.01 c+        (select vvvare from vvarpf
8.01 c+         where vvfirm = :w_firm)
8.01 c+                  order by v.jvvare
8.01 c+                  for read only
8.01 c/end-exec
8.01 c/exec sql
8.01 c+                  close sok_lo
8.01 c/end-exec
8.01 c/exec sql
8.01 c+                  open sok_lo
8.01 c/end-exec
8.01
      *
     c                   endsl
      *
     c                   endif
      *
      * Fyller opp subfile
      *
     c                   dou       w_srrn = w_spge
      *
     c                   select
     c                   when      w_seqe = 'O '
     c     jvarla_key    reade     jvarla                                 15
     c                   when      w_seqe = 'H '
     c     jvarlb_key    reade     jvarlb                                 15
     c                   when      w_seqe = 'U '
     c     jvarlc_key    reade     jvarlc                                 15
7.02 c                   when      w_seqe = 'LE'
7.02 c     jvarl6_key    reade     jvarl6                                 15
     c                   when      w_seqe = 'SO'
     c/exec sql
     c+                  fetch next
     c+                  from  sok_so
     c+                  into  :jsvare,
     c+                        :jsstek,
     c+                        :jvvare,
     c+                        :jvogrp,
     c+                        :jvtek1,
7.xx c+                        :jvtek2,
     c+                        :jvnobb,
     c+                        :jvlvar,
6.31 c+                        :jvudat,
     c+                        :jvldor
     c/end-exec
     c                   if        sqlcod = 100 or sqlstt = '02000'
     c                   eval      *in15 = *on
     c                   endif
      *
     c                   when      w_seqe = 'SH'
     c/exec sql
     c+                  fetch next
     c+                  from  sok_sh
     c+                  into  :jsvare,
     c+                        :jsstek,
     c+                        :jvvare,
     c+                        :jvogrp,
     c+                        :jvhgrp,
     c+                        :jvtek1,
7.xx c+                        :jvtek2,
     c+                        :jvnobb,
     c+                        :jvlvar,
6.31 c+                        :jvudat,
     c+                        :jvldor
     c/end-exec
     c                   if        sqlcod = 100 or sqlstt = '02000'
     c                   eval      *in15 = *on
     c                   endif
      *
     c                   when      w_seqe = 'SU'
     c/exec sql
     c+                  fetch next
     c+                  from  sok_su
     c+                  into  :jsvare,
     c+                        :jsstek,
     c+                        :jvvare,
     c+                        :jvogrp,
     c+                        :jvhgrp,
     c+                        :jvugrp,
     c+                        :jvtek1,
7.xx c+                        :jvtek2,
     c+                        :jvnobb,
     c+                        :jvlvar,
6.31 c+                        :jvudat,
     c+                        :jvldor
     c/end-exec
     c                   if        sqlcod = 100 or sqlstt = '02000'
     c                   eval      *in15 = *on
     c                   endif
      *
     c                   when      w_seqe = 'S '
     c/exec sql
     c+                  fetch next
     c+                  from  sok_s
     c+                  into  :jsvare,
     c+                        :jsstek,
     c+                        :jvvare,
     c+                        :jvtek1,
7.xx c+                        :jvtek2,
     c+                        :jvnobb,
     c+                        :jvlvar,
6.31 c+                        :jvudat,
     c+                        :jvldor
     c/end-exec
     c                   if        sqlcod = 100 or sqlstt = '02000'
     c                   eval      *in15 = *on
     c                   endif
      *
     c                   when      w_seqe = 'FO'
     c/exec sql
     c+                  fetch next
     c+                  from  sok_fo
     c+                  into  :jsvare,
     c+                        :jvstek,
     c+                        :jvvare,
     c+                        :jvogrp,
     c+                        :jvtek1,
7.xx c+                        :jvtek2,
     c+                        :jvnobb,
     c+                        :jvlvar,
6.31 c+                        :jvudat,
     c+                        :jvldor
     c/end-exec
     c                   if        sqlcod = 100 or sqlstt = '02000'
     c                   eval      *in15 = *on
     c                   endif
      *
     c                   when      w_seqe = 'FH'
     c/exec sql
     c+                  fetch next
     c+                  from  sok_fh
     c+                  into  :jsvare,
     c+                        :jvstek,
     c+                        :jvvare,
     c+                        :jvogrp,
     c+                        :jvhgrp,
     c+                        :jvtek1,
7.xx c+                        :jvtek2,
     c+                        :jvnobb,
     c+                        :jvlvar,
6.31 c+                        :jvudat,
     c+                        :jvldor
     c/end-exec
     c                   if        sqlcod = 100 or sqlstt = '02000'
     c                   eval      *in15 = *on
     c                   endif
      *
     c                   when      w_seqe = 'FU'
     c/exec sql
     c+                  fetch next
     c+                  from  sok_fu
     c+                  into  :jsvare,
     c+                        :jvstek,
     c+                        :jvvare,
     c+                        :jvogrp,
     c+                        :jvhgrp,
     c+                        :jvugrp,
     c+                        :jvtek1,
7.xx c+                        :jvtek2,
     c+                        :jvnobb,
     c+                        :jvlvar,
6.31 c+                        :jvudat,
     c+                        :jvldor
     c/end-exec
     c                   if        sqlcod = 100 or sqlstt = '02000'
     c                   eval      *in15 = *on
     c                   endif
      *
     c                   when      w_seqe = 'F '
     c/exec sql
     c+                  fetch next
     c+                  from  sok_f
     c+                  into  :jsvare,
     c+                        :jvstek,
     c+                        :jvvare,
     c+                        :jvtek1,
7.xx c+                        :jvtek2,
     c+                        :jvnobb,
     c+                        :jvlvar,
6.31 c+                        :jvudat,
     c+                        :jvldor
     c/end-exec
     c                   if        sqlcod = 100 or sqlstt = '02000'
     c                   eval      *in15 = *on
     c                   endif
      *
8.01 c                   when      w_seqe = 'LO'
8.01 c/exec sql
8.01 c+                  fetch next
8.01 c+                  from  sok_lo
8.01 c+                  into  :jvvare,
8.01 c+                        :jvtek1,
8.01 c+                        :jvtek2,
8.01 c+                        :jvnobb,
8.01 c+                        :jvlvar,
8.01 c+                        :jvldor
8.01 c/end-exec
8.01 c                   if        sqlcod = 100 or sqlstt = '02000'
8.01 c                   eval      *in15 = *on
8.01 c                   endif
      *
     c                   when      w_seqe = 'V '
     c                   read      jvarl1                                 15
     c                   when      w_seqe = 'N '
     c                   read      jvarl3                                 15
     c                   when      w_seqe = 'L '
     c                   read      jvarl4                                 15
     c                   other
     c                   read      jvarl2                                 15
     c                   endsl
      *
     c                   if        *in15 = *on
     c                   leave
     c                   endif
6.35 c                   if        w_seqe = 'V' or
6.35 c                             w_seqe = 'N' or
6.35 c                             w_seqe = 'L' or
6.35 c                             w_seqe = *blank
6.35  *
6.35  * Test på at vare ikke finnes i EVR
6.35  *
6.35 c                   eval      vvarl1_vare = jvvare
6.35 c     vvarl1_key    chain     vvarl1
6.35 c                   if        %found
6.35 c                   iter
6.35 c                   endif
6.35  * test på at vare ikke er logistikk-vare
6.35 c                   eval      w_logi = 0
6.35 c/exec sql
6.35 c+ select count(*)
6.35 i+ into   :w_logi
6.35 c+ from   jvklpf
6.35 c+ where  jvquno = :jvvare
6.35 c/end-exec
6.35 c                   if        w_logi <> 0
6.35 c                   iter
6.35 c                   endif
6.35 c                   endif
      *
      * Behandling av søketekst
      *
     c                   if        w_seqe = 'SO' or
     c                             w_seqe = 'SH' or
     c                             w_seqe = 'SU' or
     c                             w_seqe = 'S '
      *
     c                   if        jsvare = s_vare
     c                   iter
     c                   endif
      *
6.34  ** se om man kan fjerne dette
6.34 c*                   if        w_ste2 <> *blank
6.34 c*                   eval      w_leng = %len(%trim(w_ste2))
6.34 c*                   eval      jsokl3_vare = jsvare
6.34 c*                   eval      jsokl3_stek = w_ste2
6.34 c*     jsokl3_key    setll     jsokl3
6.34 c*                   read      jsokl3
6.34 c*                   if        %eof or
6.34 c*                             jvvare <> jsvare or
6.34 c*                             w_ste2 <> %subst(jsstek:1:w_leng)
6.34 c*                   iter
6.34 c*                   endif
6.34 c*                   endif
6.34  **
6.34 c*                   if        w_ste3 <> *blank
6.34 c*                   eval      w_leng = %len(%trim(w_ste3))
6.34 c*                   eval      jsokl3_vare = jsvare
6.34 c*                   eval      jsokl3_stek = w_ste3
6.34 c*     jsokl3_key    setll     jsokl3
6.34 c*                   read      jsokl3
6.34 c*                   if        %eof or
6.34 c*                             jvvare <> jsvare or
6.34 c*                             w_ste3 <> %subst(jsstek:1:w_leng)
6.34 c*                   iter
6.34 c*                   endif
6.34 c*                   endif
6.34  **
6.34 c*                   if        w_ste4 <> *blank
6.34 c*                   eval      w_leng = %len(%trim(w_ste4))
6.34 c*                   eval      jsokl3_vare = jsvare
6.34 c*                   eval      jsokl3_stek = w_ste4
6.34 c*     jsokl3_key    setll     jsokl3
6.34 c*                   read      jsokl3
6.34 c*                   if        %eof or
6.34 c*                             jvvare <> jsvare or
6.34 c*                             w_ste4 <> %subst(jsstek:1:w_leng)
6.34 c*                   iter
6.34 c*                   endif
6.34 c*                   endif
6.34  **
6.34 c*                   if        w_ste5 <> *blank
6.34 c*                   eval      w_leng = %len(%trim(w_ste5))
6.34 c*                   eval      jsokl3_vare = jsvare
6.34 c*                   eval      jsokl3_stek = w_ste5
6.34 c*     jsokl3_key    setll     jsokl3
6.34 c*                   read      jsokl3
6.34 c*                   if        %eof or
6.34 c*                             jvvare <> jsvare or
6.34 c*                             w_ste5 <> %subst(jsstek:1:w_leng)
6.34 c*                   iter
6.34 c*                   endif
6.34 c*                   endif
6.34  **
      *
     c                   eval      s_vare = jsvare
      *
     c                   endif
      *
      * Test på at vare ikke er utgått
      *
6.34  * kun hvis ikke sql-søk
6.34 c                   if        w_seqe = *blank or
6.34 c                             w_seqe = 'V ' or
6.34 c                             w_seqe = 'N ' or
7.02 c                             w_seqe = 'L ' or
8.01 c                             w_seqe = 'LO' or
7.02 c                             w_seqe = 'LE'
6.33  * sjekker mot JVLEPF, hvis alle leverandører har passert utg.dato
6.33  * så forkast
6.33 c                   eval      b_utgv = *on
6.33 c                   eval      jvlel1_lvnr = jvvare
6.33 c     jvlel1_key    setll     jvlel1
6.33 c     jvlel1_key    reade     jvlel1
6.33 c                   dow       not %eof(jvlel1)
6.33 c                   if        jvluda = *loval or
5.33 c                             jvluda > w_udat
6.33 c                   eval      b_utgv = *off
6.33 c                   endif
6.33 c     jvlel1_key    reade     jvlel1
6.33 c                   enddo
6.33 c                   if        b_utgv = *on
6.33 c                   iter
6.33 c                   endif
6.34 c                   if        jvstat = 4 or
     c                             jvudat <> *loval and
     c                             jvudat < w_udat
     c                   iter
     c                   endif
6.34  *
      *
      * Test på at vare ikke finnes i EVR
      *
     c                   eval      vvarl1_vare = jvvare
     c     vvarl1_key    chain     vvarl1
     c                   if        %found
     c                   iter
     c                   endif
6.34 c                   endif
7.02  *
7.02 c                   if        b2ldor <> 0
7.02 c                   eval      jlevl1_ldor = jvldor
7.02 c     jlevl1_key    chain     jlevl1
7.02 c                   if        not %found
7.02 c                   iter
7.02 c                   endif
7.02  *
7.02 c                   if        b2ldor <> jlenum
7.02 c                   iter
7.02 c                   endif
7.02 c                   endif
      *
      * Skriver til subfile
      *
     c                   eval      w_srrn = w_srrn + 1
      *
     c                   select
     c                   when      w_seqe = *blank
     c                   eval      jvarl2_tek1 = jvtek1
     c                   when      w_seqe = 'V '
     c                   eval      jvarl1_vare = jvvare
     c                   when      w_seqe = 'N '
     c                   eval      jvarl3_nobb = jvnobb
     c                   when      w_seqe = 'L '
     c                   eval      jvarl4_lvar = jvlvar
     c                   endsl
      *
     c                   eval      b1vare = jvvare
     c                   eval      b1nobb = jvnobb
     c                   eval      b1lvar = jvlvar
     c                   eval      b1tek1 = jvtek1
7.xx c                   eval      b1tek2 = jvtek2
     c                   eval      b1nypo = *blank
     c                   eval      b1lnav = *blank
      *
     c                   select
     c                   when      *in80 = *on
     c                   eval      b1nypo = jvvare
     c                   when      *in81 = *on
     c                   eval      b1nypo = %editc(jvnobb : 'Z')
     c                   when      *in82 = *on
     c                   eval      b1nypo = jvlvar
     c                   endsl
      *
     c                   eval      jlevl1_ldor = jvldor
     c     jlevl1_key    chain     jlevl1
     c                   if        %found
     c                   eval      b1lnav = jlnavn
     c                   endif
6.37  *
6.37  * sjekk om logistikk-vare
6.37  *
6.37 c                   eval      w_jvqvnr = jvvare
6.37 c                   exsr      finn_logivar
      *
     c                   write     b1sfl
      *
     c                   enddo
      *
     c                   if        w_srrn > w_ssrn
     c                   eval      w_sfrn = w_ssrn + 1
     c                   endif
      *
     c                   eval      w_ssrn = w_srrn
     c                   eval      w_virn = w_sfrn
      *
     c                   eval      b_open_sok = *off
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å bla tilbake en side i subfilen
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bck_subfile   begsr
      *
     c                   if        w_seqe = 'O ' or
     c                             w_seqe = 'H ' or
     c                             w_seqe = 'U ' or
     c                             w_seqe = 'S ' or
     c                             w_seqe = 'SO' or
     c                             w_seqe = 'SH' or
     c                             w_seqe = 'SU' or
     c                             w_seqe = 'F ' or
     c                             w_seqe = 'FO' or
     c                             w_seqe = 'FH' or
     c                             w_seqe = 'FU'
     c                   exsr      forny
     c                   leavesr
     c                   endif
      *
     c                   if        *in15
     c                   select
     c                   when      w_seqe = 'V '
     c     jvarl1_key    setgt     jvarl1
     c                   readp     jvarl1
     c                   when      w_seqe = 'N '
     c     jvarl3_key    setgt     jvarl3
     c                   readp     jvarl3
     c                   when      w_seqe = 'L '
     c     jvarl4_key    setgt     jvarl4
     c                   readp     jvarl4
7.02 c                   when      w_seqe = 'LE'
7.02 c     jvarl6_key    setgt     jvarl6
7.02 c                   readpe    jvarl6
     c                   other
     c     jvarl2_key    setgt     jvarl2
     c                   readp     jvarl2
     c                   endsl
     c                   endif
      *
      * Leser tilbake en side
      *
     c                   eval      w_stel = 0
      *
     c                   dou       w_stel = w_ssrn + c_sfil
      *
     c                   select
     c                   when      w_seqe = 'V '
     c                   readp     jvarl1
     c                   when      w_seqe = 'N '
     c                   readp     jvarl3
     c                   when      w_seqe = 'L '
     c                   readp     jvarl4
7.02 c                   when      w_seqe = 'LE'
7.02 c                   readpe    jvarl6
     c                   other
     c                   readp     jvarl2
     c                   endsl
      *
     c                   if        %eof
     c                   leave
     c                   endif
      *
     c                   if        jvstat = 4 or
     c                             jvudat <> *loval and
     c                             jvudat < w_udat
     c                   iter
     c                   endif
      *
     c                   eval      vvarl1_vare = jvvare
     c     vvarl1_key    chain     vvarl1
     c                   if        %found
     c                   iter
     c                   endif
      *
     c                   eval      w_stel = w_stel + 1
      *
     c                   select
     c                   when      w_seqe = 'V '
     c                   eval      jvarl1_vare = jvvare
     c                   when      w_seqe = 'N '
     c                   eval      jvarl3_nobb = jvnobb
     c                   when      w_seqe = 'L '
     c                   eval      jvarl4_lvar = jvlvar
     c                   other
     c                   eval      jvarl2_tek1 = jvtek1
     c                   endsl
      *
     c                   enddo
      *
     c                   if        %eof
     c                   select
     c                   when      w_seqe = 'V '
     c     jvarl1_key    setll     jvarl1
     c                   when      w_seqe = 'N '
     c     jvarl3_key    setll     jvarl3
     c                   when      w_seqe = 'L '
     c     jvarl4_key    setll     jvarl4
     c                   other
     c     jvarl2_key    setll     jvarl2
     c                   endsl
     c                   endif
      *
      * Blanker og fyller opp subfile
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for display av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     dsp_subfile   begsr
      *
     c                   if        w_srrn <> 0
     c                   eval      *in12 = *on
     c                   else
     c                   write     b2cmd
     c                   endif
      *
     c                   eval      *in13 = *on
     c                   exfmt     b2ctl
      *
     c                   eval      *in12 = *off
     c                   eval      *in13 = *off
      *
     c                   eval      w_fcrn = d_fcrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av spørring
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     spØrring      begsr
      *
      * Overgruppe
      *
     c                   if        w_afld = 'B2OGRP'
     c                   eval      b2hgrp = 0
     c                   eval      b2ugrp = 0
     c                   call      'VG510R'
     c                   parm                    w_firm
     c                   parm                    b2ogrp
     c                   parm                    w_otxt
     c                   leavesr
     c                   endif
      *
      * Hovedgruppe
      *
     c                   if        w_afld = 'B2HGRP'
     c                   eval      b2ugrp = 0
     c                   call      'VG511R'
     c                   parm                    w_firm
     c                   parm                    b2ogrp
     c                   parm                    b2hgrp
     c                   parm                    w_htxt
     c                   leavesr
     c                   endif
      *
      * Undergruppe
      *
     c                   if        w_afld = 'B2UGRP'
     c                   call      'VG512R'
     c                   parm                    w_firm
     c                   parm                    b2ogrp
     c                   parm                    b2hgrp
     c                   parm                    b2ugrp
     c                   parm                    w_utxt
     c                   leavesr
     c                   endif
7.02  *
7.02  * Leverandør
7.02  *
7.02 c                   if        w_afld = 'B2LDOR'
7.02 c                   call      'RL500R'
7.02 c                   parm                    w_firm
7.02 c                   parm                    b2ldor
7.02 c                   parm                    b2lnvn
7.02 c                   leavesr
7.02 c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for henting av ordretotal
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     hent_total    begsr
      *
     c                   eval      w_tots = 0
     c                   eval      w_totr = 0
      *
     c     fodtl1_key    setll     fodtl1
     c     fodtl1_key    reade     fodtl1
     c                   dow       not %eof
     c                   eval      w_tots = w_tots + fdsums
     c                   eval      w_totr = w_totr + fdsumr
     c     fodtl1_key    reade     fodtl1
     c                   enddo
      *
     c                   eval      b2tots = w_tots - w_totr
      *
     c                   endsr
6.37  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.37  * Finn info om logistikkvare for riktig prisgiver
6.37  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.37  *
6.37 c     finn_logivar  begsr
6.37  *
6.37 c                   eval      *in27 = *off
6.37 c                   eval      *in28 = *off
6.37 c
6.37 c                   if        %trim(w_jvqvnr) = ''
6.37 c                   leavesr
6.37 c                   endif
6.37 c
6.37 c                   eval      w_logl = ''
6.37 c                   eval      w_undv = 0
     c                   movel     w_jvqvnr      w_jvquno
6.37 c/exec sql
6.37 c+                  select jvquno, jvqvnr
6.37 c+                  into :w_undv, :w_logl
6.37 c+                  from jvklpf
6.37 c+                  where (jvquno = :w_jvquno or
6.37 c+                  jvqvnr = :w_jvqvnr)
6.37 c+                  and jvqfir = :w_firm
6.37 c+                  fetch first 1 rows only
6.37 c/end-exec
6.37 c                   if        w_logl = w_jvqvnr
6.37 c                   eval      *in28 = *on
6.37 c                   elseif    w_undv > 0
6.37 c                   eval      *in27 = *on
6.37 c                   endif
6.37 c
6.37 c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * ERROR-rutine
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *pssr         begsr
      *
     c                   eval      b1anta = 0
     c                   update    b1sfl
      *
     c                   eval      *in60 = *on
     c                   goto      b2taga
      *
     c                   endsr
      *
7.03   begsr newlo_vask;
7.03       w_len = %len(%trim(b2ltxt));
7.03       if (w_len > 0);
7.03       b2ltxt = %ScanRpl('.':'':b2ltxt); // newlook tåler ikke .
7.03       endif;
7.03   endsr;
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_kode
     c                   parm                    p_firm
     c                   parm                    p_numm
     c                   parm                    p_suff
     c                   parm                    p_line
     c                   parm                    p_ltyp
     c                   parm                    p_lety
     c                   parm                    p_ogrp
     c                   parm                    p_hgrp
     c                   parm                    p_ugrp
     c                   parm                    p_stek
7.fb c                   parm                    p_depo
      *
      * Key for søk på overgruppe
      *
     c     jvarla_key    klist
     c                   kfld                    jvarla_ogrp
      *
      * Key for søk på hovedgruppe
      *
     c     jvarlb_key    klist
     c                   kfld                    jvarlb_ogrp
     c                   kfld                    jvarlb_hgrp
      *
      * Key for søk på undergruppe
      *
     c     jvarlc_key    klist
     c                   kfld                    jvarlc_ogrp
     c                   kfld                    jvarlc_hgrp
     c                   kfld                    jvarlc_ugrp
      *
      * Key for posisjonering på varetekst
      *
     c     jvarl2_key    klist
     c                   kfld                    jvarl2_tek1
      *
      * Key for posisjonering på varenummer
      *
     c     jvarl1_key    klist
     c                   kfld                    jvarl1_vare
      *
      * Key for posisjonering på Nobb-nummer
      *
     c     jvarl3_key    klist
     c                   kfld                    jvarl3_nobb
      *
      * Key for posisjonering på lev. varenummer
      *
     c     jvarl4_key    klist
     c                   kfld                    jvarl4_lvar
7.02  *
7.02  * Key for posisjonering på leverandør
7.02  *
7.02 c     jvarl6_key    klist
7.02 c                   kfld                    jvarl6_ldor
      *
      * Key for oppslag på søketekst
      *
     c     jsokl3_key    klist
     c                   kfld                    jsokl3_vare
     c                   kfld                    jsokl3_stek
      *
      * Key for oppslag på leverandør
      *
     c     jlevl1_key    klist
     c                   kfld                    jlevl1_ldor
7.02  *
7.02  * Key for oppslag på leverandør
7.02  *
7.02 c     jlevl3_key    klist
7.02 c                   kfld                    jlevl3_enum
      *
      * Key for oppslag på vare (EVR)
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarl1_vare
      *
      * Key for oppslag på status
      *
     c     fstsl1_key    klist
     c                   kfld                    w_firm
      *
      * Key for oppslag på kunde
      *
     c     rkunl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rkunl1_kund
      *
      * Key for oppslag på kundeprosjekt
      *
     c     fkprl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    fkprl1_kund
     c                   kfld                    fkprl1_kpro
      *
      * Key for oppslag på leveringstype
      *
     c     vltpl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vltpl1_lety
      *
      * Key for oppslag på ordre-hode
      *
     c     fohel1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_numm
     c                   kfld                    w_suff
      *
      * Key for les på ordre-linje
      *
     c     fodtl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_numm
     c                   kfld                    w_suff
6.37  *
6.37  * Key for les på vare-leverandør
6.37  *
6.37 c     jvlel1_key    klist
6.37 c                   kfld                    jvlel1_lvnr
7.02  *
7.02  * Key for oppslag på leverandør
7.02  *
7.02 c     rlevl1_key    klist
7.02 c                   kfld                    w_firm
7.02 c                   kfld                    rlevl1_levr
      *
      *
      * Henter parametre
      *
     c                   eval      w_firm = p_firm
     c                   eval      w_numm = p_numm
     c                   eval      w_suff = p_suff
     c                   eval      w_line = p_line
      *
      * Hent opplysninger fra ofak koderegister
      *
     c     fstsl1_key    chain     fstsl1r
      *
      * Hent opplysninger fra ordre-hode
      *
     c     fohel1_key    chain     fohel1r
      *
     c                   eval      b2numm = fonumm
      *
      * Henter total sum for ordre
      *
     c                   exsr      hent_total
      *
      * Fyller opp skjermbildet for første visning
      *
     c                   eval      rkunl1_kund = fokund
     c     rkunl1_key    chain     rkunl1
     c                   eval      b2kund = fokund
     c                   eval      b2knav = rknavn
      *
     c                   if        fokpro <> 0
     c                   eval      fkprl1_kund = fokund
     c                   eval      fkprl1_kpro = fokpro
     c     fkprl1_key    chain     fkprl1
     c                   eval      b2kpro = fokpro
     c                   eval      b2pnav = flnavn
     c                   endif
      *
     c                   eval      vltpl1_lety = folety
     c     vltpl1_key    chain     vltpl1
     c                   eval      b2ltxt = vybesk
7.03 c                   exsr      newlo_vask
      *
     c                   eval      *in22 = *on
     c                   eval      *in80 = *on
      *
     c                   time                    w_udat
     c                   eval      w_loda = *loval
      *
      * Behandling avhengig om søk er fortatt eller ikke i ofak
      *
     c                   if        p_ogrp <> 0 or
     c                             p_stek <> *blank
     c                   eval      b2ogrp = p_ogrp
     c                   eval      b2hgrp = p_hgrp
     c                   eval      b2ugrp = p_ugrp
     c                   eval      b2stek = p_stek
     c                   exsr      sØk
     c                   else
     c     jvarl2_key    setll     jvarl2
     c                   exsr      crt_subfile
     c                   endif
      *
6.30 c                   eval      w_stek = p_stek
      *
     c                   endsr
