     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
      *                                                                       *
      * System. . . . . : ASOFAK                                              *
      * Program . . . . : JV162R                                              *
      * Beskrivelse . . : Prioritert leverandør fra excel                     *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      * R6.30     210519  Nytt program                                   BSA  *
      *                                                                       *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     fjv162d    cf   e             workstn
      *
     d w_in03          s              1
     d w_filn          s             50
      *
     d lda            uds
     d l_user                911    920
     d l_filg                931    933
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      *
     c     a2taga        tag
      *
     c                   exfmt     a2bld
      *
     c                   eval      *in36 = *off                                    .
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   eval      w_in03 = '1'                                     .
     c                   goto      slutt                                            .
     c                   endif                                                  .....
      *
     c                   if        a2filn = *blank
     c                   eval      *in36 = *on                                     .
     c                   goto      a2taga                                            .
     c                   endif
      *
      *  PARAMETER - OK
      *
     c                   eval      w_filn = %trim(a2filn)
      *
     c     slutt         tag
      *
     c                   out       *dtaara
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c     *dtaara       define    *lda          lda
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_in03
     c                   parm                    w_filn
      *
     c                   eval      w_filn = '/home/adb'+l_filg+'/Excel/'+l_filg+
     c                             '.csv'
     c                   eval      a2filn = %trim(w_filn)
      *
     c                   endsr
