     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : JV161R
      * Beskrivelse . . : Valg av prisgivende leverandør på skaffevarer
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       160519 bsa  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      *       LR = Avslutt program
      *       10 = Rollup
      *       11 = Rolldown
      *       12 = Sfldsp
      *       13 = Sfldspctl
      *       14 = Sflclr
      *       15 = Sflend
      *       21 = Home-key
      *       22 = Plassering av cursor
      *       30 = Protect av felter ved vise
      *    31-79 = Varsle m/feilmeldinger/skjermindikatorer
      *    80-99 = Arbeidsindikatorer
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvprll1    if   e           k disk    rename(vprlpfr:vprll1r)
     fvprllr    if   e           k disk    rename(vprlpfr:vprllrr)
     fvprllu    uf a e           k disk    rename(vprlpfr:vprllur)
     fvogrl1    if   e           k disk    rename(vogrpfr:vogrl1r)
     fvhgrl1    if   e           k disk    rename(vhgrpfr:vhgrl1r)
     fvugrl1    if   e           k disk    rename(vugrpfr:vugrl1r)
     frlevl1    if   e           k disk    rename(rlevpfr:rlevl1r)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     fvvarlb    if   e           k disk    rename(vvarpfr:vvarlbr)
     fjvarl1    if   e           k disk    rename(jvarpfr:jvarl1r)
     fjmodl1    if   e           k disk    rename(jmodpfr:jmodl1r)
     fra10l1    if   e           k disk    rename(ra10pfr:ra10l1r)
      *
     fjv161d    cf   e             workstn sfile(b1sfl:w_srrn)
     f                                     infds(dspfbk)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av Information Data Structure - display feedback
      *
     d dspfbk          ds
     d  d_fcrn               378    379I 0
      *
      * Definering av variable i nøkler
      *
     d vprllr_lage     s                   like(pllage)
     d vprllr_ogrp     s                   like(plogrp)
     d vprllr_hgrp     s                   like(plhgrp)
     d vprllr_ugrp     s                   like(plugrp)
     d vprllr_modn     s                   like(plmodn)
     d vprllr_vare     s                   like(plvare)
     d vprllu_lage     s                   like(pllage)
     d vprllu_ogrp     s                   like(plogrp)
     d vprllu_hgrp     s                   like(plhgrp)
     d vprllu_ugrp     s                   like(plugrp)
     d vprllu_modn     s                   like(plmodn)
     d vprllu_vare     s                   like(plvare)
     d vprll1_lage     s                   like(pllage)
     d vprll1_ogrp     s                   like(plogrp)
     d vprll1_hgrp     s                   like(plhgrp)
     d vprll1_ugrp     s                   like(plugrp)
     d vprll1_modn     s                   like(plmodn)
     d vprll1_vare     s                   like(plvare)
      *
     d vogrl1_oogr     s                   like(vgoogr)
     d vhgrl1_hogr     s                   like(vghogr)
     d vhgrl1_hhgr     s                   like(vghhgr)
     d vugrl1_uogr     s                   like(vguogr)
     d vugrl1_uhgr     s                   like(vguhgr)
     d vugrl1_uugr     s                   like(vguugr)
     d rlevl1_levr     s                   like(rllevr)
     d vvarl1_vare     s                   like(vvvare)
     d vvarlb_nmod     s                   like(vvnmod)
     d jvarl1_vare     s                   like(jvvare)
     d jmodl1_modn     s                   like(jumodn)
     d ra10l1_jkod     s                   like(rajkod)
      *
      * Definering av variable
      *
     d w_fcrn          s              4  0
     d w_stel          s              4  0
     d w_spge          s              4  0
     d w_srrn          s              4  0
     d w_sfrn          s                   like(w_srrn)
     d w_ssrn          s                   like(w_srrn)
      *
     d w_seqe          s              1
     d b_forn          s              1    inz(*off)
     d b_oppr          s              1    inz(*off)
     d b_anul          s              1    inz(*off)
     d b_feil          s              1    inz(*off)
     d b_inlr          s              1    inz(*off)
      *
     d w_dato_fra      s               d   datfmt(*iso)
     d w_dato_til      s               d   datfmt(*iso)
     d w_udat          s               d   datfmt(*iso)
     d w_utim          s               t   timfmt(*iso)
     d w_ra1f          s               d   datfmt(*iso)
     d w_ra1t          s               d   datfmt(*iso)
     d w_ra2f          s               d   datfmt(*iso)
     d w_ra2t          s               d   datfmt(*iso)
     d w_ranf          s               d   datfmt(*iso)
     d w_rant          s               d   datfmt(*iso)
     d w_rbuf          s               d   datfmt(*iso)
     d w_rbut          s               d   datfmt(*iso)
     d w_ratf          s               d   datfmt(*iso)
     d w_ratt          s               d   datfmt(*iso)
     d w_dekf          s               d   datfmt(*iso)
     d w_dekt          s               d   datfmt(*iso)
      *
     d w_mtxt          s             35
      *
     d w_firm          s                   like(plfirm)
     d w_lage          s                   like(pllage)
     d w_ogrp          s                   like(plogrp)
     d w_hgrp          s                   like(plhgrp)
     d w_ugrp          s                   like(plugrp)
     d w_modn          s                   like(plmodn)
     d w_vare          s                   like(plvare)
     d w_gtxt          s                   like(vgutxt)
     d w_lnav          s                   like(rlnavn)
     d w_vtxt          s                   like(vvtek1)
      *
     d p_anta          s              5  0
      *
     d s_lage          s                   like(pllage)
     d s_ogrp          s                   like(plogrp)
     d s_hgrp          s                   like(plhgrp)
     d s_ugrp          s                   like(plugrp)
     d s_modn          s                   like(plmodn)
     d s_vare          s                   like(plvare)
      *
      * Definering av konstanter
      *
     d c_sfil          s              2  0 inz(13)
      *
      * Forklaring på spesielle felter
      * som benyttes ved sub-files.
      * - - - - - - - - - - - - - - - - -
      * w_fcrn - Første recordnummer på siden
      * w_stel - Subfile-teller
      * w_spge - Sidestørrelse i subfile (page)
      * w_srrn - Relativt recordnummer i subfile
      * w_sfrn - Første recordnummer på siste side
      * w_ssrn - Siste recordnummer på siste side
      * w_curn - Current recordnummer på siden
      * w_virn - Side og cursorplassering som skal vises
      * w_afld - Aktivt feltnavn
      * w_arow - Aktiv rad for cursor
      * w_acol - Aktiv kolonne for cursor
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      * B1SFL  - B1 Subfile - record
      * B2CTL  - B2 Subfile - control record
      * B2CMD  - B2 Eget skjermbilde for CMD-taster
      * C1BLD  - C1 Skjermbilde for innlegging av nøkkel ved oppretting
      * C1MSG  - C1 Meldingsbilde for C1BLD
      * C2BLD  - C2 Skjermbilde for opprette/endre/vise
      * D1WIN  - D1 Vindu for slette (Delete)
      * K1WIN  - K1 Vindu for kopiere
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B2CTL Behandle åpningsbildet med subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Send Alt
      *
     c     b2taga        tag
      *
     c                   write     b2cmd
      *
      * Bare data
      *
     c     b2tagb        tag
      *
     c                   exsr      dsp_subfile                                  DSP SFL
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      b2tagb
     c                   when      *inke
     c                   exsr      forny
     c                   goto      b2tagb
     c                   when      *inkf
     c                   exsr      xc1bld
     c                   goto      b2taga
     c                   when      *inkg
     c                   exsr      xc7bld
     c                   goto      b2taga
     c                   when      *in10
     c                   exsr      crt_subfile
     c                   goto      b2tagb
     c                   when      *in11
     c                   exsr      bck_subfile
     c                   goto      b2tagb
     c                   when      *in21
     c                   eval      *in22 = *on
     c                   goto      b2taga
     c                   endsl
      *
      * Filter
      *
     c                   if        *inka
     c                   exsr      filter
     c                   goto      b2taga
     c                   endif
      *
      * Posisjonering
      *
     c*                  if        b2lage <> 0 or
     c*                            b2ogrp <> 0 or
     c*                            b2hgrp <> 0 or
     c*                            b2ugrp <> 0 or
     c*                            b2modn <> 0 or
     c*                            b2vare <> *blanks
     c                   exsr      posisjoner
     c*                  goto      b2tagb
     c*                  endif
      *
      * Behandling av subfile
      *
     c                   exsr      subfile
      *
     c                   goto      b2taga
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for fornying av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     forny         begsr
      *
     c                   if        w_fcrn <> 0
     c     w_fcrn        chain     b1sfl
     c                   endif
      *
     c                   eval      vprllr_lage = b1lage
     c                   eval      vprllr_ogrp = b1ogrp
     c                   eval      vprllr_hgrp = b1hgrp
     c                   eval      vprllr_ugrp = b1ugrp
     c                   eval      vprllr_modn = b1modn
     c                   eval      vprllr_vare = b1vare
     c     vprllr_key    setll     vprllr
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c     end_forny     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for posisjonering i subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     posisjoner    begsr
      *
      * Posisjoner startverdi på lager
      *
     c*                  if        b2lage <> 0
     c*                  eval      w_seqe = *blank
     c*                  eval      vprllr_lage = b2lage
     c*                  eval      vprllr_ogrp = b2ogrp
     c*                  eval      vprllr_hgrp = b2hgrp
     c*                  eval      vprllr_ugrp = b2ugrp
     c*                  eval      vprllr_modn = b2modn
     c*                  eval      vprllr_vare = b2vare
     c*    vprllr_key    setll     vprllr
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på overgruppe
      *
     c*                  if        b2ogrp <> 0
     c*                  eval      w_seqe = 'O'
     c*                  eval      frabl5_ogrp = b2ogrp
     c*                  eval      frabl5_hgrp = b2hgrp
     c*                  eval      frabl5_ugrp = b2ugrp
     c*    frabl5_key    setll     frabl5
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på hovedgruppe
      *
     c*                  if        b2hgrp <> 0
     c*                  eval      w_seqe = 'H'
     c*                  eval      frabl6_hgrp = b2hgrp
     c*                  eval      frabl6_ugrp = b2ugrp
     c*    frabl6_key    setll     frabl6
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på undergruppe
      *
     c*                  if        b2ugrp <> 0
     c*                  eval      w_seqe = 'U'
     c*                  eval      frabl7_ugrp = b2ugrp
     c*    frabl7_key    setll     frabl7
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på leverandør
      *
     c*                  if        b2ldor <> 0
     c*                  eval      w_seqe = 'L'
     c*                  eval      frabl8_ldor = b2ldor
     c*    frabl8_key    setll     frabl8
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på modulnr
      *
     c*                  if        b2modn <> 0
     c*                  eval      w_seqe = 'M'
     c*                  eval      frabl9_modn = b2modn
     c*    frabl9_key    setll     frabl9
     c*                  goto      end_pos
     c*                  endif
      *
      * Posisjoner startverdi på vare
      *
     c*                  if        b2vare <> *blank
     c*                  eval      w_seqe = 'V'
     c*                  eval      frabla_vare = b2vare
     c*                  eval      frabla_prgr = b2prgr
     c*                  eval      frabla_enhe = b2enhe
     c*                  eval      frabla_lety = b2lety
     c*    frabla_key    setll     frabla
     c*                  goto      end_pos
     c*                  endif
      *
     c*    end_pos       tag
      *
      * Blanker subfile, og fyller opp i.h.t. posisjonering
      *
     c*                  eval      *in22 = *off
      *
     c*                  exsr      clr_subfile
     c*                  exsr      crt_subfile
      *
      * Blanker posisjoneringsfelter
      *
     c*                  eval      b2lage = 0
     c*                  eval      b2ogrp = 0
     c*                  eval      b2hgrp = 0
     c*                  eval      b2ugrp = 0
     c*                  eval      b2modn = 0
     c*                  eval      b2vare = *blank
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     subfile       begsr
      *
     c                   eval      b_forn = *off
      *
     c                   if        *in22 = *off
     c                   eval      *in22 = *on
     c                   else
     c                   eval      *in22 = *off
     c                   endif
      *
     c                   eval      w_virn = w_fcrn
      *
      * Leser og behandler subfile
      *
     c                   do        w_ssrn
     c                   readc     b1sfl
      *
     c                   if        %eof
     c                   leave
     c                   endif
      *
     c                   eval      *in22 = *off
     c                   eval      w_virn = w_srrn
      *
      * Endre
      *
     c                   if        b1valg = 2
     c                   eval      c1lage = b1lage
     c                   eval      c1ogrp = b1ogrp
     c                   eval      c1hgrp = b1hgrp
     c                   eval      c1ugrp = b1ugrp
     c                   eval      c1modn = b1modn
     c                   eval      c1vare = b1vare
     c                   exsr      xc2bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Kopier
      *
     c                   if        b1valg = 3
     c                   eval      k1lage = b1lage
     c                   eval      k1ogrp = b1ogrp
     c                   eval      k1hgrp = b1hgrp
     c                   eval      k1ugrp = b1ugrp
     c                   eval      k1modn = b1modn
     c                   eval      k1vare = b1vare
     c                   exsr      xk1win
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Slett
      *
     c                   if        b1valg = 4
     c                   eval      d1lage = b1lage
     c                   eval      d1ogrp = b1ogrp
     c                   eval      d1hgrp = b1hgrp
     c                   eval      d1ugrp = b1ugrp
     c                   eval      d1modn = b1modn
     c                   eval      d1vare = b1vare
     c                   exsr      xd1win
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Vis
      *
     c                   if        b1valg = 5
     c                   eval      c1lage = b1lage
     c                   eval      c1ogrp = b1ogrp
     c                   eval      c1hgrp = b1hgrp
     c                   eval      c1ugrp = b1ugrp
     c                   eval      c1modn = b1modn
     c                   eval      c1vare = b1vare
     c                   exsr      xc2bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
     c                   enddo
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c     end_subfile   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av skjermbilde for ny rad (C1BLD)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc1bld        begsr
      *
     c                   eval      b_oppr = *on
     c                   eval      b_forn = *off
      *
     c                   eval      c1lage = 0
     c                   eval      c1ogrp = 0
     c                   eval      c1hgrp = 0
     c                   eval      c1ugrp = 0
     c                   eval      c1modn = 0
     c                   eval      c1vare = *blank
      *
     c                   exsr      hent_info
      *
     c     c1taga        tag
      *
     c                   exfmt     c1bld
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      end_c1bld
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      c1taga
     c                   endsl
      *
     c                   if        c1lage = 0 and
     c                             c1ogrp = 0 and
     c                             c1hgrp = 0 and
     c                             c1ugrp = 0 and
     c                             c1vare = *blank and
     c                             c1modn = 0
     c                   goto      end_c1bld
     c                   endif
      *
      * Sjekker input
      *
     c                   eval      w_lage = c1lage
     c                   eval      w_ogrp = c1ogrp
     c                   eval      w_hgrp = c1hgrp
     c                   eval      w_ugrp = c1ugrp
     c                   eval      w_modn = c1modn
     c                   eval      w_vare = c1vare
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      c1taga
     c                   endif
      *
      * Sender opp informasjonsbildet dersom rad finnes fra før
      *
     c                   eval      vprll1_lage = c1lage
     c                   eval      vprll1_ogrp = c1ogrp
     c                   eval      vprll1_hgrp = c1hgrp
     c                   eval      vprll1_ugrp = c1ugrp
     c                   eval      vprll1_modn = c1modn
     c                   eval      vprll1_vare = c1vare
     c     vprll1_key    chain     vprll1
     c                   if        %found
     c                   exsr      xc1msg
     c                   if        b_anul = *on
     c                   goto      c1taga
     c                   endif
     c                   endif
      *
      * Kaller vedlikeholdsprogram
      *
     c                   exsr      xc2bld
      *
     c                   eval      c1lage = 0
     c                   eval      c1ogrp = 0
     c                   eval      c1hgrp = 0
     c                   eval      c1ugrp = 0
     c                   eval      c1vare = *blank
     c                   eval      c1modn = 0
      *
     c                   eval      c1gtxt = *blank
     c                   eval      c1ltxt = *blank
     c                   eval      c1mtxt = *blank
     c                   eval      c1vtxt = *blank
     c                   goto      c1taga
      *
     c     end_c1bld     tag
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c                   eval      b_oppr = *off
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for utlegging av opprettelsesmelding
      * Meldingsbildet legges ut dersom det forsøkes å opprette en rad som
      * finnes fra før.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc1msg        begsr
      *
     c                   eval      b_anul = *off
      *
     c                   exfmt     c1msg
      *
      * Behandling av funksjonstaster
      *
     c                   if        *inkc or *inkl
     c                   eval      b_anul = *on
     c                   goto      end_c1msg
     c                   endif
      *
     c     end_c1msg     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * C2BLD Behandle bilde for ny - endring - vise
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc2bld        begsr
      *
     c*                  eval      w_arow = 0
     c*                  eval      w_acol = 0
      *
     c                   eval      vprll1_lage = c1lage
     c                   eval      vprll1_ogrp = c1ogrp
     c                   eval      vprll1_hgrp = c1hgrp
     c                   eval      vprll1_ugrp = c1ugrp
     c                   eval      vprll1_modn = c1modn
     c                   eval      vprll1_vare = c1vare
     c     vprll1_key    chain     vprll1
      *
     c                   if        %found
      *
     c                   eval      c2pr1l = plpr1l
     c                   eval      c2pr2l = plpr2l
     c                   eval      c2pr3l = plpr3l
     c                   eval      c2eusr = pleusr
      *
      *
     c     *dmy          move      plodat        c2odat
     c     *dmy          move      pledat        c2edat
      *
     c                   else
      *
     c                   eval      c2pr1l = 0
     c                   eval      c2pr2l = 0
     c                   eval      c2pr3l = 0
     c                   eval      c2odat = 0
     c                   eval      c2edat = 0
     c                   eval      c2eusr = *blank
      *
     c                   endif
      *
     c                   if        b1valg = 3
     c                   eval      c1lage = k1lage
     c                   eval      c1ogrp = k1ogrp
     c                   eval      c1hgrp = k1hgrp
     c                   eval      c1ugrp = k1ugrp
     c                   eval      c1modn = k1modn
     c                   eval      c1vare = k1vare
     c                   endif
      *
     c                   if        b1valg = 5
     c                   eval      *in30 = *on
     c                   endif
      *
      * Henter beskrivelse av nivå
      *
     c                   exsr      hent_info
      *
      * Henter tilleggsinformasjon
      *
     c     c2tagb        tag
      *
     c                   exfmt     c2bld
      *
     c                   if        *inkc or *inkl or *in30
     c                   goto      end_c2bld
     c                   endif
      *
      * Spørring
      *
     c                   if        *inkd = *on
     c                   exsr      spØrring
     c                   goto      c2tagb
     c                   endif
      *
      * Validering av input
      *
      *  Prioritert leverandør 1
      *
     c                   if        c2pr1l <> 0
     c                   eval      rlevl1_levr = c2pr1l
     c     rlevl1_key    chain     rlevl1
     c                   if        not %found                                                .
     c                   eval      *in40 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
      *  Prioritert leverandør 2
      *
     c                   if        c2pr2l <> 0
     c                   eval      rlevl1_levr = c2pr2l
     c     rlevl1_key    chain     rlevl1
     c                   if        not %found                                                .
     c                   eval      *in40 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
      *  Prioritert leverandør 3
      *
     c                   if        c2pr3l <> 0
     c                   eval      rlevl1_levr = c2pr3l
     c     rlevl1_key    chain     rlevl1
     c                   if        not %found                                                .
     c                   eval      *in40 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
      *
      * Oppdatering av rabattmatrise
      *
     c                   clear                   vprllur
      *
     c                   eval      vprllu_lage = c1lage
     c                   eval      vprllu_ogrp = c1ogrp
     c                   eval      vprllu_hgrp = c1hgrp
     c                   eval      vprllu_ugrp = c1ugrp
     c                   eval      vprllu_modn = c1modn
     c                   eval      vprllu_vare = c1vare
     c     vprllu_key    chain     vprllur
      *
     c                   eval      plpr1l = c2pr1l
     c                   eval      plpr2l = c2pr2l
     c                   eval      plpr3l = c2pr3l
      *
     c                   eval      pleusr = l_user
     c                   time                    pletim
     c                   time                    pledat
      *
     c                   if        %found
     c                   update    vprllur
     c                   else
     c                   eval      plfirm = w_firm
     c                   eval      pllage = c1lage
     c                   eval      plogrp = c1ogrp
     c                   eval      plhgrp = c1hgrp
     c                   eval      plugrp = c1ugrp
     c                   eval      plmodn = c1modn
     c                   eval      plvare = c1vare
     c                   time                    plodat
     c                   time                    plotim
     c                   eval      plousr = l_user
     c                   write     vprllur
     c                   endif
      *
      * Oppdater subfile
      *
     c*                  if        b1valg = 2
     c*                  eval      b1rab1 = c2rab1
     c*                  eval      b1rabn = c2rabn
     c*                  eval      b1dekn = c2dekn
     c*                  eval      b1rab1 = c2ra1d
     c*                  eval      b1rabn = c2rand
     c*                  eval      b1dekn = c2dekd
     c*                  endif
      *
     c                   if        b_oppr = *on or
     c                             b1valg = 3
     c                   eval      b_forn = *on
     c                   endif
      *
     c     end_c2bld     tag
      *
     c                   eval      *in30  = *off
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av slette-bildet (D1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xd1win        begsr
      *
     c                   eval      vprll1_lage = d1lage
     c                   eval      vprll1_ogrp = d1ogrp
     c                   eval      vprll1_hgrp = d1hgrp
     c                   eval      vprll1_ugrp = d1ugrp
     c                   eval      vprll1_modn = d1modn
     c                   eval      vprll1_vare = d1vare
     c     vprll1_key    chain     vprll1
      *
     c                   exfmt     d1win
      *
     c                   if        *inkc or *inkl
     c                   goto      end_d1win
     c                   endif
      *
     c                   eval      b_forn = *on
      *
      * Sletter rabattmatrise-nivå
      *
     c                   eval      vprllu_lage = d1lage
     c                   eval      vprllu_ogrp = d1ogrp
     c                   eval      vprllu_hgrp = d1hgrp
     c                   eval      vprllu_ugrp = d1ugrp
     c                   eval      vprllu_modn = d1modn
     c                   eval      vprllu_vare = d1vare
     c     vprllu_key    chain     vprllur
     c                   delete    vprllur
      *
     c     end_d1win     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å behandle kopierings-bildet (K1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xk1win        begsr
      *
      * Tar vare på nøkkel til rad det skal kopieres fra
      *
     c                   eval      s_lage = k1lage
     c                   eval      s_ogrp = k1ogrp
     c                   eval      s_hgrp = k1hgrp
     c                   eval      s_ugrp = k1ugrp
     c                   eval      s_modn = k1modn
     c                   eval      s_vare = k1vare
      *
      * Fyller kopierings-bildet
      *
     c                   eval      vprll1_lage = k1lage
     c                   eval      vprll1_ogrp = k1ogrp
     c                   eval      vprll1_hgrp = k1hgrp
     c                   eval      vprll1_ugrp = k1ugrp
     c                   eval      vprll1_modn = k1modn
     c                   eval      vprll1_vare = k1vare
     c     vprll1_key    chain     vprll1
      *
     c     k1tagb        tag
      *
     c                   exfmt     k1win
      *
     c                   if        *inkc or *inkl
     c                   goto      end_k1win
     c                   endif
      *
      * Spørring
      *
     c                   if        *inkd = *on
     c                   exsr      spØrring
     c                   goto      k1tagb
     c                   endif
      *
      * Sjekker om rad finnes fra før
      *
     c                   eval      vprll1_lage = k1lage
     c                   eval      vprll1_ogrp = k1ogrp
     c                   eval      vprll1_hgrp = k1hgrp
     c                   eval      vprll1_ugrp = k1ugrp
     c                   eval      vprll1_modn = k1modn
     c                   eval      vprll1_vare = k1vare
     c     vprll1_key    chain     vprll1
     c                   if        %found
     c                   eval      *in32 = *on
     c                   goto      k1tagb
     c                   endif
      *
      * Sjekker input
      *
     c                   eval      w_lage = k1lage
     c                   eval      w_ogrp = k1ogrp
     c                   eval      w_hgrp = k1hgrp
     c                   eval      w_ugrp = k1ugrp
     c                   eval      w_modn = k1modn
     c                   eval      w_vare = k1vare
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      k1tagb
     c                   endif
      *
      * Kaller vedlikeholdsprogram
      *
     c                   eval      c1lage = s_lage
     c                   eval      c1ogrp = s_ogrp
     c                   eval      c1hgrp = s_hgrp
     c                   eval      c1ugrp = s_ugrp
     c                   eval      c1modn = s_modn
     c                   eval      c1vare = s_vare
      *
     c                   exsr      xc2bld
      *
     c     end_k1win     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å lese inn Excel regneark
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc7bld        begsr
      *
     c                   eval      p_anta = 0
      *
     c                   call      'JV162C'
     c                   parm                    p_anta
      *
     c                   if        p_anta <> 0
     c                   exsr      forny
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for tømming av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     clr_subfile   begsr
      *
     c                   eval      *in14 = *on
     c                   write     b2ctl
     c                   eval      *in14 = *off
      *
     c                   eval      *in15 = *off
     c                   eval      w_srrn = 0
     c                   eval      w_sfrn = 0
     c                   eval      w_ssrn = 0
     c                   eval      w_spge = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Fyll opp subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     crt_subfile   begsr
      *
     c                   eval      w_spge = w_spge + c_sfil
     c                   eval      w_srrn = w_ssrn
      *
     c                   dou       w_srrn = w_spge
      *
     c                   read      vprllr
      *
     c                   if        %eof or
     c                             plfirm <> w_firm
     c                   eval      *in15 = *on
     c                   leave
     c                   endif
      * Lager er utfylt
     c                   if        f1lage <> 0
      *
     c                   if        pllage <> f1lage
     c                   iter
     c                   endif
      *
     c                   endif
      * Leverandør er utfylt
     c                   if        f1pr1l <> 0
      *
     c                   if        plpr1l <> f1pr1l and
     c                             plpr2l <> f1pr1l and
     c                             plpr3l <> f1pr1l
     c                   iter
     c                   endif
      *
     c                   endif
      * Varegruppe - Alle nivåer er utfylt
     c                   if        f1ogrp <> 0 and
     c                             f1hgrp <> 0 and
     c                             f1ugrp <> 0
      *
     c                   if        plogrp <> f1ogrp or
     c                             plhgrp <> f1hgrp or
     c                             plugrp <> f1ugrp
     c                   iter
     c                   endif
      *
     c                   endif
      * Varegruppe - Overgruppe og hovedgruppe
     c                   if        f1ogrp <> 0 and
     c                             f1hgrp <> 0
      *
     c                   if        plogrp <> f1ogrp or
     c                             plhgrp <> f1hgrp
     c                   iter
     c                   endif
      *
     c                   endif
      * Varegruppe - Overgruppe
     c                   if        f1ogrp <> 0
      *
     c                   if        plogrp <> f1ogrp
     c                   iter
     c                   endif
      *
     c                   endif
      *
     c                   eval      w_srrn = w_srrn + 1
      *
     c                   eval      b1lage = pllage
     c                   eval      b1ogrp = plogrp
     c                   eval      b1hgrp = plhgrp
     c                   eval      b1ugrp = plugrp
     c                   eval      b1modn = plmodn
     c                   eval      b1vare = plvare
     c                   eval      b1pr1l = plpr1l
     c                   eval      b1pr2l = plpr2l
     c                   eval      b1pr3l = plpr3l
      *
     c                   write     b1sfl
     c                   enddo
      *
     c                   if        w_srrn > w_ssrn
     c                   eval      w_sfrn = w_ssrn + 1
     c                   endif
      *
     c                   eval      w_ssrn = w_srrn
     c                   eval      w_virn = w_sfrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å bla tilbake en side i subfilen
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bck_subfile   begsr
      *
     c                   if        *in15
     c     vprllr_key    setgt     vprllr
     c                   readp     vprllr
     c                   endif
      *
      * Leser tilbake en side
      *
     c                   eval      w_stel = 0
      *
     c                   dou       w_stel = w_ssrn + c_sfil
      *
     c                   readp     vprllr
      *
     c                   if        %eof or
     c                             plfirm <> w_firm
     c                   leave
     c                   endif
      *
     c*                  if        f1kund <> 0
     c*                  if        frrkat <> 0 and
     c*                            frrkat <> f1rkat or
     c*                            frkkat <> 0 and
     c*                            frkkat <> f1kkat or
     c*                            frkund <> 0 and
     c*                            frkund <> f1kund
     c*                  iter
     c*                  endif
     c*                  endif
      *
     c                   eval      w_stel = w_stel + 1
      *
     c                   eval      vprllr_lage = pllage
     c                   eval      vprllr_ogrp = plogrp
     c                   eval      vprllr_hgrp = plhgrp
     c                   eval      vprllr_ugrp = plugrp
     c                   eval      vprllr_modn = plmodn
     c                   eval      vprllr_vare = plvare
      *
     c                   enddo
      *
     c                   if        %eof
     c     vprllr_key    setll     vprllr
     c                   endif
      *
      * Blanker og fyller opp subfile
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for display av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     dsp_subfile   begsr
      *
     c                   if        w_srrn <> 0
     c                   eval      *in12 = *on
     c                   else
     c                   write     b2cmd
     c                   endif
      *
     c                   eval      *in13 = *on
     c                   exfmt     b2ctl
      *
     c                   eval      *in12 = *off
     c                   eval      *in13 = *off
      *
     c                   eval      w_fcrn = d_fcrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av spørring
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     spØrring      begsr
      *
      * Lager
      *
     c                   if        w_afld = 'C1LAGE'
     c                   call      'RA510R'
     c                   parm                    w_firm
     c                   parm                    c1lage
     c                   parm                    c1ltxt
     c                   leavesr
     c                   endif
      *
      * Lager
      *
     c                   if        w_afld = 'F1LAGE'
     c                   call      'RA510R'
     c                   parm                    w_firm
     c                   parm                    f1lage
     c                   parm                    f1ltxt
     c                   leavesr
     c                   endif
      *
      *
      * Overgruppe
      *
     c*                  if        w_afld = 'B2OGRP'
     c*                  call      'VG510R'
     c*                  parm                    w_firm
     c*                  parm                    b2ogrp
     c*                  parm                    w_gtxt
     c*                  leavesr
     c*                  endif
      *
     c                   if        w_afld = 'C1OGRP'
     c                   call      'VG510R'
     c                   parm                    w_firm
     c                   parm                    c1ogrp
     c                   parm                    c1gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1OGRP'
     c                   call      'VG510R'
     c                   parm                    w_firm
     c                   parm                    k1ogrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
      * Hovedgruppe
      *
     c*                  if        w_afld = 'B2HGRP'
     c*                  call      'VG511R'
     c*                  parm                    w_firm
     c*                  parm                    b2ogrp
     c*                  parm                    b2hgrp
     c*                  parm                    w_gtxt
     c*                  leavesr
     c*                  endif
      *
     c                   if        w_afld = 'C1HGRP'
     c                   call      'VG511R'
     c                   parm                    w_firm
     c                   parm                    c1ogrp
     c                   parm                    c1hgrp
     c                   parm                    c1gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1HGRP'
     c                   call      'VG511R'
     c                   parm                    w_firm
     c                   parm                    k1ogrp
     c                   parm                    k1hgrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
      * Undergruppe
      *
     c*                  if        w_afld = 'B2UGRP'
     c*                  call      'VG512R'
     c*                  parm                    w_firm
     c*                  parm                    b2ogrp
     c*                  parm                    b2hgrp
     c*                  parm                    b2ugrp
     c*                  parm                    w_gtxt
     c*                  leavesr
     c*                  endif
      *
     c                   if        w_afld = 'C1UGRP'
     c                   call      'VG512R'
     c                   parm                    w_firm
     c                   parm                    c1ogrp
     c                   parm                    c1hgrp
     c                   parm                    c1ugrp
     c                   parm                    c1gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1UGRP'
     c                   call      'VG512R'
     c                   parm                    w_firm
     c                   parm                    k1ogrp
     c                   parm                    k1hgrp
     c                   parm                    k1ugrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
      * Leverandør
      *
     c                   if        w_afld = 'C2PR1L'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    c2pr1l
     c                   parm                    c21nav
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C2PR2L'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    c2pr2l
     c                   parm                    c22nav
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C2PR3L'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    c2pr3l
     c                   parm                    c23nav
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C2PR1L'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    c2pr1l
     c                   parm                    c21nav
     c                   leavesr
     c                   endif
      *
      *
      * Modulnr
      *
     c*                  if        w_afld = 'B2MODN'
     c*                  call      'FO707C'
     c*                  parm                    w_firm
     c*                  parm                    b2modn
     c*                  parm                    w_mtxt
     c*                  leavesr
     c*                  endif
      *
     c                   if        w_afld = 'C1MODN'
     c                   call      'FO707C'
     c                   parm                    w_firm
     c                   parm                    c1modn
     c                   parm                    c1mtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1MODN'
     c                   call      'FO707C'
     c                   parm                    w_firm
     c                   parm                    k1modn
     c                   parm                    w_mtxt
     c                   leavesr
     c                   endif
      *
      * Varenummer
      *
     c*                  if        w_afld = 'B2VARE'
     c*                  eval      w_vare = b2vare
     c*                  call      'VV500R'
     c*                  parm                    w_firm
     c*                  parm                    w_vare
     c*                  parm                    w_vtxt
     c*                  eval      b2vare = w_vare
     c*                  leavesr
     c*                  endif
      *
     c                   if        w_afld = 'C1VARE'
     c                   eval      w_vare = c1vare
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    c1vtxt
     c                   eval      c1vare = w_vare
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1VARE'
     c                   eval      w_vare = k1vare
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    w_vtxt
     c                   eval      k1vare = w_vare
     c                   leavesr
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Filter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     filter        begsr
      *
     c                   if        f1lage = 0
     c                   eval      f1ltxt = *blanks
     c                   endif
     c                   if        f1ogrp = 0
     c                   eval      f1gtxt = *blanks
     c                   endif
     c                   if        f1pr1l = 0
     c                   eval      f1lnav = *blanks
     c                   endif
      *
     c     f1tagb        tag
      *
     c                   exfmt     f1win
      *
     c                   if        *inkc or *inkl
     c                   leavesr
     c                   endif
      *
      * Spørring
      *
     c                   if        *inkd
      *
     c                   if        w_afld = 'F1LAGE'
     c                   call      'RA510R'
     c                   parm                    w_firm
     c                   parm                    f1lage
     c                   parm                    f1ltxt
     c                   goto      f1tagb
     c                   endif
      *
     c                   if        w_afld = 'F1OGRP'
     c                   call      'VG510R'
     c                   parm                    w_firm
     c                   parm                    f1ogrp
     c                   parm                    f1gtxt
     c                   goto      f1tagb
     c                   endif
      *
     c                   if        w_afld = 'F1HGRP'
     c                   call      'VG511R'
     c                   parm                    w_firm
     c                   parm                    f1ogrp
     c                   parm                    f1hgrp
     c                   parm                    f1gtxt
     c                   goto      f1tagb
     c                   endif
      *
     c                   if        w_afld = 'F1UGRP'
     c                   call      'VG512R'
     c                   parm                    w_firm
     c                   parm                    f1ogrp
     c                   parm                    f1hgrp
     c                   parm                    f1ugrp
     c                   parm                    f1gtxt
     c                   goto      f1tagb
     c                   endif
      *
     c                   if        w_afld = 'F1PR1L'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    f1pr1l
     c                   parm                    f1lnav
     c                   goto      f1tagb
     c                   endif
      *
     c                   endif
      *
      * Validering
      *
      * Lager
      *
     c                   if        f1lage <> 0
     c                   eval      ra10l1_jkod = f1lage
     c     ra10l1_key    chain     ra10l1
     c                   if        not %found
     c                   eval      *in40 = *on
     c                   goto      f1tagb
     c                   endif
     c                   eval      f1ltxt = rajtxt
     c                   endif
      *
      * Overgruppe
      *
     c                   if        f1ogrp <> 0 and
     c                             f1hgrp = 0
     c                   eval      vogrl1_oogr = f1ogrp
     c     vogrl1_key    chain     vogrl1
     c                   if        not %found
     c                   eval      *in41 = *on
     c                   goto      f1tagb
     c                   endif
     c                   eval      f1gtxt = vgotxt
     c                   endif
      *
      * Hovedgruppe
      *
     c                   if        f1hgrp <> 0 and
     c                             f1ugrp = 0
     c                   eval      vhgrl1_hogr = f1ogrp
     c                   eval      vhgrl1_hhgr = f1hgrp
     c     vhgrl1_key    chain     vhgrl1
     c                   if        not %found
     c                   eval      b_feil = *on
     c                   goto      f1tagb
     c                   endif
     c                   eval      f1gtxt = vghtxt
     c                   endif
      *
      * Undergruppe
      *
     c                   if        f1ugrp <> 0
     c                   eval      vugrl1_uogr = f1ogrp
     c                   eval      vugrl1_uhgr = f1hgrp
     c                   eval      vugrl1_uugr = f1ugrp
     c     vugrl1_key    chain     vugrl1
     c                   if        not %found
     c                   eval      *in43 = *on
     c                   goto      f1tagb
     c                   endif
     c                   eval      w_gtxt = vgutxt
     c                   endif
      *
      * Leverandør
      *
     c                   if        f1pr1l <> 0
     c                   eval      rlevl1_levr = f1pr1l
     c     rlevl1_key    chain     rlevl1
     c                   if        not %found
     c                   eval      *in44 = *on
     c                   goto      f1tagb
     c                   endif
     c                   eval      f1lnav = rlnavn
     c                   endif
      *
      *
      * Blanker subfile, og fyller opp i.h.t. filter
      *
     c     end_filter    tag
      *
     c                   eval      *in22 = *off
      *
     c                   eval      w_seqe = *blank
      *
     c                   eval      vprllr_lage = 0
     c                   eval      vprllr_ogrp = 0
     c                   eval      vprllr_hgrp = 0
     c                   eval      vprllr_ugrp = 0
     c                   eval      vprllr_modn = 0
     c                   eval      vprllr_vare = *blanks
     c     vprllr_key    setll     vprllr
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekker inntastede verdier, og henter beskrivelser
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_input   begsr
      *
     c                   eval      b_feil = *off
      *
     c                   eval      w_lnav = *blank
     c                   eval      w_gtxt = *blank
     c                   eval      w_lnav = *blank
     c                   eval      w_mtxt = *blank
     c                   eval      w_vtxt = *blank
      *
      * Rabattmatrise-nivå
      *
     c***                if        w_rkat = 0 and
     c***                          w_kkat = 0 and
     c***                          w_kund = 0
     c***                eval      *in31 = *on
     c***                eval      b_feil = *on
     c***                leavesr
     c***                endif
      *
      *
     c                   if        w_modn <> 0
     c                   if        w_ogrp <> 0 or
     c                             w_vare <> *blank
     c                   eval      *in34 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   endif
      *
     c                   if        w_vare <> *blank
     c                   if        w_ogrp <> 0 or
     c                             w_modn <> 0
     c                   eval      *in35 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   endif
      *
      * Overgruppe
      *
     c                   if        w_ogrp <> 0 and
     c                             w_hgrp = 0
     c                   eval      vogrl1_oogr = w_ogrp
     c     vogrl1_key    chain     vogrl1                             41
     c                   if        *in41 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_gtxt = vgotxt
     c                   endif
      *
      * Hovedgruppe
      *
     c                   if        w_hgrp <> 0 and
     c                             w_ugrp = 0
     c                   eval      vhgrl1_hogr = w_ogrp
     c                   eval      vhgrl1_hhgr = w_hgrp
     c     vhgrl1_key    chain     vhgrl1                             42
     c                   if        *in42 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_gtxt = vghtxt
     c                   endif
      *
      * Undergruppe
      *
     c                   if        w_ugrp <> 0
     c                   eval      vugrl1_uogr = w_ogrp
     c                   eval      vugrl1_uhgr = w_hgrp
     c                   eval      vugrl1_uugr = w_ugrp
     c     vugrl1_key    chain     vugrl1                             43
     c                   if        *in43 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_gtxt = vgutxt
     c                   endif
      *
      * Leverandør
      *
     c*                  if        w_ldor <> 0
     c*                  eval      rlevl1_levr = w_ldor
     c*    rlevl1_key    chain     rlevl1                             44
     c*                  if        *in44 = *on
     c*                  eval      b_feil = *on
     c*                  leavesr
     c*                  endif
     c*                  eval      w_lnav = rlnavn
     c*                  endif
      *
      * Modul
      *
     c                   if        w_modn <> 0
     c                   eval      vvarlb_nmod = w_modn
     c     vvarlb_key    chain     vvarlb                             45
     c                   if        *in45 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   call      'FO714C'
     c                   parm                    w_firm
     c                   parm                    w_modn
     c                   parm                    w_mtxt
     c                   endif
      *
      * Varenummer
      *
     c                   if        w_vare <> *blank
     c                   eval      vvarl1_vare = w_vare
     c     vvarl1_key    chain     vvarl1
     c                   if        %found
     c                   eval      w_vtxt = vvtek1
     c                   else
     c                   eval      jvarl1_vare = w_vare
     c     jvarl1_key    chain     jvarl1
     c                   if        not %found
     c                   eval      *in46 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_vtxt = jvtek1
     c                   endif
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Henter beskrivelse
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     hent_info     begsr
      *
     c                   eval      c1ltxt = *blank
     c                   eval      c1gtxt = *blank
     c                   eval      c1mtxt = *blank
     c                   eval      c1vtxt = *blank
     c                   eval      c21nav = *blank
     c                   eval      c22nav = *blank
     c                   eval      c23nav = *blank
      *
      * Lager
      *
     c                   if        c1lage <> 0
     c                   eval      ra10l1_jkod = c1lage
     c     ra10l1_key    chain     ra10l1
     c                   if        %found
     c                   eval      c1ltxt = rajtxt
     c                   endif
     c                   endif
      *
      * Overgruppe
      *
     c                   if        c1ogrp <> 0 and
     c                             c1hgrp = 0
     c                   eval      vogrl1_oogr = c1ogrp
     c     vogrl1_key    chain     vogrl1
     c                   if        %found
     c                   eval      c1gtxt = vgotxt
     c                   endif
     c                   endif
      *
      * Hovedgruppe
      *
     c                   if        c1hgrp <> 0 and
     c                             c1ugrp = 0
     c                   eval      vhgrl1_hogr = c1ogrp
     c                   eval      vhgrl1_hhgr = c1hgrp
     c     vhgrl1_key    chain     vhgrl1
     c                   if        %found
     c                   eval      c1gtxt = vghtxt
     c                   endif
     c                   endif
      *
      * Undergruppe
      *
     c                   if        c1ugrp <> 0
     c                   eval      vugrl1_uogr = c1ogrp
     c                   eval      vugrl1_uhgr = c1hgrp
     c                   eval      vugrl1_uugr = c1ugrp
     c     vugrl1_key    chain     vugrl1
     c                   if        %found
     c                   eval      c1gtxt = vgutxt
     c                   endif
     c                   endif
      *
      * Modul
      *
     c                   if        c1modn <> 0
     c                   call      'FO714C'
     c                   parm                    w_firm
     c                   parm                    c1modn
     c                   parm                    c1mtxt
     c                   endif
      *
      * Varenummer
      *
     c                   if        c1vare <> *blank
     c                   eval      vvarl1_vare = c1vare
     c     vvarl1_key    chain     vvarl1
     c                   if        %found
     c                   eval      c1vtxt = vvtek1
     c                   else
     c                   eval      jvarl1_vare = c1vare
     c     jvarl1_key    chain     jvarl1
     c                   if        %found
     c                   eval      c1vtxt = jvtek1
     c                   endif
     c                   endif
     c                   endif
      *
      *  Prioritert leverandør 1
      *
     c                   if        c2pr1l <> 0
     c                   eval      rlevl1_levr = c2pr1l
     c     rlevl1_key    chain     rlevl1
     c                   if        %found                                                .
     c                   eval      c21nav = rlnavn
     c                   endif
     c                   endif
      *
      *  Prioritert leverandør 2
      *
     c                   if        c2pr2l <> 0
     c                   eval      rlevl1_levr = c2pr2l
     c     rlevl1_key    chain     rlevl1
     c                   if        %found                                                .
     c                   eval      c22nav = rlnavn
     c                   endif
     c                   endif
      *
      *  Prioritert leverandør 3
      *
     c                   if        c2pr3l <> 0
     c                   eval      rlevl1_levr = c2pr3l
     c     rlevl1_key    chain     rlevl1
     c                   if        %found                                                .
     c                   eval      c23nav = rlnavn
     c                   endif
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppslag på prioritert leverandør
      *
     c     vprll1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vprll1_lage
     c                   kfld                    vprll1_ogrp
     c                   kfld                    vprll1_hgrp
     c                   kfld                    vprll1_ugrp
     c                   kfld                    vprll1_modn
     c                   kfld                    vprll1_vare
      *
      * Key for oppslag på prioritert leverandør
      *
     c     vprllr_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vprllr_lage
     c                   kfld                    vprllr_ogrp
     c                   kfld                    vprllr_hgrp
     c                   kfld                    vprllr_ugrp
     c                   kfld                    vprllr_modn
     c                   kfld                    vprllr_vare
      *
      * Key for oppslag på prioritert leverandør
      *
     c     vprllu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vprllu_lage
     c                   kfld                    vprllu_ogrp
     c                   kfld                    vprllu_hgrp
     c                   kfld                    vprllu_ugrp
     c                   kfld                    vprllu_modn
     c                   kfld                    vprllu_vare
      *
      * Key for oppslag på overgruppe
      *
     c     vogrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vogrl1_oogr
      *
      * Key for oppslag på hovedgruppe
      *
     c     vhgrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vhgrl1_hogr
     c                   kfld                    vhgrl1_hhgr
      *
      * Key for oppslag på undergruppe
      *
     c     vugrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vugrl1_uogr
     c                   kfld                    vugrl1_uhgr
     c                   kfld                    vugrl1_uugr
      *
      * Key for oppslag på leverandør
      *
     c     rlevl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rlevl1_levr
      *
      * Key for oppslag på vare
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarl1_vare
      *
      * Key for oppslag på vare
      *
     c     vvarlb_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarlb_nmod
      *
      * Key for oppslag på lager
      *
     c     ra10l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra10l1_jkod
      *
      * Key for oppslag på vare (VA)
      *
     c     jvarl1_key    klist
     c                   kfld                    jvarl1_vare
      *
      * Key for oppslag på modulnummer (VA)
      *
     c     jmodl1_key    klist
     c                   kfld                    jmodl1_modn
      *
      * Henter firma fra LDA
      *
     c                   eval      w_firm = l_firm
      *
      * Initierer skjermbilde
      *
     c                   eval      *in22 = *on
      *
      * Posisjonerer databasen, og fyller opp subfile
      *
     c     vprllr_key    setll     vprllr
      *
     c                   exsr      crt_subfile
      *
     c                   endsr
