     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : asofak
      * Program . . . . : jx480R
      * Beskrivelse . . : Sjekker om det fortsatt finnes kalkyle
      *                   for prisgruppe - parameter
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       220916 bof  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     fjx480d    cf   e             workstn
      *
     d                uds
     d l_firm                944    946  0
      *
      *
      *
      * Definering av variable
      *
     d b_feil          s              1    inz(*off)
     d p_slett         s              1
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B1 Behandle åpningsbildet
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Behandler bildet
      *
     c     b1taga        tag
      *
     c                   exfmt     b1bld
      *
      * Behandling av funksjonstaster
      *
     c                   if        *inkc or *inkl
     c                   goto      avslutt
     c                   endif
      *
      *
     c                   if        b1fldr = *blank
     c                   eval      b1fldr = 'PCFILER'
     c                   endif
     c                   if        b1file = *blank
     c                   eval      b1file = 'LSTSLET.XLS'
     c                   endif
      *
      * Tester om mappen ligger der og at kopiering går greit
      *
     c                   call      'JX480C'
     c                   parm                    b1file
     c                   parm                    b1fldr
     c                   parm                    b_feil
      *
     c                   if        b_feil = *on
     c                   exfmt     b1msg
     c                   goto      b1taga
     c                   endif
      *
      *
      *
      * Kaller styreprogram
      *
      *
     c                   if        p_slett = 'S'
     c                   call      'JX481C'
     c                   parm                    b1file
     c                   parm                    b1fldr
     c                   else
     c                   call      'JX482C'
     c                   parm                    b1file
     c                   parm                    b1fldr
     c                   endif
      *
      * Sender melding om batch-jobb
      *
     c                   exfmt     b1sbm
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    p_slett
      *
      * Initierer skjermbildet
      *
     c                   eval      b1fldr = 'PCFILER'
     c                   eval      b1file = 'LSTSLET.XLS'
     c                   eval      b1slet = p_slett
     c                   if        p_slett = 'S'
     c                   eval      b1stxt = 'Priser vil bli slettet!!'
     c                   else
     c                   eval      b1stxt = 'Kun listing.            '
     c                   endif
      *
     c                   endsr
