     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System. . . . . : ASLAGR
      *  Program . . . . : LA103R
      *  Beskrivelse . . : Vedlikehold av status-koder, Ordretyper
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Spesialversjon. :
      *  Tilpasset for . :
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.
      *  --------- ------  -------------------------------------------------
      *  6.10      180609  Oppdatert med sporingsinformasjon       BSA
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     flstsl1    if   e           k disk    rename(lstspfr:lstsl1r)
     flstslu    uf a e           k disk    rename(lstspfr:lstslur)
      *
     fla103d    cf   e             workstn
      *
      * Definering av Local data area
      *
     d                uds
6.10 d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av variable
      *
     d w_firm          s                   like(laafir)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  A1BLD Behandle bildet for valg
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     a1taga        tag
      *
      *  Hent opplysninger fra LAGER-KODE-REGISTER
      *
     c     lstsl1_key    chain     lstsl1
     c                   if        %found
     c                   eval      a1ot02 = laaot2
     c                   eval      a1ot03 = laaot3
     c                   eval      a1ot04 = laaot4
     c                   eval      a1ot05 = laaot5
     c                   else
     c                   eval      a1ot02 = *blank
     c                   eval      a1ot03 = *blank
     c                   eval      a1ot04 = *blank
     c                   eval      a1ot05 = *blank
     c                   endif
      *
      *  Vis bilde
      *
     c                   exfmt     a1bld
      *
      *  F3=Avslutt
      *
     c                   if        *inkc = *on
     c                   goto      pgm_end
     c                   endif
      *
      *  Oppdater LAGER-KODE-REGISTER
      *
     c     lstslu_key    chain     lstslur
      *
     c                   eval      laaot2 = a1ot02
     c                   eval      laaot3 = a1ot03
     c                   eval      laaot4 = a1ot04
     c                   eval      laaot5 = a1ot05
      *
     c                   if        %found
6.10 c                   time                    laaeda
6.10 c                   time                    laaeti
6.10 c                   eval      laaeus = l_user
     c                   update    lstslur
     c                   else
     c                   eval      laafir = w_firm
6.10 c                   time                    laaoda
6.10 c                   time                    laaoti
6.10 c                   eval      laaous = l_user
6.10 c                   time                    laaeda
6.10 c                   time                    laaeti
6.10 c                   eval      laaeus = l_user
     c                   write     lstslur
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     pgm_end       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Key for les av LAGER-KODE
      *
     c     lstsl1_key    klist
     c                   kfld                    w_firm
      *
      *  Key for oppdatering av LAGER-KODE
      *
     c     lstslu_key    klist
     c                   kfld                    w_firm
      *
      *  Legger inn verdier i nøklene
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
