     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System. . . . . : ASLAGR
      *  Program . . . . : LA102R
      *  Beskrivelse . . : Vedlikehold av status-koder, Spesielle koder
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Spesialversjon. :
      *  Tilpasset for . :
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.
      *  --------- ------  -------------------------------------------------
      *            230805  Utvidet med kode for Best.f. bruke sts. BOF
      *   6.10     180609  Oppdatert med sporingsinformasjon       BSA
6.20  *   6.20     300311  Lagt inn tester om hva som er tillatt   NHO
      *                    vedr. EDI
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     flstsl1    if   e           k disk    rename(lstspfr:lstsl1r)
     flstslu    uf a e           k disk    rename(lstspfr:lstslur)
      *
     fla102d    cf   e             workstn
      *
      * Definering av Local data area
      *
     d                uds
6.10 d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av variable
      *
     d w_firm          s                   like(laafir)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  A1BLD Behandle bildet for valg
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     a1taga        tag
      *
      *  Hent opplysninger fra LAGER-KODE-REGISTER
      *
     c     lstsl1_key    chain     lstsl1
     c                   if        %found
     c                   eval      a1abnd = laabnd
     c                   eval      a1amva = laamva
     c                   eval      a1ades = laades
     c                   eval      a1ahoy = laahoy
     c                   eval      a1atyk = laatyk
     c                   eval      a1ainp = laaenl
     c                   eval      a1alag = laalag
     c                   eval      a1asak = laasak
     c                   eval      a1asa1 = laasa1
     c                   eval      a1asa2 = laasa2
6.20 c                   eval      a1aeds = laaeds
     c                   eval      a1abst = laabst
     c                   eval      a1abes = laaabe
     c                   else
     c                   eval      a1abnd = *blank
     c                   eval      a1amva = 0
     c                   eval      a1ades = 0
     c                   eval      a1ahoy = 0
     c                   eval      a1atyk = 0
     c                   eval      a1ainp = 0
     c                   eval      a1alag = 0
     c                   eval      a1asak = 0
     c                   eval      a1asa1 = 0
     c                   eval      a1asa2 = 0
6.20 c                   eval      a1aeds = 0
     c                   eval      a1abst = 0
     c                   endif
      *
      *  Vis bilde
      *
     c                   exfmt     a1bld
      *
      *  F3=Avslutt
      *
     c                   if        *inkc = *on
     c                   goto      end_pgm
     c                   endif
      *
      *  Oppdater LAGER-KODE-REGISTER
      *
     c     lstslu_key    chain     lstslur
      *
     c                   eval      laabnd = a1abnd
     c                   eval      laamva = a1amva
     c                   eval      laades = a1ades
     c                   eval      laahoy = a1ahoy
     c                   eval      laatyk = a1atyk
     c                   eval      laaenl = a1ainp
     c                   eval      laalag = a1alag
     c                   eval      laasak = a1asak
     c                   eval      laasa1 = a1asa1
     c                   eval      laasa2 = a1asa2
6.20 c                   eval      laaeds = a1aeds
     c                   eval      laabst = a1abst
     c                   eval      laaabe = a1abes
      *
     c                   if        %found
6.10 c                   time                    laaeda
6.10 c                   time                    laaeti
6.10 c                   eval      laaeus = l_user
     c                   update    lstslur
     c                   else
     c                   eval      laafir = w_firm
6.10 c                   time                    laaoda
6.10 c                   time                    laaoti
6.10 c                   eval      laaous = l_user
6.10 c                   time                    laaeda
6.10 c                   time                    laaeti
6.10 c                   eval      laaeus = l_user
     c                   write     lstslur
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     end_pgm       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Key for les av LAGER-KODE
      *
     c     lstsl1_key    klist
     c                   kfld                    w_firm
      *
      *  Key for oppdatering av LAGER-KODE
      *
     c     lstslu_key    klist
     c                   kfld                    w_firm
      *
      *  Legg inn verdi i nøkler
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
