     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System. . . . . : ASLAGR
      *  Program . . . . : LA104R
      *  Beskrivelse . . : Vedlikehold av status-koder, Lagerkoder
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Spesialversjon. :
      *  Tilpasset for . :
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.
      *  --------- ------  -------------------------------------------------
      *  6.10      180609  Oppdatert med sporingsinformasjon       BSA
7.xx  * 7.00  160316 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     flstsl1    if   e           k disk    rename(lstspfr:lstsl1r)
     flstslu    uf a e           k disk    rename(lstspfr:lstslur)
      *
     fla104d    cf   e             workstn
      *
      * Definering av Local data area
      *
     d                uds
6.10 d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av variable
      *
     d w_firm          s                   like(laafir)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  A1BLD Behandle bildet for valg
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     a1taga        tag
      *
      *  Hent opplysninger fra LAGER-KODE
      *
     c     lstsl1_key    chain     lstsl1
     c                   if        %found
     c                   eval      a1alik = laalik
     c                   eval      a1aovf = laaovf
     c                   eval      a1abic = laabic
     c                   eval      a1abik = laabik
     c                   else
     c                   eval      a1alik = 0
     c                   eval      a1aovf = 0
     c                   eval      a1abic = *blank
     c                   eval      a1abik = 0
     c                   endif
      *
      *  Vis bilde
      *
     c     a1tagb        tag
     c                   exfmt     a1bld
      *
      *  F3=Avslutt
      *
     c                   if        *inkc = *on
     c                   goto      end_pgm
     c                   endif
      *
      *  Test på gyldige valg
      *
     c                   if        a1alik > 4
     c                   eval      *in31 = *on
     c                   goto      a1tagb
     c                   endif
      *
     c                   if        a1aovf > 1
     c                   eval      *in32 = *on
     c                   goto      a1tagb
     c                   endif
      *
      *  Oppdater LAGER-KODE-REGISTER
      *
     c     lstslu_key    chain     lstslur
      *
     c                   eval      laalik = a1alik
     c                   eval      laaovf = a1aovf
     c                   eval      laabic = a1abic
     c                   eval      laabik = a1abik
      *
     c                   if        %found
6.10 c                   time                    laaeda
6.10 c                   time                    laaeti
6.10 c                   eval      laaeus = l_user
     c                   update    lstslur
     c                   else
     c                   eval      laafir = w_firm
6.10 c                   time                    laaoda
6.10 c                   time                    laaoti
6.10 c                   eval      laaous = l_user
6.10 c                   time                    laaeda
6.10 c                   time                    laaeti
6.10 c                   eval      laaeus = l_user
     c                   write     lstslur
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     end_pgm       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Key for les av LAGER-KODE
      *
     c     lstsl1_key    klist
     c                   kfld                    w_firm
      *
      *  Key for oppdatering av LAGER-KODE
      *
     c     lstslu_key    klist
     c                   kfld                    w_firm
      *
      *  Legger inn verdier i nøklene
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
