     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASLAGR
      * Program . . . . : LA106R
      * Beskrivelse . . : Vedlikehold av systemverdier. EDI/toleransegrenser
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       210905 GRo  Nytt program
6.20  *       240311 bsa  Utvidet felt for test av fakturainnlesing
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fltoel1    if   e           k disk    rename(ltoepfr:ltoel1r)
     fltoelu    uf a e           k disk    rename(ltoepfr:ltoelur)
      *
     fla106d    cf   e             workstn
      *
      * Definering av Local data area
      *
     d                uds
6.20 d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av variable
      *
     d w_firm          s                   like(laefir)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  A1BLD Behandle bildet for valg
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     a1taga        tag
      *
      *  Hent opplysninger fra toleranse/EDI tabell
      *
     c     ltoel1_key    chain     ltoel1
     c                   if        %found
     c                   eval      a1gre0 = laetg0
     c                   eval      a1gre1 = laetg1
     c                   eval      a1gre2 = laetg2
     c                   eval      a1gre3 = laetg3
     c                   eval      a1gre4 = laetg4
     c                   eval      a1avv1 = laeav1
     c                   eval      a1avv2 = laeav2
     c                   eval      a1avv3 = laeav3
     c                   eval      a1avv4 = laeav4
     c                   eval      a1avv5 = laeav5
6.20 c                   eval      a1afob = laefob
     c                   else
     c                   eval      a1gre0 = *zero
     c                   eval      a1gre1 = *zero
     c                   eval      a1gre2 = *zero
     c                   eval      a1gre3 = *zero
     c                   eval      a1gre4 = *zero
     c                   eval      a1avv1 = 0,05
     c                   eval      a1avv2 = 0,10
     c                   eval      a1avv3 = 0,50
     c                   eval      a1avv4 = 1,00
     c                   eval      a1avv5 = 10,00
6.20 c                   eval      a1afob = 'N'
     c                   endif
      *
      *  Vis bilde
      *
     c     a1tagb        tag
     c                   exfmt     a1bld
      *
      *  F3=Avslutt
      *
     c                   if        *inkc = *on
     c                   goto      end_pgm
     c                   endif
      *
      *  Test på gyldige valg
      *
      *
      *  Oppdater toleranse/EDI tabell
      *
     c     ltoelu_key    chain     ltoelur
      *
     c                   eval      laetg0 = a1gre0
     c                   eval      laetg1 = a1gre1
     c                   eval      laetg2 = a1gre2
     c                   eval      laetg3 = a1gre3
     c                   eval      laetg4 = a1gre4
     c                   eval      laeav1 = a1avv1
     c                   eval      laeav2 = a1avv2
     c                   eval      laeav3 = a1avv3
     c                   eval      laeav4 = a1avv4
     c                   eval      laeav5 = a1avv5
6.20 c                   eval      laefob = a1afob
      *
6.20 c                   time                    laeeda
6.20 c                   time                    laeeti
6.20 c                   move      l_user        laeeus
      *
     c                   if        %found
     c                   update    ltoelur
     c                   else
     c                   eval      laefir = w_firm
6.20 c                   time                    laeoda
6.20 c                   time                    laeoti
6.20 c                   move      l_user        laeous
     c                   write     ltoelur
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     end_pgm       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Key for les av toleransetabell
      *
     c     ltoel1_key    klist
     c                   kfld                    w_firm
      *
      *  Key for oppdatering av toleransetabell
      *
     c     ltoelu_key    klist
     c                   kfld                    w_firm
      *
      *  Legger inn verdier i nøklene
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
