     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System. . . . . : ASLAGR
      *  Program . . . . : LA910R
      *  Beskrivelse . . : Årsoppgaver, nullstill, Parameterinntasting
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Spesialversjon. :
      *  Tilpasset for . :
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign
      * --------- ------  ----------------------------------------------
7.01  *           280819   Dersom parameter 3 er tastet skal LA964RNHO
      *                    kjøres
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fla910d    cf   e             workstn
      *
      * Parameter-inn
      *
     d                 ds
     d d_prec                        64
     d  d_val1                        1  0 overlay(d_prec)
     d  d_val2                        1  0 overlay(d_prec:2)
     d  d_val3                        1  0 overlay(d_prec:3)
     d  d_val4                        1  0 overlay(d_prec:4)
     d  d_dato                       10d   datfmt(*iso)
     d                                     overlay(d_prec:5)
      *
      *  Local Data Area
      *
     d                uds
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av variable
      *
     d w_udat          s               d   datfmt(*iso)
     d w_dato_6        s              6  0
     d w_retu          s              1
     d w_vlg1          s              1
     d w_vlg2          s              1
     d w_vlg3          s              1
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Behandle bilde for registrering av parametre
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     b1tag         tag
      *
     c                   eval      b1val1 = 0
     c                   eval      b1val2 = 0
     c                   eval      b1val3 = 0
      *
     c     b1tagb        tag
     c                   exfmt     b1bld
      *
      *  F3=Gå tilbake  (Avslutt)
      *
     c                   if        *inkc = *on or
     c                             *inkl = *on
     c                   goto      end_pgm
     c                   endif
      *
      *  Legger inntastede opplysninger i Hjelpe-felter for Parameter
      *
     c                   eval      d_val1 = b1val1
     c                   eval      d_val2 = b1val2
     c                   eval      d_val3 = b1val3
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Behandle bilde for registrering av parametre
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     c1tag         tag
      *
     c                   eval      c1valg = 0
      *
     c     c1tagb        tag
     c                   exfmt     c1bld
      *
      *  F3=Gå tilbake  (Avslutt)
      *
     c                   if        *inkc = *on
     c                   goto      b1tagb
     c                   endif
      *
      *  Sjekk, Skal rutinen virkelig kjøres?
      *
     c                   if        c1valg = 0
     c                   goto      end_pgm
     c                   endif
      *
      *  Legger inntastede opplysninger i Hjelpe-felter for Parameter
      *
     c                   eval      d_val4 = c1valg
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Inntasting er ferdig !  Oppstart av utvalg/utskriftsprogrammer
      *  Kaller opp neste 'CL'-program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   if        b1val1 = 1
     c                   eval      w_vlg2 = '1'
     c                   endif
     c                   if        b1val2 = 1
     c                   eval      w_vlg3 = '1'
     c                   endif
      *
7.01 c                   if        b1val3 = 1
7.01 c                   eval      w_vlg3 = '1'
7.01 c                   endif
7.01  *
      *  F10=Legge jobb på jobbkø
      *
     c                   if        *inkj = *on
     c                   eval      w_vlg1 = '1'
     c                   endif
      *
      *  Kaller opp subprogram
      *
     c                   call      'LA912C'
     c                   parm                    d_prec
     c                   parm                    w_vlg1
     c                   parm                    w_vlg2
     c                   parm                    w_vlg3
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     end_pgm       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Legger inn dagens dato
      *
     c                   time                    w_udat
      *
     c     *ymd          move      w_udat        w_dato_6
     c                   move      0101          w_dato_6
      *
     c     *ymd          move      w_dato_6      d_dato
      *
     c                   endsr
