     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System. . . . . : ASLAGR
      *  Program . . . . : LA940R
      *  Beskrivelse . . : Oppdatering av best-linjer fra best-hode
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Spesialversjon. :  Skal kjøres i nattjobb - ikke vise melding
      *  Tilpasset for . :  Herføll
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.
      *  --------- ------  -------------------------------------------------
      *            121108  Tatt bort infobilde                     bof
6.30  *            100614  Gjennomgått mtp. nummerutvidelse        bof
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     flohel1    if   e           k disk    rename(lohepfr:lohel1r)
     flodtlu    uf   e           k disk    rename(lodtpfr:lodtlur)
     flodtl1    if   e           k disk    rename(lodtpfr:lodtl1r)
      *
      * Definering av LDA
      *
     d                uds
     d l_firm                944    946  0
      *
      * Definering av variable i nøkler
      *
     d lodtlu_line     s                   like(ldline)
     d lodtlu_numm     s                   like(ldnumm)
     d lodtlu_suff     s                   like(ldsuff)
     d lohel1_numm     s                   like(lonumm)
     d lohel1_suff     s                   like(losuff)
      *
      * Definering av variable
      *
     d w_firm          s                   like(lofirm)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Oppdaterer BEST.-LINJE-REGISTER med nye opplysninger
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     lodtl1_key    setll     lodtl1r
      *
     c                   dow       not %eof
     c     lodtl1_key    reade     lodtl1r
      *
      *  Hent opplysninger fra ORDRE-HODE og oppdater linjer
      *
     c                   eval      lohel1_numm = ldnumm
     c                   eval      lohel1_suff = ldsuff
     c     lohel1_key    chain     lohel1r
     c                   if        not %found
     c                   goto      les_forbi
     c                   endif
      *
     c                   eval      lodtlu_numm = ldnumm
     c                   eval      lodtlu_suff = ldsuff
     c                   eval      lodtlu_line = ldline
     c     lodtlu_key    chain     lodtlur
      *
     c                   if        %found
     c                   eval      ldotyp = lootyp
     c                   eval      ldlage = lolage
     c                   eval      ldavde = loavde
      *
     c                   eval      ldldor = loldor
     c                   if        lolele <> 0
     c                   eval      ldldor = lolele
     c                   endif
      *
     c                   update    lodtlur
     c                   endif
      *
     c     les_forbi     tag
     c     lodtl1_key    reade     lodtl1r
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     end_pgm       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Key for les av ORDRE-HODE
      *
     c     lohel1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    lohel1_numm
     c                   kfld                    lohel1_suff
      *
      *  Key for les av ORDRE-LINJE
      *
     c     lodtl1_key    klist
     c                   kfld                    w_firm
      *
      *  Key for oppdatering av ORDRE-LINJE
      *
     c     lodtlu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    lodtlu_numm
     c                   kfld                    lodtlu_suff
     c                   kfld                    lodtlu_line
      *
      *  Legger inn verdier i nøklene
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
