     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System. . . . . : ASLAGR
      *  Program . . . . : LB100R
      *  Beskrivelse . . : Vedlikehold av brukerregister  LAGER/INNKJØP
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Spesialversjon. :
      *  Tilpasset for . :
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.
      *  --------- ------  ------------------------------------------------
      *  6.10      180609  Oppdatert med sporingsinformasjon       BSA
6.20  *  6.20      180311  Begrense muligheter ved valg vedr EDI   NHO
6.21  *  6.20      210611  Begrense mulighet IP til IF             bof
6.22  *  6.20      260911  Fjernet  BLANK(EDI)                     NHO
6.23  *  6.20      310714  Lagt inn styring på regnskapsoppdat.    ASK
6.31  *  6.30      090715  Lagt inn styring på endre pakkseddel    ASK
6.32  *  6.30      200617  Feil valg for felt binding/skjerm       bsa
7.01  *  7.01      091215  Lagt ut egen kode for sperre av bankgirobsa
7.01  *                    på leverandørkode.                      bsa
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     flusrl1    if   e           k disk    rename(lusrpfr:lusrl1r)
     flusrlu    uf a e           k disk    rename(lusrpfr:lusrlur)
     fvotyl1    if   e           k disk    rename(votypfr:votyl1r)
     flb100d    cf   e             workstn
      *
      * Definering av parametre
      *
     d p_firm          s                   like(lbfirm)
     d p_user          s                   like(lbuser)
      *
      * Definering av Local data area
      *
     d                uds
     d l_wsid                901    910
     d l_user                911    920
      *
      * Definering av variable i nøkler
      *
     d fotyl1_otyp     s                   like(vaotyp)
     d lusrlu_user     s                   like(lbuser)
     d lusrl1_user     s                   like(lbuser)
      *
      * Definering av variable
      *
     d w_firm          s                   like(lbfirm)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  A1BLD  Behandle bilde for vedlikehold av brukeropplysninger
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     lusrl1_key    chain     lusrl1
      *
     c                   if        %found
     c                   eval      a1bind = lbbind
     c                   eval      a1otyp = lbotyp
     c                   eval      a1cbes = lbcbes
     c                   eval      a1vise = lbvise
     c                   eval      a1ko01 = lbko01
     c                   eval      a1ko02 = lbko02
     c                   eval      a1ko03 = lbko03
     c                   eval      a1ko04 = lbko04
6.20 c                   eval      a1ko05 = lbko05
6.20 c                   eval      a1ko06 = lbko06
6.20 c                   eval      a1ko07 = lbko07
6.20 c                   eval      a1ko08 = lbko08
6.31 c                   eval      a1ko09 = lbko09
6.21 c                   eval      a1ko10 = lbko10
6.23 c                   eval      a1ko11 = lbko11
7.01 c                   eval      a1ko15 = lbko15
     c                   eval      a1tans = lbtans
     c                   eval      a1flow = lbflow
     c                   eval      a1ctrl = lbctrl
     c                   else
     c                   eval      a1bind = *blank
     c                   eval      a1otyp = *blank
     c                   eval      a1cbes = *zero
     c                   eval      a1vise = *zero
     c                   eval      a1ko01 = *zero
     c                   eval      a1ko02 = *zero
     c                   eval      a1ko03 = *zero
     c                   eval      a1ko04 = *zero
6.21 c                   eval      a1ko05 = 0
6.21 c                   eval      a1ko06 = 0
6.21 c                   eval      a1ko07 = 0
6.21 c                   eval      a1ko08 = 0
6.21 c                   eval      a1ko09 = 0
6.21 c                   eval      a1ko10 = 0
     c                   eval      a1tans = *zero
     c                   eval      a1flow = *blank
     c                   eval      a1ctrl = *blank
     c                   endif
      *
     c     a1tagb        tag
     c                   exfmt     a1bld
      *
      *  F3=Avslutt program
      *
     c                   if        *inkc or
     c                             *inkl
     c                   goto      end_pgm
     c                   endif
      *
      *  Sjekk,  Finnes ordretype i ORDRETYPE-REGISTER
      *
     c                   if        a1otyp <> *blank
     c                   eval      fotyl1_otyp = a1otyp
     c     votyl1_key    chain     votyl1r                            90
     c                   if        *in90 = *on
     c                   eval      *in31 = *on
     c                   goto      a1tagb
     c                   endif
     c                   endif
      *
6.20  *
6.20 c     a2tagb        tag
6.20 c                   exfmt     a2bld
      *  Oppdater OFAK-BRUKER-REGISTER med nye opplysninger
      *
     c     lusrlu_key    chain     lusrlur
      *
     c                   eval      lbbind = a1bind
     c                   eval      lbotyp = a1otyp
     c                   eval      lbcbes = a1cbes
     c                   eval      lbvise = a1vise
     c                   eval      lbko01 = a1ko01
     c                   eval      lbko02 = a1ko02
     c                   eval      lbko03 = a1ko03
     c                   eval      lbko04 = a1ko04
6.20 c                   eval      lbko05 = a1ko05
6.20 c                   eval      lbko06 = a1ko06
6.20 c                   eval      lbko07 = a1ko07
6.20 c                   eval      lbko08 = a1ko08
6.31 c                   eval      lbko09 = a1ko09
6.21 c                   eval      lbko10 = a1ko10
6.23 c                   eval      lbko11 = a1ko11
7.01 c                   eval      lbko15 = a1ko15
     c                   eval      lbtans = a1tans
     c                   eval      lbflow = a1flow
     c                   eval      lbctrl = a1ctrl
      *
     c                   if        %found
6.10 c                   time                    lbedat
6.10 c                   time                    lbetim
6.10 c                   eval      lbeusr = l_user
     c                   update    lusrlur
     c                   else
     c                   eval      lbfirm = w_firm
     c                   eval      lbuser = lusrlu_user
6.10 c                   time                    lbodat
6.10 c                   time                    lbotim
6.10 c                   eval      lbousr = l_user
6.10 c                   time                    lbedat
6.10 c                   time                    lbetim
6.10 c                   eval      lbeusr = l_user
     c                   write     lusrlur
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     end_pgm       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_user
      *
      *  Key for les av BRUKER BESTILLING/LAGER
      *
     c     lusrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    lusrl1_user
      *
      *  Key for oppdatering av BRUKER BESTILLING/LAGER
      *
     c     lusrlu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    lusrlu_user
      *
      *  Key for ORDRETYPE
      *
     c     votyl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    fotyl1_otyp
      *
      *  Legger inn verdier i nøklene
      *
     c                   eval      w_firm = p_firm
     c                   eval      lusrl1_user = p_user
     c                   eval      lusrlu_user = p_user
      *
     c                   endsr
