     H/TITLE  ASLAGR: Vedlikehold av betingelser for omregning
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASLAGR
      * Program . . . . : LI720R
      * Beskrivelse . . : Vedlikehold av betingelser for omregning
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       021116 bsa  Nytt program
6.30  * 6.30  131217 bsa  Utvidet med kontroll av kunde/leverandør kategorier
7.xx  * 6.30  040117 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
7.01  * K000  201020 bsa  Innført F tast for vedlikehold av importregler for
7.01  * K000              EDI faktura meldinger.
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fgedgl1    if   e           k disk    rename(gedgpfr:gedgl1r)
     fgedglu    uf a e           k disk    rename(gedgpfr:gedglur)
      *
     fli720D    cf   e             workstn
      *
      * Definering av Local data area
      *
     d                UDS
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av variable
      *
     d w_firm          s                   like(ggfirm)
      *
      * Definering av variable i nøkler
      *
      *
      * Parametre
      *
     d p_stat          s              1
     d p_ktxt          s             20
     d p_kkod          s                   like(ggkk01)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * A1BLD Behandle bildet for valg
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     a1taga        tag
      *
      * Hent opplysninger fra statusregisteret
      *
     c     gedgl1_key    chain     gedgl1
     c                   if        %found
     c                   eval      a1stat = ggstat
     c                   eval      a1obel = ggobel
     c                   eval      a1nbel = ggnbel
     c                   eval      a1mai1 = ggmai1
     c                   eval      a1mai2 = ggmai2
     c                   eval      a1mai3 = ggmai3
     c                   eval      a1txt1 = ggtxt1
     c                   eval      a1txt2 = ggtxt2
     c                   eval      a1txt3 = ggtxt3
     c                   eval      a1kk01 = ggkk01
     c                   eval      a1kk02 = ggkk02
     c                   eval      a1kk03 = ggkk03
     c                   eval      a1kk04 = ggkk04
     c                   eval      a1kk05 = ggkk05
     c                   eval      a1kk06 = ggkk06
     c                   eval      a1kk07 = ggkk07
     c                   eval      a1kk08 = ggkk08
     c                   eval      a1kk09 = ggkk09
     c                   eval      a1kk10 = ggkk10
     c                   eval      a1kk11 = ggkk11
     c                   eval      a1kk12 = ggkk12
     c                   eval      a1kk13 = ggkk13
     c                   eval      a1kk14 = ggkk14
     c                   eval      a1kk15 = ggkk15
     c                   eval      a1kk16 = ggkk16
     c                   eval      a1kk17 = ggkk17
     c                   eval      a1kk18 = ggkk18
     c                   eval      a1kk19 = ggkk19
     c                   eval      a1kk20 = ggkk20
     c                   eval      a1kk21 = ggkk21
     c                   eval      a1kk22 = ggkk22
     c                   eval      a1kk23 = ggkk23
     c                   eval      a1kk24 = ggkk24
     c                   eval      a1kk25 = ggkk25
     c                   eval      a1lk01 = gglk01
     c                   eval      a1lk02 = gglk02
     c                   eval      a1lk03 = gglk03
     c                   eval      a1lk04 = gglk04
     c                   eval      a1lk05 = gglk05
     c                   eval      a1lk06 = gglk06
     c                   eval      a1lk07 = gglk07
     c                   eval      a1lk08 = gglk08
     c                   eval      a1lk09 = gglk09
     c                   eval      a1lk10 = gglk10
     c                   eval      a1fdat = ggfdat
     c                   eval      a1ftid = ggftid
     c                   eval      a1udat = ggudat
     c                   eval      a1utid = ggutid
     c                   eval      a1sdat = ggsdat
     c                   eval      a1stid = ggstid
     c                   else
     c                   eval      a1stat = 0
     c                   eval      a1obel = 0
     c                   eval      a1nbel = 0
     c                   eval      a1mai1 = *blanks
     c                   eval      a1mai2 = *blanks
     c                   eval      a1mai3 = *blanks
     c                   eval      a1txt1 = *blanks
     c                   eval      a1txt2 = *blanks
     c                   eval      a1txt3 = *blanks
     c                   eval      a1kk01 = 0
     c                   eval      a1kk02 = 0
     c                   eval      a1kk03 = 0
     c                   eval      a1kk04 = 0
     c                   eval      a1kk05 = 0
     c                   eval      a1kk06 = 0
     c                   eval      a1kk07 = 0
     c                   eval      a1kk08 = 0
     c                   eval      a1kk09 = 0
     c                   eval      a1kk10 = 0
     c                   eval      a1kk11 = 0
     c                   eval      a1kk12 = 0
     c                   eval      a1kk13 = 0
     c                   eval      a1kk14 = 0
     c                   eval      a1kk15 = 0
     c                   eval      a1kk16 = 0
     c                   eval      a1kk17 = 0
     c                   eval      a1kk18 = 0
     c                   eval      a1kk19 = 0
     c                   eval      a1kk20 = 0
     c                   eval      a1kk21 = 0
     c                   eval      a1kk22 = 0
     c                   eval      a1kk23 = 0
     c                   eval      a1kk24 = 0
     c                   eval      a1kk25 = 0
     c                   eval      a1lk01 = 0
     c                   eval      a1lk02 = 0
     c                   eval      a1lk03 = 0
     c                   eval      a1lk04 = 0
     c                   eval      a1lk05 = 0
     c                   eval      a1lk06 = 0
     c                   eval      a1lk07 = 0
     c                   eval      a1lk08 = 0
     c                   eval      a1lk09 = 0
     c                   eval      a1lk10 = 0
     c                   eval      a1fdat = *loval
     c                   eval      a1ftid = *loval
     c                   eval      a1udat = *loval
     c                   eval      a1utid = *loval
     c                   eval      a1sdat = *loval
     c                   eval      a1stid = *loval
     c                   endif
      *
      * Vis bilde
      *
     c     a1tag1        tag
      *
     c                   exfmt     a1bld
      *
      * F3=Avslutt
      *
     c                   if        *inkc = *on or
     c                             *inkl = *on
     c                   goto      xslutt
     c                   endif
      *
      * F4=Spørring
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK01'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk01 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK02'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk02 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK03'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk03 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK04'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk04 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK05'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk05 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK06'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk06 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK07'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk07 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK08'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk08 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK09'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk09 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK10'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk10 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK11'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk11 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK12'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk12 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK13'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk13 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK14'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk14 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK15'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk15 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK16'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk16 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK17'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk17 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK18'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk18 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK19'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk19 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK20'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk20 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK21'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk21 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK22'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk22 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK23'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk23 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK24'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk24 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1KK25'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1kk25 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1LK01'
     c                   call      'RA514R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1lk01 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1LK02'
     c                   call      'RA514R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1lk02 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1LK03'
     c                   call      'RA514R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1lk03 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1LK04'
     c                   call      'RA514R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1lk04 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1LK05'
     c                   call      'RA514R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1lk05 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1LK06'
     c                   call      'RA514R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1lk06 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1LK07'
     c                   call      'RA514R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1lk07 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1LK08'
     c                   call      'RA514R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1lk08 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1LK09'
     c                   call      'RA514R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1lk09 = p_kkod
     c                   goto      a1tag1
     c                   endif
      *
     c                   if        *inkd  = *on and
     c                             w_afld = 'A1LK10'
     c                   call      'RA514R'
     c                   parm                    w_firm
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
     c                   eval      a1lk10 = p_kkod
     c                   goto      a1tag1
     c                   endif
7.01  *
7.01  * Sett opp kjøreregler
7.01  *
7.01 c                   if        *inkg
7.01 c                   call      'LI740R'
7.01 c                   goto      a1tag1
7.01 c                   endif
      *
      * Kontroller at status er riktig
      *
     c                   if        a1stat <> 0 and
     c                             a1stat <> 1
     c                   eval      *in32 = *on
     c                   goto      a1tag1
     c                   endif
      *
      * Kontroller at beløp er stigende
      *
     c     a1obel        ifne      0
     c     a1obel        ifle      a1nbel
     c                   eval      *in31 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
      * Sjekk kundekategorier
      *
     c                   if        a1kk01 <> 0
     c                   eval      p_kkod = a1kk01
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk02 <> 0
     c                   eval      p_kkod = a1kk02
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk03 <> 0
     c                   eval      p_kkod = a1kk03
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk04 <> 0
     c                   eval      p_kkod = a1kk04
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk05 <> 0
     c                   eval      p_kkod = a1kk05
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk06 <> 0
     c                   eval      p_kkod = a1kk06
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk07 <> 0
     c                   eval      p_kkod = a1kk07
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk08 <> 0
     c                   eval      p_kkod = a1kk08
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk09 <> 0
     c                   eval      p_kkod = a1kk09
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk10 <> 0
     c                   eval      p_kkod = a1kk10
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk11 <> 0
     c                   eval      p_kkod = a1kk11
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk12 <> 0
     c                   eval      p_kkod = a1kk12
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk13 <> 0
     c                   eval      p_kkod = a1kk13
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk14 <> 0
     c                   eval      p_kkod = a1kk14
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk15 <> 0
     c                   eval      p_kkod = a1kk15
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk16 <> 0
     c                   eval      p_kkod = a1kk16
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk17 <> 0
     c                   eval      p_kkod = a1kk17
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk18 <> 0
     c                   eval      p_kkod = a1kk18
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk19 <> 0
     c                   eval      p_kkod = a1kk19
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk20 <> 0
     c                   eval      p_kkod = a1kk20
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk21 <> 0
     c                   eval      p_kkod = a1kk21
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk22 <> 0
     c                   eval      p_kkod = a1kk22
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk23 <> 0
     c                   eval      p_kkod = a1kk23
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk24 <> 0
     c                   eval      p_kkod = a1kk24
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1kk25 <> 0
     c                   eval      p_kkod = a1kk25
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
      * Sjekk leverandørkategori
      *
     c                   if        a1lk01 <> 0
     c                   eval      p_kkod = a1lk01
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1lk02 <> 0
     c                   eval      p_kkod = a1lk02
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1lk03 <> 0
     c                   eval      p_kkod = a1lk03
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1lk04 <> 0
     c                   eval      p_kkod = a1lk04
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1lk05 <> 0
     c                   eval      p_kkod = a1lk05
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1lk06 <> 0
     c                   eval      p_kkod = a1lk06
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1lk07 <> 0
     c                   eval      p_kkod = a1lk07
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1lk08 <> 0
     c                   eval      p_kkod = a1lk08
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1lk09 <> 0
     c                   eval      p_kkod = a1lk09
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
     c                   if        a1lk10 <> 0
     c                   eval      p_kkod = a1lk10
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_ktxt
      *
     c                   if        p_stat = 'N'
     c                   eval      *in33 = *on
     c                   goto      a1tag1
     c                   endif
     c                   endif
      *
      * Oppdaterer status-registeret
      *
     c     gedglu_key    chain     gedglur
      *
     c                   eval      ggstat = a1stat
     c                   eval      ggnbel = a1nbel
     c                   eval      ggobel = a1obel
     c                   eval      ggmai1 = a1mai1
     c                   eval      ggmai2 = a1mai2
     c                   eval      ggmai3 = a1mai3
     c                   eval      ggtxt1 = a1txt1
     c                   eval      ggtxt2 = a1txt2
     c                   eval      ggtxt3 = a1txt3
     c                   eval      ggkk01 = a1kk01
     c                   eval      ggkk02 = a1kk02
     c                   eval      ggkk03 = a1kk03
     c                   eval      ggkk04 = a1kk04
     c                   eval      ggkk05 = a1kk05
     c                   eval      ggkk06 = a1kk06
     c                   eval      ggkk07 = a1kk07
     c                   eval      ggkk08 = a1kk08
     c                   eval      ggkk09 = a1kk09
     c                   eval      ggkk10 = a1kk10
     c                   eval      ggkk11 = a1kk11
     c                   eval      ggkk12 = a1kk12
     c                   eval      ggkk13 = a1kk13
     c                   eval      ggkk14 = a1kk14
     c                   eval      ggkk15 = a1kk15
     c                   eval      ggkk16 = a1kk16
     c                   eval      ggkk17 = a1kk17
     c                   eval      ggkk18 = a1kk18
     c                   eval      ggkk19 = a1kk19
     c                   eval      ggkk20 = a1kk20
     c                   eval      ggkk21 = a1kk21
     c                   eval      ggkk22 = a1kk22
     c                   eval      ggkk23 = a1kk23
     c                   eval      ggkk24 = a1kk24
     c                   eval      ggkk25 = a1kk25
     c                   eval      gglk01 = a1lk01
     c                   eval      gglk02 = a1lk02
     c                   eval      gglk03 = a1lk03
     c                   eval      gglk04 = a1lk04
     c                   eval      gglk05 = a1lk05
     c                   eval      gglk06 = a1lk06
     c                   eval      gglk07 = a1lk07
     c                   eval      gglk08 = a1lk08
     c                   eval      gglk09 = a1lk09
     c                   eval      gglk10 = a1lk10
      *
     c                   if        %found
     c                   time                    ggedat
     c                   time                    ggetim
     c                   eval      ggeusr = l_user
     c                   update    gedglur
     c                   else
     c                   eval      ggfirm = w_firm
     c                   time                    ggodat
     c                   time                    ggotim
     c                   eval      ggousr = l_user
     c                   time                    ggedat
     c                   time                    ggetim
     c                   eval      ggeusr = l_user
     C                   write     gedglur
     C                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppslag på status-registeret
      *
     c     gedgl1_key    klist
     c                   kfld                    w_firm
      *
      * Key for oppslag på status-registeret
      *
     c     gedglu_key    klist
     c                   kfld                    w_firm
      *
      * Legger inn firmanummer i nøkklene
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
