     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASLAGR
      * Program . . . . : LI722R
      * Beskrivelse . . : Setter avsluttende statuser
      *
      * Spesialversjon. : Mestergruppen
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       081116 bsa  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffjoblu    uf   e           k disk    rename(fjobpfr:fjoblur)
     fgedglu    uf   e           k disk    rename(gedgpfr:gedglur)
      *
      * Definering av Local Data Arae (LDA)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Parameter-inn
      *
     d p_stat          s              1
      *
      * Definering av Information Data Structure - display feedback
      *
     d dspfbk          ds
     d  d_fcrn               378    379I 0
      *
      * Definering av variable i parametre
      *
      *
      * Definering av variable
      *
     d b_forn          s              1    inz(*off)
      *
     d w_firm          s                   like(fajfir)
     d w_stat          s              1
     d w_date          s               d   datfmt(*iso)
     d w_time          s               t   timfmt(*iso)
     d w_year          s              4  0
     d w_jsta          s              2  0
     d w_onof          s              1  0
      *
      * Definering av konstanter
      *
     d c_sfil          s              2  0 inz(10)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Behandle åpningsopplysninger
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Oppdaterer automatisk file med tidspunkt for avsluttet kjøring
      *
     c     gedglu_key    chain     gedglur
     c                   if        %found and
     c                             ggstat = 1
     c                   time                    ggsdat
     c                   time                    ggstid
     c                   update    gedglur
     c                   endif
      *
      * Skru av oppdatering av EDI pågår
      *
     c     fjoblu_key    chain     fjoblur
     c                   if        %found
     c                   eval      fajb07 = 0
     c                   update    fjoblur
     c                   endif
      *
      * Avslutt program
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_stat
      *
      * Key for file : Jobb-register
      *
     c     fjoblu_key    klist
     c                   kfld                    w_firm
      *
      * Key for file : Automatisk oppdaterings
      *
     c     gedglu_key    klist
     c                   kfld                    w_firm
      *
      * Henter verdier fra parmametre
      *
     c                   time                    w_date
     c                   time                    w_time
     c                   eval      w_year = %subdt(w_date:*years)
     c                   eval      w_firm = l_firm
      *
     c                   endsr
