     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System. . . . . : ASLAGR
      *  Program . . . . : LL702R
      *  Beskrivelse . . : Innkjøpsplanlegging
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Spesialversjon. :
      *  Tilpasset for . :
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign
      * --------- ------  --------------------------------------------------
7.01  *           250118  Dette er en blåkopi av LL700R, fjernet noen
7.01  *                   funksjoner.
8.01  *PRG2   150622 bof  Utvidet prisgruppe fra 1 til 2 posisjoner
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     fvlagl1    if   e           k disk    rename(vlagpfr:vlagl1r)
     fsstalb    if   e           k disk    rename(sstapfr:sstalbr)
     fsistlb    if   e           k disk    rename(sistpfr:sistlbr)
     fvvenl1    if   e           k disk    rename(vvenpfr:vvenl1r)
      *
7.01 fll702d    cf   e             workstn
      *
      * Definering av arrays
      *
     d a_mtxt          s              4    dim(12) ctdata perrcd(1)
     d a_htxt          s              8    dim(13)
     d a_psal          s              8  1 dim(13)
     d a_hsal          s              8  1 dim(13)
     d a_pkjo          s              8  1 dim(13)
     d a_hkjo          s              8  1 dim(13)
      *
      *  Local Data Area
      *
     d                uds
     d l_firm                944    946  0
     d l_wsid                901    910
     d l_user                        10
     d l_fnav                951    980
     d l_lage               1001   1002  0
      *
      * Definering av variable i parametre
      *
     d p_vare          s                   like(vvvare)
     d p_lage          s                   like(vllage)
      *
      * Definering av variable i nøkler
      *
     d vvarl1_vare     s                   like(vvvare)
     d vlagl1_lage     s                   like(vllage)
     d vlagl1_vare     s                   like(vlvare)
     d sstalb_paar     s                   like(sfpaar)
     d sstalb_vare     s                   like(sfvare)
     d sistlb_paar     s                   like(sipaar)
     d sistlb_vare     s                   like(sivare)
     d vvenl1_vare     s                   like(vevare)
      *
      *   Definering av øvrige variable
      *
     d w_firm          s                   like(vvfirm)
     d w_adrs          s             30
     d w_ponr          s              4  0
     d w_pste          s             30
     d w_avde          s              4  0
     d w_lety          s              1  0
     d w_kpny          s              9  2
     d w_ipny          s              9  2
     d w_date          s               d   datfmt(*iso)
     d w_dmnd          s              2  0
     d w_smnd          s              2  0
     d w_aaar          s              4
     d w_daar          s              4  0
     d w_faar          s              4  0
     d w_mtel          s              2  0
     d w_maks          s             11  3
     d w_mini          s             11  3
     d w_sikl          s             11  3
     d w_bpun          s             11  3
     d w_bmen          s             11  3
     d w_ltid          s              3  0
     d w_omrl          s                   like(veomre)
     d w_omrs          s                   like(veomre)
8.01 d w_prgr          s              2
     d w_eann          s             14  0
     d w_eava          s                   like(vvvare)
     d w_eaen          s                   like(vvenhe)
     d w_east          s              1
     d w_leng          s              2  0
     d w_eanx          s             14
     d w_kamp          s              5
      *
     d b_feil          s              1    inz(*off)
     d b_lage          s              1    inz(*off)
     d b_scan          s              1    inz(*off)
      *
     d c_null          c                   '0000000000000'
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekk om parametre inn, eller legg ut bilde for inntasting
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   exsr      lag_hdng
     c                   if        p_lage <> 0
     c                   eval      a1lage = p_lage
     c                   else
     c                   eval      a1lage = l_lage
     c                   endif
     c                   if        p_vare <> *blank
     c                   movel     p_vare        a1vare
     c                   goto      les_a1bld
     c                   endif
      *
     c                   eval      a1vare = *blank
      *
     c     skr_a1bld     tag
     c                   exfmt     a1bld
      *
     c     les_a1bld     tag
      *
      * F3/F12=Avslutt
      *
     c                   if        *inkc = *on or
     c                             *inkl = *on
     c                   goto      end_pgm
     c                   endif
      *
      * F4=Spørring
      *
     c                   if        *inkd = *on and
     c                             w_arcd = 'A1BLD'
     c                   exsr      blank_skjerm
     c                   exsr      sp_input
     c                   if        b_feil = *on
     c                   goto      skr_a1bld
     c                   endif
     c                   endif
      *
      * F13=Scanning
      *
     c                   if        *inkm = *on or
     c                             b_scan = *on
     c                   eval      b_scan = *on
     c                   exsr      scanning
     c                   if        b_scan = *off
     c                   goto      skr_a1bld
     c                   endif
     c                   endif
      *
     c                   exsr      blank_skjerm
     c                   exsr      finn_vare
     c                   exsr      finn_lager
     c                   exsr      finn_salg
     c                   exsr      finn_kjop
     c                   exfmt     a1bld
      *
     c                   goto      les_a1bld
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c     end_pgm       tag
     c                   eval      *inlr = *on
     c                   return
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for å finne vareinformasjon
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     finn_vare     begsr
      *
      * Legger data ut i skjermbilde
      *
     c                   movel     a1vare        vvarl1_vare
     c     vvarl1_key    chain     vvarl1r
     c                   if        not %found
     c                   eval      *in31 = *on
     c                   goto      vare_end
     c                   endif
      *
     c                   eval      a1tek1 = vvtek1
     c                   eval      a1enhl = vvenhl
     c                   if        vvenhl <> vvenhs
     c                   exsr      hent_omr
     c                   endif
     c                   exsr      hent_inpri
      *
     c     vare_end      endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for å finne lagerinformasjon
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     finn_lager    begsr
      *
      * Sjekk om gyldig lager
      *
     c                   exsr      sjekk_lager
     c                   if        b_feil = *on
     c                   eval      *in32 = *on
     c                   goto      lager_end
     c                   endif
      *
      * Henter verdier fra lager
      *
     c                   eval      vlagl1_vare = vvarl1_vare
     c                   eval      vlagl1_lage = a1lage
     c     vlagl1_key    chain     vlagl1r
     c                   if        not %found
     c                   goto      lager_end
     c                   endif
      *
      * Verdier fra lager eller vare?
      * fom v. 550 tas verdier kun fra lager
      *
     c                   eval      w_mini = vlmini
      *
     c                   eval      w_maks = vlmaks
      *
     c                   eval      w_bpun = vlbpun
      *
     c                   eval      w_bmen = vlbmen
      *
     c                   eval      w_sikl = vlsikl
      *
     c                   eval      w_ltid = vlltid
      *
     c                   eval      a1behl = vlbehl
     c                   eval      a1mini = w_mini
     c                   eval      a1maks = w_maks
     c                   eval      a1pakk = vlpakk
     c                   eval      a1sikl = w_sikl
     c                   eval      a1oord = vloord
     c                   eval      a1bbes = vlbbes
     c                   eval      a1bpun = w_bpun
     c                   eval      a1bmen = w_bmen
     c                   eval      a1ltid = w_ltid
     c                   eval      a1disp = vlbehl + vlbbes -
     c                                      vlpakk - vloord
      *
      * Sjekk om negativ beholdning/disp.beholdning
      *
     c                   if        a1behl < 0
     c                   eval      *in41 = *on
     c                   endif
     c                   if        a1disp < 0
     c                   eval      *in42 = *on
     c                   endif
      *
     c     lager_end     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for å finne statistikkinformasjon salg
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     finn_salg     begsr
      *
     c                   eval      a_psal = 0
     c                   extrct    w_date:*m     w_dmnd
     c                   eval      sstalb_vare = vvarl1_vare
      *
      * Les statistikkposter fra forrige år og akkumuler i tabell
      *
     c                   eval      sstalb_paar = w_faar
     c     sstalb_key    setll     sstalb
     c     sstalb_key    reade     sstalb
      *
     c                   dow       not %eof
      *
      * Gjør om til lagerenhet
      *
     c                   if        vvenhs <> vvenhl
     c                   if        w_omrl <> 0
     c                   eval      sfanta = sfanta * w_omrs / w_omrl
     c                   endif
     c                   endif
     c                   if        sflage = a1lage and
     c                             sfpmnd >= w_dmnd
     c                   eval(h)   a_psal(sfpmnd) = a_psal(sfpmnd) + sfanta
     c                   endif
      *
     c     sstalb_key    reade     sstalb
     c                   enddo
      *
      * Les statistikkposter fra dette år og akkumuler i tabell
      *
     c                   eval      sstalb_paar = w_daar
     c     sstalb_key    setll     sstalb
     c     sstalb_key    reade     sstalb
      *
     c                   dow       not %eof and
     c                             sfpmnd <= w_dmnd
      *
      * Gjør om til lagerenhet
      *
     c                   if        vvenhs <> vvenhl
     c                   if        w_omrl <> 0
     c                   eval      sfanta = sfanta * w_omrs / w_omrl
     c                   endif
     c                   endif
      *
     c                   if        sflage = a1lage
     c                   if        sfpmnd = w_dmnd
     c                   eval(h)   a_psal(13) = a_psal(13) + sfanta
     c                   else
     c                   eval(h)   a_psal(sfpmnd) = a_psal(sfpmnd) + sfanta
     c                   endif
     c                   endif
      *
     c     sstalb_key    reade     sstalb
     c                   enddo
      *
      * Legger salgstall ut i riktig skjermfelt
      *
     c                   eval      w_mtel = 1
      *
     c                   dow       w_mtel < 13
     c                   if        w_dmnd = 13
     c                   eval      w_dmnd = 1
     c                   endif
     c                   eval      a_hsal(w_mtel) = a_psal(w_dmnd)
     c                   eval      w_mtel = w_mtel + 1
     c                   eval      w_dmnd = w_dmnd + 1
     c                   enddo
     c                   eval      a_hsal(13) = a_psal(13)
      *
     c                   eval      a1sa01 = a_hsal(01)
     c                   eval      a1sa02 = a_hsal(02)
     c                   eval      a1sa03 = a_hsal(03)
     c                   eval      a1sa04 = a_hsal(04)
     c                   eval      a1sa05 = a_hsal(05)
     c                   eval      a1sa06 = a_hsal(06)
     c                   eval      a1sa07 = a_hsal(07)
     c                   eval      a1sa08 = a_hsal(08)
     c                   eval      a1sa09 = a_hsal(09)
     c                   eval      a1sa10 = a_hsal(10)
     c                   eval      a1sa11 = a_hsal(11)
     c                   eval      a1sa12 = a_hsal(12)
     c                   eval      a1sa13 = a_hsal(13)
      *
     c     salg_end      endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for å finne statistikkinformasjon kjøp
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     finn_kjop     begsr
      *
     c                   eval      a_pkjo = 0
     c                   extrct    w_date:*m     w_dmnd
     c                   eval      sistlb_vare = vvarl1_vare
      *
      * Les statistikkposter fra forrige år og akkumuler i tabell
      *
     c                   eval      sistlb_paar = w_faar
     c     sistlb_key    setll     sistlb
     c     sistlb_key    reade     sistlb
      *
     c                   dow       not %eof
      *
     c                   if        silage = a1lage and
     c                             sipmnd >= w_dmnd
     c                   eval(h)   a_pkjo(sipmnd) = a_pkjo(sipmnd) + sianta
     c                   endif
      *
     c     sistlb_key    reade     sistlb
     c                   enddo
      *
      * Les statistikkposter fra dette år og akkumuler i tabell
      *
     c                   eval      sistlb_paar = w_daar
     c     sistlb_key    setll     sistlb
     c     sistlb_key    reade     sistlb
      *
     c                   dow       not %eof and
     c                             sipmnd <= w_dmnd
      *
     c                   if        silage = a1lage
     c                   if        sipmnd = w_dmnd
     c                   eval(h)   a_pkjo(13) = a_pkjo(13) + sianta
     c                   else
     c                   eval(h)   a_pkjo(sipmnd) = a_pkjo(sipmnd) + sianta
     c                   endif
     c                   endif
      *
     c     sistlb_key    reade     sistlb
     c                   enddo
      *
      * Legger kjøpstall ut i riktig skjermfelt
      *
     c                   eval      w_mtel = 1
      *
     c                   dow       w_mtel < 13
     c                   if        w_dmnd = 13
     c                   eval      w_dmnd = 1
     c                   endif
     c                   eval      a_hkjo(w_mtel) = a_pkjo(w_dmnd)
     c                   eval      w_mtel = w_mtel + 1
     c                   eval      w_dmnd = w_dmnd + 1
     c                   enddo
     c                   eval      a_hkjo(13) = a_pkjo(13)
      *
     c                   eval      a1kj01 = a_hkjo(01)
     c                   eval      a1kj02 = a_hkjo(02)
     c                   eval      a1kj03 = a_hkjo(03)
     c                   eval      a1kj04 = a_hkjo(04)
     c                   eval      a1kj05 = a_hkjo(05)
     c                   eval      a1kj06 = a_hkjo(06)
     c                   eval      a1kj07 = a_hkjo(07)
     c                   eval      a1kj08 = a_hkjo(08)
     c                   eval      a1kj09 = a_hkjo(09)
     c                   eval      a1kj10 = a_hkjo(10)
     c                   eval      a1kj11 = a_hkjo(11)
     c                   eval      a1kj12 = a_hkjo(12)
     c                   eval      a1kj13 = a_hkjo(13)
      *
     c     kjop_end      endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for å blanke ut skjermbilde
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     blank_skjerm  begsr
      *
      * Blanker felter i skjermbilde
      *
     c                   eval      *in41 = *off
     c                   eval      *in42 = *off
     c                   eval      a1tek1 = *blank
     c                   eval      a1enhl = *blank
     c                   eval      a1enhi = *blank
     c                   eval      a1behl = 0
     c                   eval      a1mini = 0
     c                   eval      a1maks = 0
     c                   eval      a1pakk = 0
     c                   eval      a1sikl = 0
     c                   eval      a1oord = 0
     c                   eval      a1bbes = 0
     c                   eval      a1bpun = 0
     c                   eval      a1bmen = 0
     c                   eval      a1disp = 0
     c                   eval      a1ltid = 0
     c                   eval      a1sa01 = 0
     c                   eval      a1sa02 = 0
     c                   eval      a1sa03 = 0
     c                   eval      a1sa04 = 0
     c                   eval      a1sa05 = 0
     c                   eval      a1sa06 = 0
     c                   eval      a1sa07 = 0
     c                   eval      a1sa08 = 0
     c                   eval      a1sa09 = 0
     c                   eval      a1sa10 = 0
     c                   eval      a1sa11 = 0
     c                   eval      a1sa12 = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Henter innkjøpsenhet og priser
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     hent_inpri    begsr
      *
     c                   eval      w_lety = 0
     c                   eval      w_kamp = *blank
      *
     c                   call      'VP750R'
     c                   parm                    w_firm
     c                   parm                    vvarl1_vare
     c                   parm                    w_prgr
     c                   parm                    w_lety
     c                   parm                    w_date
     c                   parm                    a1enhi
     c                   parm                    w_kpny
     c                   parm                    w_ipny
     c                   parm                    w_kamp
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for å sjekke gyldig lager
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_lager   begsr
      *
     c                   call      'FÅ720R'
     c                   parm                    w_firm
     c                   parm                    a1lage
     c                   parm                    a1ltek
     c                   parm                    w_adrs
     c                   parm                    w_ponr
     c                   parm                    w_pste
     c                   parm                    w_avde
     c                   parm                    b_feil
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Behandling av scanning
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     scanning      begsr
      *
     c                   eval      e1eann = *blank
      *
     c     e1taga        tag
      *
     c                   exfmt     e1win
      *
     c                   if        *inkc or *inkl
     c                   eval      b_scan = *off
     c                   goto      end_e1win
     c                   endif
      *
      * EAN-nummer må oppgis
      *
     c                   if        e1eann = *blank
     c                   eval      *in31 = *on
     c                   goto      e1taga
     c                   endif
      *
      * Sjekk om vare finnes for EAN-nummer
      *
     c                   eval      w_leng = %len(%trim(e1eann))
     c                   eval      w_eanx = %subst(c_null:1:14-w_leng) +
     c                                      e1eann
      *
     c                   move      w_eanx        w_eann
     c                   call      'VE710R  '
     c                   parm                    w_firm
     c                   parm                    w_eann
     c                   parm                    w_eava
     c                   parm                    w_eaen
     c                   parm                    w_east
     c                   if        w_east = *blank
     c                   eval      *in32 = *on
     c                   goto      e1taga
     c                   endif
      *
     c                   movel     w_eava        a1vare
      *
     c                   eval      e1eann = *blank
      *
     c     end_e1win     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for spørring på input A1BLD
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sp_input      begsr
      *
      *  Spørring på varenummer
      *
     c                   if        w_afld = 'A1VARE'
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    a1vare
     c                   parm                    a1tek1
      *
     c                   exsr      sjekk_lager
     c                   goto      sp_end
     c                   endif
      *
      *  Spørring lager
      *
     c                   if        w_afld = 'A1LAGE'
     c                   call      'RA510R'
     c                   parm                    w_firm
     c                   parm                    a1lage
     c                   parm                    a1ltek
     c                   goto      sp_end
     c                   endif
      *
     c     sp_end        endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for å finne redigere månedsheading
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     lag_hdng      begsr
      *
      * Finn start måned og år
      *
     c                   extrct    w_date:*m     w_dmnd
     c                   extrct    w_date:*y     w_daar
     c                   eval      w_faar = w_daar - 1
     c                   move      w_faar        w_aaar
      *
      * Legger ut riktig måned i tabell
      *
     c                   eval      w_mtel = 1
     c                   dow       w_mtel < 14
     c                   if        w_dmnd >12
     c                   eval      w_dmnd = 1
     c                   move      w_daar        w_aaar
     c                   endif
     c                   eval      a_htxt(w_mtel) = %trimr(a_mtxt(w_dmnd) +
     c                                                     w_aaar)
     c                   eval      w_dmnd = w_dmnd + 1
     c                   eval      w_mtel = w_mtel + 1
     c                   enddo
      *
      * Flytter overskrift ut i skjermfelter
      *
     c                   eval      a1he01 = a_htxt(1)
     c                   eval      a1he02 = a_htxt(2)
     c                   eval      a1he03 = a_htxt(3)
     c                   eval      a1he04 = a_htxt(4)
     c                   eval      a1he05 = a_htxt(5)
     c                   eval      a1he06 = a_htxt(6)
     c                   eval      a1he07 = a_htxt(7)
     c                   eval      a1he08 = a_htxt(8)
     c                   eval      a1he09 = a_htxt(9)
     c                   eval      a1he10 = a_htxt(10)
     c                   eval      a1he11 = a_htxt(11)
     c                   eval      a1he12 = a_htxt(12)
     c                   eval      a1he13 = a_htxt(13)
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for å finne omregningsfaktor
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     hent_omr      begsr
      *
     c                   eval      vvenl1_vare = vvvare
     c     vvenl1_key    setll     vvenl1
     c     vvenl1_key    reade     vvenl1                                 91
     c                   dow       *in91 = *off
     c                   if        vvenhl = veenhe
     c                   eval      w_omrl = veomre
     c                   endif
     c                   if        vvenhs = veenhe
     c                   eval      w_omrs = veomre
     c                   endif
     c     vvenl1_key    reade     vvenl1                                 91
     c                   enddo
      *
     c                   if        w_omrs = 0
     c                   eval      w_omrs = 1
     c                   endif
      *
     c                   endsr
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Key for les av VARE
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarl1_vare
      *
      *  Key for les av LAGER
      *
     c     vlagl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vlagl1_vare
     c                   kfld                    vlagl1_lage
      *
      * Key for les av salgsstatistikk
      *
     c     sstalb_key    klist
     c                   kfld                    w_firm
     c                   kfld                    sstalb_paar
     c                   kfld                    sstalb_vare
      *
      * Key for les av innkjøpsstatistikk
      *
     c     sistlb_key    klist
     c                   kfld                    w_firm
     c                   kfld                    sistlb_paar
     c                   kfld                    sistlb_vare
      *
      * Key for les av vare-enhet
      *
     c     vvenl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvenl1_vare
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Tar inn parameter fra forrige program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *entry        plist
     c                   parm                    p_vare
     c                   parm                    p_lage
      *
      *  Legge inn firmanummer i nøklene
      *
     c                   eval      w_firm = l_firm
     c                   time                    w_date
      *
      * Hent prisgruppe
      *
     c                   eval      w_avde = 0
     c                   if        p_lage = 0
     c                   eval      p_lage = l_lage
     c                   endif
     c                   call      'VL712R'
     c                   parm                    w_firm
     c                   parm                    p_lage
     c                   parm                    w_avde
     c                   parm                    w_prgr
      *
     c                   endsr
**
Jan-
Feb-
Mar-
Apr-
Mai-
Jun-
Jul-
Aug-
Sep-
Okt-
Nov-
Des-
