     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System. . . . . : ASLAGR
      *  Program . . . . : LL840R
      *  Beskrivelse . . : Sletter lagerposteer, Parameterinntasting
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Spesialversjon. :
      *  Tilpasset for . :
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign
      * --------- ------  -------------------------------------------------
6.10  *           100212   Hindre at man kan kjøre valg1
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     fll840d    cf   e             workstn
      *
     d                 ds
      *                                                      Parameter-inn
     d d_prec                        64
     d  d_val1                        1  0 overlay(d_prec)
     d  d_val2                        1  0 overlay(d_prec:2)
     d  d_val3                        1  0 overlay(d_prec:3)
     d  d_val4                        1  0 overlay(d_prec:4)
     d  d_lage                        2  0 overlay(d_prec:5)
      *
      * Local Data Area
      *
     d                uds
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av variable
      *
     d w_valg          s              1
6.10 d w_mld1          s             50
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Behandle bilde for registrering av parametre
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     b1tag         tag
      *
      *  Nullstiller variable som skal vises i skjermbildet
      *
     c                   eval      b1val1 = 0
     c                   eval      b1val2 = 0
     c                   eval      b1val3 = 0
     c                   eval      b1val4 = 0
     c                   eval      b1lage = 0
      *
     c     b1taga        tag
      *
     c     b1tagb        tag
     c                   exfmt     b1bld
      *
      *  F3=Gå tilbake  (Avslutt)
      *
     c                   if        *inkc = *on
     c                   goto      end_pgm
     c                   endif
6.10 c                   if        b1val1 = 1
6.10  * Hindre at man kan velge dette punktet
6.10  *
6.10 c                   eval      w_mld1 = 'Kan ikke slette lagerposter på -
6.10 c                             dette punktet'
6.10 c                   call      'AA005R'
6.10 c                   parm                    w_mld1
6.10 c                   goto      b1taga
6.10 c                   endif
      *
      *  Sjekk, Er oppdateringer valgt?
      *
     c                   if        b1val1 = 0 and
     c                             b1val2 = 0 and
     c                             b1val3 = 0 and
     c                             b1val4 = 0
     c                   goto      end_pgm
     c                   endif
      *
      *  Be om bekreftelse på valgte slettinger
      *
     c                   eval      d1tek1 = *blank
     c                   eval      d1tek2 = *blank
     c                   eval      d1tek3 = *blank
     c                   eval      d1lage = b1lage
      *
     c                   if        b1val3 = 1
     c                   eval      d1tek1 = '- alle poster på lager'
     c                   else
     c                   if        b1val1 = 1
     c                   eval      d1tek1 = '- poster som ikke er varetype L'
     c                   endif
     c                   if        b1val2 = 1
     c                   eval      d1tek2 = '- poster som mangler i varereg.'
     c                   endif
     c                   endif
     c                   if        b1val4 = 1
     c                   eval      d1tek3 = '- alle poster i historisk lagerbok'
     c                   endif
     c                   exfmt     d1win
      *
      *
     c                   if        *inkc = *on or
     c                             *inkl = *on
     c                   goto      b1taga
     c                   endif
      *
      *  Legger inntastede opplysninger i Hjelpe-felter for Parameter
      *
     c                   eval      d_val1 = b1val1
     c                   eval      d_val2 = b1val2
     c                   eval      d_val3 = b1val3
     c                   eval      d_val4 = b1val4
     c                   eval      d_lage = b1lage
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Kaller opp neste 'CL'-program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  F10=Legge jobb på jobbkø
      *
     c                   if        *inkj = *on
     c                   eval      w_valg = '1'
     c                   else
     c                   eval      w_valg = '0'
     c                   endif
      *
      *  Kaller opp subprogram
      *
     c                   call      'LL842C'
     c                   parm                    d_prec
     c                   parm                    w_valg
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     end_pgm       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
