     h decedit ('0,') datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System. . . . . : ASLAGR
      *  Program . . . . : LL850R
      *  Beskrivelse . . : Uttrekk salg- & kjøpsstat. - parameter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Spesialversjon. :
      *  Tilpasset for . :
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign
      * --------- ------  --------------------------------------------------
      *       141102 GRO  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     fll850d    cf   e             workstn
      *
      *  Local Data Area
      *
     d                uds
     d l_firm                944    946  0
     d l_wsid                901    910
     d l_user                        10
     d l_fnav                951    980
     d l_lage               1001   1002  0
      *
      *  Parameter-record
      *
     d                 ds
     d p_prec                        55
     d  p_fvar                        8  0 overlay(p_prec)
     d  p_tvar                        8  0 overlay(p_prec:9)
     d  p_flag                        2  0 overlay(p_prec:17)
     d  p_tlag                        2  0 overlay(p_prec:19)
     d  p_fogr                        2  0 overlay(p_prec:21)
     d  p_togr                        2  0 overlay(p_prec:23)
     d  p_fhgr                        2  0 overlay(p_prec:25)
     d  p_thgr                        2  0 overlay(p_prec:27)
     d  p_fugr                        3  0 overlay(p_prec:29)
     d  p_tugr                        3  0 overlay(p_prec:32)
     d  p_anbl                        1  0 overlay(p_prec:35)
     d  p_kjop                        1  0 overlay(p_prec:36)
     d  p_snul                        1  0 overlay(p_prec:37)
     d  p_blan                        1  0 overlay(p_prec:38)
     d  p_star                        4  0 overlay(p_prec:39)
     d  p_stmn                        2  0 overlay(p_prec:43)
     d  p_slar                        4  0 overlay(p_prec:45)
     d  p_slmn                        2  0 overlay(p_prec:49)
     d  p_favd                        4  0 overlay(p_prec:51)
     d  p_vtyp                        1    overlay(p_prec:55)
      *
     d p_mapp                        10
     d p_filn                        10
     d p_batc                         1
      *
      * Definering av outputrecord
      *
      *   Definering av øvrige variable
      *
     d w_firm          s              3  0
     d w_date          s               d   datfmt(*iso)
     d w_dmnd          s              2  0
     d w_aaar          s              4
     d w_daar          s              4  0
     d w_faar          s              4  0
     d w_mtel          s              2  0
     d w_lage          s              2
     d w_fvar          s             15
     d w_tvar          s             15
     d w_vare          s             15
     d w_vtxt          s             35
     d w_ogrp          s              2  0
     d w_hgrp          s              2  0
     d w_ugrp          s              3  0
     d w_otxt          s             35
     d w_htxt          s             35
     d w_utxt          s             35
     d w_latx          s             20
     d w_avtx          s             20
     d w_parm          s             55
     d w_paar          s              1  0
     d w_plar          s              4  0
     d w_plmn          s              2  0
      *
      * Salgsvariable - antall
     d w_mxsa          s              8  1
     d w_misa          s              8  1
     d w_snsa          s              8  1
     d w_ttsa          s              8  1
     d w_mxsx          s             10
     d w_misx          s             10
     d w_snsx          s             10
     d w_ttsx          s             10
      *
      * Kjøpsvariable - antall
     d w_mxkj          s              8  1
     d w_mikj          s              8  1
     d w_snkj          s              8  1
     d w_ttkj          s              8  1
     d w_mxkx          s             10
     d w_mikx          s             10
     d w_snkx          s             10
     d w_ttkx          s             10
      *
      * Salgsvariable - beløp
     d w_mxsab         s             11  2
     d w_misab         s             11  2
     d w_snsab         s             11  2
     d w_ttsab         s             11  2
     d w_mxsxb         s             13
     d w_misxb         s             13
     d w_snsxb         s             13
     d w_ttsxb         s             13
      *
      * Kjøpsvariable - beløp
     d w_mxkjb         s             11  2
     d w_mikjb         s             11  2
     d w_snkjb         s             11  2
     d w_ttkjb         s             11  2
     d w_mxkxb         s             10
     d w_mikxb         s             10
     d w_snkxb         s             10
     d w_ttkxb         s             10
      *
      * Boolske variable/"brytere"
     d b_feil          s              1    inz(*off)
     d b_lage          s              1    inz(*off)
     d b_scan          s              1    inz(*off)
     d b_head          s              1    inz(*off)
     d b_parm          s              1    inz(*off)
      *
      *  Konstanter
     d c_fsep          c                   ';'
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * A1BLD Behandle bilde for uttrekksskriteria
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   eval      a1tvar = 99999999
     c*                  eval      a1tlag = 99
     c                   eval      a1togr = 99
     c                   eval      a1thgr = 99
     c                   eval      a1tugr = 999
     c                   eval      a1vtyp = 'L'
      *
     c                   if        w_dmnd > 1
     c                   eval      a1slar = w_daar
     c                   eval      a1slmn = w_dmnd - 1
     c                   else
     c                   eval      a1slar = w_daar - 1
     c                   eval      a1slmn = 1
     c                   endif
     c                   eval      w_plar = a1slar
     c                   eval      w_plmn = a1slmn
      *
     c                   eval      a1paar = 3
      *
     c     a1taga        tag
      *
     c                   exfmt     a1bld
      *
      * CMD3 = Avslutt
      *
     c                   if        *inkc = *on or
     c                             *inkl = *on
     c                   goto      end_pgm
     c                   endif
      *
      * CMD4 = Spørring
      *
     c                   if        *inkd = *on
     c                   exsr      sp_input
     c                   goto      a1taga
     c                   endif
      *
     c                   if        *inkj = *on
     c                   eval      p_batc = 'Y'
     c                   else
     c                   eval      p_batc = ''
     c                   endif
      *
     c                   if        a1fvar > a1tvar
     c                   eval      *in30 = *on
     c                   goto      a1taga
     c                   endif
      *
     c*                  if        a1flag > a1tlag
     c*                  eval      *in31 = *on
     c*                  goto      a1taga
     c*                  endif
      *
     c                   if        a1fogr > a1togr
     c                   eval      *in32 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   if        a1fhgr > a1thgr
     c                   eval      *in33 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   if        a1fugr > a1tugr
     c                   eval      *in34 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   if        a1anbl > 1
     c                   eval      *in35 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   if        a1kjop > 1
     c                   eval      *in36 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   if        a1snul > 1
     c                   eval      *in37 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   if        a1blan > 1
     c                   eval      *in38 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   if        a1mapp = *blank
     c                   eval      *in39 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   if        a1filn = *blank
     c                   eval      *in40 = *on
     c                   goto      a1taga
     c                   endif
      *
      * Skriv parameter til Local
      *
     c                   eval      p_fvar = a1fvar
     c                   eval      p_tvar = a1tvar
     c                   eval      p_flag = a1flag
     c*                  eval      p_tlag = a1tlag
     c                   eval      p_tlag = 0
     c                   eval      p_favd = a1favd
     c                   eval      p_fogr = a1fogr
     c                   eval      p_togr = a1togr
     c                   eval      p_fhgr = a1fhgr
     c                   eval      p_thgr = a1thgr
     c                   eval      p_fugr = a1fugr
     c                   eval      p_tugr = a1tugr
     c                   eval      p_anbl = a1anbl
     c                   eval      p_kjop = a1kjop
     c                   eval      p_snul = a1snul
     c                   eval      p_blan = a1blan
     c                   eval      p_vtyp = a1vtyp
      *
     c                   if        a1slar = 0
     c                   eval      p_slar = w_plar
     c                   eval      p_slmn = w_plmn
     c                   else
     c                   eval      p_slar = a1slar
     c                   eval      p_slmn = a1slmn
     c                   endif
      *
     c                   if        a1paar < 1 or
     c                             a1paar > 3
     c                   eval      a1paar = 3
     c                   endif
      *
     c                   eval      p_star = p_slar - a1paar
     c                   if        a1slmn < 12
     c                   eval      p_stmn = a1slmn + 1
     c                   else
     c                   eval      p_stmn = 1
     c                   eval      p_star = p_star + 1
     c                   endif
      *
     c                   eval      w_parm = p_prec
     c                   eval      p_mapp = a1mapp
     c                   eval      p_filn = a1filn
      *
     c                   call      'LL850C'
     c                   parm                    w_parm
     c                   parm                    p_mapp
     c                   parm                    p_filn
     c                   parm                    p_batc
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     end_pgm       tag
     c                   eval      *inlr = *on
     c                   return
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for spørring på input A1BLD
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sp_input      begsr
      *
      *  Spørring i vareregister
      *
     c                   if        wactfe = 'A1FVAR' or
     c                             wactfe = 'A1TVAR'
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    w_vtxt
     c                   if        wactfe = 'A1FVAR'
     c                   movel     w_vare        a1fvar
     c                   else
     c                   movel     w_vare        a1tvar
     c                   endif
     c                   leavesr
     c                   endif
      *
      *  Spørring i overgrupperegister
      *
     c                   if        wactfe = 'A1FOGR'
     c                   call      'VG510R'
     c                   parm                    w_firm
     c                   parm                    a1fogr
     c                   parm                    w_otxt
     c                   leavesr
     c                   endif
      *
     c                   if        wactfe = 'A1TOGR'
     c                   call      'VG510R'
     c                   parm                    w_firm
     c                   parm                    a1togr
     c                   parm                    w_otxt
     c                   leavesr
     c                   endif
      *
      *  Spørring i hovedgrupperegister
      *
     c                   if        wactfe = 'A1FHGR'
 001 C                   call      'VG511R'
 001 C                   parm                    w_firm
 001 C                   parm                    a1fogr
 001 C                   parm                    a1fhgr
 001 C                   parm                    w_htxt
     c                   leavesr
     c                   endif
      *
     c                   if        wactfe = 'A1THGR'
     c                   if        a1togr = 99
     c                   eval      a1togr = 0
     c                   eval      a1thgr = 0
     c                   endif
 001 c                   call      'VG511R'
 001 c                   parm                    w_firm
 001 c                   parm                    a1togr
 001 c                   parm                    a1thgr
 001 c                   parm                    w_htxt
     c                   leavesr
     c                   endif
      *
      *  Spørring i undergrupperegister
      *
     c                   if        wactfe = 'A1FUGR'
 001 c                   call      'VG512R'
 001 c                   parm                    w_firm
 001 c                   parm                    a1fogr
 001 c                   parm                    a1fhgr
 001 c                   parm                    a1fugr
 001 c                   parm                    w_utxt
     c                   leavesr
     c                   endif
      *
     c                   if        wactfe = 'A1TUGR'
     c                   if        a1togr = 99
     c                   eval      a1togr = 0
     c                   eval      a1thgr = 0
     c                   eval      a1tugr = 0
     c                   endif
     c                   if        a1thgr = 99
     c                   eval      a1thgr = 0
     c                   eval      a1tugr = 0
     c                   endif
 001 c                   call      'VG512R'
 001 c                   parm                    w_firm
 001 c                   parm                    a1togr
 001 c                   parm                    a1thgr
 001 c                   parm                    a1tugr
 001 c                   parm                    w_utxt
     c                   leavesr
     c                   endif
      *
      *  Spørring lager
      *
     c                   if        wactfe = 'A1FLAG'
     c                   call      'RA510R'
     c                   parm                    w_firm
     c                   parm                    a1flag
     c                   parm                    w_latx
     c                   leavesr
     c                   endif
      *
     c*                  if        wactfe = 'A1TLAG'
     c*                  call      'RA510R'
     c*                  parm                    w_firm
     c*                  parm                    a1tlag
     c*                  parm                    w_latx
     c*                  leavesr
     c*                  endif
      *
      *
      *  Spørring lager
      *
     c                   if        wactfe = 'A1FAVD'
     c                   call      'RA507R'
     c                   parm                    w_firm
     c                   parm                    a1favd
     c                   parm                    w_avtx
     c                   leavesr
     c                   endif
      *
     c                   endsr
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Legge inn firmanummer i nøklene
      *
     c                   eval      w_firm = l_firm
     c                   time                    w_date
     c                   extrct    w_date:*y     w_daar
     c                   extrct    w_date:*m     w_dmnd
      *
     c                   endsr
