     h decedit ('0,') datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System. . . . . : ASLAGR
      *  Program . . . . : LL860R
      *  Beskrivelse . . : Uttrekk inng.fakt.linjer . - parameter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Spesialversjon. :
      *  Tilpasset for . :
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign
      * --------- ------  --------------------------------------------------
      *       110910 bof  Nytt program
7.xx  * 6.30  040117 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     frlevl1    if   e           k disk    rename(rlevpfr:rlevl1r)
     fLL860d    cf   e             workstn
      *
      *  Local Data Area
      *
     d                uds
     d l_firm                944    946  0
     d l_wsid                901    910
     d l_user                        10
     d l_fnav                951    980
     d l_lage               1001   1002  0
      *
      *  Parameter-record
      *
     d                 ds
     d p_prec                        55
     d  p_ldor                        6  0 overlay(p_prec)
     d  p_fdat                        6  0 overlay(p_prec:7)
     d  p_tdat                        6  0 overlay(p_prec:13)
      *
     d p_mapp                        12
     d p_filn                        12
     d p_batc                         1
      *
     d rlevl1_levr     s                   like(rllevr)
      *
      * Definering av outputrecord
      *
      *   Definering av øvrige variable
      *
     d w_firm          s              3  0
     d w_date          s               d   datfmt(*iso)
     d w_dmnd          s              2  0
     d w_aaar          s              4
     d w_daar          s              4  0
     d w_faar          s              4  0
     d w_mtel          s              2  0
     d w_lage          s              2
     d w_fvar          s             15
     d w_tvar          s             15
     d w_vare          s             15
     d w_vtxt          s             35
     d w_ogrp          s              2  0
     d w_hgrp          s              2  0
     d w_ugrp          s              3  0
     d w_otxt          s             35
     d w_htxt          s             35
     d w_utxt          s             35
     d w_latx          s             20
     d w_avtx          s             20
     d w_parm          s             55
     d w_paar          s              1  0
     d w_plar          s              4  0
     d w_plmn          s              2  0
      *
      * Salgsvariable - antall
     d w_mxsa          s              8  1
     d w_misa          s              8  1
     d w_snsa          s              8  1
     d w_ttsa          s              8  1
     d w_mxsx          s             10
     d w_misx          s             10
     d w_snsx          s             10
     d w_ttsx          s             10
      *
      * Kjøpsvariable - antall
     d w_mxkj          s              8  1
     d w_mikj          s              8  1
     d w_snkj          s              8  1
     d w_ttkj          s              8  1
     d w_mxkx          s             10
     d w_mikx          s             10
     d w_snkx          s             10
     d w_ttkx          s             10
      *
      * Salgsvariable - beløp
     d w_mxsab         s             11  2
     d w_misab         s             11  2
     d w_snsab         s             11  2
     d w_ttsab         s             11  2
     d w_mxsxb         s             13
     d w_misxb         s             13
     d w_snsxb         s             13
     d w_ttsxb         s             13
      *
      * Kjøpsvariable - beløp
     d w_mxkjb         s             11  2
     d w_mikjb         s             11  2
     d w_snkjb         s             11  2
     d w_ttkjb         s             11  2
     d w_mxkxb         s             10
     d w_mikxb         s             10
     d w_snkxb         s             10
     d w_ttkxb         s             10
      *
      * Boolske variable/"brytere"
     d b_feil          s              1    inz(*off)
     d b_lage          s              1    inz(*off)
     d b_scan          s              1    inz(*off)
     d b_head          s              1    inz(*off)
     d b_parm          s              1    inz(*off)
      *
      *  Konstanter
     d c_fsep          c                   ';'
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * A1BLD Behandle bilde for uttrekksskriteria
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   eval      a1ldor = 0
     c                   eval      a1fdat = 0
     c                   eval      a1tdat = 0
     c     a1taga        tag
      *
     c                   exfmt     a1bld
      *
      * CMD3 = Avslutt
      *
     c                   if        *inkc = *on or
     c                             *inkl = *on
     c                   goto      end_pgm
     c                   endif
      *
      * CMD4 = Spørring
      *
     c                   if        *inkd = *on
     c                   exsr      sp_input
     c                   goto      a1taga
     c                   endif
      *
     c                   if        *inkj = *on
     c                   eval      p_batc = 'Y'
     c                   else
     c                   eval      p_batc = ''
     c                   endif
      *
      *
     c                   if        a1ldor = 0
     c                   eval      *in30 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   eval      rlevl1_levr = a1ldor
     c     rlevl1_key    chain     rlevl1
     c                   if        not %found(rlevl1)
     c                   eval      *in30 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   if        a1fdat = 0
     c                   eval      *in31 = *on
     c                   goto      a1taga
     c                   endif
     c     *dmy          test(d)                 a1fdat                 31
     c                   if        *in31 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   if        a1tdat = 0
     c                   eval      *in44 = *on
     c                   goto      a1taga
     c                   endif
      *
     c     *dmy          test(d)                 a1tdat                 44
     c                   if        *in44 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   if        a1mapp = *blank
     c                   eval      *in39 = *on
     c                   goto      a1taga
     c                   endif
      *
     c                   if        a1filn = *blank
     c                   eval      *in40 = *on
     c                   goto      a1taga
     c                   endif
      *
      * Skriv parameter til Local
      *
     c                   eval      p_ldor = a1ldor
     c                   eval      p_fdat = a1fdat
     c                   eval      p_tdat = a1tdat
      *
     c                   eval      w_parm = p_prec
     c                   eval      p_mapp = a1mapp
     c                   eval      p_filn = a1filn
      *
     c                   call      'LL860C'
     c                   parm                    w_parm
     c                   parm                    p_mapp
     c                   parm                    p_filn
     c                   parm                    p_batc
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     end_pgm       tag
     c                   eval      *inlr = *on
     c                   return
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for spørring på input A1BLD
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sp_input      begsr
      *
      *  Spørring på fakturaleverandør
      *
     c                   if        wactfe = 'A1LDOR'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    a1ldor
     c                   parm                    a1lnav
     c                   leavesr
     c                   endif
      *
     c                   endsr
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *
      *  Key for les av leverandør
      *
     c     rlevl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rlevl1_levr
      *
      *  Legge inn firmanummer i nøklene
      *
     c                   eval      w_firm = l_firm
     c                   time                    w_date
     c                   extrct    w_date:*y     w_daar
     c                   extrct    w_date:*m     w_dmnd
      *
     c                   endsr
