     H/TITLE  ASLAGR: Utskrift av bestilling/innkjøp
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  System. . . . . : ASLAGR                                       *
      *  Program . . . . : LO120R                                       *
      *  Beskrivelse . . : Utskrift av bestilling/innkjøp               *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  Spesialversjon. :                                              *
      *  Tilpasset for . :                                              *
      *                                                                 *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.*
      *  --------- ------  ---------------------------------------------*
      *                                                                 *
      *                                                                 *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     D                UDS
     D  DSSFIR               944    946  0
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Kaller opp program for behandling av bestilling                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *  Nullstiller variable felter
      *
     C                   MOVE      *BLANK        WPSPOR
     C                   MOVE      *ZERO         HEDNUM
     C                   MOVE      *ZERO         HEDSUF
      *
      *  Kaller opp subprogrammet for behandling av bestilling
      *
     C                   CALL      'LOSPOR'
     C                   PARM                    WPSPOR
     C                   PARM                    HEDFIR
     C                   PARM                    HEDNUM
     C                   PARM                    HEDSUF
     C                   PARM                    WPXSPO
     C                   PARM                    WPXOTY
     C                   PARM                    WPXUSE
     C                   PARM                    WPXLDO
     C                   PARM                    WPXVLG
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Avslutt program                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     C     XSLUTT        TAG
      *
     C                   SETON                                        LR
     C                   RETURN
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     C     *INZSR        BEGSR
      *
      *  Nullstilling av felter som ikke kan redefineres
      *
     C                   MOVE      *BLANK        WPSPOR            1
     C                   MOVE      *ZERO         HEDFIR            3 0
     C                   MOVE      *ZERO         HEDNUM            6 0
     C                   MOVE      *ZERO         HEDSUF            2 0
      *
     C                   MOVE      *BLANK        WPXSPO            1
     C                   MOVE      *BLANK        WPXOTY            2
     C                   MOVE      *BLANK        WPXUSE           10
     C                   MOVE      *BLANK        WPXLDO            6 0
     C                   MOVE      *BLANK        WPXVLG            1
      *
      *  Legger inn firma fra LDA inn i firma for oppkalling
      *
     C                   MOVE      DSSFIR        HEDFIR
      *
     CSR                 ENDSR
