     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASLAGR
      * Program . . . . : LO582R
      * Beskrivelse . . : Utvalg hull i nummerserier
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       210611 NHO  Nytt program
6.nu  *       250514 bof  Utvidet mtp. nummerutvidelse
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     flo583d    cf   e             workstn
      *
      * Definering av parametre
      *
     d p_aarr          s              4  0
6.nu d p_a1fr          s              8  0
6.nu d p_a1ti          s              8  0
     d p_pf03          s              1  0
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av datastrukturer
      *
      * Definering av variabler i nøkler
      * Vis seleksjonsbildet
     c     nyvis         tag
      *
     c                   exfmt     a1bld
      *
      * Avslutter dersom F3 er tastet
     c                   if        *inkc = '1'
     c                   eval      p_pf03  = 1
     c                   goto      avslutt
     c                   endif
      *
      * Feilmelding. år må tastes
     c                   if        a1aarr = *zeros
     c                   eval      *in31 = '1'
     c                   goto      nyvis
     c                   else
     c                   eval      *in31 = '0'
     c                   endif
      *
      *
      * Feilmelding på fra til nummer SOHEPF
     c                   if        a1efaf > a1efat
     c                   eval      *in32 = '1'
     c                   goto      nyvis
     c                   else
     c                   eval      *in32 = '0'
     c                   endif
      *
      *
      *
      * Flytter verdier ut
     c                   eval      p_aarr = a1aarr
     c                   eval      p_a1fr = a1efaf
     c                   eval      p_a1ti = a1efat
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
      *
     c                   eval      *inlr = *on
     c                   return
      *
      *********************************************************************
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_aarr
     c                   parm                    p_a1fr
     c                   parm                    p_a1ti
     c                   parm                    p_pf03
      *
      *
     c                   endsr
