     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASLAGR
      * Program . . . . : LO585R
      * Beskrivelse . . : Liste/ hull i nummerseri FDELPF
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       240611 NHO  Nytt program
6.nu  *       230614 bof  Utvidet mtp. nummerutvidelse
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffdell1    if   e           k disk    rename(fdelpfr:fdell1r)
      *
     flo585p    o    e             printer
     f                                     usropn
      *
      * Definering av parametre
     d p_aarr          s              4  0
6.nu d p_a1fr          s              8  0
6.nu d p_a1ti          s              8  0
6.nu d p_a2fr          s              8  0
6.nu d p_a2ti          s              8  0
6.nu d p_a3fr          s              8  0
6.nu d p_a3ti          s              8  0
     d p_pf03          s              1  0
      *
      *
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      *
      * Definering av variabler i nøkler
      *
     d fdell1_firm     s                   like(fyfirm)
     d fdell1_aarr     s                   like(fyaarr)
     d fdell1_numm     s                   like(fynumm)
     d fdell1_suff     s                   like(fysuff)
      *
      *
      *
      * Les poster
     c                   exsr      les
      * Avslutt program
      *
     c     avslutt       tag
      *
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Leser post
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     les           begsr
      *
     c                   open      lo585p
      * Skriv headingq
     c                   write     a1hdr
      *
      * Finner faktura- hode
     c                   eval      fdell1_aarr = p_aarr
     c                   eval      fdell1_firm = l_firm
     c                   eval      fdell1_numm = p_a3fr
      *
     c     fdell1_key    setll     fdell1
      *
     c     nyles         tag
     c                   read      fdell1                                 60
      *
      * Eof
     c                   if        *in60 = *on
     c                   goto      avslutt
     c                   endif
      *
      * Avslutter dersom år > enn valgt
     c                   if        fyaarr > p_aarr
     c                   goto      avslutt
     c                   endif
      *
      * Avslutter dersom nummer > enn valgt til nummer
     c                   if        fynumm > p_a3ti
     c                   goto      avslutt
     c                   endif
      *
     c     fØrste        ifeq      1
     c                   add       1             fdell1_numm
     c                   endif
      *
      * Teller til ordrenummer hver gang etter første les
     c     fØrste        ifeq      0
     c                   add       1             fØrste            1 0
     c                   endif
      *
      * Sjekker om post som leses er større enn fra, legger til 1 og leser
      * neste
     c     neste         tag
      *
     c                   if        fynumm > fdell1_numm
     c                   eval      a1numm = fdell1_numm
     c                   write     d1det                                20
      * Er det overflow ?
      *
     C     *in20         ifeQ      *on
     C                   write     a1hdr
     C                   endif
      *
     c                   add       1             fdell1_numm
     c                   goto      neste
     c                   end
      *
     c                   if        fynumm = fdell1_numm
     c                   goto      nyles
     c                   endif
      *
     c                   endsr
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
      *
     c     *entry        plist
     c                   parm                    p_aarr
     c                   parm                    p_a1fr
     c                   parm                    p_a1ti
     c                   parm                    p_a2fr
     c                   parm                    p_a2ti
     c                   parm                    p_a3fr
     c                   parm                    p_a3ti
     c                   parm                    p_pf03
      *
      *
      * Key for oppslag på ordre-hode-register
      *
     c     fdell1_key    klist
     c                   kfld                    fdell1_firm
     c                   kfld                    fdell1_aarr
     c                   kfld                    fdell1_numm
      *
      *
     c                   endsr
