      /TITLE  ASOFAK Utskrift av fakturakopi
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : FO681R
      * Beskrivelse . . : Utskrift av fakturakopi
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       110698 HKO  Nytt program
6.nu  * R6.30 210814 bsa  Programmet gjennomgått mtp nummerutvidelser.
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvotyl1    if   e           k disk    rename(votypfr:votyl1r)
      *
      * Definering av datastrukturer
      *
      *  Datastruktur - parameterliste for kall av utskriftsprogram
      *
     d                 ds
6.nu d d_list                        34
     d  d_aarr                        4  0 overlay(d_list)
     d  d_otyp                        2    overlay(d_list:5)
6.nu d  d_fbin                        8  0 overlay(d_list:7)
6.nu d  d_tbin                        8  0 overlay(d_list:15)
6.nu d  d_prog                       10    overlay(d_list:23)
6.nu d  d_kopi                        1    overlay(d_list:33)
      *
      * Definering av parametre
      *
     d p_firm          s              3  0
     d p_aarr          s              4  0
6.nu d p_binr          s              8  0
     d p_otyp          s              2
      *
     d w_firm          s              3  0
      *
      * Definering av variabler i nøkler
      *
     d votyl1_otyp     s                   like(vaotyp)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Henter rutinenavn
      *
     c                   eval      votyl1_otyp = p_otyp
     c     votyl1_key    chain     votyl1                             60
     c                   if        *in60 = *on or
     c                             vaoakk <> 3
     c                   goto      avslutt
     c                   endif
      *
      * Fyller datastruktur, og kaller styreprogram
      *
     c                   eval      d_aarr = p_aarr
     c                   eval      d_otyp = p_otyp
     c                   eval      d_fbin = p_binr
     c                   eval      d_tbin = p_binr
     c                   eval      d_kopi = 'K'
      *
     c                   call      'LO681C'
     c                   parm                    d_list
     c                   parm                    vaorut
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_aarr
     c                   parm                    p_binr
     c                   parm                    p_otyp
      *
      * Key for oppslag på ordretype-regsiter
      *
     c     votyl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    votyl1_otyp
      *
      *
      * Henter firmakode fra parameter
      *
     c                   eval      w_firm = p_firm
      *
     c                   endsr
