     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System. . . . . : ASLAGR
      *  Program . . . . : LO700R
      *  Beskrivelse . . : Beregning av beløp på bestillingshode
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Spesialversjon. :
      *  Tilpasset for . :
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.
      *  --------- ------  -------------------------------------------------
      *  6.10      250110  BSA Nytt program
6.nu  *  6.30      120614  Sjekket mtp. nummerutvidelse
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvltyl1    if   e           k disk    rename(vltypfr:vltyl1r)
     flohelu    uf   e           k disk    rename(lohepfr:lohelur)
     flohel1    if   e           k disk    rename(lohepfr:lohel1r)
     flodtl1    if   e           k disk    rename(lodtpfr:lodtl1r)
      *
      * Definering av variable i parametre
      *
     d p_firm          s                   like(lofirm)
     d p_numm          s                   like(lonumm)
     d p_suff          s                   like(losuff)
      *
      * Definering av variable i nøkler
      *
     d lohel1_numm     s                   like(lonumm)
     d lohel1_suff     s                   like(losuff)
     d lohelu_numm     s                   like(lonumm)
     d lohelu_suff     s                   like(losuff)
     d lodtl1_numm     s                   like(ldnumm)
     d lodtl1_suff     s                   like(ldsuff)
     d lodtlu_numm     s                   like(ldnumm)
     d lodtlu_suff     s                   like(ldsuff)
     d lodtlu_line     s                   like(ldline)
     d vltyl1_ltyp     s                   like(valtyp)
      *
      * Definering av øvrige variable
      *
     d w_dato          s               d   datfmt(*iso)
     d w_inlr          s              1
     d w_lety          s              1  0
     d w_sapr          s              9  2
     d w_bupr          s              9  2
     d w_inpr          s              9  2
     d w_kopr          s              9  2
     d w_firm          s                   like(ldfirm)
     d w_enhe          s                   like(ldenh1)
     d w_lisu          s             11  2
     d w_dekn          s             11  2
     d w_grad          s             11  2
     d w_rabk          s             11  2
     d w_sumi          s             11  2
     d w_sumk          s             11  2
     d w_sumr          s             11  2
     d w_toti          s             11  2
     d w_totk          s             11  2
     d w_totr          s             11  2
     d w_anta          s                   like(ldanta)
     d w_ipny          s                   like(ldipny)
     d w_kpny          s                   like(ldkpny)
     d w_rab1          s                   like(ldrab1)
     d w_rab2          s                   like(ldrab2)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Hovedprogram - les bestillingslinjer og rekalkuler
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Hent opplysninger fra BESTILLING-HODE
      *
     c     lohel1_key    chain     lohel1r
      *
      *  Les BESTILLING-LINJER
      *
     c     lodtl1_key    setll     lodtl1r
     c     lodtl1_key    reade     lodtl1r
      *
     c                   dow       not %eof
      *
      *  Sjekk linjetype og les neste hvis tekstlinje
      *
     c                   eval      vltyl1_ltyp = ldltyp
     c     vltyl1_key    chain     vltyl1r
     c                   if        valktx = 1
     c                   goto      neste_linje
     c                   endif
      *
     c                   eval      w_ipny = ldipny
     c                   eval      w_kpny = ldkpny
     c                   eval      w_rab1 = ldrab1
     c                   eval      w_rab2 = ldrab2
      *
      *  Beregning av priser, summer og totaler
      *
      *  Statuskode = 0  gir beregning av nye summer og totaler
      *  Statuskode = 1  gir henting av nye priser/rabatter samt beregning
      *  Dersom bestillingslinje kommer fra LVR, brukes priser fra linje
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Beregner totaler for den enkelte varelinje
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   eval      w_anta = ldanta
     c                   if        valkre = '-'
     c                   eval      w_anta = w_anta * -1
     c                   endif
      *
      *  Beregning av innkjøp
      *
     c                   eval      w_sumi = w_ipny * w_anta
     c                   eval      w_lisu = w_sumi
      *
      *  Beregning av rabatter
      *
     c                   eval      w_rabk = (w_lisu * lorabp) / 100
     c                   eval      w_sumr = w_rabk
     c                   eval      w_lisu = w_lisu - w_rabk
      *
     c                   eval      w_rabk = (w_lisu * w_rab1) / 100
     c                   eval      w_sumr = w_sumr + w_rabk
     c                   eval      w_lisu = w_lisu - w_rabk
      *
     c                   eval      w_rabk = (w_lisu * w_rab2) / 100
     c                   eval      w_sumr = w_sumr + w_rabk
     c                   eval      w_lisu = w_lisu - w_rabk
      *
      *  Beregning av kost
      *
     c                   eval      w_sumk = w_kpny * w_anta
      *
      *  Akkumulerer totaler for oppdatering av BESTILLING-HODE-REGISTER
      *
     c                   eval      w_toti = w_toti + w_sumi
     c                   eval      w_totr = w_totr + w_sumr
     c                   eval      w_totk = w_totk + w_sumk
      *
     c     neste_linje   tag
     c     lodtl1_key    reade     lodtl1r
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     pgm_end       tag
      *
     c                   exsr      oppdat
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Oppdaterer bestillingshode med totaler
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     oppdat        begsr
      *
     c     lohelu_key    chain     lohelur
     c                   if        %found
     c                   eval      lototi = w_toti
     c                   eval      lototr = w_totr
     c                   eval      lototk = w_totk
     c                   update    lohelur
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Tar inn parameter fra forrige program
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_numm
     c                   parm                    p_suff
      *
      *  Key for les av LINJETYPE
      *
     c     vltyl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vltyl1_ltyp
      *
      *  Key for les av BESTILLING-HODE
      *
     c     lohel1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    lohel1_numm
     c                   kfld                    lohel1_suff
      *
      *  Key for oppdatering av BESTILLING-HODE
      *
     c     lohelu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    lohelu_numm
     c                   kfld                    lohelu_suff
      *
      *  Key for les av BESTILLING-LINJE
      *
     c     lodtl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    lodtl1_numm
     c                   kfld                    lodtl1_suff
      *
      *  Legger inn verdier i nøklene
      *
     c                   eval      w_firm = p_firm
     c                   eval      lohel1_numm = p_numm
     c                   eval      lohel1_suff = p_suff
     c                   eval      lohelu_numm = p_numm
     c                   eval      lohelu_suff = p_suff
     c                   eval      lodtl1_numm = p_numm
     c                   eval      lodtl1_suff = p_suff
      *
     c                   endsr
