     H/TITLE  ASLAGR: Utskrift av Pakkseddel
pdf  h option(*nodebugio) datedit(*dmy.) decedit('0.')
pdf  h DftActgrp(*No) BndDir('CGIDEV2/CGIDEV2')
pdf   /copy hspecsbnd
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      * Program . . . . : LO930R                                        *
      * Beskrivelse . . : Utskrift av Pakkseddel m/priser og linjesum   *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      * Spesialversjon. :                                               *
      * Tilpasset for . :                                               *
      *                                                                 *
      * Referanse  Dato   Endringsbeskrivelse                      Sign.*
      * --------- ------  ----------------------------------------------*
      *    R2.02  220497  Harmonisert mot Versjon 1.01 av ASOKON        *
      *                                                                 *
      *    R2.04  080499  Lagt inn linjesum for utskrift                *
6.10  * R6.10 070909 BSA  Utskriften endret pga utvidelse av referansefelter.
pdf   * R6.10 120710 BSA  Lagt inn funksjonalitet for eksport til XML   *
pdf   *                   format for videre arkivering og utskrift.     *
6.11  * R6.10 270910 bsa  Tillegg av faste tagger. Display tag + ordrenummer
6.11  *                   hvis den finnes.
6.12  * R6.10 300910 bsa  Hvis konvtertering av spesialtegn, legges til flere tegn
6.12  *                   som kan gjøre at noen av disse faller utenfor pga av felt-
6.12  *                   lengde.
6.13  * R6.10 071010 bsa  Legger inn test om gyldig utkø. Hvis ikke, legger vi ikke
6.13  *                   ut "printer kommand" tagger.
6.14  * R6.10 151010 bsa  Feil med overflow hvis std utskrift.
6.15  * R6.10 041110 bsa  Div. manglende info.
6.16  * R6.10 040111 bsa  Slå sammen tekstlinje 1 og 2 på samme linje
6.17  * R6.10 210111 bsa  Kaller eget program for scann av tegn.
6.18  * R6.10 210111 bsa  Glemt streng for scann
6.20  * R6.10 231110 nho  Proj er nå alfa
6.21  * R6.20 100511 bsa  Legger ut rutinetekst som metatagg.
6.22  * R6.10 160311 bsa  Ved valg av *ARKIV som skriver skal den kun arkiveres
6.23  * R6.10 130511 bsa  Mangler scann av strenger på mail
6.24  * R6.20 280312 bsa  Håndetring av "space" mellom tekst 1 og 2 ved tekstlinjer
6.25  * R6.20 290512 bsa  Håndterer riktig MVA ifbm organisasjonsnr.
6.26  * R6.20 200612 bsa  Bruker feil prosjektfelt som parameter.
6.27  * R6.20 030712 bsa  Strukturendring av og nye xml tagger
6.28  * R6.20 120912 bsa  Tekstlinje 1 kommer to ganger
6.29  * R6.20 251012 bsa  Må hente medianavn, og ikke skuffnummer
6.2A  * R6.20 041212 bsa  Legger ut nytt unikt refno, utvidet metatagger
6.2B  * R6.20 040113 bsa  Endrer logikken for oppbygging av refno
6.2C  * R6.20 060613 bsa  Bruker feil kode som parameter i FO798R
6.2D  * R6.20 180913 bsa  Scanner emnefeltet på mail etter ugyldige tegn
6.2E  * R6.20 201113 bsa  Scanner lev.varenummer
6.2F  * R6.20 140415 bsa  0 stiller minne for gjenbruk av XML info
6.2g  * R6.20 301115 bsa  Ikke overstyr med kundeinfo hvis kundenummer
6.2g  *                   er lik kontantkunde.
6.nu  * r6.30 050614 bof  endring i forb. nummerutvidelse
6.30  * R6.30 150914 bsa  Utvidet parameterliste til FO798R. Håndtering av
6.30  *                   flere mailfelter.
6.31  * 6.30  051214 Bsa  Henter mail og webadresser fra firma eller avdeling
6.32  * 6.30  280115 bsa  Skriver til datakø for å trigge java sniffer
6.33  * 6.30  040915 bsa  Legger ut avdeling som tagg for arkiveringsformål.
6.34  * 6.30  300718 bsa  Feil i varetekst 2.
6.35  * 6.30  021118 bsa  Feil i loop for utskrift av tekst
      *
8.01  *K0000  281021 bsa  Scanner ekstra felt.
8.02  *K0000  170322 bsa  Scanner flere tekster.
8.03  *K0000  130622 bsa  Scanner flere tekster etter ugyldige tegn.
8.04  *K000   120924 bsa  Endrer arkiveringsreferanse.
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     FLPSOL1    IPE  E             DISK    RENAME(LPSOPFR:LPSOL1R)
     FLSTSL1    IF   E           K DISK    RENAME(LSTSPFR:LSTSL1R)
     FVOTYL1    IF   E           K DISK    RENAME(VOTYPFR:VOTYL1R)
     FVLTYL1    IF   E           K DISK    RENAME(VLTYPFR:VLTYL1R)
     FFOHEL1    IF   E           K DISK    RENAME(FOHEPFR:FOHEL1R)
     FLOHEL1    IF   E           K DISK    RENAME(LOHEPFR:LOHEL1R)
     FLODTL1    IF   E           K DISK    RENAME(LODTPFR:LODTL1R)
     FLOTXL1    IF   E           K DISK    RENAME(LOTXPFR:LOTXL1R)
     FVVARL1    IF   E           K DISK    RENAME(VVARPFR:VVARL1R)
     Frlevl1    IF   E           K DISK    RENAME(RLEVPFR:rlevl1R)
     Frkunl1    IF   E           K DISK    RENAME(RKUNPFR:rkunl1R)
     FAFIRL1    IF   E           K DISK    RENAME(AFIRPFR:AFIRL1R)
     FAFORL1    IF   E           K DISK    RENAME(AFORPFR:AFORL1R)
5.34 ffvlsl1    if   e           k disk    rename(fvlspfr:fvlsl1r)
6.2g fbstsl1    if   e           k disk    rename(bstspfr:bstsl1r)
6.27 fra09l1    if   e           k disk    rename(ra09pfr:ra09l1r)
6.27 fra07pf    if   e           k disk
      *
     FLO930P    O    E             PRINTER
      *
      * - - - - - - - - - - - - - - - -
      * Datastruktur for foretaksnummer
      * - - - - - - - - - - - - - - - -
      *
     D                 DS
     D  DSFFTX                 1     30
     D  DSFF01                 1      8
     D  DSFF02                 9     11
     D  DSFF03                12     21
     D  DSFF04                22     25
     D  DSFF05                22     25
      *
      * - - - - - - - - - - - - - -
      * Henter inn data fra LDA
      * - - - - - - - - - - - - - -
      *
     D                UDS
pdf  d l_poff                584    584
6.22 d l_utqm                585    594
pdf  d l_bach                595    635
pdf  d l_arch                636    636  0
pdf  d l_skje                637    637  0
pdf  d l_land                638    638  0
pdf  d l_exlp                639    639  0
pdf  d l_mail                640    640  0
6.31 d l_prfi                750    750  0
pdf  D  l_ruti               800    809
pdf  d  l_outq               810    819
6.15 d l_copy                838    843  0
     D  DSALIN               856    858  0
pdf  d  l_wsid               901    910
pdf  d  l_user               911    920
pdf  d  l_filg               931    933
pdf  d  l_firm               944    946  0
6.33 d  l_avde               947    950  0
5.34  *
5.34  * Definering av variabler i nøkler
5.34  *
5.34 d fvlsl1_numm     s                   like(fvnumm)
5.34 d fvlsl1_suff     s                   like(fvsuff)
5.34 d fvlsl1_line     s                   like(fvline)
6.27 d ra09l1_ikod     s                   like(raikod)
6.27 d ra07pf_avde     s                   like(ragkod)
pdf   *
pdf   * Definering av parametre
pdf   *
pdf  d p_serv          s             35
pdf  d p_stat          s              1
pdf  d p_mail          s              1
pdf  d p_kund          s              6  0
6.26 d p_kpro          s              6  0
6.26 d*p_kpro          s              6
6.nu d p_numm          s              8  0
6.30 d p_suff          s                   like(losuff)
pdf  d p_selg          s              4  0
pdf  d p_kule          s              1
pdf  d p_navn          s             30
pdf  d p_emal          s             50
pdf  d p_ema2          s             50
6.30 d p_ema3          s             50
6.30 d p_kopi          s             50
pdf  d p_emne          s             50
pdf  d p_txt1          s             50
pdf  d p_txt2          s             50
pdf  d p_txt3          s             50
pdf  d p_txt4          s             50
pdf  d p_pers          s             50
pdf  d p_inif          s             40
pdf  d p_in03          s              1
6.13 d p_ok            s              1
6.17 d p_lr            s              1
6.17 d p_str_in        s            512
6.17 d p_str_out       s            512
6.32 d p_filg          s             10
6.32 d p_xmlf          s            256
pdf   *
pdf  d b_pdfp          s              1    inz(*off)
pdf  d b_topt          s              1    inz(*off)
pdf  d b_bott          s              1    inz(*off)
pdf  d x_numm          s             15
pdf  d x_vref          s             25
pdf  d x_betb          s             42
pdf  d w_bdat          s               d   datfmt(*iso)
pdf  d w_date          s               d   datfmt(*iso)
pdf  d w_kode          s              1
pdf  d w_firm          s                   like(fofirm)
pdf  d w_fell          s              6
pdf  d w_type          s              2
pdf  d w_fast          s             10
pdf  d w_ruti          s             10
6.nu d w_numm          s              8  0
pdf  d w_pdf           s              1  0
pdf  d w_jnav          s             15
pdf  d w_jkey          s             41
pdf  d w_txt           s             35
pdf  d w_pdf_ds        s            512
pdf  d w_mtxt          s            200
pdf  d w_spol          s              5
pdf  d w_land          s              9
pdf  d w_jstat         s              2  0
pdf  d w_jtext         s            200
pdf  d w_str_in        s            512
pdf  d w_str_out       s            512
pdf  d w_x             s              3  0
pdf  d w_path          s            256
pdf  d w_emal          s             50
6.11 d w_dspl          s            250
6.17 d w_tek1          s            512
6.17 d w_tek2          s            512
6.16 d w_tek0          s            512
6.18 d w_1dref         s            512
6.18 d w_1vref         s            512
6.12 d w_1fnav         s             50
6.12 d w_1fad1         s             50
6.12 d w_1fad2         s             50
6.12 d w_1navn         s             50
6.12 d w_1gate         s             50
6.12 d w_1adr2         s             50
6.12 d w_2navn         s             50
6.12 d w_2adr1         s             50
6.12 d w_2adr2         s             50
6.15 d w_copy          s              3  0
6.23 d w_ptxt1         s             75
6.23 d w_ptxt2         s             75
6.23 d w_ptxt3         s             75
6.23 d w_ptxt4         s             75
6.23 d w_ppers         s             75
6.2D d w_pemne         s             75
6.18 d w_rekv          s             50
6.23 d crlf            c                   const(X'0d25')
6.27 d w_lmtx          s             50
6.27 d w_lbtx          s             50
6.27 d w_ddeno         s                   like(ragkod)
6.27 d w_dnavn         s             50
6.27 d w_dadr1         s             50
6.27 d w_dadr2         s             50
6.27 d w_dpcde         s                   like(ragpnr)
6.27 d w_dpstd         s             50
6.27 d w_dphon         s                   like(ragtlf)
6.27 d w_dfaxn         s                   like(ragfax)
6.27 d w_ldat          s              6  0
6.27 d w_lddt          s              6  0
6.29 d w_draw1         s             25
6.29 d w_draw2         s             25
6.29 d w_skuf          s             25
6.29 d w_dtray         s             10
6.29 d w_gtray         s             10
6.2A d w_refn          s             50
6.2E d w_lvar          s             50
6.31 d w_mail          s             50
6.31 d w_weba          s             50
8.01 d w_2sted         s            100
8.02 d w_e1text        s            200
8.03 d w_1fste         s            100
8.03 d w_1sted         s            100
pdf   *
pdf  d XML_Output      s            256a   Varying
pdf  d XML_path        s            256a   Varying
pdf  d                                     Inz('/home/asp/print/adb')
pdf  d jasper_mal      s            256a   inz('file:/home/asp/print/maler/+
pdf  d                                     ink_pakks/INK_PAKKSEDDEL.jasper')
pdf  d jasper_logo     s            256a   Varying
pdf  d tmpdate         s               D
pdf  d tmptime         s               T
pdf   *
pdf  d d_pdf_ds        ds
pdf  d  d_xmlm                       75
pdf  d  d_jasm                       75
pdf  d  d_logo                       75
pdf  d  d_path                      100
pdf  d  d_emal                       50
6.32 d  d_fifo                       75
6.32 d  d_kopi                        1
6.32 d  d_dtaq                        1
6.32 d  d_sign                        1
pdf   /copy prototypeb
pdf   /copy usec
      *
     I/EJECT
     ILPSOL1R       01
     I                                          LKSSRT        L4
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av formater                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede formater
      * - - - - - - - - - -
      *
      * A1HDR  - Heading A1 på rapport
      * A4HDR  - Heading A4 på rapport, Bestillingshode over varelinje
      * D1DET  - Detail  D1 på rapport, Varelinje
      * E1DET  - Detail  E1 på rapport, Tekstlinje
      * O1DET  - Detail  O1 på rapport, Overføring til/fra neste side
      * T1TOT  - Total   T1 på rapport
      *
      *
      * Forklaring på variabler
      * - - - - - - - - - - - -
      *
      * D1ANT0 - Antall med 0 desimaler
      * D1ANT1 - Antall med 1 desimaler
      * D1ANT2 - Antall med 2 desimaler
      * D1ANT3 - Antall med 3 desimaler
      * D1NPRI - Netto  pris
      * D1BPRI - Brutto pris
      *
      *
      * D1RABP - Rabatt i prosent (Sum prosent 1 og 2)
      * D1RABB - Rabatt i beløp
      * D1SBEL - Sum linjebeløp
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Styre-rutine                                                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Initierings-rutine
      *
     C   01FCYCLE        CASEQ     *ZERO         XSTRSR
     C                   ENDCS
      *
      * Bestillingshode
      *
     C     LKSKOD        CABEQ     'H'           TAG01
      *
      * Varelinje
      *
     C     LKSKOD        CABEQ     'V'           TAG02
      *
      * Kommentar/
      * tekstlinje
      *
     C     LKSKOD        CABEQ     'K'           TAG03
      *
      * Ferdig
      *
     C                   GOTO      XSLUTT
      *
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A1HDR Behandle heading A1                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG01         TAG
      *
      * Hent bestillings-heading
      *
     C                   MOVE      LKSONR        WWNUMM
     C                   MOVE      LKSSUF        WWSUFF
     C     KEY01         CHAIN     LOHEL1R                            61
      *
     c                   eval      a1bdat = 0
     c                   eval      a1ldat = 0
     c                   eval      a1vdat = 0
      *
     c                   if        lobdat <> *loval
     c     *dmy          move      lobdat        a1bdat
     c                   endif
      *
     c                   if        loldat <> *loval
     c     *dmy          move      loldat        a1ldat
6.27 c     *dmy          move      loldat        w_ldat
     c                   endif
     c                   if        lomoda <> *loval
     c     *dmy          move      lomoda        a1ldat
     c                   endif
      *
     c                   if        lovida <> *loval
     c     *dmy          move      lovida        a1vdat
     c                   endif
      *
      * Legg inn bestillingsnummer
      *
     C                   MOVE      LONUMM        A1NUMM
     C                   MOVEL     '/'           A1SUFF
     C                   MOVE      LOSUFF        A1SUFF
      *
      * Flere bestillinger på samme
      * blankett ?
      *
     C  NL4              GOTO      TAG01A
      *
      * Hente inn leverandør-register
      *
     C                   MOVE      LOLDOR        WWKUND
     C     KEY04         CHAIN     rlevl1R                            64
     C                   MOVE      LOLDOR        A1LDOR
     C                   MOVE      RLNAVN        A1NAVN
     C                   MOVE      RLGATE        A1GATE
     C                   MOVE      RLADR2        A1ADR2
     C                   MOVE      RLSTED        A1STED
      *
      * Sjekke engangs-leverandøren
      *
     C     LOLDOR        IFEQ      W0LDOR
     C                   MOVE      LOLELE        LOLDOR
     C                   MOVE      LONAVN        A1NAVN
     C                   MOVE      LOADR1        A1GATE
     C                   MOVE      LOADR2        A1ADR2
     C                   MOVE      LOSTED        A1STED
     C                   MOVE      *ZERO         LOLELE
     C                   MOVE      *BLANK        LONAVN
     C                   MOVE      *BLANK        LOADR1
     C                   MOVE      *BLANK        LOADR2
     C                   MOVE      *BLANK        LOSTED
     C                   END
      *
      * Finner hvilken mva-sats
      * som skal benyttes
      *
     c                   call      'FÅ705R'
     c                   parm                    wwfirm
     c                   parm                    lobdat
     c                   parm                    WPMVAS
     c                   parm                    WPMVAT
     c                   parm                    WPMVAF
      *
      * Er det registrert
      * leveringsadresse?
      *
     C                   MOVE      *OFF          *IN31
     C     LONAVN        IFNE      *BLANK
     C                   MOVE      *ON           *IN31
     C                   MOVE      LONAVN        A2NAVN
     C                   MOVE      LOADR1        A2ADR1
     C                   MOVE      LOADR2        A2ADR2
     C                   MOVE      LOSTED        A2STED
     C                   ENDIF
      *
      * Er dette en kundeordre som er plukket til bestilling,
      * i så fall legg kundens navn og adresse til leveringsadresse.
      *
     C                   MOVE      *OFF          *IN36
     C                   MOVE      *BLANK        A2DREF
     C     LOORNR        IFNE      *ZERO
     C                   MOVE      LOORNR        WWORNU
     C                   MOVE      LOORSU        WWORSU
     C     KEY13         CHAIN     FOHEL1R                            73
     C     *IN73         IFEQ      *OFF
     C                   MOVE      FOKUND        WWKKUN
     C     KEY14         CHAIN     rkunl1R                            74
     C     *IN74         IFEQ      *OFF
6.2g  *
6.2g  * Hvis kundenummer tilsvarer kontantkunde, behold levringsadressen
6.2g  *
6.2g c                   if        rkkund <> baakun
     C                   MOVE      *ON           *IN31
     C                   MOVE      RKNAVN        A2NAVN
     C                   MOVE      RKGATE        A2ADR1
     C                   MOVE      RKADR2        A2ADR2
     C                   MOVE      RKSTED        A2STED
     C     FODREF        IFNE      *BLANK
     C                   MOVE      *ON           *IN36
     C                   MOVE      FODREF        A2DREF
     C                   ENDIF
6.2g c                   else
6.2g c                   eval      a2navn = fonavn
6.2g c                   eval      a2adr1 = foadr1
6.2g c                   eval      a2adr2 = foadr2
6.2g c                   eval      a2sted = fosted
6.2g c                   endif
     C                   ENDIF
     C                   ENDIF
     C                   ENDIF
      *
      * Er det registrert
      * leveringsdato?
      *
     C                   MOVE      *OFF          *IN32
     C     LOLDAT        IFNE      *loval
     C                   MOVE      *ON           *IN32
     C                   ENDIF
      *
      * Er det registrert
      * leverandørens referanse?
      *
     C                   MOVE      *OFF          *IN33
     C     LODREF        IFNE      *BLANK
     C                   MOVE      *ON           *IN33
     C                   MOVE      LODREF        A1DREF
     C                   ENDIF
      *
      * Er det registrert
      * leveringsmåte?
      *
     C                   MOVE      *OFF          *IN34
     C     LOLMTX        IFNE      *BLANK
     C                   MOVE      *ON           *IN34
     C                   MOVE      LOLMTX        A1LMTX
     C                   ENDIF
      *
      * Er det registrert
      * rekvisisjon?
      *
     C                   MOVE      *OFF          *IN35
     C     LOREKV        IFNE      *BLANK
     C                   MOVE      *ON           *IN35
     C                   MOVE      LOREKV        A1REKV
     C                   ENDIF
      *
      * Er det registrert
      * ordrenummer?
      *
     C                   MOVE      *OFF          *IN38
     C     LOORNR        IFNE      *ZERO
     C                   MOVE      *ON           *IN38
     C                   MOVE      LOORNR        A1ORNR
     C                   ENDIF
      *
      * Flytte øvrige felter
      *
     C                   MOVE      LOREKV        A1REKV
     C                   MOVE      LOINNK        A1INNK
     C                   MOVE      LOBETB        A1BETB
     C                   MOVE      LOVREF        A1VREF
6.27  * Hent inn selgerinfo
6.27 c                   if        loinnk <> 0
6.27 c                   eval      ra09l1_ikod = loinnk
6.27 c     ra09l1_key    chain     ra09l1
6.27 c                   endif
6.27  * Hent inn avdelingsinfo - uavhengig av om dette ligger i firmatagger
6.27 c                   exsr      hnt_avde
      *
      * Skrive heading
      *
pdf  c                   if        b_pdfp = *off
     C                   Z-ADD     0             WLTELL
     C                   WRITE     A1HDR
pdf  c                   else
pdf   * Vi skriver til XML taggene for heading
pdf  c                   exsr      xml_head
pdf  c                   endif
      *
      * Skriv heading over
      * varelinjer
      *
     C     VAOSAM        IFEQ      1
pdf  c                   if        b_pdfp = *off
     C                   ADD       2             WLTELL
     C                   WRITE     A4HDR                                30
pdf  c                   endif
     C                   ENDIF
      *
     C                   GOTO      XSLUTT
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Heading U/L4-brudd                                              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG01A        TAG
      *
      * Skriv heading over
      * varelinjer
      *
pdf  c                   if        b_pdfp = *off
     C     VAOSAM        IFEQ      1
     C                   ADD       2             WLTELL
     C                   WRITE     A4HDR                                30
     C                   ENDIF
pdf  c                   endif
      *
     C                   GOTO      XSLUTT
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * D1DET Behandle detail D1                                        *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG02         TAG
      *
      * Nullstilling av variabler
      *
      *
     C                   MOVE      *BLANK        D1VARE
     C                   MOVE      *BLANK        D1TEK1
     C                   MOVE      *BLANK        D1TEK2
     C                   MOVE      *BLANK        D1ENH1
     C*
     C                   MOVE      *ZERO         D1ANT0
     C                   MOVE      *ZERO         D1ANT1
     C                   MOVE      *ZERO         D1ANT2
     C                   MOVE      *ZERO         D1ANT3
     C                   MOVE      *OFF          *IN44
     C                   MOVE      *OFF          *IN46
      *
     C                   MOVE      LKSONR        WWNUMM
     C                   MOVE      LKSSUF        WWSUFF
     C                   MOVE      LKSLIN        WWLINE
     C     KEY02         CHAIN     LODTL1R                            62
      *
      * Hent linje-type
      *
     C                   MOVE      LDLTYP        WWLTYP
     C     KEY08         CHAIN     VLTYL1R                            68
      *
      * Sjekker om linjen ikke skrives på ordretypen
      *
     C     LOOTYP        CABEQ     VALO01        XSLUTT
      *
     C     LOOTYP        CABEQ     VALO02        XSLUTT
      *
     C     LOOTYP        CABEQ     VALO03        XSLUTT
      *
     C     LOOTYP        CABEQ     VALO04        XSLUTT
      *
      * Sjekker om tekstlinjer
      *
     C     VALKTX        CABEQ     1             TAG02A
      *
      * Oppslag mot vareregister
      *
     C                   MOVE      LDVARE        WWVARE
     C     KEY11         CHAIN     VVARL1R                            69
      *
      * Test på antall desimaler
      *
     C                   if        ldlvre = 0
     C     VVDESI        COMP      0                                      40
     C     VVDESI        COMP      1                                      41
     C     VVDESI        COMP      2                                      42
     C     VVDESI        COMP      3                                      43
     C   40              Z-ADD     LDANTA        D1ANT0
     C   41              Z-ADD     LDANTA        D1ANT1
     C   42              Z-ADD     LDANTA        D1ANT2
     C   43              Z-ADD     LDANTA        D1ANT3
     c                   else
     c                   z-add     ldanta        d1ant2
     c                   eval      *in42 = *on
     c                   endif
      *
      * Varelinje - bruk eget varenr
      *
     C                   movel     ldvare        d1vare
      *
     C                   MOVE      LDTEK1        D1TEK1
     C                   MOVE      LDENH1        D1ENH1
     C                   Z-ADD     LDIPNY        D1BPRI
      *
      * Beregne snittrabatt
      *
     C     100           SUB       LDRAB1        W1RAB1
     C                   MULT      LDRAB2        W1RAB1
     C                   DIV       100           W1RAB1
     C                   ADD       LDRAB1        W1RAB1
      *
      * Skal mva. beregnes ?
      *
     C     AFMVAK        IFEQ      1
     C                   MOVE      *ON           *IN37
     C     LDIPNY        MULT      WPMVAT        D1BPRI
     C                   ENDIF
      *
      * Beregne linjesum og akkumuler totalsum.
      *
     C     D1BPRI        MULT      LDANTA        D1BELP
     C                   ADD       D1BELP        T1TOTL
      *
      * Skriv varelinjer
      *
     C     TAG02A        TAG
pdf  c                   if        b_pdfp = *off
     C                   ADD       2             WLTELL
     C     VALKTX        IFNE      1
      *
     C     LDLVAR        IFNE      *BLANK
     C                   MOVE      LDLVAR        D0VARE
     C                   WRITE     D0DET                                30
     C                   END
     c     *in30         caseq     *on           xovrfl
     c                   endcs
      *
     C                   WRITE     D1DET                                30
     c     *in30         caseq     *on           xovrfl
     c                   endcs
      *
      * Sjekk om lengde spesifikasjon
      *
     c                   exsr      len_spec
      *
     C                   ELSE
     C                   MOVE      LDTEK1        D1TEK1
     C                   MOVE      LDTEK2        D1TEK2
     C                   MOVE      *ON           *IN44
     C                   WRITE     D2DET                                30
     C                   END
pdf   * Skriver XML tagger for detaljer
pdf  c                   else
pdf  c                   exsr      len_spec
pdf  c                   exsr      xml_deta
pdf  c                   endif
      *
      * Er det overflow ?
      *
     C     *IN30         CASEQ     *ON           XOVRFL
     C                   ENDCS
      *
     C                   GOTO      XSLUTT
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Behandling av tekstlinjer                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG03         TAG
      *
     C                   MOVE      LKSONR        WWNUMM
     C                   MOVE      LKSSUF        WWSUFF
     C                   MOVE      LKSLIN        WWLINE
     C     KEY03         CHAIN     LOTXL1R                            63
      *
      * Gå ut dersom det
      * ikke er oppsamling,
      * og linje-nummer er
      * større enn 5000.
      * Da skal print fore-
      * gå tilslutt på L4.
      *
     C     VAOSAM        IFEQ      0
     C     LKSLIN        IFGE      5000
     C                   GOTO      XSLUTT
     C                   END
     C                   ENDIF
      *
     C                   MOVEL     LTTEXT        E1TEXT
pdf  c                   if        b_pdfp = *off
     C                   ADD       1             WLTELL
     C                   WRITE     E1DET                                30
      *
      * Er det overflow ?
      *
     C     *IN30         CASEQ     *ON           XOVRFL
     C                   ENDCS
pdf   * Skriver XML tagger for tekstlinjer
pdf  c                   else
pdf  c                   if        b_topt = *off
pdf  c                   exsr      xml_topt_str
pdf  c                   eval      b_topt = *on
pdf  c                   endif
pdf  c                   exsr      xml_topptxt
pdf  c                   endif
      *
     C     XSLUTT        TAG
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * T1TOT Behandle total T1                                         *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Finne ut om det er
      * plass til å skrive
      * avslutning uten å
      * skifte til ny side
      * først.
      *
      * Trekker ut heading
      *
     CL4   DSALIN        SUB       25            WLTEST
      *
      * Trekker ut antall
      * linjer skrevet
      *
     CL4                 SUB       WLTELL        WLTEST
      *
      * Trekker ut plassbehov
      * for avslutning
      *
     CL4                 SUB       15            WLTEST
      *
      * Skrive ny heading ?
      *
pdf  cl4                 if        b_pdfp = *off
     CL4   WLTEST        IFLT      0
     CL4                 WRITE     A1HDR
     CL4                 Z-ADD     0             WLTELL
     CL4                 ENDIF
      *
      * Skrive totalsum
      *
     CL4                 WRITE     T1TOT                                30
pdf  cl4                 else
pdf  cl4                 exsr      xml_total
pdf  cl4                 endif
     CL4                 Z-ADD     0             T1TOTL
      *
      * Skrive tekstlinjer
      * dersom det ikke er
      * oppsamling og linje
      * nummer er større enn
      * 5000.
      *
     CL4   VAOSAM        IFEQ      0
     CL4                 MOVE      LKSONR        WWNUMM
     CL4                 MOVE      LKSSUF        WWSUFF
     CL4                 Z-ADD     5000          WWLINE
     CL4   KEY03         SETLL     LOTXL1R
     CL4                 READ      LOTXL1R                                63
     CL4   *IN63         CABEQ     *ON           TAG99
      *                                                                 .
     CL4   WWNUMM        DOWEQ     LTNUMM
     CL4   WWSUFF        IFEQ      LTSUFF
      *                                                               . .
     CL4                 MOVEL     LTTEXT        E1TEXT
pdf  cl4                 if        b_pdfp = *off
     CL4                 ADD       1             WLTELL
     CL4                 WRITE     E1DET                                30
      *                                                               . .
      * Er det overflow ?                                             . .
      *                                                               . .
     CL4   *IN30         IFEQ      *ON
     CL4                 WRITE     A1HDR
     CL4                 Z-ADD     0             WLTELL
     CL4                 ENDIF
pdf   * Skriver XML tagger for tekstlinjer
pdf  cl4                 else
pdf  cl4                 if        b_bott = *off
pdf  cl4                 exsr      xml_bott_str
pdf  cl4                 eval      b_bott = *on
pdf  cl4                 endif
pdf  cl4                 exsr      xml_bunntxt
pdf  cl4                 endif
      *                                                               . .
6.35 CL4                 ENDIF
     CL4                 READ      LOTXL1R                                63
     CL4   *IN63         CABEQ     *ON           TAG99
6.35 C**L4                 ENDIF
     CL4                 ENDDO
     CL4                 ENDIF
      *
     CL4   TAG99         TAG
pdf   * Hvis xml gen, må vi kvittere med siste vanlige linjetag
pdf  cl4                 if        b_pdfp = *on
pdf  cl4                 exsr      xml_endpackl
pdf  cl4                 endif
pdf   *
pdf  cl4                 if        b_pdfp = *on
pdf   * Skriv xml fila på disk
pdf  cl4                 exsr      xml_end
pdf   * Hvis forhåndvisning må vi kjøre linken
pdf  cl4                 if        l_skje = 1 and
pdf  c                             l_bach = w_jkey
pdf  cl4                 exsr      pdf_preview
pdf  cl4                 endif
pdf   * Avslutt jobbiden
pdf  cl4                 call      'AB710R'
pdf  cl4                 parm                    l_bach
pdf   *
pdf   * Hvis utskrift av nytt tilbud må vi finne ny id til xml og java
pdf  cl4                 if        *inlr = *off
pdf   *
pdf  cl4                 eval      w_kode = '0'
pdf  cl4                 eval      w_firm = l_firm
pdf  cl4                 eval      w_fell = 'NXTKLI'
pdf  cl4                 eval      w_type = *blank
pdf  cl4                 eval      w_fast = *blank
pdf  cl4                 eval      w_numm = *zero
pdf   *
pdf  cl4                 call      'AS100R'
pdf  cl4                 parm                    w_kode
pdf  cl4                 parm                    w_firm
pdf  cl4                 parm                    w_fell
pdf  cl4                 parm                    w_type
pdf  cl4                 parm                    w_fast
pdf  cl4                 parm                    w_numm
pdf   *
pdf  cl4                 eval      w_jnav = 'PDF' + %char(w_numm)
pdf  cl4                 eval      w_jtext = 'Utskrift av innkommende pakksedde+
pdf  c                                       l har startet'
pdf  cl4                 call      'AB700R'
pdf  cl4                 parm                    w_jnav
pdf  cl4                 parm                    w_jkey
pdf  cl4                 parm                    w_txt
pdf   * Vi logger at utskriftprogrammet har startet
pdf  cl4                 eval      w_jstat = 10
pdf  cl4                 eval      w_jtext = 'Utskrift av innkommende pakksedde+
pdf  c                                       l har startet'
pdf  cl4                 call      'AB705R'
pdf  cl4                 parm                    l_bach
pdf  cl4                 parm                    w_jstat
pdf  cl4                 parm                    w_jtext
pdf   * Vi skriver xml for miljø formater
pdf  cl4                 exsr      xml_envm
pdf  cl4                 endif
pdf  cl4                 endif
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for overflow                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     XOVRFL        BEGSR
      *
pdf  c                   if        b_pdfp = *off
     C                   WRITE     A1HDR
pdf  c                   endif
      *
     C                   Z-ADD     0             WLTELL
6.14 C                   eval      *in30 = *off
      *
     C                   ENDSR
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for lengde spesifikasjon
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     len_spec      begsr
      *
5.34 c                   eval      fvlsl1_numm = ldornu
5.34 c                   eval      fvlsl1_suff = ldorsu
5.34 c                   eval      fvlsl1_line = ldorli
5.34 c     fvlsl1_key    setll     fvlsl1
5.34 c     fvlsl1_key    reade     fvlsl1
5.34  *
5.34 c                   dow       not %eof
5.34 c                   eval      e1text = %char(fvleng) + ' mm x ' +
5.34 c                                      %char(fvanta) + ' stk'
5.34  *
pdf  c                   if        b_pdfp = *off
5.34 c                   write     e1det                                30
5.34 c     *in30         caseq     *on           xovrfl
5.34 c                   endcs
pdf   * Vi skriver til XML taggene for lengdeinformasjon
pdf  c                   else
pdf  c                   exsr      xml_spec
pdf  c                   endif
5.34 c     fvlsl1_key    reade     fvlsl1
5.34 c                   enddo
      *
     c     end_spec      endsr
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for oppstart                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     XSTRSR        BEGSR
      *
     C                   Z-ADD     1             FCYCLE            1 0
      *
      * Legger inn firma i nøkkel
      *
     C                   MOVE      LKSFIR        WWFIRM
      *
      * Klargjøring dersom firma -
      * opplysninger skal printes ut
      *
     C     AFPRFI        IFEQ      1
     C     KEY06         CHAIN     AFIRL1R                            66
     C                   MOVE      AAFNAV        A1FNAV
     C                   MOVE      AAFAD1        A1FAD1
     C                   MOVE      AAFAD2        A1FAD2
     C                   MOVE      AAFSTE        A1FSTE
6.25 C                   if        l_poff = '1'
6.25 C*                  MOVE      'Foretak:'    DSFF01
6.25 C                   MOVE      'NO'          DSFF02
6.25 C                   MOVE      AAFFTN        DSFF03
6.25 C                   MOVE      ' MVA'        DSFF04
6.25 C                   eval      a1fftx = %trim(dsfftx)
6.25 C                   else
     C                   MOVE      'Foretak:'    DSFF01
     C                   MOVE      ' NO'         DSFF02
     C                   MOVE      AAFFTN        DSFF03
     C                   MOVE      ' MVA'        DSFF04
     C                   MOVE      DSFFTX        A1FFTX
6.25 C                   endif
     C                   MOVE      'Tlf/fax:'    A1TFAX
     C                   MOVE      AAFTLF        A1FTLF
     C                   MOVE      AAFFAX        A1FFAX
6.31 C                   eval      w_mail = aamail
6.31 C                   eval      w_weba = aaweba
     C                   ENDIF
      *
      * Hente Engangs-leverandør-nummer
      *
     C     KEY09         CHAIN     LSTSL1R                            69
      *
     C     *IN69         IFEQ      *OFF
     C                   MOVE      LAALEV        W0LDOR
     C                   END
      *
      * Slår opp ordretype
      *
     C                   MOVE      LKSOTY        WWOTYP
     C     KEY07         CHAIN     VOTYL1R                            67
      *
      * Er ordretype negativ ?
      *
     C     VAOKRE        IFEQ      '-'
     C                   MOVE      *ON           *IN36
     C                   ENDIF
      *
6.2g c     bstsl1_key    chain     bstsl1
      *
     C                   ENDSR
      *
     C/EJECT
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Miljø variabler         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_envm      begsr
pdf   * Hvis skjermvisning skal vi ikke lagre i spoolfile
pdf  c                   if        l_skje = 1
pdf  c                   eval      w_spol = 'true'
pdf  c                   else
pdf  c                   eval      w_spol = 'false'
pdf  c                   endif
pdf   *
pdf   /Free
pdf        // Finne nytt batch nummer
pdf            UpdHTMLVar('BatchNo':               w_jkey);
pdf            UpdHTMLVar('Batchtype':  'INNK_PAKKSEDDEL');
pdf            UpdHTMLVar('Username':              l_user);
pdf            WrtSection('Topp');
pdf        // Finn report command variabler
pdf            UpdHTMLVar('User':                l_user);
pdf            UpdHTMLVar('PW':                     ' ');
pdf            UpdHTMLVar('IPAdr':                  ' ');
pdf            UpdHTMLVar('Schema':        'ADB'+l_filg);
pdf            UpdHTMLVar('Companyno':    %char(l_firm));
6.33           UpdHTMLVar('Departmentnoarkiv': %char(l_avde));
pdf            WrtSection('Credential');
pdf        // Finn report command variabler
pdf            UpdHTMLVar('Jaspertemplate':      d_jasm);
pdf            UpdHTMLVar('Logo':           jasper_logo);
pdf            UpdHTMLVar('Keepspool':           w_spol);
pdf            WrtSection('ReportCommand');
pdf   /End-free
pdf   *
pdf   * Hvis skjermvisning skal ikke PDF skrives
pdf   *
pdf  c                   if        l_skje = 0 and
pdf  c                             l_mail = 0
6.22  * Hvis *ARKIV er valgt som skriver, skal det ikke skrives ut
6.22 c                   if        l_utqm <> '*ARKIV'
pdf   *
pdf  c                   if        l_land = 1
pdf  c                   eval      w_land = 'LANDSCAPE'
pdf  c                   else
pdf  c                   eval      w_land = 'PORTRAIT'
pdf  c                   endif
6.13  * Sjekk at valgt outq støttes av skriveren. Kan skli gjennom hvis
6.13  * jobben legges på jobbkø.
6.13 c                   eval      p_ok = '0'
6.13 c                   call      'AP612R'
6.13 c                   parm                    l_filg
6.13 c                   parm                    l_outq
6.13 c                   parm                    p_ok
6.13  * Hvis feil utkø, logges dette i transaksjonsloggen
6.13 c                   if        p_ok = '0'
6.13 c                   eval      w_jstat = 20
6.13 c                   eval      w_jtext = 'Ugyldig utkø '+ l_outq + ' er val+
6.13 c                             gt. Ingen utskrift er generert. Utskrift kan+
6.13 c                              arkiveres.'
6.13 c                   call      'AB705R'
6.13 c                   parm                    l_bach
6.13 c                   parm                    w_jstat
6.13 c                   parm                    w_jtext
6.13 c                   else
pdf   * Hent inn skuffinformasjon for skriveren
6.29 c                   eval      w_dtray = *blank
6.29 c                   eval      w_gtray = *blank
pdf  c                   call      'AP611R'
pdf  c                   parm                    l_filg
pdf  c                   parm                    l_outq
6.29 c                   parm                    w_dtray
6.29 c                   parm                    w_gtray
6.29  * Hent inn skuffinformasjon for skriveren - default inskuff
6.29 c                   eval      w_draw1 = *blank
6.29 c                   movel     w_dtray       w_skuf
6.29 c                   call      'AP614R'
6.29 c                   parm                    l_outq
6.29 c                   parm                    w_skuf
6.29 c                   parm                    w_draw1
6.18  *
6.18 c                   if        l_copy > 0
6.18 c                   eval      w_copy = l_copy
6.18 c                   else
6.18 c                   eval      w_copy = 1
6.18 c                   endif
pdf   *
pdf   /Free
pdf        // Finn print informasjon
pdf            UpdHTMLVar('Printername':         l_outq);
618            UpdHTMLVar('Copies':        %char(w_copy));
pdf            UpdHTMLVar('Papersource':        w_draw1);
pdf            UpdHTMLVar('Lastpagedrawer':         ' ');
pdf            UpdHTMLVar('Duplex':             'false');
pdf            UpdHTMLVar('Quality':                ' ');
pdf            UpdHTMLVar('Sorting':                ' ');
pdf            UpdHTMLVar('Staple':              'true');
pdf            UPDHTMLVar('Alignment':           w_land);
pdf            WrtSection('PrintCommand');
pdf   /End-free
6.13 c                   endif
6.22 c                   endif
pdf  c                   endif
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Heading                 *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_head      begsr
pdf   *
pdf  c                   eval      w_str_in = *blanks
pdf  c                   eval      w_str_out = *blanks
pdf  c                   eval      w_mtxt = *blanks
pdf  c                   eval      x_numm = %char(a1numm)+a1suff
pdf  c                   eval      x_vref = %char(loinnk)+' '+a1vref
pdf  c                   eval      x_betb = %char(a1betb)
pdf   *
pdf   * Hvis mail skal skrives, må vi hente mail informasjon
pdf   *
pdf  c                   if        l_mail = 1
6.2C c**                 eval      p_kule = 'K'
6.2C c                   eval      p_kule = 'L'
pdf  c                   eval      p_kund = loldor
6.26 c                   eval      p_kpro = 0
pdf  c                   eval      p_numm = lonumm
6.30 c                   eval      p_suff = losuff
pdf  c                   eval      p_selg = loinnk
pdf  c                   eval      p_in03 = *off
pdf   * Henter ut mailserver
pdf  c                   eval      p_serv = *blank
pdf  c                   eval      p_stat = *blank
pdf  c                   call      'AM705C'
pdf  c                   parm                    p_serv
pdf  c                   parm                    p_stat
pdf   *
pdf  c                   call      'FO798R'
pdf  c                   parm                    p_kule
pdf  c                   parm                    p_kund
pdf  c                   parm                    p_kpro
pdf  c                   parm                    p_numm
6.30 c                   parm                    p_suff
pdf  c                   parm                    p_selg
pdf  c                   parm                    p_navn
pdf  c                   parm                    p_emal
6.30 c                   parm                    p_ema2
6.30 c                   parm                    p_ema3
pdf  c                   parm                    p_emne
pdf  c                   parm                    p_txt1
pdf  c                   parm                    p_txt2
pdf  c                   parm                    p_txt3
pdf  c                   parm                    p_txt4
pdf  c                   parm                    p_pers
6.30 c                   parm                    p_kopi
pdf  c                   parm                    p_inif
pdf  c                   parm                    p_in03
6.2D  * Scann av strenger
6.2D  *
6.2D c                   eval      p_str_in = *blank
6.2D c                   eval      p_lr = '0'
6.2D c                   movel     p_emne        p_str_in
6.2D c                   call      'AP613R'
6.2D c                   parm                    p_str_in
6.2D c                   parm                    p_str_out
6.2D c                   parm                    p_lr
6.2D c                   movel     p_str_out     w_pemne
6.23  * Scann av strenger
6.23 c                   eval      p_str_in = *blank
6.23 c                   eval      p_lr = '0'
6.23 c                   movel     p_txt1        p_str_in
6.23 c                   call      'AP613R'
6.23 c                   parm                    p_str_in
6.23 c                   parm                    p_str_out
6.23 c                   parm                    p_lr
6.23 c                   movel     p_str_out     w_ptxt1
6.23  *
6.23 c                   eval      p_str_in = *blank
6.23 c                   eval      p_lr = '0'
6.23 c                   movel     p_txt2        p_str_in
6.23 c                   call      'AP613R'
6.23 c                   parm                    p_str_in
6.23 c                   parm                    p_str_out
6.23 c                   parm                    p_lr
6.23 c                   movel     p_str_out     w_ptxt2
6.23  *
6.23 c                   eval      p_str_in = *blank
6.23 c                   eval      p_lr = '0'
6.23 c                   movel     p_txt3        p_str_in
6.23 c                   call      'AP613R'
6.23 c                   parm                    p_str_in
6.23 c                   parm                    p_str_out
6.23 c                   parm                    p_lr
6.23 c                   movel     p_str_out     w_ptxt3
6.23  *
6.23 c                   eval      p_str_in = *blank
6.23 c                   eval      p_lr = '0'
6.23 c                   movel     p_txt4        p_str_in
6.23 c                   call      'AP613R'
6.23 c                   parm                    p_str_in
6.23 c                   parm                    p_str_out
6.23 c                   parm                    p_lr
6.23 c                   movel     p_str_out     w_ptxt4
6.23  *
6.23 c                   eval      p_str_in = *blank
6.23 c                   eval      p_lr = '0'
6.23 c                   movel     p_pers        p_str_in
6.23 c                   call      'AP613R'
6.23 c                   parm                    p_str_in
6.23 c                   parm                    p_str_out
6.23 c                   parm                    p_lr
6.23 c                   movel     p_str_out     w_ppers
6.23  *
6.23 c                   eval      w_mtxt = %trim(w_ptxt1) + crlf +
6.23 c                                      %trim(w_ptxt2) + crlf +
6.23 c                                      %trim(w_ptxt3) + crlf +
6.23 c                                      %trim(w_ptxt4) + crlf +
6.23 c                                      %trim(w_ppers)
6.23 c**                 eval      w_mtxt = p_txt1+p_txt2+p_txt3+p_txt4
pdf   *
6.30 c                   if        p_kopi = *blanks
6.30 c                   eval      p_kopi = d_emal
pdf  c                   endif
pdf   *
pdf  c                   if        p_in03 = *off
pdf   *
pdf   /Free
pdf        // Skriv mailinformasjon
6.30           WrtSection('MailCommandStart');
6.30       //  UpdHTMLVar('Receivers':           p_emal);
6.30           if %Trim(p_emal)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_emal);
6.30           WrtSection('MailReceiver');
6.30           endif;
6.30           if %Trim(p_ema2)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_ema2);
6.30           WrtSection('MailReceiver');
6.30           endif;
6.30           if %Trim(p_ema3)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_ema3);
6.30           WrtSection('MailReceiver');
6.30           endif;
pdf            UpdHTMLVar('CC':                     ' ');
6.30           UpdHTMLVar('BCC':                 p_kopi);
6.30           UpdHTMLVar('Sender':              p_kopi);
6.2D     //    UpdHTMLVar('Subject':             p_emne);
6.2D           UpdHTMLVar('Subject':             w_pemne);
pdf            UpdHTMLVar('Message':             w_mtxt);
pdf            UpdHTMLVar('SMTPServer':          p_serv);
pdf            UPDHTMLVar('SMTPUser':               ' ');
pdf            UPDHTMLVar('SMTPPw':                 ' ');
6.30     //    WrtSection('MailCommand');
6.30           WrtSection('MailCommandEnd');
pdf   /End-free
pdf  c                   endif
pdf  c                   endif
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Firma
6.12 c                   eval      w_1fnav = *blank
6.12 c                   eval      w_1fad1 = *blank
6.12 c                   eval      w_1fad2 = *blank
6.12 c                   eval      w_1navn = *blank
6.12 c                   eval      w_1gate = *blank
6.12 c                   eval      w_1adr2 = *blank
6.12 c                   eval      w_2navn = *blank
6.12 c                   eval      w_2adr1 = *blank
6.12 c                   eval      w_2adr2 = *blank
6.18 c                   eval      w_rekv = *blank
      *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a1fnav        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_1fnav
      *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a1fad1        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_1fad1
      *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a1fad2        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.12 c                   movel     p_str_out     w_1fad2
      * Vi må oversette aktuelle tekster til "xml" tegn - Partner
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a1navn        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_1navn
      *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a1gate        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_1gate
      *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a1adr2        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_1adr2
      *
6.19 c                   eval      p_str_in = *blank
6.19 c                   eval      p_lr = '0'
6.19 c                   movel     a1dref        p_str_in
6.19 c                   call      'AP613R'
6.19 c                   parm                    p_str_in
6.19 c                   parm                    p_str_out
6.19 c                   parm                    p_lr
6.19 c                   movel     p_str_out     w_1dref
      *
6.19 c                   eval      p_str_in = *blank
6.19 c                   eval      p_lr = '0'
6.19 c                   movel     a1vref        p_str_in
6.19 c                   call      'AP613R'
6.19 c                   parm                    p_str_in
6.19 c                   parm                    p_str_out
6.19 c                   parm                    p_lr
6.19 c                   movel     p_str_out     w_1vref
      *
6.18 c                   eval      p_str_in = *blank
6.18 c                   eval      p_lr = '0'
6.18 c                   movel     a1rekv        p_str_in
6.18 c                   call      'AP613R'
6.18 c                   parm                    p_str_in
6.18 c                   parm                    p_str_out
6.18 c                   parm                    p_lr
6.18 c                   movel     p_str_out     w_rekv
      * Avdelingsinformasjon - navn
6.27 c                   eval      p_str_in = *blank
6.27 c                   eval      p_lr = '0'
6.27 c                   movel     w_dnavn       P_str_in
6.27 c                   call      'AP613R'
6.27 c                   parm                    p_str_in
6.27 c                   parm                    p_str_out
6.27 c                   parm                    p_lr
6.27 c                   movel     p_str_out     w_dnavn
      * Avdelingsinformasjon - adresse
6.27 c                   eval      p_str_in = *blank
6.27 c                   eval      p_lr = '0'
6.27 c                   movel     w_dadr1       P_str_in
6.27 c                   call      'AP613R'
6.27 c                   parm                    p_str_in
6.27 c                   parm                    p_str_out
6.27 c                   parm                    p_lr
6.27 c                   movel     p_str_out     w_dadr1
      * Avdelingsinformasjon - adresse 2
6.27 c                   eval      p_str_in = *blank
6.27 c                   eval      p_lr = '0'
6.27 c                   movel     w_dadr2       P_str_in
6.27 c                   call      'AP613R'
6.27 c                   parm                    p_str_in
6.27 c                   parm                    p_str_out
6.27 c                   parm                    p_lr
6.27 c                   movel     p_str_out     w_dadr2
      * Avdelingsinformasjon - poststed
6.27 c                   eval      p_str_in = *blank
6.27 c                   eval      p_lr = '0'
6.27 c                   movel     w_dpstd       P_str_in
6.27 c                   call      'AP613R'
6.27 c                   parm                    p_str_in
6.27 c                   parm                    p_str_out
6.27 c                   parm                    p_lr
6.27 c                   movel     p_str_out     w_dpstd
8.03  * Firma - poststed
8.03 c                   eval      w_1fste  = *blanks
8.03 c                   eval      p_str_in = *blank
8.03 c                   eval      p_lr = '0'
8.03 c                   movel     a1fste        P_str_in
8.03 c                   call      'AP613R'
8.03 c                   parm                    p_str_in
8.03 c                   parm                    p_str_out
8.03 c                   parm                    p_lr
8.03 c                   movel     p_str_out     w_1fste
8.03  * Partner - poststed
8.03 c                   eval      w_1sted  = *blanks
8.03 c                   eval      p_str_in = *blank
8.03 c                   eval      p_lr = '0'
8.03 c                   movel     a1sted        P_str_in
8.03 c                   call      'AP613R'
8.03 c                   parm                    p_str_in
8.03 c                   parm                    p_str_out
8.03 c                   parm                    p_lr
8.03 c                   movel     p_str_out     w_1sted
pdf   /Free
pdf
pdf        // Skriv firmavariabler
6.21           UpdHTMLVar('Reporttext':            a1txt1);
6.12           UpdHTMLVar('CompanyName':          w_1fnav);
6.12           UpdHTMLVar('Companyadress1':       w_1fad1);
6.12           UpdHTMLVar('Companyadress2':       w_1fad2);
pdf            UpdHTMLVar('Companypostalcode':        ' ');
8.03      //   UpdHTMLVar('Companypostoffice':     a1fste);
8.03           UpdHTMLVar('Companypostoffice': %trim(w_1fste));
pdf            UpdHTMLVar('Companyphone':          a1ftlf);
pdf            UpdHTMLVar('Companyfax':            a1ffax);
615            UpdHTMLVar('Companyorgno':   %char(aafftn));
615            UpdHTMLVar('Companygiro':    %char(aafbgi));
6.31           UpdHTMLVar('Companyemail':   %trim(w_mail));
6.31           UpdHTMLVar('Companywebpage': %trim(w_weba));
6.27           WrtSection('Company');
6.27
6.27           UpdHTMLVar('Departmentno':    %char(loavde));
6.27           UpdHTMLVar('Departmentname':        w_dnavn);
6.27           UpdHTMLVar('Departmentadress1':     w_dadr1);
6.27           UpdHTMLVar('Departmentadress2':     w_dadr2);
6.27           UpdHTMLVar('Departmentpostalcode':      ' ');
6.27           UpdHTMLVar('Departmentpostoffice':  w_dpstd);
6.27           UpdHTMLVar('Departmentphone':       w_dphon);
6.27           UpdHTMLVar('Departmentfax':         w_dfaxn);
6.27           WrtSection('Department');
pdf
pdf            test(de) *dmy a1bdat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(a1bdat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Creationdate':   %char(tmpdate : *iso));
pdf            test(te) *hms a1time;
pdf            if %error;
pdf            tmptime = *loval;
pdf            else;
pdf            tmptime = %time(a1time : *hms);
pdf            endif;
pdf            UpdHTMLVar('Creationtime': %char(tmptime : *hms));
6.27           WrtSection('Creation');
pdf
pdf            UpdHTMLVar('Partnerno':      %char(a1ldor));
pdf            UpdHTMLVar('Partnercategory':%char(rlkatg));
6.12           UpdHTMLVar('Partnername':          w_1navn);
6.12           UpdHTMLVar('Partneradress1':       w_1gate);
6.12           UpdHTMLVar('Partneradress2':       w_1adr2);
pdf            UpdHTMLVar('Partnerpostalcode':        ' ');
8.03     //    UpdHTMLVar('Partnerpostoffice':     a1sted);
8.03           UpdHTMLVar('Partnerpostoffice': %trim(w_1sted));
pdf            UpdHTMLVar('Partnerphone':          rltlfn);
pdf            UpdHTMLVar('Partnercellphone':      rlmobn);
pdf            UpdHTMLVar('Partnerfax':            rltlfx);
pdf            UpdHTMLVar('Salesdocumentno':       x_numm);
6.19           UpdHTMLVar('Partnerrefname':       w_1dref);
pdf            UpdHTMLVar('Partnerrefphone':       fomobi);
pdf            UpdHTMLVar('Partnerrefmail':           ' ');
6.18           UpdHTMLVar('Requisitionno':         w_rekv);
pdf            WrtSection('Partner');
pdf
pdf        // Selger informasjon
pdf            UpdHTMLVar('Salesrefno':     %char(loinnk));
6.19      //   UpdHTMLVar('Salesrefname':          a1vref);
6.19           UpdHTMLVar('Salesrefname':         w_1vref);
6.27           UpdHTMLVar('Salesrefemail':         raiema);
6.27           UpdHTMLVar('Salesrefcellphone':     raimob);
pdf            WrtSection('SalesRef');
pdf   /End-free
pdf   *
pdf  c                   if        %trim(a2navn) <> *blank
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Prosjekt
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a2navn        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_2navn
      *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a2adr1        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_2adr1
      *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     a2adr2        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_2adr2
      *
6.27 c                   eval      p_str_in = *blank
6.27 c                   eval      p_lr = '0'
6.27 c                   movel     lolbtx        p_str_in
6.27 c                   call      'AP613R'
6.27 c                   parm                    p_str_in
6.27 c                   parm                    p_str_out
6.27 c                   parm                    p_lr
6.27 c                   movel     p_str_out     w_lbtx
8.01  *
8.01 c                   eval      w_2sted = *blank
8.01 c                   eval      p_str_in = *blank
8.01 c                   eval      p_lr = '0'
8.01 c                   movel     a2sted        p_str_in
8.01 c                   call      'AP613R'
8.01 c                   parm                    p_str_in
8.01 c                   parm                    p_str_out
8.01 c                   parm                    p_lr
8.01 c                   movel     p_str_out     w_2sted
pdf   *
pdf   /Free
pdf        // Prosjekt informasjon
pdf            UpdHTMLVar('Projectno':                '0');
6.12           UpdHTMLVar('Projectname':          w_2navn);
6.12           UpdHTMLVar('Projectadress1':       w_2adr1);
6.12           UpdHTMLVar('Projectadress2':       w_2adr2);
pdf            UpdHTMLVar('Projectpostalcode':        ' ');
8.01      //   UpdHTMLVar('Projectpostoffice':     a2sted);
8.01           UpdHTMLVar('Projectpostoffice':    w_2sted);
pdf            WrtSection('Project');
pdf   /End-free
pdf  c                   endif
pdf   /Free
6.27           UpdHTMLVar('Currency':              lovalk);
6.27           UpdHTMLVar('Discountcat':    %char(lorkat));
6.27           UpdHTMLVar('Agent':          %char(losped));
6.27           WrtSection('InfoHead1');

6.27           UpdHTMLVar('Deliverymethod':               w_lmtx);
6.27           test(de) *dmy w_ldat;
6.27           if %error;
6.27           tmpdate = *loval;
6.27           else;
6.27           tmpdate = %date(w_ldat : *dmy);
6.27           endif;
6.27           UpdHTMLVar('Deliverydate':   %char(tmpdate : *iso));
6.27           UpdHTMLVar('Deliverytype':                     ' ');
6.27           UpdHTMLVar('Deliveryterms':                 w_lbtx);
6.27           UpdHTMLVar('Drivingroute':           %char(lokjor));
6.27           WrtSection('DeliveryInfo');

pdf            test(de) *dmy a1ldat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(a1ldat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Deliverydate': %char(tmpdate : *iso));
pdf            UpdHTMLVar('Paymentcondition':            x_betb);
pdf            UpdHTMLVar('Deliverymethod':              a1lmtx);
pdf
pdf            test(de) *dmy a1ldat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(a1ldat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Confirmeddeliverydate': %char(tmpdate : *iso));
pdf
pdf            test(de) *dmy a1vdat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(a1vdat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Realdeliverydate': %char(tmpdate : *iso));
pdf            UpdHTMLVar('Refordernumber':        %char(a1ornr));
pdf
6.27           WrtSection('InfoHead2');
pdf   /End-free
pdf
pdf   /Free
pdf
pdf        //  Legg ut 'heading' på linje
pdf            WrtSection('PacknoteLines');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Detaljer                *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_deta      begsr
pdf   * Sørg for at vi har skrevet siste tag for topptext før vi begynner
pdf   * med detaljer.
pdf  c                   if        b_topt = *on
pdf  c                   exsr      xml_topt_end
pdf  c                   eval      b_topt = *off
pdf  c                   endif
pdf   *
6.2E c                   eval      w_lvar = *blank
6.34 c                   eval      w_tek1 = *blank
6.34 c                   eval      w_tek2 = *blank
pdf   *
pdf  c                   if        valktx <> 1
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Varetekster
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     d1tek1        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_tek1
pdf   *
pdf  c                   if        ldtek2 <> *blank
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.28 c                   movel     ldtek2        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_tek2
pdf  c                   endif
      * Lev.varenummer
6.2E c                   eval      p_str_in = *blank
6.2E c                   eval      p_lr = '0'
6.2E c                   movel     ldlvar        P_str_in
6.2E c                   call      'AP613R'
6.2E c                   parm                    p_str_in
6.2E c                   parm                    p_str_out
6.2E c                   parm                    p_lr
6.2E c                   movel     p_str_out     w_lvar
pdf   * Håndtere riktig antall desimaler
pdf  c                   if        *in40 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant0))
pdf  c                   callp     updHTMLVar('NoDecimals':        '0')
pdf  c                   elseif    *in41 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant1))
pdf  c                   callp     updHTMLVar('NoDecimals':        '1')
pdf  c                   elseif    *in42 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant2))
pdf  c                   callp     updHTMLVar('NoDecimals':        '2')
pdf  c                   elseif    *in43 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant3))
pdf  c                   callp     updHTMLVar('NoDecimals':        '3')
pdf  c                   endif
6.27  *
6.27 c                   if        ldldat <> *loval
6.27 c     *dmy          move      ldldat        w_lddt
6.27 c                   endif
pdf   *
pdf   /Free
pdf        // Skriv detaljer
6.27           UpdHTMLVar('Supplieritemno':     d0vare);
pdf            UpdHTMLVar('Itemno':             d1vare);
6.12           UpdHTMLVar('Text1':              w_tek1);
6.12           UpdHTMLVar('Text2':              w_tek2);
pdf            UpdHTMLVar('Unit':                d1enh1);
6.27           UpdHTMLVar('Currency':           lovalk);
pdf            UpdHTMLVar('Priceexvat':   %char(d1bpri));
pdf            UpdHTMLVar('Amountexvat':  %char(d1belp));
6.27           UpdHTMLVar('Storage':       %char(ldlage));
pdf            UpdHTMLVar('Nobbno':      %char(ldnobb));
6.27           UpdHTMLVar('Linetype':              '0');
6.27           UpdHTMLVar('Bookingno':             '0');
6.27           UpdHTMLVar('Nobbno':        %char(ldnobb));
6.27           UpdHTMLVar('Lineno':        %char(ldline));
6.27           UpdHTMLVar('Warehouse':     %char(ldlage));
6.27           test(de) *dmy w_lddt;
6.27           if %error;
6.27           tmpdate = *loval;
6.27           else;
6.27           tmpdate = %date(w_lddt : *dmy);
6.27           endif;
6.27           UpdHTMLVar('Deliverydate': %char(tmpdate : *iso));
6.2E       //  UpdHTMLVar('Partneritemno':       ldlvar);
6.2E           UpdHTMLVar('Partneritemno':%trim(w_lvar));
6.27           UpdHTMLVar('Campaign':               ' ');
6.27           UpdHTMLVar('Gtin':           %char(ldeann));
pdf            WrtSection('Line');
pdf
pdf   /End-free
pdf   *
pdf  c                   else
6.34 c**                 eval      w_tek1 = *blank
6.34 c**                 eval      w_tek2 = *blank
pdf  c                   movel     ldtek1        d1tek1
pdf  c                   movel     ldtek2        d1tek2
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Tekstlinjer
pdf  c                   movel     d1tek1        w_str_in
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     d1tek1        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_tek1
pdf   *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     d1tek2        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_tek2
      *
6.16 c**6.24             eval      w_tek0 = %trim(w_tek1) + ' ' + %trim(w_tek2)
6.24 c                   if        %subst(d1tek1:35:1) = ' ' or
6.24 c                             %subst(d1tek2:1:1) = ' '
6.24 c                   eval      w_tek0 = %trim(w_tek1) + ' ' + %trim(w_tek2)
6.24 c                   else
6.24 c                   eval      w_tek0 = %trim(w_tek1) + %trimr(w_tek2)
6.24 c                   endif
pdf   *
pdf   /Free
6.12      //   UpdHTMLVar('Text1':              d1tek1);
6.16           UpdHTMLVar('Text1':       %trim(w_tek0));
6.16           UpdHTMLVar('Text2':                 ' ');
pdf            WrtSection('TextLine');
pdf   /End-free
pdf   *
pdf  c                   endif
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Total                   *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_total     begsr
pdf   *
pdf   /Free
pdf        // Skriv spesifikasjoner
pdf            UpdHTMLVar('Sumtotal':  %char(t1totl));
pdf
pdf            WrtSection('TotalLine');
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Siste tagg for pakks    *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_endpackl  begsr
pdf   * Sørg for at vi har skrevet siste tag for bunntext før vi fortsetter
pdf  c                   if        b_bott = *on
pdf  c                   exsr      xml_bott_end
pdf  c                   eval      b_bott = *off
pdf  c                   endif
pdf   *
pdf   /Free
pdf        // Skriv siste ordinære linjetagg
pdf            WrtSection('EndPackLines');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Spesifikasjoner         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_spec      begsr
8.02  *
8.02  * Scanner etter ugyldige tegn
8.02  *
8.02 c                   eval      w_e1text = *blank
8.02 c                   eval      p_str_in = *blank
8.02 c                   eval      p_lr = '0'
8.02 c                   movel     e1text        p_str_in
8.02 c                   call      'AP613R'
8.02 c                   parm                    p_str_in
8.02 c                   parm                    p_str_out
8.02 c                   parm                    p_lr
8.02 c                   movel     p_str_out     w_e1text
pdf   *
pdf   /Free
pdf        // Skriv spesifikasjoner
8.02       //  UpdHTMLVar('Text1':    e1text);
8.02           UpdHTMLVar('Text1':    %trim(w_e1text));
pdf            UpdHTMLVar('Text2':       ' ');
pdf
pdf            WrtSection('TextLine');
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Topptekst start         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_topt_str  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('TopTextStart');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Topptekst               *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_topptxt   begsr
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Topptekst
8.02 c                   eval      w_e1text = *blank
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     e1text        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
8.02 c**                 movel     p_str_out     e1text
8.02 c                   movel     p_str_out     w_e1text
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
8.02       //  UpdHTMLVar('Toptext':     e1text);
8.02           UpdHTMLVar('Toptext':     %trim(w_e1text));
pdf            WrtSection('TopTextLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Topptekst slutt         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_topt_end  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('TopTextEnd');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Bunntekst start         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_bott_str  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('BottomTextStart');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Bunntekst               *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_bunntxt   begsr
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Bunntekst
8.02 c                   eval      w_e1text = *blank
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     e1text        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
8.02 c**                 movel     p_str_out     e1text
8.02 c                   movel     p_str_out     w_e1text
pdf   *
pdf   /Free
pdf        // Skriv bunntekst
8.02       //  UpdHTMLVar('Bottomtext':  e1text);
8.02           UpdHTMLVar('Bottomtext':  %trim(w_e1text));
pdf            WrtSection('BottomTextLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Bunntekst slutt         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_bott_end  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('BottomTextEnd');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Slutt                   *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_end       begsr
pdf   * Sørg for at vi har skrevet siste tag for bunntext før vi begynner
pdf   * avslutter.
pdf  c                   if        b_bott = *on
pdf  c                   exsr      xml_bott_end
pdf  c                   eval      b_bott = *off
pdf  c                   endif
pdf   *
pdf   /Free
pdf            WrtSection('EndPackDocument');
pdf   /End-free
pdf   *
pdf   * Hvis denne ikke skal arkiveres, lages ikke archive tagg.
pdf   *
pdf  c                   if        l_arch = 1
6.11  * Lag tag for vising i arkivklienten
6.11 c                   eval      w_dspl = *blank
6.2A c**                 eval      w_dspl = 'Pakkseddel: '+%char(a1numm)+
6.2A c                   eval      w_dspl=%Trim(a1txt1)+' '+%char(a1numm) +
6.11 c                             ' Leverandør: '+ %trim(%char(a1ldor) + ' - '+
6.11 c                             %trim(a1navn))
6.11  *
6.17 c                   eval      p_str_in = *blank
6.17 c                   eval      p_lr = '0'
6.17 c                   movel     w_dspl        p_str_in
6.17 c                   call      'AP613R'
6.17 c                   parm                    p_str_in
6.17 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.17 c                   movel     p_str_out     w_dspl
6.2A  * Referansetagg
6.2A c                   eval      w_refn = *blank
6.2B c*                  eval      w_refn = 'IP-' + %char(a1numm) +
6.2B c*                            '-'+ %char(%subdt(w_date:*years))
6.2B c                   eval      w_refn = %char(%subdt(w_date:*years)) +
8.04 c                             %char(a1numm) + '-' + %char(losuff)
pdf   /Free
pdf        // Skriv metattags
6.11
6.2A           UpdHTMLVar('Refno':          %trim(w_refn));
6.11           UpdHTMLVar('Displaytag':     %trim(w_dspl));
pdf            WrtSection('ArchiveCommandStart');
6.11
pdf            UpdHTMLVar('Metavalue':      %char(a1numm));
pdf            UpdHTMLVar('Metakey':   'PAKKSEDDELNUMMER');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':      %char(a1ldor));
8.03       //  UpdHTMLVar('Metakey':         'LEVERANDØR');
8.03           UpdHTMLVar('Metakey':         'LEVERAND&#216;R');
pdf            WrtSection('MetaTag');
pdf
6.12           UpdHTMLVar('Metavalue':            w_1navn);
8.03       //  UpdHTMLVar('Metakey':     'LEVERANDØRNAVN');
8.03           UpdHTMLVar('Metakey':     'LEVERAND&#216;RNAVN');
pdf            WrtSection('MetaTag');
6.11
6.11           UpdHTMLVar('Metavalue':      %char(loornr));
6.11           UpdHTMLVar('Metakey':        'ORDRENUMMER');
6.11           WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':             l_user);
pdf            UpdHTMLVar('Metakey':             'BRUKER');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue': %char(w_date:*iso));
pdf            UpdHTMLVar('Metakey':               'DATO');
pdf            WrtSection('MetaTag');
6.21
6.21           UpdHTMLVar('Metavalue':             a1txt1);
6.21           UpdHTMLVar('Metakey':         'RUTINETEKST');
6.21           WrtSection('MetaTag');
6.2A
6.2A           UpdHTMLVar('Metavalue':             l_ruti);
6.2A           UpdHTMLVar('Metakey':             'RUTINE');
6.2A           WrtSection('MetaTag');
6.2A
6.2A           UpdHTMLVar('Metavalue':             l_wsid);
6.2A           UpdHTMLVar('Metakey':             'SKJERM');
6.2A           WrtSection('MetaTag');
6.2A
6.2A           UpdHTMLVar('Metavalue':      %char(l_firm));
6.2A           UpdHTMLVar('Metakey':              'FIRMA');
6.2A           WrtSection('MetaTag');
pdf
pdf            WrtSection('ArchiveCommandEnd');
pdf   /End-free
pdf   *
pdf  c                   endif
pdf   *
pdf   /Free
pdf            WrtSection('Footer');
pdf   /End-free
pdf   *
pdf  c                   eval      XML_Output = XML_path + l_filg +'/'+
pdf  c                             'Innk_pakk_'+ %trim(w_jkey) + '.xml'
pdf   *
pdf  c                   callp     WrtHtmlToStmf(XML_Output: 819)
6.32  * Skriver til datakø for å aktivere sniffer, hvis dataq er aktiv
6.32 c                   if        d_dtaq = '1'
6.32 c                   eval      p_xmlf = xml_output
6.32 c                   eval      p_filg = 'ADB'+l_filg
6.32 c                   call      'AP629C'
6.32 c                   parm                    p_filg
6.32 c                   parm                    p_xmlf
6.32 c                   endif
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Skjermvisning           *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     pdf_preview   begsr
pdf   *
pdf   * Vi kaller program for launch av PDF i browser
pdf  c                   call      'AP621R'
pdf  c                   parm                    w_jkey
pdf   *
pdf  c                   endsr
pdf   *
6.27  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.27  * Subrutiner for XML/jasper integrasjon - Detaljer                *
6.27  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.27 c     hnt_avde      begsr
6.27  * Hent inn avdelingsinformasjon
6.27 c
6.27 c                   eval      w_ddeno = loavde
6.27 c                   eval      w_dnavn = *blank
6.27 c                   eval      w_dadr1 = *blank
6.27 c                   eval      w_dadr2 = *blank
6.27 c                   eval      w_dpcde = *zeros
6.27 c                   eval      w_dpstd = *blank
6.27 c                   eval      w_dphon = *blank
6.27 c                   eval      w_dfaxn = *blank
6.27  *
6.27 c                   eval      ra07pf_avde = loavde
6.27 c     ra07pf_key    chain     ra07pfr                            90
6.27 c                   if        *in90  = *off
6.27 c                   eval      w_dnavn = ragtxt
6.27 c                   eval      w_dadr1 = ragadr
6.27 c                   eval      w_dadr2 = ragad2
6.27 c                   eval      w_dpcde = ragpnr
6.27 c                   eval      w_dpstd = (%char(ragpnr) + ' ' + ragste)
6.27 c                   if        ragtlf <> *blank
6.27 c                   eval      w_dphon = ragtlf
6.27 c                   endif
6.27 c                   if        ragfax <> *blank
6.27 c                   eval      w_dfaxn = ragfax
6.27 c                   endif
6.31  * Sjekk om info skal hentes fra avdeling
6.31 c                   if        l_prfi = 2
6.31 c                   eval      w_mail = ragmai
6.31 c                   eval      w_weba = ragweb
6.31 c                   endif
6.27 c                   endif
6.27  *
6.27 c                   endsr
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     *INZSR        BEGSR
      *
     C     *LIKE         DEFINE    LAALEV        W0LDOR
     C     *LIKE         DEFINE    VAOTYP        WWOTYP
     C     *LIKE         DEFINE    LOLDOR        WWKUND
     C     *LIKE         DEFINE    LOFIRM        WWFIRM
     C     *LIKE         DEFINE    LOWSID        WWWSID
     C     *LIKE         DEFINE    LONUMM        WWNUMM
     C     *LIKE         DEFINE    LOSUFF        WWSUFF
     C     *LIKE         DEFINE    LDLINE        WWLINE
     C     *LIKE         DEFINE    LDLTYP        WWLTYP
     C     *LIKE         DEFINE    LDNUMM        SANUMM
     C     *LIKE         DEFINE    VVVARE        WWVARE
      *
     C     *LIKE         DEFINE    LDIPNY        W1RAB1
      *
     C     *LIKE         DEFINE    LDORNU        WWORNU
     C     *LIKE         DEFINE    LDORSU        WWORSU
     C     *LIKE         DEFINE    FOKUND        WWKKUN
      *
      *  Nullstilling av felter som ikke kan redefineres
      *
      *
     C                   MOVE      *ZERO         WPMVAS            6 2
     C                   MOVE      *ZERO         WPMVAT            5 4
     C                   MOVE      *ZERO         WPMVAF           10 9
      *
     C                   MOVE      *BLANK        WWRUTI           10
     C                   MOVE      *ZERO         WLTELL            3 0
     C                   MOVE      *ZERO         WLTEST            3 0
      *
      * Key for Heading-file
      *
     C     KEY01         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWNUMM
     C                   KFLD                    WWSUFF
      *
      * Key for Detalj-file
      *
     C     KEY02         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWNUMM
     C                   KFLD                    WWSUFF
     C                   KFLD                    WWLINE
      *
      * Key for Tekst-linjer
      *
     C     KEY03         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWNUMM
     C                   KFLD                    WWSUFF
     C                   KFLD                    WWLINE
      *
      * Key for leverandørregister
      *
     C     KEY04         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWKUND
      *
      * Key for firmaregister
      *
     C     KEY06         KLIST
     C                   KFLD                    WWFIRM
      *
      * Key for ordretyper
      *
     C     KEY07         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWOTYP
      *
      * Key for linjetyper
      *
     C     KEY08         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWLTYP
      *
      * Key for statusregister
      *
     C     KEY09         KLIST
     C                   KFLD                    WWFIRM
      *
      * Key for formular-register
      *
     C     KEY10         KLIST
     C                   KFLD                    WWRUTI
      *
      * Key for vare-register
      *
     C     KEY11         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWVARE
      *
      * Key for Kunde-ordre-heading-file
      *
     C     KEY13         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWORNU
     C                   KFLD                    WWORSU
      *
      * Key for Kunderegister
      *
     C     KEY14         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWKKUN
5.34  *
5.34  * Key for oppslag på lengdespesif.linje
5.34  *
5.34 c     fvlsl1_key    klist
5.34 c                   kfld                    wwfirm
5.34 c                   kfld                    fvlsl1_numm
5.34 c                   kfld                    fvlsl1_suff
5.34 c                   kfld                    fvlsl1_line
6.27  * Key for posisjonering på selgere
6.27  *
6.27 c     ra09l1_key    klist
6.27 c                   kfld                    wwfirm
6.27 c                   kfld                    ra09l1_ikod
6.27  *
6.27  * Key for oppslag på avdelings-register
6.27  *
6.27 c     ra07pf_key    klist
6.27 c                   kfld                    w_firm
6.27 c                   kfld                    ra07pf_avde
6.2g  *
6.2g  * Key for statusregister
6.2g  *
6.2g c     bstsl1_key    klist
6.2g c                   kfld                    wwfirm
6.2g  *
      * Hente inn rutinenavn
      * og meldingstekst
      *
pdf  C                   MOVE      l_ruti        WWRUTI
      *
     C     KEY10         CHAIN     AFORL1R                            69
     C  N69              MOVE      AFTXT1        A1TXT1
     C  N69              MOVE      AFMLD1        T1MLD1
pdf   *
pdf   * Sjekk om vi skal bruke JASPER og XML generering av dokumenter
pdf  c                   if        l_poff = '1'
pdf  c                   eval      b_pdfp = *off
pdf  c                   eval      b_topt = *off
pdf  c                   eval      b_bott = *off
pdf  c                   eval      w_pdf = 0
pdf  c                   eval      w_pdf_ds = *blanks
pdf  c                   eval      w_ruti = l_ruti
pdf   *
pdf  c                   call      'AP609R'
pdf  c                   parm                    w_ruti
pdf  c                   parm                    w_pdf
pdf  c                   parm                    w_pdf_ds
pdf  c                   eval      d_pdf_ds = w_pdf_ds
pdf   * Vi skal kjøre med jasper
pdf  c                   if        w_pdf = 1 and
pdf  c                             %trim(d_xmlm) <> *blanks
pdf  c                   eval      p_mail = '0'
pdf  c                   eval      w_jkey = l_bach
pdf   *
pdf   * Hent inn xml templaten
pdf   *
pdf  c                   callp     GetHTMLIFS(d_xmlm :'<AS400>')
6.2F c                   callp     ClrHtmlBuffer
pdf   *
pdf   * Finn hvor xml'en skal legges
pdf   *
pdf  c                   eval      XML_path = *blanks
pdf  c                   eval      XML_path = %trim(d_path)
pdf   *
pdf   * Finn path til logo
pdf   *
pdf  c                   eval      jasper_logo = *blanks
pdf  c                   eval      jasper_logo = %trim(d_logo)
pdf   *
pdf   * Jobbnummer er allerede generert i AP600R. Overføres i *lda
pdf   *
pdf  c                   time                    w_date
pdf  C                   time                    wutime           12 0
pdf  C                   movel     wutime        a1time            6 0
pdf   * Vi logger ar utskriftprogrammet har startet
pdf  c                   eval      w_jstat = 10
pdf  c                   eval      w_jtext = 'Utskrift av innkommende pakksedde+
pdf  c                                       l har startet'
pdf  c                   call      'AB705R'
pdf  c                   parm                    l_bach
pdf  c                   parm                    w_jstat
pdf  c                   parm                    w_jtext
pdf   * Vi skriver xml for miljø formater
pdf  c                   exsr      xml_envm
pdf  c                   eval      b_pdfp = *on
pdf   *
pdf  c                   endif
pdf  c                   else
pdf  c                   eval      b_pdfp = *off
pdf  c                   endif
      *
     C                   ENDSR
