     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASLAGR
      * Program . . . . : LX102R
      * Beskrivelse . . : Oppdaterer fakturalinjer
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       010321 bsa  Fikseprogram
8.01  * K0000 170921 bsa  Justert måte å identifisere linje som skal konverteres
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      *       LR = avslutt
      *       10 = Roll
      *       12 = Sfldsp
      *       13 = Sfldspctl
      *       14 = Sflclr
      *       15 = Sflend
      *       16 = Readc 16 on, no more records
      *       21 = Home-key
      *       22 = Plassering av cursor
      *       30 = Protect av felter ved vise
      *    31-79 = Varsle m/feilmeldinger/skjermindikatorer
      *    80-89 = Arbeidsindikatorer
      *    90-99 = Fileindikatorer chain etc.
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av linjenummersekvenser (2 første siffer i linjenr LIMLIN)
      *
      *    10 : Hodeinformasjon
      *    20 : Partsinformasjon
      *    30 : Referanser
      *    40 : Transportinformasjon
      *    50 : Linjer
      *    55 : Linjer fra best. (ikke match i EDI-melding)
      *    60 : Tillegg/fradrag hodenivå
      *    65 : Fritkstlinjer på hodenivå
      *    90 : Totaler
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fledil5    uf   e           k disk    rename(ledipfr:ledil5r)
      *
      * FAKTURA Linje - FRA
      *
     d d_fakl          ds
     d  d_fl_llin                     6  0
     d  d_fl_vean                    14  0
     d  d_fl_vnob                     8  0
     d  d_fl_vlev                    15
     d  d_fl_tek1                    35
     d  d_fl_tek2                    35
     d  d_fl_bkva                    15  3
     d  d_fl_benh                     3
     d  d_fl_lkva                    15  3
     d  d_fl_lenh                     3
     d  d_fl_fkva                    15  3
     d  d_fl_fenh                     3
     d  d_fl_bnet                    15  2
     d  d_fl_bbto                    15  2
     d  d_fl_prkv                     3
     d  d_fl_pris                    15  3
     d  d_fl_penh                     3
     d  d_fl_prpr                     9  0
     d  d_fl_bnum                    20
     d  d_fl_blin                     6  0
     d  d_fl_mvap                     4  2
     d  d_fl_sig1                     3
     d  d_fl_kod1                     3
     d  d_fl_bel1                     9  2
     d  d_fl_pro1                     5  2
     d  d_fl_sig2                     3
     d  d_fl_kod2                     3
     d  d_fl_bel2                     9  2
     d  d_fl_pro2                     5  2
     d  d_fl_sig3                     3
     d  d_fl_kod3                     3
     d  d_fl_bel3                     9  2
     d  d_fl_pro3                     5  2
     d  d_fl_sig4                     3
     d  d_fl_kod4                     3
     d  d_fl_bel4                     9  2
     d  d_fl_pro4                     5  2
     d  d_fl_sig5                     3
     d  d_fl_kod5                     3
     d  d_fl_bel5                     9  2
     d  d_fl_pro5                     5  2
     d  d_fl_sig6                     3
     d  d_fl_kod6                     3
     d  d_fl_bel6                     9  2
     d  d_fl_pro6                     5  2
      *
      * FAKTURA Linje - TIL
      *
     d x_fakl          ds
     d  x_fl_llin                     6  0
     d  x_fl_vean                    13  0
     d  x_fl_vnob                     8  0
     d  x_fl_vlev                    15
     d  x_fl_tek1                    35
     d  x_fl_tek2                    35
     d  x_fl_bkva                    15  3
     d  x_fl_benh                     3
     d  x_fl_lkva                    15  3
     d  x_fl_lenh                     3
     d  x_fl_fkva                    15  3
     d  x_fl_fenh                     3
     d  x_fl_bnet                    15  2
     d  x_fl_bbto                    15  2
     d  x_fl_prkv                     3
     d  x_fl_pris                    15  3
     d  x_fl_penh                     3
     d  x_fl_prpr                     9  0
     d  x_fl_bnum                    20
     d  x_fl_blin                     6  0
     d  x_fl_mvap                     4  2
     d  x_fl_sig1                     3
     d  x_fl_kod1                     3
     d  x_fl_bel1                     9  2
     d  x_fl_pro1                     5  2
     d  x_fl_sig2                     3
     d  x_fl_kod2                     3
     d  x_fl_bel2                     9  2
     d  x_fl_pro2                     5  2
     d  x_fl_sig3                     3
     d  x_fl_kod3                     3
     d  x_fl_bel3                     9  2
     d  x_fl_pro3                     5  2
     d  x_fl_sig4                     3
     d  x_fl_kod4                     3
     d  x_fl_bel4                     9  2
     d  x_fl_pro4                     5  2
     d  x_fl_sig5                     3
     d  x_fl_kod5                     3
     d  x_fl_bel5                     9  2
     d  x_fl_pro5                     5  2
     d  x_fl_sig6                     3
     d  x_fl_kod6                     3
     d  x_fl_bel6                     9  2
     d  x_fl_pro6                     5  2
      *
     d                 ds
     d d_lenh                         3
     d  d_lenh0                       1    overlay(d_lenh:3)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_filg                931    933
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av variabler i nøkler
      *
     d ledil5_kode     s                   like(likode)
     d ledil5_type     s                   like(litype)
     d ledil5_mnum     s                   like(limnum)
     d ledil5_mlin     s                   like(limlin)
      *
     d w_firm          s                   like(lifirm)
     d w_date_fra      s               d   datfmt(*iso)
     d w_date_til      s               d   datfmt(*iso)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Les fra EDI melding med faste verdier
      *
     c     ledil5_key    setll     ledil5
     c     ledil5_key2   reade     ledil5
      *
     c                   dow       not %eof
      *
     c                   if        limlin >=500000      and
     c                             limlin < 559999      and
     c                             limdat >= w_date_fra and
     c                             liodat <= w_date_til
     c                   eval      d_fakl = limeld
     c                   eval      d_lenh = d_fl_lenh
      * Hvis 0 i siste siffer på levert enhet, er det ikke konvertert linje
     c                   if        d_lenh0 = '0'
     c                   exsr      fakl_konv
     c                   time                    lietim
     c                   time                    liedat
     c                   eval      lieusr = 'GTIN_KONV'
     c                   endif
     c                   update    ledil5r
     c                   else
     c                   unlock    ledil5
     c                   endif
      *
     c     ledil5_key2   reade     ledil5
     c                   enddo
      *
      * Avslutt program
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for plassere ordrelinje inn i riktig ds struktur
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     fakl_konv     begsr
      *
      * GTIN nr er lagt ut med 13 siffers struktur (gammel)
     c                   eval      x_fakl = limeld
     c                   eval      d_fl_llin = x_fl_llin
     c                   eval      d_fl_vean = x_fl_vean
     c                   eval      d_fl_vnob = x_fl_vnob
     c                   eval      d_fl_vlev = x_fl_vlev
     c                   eval      d_fl_tek1 = x_fl_tek1
     c                   eval      d_fl_tek2 = x_fl_tek2
     c                   eval      d_fl_bkva = x_fl_bkva
     c                   eval      d_fl_benh = x_fl_benh
     c                   eval      d_fl_lkva = x_fl_lkva
     c                   eval      d_fl_lenh = x_fl_lenh
     c                   eval      d_fl_fkva = x_fl_fkva
     c                   eval      d_fl_fenh = x_fl_fenh
     c                   eval      d_fl_bnet = x_fl_bnet
     c                   eval      d_fl_bbto = x_fl_bbto
     c                   eval      d_fl_prkv = x_fl_prkv
     c                   eval      d_fl_pris = x_fl_pris
     c                   eval      d_fl_penh = x_fl_penh
     c                   eval      d_fl_prpr = x_fl_prpr
     c                   eval      d_fl_bnum = x_fl_bnum
     c                   eval      d_fl_blin = x_fl_blin
     c                   eval      d_fl_mvap = x_fl_mvap
     c                   eval      d_fl_sig1 = x_fl_sig1
     c                   eval      d_fl_kod1 = x_fl_kod1
     c                   eval      d_fl_bel1 = x_fl_bel1
     c                   eval      d_fl_pro1 = x_fl_pro1
     c                   eval      d_fl_sig2 = x_fl_sig2
     c                   eval      d_fl_kod2 = x_fl_kod2
     c                   eval      d_fl_bel2 = x_fl_bel2
     c                   eval      d_fl_pro2 = x_fl_pro2
     c                   eval      d_fl_sig3 = x_fl_sig3
     c                   eval      d_fl_kod3 = x_fl_kod3
     c                   eval      d_fl_bel3 = x_fl_bel3
     c                   eval      d_fl_pro3 = x_fl_pro3
     c                   eval      d_fl_sig4 = x_fl_sig4
     c                   eval      d_fl_kod4 = x_fl_kod4
     c                   eval      d_fl_bel4 = x_fl_bel4
     c                   eval      d_fl_pro4 = x_fl_pro4
     c                   eval      d_fl_sig5 = x_fl_sig5
     c                   eval      d_fl_kod5 = x_fl_kod5
     c                   eval      d_fl_bel5 = x_fl_bel5
     c                   eval      d_fl_pro5 = x_fl_pro5
     c                   eval      d_fl_sig6 = x_fl_sig6
     c                   eval      d_fl_kod6 = x_fl_kod6
     c                   eval      d_fl_bel6 = x_fl_bel6
     c                   eval      d_fl_pro6 = x_fl_pro6
     c                   eval      limeld = d_fakl
      *
     c                   endsr
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Tar inn parameter fra forrige program
      *
     c*    *entry        plist
     c*                  parm                    p_dato
      *
      *  Key for les av MELDINGSLINJER
      *
     c     ledil5_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ledil5_kode
     c                   kfld                    ledil5_type
     c                   kfld                    ledil5_mnum
     c                   kfld                    ledil5_mlin
      *
      *  Key for les av MELDINGSLINJER
      *
     c     ledil5_key2   klist
     c                   kfld                    w_firm
     c                   kfld                    ledil5_kode
     c                   kfld                    ledil5_type
      *
     c                   eval      ledil5_kode = *blanks
     c                   eval      ledil5_type = 'FAKT'
     c                   eval      ledil5_mnum = 0
     c                   eval      ledil5_mlin = 0
     c     ledil5_key    setll     ledil5
      *
9.xx c     *ymd          move      20190101      w_date_fra
9.xx c                   time                    w_date_til
      *
     c                   endsr
      *
