      /TITLE  ASLAGR Overføring av lagerenhet til lagerregister
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASLAGR
      * Program . . . . : LX401R
      * Beskrivelse . . : Oppretter lagerplasser(lokasjoner) fra lager
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       270711 ASK  Nytt program
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvlagl1    uf   e           k disk    rename(vlagpfr:vlaglur)
      *
     fmdlolu    uf a e           k disk    rename(mdlopfr:mdlolur)
      *
      * Definering av Local data area (LDA)
      *
     d                uds
6.10 d l_user                911    920
     d l_firm                944    946  0
      *
      * Definering av variable i nøkler
      *
     d mdlolu_lage     s                   like(mdlage)
     d mdlolu_loka     s                   like(mdloka)
      *
      *
      * Definering av variable
      *
     d w_firm          s                   like(vlfirm)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Leser lagerregister, sjekker om lokasjon finnes - evt. oppretter
      *
     c                   read      vlagl1                                 90
     c                   dow       *in90 = *off
      *
     c                   clear                   mdlolur
      *
5.20 c                   eval      mdlolu_lage = vllage
     c                   eval      mdlolu_loka = vlplas
     c     mdlolu_key    chain     mdlolur
     c                   if        not %found
     c                   eval      mdfirm = w_firm
     c                   eval      mdlage = vllage
     c                   eval      mdloka = vlplas
     c                   eval      mdlbes = vlplas                                            .
     c                   time                    mdodat
6.10 c                   time                    mdotim
6.10 c                   eval      mdousr = l_user
6.10 c                   time                    mdedat
6.10 c                   time                    mdetim
6.10 c                   eval      mdeusr = l_user
     c                   write     mdlolur
     c                   endif
      *
     c                   read      vlagl1                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppdatering av lagerlokasjon
      *
     c     mdlolu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    mdlolu_lage
     c                   kfld                    mdlolu_loka
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
