     h option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : FX820R
      * Beskrivelse . . : Legger inn varegrupper på statistikk på varer fra
      *                   LVR ogvarer som er slettet.
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       040604 ASK  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fsistla    uf   e           k disk    rename(sistpfr:sistlar)
     fjvarl1    if   e           k disk    rename(jvarpfr:jvarl1r)
     fvvasl1    if   e           k disk    rename(vvaspfr:vvasl1r)
      *
      *
      * Definering av lda
      *
     d                uds
     d l_firm                944    946  0
      *
      * Definering av variabler i nøkler
      *
     d sistla_paar     s                   like(sipaar)
     d jvarl1_vare     s                   like(jvvare)
     d vvasl1_vare     s                   like(vvvare)
      *
      * Definering av variabler
      *
     d w_firm          s                   like(sifirm)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Oppdaterer statistikk
      *
     c                   eval      sistla_paar = 2004
     c     sistla_key    setll     sistlar
      *
     c                   read      sistlar
     c                   dow       not %eof
      *
      * Sjekk om varegrupper mangler
      *
     c                   if        siogrp <> 0 and
     c                             sihgrp <> 0 and
     c                             siugrp <> 0
     c                   goto      les_neste
     c                   endif
      *
      * Fra vareadministrasjon?
      *
     c                   eval      jvarl1_vare = sivare
     c     jvarl1_key    chain     jvarl1
     c                   if        %found
     c                   eval      siogrp = jvogrp
     c                   eval      sihgrp = jvhgrp
     c                   eval      siugrp = jvugrp
     c                   goto      oppd_stat
     c                   endif
      *
      * Fra varer slettet?
      *
     c                   eval      vvasl1_vare = sivare
     c     vvasl1_key    chain     vvasl1r
     c                   if        %found
     c                   eval      siogrp = vvogrp
     c                   eval      sihgrp = vvhgrp
     c                   eval      siugrp = vvugrp
     c                   goto      oppd_stat
     c                   endif
      *
     c                   goto      les_neste
      *
     c     oppd_stat     tag
     c                   update    sistlar
      *
     c     les_neste     tag
     c                   read      sistlar
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppdatering av statistikk-linje
      *
     c     sistla_key    klist
     c                   kfld                    w_firm
     c                   kfld                    sistla_paar
      *
      * Key for oppslag på vare i VADM
      *
     c     jvarl1_key    klist
     c                   kfld                    jvarl1_vare
      *
      * Key for oppslag på vare-slettet
      *
     c     vvasl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvasl1_vare
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
