     H/TITLE  ASSTAT Konvertering av statistikkregister - innkjøp
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * System  . . . . : ASLAGR
      * Program . . . . : LX430R
      * Beskrivelse . . : Korrigerer feilaktig utlagt Periode/År på
      *                   innkjøpsstatistikk.
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *              ASK  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     FISTAT     UF   F  230        DISK
      *
      *
      * LDA
      *
     D                UDS
     D  LCFIRM               944    946  0
     D  LCNAVN               951    980
     D  LCUSER               911    920
      *
     IISTAT     NS  01
     I                                  1    1  SRECT
     I                                  2    4 0SFIRM
     I                                  5   10 0SVALN
     I                                 11   25  SVARE
     I                                 26   28 0SGRUP
     I                                 29   31 0SLAND
     I                                 32   32 0SKMVA
     I                                 33   34 0SDIST
     I                                 35   36 0SKATE
     I                                 37   38  SSELG
     I                                 39   40 0SLAGE
     I                                 43   44 0SAVDE
     I                             p   45   50 3SANTA
     I                             p   51   56 2SBLØP
     I                             p   57   62 2SKOSP
     I                             p   63   68 2SRAB1
     I                             p   69   74 2SRAB2
     I                             p   75   80 2SORAB
     I                                 81   86 0SSTDA
     I                                 87   92 0SNUMM
     I                                 97  102 0SFALN
     I                                103  104 0SPMND
     I                                105  106 0SPAAR
     I                                107  112 0SLEKN
     I                                113  113 0SKRES
     I                                115  120 0SORDR
     I                                121  122  STYPE
     I                                124  125 0SHGRP
     I                                126  128 0SUGRP
     I                                129  136 0STRAD
     I                                137  139  SVEN1
     I                                140  142  SOEN1
     I                             p  143  146 2SNETT
     I                             p  147  150 2SBRUT
     I                             p  151  154 2SVOLU
      *
     C/EJECT
      *
     C     LES           TAG
      *
     C                   READ      ISTAT                                  10
     C   10              SETON                                            LR
     C   10              GOTO      SLUTT
      *
      * Test om post ligger på formen ÅÅMM - snu til MMÅÅ
      *
     C     SPMND         IFEQ      99
     C                   MOVE      SPAAR         SPMND
     C                   MOVE      99            SPAAR
     C                   EXCEPT    STKORR
     C                   ENDIF
      *
     C                   GOTO      LES
      *
     C     SLUTT         TAG
      *
     C/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     C     *INZSR        BEGSR
      *
      *
     C                   ENDSR
      *
     OISTAT     E            STKORR
     O                       SPMND              104
     O                       SPAAR              106
