     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASLAGR
      * Program . . . . : LX705R
      * Beskrivelse . . : Bytter lager i alle aktuelle filer
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      * V5.40  310306 KOB Lagt inn oppdatering av AUSRPF
      *  6.10  170609 BSA  Oppdatert med sporingsinformasjon
6.11  *  6.10  070510 BSA  Endret sporingsinformasjon
6.12  *  6.10  070211 bof  Utvidet med  FDESPF, FFAFPF, FFBOPF, FFCDPF
      *                    FFDLPF, FOWPPF,FSTSPF,FUSRPF,VAWEPF, VETIPF
      *                    LWHBPF,LWO6PF,
      *                    MDLOPF, MJLOPF,MLTIPF,MPPAPF,MPRAPF,
      *                    MPROPF,MPRUPF,MPRWPF,MPSPPF,MSTPPF,MTPAPF
      *                    BODTPF
      *                    REKUPF,RE0KPF,RE0LPF,RGIRPF,RKUNPF,RLEVPF
6.13  *  6.10  290911 AMD  Etter samtaler med SKA, skal alle oppdater.
6.13  *                    av AUSRPF deaktiveres i dette programmet,
6.13  *                    fordi et miljø kan dekke flere filegrupper.
6.13  *                    AUSRPF endres manuelt inntil videre.
7.01  *        180521 bof  Fjerne FFDLPF /FFBOPF ikke i bruk lenger
      *
8.01  *        060422 bsa  Utvidet LWHBPF, må rekompileres.
8.02  *PRG2   210622 bof  Utvidet prisgruppe fra 1 til 2 posisjoner
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     flx705d    cf   e             workstn
     fra10l1    uf a e           k disk    rename(ra10pfr:ra10l1r)
     fbmhepf    uf   e             disk
     fbohepf    uf   e             disk
6.12 fbodtpf    uf   e             disk
     fbwsdpf    uf   e             disk
     ffodtpf    uf   e             disk
     ffohepf    uf   e             disk
     ffplopf    uf   e             disk
6.12 ffdespf    uf   e             disk
6.12 fffafpf    uf   e             disk
6.12 fffcdpf    uf   e             disk
6.12 ffowppf    uf   e             disk
6.12 ffusrpf    uf   e             disk
6.12 fvawepf    uf   e             disk
6.12 fvetipf    uf   e             disk
6.12 flwhbpf    uf   e             disk
6.12 flwo6pf    uf   e             disk
6.12 fmdlopf    uf   e             disk
6.12 fmjlopf    uf   e             disk
6.12 fmltipf    uf   e             disk
6.12 fmppapf    uf   e             disk
6.12 fmprapf    uf   e             disk
6.12 fmpropf    uf   e             disk
6.12 fmprwpf    uf   e             disk    rename(mpropfr:mprwpfr)
6.12 fmprupf    uf   e             disk
6.12 fmpsppf    uf   e             disk
6.12 fmstppf    uf   e             disk
6.12 fmtpapf    uf   e             disk
     flbdtpf    uf   e             disk
     flbhepf    uf   e             disk
     flfdtpf    uf   e             disk
     flfhepf    uf   e             disk
6.12 flldipf    uf   e             disk
     flldtpf    uf   e             disk
     fllhepf    uf   e             disk
     flodtpf    uf   e             disk
     flohepf    uf   e             disk
     flplopf    uf   e             disk
     flpstpf    uf   e             disk
     flsorpf    uf   e             disk
     fltelpf    uf   e             disk
     flwa1pf    uf   e             disk
     flwa3pf    uf   e             disk
     fnohepf    uf   e             disk
     fre0kpf    uf   e             disk
     fre0lpf    uf   e             disk
     frgirpf    uf   e             disk
     frkunpf    uf   e             disk
     frlevpf    uf   e             disk
     fsidtpf    uf   e             disk
     fsihepf    uf   e             disk
     fsistpf    uf   e             disk
     fskakpf    uf   e             disk
     fskbupf    uf   e             disk
     fskwwpf    uf   e             disk
     fslakpf    uf   e             disk
     fslbupf    uf   e             disk
     fslwwpf    uf   e             disk
     fsodtpf    uf   e             disk
     fsohepf    uf   e             disk
     fsstapf    uf   e             disk
     fvhispf    uf   e             disk
     fvlagpf    uf   e             disk
     fwohepf    uf   e             disk
6.13 f*ausrpf   uf   e             disk
      *
      *  Local Data Area
      *
     d                uds
6.10 d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av variable i nøkler
      *
     d ra10l1_kode     s                   like(rajkod)
      *
      * Definering av variable
      *
     d w_firm          s                   like(lofirm)
     d w_lafa          s              2
     d w_lata          s              2
      *
      *---------------------------------------------------------------------
      * Henter inn startparametre
      *---------------------------------------------------------------------
      *
     c     c1tagb        tag
     c                   exfmt     c1bld
      *
      * Behandling av standard funksjonstaster
      *
     c                   select
     c                   when      *inkc
     c                   goto      avslutt
     c                   when      *inkl
     c                   goto      avslutt
     c                   endsl
      *
      * Gyldig fra lager?
      *
     c* sst              goto      butikk
     c                   eval      ra10l1_kode = c1flag
     c     ra10l1_key    chain     ra10l1
     c                   if        not %found
     c                   eval      *in31 = *on
     c                   goto      c1tagb
     c                   endif
      *
      * Ubrukt til lager?
      *
     c                   eval      ra10l1_kode = c1tlag
     c     ra10l1_key    chain     ra10l1
     c                   if        %found
     c                   eval      *in32 = *on
     c                   goto      c1tagb
     c                   endif
      *
      * Noen databaser har lagre som er alfadefinert
      *
     c                   move      c1flag        w_lafa
     c                   move      c1tlag        w_lata
      *
      * Oppretter nytt lager
      *
     c                   eval      ra10l1_kode = c1flag
     c     ra10l1_key    chain     ra10l1
     c                   eval      rajkod = c1tlag
     c                   write     ra10l1r
      *
      * Sletter fra lager
      *
     c                   eval      ra10l1_kode = c1flag
     c     ra10l1_key    chain     ra10l1
     c                   delete    ra10l1r
      *
      *---------------------------------------------------------------------
      * Bytter lagernummer i samtlige registre i systemet
      *---------------------------------------------------------------------
      *
      * Butikk hode
      *
     c     butikk        tag
     c                   read      bmhepf
      *
     c                   dow       not %eof
      *
     c                   if        bnlage = c1flag
     c                   eval      bnlage = c1tlag
     c                   update    bmhepfr
     c                   endif
     c                   read      bmhepf
      *
     c                   enddo
      *
      * Bong hode
      *
     c                   read      bohepf
      *
     c                   dow       not %eof
      *
     c                   if        bolage = c1flag
     c                   eval      bolage = c1tlag
6.10 c                   time                    boedat
6.10 c                   time                    boetim
6.10 c                   eval      boeusr = l_user
     c                   update    bohepfr
     c                   endif
     c                   read      bohepf
      *
     c                   enddo
6.12  *
6.12  * Bong detaljer
6.12  *
6.12 c                   read      bodtpf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        bdlage = c1flag
6.12 c                   eval      bdlage = c1tlag
6.12 c                   time                    bdedat
6.12 c                   time                    bdetim
6.12 c                   eval      bdeusr = l_user
6.12 c                   update    bodtpfr
6.12 c                   endif
6.12 c                   read      bodtpf
6.12  *
6.12 c                   enddo
      *
      * Butikk kasse
      *
     c                   read      bwsdpf
      *
     c                   dow       not %eof
      *
     c                   if        bwlage = c1flag
     c                   eval      bwlage = c1tlag
6.10 c                   time                    bwedat
6.10 c                   time                    bwetim
6.10 c                   eval      bweusr = l_user
     c                   update    bwsdpfr
     c                   endif
     c                   read      bwsdpf
      *
     c                   enddo
      *
      * Ordre linje
      *
     c                   read      fodtpf
      *
     c                   dow       not %eof
      *
     c                   if        fdlage = c1flag
     c                   eval      fdlage = c1tlag
6.10 c                   time                    fdedat
6.10 c                   time                    fdetim
6.10 c                   eval      fdeusr = l_user
     c                   update    fodtpfr
     c                   endif
     c                   read      fodtpf
      *
     c                   enddo
      *
      * Ordre hode
      *
     c                   read      fohepf
      *
     c                   dow       not %eof
      *
     c                   if        folage = c1flag
     c                   eval      folage = c1tlag
6.10 c                   time                    foedat
6.10 c                   time                    foetim
6.10 c                   eval      foeusr = l_user
     c                   update    fohepfr
     c                   endif
     c                   read      fohepf
      *
     c                   enddo
      *
      * Ordre utplukk paramter
      *
     c                   read      fplopf
      *
     c                   dow       not %eof
      *
     c                   if        fkplag = c1flag
     c                   eval      fkplag = c1tlag
     c                   update    fplopfr
     c                   endif
     c                   read      fplopf
      *
     c                   enddo
6.12  *
6.12  * Ordre slettet - linjer
6.12  *
6.12 c                   read      fdespf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        fslage = c1flag
6.12 c                   eval      fslage = c1tlag
6.12 c                   update    fdespfr
6.12 c                   endif
6.12 c                   read      fdespf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * Fraktbrev - heading
6.12  *
6.12 c                   read      ffafpf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        ffalag = c1flag
6.12 c                   eval      ffalag = c1tlag
6.12 c                   update    fdespfr
6.12 c                   endif
6.12 c                   read      ffafpf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * Fraktbrev - inngående detaljer
6.12  *
6.12 c                   read      ffcdpf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        ffclag = c1flag
6.12 c                   eval      ffclag = c1tlag
6.12 c                   update    ffcdpfr
6.12 c                   endif
6.12 c                   read      ffcdpf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * Fraktbrev - ordrelinjer
6.12  *
6.12 c                   read      fowppf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        vwclag = c1flag
6.12 c                   eval      vwclag = c1tlag
6.12 c                   update    fowppfr
6.12 c                   endif
6.12 c                   read      fowppf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * Brukere
6.12  *
6.12 c                   read      fusrpf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        fblage = c1flag
6.12 c                   eval      fblage = c1tlag
6.12 c                   update    fusrpfr
6.12 c                   endif
6.12 c                   read      fusrpf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * arbeidsreg.
6.12  *
6.12 c                   read      vawepf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        vwalag = c1flag
6.12 c                   eval      vwalag = c1tlag
6.12 c                   update    vawepfr
6.12 c                   endif
6.12 c                   read      vawepf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * etiketter
6.12  *
6.12 c                   read      vetipf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        vmlage = c1flag
6.12 c                   eval      vmlage = c1tlag
6.12 c                   update    vetipfr
6.12 c                   endif
6.12 c                   read      vetipf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * nye håndholdte
6.12  *
6.12 c                   read      lwhbpf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        mylage = c1flag
6.12 c                   eval      mylage = c1tlag
6.12 c                   update    lwhbpfr
6.12 c                   endif
6.12 c                   read      lwhbpf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * lager overvåking
6.12  *
6.12 c                   read      lwo6pf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        mwolag = c1flag
6.12 c                   eval      mwolag = c1tlag
6.12 c                   update    lwo6pfr
6.12 c                   endif
6.12 c                   read      lwo6pf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * lagerlokasjon
6.12  *
6.12 c                   read      mdlopf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        mdlage = c1flag
6.12 c                   eval      mdlage = c1tlag
6.12 c                   update    mdlopfr
6.12 c                   endif
6.12 c                   read      mdlopf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * logistikkpunkt
6.12  *
6.12 c                   read      mjlopf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        mjlage = c1flag
6.12 c                   eval      mjlage = c1tlag
6.12 c                   update    mjlopfr
6.12 c                   endif
6.12 c                   read      mjlopf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * Leveringstid parameter
6.12  *
6.12 c                   read      mltipf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        mclage = c1flag
6.12 c                   eval      mclage = c1tlag
6.12 c                   update    mltipfr
6.12 c                   endif
6.12 c                   read      mltipf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * Leveringstid parameter
6.12  *
6.12 c                   read      mppapf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        mplage = c1flag
6.12 c                   eval      mplage = c1tlag
6.12 c                   update    mppapfr
6.12 c                   endif
6.12 c                   read      mppapf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * Prognose - store avvik
6.12  *
6.12 c                   read      mprapf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        mqlage = c1flag
6.12 c                   eval      mqlage = c1tlag
6.12 c                   update    mprapfr
6.12 c                   endif
6.12 c                   read      mprapf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * Prognose -
6.12  *
6.12 c                   read      mpropf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        molage = c1flag
6.12 c                   eval      molage = c1tlag
6.12 c                   update    mpropfr
6.12 c                   endif
6.12 c                   read      mpropf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * Prognose -  arbeidsreg.
6.12  *
6.12 c                   read      mprwpf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        molage = c1flag
6.12 c                   eval      molage = c1tlag
6.12 c                   update    mprwpfr
6.12 c                   endif
6.12 c                   read      mprwpf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * Prognose - pr uke
6.12  *
6.12 c                   read      mprupf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        mrlage = c1flag
6.12 c                   eval      mrlage = c1tlag
6.12 c                   update    mprupfr
6.12 c                   endif
6.12 c                   read      mprupf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * lager - sideregister
6.12  *
6.12 c                   read      mpsppf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        moslag = c1flag
6.12 c                   eval      moslag = c1tlag
6.12 c                   update    mpsppfr
6.12 c                   endif
6.12 c                   read      mpsppf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * syklisk telleregister
6.12  *
6.12 c                   read      mstppf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        mslage = c1flag
6.12 c                   eval      mslage = c1tlag
6.12 c                   update    mstppfr
6.12 c                   endif
6.12 c                   read      mstppf
6.12  *
6.12 c                   enddo
6.12  *
6.12  * pakke tre register
6.12  *
6.12 c                   read      mtpapf
6.12  *
6.12 c                   dow       not %eof
6.12  *
6.12 c                   if        mtlage = c1flag
6.12 c                   eval      mtlage = c1tlag
6.12 c                   update    mtpapfr
6.12 c                   endif
6.12 c                   read      mtpapf
6.12  *
6.12 c                   enddo
      *
      * Lagertelling bunt linje
      *
     c                   read      lbdtpf
      *
     c                   dow       not %eof
      *
     c                   if        lvlage = c1flag
     c                   eval      lvlage = c1tlag
6.10 c                   time                    lvedat
6.10 c                   time                    lvetim
6.10 c                   eval      lveusr = l_user
     c                   update    lbdtpfr
     c                   endif
     c                   read      lbdtpf
      *
     c                   enddo
      *
      * Lagertelling bunt hode
      *
     c                   read      lbhepf
      *
     c                   dow       not %eof
      *
     c                   if        lulage = c1flag
     c                   eval      lulage = c1tlag
6.10 c                   time                    luedat
6.10 c                   time                    luetim
6.10 c                   eval      lueusr = l_user
     c                   update    lbhepfr
     c                   endif
     c                   read      lbhepf
      *
     c                   enddo
      *
      * Bestillings forslag linje
      *
     c                   read      lfdtpf
      *
     c                   dow       not %eof
      *
     c                   if        lflage = c1flag
     c                   eval      lflage = c1tlag
6.10 c                   time                    lfedat
6.10 c                   time                    lfetim
6.10 c                   eval      lfeusr = l_user
     c                   update    lfdtpfr
     c                   endif
     c                   read      lfdtpf
      *
     c                   enddo
      *
      * Bestillings forslag hode
      *
     c                   read      lfhepf
      *
     c                   dow       not %eof
      *
     c                   if        lhlage = c1flag
     c                   eval      lhlage = c1tlag
6.10 c                   time                    lhedat
6.10 c                   time                    lhetim
6.10 c                   eval      lheusr = l_user
     c                   update    lfhepfr
     c                   endif
     c                   read      lfhepf
      *
     c                   enddo
      *
      * Leverandør distribusjonsliste
      *
     c                   read      lldipf
      *
     c                   dow       not %eof
      *
     c                   if        lplage = w_lafa
     c                   eval      lplage = w_lata
     c                   update    lldipfr
     c                   endif
     c                   read      lldipf
      *
     c                   enddo
      *
      * Lagertrans linje
      *
     c                   read      lldtpf
      *
     c                   dow       not %eof
      *
     c                   if        lslage = c1flag
     c                   eval      lslage = c1tlag
     c                   endif
     c                   if        lslast = c1flag
     c                   eval      lslast = c1tlag
     c                   endif
6.10 c                   time                    lsedat
6.10 c                   time                    lsetim
6.10 c                   eval      lseusr = l_user
     c                   update    lldtpfr
     c                   read      lldtpf
      *
     c                   enddo
      *
      * Lagertrans hode
      *
     c                   read      llhepf
      *
     c                   dow       not %eof
      *
     c                   if        lqlage = c1flag
     c                   eval      lqlage = c1tlag
     c                   endif
     c                   if        lqlast = c1flag
     c                   eval      lqlast = c1tlag
     c                   endif
6.10 c                   time                    lqedat
6.10 c                   time                    lqetim
6.10 c                   eval      lqeusr = l_user
     c                   update    llhepfr
     c                   read      llhepf
      *
     c                   enddo
      *
      * Bestilling linje
      *
     c                   read      lodtpf
      *
     c                   dow       not %eof
      *
     c                   if        ldlage = c1flag
     c                   eval      ldlage = c1tlag
6.10 c                   time                    ldedat
6.10 c                   time                    ldetim
6.10 c                   eval      ldeusr = l_user
     c                   update    lodtpfr
     c                   endif
     c                   read      lodtpf
      *
     c                   enddo
      *
      * Bestilling hode
      *
     c                   read      lohepf
      *
     c                   dow       not %eof
      *
     c                   if        lolage = c1flag
     c                   eval      lolage = c1tlag
6.10 c                   time                    loedat
6.10 c                   time                    loetim
6.10 c                   eval      loeusr = l_user
     c                   update    lohepfr
     c                   endif
     c                   read      lohepf
      *
     c                   enddo
      *
      * Uplukks parametre
      *
     c                   read      lplopf
      *
     c                   dow       not %eof
      *
     c                   if        lkplag = c1flag
     c                   eval      lkplag = c1tlag
     c                   update    lplopfr
     c                   endif
     c                   read      lplopf
      *
     c                   enddo
      *
      * Lagertelling telleregister
      *
     c                   read      ltelpf
      *
     c                   dow       not %eof
      *
     c                   if        lelage = c1flag
     c                   eval      lelage = c1tlag
6.10 c                   time                    leedat
6.10 c                   time                    leetim
6.10 c                   eval      leeusr = l_user
     c                   update    ltelpfr
     c                   endif
     c                   read      ltelpf
      *
     c                   enddo
      *
      * Lagertelling hjelpe
      *
     c                   read      lpstpf
      *
     c                   dow       not %eof
      *
     c                   if        lzlage = c1flag
     c                   eval      lzlage = c1tlag
     c                   update    lpstpfr
     c                   endif
     c                   read      lpstpf
      *
     c                   enddo
      *
      * Lagerutskrift hjelpe
      *
     c                   read      lsorpf
      *
     c                   dow       not %eof
      *
     c                   if        lwlage = c1flag
     c                   eval      lwlage = c1tlag
     c                   endif
     c                   if        lwlagr = c1flag
     c                   eval      lwlagr = c1tlag
     c                   endif
     c                   update    lsorpfr
     c                   read      lsorpf
      *
     c                   enddo
      *
      * Arbeidsregister lager
      *
     c                   read      lwa1pf
      *
     c                   dow       not %eof
      *
     c                   if        mllage = c1flag
     c                   eval      mllage = c1tlag
     c                   update    lwa1pfr
     c                   endif
     c                   read      lwa1pf
      *
     c                   enddo
      *
      * Arbeidsregister historisk lagerbok
      *
     c                   read      lwa3pf
      *
     c                   dow       not %eof
      *
     c                   if        mhlage = c1flag
     c                   eval      mhlage = c1tlag
     c                   update    lwa3pfr
     c                   endif
     c                   read      lwa3pf
      *
     c                   enddo
      *
      * Nettbutikk ordre hode
      *
     c                   read      nohepf
      *
     c                   dow       not %eof
      *
     c                   if        nolage = c1flag
     c                   eval      nolage = c1tlag
6.10 c                   time                    noedat
6.10 c                   time                    noetim
6.10 c                   eval      noeusr = l_user
     c                   update    nohepfr
     c                   endif
     c                   read      nohepf
      *
     c                   enddo
      *
      * Ekstern, kunder
      *
     c                   read      re0kpf
      *
     c                   dow       not %eof
      *
     c                   if        rklagr = c1flag
     c                   eval      rklagr = c1tlag
     c                   update    re0kpfR
     c                   endif
     c                   read      re0kpf
      *
     c                   enddo
      *
      * Ekstern, leverandører
      *
     c                   read      re0lpf
      *
     c                   dow       not %eof
      *
     c                   if        rllagr = c1flag
     c                   eval      rllagr = c1tlag
     c                   update    re0lpfr
     c                   endif
     c                   read      re0lpf
      *
     c                   enddo
      *
      * Girogrunnlag bank
      *
     c                   read      rgirpf
      *
     c                   dow       not %eof
      *
     c                   if        rglagr = c1flag
     c                   eval      rglagr = c1tlag
     c                   update    rgirpfr
     c                   endif
     c                   read      rgirpf
      *
     c                   enddo
      *
      * Kunder
      *
     c                   read      rkunpf
      *
     c                   dow       not %eof
      *
     c                   if        rklagr = c1flag
     c                   eval      rklagr = c1tlag
6.10 c                   time                    rkedat
6.10 c                   time                    rketim
6.10 c                   eval      rkesig = l_user
6.11 c                   time                    rk2dpt
6.11 c                   eval      rkepgm = 'LX705R    '
     c                   update    rkunpfr
     c                   endif
     c                   read      rkunpf
      *
     c                   enddo
      *
      * Leverandører
      *
     c                   read      rlevpf
      *
     c                   dow       not %eof
      *
     c                   if        rllagr = c1flag
     c                   eval      rllagr = c1tlag
6.10 c                   time                    rledat
6.10 c                   time                    rletim
6.10 c                   eval      rlesig = l_user
6.11 c                   time                    rl2dpt
6.11 c                   eval      rlepgm = 'LX705R    '
     c                   update    rlevpfr
     c                   endif
     c                   read      rlevpf
      *
     c                   enddo
      *
      * Inng-faktura linje
      *
     c                   read      sidtpf
      *
     c                   dow       not %eof
      *
     c                   if        sllage = c1flag
     c                   eval      sllage = c1tlag
6.10 c                   time                    sledat
6.10 c                   time                    sletim
6.10 c                   eval      sleusr = l_user
     c                   update    sidtpfr
     c                   endif
     c                   read      sidtpf
      *
     c                   enddo
      *
      * Inng-faktura hode
      *
     c                   read      sihepf
      *
     c                   dow       not %eof
      *
     c                   if        shlage = c1flag
     c                   eval      shlage = c1tlag
6.10 c                   time                    shedat
6.10 c                   time                    shetim
6.10 c                   eval      sheusr = l_user
     c                   update    sihepfr
     c                   endif
     c                   read      sihepf
      *
     c                   enddo
      *
      * Innkjøpsstatistikk
      *
     c                   read      sistpf
      *
     c                   dow       not %eof
      *
     c                   if        silage = c1flag
     c                   eval      silage = c1tlag
     c                   update    sistpfr
     c                   endif
     c                   read      sistpf
      *
     c                   enddo
      *
      * Kunde akkumuleringsstatistikk
      *
     c                   read      skakpf
      *
     c                   dow       not %eof
      *
     c                   if        salage = c1flag
     c                   eval      salage = c1tlag
     c                   update    skakpfr
     c                   endif
     c                   read      skakpf
      *
     c                   enddo
      *
      * Kunde budsjett
      *
     c                   read      skbupf
      *
     c                   dow       not %eof
      *
     c                   if        sblage = c1flag
     c                   eval      sblage = c1tlag
     c                   update    skbupfr
     c                   endif
     c                   read      skbupf
      *
     c                   enddo
      *
      * Kunde arbeidsregister
      *
     c                   read      skwwpf
      *
     c                   dow       not %eof
      *
     c                   if        sflage = c1flag
     c                   eval      sflage = c1tlag
     c                   update    skwwpfr
     c                   endif
     c                   read      skwwpf
      *
     c                   enddo
      *
      * Leverandør akkumulering
      *
     c                   read      slakpf
      *
     c                   dow       not %eof
      *
     c                   if        shlage = c1flag
     c                   eval      shlage = c1tlag
     c                   update    slakpfr
     c                   endif
     c                   read      slakpf
      *
     c                   enddo
      *
      * Leverandør budsjett
      *
     c                   read      slbupf
      *
     c                   dow       not %eof
      *
     c                   if        sclage = c1flag
     c                   eval      sclage = c1tlag
     c                   update    slbupfr
     c                   endif
     c                   read      slbupf
      *
     c                   enddo
      *
      * Leverandør arbeidsregister
      *
     c                   read      slwwpf
      *
     c                   dow       not %eof
      *
     c                   if        silage = c1flag
     c                   eval      silage = c1tlag
     c                   update    slwwpfr
     c                   endif
     c                   read      slwwpf
      *
     c                   enddo
      *
      * Faktura linje
      *
     c                   read      sodtpf
      *
     c                   dow       not %eof
      *
     c                   if        sdlage = c1flag
     c                   eval      sdlage = c1tlag
6.10 c                   time                    sdedat
6.10 c                   time                    sdetim
6.10 c                   eval      sdeusr = l_user
     c                   update    sodtpfr
     c                   endif
     c                   read      sodtpf
      *
     c                   enddo
      *
      * Faktura hode
      *
     c                   read      sohepf
      *
     c                   dow       not %eof
      *
     c                   if        solage = c1flag
     c                   eval      solage = c1tlag
6.10 c                   time                    soedat
6.10 c                   time                    soetim
6.10 c                   eval      soeusr = l_user
     c                   update    sohepfr
     c                   endif
     c                   read      sohepf
      *
     c                   enddo
      *
      * Salgsstatistikk
      *
     c                   read      sstapf
      *
     c                   dow       not %eof
      *
     c                   if        sflage = c1flag
     c                   eval      sflage = c1tlag
     c                   update    sstapfr
     c                   endif
     c                   read      sstapf
      *
     c                   enddo
      *
      * Historisk lagerbok
      *
     c                   read      vhispf
      *
     c                   dow       not %eof
      *
     c                   if        vhlage = c1flag
     c                   eval      vhlage = c1tlag
6.10 c                   time                    vhedat
6.10 c                   time                    vhetim
6.10 c                   eval      vheusr = l_user
     c                   update    vhispfr
     c                   endif
     c                   read      vhispf
      *
     c                   enddo
      *
      * Lager
      *
     c                   read      vlagpf
      *
     c                   dow       not %eof
      *
     c                   if        vllage = c1flag
     c                   eval      vllage = c1tlag
6.10 c                   time                    vledat
6.10 c                   time                    vletim
6.10 c                   eval      vleusr = l_user
     c                   update    vlagpfr
     c                   endif
     c                   read      vlagpf
      *
     c                   enddo
      *
      * Arbeidsfil ordreinngang
      *
     c                   read      wohepf
      *
     c                   dow       not %eof
      *
     c                   if        folage = c1flag
     c                   eval      folage = c1tlag
     c                   update    wohepfr
     c                   endif
     c                   read      wohepf
      *
     c                   enddo
      *
      * Brukerregisteret
      *
6.13 c**>                read      ausrpf
6.13  **>
6.13 c**>                dow       not %eof
6.13  **>
6.13 c**>                if        ablagr = c1flag
6.13 c**>                eval      ablagr = c1tlag
6.13 c**>                time                    abedat
6.13 c**>                time                    abetim
6.13 c**>                eval      abeusr = l_user
6.13 c**>                update    ausrpfr
6.13 c**>                endif
6.13 c**>                read      ausrpf
6.13  **>
6.13 c**>                enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for lager-kode
      *
     c     ra10l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra10l1_kode
      *
     c                   endsr
