     h option(*nodebugio : *srcstmt) datedit(*dmy)
      /TITLE  Spesial program - lageroppdatering
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  System  . . . . : ASLAGR
      *  Program . . . . : LX743R
      *  Beskrivelse . . : Oppdatering/insert lagerlokasjon
      *                    fra ekstern fil.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Spesialversjon. : Excel-fil med lagerinfo
      *  Tilpasset for . :
      *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.
      * --------- ------  --------------------------------------------------
      *           040619  Nytt program                             bkv
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     flwexpf    if   e           k disk
     fmdlolu    uf a e           k disk    rename(mdlopfr:mdlolur)
      *
      *
     d  d_lage         s              2
     d  d_loka         s              8
     d  d_lbes         s             30
      *
      *  UDS Local Data Area
      *
     d                uds
     d l_firm                944    946  0
     d l_user                911    920
      *
      *  Definering av variable i nøkler
      *
     d mdlolu_lage     s                   like(mdlage)
     d mdlolu_loka     s                   like(mdloka)
      *
      *  Definering av variable
      *
     d w_firm          s                   like(mdfirm)
     d w_posi          s              2  0
      *
     d b_skaf          s              1    inz(*off)
     d b_akti          s              1    inz(*off)
     d b_ok            s              1    inz(*off)
      *
     d digits          c                   ' 0123456789'
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Lese ekstern fil for å hente neste vare for behandling
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
      *  Lese file
      *
     c                   read      lwexpf                                 90
     c                   dow       *in90 = *off
     c                   exsr      utled_ds
      *
      *  Sjekk at ikke heading-rad er lest inn
      *
     c                   if        b_ok = *on
     c                   exsr      behand
     c                   endif
      *
     c                   read      lwexpf                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Oppdatering av LAGER-informasjon
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     behand        begsr
     c                   eval      b_akti = *off
     c                   eval      b_skaf = *off
      *
      *
      *
     c                   move      d_lage        mdlolu_lage
     c                   eval      mdlolu_loka = d_loka
     c     mdlolu_key    chain     mdlolur
     c                   if        not %found
     c                   eval      mdfirm = w_firm
     c                   move      d_lage        mdlage
     c                   eval      mdloka = d_loka
     c                   eval      mdlbes = d_lbes
     c                   time                    mdodat
     c                   time                    mdotim
     c                   eval      mdousr = l_user
     c                   time                    mdedat
     c                   time                    mdetim
     c                   eval      mdeusr = l_user
     c                   write     mdlolur
     c                   else
     c                   unlock    mdlolu
     c*                   eval      mdlbes = d_lbes
     c*                   time                    mdedat
     c*                   time                    mdetim
     c*                   eval      mdeusr = l_user
     c*                   update    mdlolur
     c                   endif
      *
     c     behand_ut     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for utleding av datastruktur
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     utled_ds      begsr
      *
     c     '"':' '       xlate     exclin        exclin
      *
      * Lager
      *
     c                   eval      w_posi = %scan(';':exclin)
     c                   eval      d_lage = %trim(%subst(exclin:1:w_posi-1))
     c                   if        d_lage = *blank
     c                   leavesr
     c                   endif
     c                   if        %check(digits : d_lage) <>0
     c                   leavesr
     c                   endif
      *
      * Lagerlokasjon
      *
     c                   eval      exclin = %subst(exclin:w_posi+1:512-w_posi)
     c                   eval      w_posi = %scan(';':exclin)
     c                   eval      d_loka = %trim(%subst(exclin:1:w_posi-1))
      *
      * Beskrivelse
      *
     c                   eval      exclin = %subst(exclin:w_posi+1:512-w_posi)
     c                   eval      w_posi = %scan(';':exclin)
     c                   if        w_posi > 0
     c                   eval      d_lbes = %trim(%subst(exclin:1:w_posi-1))
     c                   else
     c                   eval      d_lbes = %trim(%subst(exclin:1:30))
     c                   endif
      *
     c                   eval      b_ok = *on
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppdatering av lagerlokasjon
      *
     c     mdlolu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    mdlolu_lage
     c                   kfld                    mdlolu_loka
      *
      *  Legge inn opplysninger i nøklene
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
