     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASLAGR
      * Program . . . . : LX898R
      * Beskrivelse . . : Fjerner logg som ikke er knyttet til bestillinger
      *                   Rydder også gammel logg, hvis logg er eldre
      *                   enn bestillingsdato (+ halv år)
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       240713 bof  Nytt program
6.nu  *       100614 bof  Gjennomgått mtp. nummerutvidelse
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fllogl1    if   e           k disk    rename(llogpfr:llogl1r)
     flohel1    if   e           k disk    rename(lohepfr:lohel1r)
     flloglu    uf   e           k disk    rename(llogpfr:lloglur)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
      *
      * Definering av variable i nøkler
      *
     d lloglu_firm     s                   like(lmfirm)
     d lloglu_numm     s                   like(lmnumm)
     d lloglu_suff     s                   like(lmsuff)
     d lloglu_kode     s                   like(lmkode)
     d lloglu_date     s                   like(lmdate)
     d lloglu_time     s                   like(lmtime)
     d lohel1_firm     s                   like(lofirm)
     d lohel1_numm     s                   like(lonumm)
      *
      * Definering av variable
      *
     d w_firm          s                   like(lofirm)
     d b_best          s              1    inz(*off)
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   read      llogl1
     c                   dow       not %eof(llogl1)
      *
     c                   eval      b_best = *off
      *
     c                   eval      lohel1_firm = lmfirm
     c                   eval      lohel1_numm = lmnumm
     c     lohel1_key    setll     lohel1
     c     lohel1_key    reade     lohel1
     c                   dow       not %eof(lohel1)
     c                   eval      b_best = *on
     c     lohel1_key    reade     lohel1
     c                   enddo
      *
     c                   if        b_best = *off
      *
     c                   eval      lloglu_firm = lmfirm
     c                   eval      lloglu_numm = lmnumm
     c                   eval      lloglu_suff = lmsuff
     c                   eval      lloglu_kode = lmkode
     c                   eval      lloglu_date = lmdate
     c                   eval      lloglu_time = lmtime
     c     lloglu_key    chain     lloglu
     c                   if        %found(lloglu)
     c                   delete    lloglur
     c                   endif
      *
     c                   endif
      *
     c     les_neste     tag
     c                   read      llogl1
     c                   enddo
      *
      * Avslutt program
      *
     c                   eval      *inlr = *on
     c                   return
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Key for oppdatering av LAGER
      *
     c     lloglu_key    klist
     c                   kfld                    lloglu_firm
     c                   kfld                    lloglu_numm
     c                   kfld                    lloglu_suff
     c                   kfld                    lloglu_kode
     c                   kfld                    lloglu_date
     c                   kfld                    lloglu_time
      *
      *  Key for les av bestilling
      *
     c     lohel1_key    klist
     c                   kfld                    lohel1_firm
     c                   kfld                    lohel1_numm
      *
     c                   endsr
