      /TITLE  Kontroll av gyldig lager
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : MD710R                                              *
      * Beskrivelse . . : Kontroll av gyldig lagerlokasjon                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *           060909  Nytt program                                   ASK  *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                       *
      *  BRUK AV INDIKATORER                                                  *
      *                                                                       *
      *    60-61 = Fileindikatorer chain etc.                                 *
      *                                                                       *
      *  BRUK AV RETURKODE                                                    *
      *                                                                       *
      *  Kode i statusfelt(p_stat = N) : post finnes ikke                     *
      *                                                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fmdlol1    if   e           k disk    rename(mdlopfr:mdlol1r)
      *
     d w_firm          s                   like(mdfirm)
      *
     d p_stat          s              1
     d p_lage          s                   like(mdlage)
     d p_loka          s                   like(mdloka)
     d p_lbes          s                   like(mdlbes)
      *
     d mdlol1_lage     s                   like(mdlage)
     d mdlol1_loka     s                   like(mdloka)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Sjekke kode
      *
     c                   eval      mdlol1_lage = p_lage                                      .
     c                   eval      mdlol1_loka = p_loka                                      .
     c     mdlol1_key    chain     mdlol1r
      *
     c                   if        not %found                                            .....
     c                   eval      p_stat = 'N'                                              .
     c                   eval      p_lbes = 'Koden er ugyldig  '                             .
     c                   else                                                            .....
     c                   eval      p_stat = *blank                                           .
     c                   eval      p_lbes = mdlbes                                           .
     c                   endif                                                           .....
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     slutt         tag
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     *inzsr        begsr
      *
     c                   eval      w_firm = l_firm
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_stat
     c                   parm                    p_lage
     c                   parm                    p_loka
     c                   parm                    p_lbes
      *
      * Key for kode
      *
     c     mdlol1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    mdlol1_lage
     c                   kfld                    mdlol1_loka
      *
     c                   endsr
