     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASLAGR                                              *
      * Program . . . . : MJ500R                                              *
      * Beskrivelse . . : Kontroll av gyldig logistikkpunkt                   *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *           260505  Nytt program                                   ASK  *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                       *
      *  BRUK AV INDIKATORER                                                  *
      *                                                                       *
      *    60-61 = Fileindikatorer chain etc.                                 *
      *                                                                       *
      *  BRUK AV RETURKODE                                                    *
      *                                                                       *
      *  Kode i statusfelt(p_stat = N) : post finnes ikke                     *
      *                                                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fmjlol1    if   e           k disk    rename(mjlopfr:mjlol1r)
      *
      * Definering av LDA
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av parametre
      *
     d p_stat          s              1
     d p_lage          s                   like(mjlage)
     d p_avde          s                   like(mjavde)
     d p_skaf          s                   like(mjskaf)
     d p_eann          s                   like(mjeann)
     d p_sted          s                   like(mjsted)
     d p_adr1          s                   like(mjadr1)
     d p_adr2          s                   like(mjadr2)
     d p_pste          s                   like(mjpste)
      *
      * Definering av variabler i nøkler
      *
     d mjlol1_lage     s                   like(mjlage)
     d mjlol1_avde     s                   like(mjavde)
     d mjlol1_skaf     s                   like(mjskaf)
      *
      * Definering av variable
      *
     d w_firm          s                   like(mjfirm)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekke logistikkpunkt
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Bygg opp full key
      *
5.20 c                   eval      mjlol1_lage = p_lage
     c                   eval      mjlol1_avde = p_avde
     c                   eval      mjlol1_skaf = p_skaf
      *
      * Skaffeordre?
      *
      * Sjekk full key
      *
     c                   if        p_skaf <> *blank
      *
     c     mjlol1_key    chain     mjlol1
     c                   if        %found
     c                   eval      p_stat = *blank                                           .
     c                   eval      p_eann = mjeann                                           .
     c                   eval      p_sted = mjsted                                           .
     c                   eval      p_adr1 = mjadr1                                           .
     c                   eval      p_adr2 = mjadr2                                           .
     c                   eval      p_pste = mjpste                                           .
     c                   goto      end_pgm
     c                   endif                                                           .....
      *
      * Sjekk uten avdeling
      *
     c                   eval      mjlol1_avde = 0
     c     mjlol1_key    chain     mjlol1
     c                   if        %found
     c                   eval      p_stat = *blank                                           .
     c                   eval      p_eann = mjeann                                           .
     c                   eval      p_sted = mjsted                                           .
     c                   eval      p_adr1 = mjadr1                                           .
     c                   eval      p_adr2 = mjadr2                                           .
     c                   eval      p_pste = mjpste                                           .
     c                   goto      end_pgm
     c                   endif                                                           .....
      *
      * Sjekk uten skaffekode
      *
5.20 c                   eval      mjlol1_lage = p_lage
     c                   eval      mjlol1_avde = p_avde
     c                   eval      mjlol1_skaf = *blank
      *
     c                   endif                                                           .....
      *
      * Ikke skaffeordre
      *
      * Sjekk full key
      *
     c     mjlol1_key    chain     mjlol1
     c                   if        %found
     c                   eval      p_stat = *blank                                           .
     c                   eval      p_eann = mjeann                                           .
     c                   eval      p_sted = mjsted                                           .
     c                   eval      p_adr1 = mjadr1                                           .
     c                   eval      p_adr2 = mjadr2                                           .
     c                   eval      p_pste = mjpste                                           .
     c                   goto      end_pgm
     c                   endif                                                           .....
      *
      * Sjekk uten avdeling
      *
     c                   eval      mjlol1_avde = 0
     c     mjlol1_key    chain     mjlol1
     c                   if        %found
     c                   eval      p_stat = *blank                                           .
     c                   eval      p_eann = mjeann                                           .
     c                   eval      p_sted = mjsted                                           .
     c                   eval      p_adr1 = mjadr1                                           .
     c                   eval      p_adr2 = mjadr2                                           .
     c                   eval      p_pste = mjpste                                           .
     c                   goto      end_pgm
     c                   endif                                                           .....
      *
      * Ikke funnet
      *
     c                   eval      p_stat = 'N'                                              .
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     c     end_pgm       tag
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     c     *inzsr        begsr
      *
     c                   eval      w_firm = l_firm
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_stat
     c                   parm                    p_lage
     c                   parm                    p_avde
     c                   parm                    p_skaf
     c                   parm                    p_eann
     c                   parm                    p_sted
     c                   parm                    p_adr1
     c                   parm                    p_adr2
     c                   parm                    p_pste
      *
      * Key for logistikkpunkt
      *
     c     mjlol1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    mjlol1_lage
     c                   kfld                    mjlol1_avde
     c                   kfld                    mjlol1_skaf
      *
     c                   endsr
