     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASLOGI
      * Program . . . . : MM100R
      * Beskrivelse . . : Matrise - Bestillingsmengde / Sikkerhetstid
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       250804 bø   Nytt program
5.50  *       291106 bø   Rettelse i forb. med kopiering og varesortm.
5.51  *       040108 bø   Lagt inn leveringstype i parameter
5.52  *       210508 tsv  Sperrer samtidig varenr + andre kriterier.
      * 6.10  170609 BSA  Oppdatert med sporingsinformasjon
6.20  * 6.20  121110 bof  Utvidet med lager på sortiment
6.21  * 6.20  111113 bof  utvidet parameterkall til VC500R
7.xx  * 7.00  210316 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS          *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      *       LR = Avslutt program
      *       10 = Rollup
      *       11 = Rolldown
      *       12 = Sfldsp
      *       13 = Sfldspctl
      *       14 = Sflclr
      *       15 = Sflend
      *       21 = Home-key
      *       22 = Plassering av cursor
      *       30 = Protect av felter ved vise
      *    31-79 = Varsle m/feilmeldinger/skjermindikatorer
      *    80-99 = Arbeidsindikatorer
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fmmatl1    if   e           k disk    rename(mmatpfr:mmatl1r)
     fmmatl3    if   e           k disk    rename(mmatpfr:mmatl3r)
     fmmatl4    if   e           k disk    rename(mmatpfr:mmatl4r)
     fmmatl5    if   e           k disk    rename(mmatpfr:mmatl5r)
     fmmatl6    if   e           k disk    rename(mmatpfr:mmatl6r)
     fmmatlr    if   e           k disk    rename(mmatpfr:mmatlrr)
     fmmatlu    uf a e           k disk    rename(mmatpfr:mmatlur)
     fvogrl1    if   e           k disk    rename(vogrpfr:vogrl1r)
     fvhgrl1    if   e           k disk    rename(vhgrpfr:vhgrl1r)
     fvugrl1    if   e           k disk    rename(vugrpfr:vugrl1r)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     fvshel1    if   e           k disk    rename(vshepfr:vshel1r)
      *
     fmm100d    cf   e             workstn sfile(b1sfl:w_srrn)
     f                                     infds(dspfbk)
      *
      * tabeller
      *
     d a_lage          s              2  0 DIM(10)
     d a_ltyp          s              1  0 DIM(10)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av Informmtion Data Structure - display feedback
      *
     d dspfbk          ds
     d  d_fcrn               378    379I 0
      *
      * Definering av variabler i nøkler
      *
     d mmatl1_vsor     s                   like(mmvsor)
     d mmatl3_ogrp     s                   like(mmogrp)
     d mmatl3_hgrp     s                   like(mmhgrp)
     d mmatl3_ugrp     s                   like(mmugrp)
     d mmatl4_ldor     s                   like(mmldor)
     d mmatl5_vare     s                   like(mmvare)
     d mmatl6_lage     s                   like(mmlage)
     d mmatlr_vsor     s                   like(mmvsor)
     d mmatlr_ogrp     s                   like(mmogrp)
     d mmatlr_hgrp     s                   like(mmhgrp)
     d mmatlr_ugrp     s                   like(mmugrp)
     d mmatlr_ldor     s                   like(mmldor)
     d mmatlr_vare     s                   like(mmvare)
     d mmatlr_crdo     s                   like(mmcrdo)
     d mmatlu_vsor     s                   like(mmvsor)
     d mmatlu_ogrp     s                   like(mmogrp)
     d mmatlu_hgrp     s                   like(mmhgrp)
     d mmatlu_ugrp     s                   like(mmugrp)
     d mmatlu_ldor     s                   like(mmldor)
     d mmatlu_vare     s                   like(mmvare)
     d mmatlu_crdo     s                   like(mmcrdo)
     d vvarl1_vare     s                   like(vvvare)
     d vogrl1_oogr     s                   like(vgoogr)
     d vhgrl1_hhgr     s                   like(vghogr)
     d vugrl1_uugr     s                   like(vguugr)
     d vshel1_vsor     s                   like(vcvsor)
6.20 d vshel1_lage     s                   like(vclage)
      *
      * Definering av variable
      *
     d w_fcrn          s              4  0
     d w_stel          s              4  0
     d w_spge          s              4  0
     d w_srrn          s              4  0
     d w_sfrn          s                   like(w_srrn)
     d w_ssrn          s                   like(w_srrn)
      *
     d w_seqe          s              1
     d b_oppr          s              1    inz(*off)
     d b_forn          s              1    inz(*off)
     d b_anul          s              1    inz(*off)
     d b_feil          s              1    inz(*off)
      *
     d w_firm          s                   like(mmfirm)
     d w_vsor          s                   like(mmvsor)
     d w_ogrp          s                   like(mmogrp)
     d w_hgrp          s                   like(mmhgrp)
     d w_ugrp          s                   like(mmugrp)
     d w_crdo          s                   like(mmcrdo)
     d w_vare          s                   like(mmvare)
     d w_lagr          s                   like(mmlagr)
     d w_antu          s                   like(mmantu)
     d w_vtxt          s             35
     d w_navn          s             30
     d w_datoiso       s               d   datfmt(*iso)
     d w_dag           s              2  0
     d w_mnd           s              2  0
     d w_stat          s              1
     d w_jkod          s              2  0
     d w_jtxt          s             30
     d w_pogrp         s                   like(mmogrp)
     d w_phgrp         s                   like(mmhgrp)
     d w_pugrp         s                   like(mmugrp)
     d w_pldor         s                   like(mmldor)
     d w_pvare         s                   like(mmvare)
     d w_pcrdo         s                   like(mmcrdo)
     d w_plage         s              2
     d w_ldor          s                   like(mmldor)
     d w_ltxt          s             30
     d w_vsna          s             30
     d w_ogna          s             30
     d w_hgna          s             30
     d w_ugna          s             30
     d w_lena          s             30
     d w_vana          s             30
     d w_lana          s             30
6.21 d w_lage          s                   like(mmlage)
      *
     d s_vsor          s                   like(mmvsor)
     d s_ogrp          s                   like(mmogrp)
     d s_hgrp          s                   like(mmhgrp)
     d s_ugrp          s                   like(mmugrp)
     d s_ldor          s                   like(mmldor)
     d s_vare          s                   like(mmvare)
     d s_crdo          s                   like(mmcrdo)
     d w_list          s            128
      *
      * Definering av konstanter
      *
7.xx d c_sfil          s              2  0 inz(13)
      *
     d                 ds
     d d_list                       128
     d  d_vsor                       10    overlay(d_list)
     d  d_ogrp                        2  0 overlay(d_list:11)
     d  d_hgrp                        2  0 overlay(d_list:13)
     d  d_ugrp                        3  0 overlay(d_list:15)
     d  d_ldor                        6  0 overlay(d_list:18)
     d  d_vare                        8  0 overlay(d_list:24)
     d  d_crdo                        1  0 overlay(d_list:32)
     d  d_dato                        6  0 overlay(d_list:33)
     d  d_antu                        2  0 overlay(d_list:39)
      *
     d d_lagr          ds
     d  d_la01                        2  0
     d  d_la02                        2  0
     d  d_la03                        2  0
     d  d_la04                        2  0
     d  d_la05                        2  0
     d  d_la06                        2  0
     d  d_la07                        2  0
     d  d_la08                        2  0
     d  d_la09                        2  0
     d  d_la10                        2  0
      *
     d d_ltyp          ds
     d  d_lty1                        1  0
     d  d_lty2                        1  0
     d  d_lty3                        1  0
     d  d_lty4                        1  0
     d  d_lty5                        1  0
     d  d_lty6                        1  0
     d  d_lty7                        1  0
     d  d_lty8                        1  0
     d  d_lty9                        1  0
     d  d_lty0                        1  0
      * Forklaring på spesielle felter
      * som benyttes ved sub-files.
      * - - - - - - - - - - - - - - - - -
      * w_fcrn - Første recordnummer på siden
      * w_stel - Subfile-teller
      * w_spge - Sidestørrelse i subfile (page)
      * w_srrn - Relativt recordnummer i subfile
      * w_sfrn - Første recordnummer på siste side
      * w_ssrn - Siste recordnummer på siste side
      * w_curn - Current recordnummer på siden
      * w_virn - Side og cursorplassering som skal vises
      * w_afld - Aktivt feltnavn
      * w_arow - Aktiv rad for cursor
      * w_acol - Aktiv kolonne for cursor
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      * B1SFL  - B1 Subfile - record
      * B2CTL  - B2 Subfile - control record
      * B2CMD  - B2 Eget skjermbilde for CMD-taster
      * C1BLD  - C1 Skjermbilde for innlegging av nøkkel ved oppretting
      * C1MSG  - C1 Meldingsbilde for C1BLD
      * C2BLD  - C2 Skjermbilde for opprette/endre/vise
      * D1WIN  - D1 Vindu for slette (Delete)
      * K1WIN  - K1 Vindu for kopiere
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B2CTL Behandle åpningsbildet med subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Send Alt
      *
     c     b2taga        tag
      *
     c                   write     b2cmd
      *
      * Bare data
      *
     c     b2tagb        tag
      *
     c                   exsr      dsp_subfile
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      b2tagb
     c                   when      *inke
     c                   exsr      forny
     c                   goto      b2tagb
     c                   when      *inkf
     c                   exsr      xc1bld
     c                   goto      b2taga
     c                   when      *inki
     c                   call      'MC110R  '
     c                   goto      b2taga
     c                   when      *in10
     c                   exsr      crt_subfile
     c                   goto      b2tagb
     c                   when      *in11
     c                   exsr      bck_subfile
     c                   goto      b2tagb
     c                   when      *in21
     c                   eval      *in22 = *on
     c                   goto      b2taga
     c                   endsl
      *
      * Posisjonering
      *
     c                   if        b2vsor <> *blank or
     c                             b2ogrp <> 0      or
     c                             b2hgrp <> 0      or
     c                             b2ugrp <> 0      or
     c                             b2ldor <> 0      or
     c                             b2vare <> *blank or
     c                             b2lage <> 0
     c                   exsr      posisjoner
     c                   goto      b2tagb
     c                   endif
      *
      * Behandling av subfile
      *
     c                   exsr      subfile
      *
     c                   goto      b2taga
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for fornying av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     forny         begsr
      *
     c                   if        w_fcrn <> 0
     c     w_fcrn        chain     b1sfl
     c                   endif
      *
     c                   select
     c                   when      w_seqe = 'B'
     c                   eval      mmatl3_ogrp = b1ogrp
     c     mmatl3_key    setll     mmatl3
     c                   when      w_seqe = 'C'
     c                   eval      mmatl4_ldor = b1ldor
     c     mmatl4_key    setll     mmatl4
     c                   when      w_seqe = 'D'
     c                   movel     b1vare        mmatl5_vare
     c     mmatl5_key    setll     mmatl5
     c                   when      w_seqe = 'E'
     c                   eval      mmatl6_lage = b1lage
     c     mmatl6_key    setll     mmatl6
     c                   other
     c                   eval      mmatl1_vsor = b1vsor
     c     mmatl1_key    setll     mmatl1
     c                   endsl
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for posisjonering i subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     posisjoner    begsr
      *
      * Varesortiment
      *
     c                   if        b2vsor <> *blank
     c                   eval      w_seqe = ' '
     c                   eval      mmatl1_vsor = b2vsor
     c     mmatl1_key    setll     mmatl1
     c                   goto      end_pos
     c                   endif
      *
      * Overgruppe + hovedgruppe + undergruppe
      *
     c                   if        b2ogrp <> 0 and
     c                             b2hgrp <> 0 and
     c                             b2ugrp <> 0
     c                   eval      w_seqe = 'B'
     c                   eval      mmatl3_ogrp = b2ogrp
     c                   eval      mmatl3_hgrp = b2hgrp
     c                   eval      mmatl3_ugrp = b2ugrp
     c     mmatl3b_key   setll     mmatl3
     c                   goto      end_pos
     c                   endif
      *
      * Overgruppe + hovedgruppe
      *
     c                   if        b2ogrp <> 0 and
     c                             b2hgrp <> 0
     c                   eval      w_seqe = 'B'
     c                   eval      mmatl3_ogrp = b2ogrp
     c                   eval      mmatl3_hgrp = b2hgrp
     c     mmatl3a_key   setll     mmatl3
     c                   goto      end_pos
     c                   endif
      *
      * Overgruppe
      *
     c                   if        b2ogrp <> 0
     c                   eval      w_seqe = 'B'
     c                   eval      mmatl3_ogrp = b2ogrp
     c     mmatl3_key    setll     mmatl3
     c                   goto      end_pos
     c                   endif
      *
      * Overgruppe + hovedgruppe + undergruppe
      *
     c                   if        b2ugrp <> 0
     c                   eval      w_seqe = 'B'
     c                   eval      mmatl3_ogrp = b2ogrp
     c                   eval      mmatl3_hgrp = b2hgrp
     c                   eval      mmatl3_ugrp = b2ugrp
     c     mmatl3b_key   setll     mmatl3
     c                   goto      end_pos
     c                   endif
      *
      * Leverandør
      *
     c                   if        b2ldor <> 0
     c                   eval      w_seqe = 'C'
     c                   eval      mmatl4_ldor = b2ldor
     c     mmatl4_key    setll     mmatl4
     c                   goto      end_pos
     c                   endif
      *
      * Varenr.
      *
     c                   if        b2vare <> *blank
     c                   eval      w_seqe = 'D'
     c                   movel     b2vare        mmatl5_vare
     c     mmatl5_key    setll     mmatl5
     c                   goto      end_pos
     c                   endif
      *
      * Lager
      *
     c                   if        b2lage <> 0
     c                   eval      w_seqe = 'E'
     c                   eval      mmatl6_lage = b2lage
     c     mmatl6_key    setll     mmatl6
     c                   goto      end_pos
     c                   endif
      *
     c     end_pos       tag
      *
      * Blanker subfile, og fyller opp i.h.t. posisjonering
      *
     c                   eval      *in22 = *off
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
      * Blanker posisjoneringsfelter
      *
     c                   eval      b2ogrp = 0
     c                   eval      b2hgrp = 0
     c                   eval      b2ugrp = 0
     c                   eval      b2vsor = *blank
     c                   eval      b2vare = *blank
     c                   eval      b2ldor = 0
     c                   eval      b2lage = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     subfile       begsr
      *
     c                   eval      b_forn = *off
      *
     c                   if        *in22 = *off
     c                   eval      *in22 = *on
     c                   else
     c                   eval      *in22 = *off
     c                   endif
      *
     c                   eval      w_virn = w_fcrn
      *
      * Leser og behandler subfile
      *
     c                   do        w_ssrn
     c                   readc     b1sfl
      *
     c                   if        %eof
     c                   leave
     c                   endif
      *
     c                   eval      *in22 = *off
     c                   eval      w_virn = w_srrn
      *
      * Endre
      *
     c                   if        b1valg = 2
     c                   eval      c1vsor = b1vsor
     c                   eval      c1ogrp = b1ogrp
     c                   eval      c1hgrp = b1hgrp
     c                   eval      c1ugrp = b1ugrp
     c                   eval      c1vare = b1vare
     c                   eval      c1ldor = b1ldor
     c                   eval      c1crdo = b1crdo
     c                   exsr      xc2bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Kopier
      *
     c                   if        b1valg = 3
     c                   eval      k1vsor = b1vsor
     c                   eval      k1ogrp = b1ogrp
     c                   eval      k1hgrp = b1hgrp
     c                   eval      k1ugrp = b1ugrp
     c                   eval      k1ldor = b1ldor
     c                   eval      k1vare = b1vare
     c                   eval      k1crdo = b1crdo
     c                   exsr      xk1win
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Slett
      *
     c                   if        b1valg = 4
     c                   eval      d1vsor = b1vsor
     c                   eval      d1ogrp = b1ogrp
     c                   eval      d1hgrp = b1hgrp
     c                   eval      d1ugrp = b1ugrp
     c                   eval      d1ldor = b1ldor
     c                   eval      d1vare = b1vare
     c                   eval      d1crdo = b1crdo
     c                   exsr      xd1win
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Vis
      *
     c                   if        b1valg = 5
     c                   eval      c1vsor = b1vsor
     c                   eval      c1ogrp = b1ogrp
     c                   eval      c1hgrp = b1hgrp
     c                   eval      c1ugrp = b1ugrp
     c                   eval      c1vare = b1vare
     c                   eval      c1ldor = b1ldor
     c                   eval      c1crdo = b1crdo
     c                   exsr      xc2bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Kjør prognose
      *
     c                   if        b1valg = 7
     c                   eval      l1vsor = b1vsor
     c                   eval      l1ogrp = b1ogrp
     c                   eval      l1hgrp = b1hgrp
     c                   eval      l1ugrp = b1ugrp
     c                   eval      l1vare = b1vare
     c                   eval      l1ldor = b1ldor
     c                   eval      l1crdo = b1crdo
     c                   eval      w_antu = b1antu
     c                   if        b1lage <> 0
     c                   move      b1lage        l1lage
     c                   else
     c                   eval      l1lage = *blank
     c                   endif
     c                   exsr      xl1win
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Se på resultat for akkurat dette parameteret
      *
     c                   if        b1valg = 8
     c                   eval      w_vsor = b1vsor
     c                   eval      w_ogrp = b1ogrp
     c                   eval      w_hgrp = b1hgrp
     c                   eval      w_ugrp = b1ugrp
     c                   eval      w_vare = b1vare
     c                   eval      w_ldor = b1ldor
     c                   eval      w_crdo = b1crdo
     c                   call      'MM503R  '
     c                   parm                    w_vsor
     c                   parm                    w_ogrp
     c                   parm                    w_hgrp
     c                   parm                    w_ugrp
     c                   parm                    w_ldor
     c                   parm                    w_vare
     c                   parm                    w_crdo
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Sletter resultat
      *
     c                   if        b1valg = 9
     c                   eval      d2vsor = b1vsor
     c                   eval      d2ogrp = b1ogrp
     c                   eval      d2hgrp = b1hgrp
     c                   eval      d2ugrp = b1ugrp
     c                   eval      d2ldor = b1ldor
     c                   eval      d2vare = b1vare
     c                   eval      d2crdo = b1crdo
     c                   exsr      xd2win
      *
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Kjør hente innkjøpsstatistikk
      *
     c                   if        b1valg = 9
     c                   eval      d_vsor = b1vsor
     c                   eval      d_ogrp = b1ogrp
     c                   eval      d_hgrp = b1hgrp
     c                   eval      d_ugrp = b1ugrp
     c                   movel     b1vare        d_vare
     c                   eval      d_ldor = b1ldor
     c                   eval      d_crdo = b1crdo
     c                   eval      d_antu = b1antu
     c                   move      UDATE         d_dato
     c                   eval      w_list = d_list
     c                   call      'MM745R '
     c                   parm                    w_list
     c                   call      'MM733R '
     c                   parm                    w_list
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
     c                   enddo
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av skjermbilde for ny rad (C1BLD)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc1bld        begsr
      *
     c                   eval      b_oppr = *on
     c                   eval      b_forn = *off
      *
     c                   eval      c1vsor = *blank
     c                   eval      c1ogrp = 0
     c                   eval      c1hgrp = 0
     c                   eval      c1ugrp = 0
     c                   eval      c1ldor = 0
     c                   eval      c1crdo = 0
     c                   eval      c1vare = *blank
     c                   eval      c1ogna = *blank
     c                   eval      c1hgna = *blank
     c                   eval      c1ugna = *blank
     c                   eval      c1lena = *blank
     c                   eval      c1vana = *blank
      *
     c                   eval      c1vsor = b2vsor
     c                   eval      c1ogrp = b2ogrp
      *
     c     c1taga        tag
      *
     c                   exfmt     c1bld
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      end_c1bld
     c                   endsl
      *
5.52  * Sperrer samtidig varenr + andre kriterier.
 .   c                   if        c1vare <> *blank
      *
     c                   if        c1vsor <> *blank or
     c                             c1ogrp <> *zero  or
     c                             c1hgrp <> *zero  or
     c                             c1ugrp <> *zero  or
     c                             c1ldor <> *zero
     c                   exfmt     c1ms2
     c                   if        *inkc or *inkl
     c                   goto      end_c1bld
     c                   else
     c                   eval      c1vsor = *blank
     c                   eval      c1ogrp = *zero
     c                   eval      c1hgrp = *zero
     c                   eval      c1ugrp = *zero
     c                   eval      c1ldor = *zero
     c                   goto      c1taga
     c                   endif
     c                   endif
 .    *
5.52 c                   endif
      *
     C
      *
      * Spørring
      *
     c                   if        *inkd
     c                   exsr      spØrring
     c                   goto      c1taga
     c                   endif
      *
     c                   if        c1vsor <> *blank
     c                   eval      vshel1_vsor = c1vsor
6.20 c                   eval      vshel1_lage = 0
     c     vshel1_key    chain     vshel1
     c                   if        not %found(vshel1)
     c                   eval      *in34 = *on
     c                   goto      c1taga
     c                   endif
     c                   eval      c1vsna = vcbesk
     c                   endif
     c                   if        c1ogrp <> 0
     c                   eval      vogrl1_oogr = c1ogrp
     c     vogrl1_key    chain     vogrl1
     c                   if        not %found(vogrl1)
     c                   eval      *in31 = *on
     c                   goto      c1taga
     c                   endif
     c                   eval      c1ogna = vgotxt
     c                   endif
      *
     c                   if        c1hgrp <> 0
     c                   eval      vogrl1_oogr = c1ogrp
     c                   eval      vhgrl1_hhgr = c1hgrp
     c     vhgrl1_key    chain     vhgrl1
     c                   if        not %found(vhgrl1)
     c                   eval      *in32 = *on
     c                   goto      c1taga
     c                   endif
     c                   eval      c1hgna = vghtxt
     c                   endif
      *
     c                   if        c1ugrp <> 0
     c                   eval      vogrl1_oogr = c1ogrp
     c                   eval      vhgrl1_hhgr = c1hgrp
     c                   eval      vugrl1_uugr = c1ugrp
     c     vugrl1_key    chain     vugrl1
     c                   if        not %found(vugrl1)
     c                   eval      *in33 = *on
     c                   goto      c1taga
     c                   endif
     c                   eval      c1ugna = vgutxt
     c                   endif
      *
      * Sender opp informmsjonsbilde dersom rad finnes fra før
      *
     c                   eval      mmatlr_vsor = c1vsor
     c                   eval      mmatlr_ogrp = c1ogrp
     c                   eval      mmatlr_hgrp = c1hgrp
     c                   eval      mmatlr_ugrp = c1ugrp
     c                   eval      mmatlr_ldor = c1ldor
     c                   eval      mmatlr_vare = c1vare
     c                   eval      mmatlr_crdo = c1crdo
     c     mmatlr_key    chain     mmatlr
     c                   if        %found
     c                   exsr      xc1msg
     c                   if        b_anul = *on
     c                   goto      c1taga
     c                   endif
     c                   endif
      *
      * Kaller vedlikeholdsprogram
      *
     c                   exsr      xc2bld
      *
     c                   eval      c1vsor = *blank
     c                   eval      c1ogrp = 0
     c                   eval      c1hgrp = 0
     c                   eval      c1ugrp = 0
     c                   eval      c1ldor = 0
     c                   eval      c1crdo = 0
     c                   eval      c1lena = *blank
     c                   eval      c1vare = *blank
     c                   eval      c1vsna = *blank
     c                   eval      c1ogna = *blank
     c                   eval      c1hgna = *blank
     c                   eval      c1ugna = *blank
     c                   eval      c1lena = *blank
     c                   eval      c1vana = *blank
      *
     c                   goto      c1taga
      *
     c     end_c1bld     tag
      *
     c                   eval      b_oppr = *off
     c                   eval      b2ogrp = 0
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for utlegging av opprettelsesmelding
      * Meldingsbildet legges ut dersom det forsøkes å opprette en rad som
      * finnes fra før.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc1msg        begsr
      *
     c                   eval      b_anul = *off
      *
     c                   exfmt     c1msg
      *
      * Behandling av funksjonstaster
      *
     c                   if        *inkc or *inkl
     c                   eval      b_anul = *on
     c                   leavesr
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å behandle bilde for ny/endring/vise (C2BLD)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc2bld        begsr
      *
     c                   eval      w_arow = 0
     c                   eval      w_acol = 0
      *
     c                   eval      mmatlr_vsor = c1vsor
     c                   eval      mmatlr_ogrp = c1ogrp
     c                   eval      mmatlr_hgrp = c1hgrp
     c                   eval      mmatlr_ugrp = c1ugrp
     c                   eval      mmatlr_ldor = c1ldor
     c                   eval      mmatlr_vare = c1vare
     c                   eval      mmatlr_crdo = c1crdo
     c     mmatlr_key    chain     mmatlr
      *
     c                   if        %found
     c                   eval      w_vsor = c1vsor
     c                   eval      w_ogrp = c1ogrp
     c                   eval      w_hgrp = c1hgrp
     c                   eval      w_ugrp = c1ugrp
     c                   eval      w_ldor = c1ldor
     c                   eval      w_vare = c1vare
     c                   exsr      hent_txt
     c                   eval      c1vsna = w_vsna
     c                   eval      c1ogna = w_ogna
     c                   eval      c1hgna = w_hgna
     c                   eval      c1ugna = w_ugna
     c                   eval      c1vana = w_vana
     c                   eval      c1lena = w_lena
     c                   eval      c2akti = mmakti
     c                   eval      c2lage = mmlage
     c                   move      mmlagr        d_lagr
     c                   eval      a_lage(1) = d_la01
     c                   eval      a_lage(2) = d_la02
     c                   eval      a_lage(3) = d_la03
     c                   eval      a_lage(4) = d_la04
     c                   eval      a_lage(5) = d_la05
     c                   eval      a_lage(6) = d_la06
     c                   eval      a_lage(7) = d_la07
     c                   eval      a_lage(8) = d_la08
     c                   eval      a_lage(9) = d_la09
     c                   eval      a_lage(10) = d_la10
     c                   eval      c2lagr = %editw(a_lage(1):' 0') + ' ' +
     c                                      %editw(a_lage(2):' 0') + ' ' +
     c                                      %editw(a_lage(3):' 0') + ' ' +
     c                                      %editw(a_lage(4):' 0') + ' ' +
     c                                      %editw(a_lage(5):' 0') + ' ' +
     c                                      %editw(a_lage(6):' 0') + ' ' +
     c                                      %editw(a_lage(7):' 0') + ' ' +
     c                                      %editw(a_lage(8):' 0') + ' ' +
     c                                      %editw(a_lage(9):' 0') + ' ' +
     c                                      %editw(a_lage(10):' 0')
     c                   eval      a_ltyp(1) = mmlt01
     c                   eval      a_ltyp(2) = mmlt02
     c                   eval      a_ltyp(3) = mmlt03
     c                   eval      a_ltyp(4) = mmlt04
     c                   eval      a_ltyp(5) = mmlt05
     c                   eval      a_ltyp(6) = mmlt06
     c                   eval      a_ltyp(7) = mmlt07
     c                   eval      a_ltyp(8) = mmlt08
     c                   eval      a_ltyp(9) = mmlt09
     c                   eval      a_ltyp(10) = mmlt10
     c                   eval      c2ltyp = %editw(a_ltyp(1):'0') + ' ' +
     c                                      %editw(a_ltyp(2):'0') + ' ' +
     c                                      %editw(a_ltyp(3):'0') + ' ' +
     c                                      %editw(a_ltyp(4):'0') + ' ' +
     c                                      %editw(a_ltyp(5):'0') + ' ' +
     c                                      %editw(a_ltyp(6):'0') + ' ' +
     c                                      %editw(a_ltyp(7):'0') + ' ' +
     c                                      %editw(a_ltyp(8):'0') + ' ' +
     c                                      %editw(a_ltyp(9):'0') + ' ' +
     c                                      %editw(a_ltyp(10):'0')
     c                   eval      c2antu = mmantu
     c                   eval      c2brku = mmbrku
     c                   eval      c2antg = mmantg
     c                   eval      c2brkg = mmbrkg
     c                   eval      c2antp = mmantp
     c                   if        mmkdat <> *loval
     c     *dmy          move      mmkdat        c2kdat
     c                   else
     c                   eval      c2kdat = 0
     c                   endif
     c                   eval      c2eusr = mmuser
     c     *dmy          move      mmodat        c2odat
     c     *dmy          move      mmedat        c2edat
     c                   eval      c2dbax = mmdbax
     c                   eval      c2dbay = mmdbay
     c                   eval      c2dbaz = mmdbaz
     c                   eval      c2dbbx = mmdbbx
     c                   eval      c2dbby = mmdbby
     c                   eval      c2dbbz = mmdbbz
     c                   eval      c2dbcx = mmdbcx
     c                   eval      c2dbcy = mmdbcy
     c                   eval      c2dbcz = mmdbcz
     c                   eval      c2dsax = mmdsax
     c                   eval      c2dsay = mmdsay
     c                   eval      c2dsaz = mmdsaz
     c                   eval      c2dsbx = mmdsbx
     c                   eval      c2dsby = mmdsby
     c                   eval      c2dsbz = mmdsbz
     c                   eval      c2dscx = mmdscx
     c                   eval      c2dscy = mmdscy
     c                   eval      c2dscz = mmdscz
     c                   eval      c2lagt = mmlagt
     c                   else
     c                   eval      c2antp = 0
     c                   eval      c2antu = 0
     c                   eval      c2brku = 0
     c                   eval      c2antg = 0
     c                   eval      c2brkg = 0
     c                   eval      c2lage = 0
     c                   eval      c2lagr = *blank
     c                   eval      c2kdat = 0
     c                   eval      c2eusr = *blank
     c                   eval      c2odat = 0
     c                   eval      c2edat = 0
     c                   eval      c2dbax = 0
     c                   eval      c2dbay = 0
     c                   eval      c2dbaz = 0
     c                   eval      c2dbbx = 0
     c                   eval      c2dbby = 0
     c                   eval      c2dbbz = 0
     c                   eval      c2dbcx = 0
     c                   eval      c2dbcy = 0
     c                   eval      c2dbcz = 0
     c                   eval      c2dsax = 0
     c                   eval      c2dsay = 0
     c                   eval      c2dsaz = 0
     c                   eval      c2dsbx = 0
     c                   eval      c2dsby = 0
     c                   eval      c2dsbz = 0
     c                   eval      c2dscx = 0
     c                   eval      c2dscy = 0
     c                   eval      c2dscz = 0
     c                   eval      c2lagt = 0
     c                   endif
      *
     c                   if        b1valg = 3
     c                   eval      c1vsor = k1vsor
     c                   eval      c1ogrp = k1ogrp
     c                   eval      c1hgrp = k1hgrp
     c                   eval      c1ugrp = k1ugrp
     c                   eval      c1ldor = k1ldor
     c                   eval      c1vare = k1vare
     c                   eval      c1crdo = k1crdo
     c                   eval      w_vsor = k1vsor
     c                   eval      w_ogrp = k1ogrp
     c                   eval      w_hgrp = k1hgrp
     c                   eval      w_ugrp = k1ugrp
     c                   eval      w_ldor = k1ldor
     c                   eval      w_vare = k1vare
     c                   exsr      hent_txt
     c                   eval      c1vsna = w_vsna
     c                   eval      c1ogna = w_ogna
     c                   eval      c1hgna = w_hgna
     c                   eval      c1ugna = w_ugna
     c                   eval      c1vana = w_vana
     c                   eval      c1lena = w_lena
     c                   endif
      *
     c                   if        b1valg = 5
     c                   eval      *in30 = *on
     c                   endif
      *
     c     c2taga        tag
      *
     c                   exfmt     c2bld
      *
     c                   if        *inkc or *inkl or *in30
     c                   goto      end_c2bld
     c                   endif
      *
      * Spørring
      *
     c                   if        *inkd
     c                   exsr      spØrring
     c                   goto      c2taga
     c                   endif
      *
      * Validering av input
      *
     c                   if        c2antp > 3
     c                   eval      *in31 = *on
     c                   goto      c2taga
     c                   endif
      *
      *
      * Oppdatering
      *
     c                   clear                   mmatlur
      *
     c                   eval      mmatlu_vsor = c1vsor
     c                   eval      mmatlu_ogrp = c1ogrp
     c                   eval      mmatlu_hgrp = c1hgrp
     c                   eval      mmatlu_ugrp = c1ugrp
     c                   eval      mmatlu_ldor = c1ldor
     c                   eval      mmatlu_vare = c1vare
     c                   eval      mmatlu_crdo = c1crdo
     c     mmatlu_key    chain     mmatlur
      *
     c                   eval      mmakti = c2akti
     c                   eval      mmantu = c2antu
     c                   eval      mmbrku = c2brku
     c                   eval      mmantp = c2antp
     c                   eval      mmantg = c2antg
     c                   eval      mmbrkg = c2brkg
     c                   eval      mmlage = c2lage
     c                   eval      d_la01    =   a_lage(1)
     c                   eval      d_la02    =   a_lage(2)
     c                   eval      d_la03    =   a_lage(3)
     c                   eval      d_la04    =   a_lage(4)
     c                   eval      d_la05    =   a_lage(5)
     c                   eval      d_la06    =   a_lage(6)
     c                   eval      d_la07    =   a_lage(7)
     c                   eval      d_la08    =   a_lage(8)
     c                   eval      d_la09    =   a_lage(9)
     c                   eval      d_la10    =   a_lage(10)
     c                   move      d_lagr        mmlagr
     c                   eval      mmlt01    =   a_ltyp(1)
     c                   eval      mmlt02    =   a_ltyp(2)
     c                   eval      mmlt03    =   a_ltyp(3)
     c                   eval      mmlt04    =   a_ltyp(4)
     c                   eval      mmlt05    =   a_ltyp(5)
     c                   eval      mmlt06    =   a_ltyp(6)
     c                   eval      mmlt07    =   a_ltyp(7)
     c                   eval      mmlt08    =   a_ltyp(8)
     c                   eval      mmlt09    =   a_ltyp(9)
     c                   eval      mmlt10    =   a_ltyp(10)
     c                   eval      mmdbax = c2dbax
     c                   eval      mmdbay = c2dbay
     c                   eval      mmdbaz = c2dbaz
     c                   eval      mmdbbx = c2dbbx
     c                   eval      mmdbby = c2dbby
     c                   eval      mmdbbz = c2dbbz
     c                   eval      mmdbcx = c2dbcx
     c                   eval      mmdbcy = c2dbcy
     c                   eval      mmdbcz = c2dbcz
     c                   eval      mmdsax = c2dsax
     c                   eval      mmdsay = c2dsay
     c                   eval      mmdsaz = c2dsaz
     c                   eval      mmdsbx = c2dsbx
     c                   eval      mmdsby = c2dsby
     c                   eval      mmdsbz = c2dsbz
     c                   eval      mmdscx = c2dscx
     c                   eval      mmdscy = c2dscy
     c                   eval      mmdscz = c2dscz
     c                   eval      mmlagt = c2lagt
      *
     c                   time                    mmedat
     c                   time                    mmetim
     c                   eval      mmuser = l_user
      *
     c                   if        %found
6.10 c                   time                    mmedat
6.10 c                   time                    mmetim
6.10 c                   eval      mmeusr = l_user
     c                   update    mmatlur
     c                   else
     c                   eval      mmfirm = w_firm
     c                   eval      mmvsor = c1vsor
     c                   eval      mmogrp = c1ogrp
     c                   eval      mmhgrp = c1hgrp
     c                   eval      mmugrp = c1ugrp
     c                   eval      mmldor = c1ldor
     c                   eval      mmvare = c1vare
     c                   eval      mmcrdo = c1crdo
     c                   time                    mmodat
6.10 c                   time                    mmotim
6.10 c                   eval      mmuser = l_user
6.10 c                   time                    mmedat
6.10 c                   time                    mmetim
6.10 c                   eval      mmeusr = l_user
     c                   write     mmatlur
     c                   endif
      *
      * Oppdater subfile
      *
     c                   if        b1valg = 2
     c                   eval      b1lage = mmlage
     c                   eval      b1lagr = mmlagr
     c                   eval      b1antu = mmantu
     c                   eval      b1antp = mmantp
     c                   if        mmakti = 1
     c                   eval      b1akti = '*'
     c                   else
     c                   eval      b1akti = *blank
     c                   endif
     c                   endif
      *
     c                   if        b_oppr = *on or
     c                             b1valg = 3
     c                   eval      b_forn = *on
     c                   endif
      *
     c     end_c2bld     tag
      *
     c                   eval      *in30  = *off
      *
     c                   endsr
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av slette-bildet (D1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xd1win        begsr
      *
     c                   eval      mmatlr_vsor = d1vsor
     c                   eval      mmatlr_ogrp = d1ogrp
     c                   eval      mmatlr_hgrp = d1hgrp
     c                   eval      mmatlr_ugrp = d1ugrp
     c                   eval      mmatlr_ldor = d1ldor
     c                   eval      mmatlr_vare = d1vare
     c                   eval      mmatlr_crdo = d1crdo
     c     mmatlr_key    chain     mmatlr
      *
     c                   exfmt     d1win
      *
     c                   if        *inkc or *inkl
     c                   leavesr
     c                   endif
      *
     c                   eval      b_forn = *on
      *
      * Sletter rad
      *
     c                   eval      mmatlu_vsor = d1vsor
     c                   eval      mmatlu_ogrp = d1ogrp
     c                   eval      mmatlu_hgrp = d1hgrp
     c                   eval      mmatlu_ugrp = d1ugrp
     c                   eval      mmatlu_ldor = d1ldor
     c                   eval      mmatlu_vare = d1vare
     c                   eval      mmatlu_crdo = d1crdo
     c     mmatlu_key    chain     mmatlur
      *
     c                   delete    mmatlur
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for sletting (D2WIN) - sletter resultat
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xd2win        begsr
      *
      *
     c                   exfmt     d2win
      *
     c                   if        *inkc or *inkl
     c                   leavesr
     c                   endif
      *
     c                   eval      b_forn = *on
      *
     c                   movel     d2vare        d_vare
     c                   eval      d_ogrp = d2ogrp
     c                   eval      d_hgrp = d2hgrp
     c                   eval      d_ugrp = d2ugrp
     c                   eval      d_ldor = d2ldor
     c                   eval      d_crdo = d2crdo
     c                   eval      w_list = d_list
     c                   call      'MM401R '
     c                   parm                    w_list
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å behandle kopierings-bildet (K1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xk1win        begsr
      *
      * Tar vare på nøkkel til rad det skal kopieres fra
      *
     c                   eval      s_vsor = k1vsor
     c                   eval      s_ogrp = k1ogrp
     c                   eval      s_hgrp = k1hgrp
     c                   eval      s_ugrp = k1ugrp
     c                   eval      s_ldor = k1ldor
     c                   eval      s_vare = k1vare
     c                   eval      s_crdo = k1crdo
      *
      * Fyller kopierings-bildet
      *
     c                   eval      mmatlr_vsor = k1vsor
     c                   eval      mmatlr_ogrp = k1ogrp
     c                   eval      mmatlr_hgrp = k1hgrp
     c                   eval      mmatlr_ugrp = k1ugrp
     c                   eval      mmatlr_ldor = k1ldor
     c                   eval      mmatlr_vare = k1vare
     c                   eval      mmatlr_crdo = k1crdo
     c     mmatlr_key    chain     mmatlr
     c                   eval      k2vare = mmvare
      *
     c     k1taga        tag
      *
     c                   exfmt     k1win
      *
     c                   if        *inkc or *inkl
     c                   leavesr
     c                   endif
     c                   if        *inkd
     c                   exsr      spØrring
     c                   goto      k1taga
     c                   endif
      *
      * Sjekker om rad finnes fra før
      *
     c                   eval      mmatlr_vsor = k1vsor
     c                   eval      mmatlr_ogrp = k1ogrp
     c                   eval      mmatlr_hgrp = k1hgrp
     c                   eval      mmatlr_ugrp = k1ugrp
     c                   eval      mmatlr_ldor = k1ldor
     c                   eval      mmatlr_vare = k1vare
     c                   eval      mmatlr_crdo = k1crdo
     c     mmatlr_key    chain     mmatlr
     c                   if        %found
     c                   eval      *in32 = *on
     c                   goto      k1taga
     c                   endif
      *
      * Kaller vedlikeholdsprogram
      *
     c                   eval      c1vsor = s_vsor
     c                   eval      c1ogrp = s_ogrp
     c                   eval      c1hgrp = s_hgrp
     c                   eval      c1ugrp = s_ugrp
     c                   eval      c1ldor = s_ldor
     c                   eval      c1vare = s_vare
     c                   eval      c1crdo = s_crdo
     c                   exsr      xc2bld
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å kjøre prognose (L1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xl1win        begsr
      *
     c                   eval      w_ogrp = l1ogrp
     c                   eval      w_hgrp = l1hgrp
     c                   eval      w_ugrp = l1ugrp
     c                   eval      w_ldor = l1ldor
     c                   eval      w_vare = l1vare
     c                   exsr      hent_txt
     c                   eval      l1vsna = w_vsna
     c                   eval      l1ogna = w_ogna
     c                   eval      l1hgna = w_hgna
     c                   eval      l1ugna = w_ugna
     c                   eval      l1vana = w_vana
     c                   eval      l1lena = w_lena
     c                   move      b1lagr        d_lagr
     c                   eval      a_lage(1) = d_la01
     c                   eval      a_lage(2) = d_la02
     c                   eval      a_lage(3) = d_la03
     c                   eval      a_lage(4) = d_la04
     c                   eval      a_lage(5) = d_la05
     c                   eval      a_lage(6) = d_la06
     c                   eval      a_lage(7) = d_la07
     c                   eval      a_lage(8) = d_la08
     c                   eval      a_lage(9) = d_la09
     c                   eval      a_lage(10) = d_la10
     c                   eval      l1lagr = %editw(a_lage(1):' 0') + ' ' +
     c                                      %editw(a_lage(2):' 0') + ' ' +
     c                                      %editw(a_lage(3):' 0') + ' ' +
     c                                      %editw(a_lage(4):' 0') + ' ' +
     c                                      %editw(a_lage(5):' 0') + ' ' +
     c                                      %editw(a_lage(6):' 0') + ' ' +
     c                                      %editw(a_lage(7):' 0') + ' ' +
     c                                      %editw(a_lage(8):' 0') + ' ' +
     c                                      %editw(a_lage(9):' 0') + ' ' +
     c                                      %editw(a_lage(10):' 0')
     c     l1taga        tag
      *
     c                   exfmt     l1win
      *
     c                   if        *inkc or *inkl
     c                   leavesr
     c                   endif
      *
     c                   if        *inkd
     c                   exsr      spØrring
     c                   goto      l1taga
     c                   endif
      *
      * valider
      *
     c                   if        l1lage <> *blank
     c                   move      l1lage        w_jkod
     c                   eval      w_stat = *blank
     c                   call      'RS710R '
     c                   parm                    w_stat
     c                   parm                    w_jkod
     c                   parm                    w_jtxt
      *
     c                   if        w_stat <> *blank
     c                   eval      *in31 = *on
     c                   goto      l1taga
     c                   endif
     c                   endif
      *
     c                   eval      b_forn = *on
      *
      * Kjører prognose
      *
      *
     c                   movel     l1vare        d_vare
     c                   eval      d_vsor = l1vsor
     c                   eval      d_ogrp = l1ogrp
     c                   eval      d_hgrp = l1hgrp
     c                   eval      d_ugrp = l1ugrp
     c                   eval      d_ldor = l1ldor
     c                   eval      d_crdo = l1crdo
     c     *dmy          move      UDATE         w_datoiso
     c                   subdur    14:*D         w_datoiso
     c     *dmy          move      w_datoiso     d_dato
     c                   eval      d_antu = w_antu
     c                   eval      w_list = d_list
     c                   call      'MM731C '
     c                   parm                    w_list
      *
     c                   eval      mmatlu_vsor = l1vsor
     c                   eval      mmatlu_ogrp = l1ogrp
     c                   eval      mmatlu_hgrp = l1hgrp
     c                   eval      mmatlu_ugrp = l1ugrp
     c                   eval      mmatlu_ldor = l1ldor
     c                   eval      mmatlu_crdo = l1crdo
     c                   eval      mmatlu_vare = l1vare
     c     mmatlu_key    chain     mmatlu
     c                   if        %found(mmatlu)
     c                   time                    mmkdat
6.10 c                   time                    mmedat
6.10 c                   time                    mmetim
6.10 c                   eval      mmeusr = l_user
     c                   update    mmatlur
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for tømming av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     clr_subfile   begsr
      *
     c                   eval      *in14 = *on
     c                   write     b2ctl
     c                   eval      *in14 = *off
      *
     c                   eval      *in15 = *off
     c                   eval      w_srrn = 0
     c                   eval      w_sfrn = 0
     c                   eval      w_ssrn = 0
     c                   eval      w_spge = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å fylle opp subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     crt_subfile   begsr
      *
     c                   eval      w_spge = w_spge + c_sfil
     c                   eval      w_srrn = w_ssrn
      *
     c                   dou       w_srrn = w_spge
      *
     c                   select
     c                   when      w_seqe = 'B'
     c                   read      mmatl3
     c                   when      w_seqe = 'C'
     c                   read      mmatl4
     c                   when      w_seqe = 'D'
     c                   read      mmatl5
     c                   when      w_seqe = 'E'
     c                   read      mmatl6
     c                   other
     c                   read      mmatl1
     c                   endsl
      *
     c                   if        %eof or
     c                             mmfirm <> w_firm
     c                   eval      *in15 = *on
     c                   leave
     c                   endif
      *
     c                   eval      w_srrn = w_srrn + 1
      *
     c                   select
     c                   when      w_seqe = 'B'
     c                   eval      mmatl3_ogrp = mmogrp
     c                   when      w_seqe = 'C'
     c                   eval      mmatl4_ldor = mmldor
     c                   when      w_seqe = 'D'
     c                   movel     mmvare        mmatl5_vare
     c                   when      w_seqe = 'E'
     c                   eval      mmatl6_lage = mmlage
     c                   other
     c                   eval      mmatl1_vsor = mmvsor
     c                   endsl
      *
     c                   eval      b1valg = 0
     c                   eval      b1ogrp = mmogrp
     c                   eval      b1vsor = mmvsor
     c                   eval      b1hgrp = mmhgrp
     c                   eval      b1ugrp = mmugrp
     c                   eval      b1vare = mmvare
     c                   eval      b1lage = mmlage
     c                   eval      b1ldor = mmldor
     c                   eval      b1crdo = mmcrdo
     c                   eval      b1antu = mmantu
     c                   eval      b1antp = mmantp
     c                   if        mmkdat <> *loval
     c     *dmy          move      mmkdat        b1kdat
     c                   else
     c                   eval      b1kdat = 0
     c                   endif
     c                   if        mmakti = 1
     c                   eval      b1akti = '*'
     c                   else
     c                   eval      b1akti = *blank
     c                   endif
      *
     c                   write     b1sfl
      *
     c                   enddo
      *
     c                   if        w_srrn > w_ssrn
     c                   eval      w_sfrn = w_ssrn + 1
     c                   endif
      *
     c                   eval      w_ssrn = w_srrn
     c                   eval      w_virn = w_sfrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å bla tilbake en side i subfilen
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bck_subfile   begsr
      *
     c                   if        *in15
     c                   select
     c                   when      w_seqe = 'B'
     c     mmatl3_key    setgt     mmatl3
     c                   readp     mmatl3
     c                   when      w_seqe = 'C'
     c     mmatl4_key    setgt     mmatl4
     c                   readp     mmatl4
     c                   when      w_seqe = 'D'
     c     mmatl5_key    setgt     mmatl5
     c                   readp     mmatl5
     c                   when      w_seqe = 'E'
     c     mmatl6_key    setgt     mmatl6
     c                   readp     mmatl6
     c                   other
     c     mmatl1_key    setgt     mmatl1
     c                   endsl
     c                   endif
      *
      * Leser tilbake en side
      *
     c                   eval      w_stel = 0
      *
     c                   dou       w_stel = w_ssrn + c_sfil
      *
     c                   select
     c                   when      w_seqe = 'B'
     c                   readp     mmatl3
     c                   when      w_seqe = 'C'
     c                   readp     mmatl4
     c                   when      w_seqe = 'D'
     c                   readp     mmatl5
     c                   when      w_seqe = 'E'
     c                   readp     mmatl6
     c                   other
     c                   readp     mmatl1
     c                   endsl
      *
     c                   if        %eof or
     c                             mmfirm <> w_firm
     c                   leave
     c                   endif
      *
     c                   eval      w_stel = w_stel + 1
      *
     c                   select
     c                   when      w_seqe = 'B'
     c                   eval      mmatl3_ogrp = mmogrp
     c                   when      w_seqe = 'C'
     c                   eval      mmatl4_ldor = mmldor
     c                   when      w_seqe = 'D'
     c                   movel     mmvare        mmatl5_vare
     c                   when      w_seqe = 'E'
     c                   eval      mmatl6_lage = mmlage
     c                   other
     c                   eval      mmatl1_vsor = mmvsor
     c                   endsl
      *
     c                   enddo
      *
     c                   if        %eof
     c                   select
     c                   when      w_seqe = 'B'
     c     mmatl3_key    setll     mmatl3
     c                   when      w_seqe = 'C'
     c     mmatl4_key    setll     mmatl4
     c                   when      w_seqe = 'D'
     c     mmatl5_key    setll     mmatl5
     c                   when      w_seqe = 'E'
     c     mmatl6_key    setll     mmatl6
     c                   other
     c     mmatl1_key    setll     mmatl1
     c                   endsl
     c                   endif
      *
      * Blanker og fyller opp subfile
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for display av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     dsp_subfile   begsr
      *
     c                   if        w_srrn <> 0
     c                   eval      *in12 = *on
     c                   else
     c                   write     b2cmd
     c                   endif
      *
     c                   eval      *in13 = *on
     c                   exfmt     b2ctl
      *
     c                   eval      *in12 = *off
     c                   eval      *in13 = *off
      *
     c                   eval      w_fcrn = d_fcrn
      *
     c                   endsr
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Spørring
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     spØrring      begsr
      *
      *
      * varesortiment
     c                   if        w_afld = 'C1VSOR'
     c                   eval      w_firm      = l_firm
     c                   eval      w_vsor      = c1vsor
     c                   eval      w_navn      = *blank
6.21 c                   eval      w_lage      = 0
4.86 c                   CALL      'VC500R  '
     c                   PARM                    w_firm
     c                   PARM                    w_vsor
6.21 c                   PARM                    w_lage
     c                   PARM                    w_navn
     c                   eval      c1vsor      = w_vsor
     c                   movel     w_navn        c1vsna
     c                   goto      end_spØrr
     c                   endif
     c                   if        w_afld = 'K1VSOR'
     c                   eval      w_firm      = l_firm
     c                   eval      w_vsor      = k1vsor
     c                   eval      w_navn      = *blank
6.21 c                   eval      w_lage      = 0
4.86 c                   CALL      'VC500R  '
     c                   PARM                    w_firm
     c                   PARM                    w_vsor
6.21 c                   PARM                    w_lage
     c                   PARM                    w_navn
     c                   eval      k1vsor      = w_vsor
     c                   movel     w_navn        c1vsna
     c                   goto      end_spØrr
     c                   endif
     c                   if        w_afld = 'B2VSOR'
     c                   eval      w_firm      = l_firm
     c                   eval      w_vsor      = b2vsor
     c                   eval      w_navn      = *blank
6.21 c                   eval      w_lage      = 0
4.86 c                   CALL      'VC500R  '
     c                   PARM                    w_firm
     c                   PARM                    w_vsor
6.21 c                   PARM                    w_lage
     c                   PARM                    w_navn
     c                   eval      b2vsor      = w_vsor
     c                   goto      end_spØrr
     c                   endif
      * overgruppe
     c                   if        w_afld = 'C1OGRP'
     c                   eval      w_firm      = l_firm
     c                   eval      w_ogrp      = c1ogrp
     c                   eval      w_navn      = *blank
4.86 c                   CALL      'VG510R  '
     c                   PARM                    w_firm
     c                   PARM                    w_ogrp
     c                   PARM                    w_navn
     c                   eval      c1ogrp      = w_ogrp
     c                   goto      end_spØrr
     c                   endif
     c                   if        w_afld = 'K1OGRP'
     c                   eval      w_firm      = l_firm
     c                   eval      w_ogrp      = k1ogrp
     c                   eval      w_navn      = *blank
4.86 c                   CALL      'VG510R  '
     c                   PARM                    w_firm
     c                   PARM                    w_ogrp
     c                   PARM                    w_navn
     c                   eval      k1ogrp      = w_ogrp
     c                   goto      end_spØrr
     c                   endif
     c                   if        w_afld = 'B2OGRP'
     c                   eval      w_firm      = l_firm
     c                   eval      w_ogrp      = b2ogrp
     c                   eval      w_navn      = *blank
4.86 c                   CALL      'VG510R  '
     c                   PARM                    w_firm
     c                   PARM                    w_ogrp
     c                   PARM                    w_navn
     c                   eval      b2ogrp      = w_ogrp
     c                   goto      end_spØrr
     c                   endif
      *
      * hovedgruppe
     c                   if        w_afld = 'C1HGRP'
     c                   eval      w_firm      = l_firm
     c                   eval      w_ogrp      = c1ogrp
     c                   eval      w_hgrp      = c1hgrp
     c                   eval      w_navn      = *blank
4.86 c                   CALL      'VG511R  '
     c                   PARM                    w_firm
     c                   PARM                    w_ogrp
     c                   PARM                    w_hgrp
     c                   PARM                    w_navn
     c                   eval      c1ogrp      = w_ogrp
     c                   eval      c1hgrP      = w_hgrp
     c                   goto      end_spØrr
     c                   endif
     c                   if        w_afld = 'K1HGRP'
     c                   eval      w_firm      = l_firm
     c                   eval      w_ogrp      = k1ogrp
     c                   eval      w_hgrp      = k1hgrp
     c                   eval      w_navn      = *blank
4.86 c                   CALL      'VG511R  '
     c                   PARM                    w_firm
     c                   PARM                    w_ogrp
     c                   PARM                    w_hgrp
     c                   PARM                    w_navn
     c                   eval      k1ogrp      = w_ogrp
     c                   eval      k1hgrP      = w_hgrp
     c                   goto      end_spØrr
     c                   endif
     c                   if        w_afld = 'B2HGRP'
     c                   eval      w_firm      = l_firm
     c                   eval      w_ogrp      = b2ogrp
     c                   eval      w_hgrp      = b2hgrp
     c                   eval      w_navn      = *blank
4.86 c                   CALL      'VG511R  '
     c                   PARM                    w_firm
     c                   PARM                    w_ogrp
     c                   PARM                    w_hgrp
     c                   PARM                    w_navn
     c                   eval      b2ogrp      = w_ogrp
     c                   eval      b2hgrP      = w_hgrp
     c                   goto      end_spØrr
     c                   endif
      *
      * undergruppe
     c                   if        w_afld = 'C1UGRP'
     c                   eval      w_firm      = l_firm
     c                   eval      w_ogrp      = c1ogrp
     c                   eval      w_hgrp      = c1hgrp
     c                   eval      w_ugrp      = c1ugrp
     c                   eval      w_navn      = *blank
4.86 c                   CALL      'VG512R  '
     c                   PARM                    w_firm
     c                   PARM                    w_ogrp
     c                   PARM                    w_hgrp
     c                   PARM                    w_ugrp
     c                   PARM                    w_navn
     c                   eval      c1ogrp      = w_ogrp
     c                   eval      c1hgrp      = w_hgrp
     c                   eval      c1ugrp      = w_ugrp
     c                   goto      end_spØrr
     c                   endif
     c                   if        w_afld = 'K1UGRP'
     c                   eval      w_firm      = l_firm
     c                   eval      w_ogrp      = k1ogrp
     c                   eval      w_hgrp      = k1hgrp
     c                   eval      w_ugrp      = k1ugrp
     c                   eval      w_navn      = *blank
4.86 c                   CALL      'VG512R  '
     c                   PARM                    w_firm
     c                   PARM                    w_ogrp
     c                   PARM                    w_hgrp
     c                   PARM                    w_ugrp
     c                   PARM                    w_navn
     c                   eval      k1ogrp      = w_ogrp
     c                   eval      k1hgrp      = w_hgrp
     c                   eval      k1ugrp      = w_ugrp
     c                   goto      end_spØrr
     c                   endif
     c                   if        w_afld = 'B2UGRP'
     c                   eval      w_firm      = l_firm
     c                   eval      w_ogrp      = b2ogrp
     c                   eval      w_hgrp      = b2hgrp
     c                   eval      w_ugrp      = b2ugrp
     c                   eval      w_navn      = *blank
4.86 c                   CALL      'VG512R  '
     c                   PARM                    w_firm
     c                   PARM                    w_ogrp
     c                   PARM                    w_hgrp
     c                   PARM                    w_ugrp
     c                   PARM                    w_navn
     c                   eval      b2ogrp      = w_ogrp
     c                   eval      b2hgrp      = w_hgrp
     c                   eval      b2ugrp      = w_ugrp
     c                   goto      end_spØrr
     c                   endif
      *
      * Fra lager
     c                   if        w_afld = 'C2LAGE'
     c                   call      'MM801R  '
     c                   parm                    w_firm
     c                   parm                    a_lage
     c*                  movea     ww_lagr       a_lage
     c                   eval      c2lagr = %editw(a_lage(1):' 0') + ' ' +
     c                                      %editw(a_lage(2):' 0') + ' ' +
     c                                      %editw(a_lage(3):' 0') + ' ' +
     c                                      %editw(a_lage(4):' 0') + ' ' +
     c                                      %editw(a_lage(5):' 0') + ' ' +
     c                                      %editw(a_lage(6):' 0') + ' ' +
     c                                      %editw(a_lage(7):' 0') + ' ' +
     c                                      %editw(a_lage(8):' 0') + ' ' +
     c                                      %editw(a_lage(9):' 0') + ' ' +
     c                                      %editw(a_lage(10):' 0') + ' '
     c                   goto      end_spØrr
     c                   endif
      *
      *
      * Fra lager
     c                   if        w_afld = 'L1LAGE'
     c                   move      l1lage        w_jkod
     c                   call      'RA510R  '
     c                   parm                    w_firm
     c                   parm                    w_jkod
     c                   parm                    w_jtxt
     c                   move      w_jkod        l1lage
     c                   goto      end_spØrr
     c                   endif
     c                   if        w_afld = 'B2LAGE'
     c                   move      b2lage        w_jkod
     c                   call      'RA510R  '
     c                   parm                    w_firm
     c                   parm                    w_jkod
     c                   parm                    w_jtxt
     c                   move      w_jkod        b2lage
     c                   goto      end_spØrr
     c                   endif
      * Leveringstype
     c                   if        w_afld = 'C2LETY'
     c                   call      'MM802R  '
     c                   parm                    w_firm
     c                   parm                    a_ltyp
     c                   eval      c2ltyp = %editw(a_ltyp(1):'0') + ' ' +
     c                                      %editw(a_ltyp(2):'0') + ' ' +
     c                                      %editw(a_ltyp(3):'0') + ' ' +
     c                                      %editw(a_ltyp(4):'0') + ' ' +
     c                                      %editw(a_ltyp(5):'0') + ' ' +
     c                                      %editw(a_ltyp(6):'0') + ' ' +
     c                                      %editw(a_ltyp(7):'0') + ' ' +
     c                                      %editw(a_ltyp(8):'0') + ' ' +
     c                                      %editw(a_ltyp(9):'0') + ' ' +
     c                                      %editw(a_ltyp(10):'0') + ' '
     c                   goto      end_spØrr
     c                   endif
      * Vare
     c                   if        w_afld = 'C1VARE'
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    w_vtxt
     c                   movel     w_vare        c1vare
     c                   goto      end_spØrr
     c                   endif
      * Vare
     c                   if        w_afld = 'K1VARE'
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    w_vtxt
     c                   movel     w_vare        k1vare
     c                   goto      end_spØrr
     c                   endif
     c                   if        w_afld = 'B2VARE'
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    w_vtxt
     c                   movel     w_vare        b2vare
     c                   goto      end_spØrr
     c                   endif
      * Leverandør
     c                   if        w_afld = 'C1LDOR'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    w_ldor
     c                   parm                    w_ltxt
     c                   eval      c1ldor  = w_ldor
     c                   goto      end_spØrr
     c                   endif
     c                   if        w_afld = 'K1LDOR'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    w_ldor
     c                   parm                    w_ltxt
     c                   eval      k1ldor  = w_ldor
     c                   goto      end_spØrr
     c                   endif
     c                   if        w_afld = 'B2LDOR'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    w_ldor
     c                   parm                    w_ltxt
     c                   eval      b2ldor  = w_ldor
     c                   goto      end_spØrr
     c                   endif
      *
      *
     c     end_spØrr     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å hente tekster til diverse felter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     hent_txt      begsr
      *
     c                   eval      w_vsna = *blank
     c                   eval      w_ogna = *blank
     c                   eval      w_hgna = *blank
     c                   eval      w_ugna = *blank
     c                   eval      w_lena = *blank
     c                   eval      w_vana = *blank
     c                   eval      w_lana = *blank
      *
     c                   eval      vshel1_vsor = w_vsor
6.20 c                   eval      vshel1_lage = 0
     c     vshel1_key    chain     vshel1
     c                   if        %found(vshel1)
     c                   movel     vcbesk        w_vsna
     c                   endif
     c                   eval      vogrl1_oogr = w_ogrp
     c                   eval      vhgrl1_hhgr = w_hgrp
     c                   eval      vugrl1_uugr = w_ugrp
     c                   eval      vvarl1_vare = w_vare
     c     vogrl1_key    chain     vogrl1
     c                   if        %found(vogrl1)
     c                   eval      w_ogna = vgotxt
     c                   else
     c                   eval      w_ogna = *blank
     c                   endif
     c     vhgrl1_key    chain     vhgrl1
     c                   if        %found(vhgrl1)
     c                   eval      w_hgna = vghtxt
     c                   else
     c                   eval      w_hgna = *blank
     c                   endif
     c     vugrl1_key    chain     vugrl1
     c                   if        %found(vugrl1)
     c                   eval      w_ugna = vgutxt
     c                   else
     c                   eval      w_ugna = *blank
     c                   endif
     c     vvarl1_key    chain     vvarl1
     c                   if        %found(vvarl1)
     c                   eval      w_vana = vvtek1
     c                   else
     c                   eval      w_vana = *blank
     c                   endif
     c                   if        w_ldor <> 0
     c                   eval      w_stat = *blank
     c                   eval      w_ldor = w_ldor
     c                   call      'RS760R  '
     c                   parm                    w_stat
     c                   parm                    w_ldor
     c                   parm                    w_ltxt
     c                   movel     w_ltxt        w_lena
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for posisjonering på varesortiment
      *
     c     mmatl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    mmatl1_vsor
      *
      * Key for posisjonering på overgruppe
      *
     c     mmatl3_key    klist
     c                   kfld                    w_firm
     c                   kfld                    mmatl3_ogrp
      *
      * Key for posisjonering på overgruppe + hovedgruppe
      *
     c     mmatl3a_key   klist
     c                   kfld                    w_firm
     c                   kfld                    mmatl3_ogrp
     c                   kfld                    mmatl3_hgrp
      *
      * Key for posisjonering på overgruppe + hovedgruppe
      *
     c     mmatl3b_key   klist
     c                   kfld                    w_firm
     c                   kfld                    mmatl3_ogrp
     c                   kfld                    mmatl3_hgrp
     c                   kfld                    mmatl3_ugrp
      *
      * Key for posisjonering på leverandør
      *
     c     mmatl4_key    klist
     c                   kfld                    w_firm
     c                   kfld                    mmatl4_ldor
      *
      * Key for posisjonering på vare
      *
     c     mmatl5_key    klist
     c                   kfld                    w_firm
     c                   kfld                    mmatl5_vare
      *
      * Key for posisjonering på lager
      *
     c     mmatl6_key    klist
     c                   kfld                    w_firm
     c                   kfld                    mmatl6_lage
      *
      * Key for les på abc parameter
      *
     c     mmatlr_key    klist
     c                   kfld                    w_firm
     c                   kfld                    mmatlr_vsor
     c                   kfld                    mmatlr_ogrp
     c                   kfld                    mmatlr_hgrp
     c                   kfld                    mmatlr_ugrp
     c                   kfld                    mmatlr_ldor
     c                   kfld                    mmatlr_vare
     c                   kfld                    mmatlr_crdo
      *
      * Key for oppdatering av abc parameter
      *
     c     mmatlu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    mmatlu_vsor
     c                   kfld                    mmatlu_ogrp
     c                   kfld                    mmatlu_hgrp
     c                   kfld                    mmatlu_ugrp
     c                   kfld                    mmatlu_ldor
     c                   kfld                    mmatlu_vare
     c                   kfld                    mmatlu_crdo
      *
      * Key for les av vare
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarl1_vare
      *
      * Key for les av overgruppe
      *
     c     vogrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vogrl1_oogr
      *
      * Key for les av hovedgruppe
      *
     c     vhgrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vogrl1_oogr
     c                   kfld                    vhgrl1_hhgr
      *
      * Key for les av undergruppe
      *
     c     vugrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vogrl1_oogr
     c                   kfld                    vhgrl1_hhgr
     c                   kfld                    vugrl1_uugr
      *
      * Key for les av varesortiment
      *
     c     vshel1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vshel1_vsor
6.20 c                   kfld                    vshel1_lage
      *
      *
      *
      * Henter verdier fra LDA, og initierer skjermbildet
      *
     c                   eval      w_firm = l_firm
      *
     c                   eval      *in22 = *on
      *
      * Posisjonerer databasen, og fyller opp subfile
      *
     c                   eval      mmatl1_vsor = *blank
     c     mmatl1_key    setll     mmatl1
      *
     c                   exsr      crt_subfile
      *
     c                   endsr
