     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASLOGI
      * Program . . . . : MM410R
      * Beskrivelse . . : Prognose - Sletter simulert prognose
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       220206 bø   Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      *       LR = Avslutt program
      *       10 = Rollup
      *       11 = Rolldown
      *       12 = Sfldsp
      *       13 = Sfldspctl
      *       14 = Sflclr
      *       15 = Sflend
      *       21 = Home-key
      *       22 = Plassering av cursor
      *       30 = Protect av felter ved vise
      *    31-79 = Varsle m/feilmeldinger/skjermindikatorer
      *    80-99 = Arbeidsindikatorer
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
5.40 fmprwl3    uf   e           k disk    rename(mpropfr:mprol3r)
      *
5.40 d mprwl3_vsor     s                   like(movsor)
5.40 d mprwl3_ogrp     s                   like(moogrp)
5.40 d mprwl3_hgrp     s                   like(mohgrp)
5.40 d mprwl3_ugrp     s                   like(mougrp)
5.40 d mprwl3_ldor     s                   like(moldor)
5.40 d mprwl3_vark     s                   like(movark)
      *
     d p_list          s            128
     d w_firm          s                   like(mofirm)
      *
     d                 ds
     d d_list                       128
     d  d_vsor                       10    overlay(d_list)
     d  d_ogrp                        2  0 overlay(d_list:11)
     d  d_hgrp                        2  0 overlay(d_list:13)
     d  d_ugrp                        3  0 overlay(d_list:15)
     d  d_ldor                        6  0 overlay(d_list:18)
     d  d_vare                        8  0 overlay(d_list:24)
     d  d_crdo                        1  0 overlay(d_list:32)
     d  d_etprm                       1  0 overlay(d_list:33)
     d  d_dato                        6  0 overlay(d_list:34)
      *
      * Local Data Area
      *
     d                uds
      *
     d l_firm                944    946  0
      *
      *
     c     b2taga        tag
      *
5.40  * sletter simulert prognose
5.40  *
5.40 c                   eval      mprwl3_vsor = d_vsor
5.40 c                   eval      mprwl3_ogrp = d_ogrp
5.40 c                   eval      mprwl3_hgrp = d_hgrp
5.40 c                   eval      mprwl3_ugrp = d_ugrp
5.40 c                   eval      mprwl3_ldor = d_ldor
     c                   movel     d_vare        mprwl3_vark
5.40 c     mprwl3_key    setll     mprwl3
5.40 c     mprwl3_key    reade     mprwl3
5.40 c                   dow       not %eof
5.40 c                   delete    mprol3r
5.40 c     mprwl3_key    reade     mprwl3
5.40 c                   enddo
      *
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
5.40  *
5.40  * Key for sletting av simulert prognose
5.40  *
5.40 c     mprwl3_key    klist
5.40 c                   kfld                    w_firm
5.40 c                   kfld                    mprwl3_vsor
5.40 c                   kfld                    mprwl3_ogrp
5.40 c                   kfld                    mprwl3_hgrp
5.40 c                   kfld                    mprwl3_ugrp
5.40 c                   kfld                    mprwl3_ldor
5.40 c                   kfld                    mprwl3_vark
      *
      *
     c     *entry        plist
     c                   parm                    p_list
      *
     c                   eval      d_list  = p_list
      *
      *
      * Henter verdier fra LDA, og initierer skjermbildet
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
