     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASLAGR
      * Program . . . . : MM702R
      * Beskrivelse . . : Oppdaterer alle progn. med riktig abc-kode
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       190309 bof  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fmprulu    uf   e           k disk    rename(mprupfr:mprulur)
      *
      * variabler i nøkler
      *
     d mprulu_lage     s                   like(mrlage)
     d mprulu_vare     s                   like(mrvare)
      *
      * Parameter-inn
     d p_firm          s                   like(mrfirm)
     d p_vare          s                   like(mrvare)
     d p_lage          s                   like(mrlage)
     d p_kabc          s                   like(mrkabc)
      *
      * Local Data Area
      *
     d                uds
      *
     d l_firm                944    946  0
      *
      * Variabler
      *
     d w_firm          s                   like(mrfirm)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   eval      mprulu_vare = p_vare
     c                   eval      mprulu_lage = p_lage
     c     mprulu_key    setll     mprulu
     c     mprulu_key    reade     mprulu
     c                   dow       not %eof(mprulu)
     c                   eval      mrkabc = p_kabc
     c                   update    mprulur
     c     mprulu_key    reade     mprulu
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
      *
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *
      * Key for å oppdatere ukesprognose
      *
     c     mprulu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    mprulu_vare
     c                   kfld                    mprulu_lage
      *
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_vare
     c                   parm                    p_lage
     c                   parm                    p_kabc
      *
     c                   eval      w_firm = p_firm
      *
     c                   endsr
