     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASLOGI
      * Program . . . . : MM834R
      * Beskrivelse . . : Starter MM734R
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       220405 bø   Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     d p_listp         s            128
      *
     d                 ds
     d d_listp                      128
     d  d_pvsor                      10    overlay(d_listp)
     d  d_pogrp                       2  0 overlay(d_listp:11)
     d  d_phgrp                       2  0 overlay(d_listp:13)
     d  d_pugrp                       3  0 overlay(d_listp:15)
     d  d_pldor                       6  0 overlay(d_listp:18)
     d  d_pvare                       8  0 overlay(d_listp:24)
     d  d_crdo                        1  0 overlay(d_listp:32)
     d  d_etprm                       1  0 overlay(d_listp:33)
     d  d_dato                        6  0 overlay(d_listp:34)
      *
      * Local Data Area
      *
     d                uds
      *
     d l_firm                944    946  0
      *
      * Definering av variable i nøkler
      *
      *
      * Definering av variable
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   eval      d_pvsor = *blank
     c                   eval      d_pogrp = 0
     c                   eval      d_phgrp = 0
     c                   eval      d_pugrp = 0
     c                   eval      d_pldor = 0
     c                   eval      d_pvare = 0
     c                   eval      d_crdo  = 0
     c                   eval      d_etprm = 0
     c                   eval      d_dato  = 0
     c                   eval      p_listp = d_listp
     c                   call      'MM734R  '
     c                   parm                    p_listp
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
      *
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
