     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASLOGI
      * Program . . . . : MO705R
      * Beskrivelse . . : Starter MB701R
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       090107 bø   Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     d w_dato          s               d   datfmt(*iso)
     d w_dato_inn      s               d   datfmt(*iso)
     d w_aar           s              4  0
     d w_mnd           s              2  0
     d w_dato1         s               d   datfmt(*iso)
     d w_dato6         s              6  0
     d p_dato          s               d   datfmt(*iso)
      *
     d                 ds
     d d_list                       128
     d  d_fvar                        8  0 overlay(d_list)
     d  d_tvar                        8  0 overlay(d_list:9)
     d  d_flag                        2  0 overlay(d_list:17)
     d  d_tlag                        2  0 overlay(d_list:19)
     d  d_fogr                        2  0 overlay(d_list:21)
     d  d_togr                        2  0 overlay(d_list:23)
     d  d_fhgr                        2  0 overlay(d_list:25)
     d  d_thgr                        2  0 overlay(d_list:27)
     d  d_fugr                        3  0 overlay(d_list:29)
     d  d_tugr                        3  0 overlay(d_list:32)
     d  d_levn                        6  0 overlay(d_list:35)
     d  d_selg                        4  0 overlay(d_list:41)
     d  d_faar                        4  0 overlay(d_list:45)
     d  d_fmnd                        2  0 overlay(d_list:49)
     d  d_taar                        4  0 overlay(d_list:51)
     d  d_tmnd                        2  0 overlay(d_list:55)
     d  d_aint                        2  0 overlay(d_list:57)
     d  d_bint                        2  0 overlay(d_list:59)
     d  d_cint                        2  0 overlay(d_list:61)
     d  d_xint                        2  0 overlay(d_list:63)
     d  d_yint                        2  0 overlay(d_list:65)
     d  d_zint                        2  0 overlay(d_list:67)
     d  d_sorb                        1  0 overlay(d_list:69)
     d  d_sorn                        1  0 overlay(d_list:70)
     d  d_sora                        1  0 overlay(d_list:71)
     d  d_oppd                        1  0 overlay(d_list:72)
     d  d_lt01                        1  0 overlay(d_list:73)
     d  d_lt02                        1  0 overlay(d_list:74)
     d  d_lt03                        1  0 overlay(d_list:75)
     d  d_lt04                        1  0 overlay(d_list:76)
     d  d_lt05                        1  0 overlay(d_list:77)
     d  d_lt06                        1  0 overlay(d_list:78)
     d  d_lt07                        1  0 overlay(d_list:79)
     d  d_lt08                        1  0 overlay(d_list:80)
     d  d_lt09                        1  0 overlay(d_list:81)
     d  d_lt10                        1  0 overlay(d_list:82)
     d  d_vtyp                        1    overlay(d_list:83)
     d  d_fvso                       10    overlay(d_list:84)
     d  d_tvso                       10    overlay(d_list:94)
     d  d_lager                      20  0 overlay(d_list:104)
     d  d_lagk                        2    overlay(d_list:124)
      *
     d                 ds
     d d_fper                         6
     d  d_fpar                        4  0 overlay(d_fper)
     d  d_fpmd                        2  0 overlay(d_fper:5)
     d                 ds
     d d_tper                         6
     d  d_tpar                        4  0 overlay(d_tper)
     d  d_tpmd                        2  0 overlay(d_tper:5)
      *
      *
     d d_lagr          ds
     d  d_la01                        2  0
     d  d_la02                        2  0
     d  d_la03                        2  0
     d  d_la04                        2  0
     d  d_la05                        2  0
     d  d_la06                        2  0
     d  d_la07                        2  0
     d  d_la08                        2  0
     d  d_la09                        2  0
     d  d_la10                        2  0
      *
     d d_ltyp          ds
     d  d_lty1                        1  0
     d  d_lty2                        1  0
     d  d_lty3                        1  0
     d  d_lty4                        1  0
     d  d_lty5                        1  0
     d  d_lty6                        1  0
     d  d_lty7                        1  0
     d  d_lty8                        1  0
     d  d_lty9                        1  0
     d  d_lty0                        1  0
      *
      *
      * Local Data Area
      *
     d                uds
      *
     d l_firm                944    946  0
      *
      * Definering av variable i nøkler
      *
      *
      * Definering av variable
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     *
     c                   eval      w_dato_inn  = p_dato
      *
readec                   exsr      behandle
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
      *
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å sette paramter og kjøre analyse
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     behandle      begsr
     c                   eval      d_flag = 0
     c                   eval      d_tlag = 99
      *
     c                   eval      d_lager = 0
      *
      * til
     c                   time                    w_dato
     c                   eval      w_aar = %subdt(w_dato:*years)
     c                   eval      w_mnd = %subdt(w_dato:*months)
     c                   move      w_aar         d_taar
     c                   movel     w_mnd         d_tmnd
      * fra
     c                   subdur    360:*D        w_dato
     c                   eval      w_aar = %subdt(w_dato:*years)
     c                   eval      w_mnd = %subdt(w_dato:*months)
     c                   move      w_aar         d_faar
     c                   movel     w_mnd         d_fmnd
     c                   eval      d_fvso = *blank
     c                   eval      d_fogr = 0
     c                   eval      d_fhgr = 0
     c                   eval      d_fugr = 0
     c                   eval      d_levn = 0
     c                   eval      d_selg = 0
     c                   eval      d_aint = 80
     c                   eval      d_bint = 15
     c                   eval      d_cint = 5
     c                   eval      d_xint = 70
     c                   eval      d_yint = 20
     c                   eval      d_zint = 10
     c                   eval      d_sorb = 0
     c                   eval      d_sorn = 0
     c                   eval      d_sora = 0
     c                   eval      d_oppd = 0
     c                   eval      d_lt01 = 0
     c                   eval      d_lt02 = 1
     c                   eval      d_lt03 = 0
     c                   eval      d_lt04 = 0
     c                   eval      d_lt05 = 0
     c                   eval      d_lt06 = 0
     c                   eval      d_lt07 = 0
     c                   eval      d_lt08 = 0
     c                   eval      d_lt09 = 0
     c                   eval      d_lt10 = 0
     c                   eval      d_vtyp = *blank
      *
     c                   call      'MO705C'
     c                   parm                    d_list
     c                   parm                    w_dato_inn
      *
      *
     c                   endsr
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    p_dato
      *
     c                   endsr
