          dcl-ds MessageHeader QUALIFIED;
            key varchar(1000);
            value varchar(10000);
          end-ds;

          dcl-ds QueuedMessage QUALIFIED;
            status int(5);
            topicName varchar(1000);
            offset int(10);
            messageKey varchar(1000);
            messageData varchar(20000);
            messageTime timestamp;
            messageHeaders_LENGTH int(5);
            messageHeaders likeds(MessageHeader) dim(20);
          end-ds;

          dcl-pr GetQueuedMessage LIKEDS(QueuedMessage);
            Dcl-parm topicName varchar(1000) CONST;
            Dcl-parm consumerName varchar(256) CONST;
          end-pr;

          Dcl-pr SubscribeMessages;
            topicName varchar(1000) CONST;
            consumerName varchar(256) CONST;
            callbackPtr pointer(*proc);
          end-pr;
