     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : NN801R
      * Beskrivelse . . : Nettbutikk, API - styreprogram
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       071002 HKO  Nytt program
6.20  * 6.20  210813 bsa  Rekompilert grunnet endret ANBLPF
6.31  * 6.30  080219 bof  Rekompilert grunnet endret ANBLPF
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fanbll1    if   e           k disk    rename(anblpfr:anbll1r)
      *
      * Definering av parametre
      *
     d p_recd          s              3
     d p_eier          s             10
     d p_buti          s             15
     d p_uniq          s             15
     d p_bibl          s             10
     d p_dtqi          s             10
     d p_dtqo          s             10
     d p_feil          s              1
      *
      * Definering av variabler i nøkler
      *
     d anbll1_leie     s                   like(aoleie)
     d anbll1_lbut     s                   like(aolbut)
      *
      * Definering av variable
      *
     d w_inpl          s              5p 0
     d w_outl          s              5p 0
     d w_wait          s              5p 0
     d w_keyo          s              2
     d w_keyl          s              3p 0
     d w_sndl          s              3p 0
     d w_sndi          s             36
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Henter opplysninger fra nettbutikk
      *
     c                   eval      anbll1_leie = p_eier
     c                   eval      anbll1_lbut = p_buti
     c     anbll1_key    chain     anbll1
      *
      * Initierer datakø-variable
      *
     c                   eval      w_inpl = 1024
     c                   eval      w_outl = 1024
     c                   eval      w_wait = 0
     c                   eval      w_keyo = 'EQ'
     c                   eval      w_keyl = 15
     c                   eval      w_sndl = 0
     c                   eval      w_sndi = *blank
      *
      * Kaller bahandlende program
      *
     c                   select
     c                   when      p_recd = 'PRI'
     c                   call      'NN810R'
     c                   parm                    p_uniq
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_bibl
     c                   parm                    p_feil
     c                   parm                    aolfir
     c                   parm                    aollag
     c                   parm                    w_inpl
     c                   parm                    w_outl
     c                   parm                    w_wait
     c                   parm                    w_keyo
     c                   parm                    w_keyl
     c                   parm                    w_sndl
     c                   parm                    w_sndi
     c                   when      p_recd = 'INV'
     c                   call      'NN820R'
     c                   parm                    p_uniq
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_bibl
     c                   parm                    p_feil
     c                   parm                    aolfir
     c                   parm                    aollag
     c                   parm                    w_inpl
     c                   parm                    w_outl
     c                   parm                    w_wait
     c                   parm                    w_keyo
     c                   parm                    w_keyl
     c                   parm                    w_sndl
     c                   parm                    w_sndi
     c                   when      p_recd = 'IND'
     c                   call      'NN821R'
     c                   parm                    p_uniq
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_bibl
     c                   parm                    p_feil
     c                   parm                    aolfir
     c                   parm                    aollag
     c                   parm                    w_inpl
     c                   parm                    w_outl
     c                   parm                    w_wait
     c                   parm                    w_keyo
     c                   parm                    w_keyl
     c                   parm                    w_sndl
     c                   parm                    w_sndi
     c                   when      p_recd = 'RST'
     c                   call      'NN830R'
     c                   parm                    p_uniq
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_bibl
     c                   parm                    p_feil
     c                   parm                    aolfir
     c                   parm                    aollag
     c                   parm                    w_inpl
     c                   parm                    w_outl
     c                   parm                    w_wait
     c                   parm                    w_keyo
     c                   parm                    w_keyl
     c                   parm                    w_sndl
     c                   parm                    w_sndi
     c                   when      p_recd = 'RSP'
     c                   call      'NN831R'
     c                   parm                    p_uniq
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_bibl
     c                   parm                    p_feil
     c                   parm                    aolfir
     c                   parm                    aollag
     c                   parm                    w_inpl
     c                   parm                    w_outl
     c                   parm                    w_wait
     c                   parm                    w_keyo
     c                   parm                    w_keyl
     c                   parm                    w_sndl
     c                   parm                    w_sndi
     c                   when      p_recd = 'ORD'
     c                   call      'NN850R'
     c                   parm                    p_uniq
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_bibl
     c                   parm                    p_feil
     c                   parm                    aolfir
     c                   parm                    aollag
     c                   parm                    aolavd
     c                   parm                    w_inpl
     c                   parm                    w_outl
     c                   parm                    w_wait
     c                   parm                    w_keyo
     c                   parm                    w_keyl
     c                   parm                    w_sndl
     c                   parm                    w_sndi
     c                   other
     c                   eval      p_feil = *on
     c                   goto      avslutt
     c                   endsl
      *
      * Avslutt
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * ERROR-rutine
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *pssr         begsr
      *
     c                   eval      p_feil = *on
     c                   goto      avslutt
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_recd
     c                   parm                    p_eier
     c                   parm                    p_buti
     c                   parm                    p_uniq
     c                   parm                    p_bibl
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_feil
      *
      * Key for oppslag på nettbutikk
      *
     c     anbll1_key    klist
     c                   kfld                    anbll1_leie
     c                   kfld                    anbll1_lbut
      *
     c                   endsr
