     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : NW800R
      * Beskrivelse . . : WAP, API - styreprogram
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       291003 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Definering av parametre
      *
     d p_fgrp          s              3
     d p_firm          s              3
     d p_avde          s              4
     d p_recd          s              3
     d p_uniq          s             15
     d p_bibl          s             10
     d p_dtqi          s             10
     d p_dtqo          s             10
     d p_feil          s              1
      *
      * Definering av variable
      *
     d w_fgrp          s              3
     d w_firm          s              3  0
     d w_avde          s              4  0
      *
     d w_inpl          s              5p 0
     d w_outl          s              5p 0
     d w_wait          s              5p 0
     d w_keyo          s              2
     d w_keyl          s              3p 0
     d w_sndl          s              3p 0
     d w_sndi          s             36
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Henter variable fra parameter
      *
     c                   move      p_fgrp        w_fgrp
     c                   move      p_firm        w_firm
     c                   move      p_avde        w_avde
      *
      * Initierer datakø-variable
      *
     c                   eval      w_inpl = 1024
     c                   eval      w_outl = 1024
     c                   eval      w_wait = 0
     c                   eval      w_keyo = 'EQ'
     c                   eval      w_keyl = 15
     c                   eval      w_sndl = 0
     c                   eval      w_sndi = *blank
      *
      * Kaller behandlende program
      *
     c                   select
     c                   when      p_recd = 'PRO'
     c                   call      'NW810R'
     c                   parm                    w_firm
     c                   parm                    w_avde
     c                   parm                    p_uniq
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_bibl
     c                   parm                    p_feil
     c                   parm                    w_inpl
     c                   parm                    w_outl
     c                   parm                    w_wait
     c                   parm                    w_keyo
     c                   parm                    w_keyl
     c                   parm                    w_sndl
     c                   parm                    w_sndi
     c                   when      p_recd = 'VAR'
     c                   call      'NW820R'
     c                   parm                    w_firm
     c                   parm                    w_avde
     c                   parm                    p_uniq
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_bibl
     c                   parm                    p_feil
     c                   parm                    w_inpl
     c                   parm                    w_outl
     c                   parm                    w_wait
     c                   parm                    w_keyo
     c                   parm                    w_keyl
     c                   parm                    w_sndl
     c                   parm                    w_sndi
     c                   when      p_recd = 'VSO'
     c                   call      'NW825R'
     c                   parm                    w_firm
     c                   parm                    w_avde
     c                   parm                    p_uniq
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_bibl
     c                   parm                    p_feil
     c                   parm                    w_inpl
     c                   parm                    w_outl
     c                   parm                    w_wait
     c                   parm                    w_keyo
     c                   parm                    w_keyl
     c                   parm                    w_sndl
     c                   parm                    w_sndi
     c                   when      p_recd = 'EXP'
     c                   call      'NW850R'
     c                   parm                    w_firm
     c                   parm                    w_avde
     c                   parm                    p_uniq
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_bibl
     c                   parm                    p_feil
     c                   parm                    w_inpl
     c                   parm                    w_outl
     c                   parm                    w_wait
     c                   parm                    w_keyo
     c                   parm                    w_keyl
     c                   parm                    w_sndl
     c                   parm                    w_sndi
     c                   when      p_recd = 'ORD'
     c                   call      'NW860R'
     c                   parm                    w_firm
     c                   parm                    w_avde
     c                   parm                    p_uniq
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_bibl
     c                   parm                    p_feil
     c                   parm                    w_inpl
     c                   parm                    w_outl
     c                   parm                    w_wait
     c                   parm                    w_keyo
     c                   parm                    w_keyl
     c                   parm                    w_sndl
     c                   parm                    w_sndi
     c                   when      p_recd = 'NBU'
     c                   call      'NW870R'
     c                   parm                    w_fgrp
     c                   parm                    w_firm
     c                   parm                    w_avde
     c                   parm                    p_uniq
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_bibl
     c                   parm                    p_feil
     c                   parm                    w_inpl
     c                   parm                    w_outl
     c                   parm                    w_wait
     c                   parm                    w_keyo
     c                   parm                    w_keyl
     c                   parm                    w_sndl
     c                   parm                    w_sndi
     c                   other
     c                   eval      p_feil = *on
     c                   goto      avslutt
     c                   endsl
      *
      * Avslutt
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * ERROR-rutine
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *pssr         begsr
      *
     c                   eval      p_feil = *on
     c                   goto      avslutt
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_fgrp
     c                   parm                    p_firm
     c                   parm                    p_avde
     c                   parm                    p_recd
     c                   parm                    p_uniq
     c                   parm                    p_bibl
     c                   parm                    p_dtqi
     c                   parm                    p_dtqo
     c                   parm                    p_feil
      *
     c                   endsr
