Q.01 H/TITLE  ASOFAK: Utskrift av Prisbekreftelse
pdf  H decedit('0.') datedit(*dmy-) option(*nodebugio)
pdf  h DftActgrp(*No) BndDir('CGIDEV2/CGIDEV2')
      *
pdf   /copy hspecsbnd
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
Q.01  * Program . . . . : QO932R
Q.01  * Beskrivelse . . : Utskrift av Prisbekreftelse
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
3.12  * R3.12 310800 AMD  Lagt inn mulighet for utprint av avdelingsnavn
3.12  *                   i stedet for firmanavn dersom ønskelig
3.13  * R3.13 110900 AMD  Dersom vare er hentet fra LVR settes det inn
3.13  *                   2 desimaler som standard (finnes jo ikke i EVR)
3.31  * R3.31 290301 AMD  Lagt inn mulighet for å styre om rabatter skal
      *                   vises med prosent, eller som bare et nettobeløp.
3.32  * R3.32 020401 AMD  Lagt inn utskrift av bestillingsnummer.
3.33  * R3.33 310501 AMD  Lagt inn utskrift av telefon/fax/mobil.
      *
5.01  * R5.01 221002 AMD  Løsning for å kunne sende e-mail
5.02  * R5.02 260903 AMD  Automatisk opplegg for subject (emne) ved
5.02  *                   sending av mail.
5.21  * R5.21 261103 AMD  Overstyrer med mobilnummer fra ordrehode
5.21  *                   dersom oppgitt.
5.22  * R5.22 031203 AMD  Skrive tekst 2 dersom den finnes i varereg.
5.22  *                   + lagt inn utskrift av leveringstype
5.22  *                   + lagt inn skråstrek mellom telefon / telefax
5.34  * R5.34 020505 GRO  Lagt til utskrift av lengdespesifikasjoner
5.41  * R5.41 150605 AMD  Hente styring på firmaopplysninger fra LDA.
5.42  * R5.42 140905 AMD  Lagt inn utskrift av eksternt kundeprosjekt
5.43  * R5.43 220806 AMD  Lagt inn utskrift av leveringsbetingelser
5.52  * R5.52 270307 AMD  Lagt inn automatisk oppdatering av logg for
      *                   ordrebekreftelse ved kjørekontor-løsning
5.50  * R5.50 110307 KOB  Lagt inn ny beregning av mva
5.60  * R5.60 040308 bof  Utvdidet nøkkel i logg-fil kjørekontor
5.61  * R5.61 200608 AMD  Tar hensyn til epost-adresse på kundeprosjekt
5.62  * R5.62 260609 AMD  Justeringer i printfilen, ingen endringer her
      *
6.10  * R6.10 070909 BSA  Utskriften endret pga utvidelse av referansefelter.
6.12  * R6.12 200809 AMD  Lagt inn spesifisering av flere mva-satser
pdf   * R6.10 180610 bsa  Lagt inn funksjonalitet for eksport til XML
pdf   *                   format for videre arkivering og utskrift.
6.13  * R6.10 270910 bsa  Tillegg av faste tagger. Display tag + ordrenummer
6.13  *                   hvis den finnes.
6.14  * R6.10 300910 bsa  Hvis konvtertering av spesialtegn, legges til flere tegn
6.14  *                   som kan gjøre at noen av disse faller utenfor pga av felt-
6.14  *                   lengde.
6.15  * R6.10 071010 bsa  Legger inn test om gyldig utkø. Hvis ikke, legger vi ikke
6.15  *                   ut "printer kommand" tagger.
6.16  * R6.10 211010 bsa  Kaller eget program for scann av tegn.
6.17  * R6.10 041110 bsa  Div. manglende info.
6.18  * R6.10 261110 bsa  Håndtering av linjeskift i e-mail utsendelse
6.19  * R6.10 040111 bsa  Slå sammen tekstlinje 1 og 2 på samme linje
6.20  * R6.10 201011 bsa  Streng utelatt for scann
6.21  * R6.10 160311 bsa  Ved valg av *ARKIV som skriver skal den kun arkiveres
6.22  * R6.20 100511 bsa  Lagger ut rutinetekst som metatagg.
6.23  * R6.23 190511 NHO  Mobil nr skal legges ut dersom 1 i felt
      *                   FAAMSA i fil FSTSPF
6.24  * R6.20 130212 bsa  Manglende tagger ved utskift av tomme dokumenter
6.25  * R6.20 280312 bsa  Håndetring av "space" mellom tekst 1 og 2 ved tekstlinjer
6.26  * R6.20 100512 bsa  For kort felt ved konvetrering av spesialtegn
6.27  * R6.20 290512 bsa  Håndterer riktig MVA ifbm organisasjonsnr.
6.28  * R6.20 280612 bsa  Strukturendring av og nye xml tagger
6.29  * R6.20 251012 bsa  Må hente medianavn, og ikke skuffnummer
6.2A  * R6.20 171212 bsa  Scann av rekvisisjonsnummer
6.2B  * R6.20 200213 bsa  Hvis kunden kjører med nettopriser, skal rabattprosenten
6.2B  *                   fjernes.
6.2C  * R6.20 041212 bsa  Legger ut nytt unikt refno, utvidet metatagger
6.2D  * R6.20 040113 bsa  Endrer logikken for oppbygging av refno
6.2E  * R6.20 100913 bsa  Legger ut prosjektnummer
6.2F  * R6.20 180913 bsa  Scanner emnefeltet på mail etter ugyldige tegn
6.2G  * R6.20 201113 bsa  Scanner lev.varenummer
6.2H  * R6.20 090914 bsa  Leveringsmåte og betingelse ligger i feil sekvens.
6.2I  * R6.20 140415 bsa  0 stiller minne for gjenbruk av XML info
6.nu  * R6.30 030614 bsa  Programmet gjennomgått mtp nummerutvidelser.
6.30  * R6.30 120914 bsa  Utvidet parameterliste til FO798R. Håndtering av
6.30  *                   flere mailfelter.
6.31  * 6.30  051214 Bsa  Utvidet parameterliste til FÅ707R
6.32  * 6.30  280115 bsa  Skriver til datakø for å trigge java sniffer
6.33  * 6.30  030915 bsa  Legger ut avdeling som tagg for arkiveringsformål.
6.34  * 6.30  160915 bsa  Scanner kampanje
6.35  * 6.30  101116 bsa  Rabatten kuttes uten forhøyning. Slår ut når det er to
6.35  *                   rabatter på en ordre.
6.36  * 6.30  221216 bsa  Må nullstille leveringsdato mellom hver linje - proa
6.37  * 6.30  150118 bsa  Sjekk at det er minst 1 ordre i FPSO
6.38  * 6.30  110918 nho  Bruker FOKUND for å slå opp mot kontaktperson
      *                   skal bruke FOLKUN hvis det ligger noe der
      *
Q.01  * 7.xx  020419 bsa  Tatt utgangspunkt i ordrebekreftelsen. Alle endringer
Q.01  *                   her bør vurderes. Bruker samme xml og jasper mal som
Q.01  *                   ordrebekreftelsen.
8.01  *PRG2   220622 bof  Utvidet prisgruppe fra 1 til 2 posisjoner
8.02  *       050624 bof  Setter PrintPriceOnDocument og PrintDiscountOnDocument TRUE
8.03  *K0000  120325 bsa  Skriver inn til tabell for bruk ved søking i arkiv.
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     FFPSOL1    IPE  E             DISK    RENAME(FPSOPFR:FPSOL1R)
     FFSTSL1    IF   E           K DISK    RENAME(FSTSPFR:FSTSL1R)
     FVOTYL1    IF   E           K DISK    RENAME(VOTYPFR:VOTYL1R)
     FVLTYL1    IF   E           K DISK    RENAME(VLTYPFR:VLTYL1R)
     FVPKOL1    IF   E           K DISK    RENAME(VPKOPFR:VPKOL1R)
     FFOHEL1    IF   E           K DISK    RENAME(FOHEPFR:FOHEL1R)
     FFODTL1    IF   E           K DISK    RENAME(FODTPFR:FODTL1R)
     FFOTXL1    IF   E           K DISK    RENAME(FOTXPFR:FOTXL1R)
     FVVARL1    IF   E           K DISK    RENAME(VVARPFR:VVARL1R)
     Frkunl1    IF   E           K DISK    RENAME(RKUNPFR:rkunl1r)
     FAFORL1    IF   E           K DISK    RENAME(AFORPFR:AFORL1R)
5.34 ffvlsl1    if   e           k disk    rename(fvlspfr:fvlsl1r)
5.42 ffkprl1    if   e           k disk    rename(fkprpfr:fkprl1r)
6.17 fafirl1    if   e           k disk    rename(afirpfr:afirl1r)
6.23 fra09l1    if   e           k disk    rename(ra09pfr:ra09l1r)
6.28 fra07pf    if   e           k disk
Q.01 fqo932p    o    e             printer
      *
6.12  *
6.12  * Definering av array's
6.12  *
6.12 d mko             s              1    dim(9)
6.12 d msa             s              5  2 dim(9)
6.12 d mgr             s             11  2 dim(9)
6.12 d mbe             s             11  2 dim(9)
6.12 d mog             s             11  2 dim(9)
6.12 d mor             s             11  2 dim(9)
5.34  *
5.34  * Definering av variabler i nøkler
6.23 d ra09l1_ikod     s                   like(raikod)
6.28 d ra07pf_avde     s                   like(ragkod)
5.34  *
5.34 d fvlsl1_numm     s                   like(fvnumm)
5.34 d fvlsl1_suff     s                   like(fvsuff)
5.34 d fvlsl1_line     s                   like(fvline)
5.42 d fkprl1_kund     s                   like(flkund)
5.42 d fkprl1_kpro     s                   like(flkpro)
      *
      * - - - - - - - - - - - - - -
      * Henter inn data fra LDA
      * - - - - - - - - - - - - - -
      *
     d                uds
pdf  d l_poff                584    584
6.21 d l_utqm                585    594
pdf  d l_bach                595    635
pdf  d l_arch                636    636  0
pdf  d l_skje                637    637  0
pdf  d l_land                638    638  0
pdf  d l_exlp                639    639  0
pdf  d l_mail                640    640  0
5.41 d  l_prfi               750    750  0
     d  l_ruti               800    809
5.01 d  l_outq               810    819
6.17 d l_copy                838    843  0
     d  l_alin               856    858  0
5.52 d  l_wsid               901    910
5.52 d  l_user               911    920
pdf  d  l_filg               931    933
     d  l_firm               944    946  0
6.33 d  l_avde               947    950  0
5.52  *
5.52  * Definering av datastruktur
5.52  *
6.23 d                 ds
6.23 d x_mobi                        12
6.23 d  d_tegn                        1    overlay(x_mobi:1)
6.23 d  d_mobn                       11    overlay(x_mobi:2)
5.52 d                 ds
5.52 d d_urec                        80
5.52 d  d_firm                        3  0 overlay(d_urec)
5.60 d  d_aarr                        4  0 overlay(d_urec:4)
6.nu d  d_numm                        8  0 overlay(d_urec:8)
6.nu d  d_suff                        2  0 overlay(d_urec:16)
6.nu d  d_kode                        1    overlay(d_urec:18)
6.nu d  d_date                         d   overlay(d_urec:19) datfmt(*iso)
6.nu d  d_time                         t   overlay(d_urec:29) timfmt(*iso)
6.nu d  d_user                       10    overlay(d_urec:37)
6.nu d  d_wsid                       10    overlay(d_urec:47)
5.01  *
5.01  * Definering av parametre
5.01  *
5.01 d p_mail          s              1
5.01 d p_kund          s              6  0
5.61 d p_kpro          s              6  0
6.nu d p_numm          s              8  0
6.30 d p_suff          s                   like(fosuff)
5.02 d p_selg          s              4  0
      *
pdf  d p_serv          s             35
pdf  d p_stat          s              1
pdf  d p_kule          s              1
pdf  d p_navn          s             30
pdf  d p_emal          s             50
pdf  d p_ema2          s             50
6.30 d p_ema3          s             50
6.30 d p_kopi          s             50
pdf  d p_emne          s             50
pdf  d p_txt1          s             50
pdf  d p_txt2          s             50
pdf  d p_txt3          s             50
pdf  d p_txt4          s             50
pdf  d p_pers          s             50
pdf  d p_inif          s             40
pdf  d p_in03          s              1
6.15 d p_ok            s              1
6.16 d p_lr            s              1
6.16 d p_str_in        s            512
6.16 d p_str_out       s            512
6.32 d p_filg          s             10
6.32 d p_xmlf          s            256
      *
      * Definering av variable
      *
3.12 d w_prfi          s              1  0
3.12 d w_ffir          s              3  0
3.12 d w_avde          s              4  0
3.12 d w_fnav          s             30
3.12 d w_fad1          s             30
3.12 d w_fad2          s             30
3.12 d w_fste          s             30
3.12 d w_fftx          s             30
3.12 d w_tfax          s              8
3.12 d w_ftlf          s             11
3.12 d w_ffax          s             11
3.33 d w_tlfn          s             20
3.33 d w_tlfx          s             20
3.33 d w_mobn          s             20
5.43 d w_rtx1          s             25
5.43 d w_rtx2          s             25
5.43 d w_rtx3          s             25
5.43 d w_retk          s              1
     d wpcbda          s               d   datfmt(*iso)
     d wpcfda          s               d   datfmt(*iso)
      *
5.50 d w_stat          s              1
5.50 d w_mvak          s              1
5.50 d w_mvtx          s             30
5.50 d w_dato          s               d   datfmt(*iso)
5.50 d w_mvas          s              6  2
5.50 d w_mvat          s              5  4
5.50 d w_mvaf          s             10  9
5.50 d w_bpro          s              5  2
6.31 d w_mail          s             50
6.31 d w_weba          s             50
6.35 d w1rab1          s              9  4
      *
6.12 d m               s              2  0
6.12 d w_xmbe          s             11  2
5.50 d w_mvab          s             13  2
5.34 d w_leng          s              6  0
5.34 d w_anta          s              6  0
5.34  *
5.34 d b_leng          s              1    inz(*off)
pdf   *
pdf  d b_pdfp          s              1    inz(*off)
pdf  d b_topt          s              1    inz(*off)
pdf  d b_bott          s              1    inz(*off)
pdf  d x_numm          s             15
pdf  d x_betb          s             42
pdf  d w_bdat          s               d   datfmt(*iso)
pdf  d w_date          s               d   datfmt(*iso)
pdf  d w_kode          s              1
pdf  d w_firm          s                   like(fofirm)
pdf  d w_fell          s              6
pdf  d w_type          s              2
pdf  d w_fast          s             10
pdf  d w_ruti          s             10
6.nu d w_numm          s              8  0
pdf  d w_pdf           s              1  0
pdf  d w_jnav          s             15
pdf  d w_jkey          s             41
pdf  d w_jtxt          s             35
pdf  d w_pdf_ds        s            512
pdf  d w_mtxt          s            300
pdf  d w_jstat         s              2  0
pdf  d w_jtext         s            200
pdf  d w_mark          s              5
pdf  d w_spol          s              5
pdf  d w_land          s              9
pdf  d w_str_in        s            512
pdf  d w_str_out       s            512
pdf  d w_x             s              3  0
pdf  d w_path          s            256
pdf  d w_emal          s             50
6.13 d w_dspl          s            250
6.16 d w_tek1          s            512
6.16 d w_tek2          s            512
6.19 d w_tek0          s            512
6.20 d w_1dref         s            512
6.20 d w_1vref         s            512
6.14 d w_1fnav         s             50
6.14 d w_1fad1         s             50
6.14 d w_1fad2         s             50
6.14 d w_1navn         s             50
6.14 d w_1gate         s             50
6.14 d w_1adr2         s             50
6.14 d w_2navn         s             50
6.14 d w_2adr1         s             50
6.14 d w_2adr2         s             50
6.17 d w_copy          s              3  0
6.18 d w_ptxt1         s             75
6.18 d w_ptxt2         s             75
6.18 d w_ptxt3         s             75
6.18 d w_ptxt4         s             75
6.18 d w_ppers         s             50
6.2F d w_pemne         s             75
6.23 d w_selgn         s             16
6.26 d w_f11t          s            100
6.28 d w_lbtx          s             50
6.28 d w_lmtx          s             50
6.28 d w_ddeno         s                   like(ragkod)
6.28 d w_dnavn         s             50
6.28 d w_dadr1         s             50
6.28 d w_dadr2         s             50
6.28 d w_dpcde         s                   like(ragpnr)
6.28 d w_dpstd         s             50
6.28 d w_dphon         s                   like(ragtlf)
6.28 d w_dfaxn         s                   like(ragfax)
6.28 d w_ldat          s              6  0
6.28 d w_lddt          s              6  0
6.29 d w_draw1         s             25
6.29 d w_draw2         s             25
6.29 d w_skuf          s             25
6.29 d w_dtray         s             10
6.29 d w_gtray         s             10
6.2A d w_rekv          s             50
6.2C d w_refn          s             50
6.2G d w_lvar          s             50
6.34 d w_kamp          s             10
8.02 d w_price         s              5
8.03 d w_year          s              4  0
8.03 d w_stmp          s               z
pdf   *
pdf  d XML_Output      s            256a   Varying
pdf  d XML_path        s            256a   Varying
pdf  d                                     Inz('/home/asp/print/adb')
pdf  d jasper_mal      s            256a   inz('file:/home/asp/print/maler/+
pdf  d                                     ordrebekreftelse/ORDREBEKREF.jasper')
pdf  d jasper_logo     s            256a   Varying
pdf  d tmpdate         s               D
pdf  d tmptime         s               T
6.18 d crlf            c                   const(X'0d25')
pdf   *
pdf  d d_pdf_ds        ds
pdf  d  d_xmlm                       75
pdf  d  d_jasm                       75
pdf  d  d_logo                       75
pdf  d  d_path                      100
pdf  d  d_emal                       50
6.32 d  d_fifo                       75
6.32 d  d_kopi                        1
6.32 d  d_dtaq                        1
6.32 d  d_sign                        1
pdf   /copy prototypeb
pdf   /copy usec
      *
      *
     IFPSOL1R       01
     I                                          FKSSRT        L4
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av formater                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede formater
      * - - - - - - - - - -
      *
      * A1HDR  - Heading A1 på rapport
      * A2HDR  - Heading A2 på rapport
      * A4HDR  - Heading A4 på rapport, Ordrehode over varelinje
      * D1DET  - Detail  D1 på rapport, Varelinje
      * E1DET  - Detail  E1 på rapport, Tekstlinje
      * O1DET  - Detail  O1 på rapport, Overføring til/fra neste side
      * T1TOT  - Total   T1 på rapport
      *
      *
      * Forklaring på variabler
      * - - - - - - - - - - - -
      *
      * D1ANT0 - Antall med 0 desimaler
      * D1ANT1 - Antall med 1 desimaler
      * D1ANT2 - Antall med 2 desimaler
      * D1ANT3 - Antall med 3 desimaler
      * D1NPRI - Netto  pris
      * D1BPRI - Brutto pris
      * D1NBEL - Netto  beløp
      * D1BBEL - Brutto beløp
      * D1RABP - Rabatt i prosent (Sum prosent 1 og 2)
      * D1RABB - Rabatt i beløp
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Styre-rutine                                                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
8.03  *
8.03 C/Exec SQL
8.03 C+  Set Option DatFmt=*ISO, DlyPrp=*YES, SRTSEQ=*LANGIDUNQ, LANGID=NOR,
8.03 C+             commit=*none
8.03 C/End-Exec
      *
      * Initierings-rutine
      *
     C   01FCYCLE        CASEQ     *ZERO         XSTRSR
     C                   ENDCS
      *
      * Ordrehode
      *
     C     FKSKOD        CABEQ     'H'           TAG01
      *
      * Varelinje
      *
     C     FKSKOD        CABEQ     'V'           TAG02
      *
      * Kommentar/
      * tekstlinje
      *
     C     FKSKOD        CABEQ     'K'           TAG03
      *
      * Ferdig
      *
     C                   GOTO      XSLUTT
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A1HDR Behandle heading A1 + A2                                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG01         TAG
      *
      * Null-stilling av variabler
      *
     C                   Z-ADD     0             O1TRSP
      *
      * Hent ordre-heading
      *
     C                   MOVE      FKSONR        WWNUMM
     C                   MOVE      FKSSUF        WWSUFF
     C     KEY01         CHAIN     FOHEL1R                            61
      *
      * Snu dato
      *
     c                   if        fobdat <> *loval
     c     *dmy          move      fobdat        a1bdat
     c                   endif
      *
     c                   if        foldat <> *loval
     c     *dmy          move      foldat        a1ldat
6.28 c     *dmy          move      foldat        w_ldat
     c                   endif
      *
      * Legg inn ordrenummer
      *
     C                   MOVE      FONUMM        A1NUMM
     C                   MOVEL     '/'           A1SUFF
     C                   MOVE      FOSUFF        A1SUFF
      *
      * Flere ordre på samme
      * blankett ?
      *
     C  NL4              GOTO      TAG01A
      *
      * Hente inn kunderegister
      *
     C                   MOVE      FOKUND        WWKUND
     C     KEY04         CHAIN     rkunl1r                            64
     C                   MOVE      FOKUND        A1KUND
     C                   MOVE      RKKATG        A1KATG
     C                   MOVE      RKNAVN        A1NAVN
     C                   MOVE      RKGATE        A1GATE
     C                   MOVE      RKADR2        A1ADR2
     C                   MOVE      RKSTED        A1STED
      *
      * Sjekke tilbuds-kunden
      *
     C     FOKUND        IFEQ      W0KUND
     C                   MOVE      FOLKUN        FOKUND
     C                   MOVE      FONAVN        A1NAVN
     C                   MOVE      FOADR1        A1GATE
     C                   MOVE      FOADR2        A1ADR2
     C                   MOVE      FOSTED        A1STED
     C                   MOVE      *ZERO         FOLKUN
     C                   MOVE      *BLANK        FONAVN
     C                   MOVE      *BLANK        FOADR1
     C                   MOVE      *BLANK        FOADR2
     C                   MOVE      *BLANK        FOSTED
     C                   END
5.42  *
5.42  * Hente inn kundeprosjekt
5.42  * (eksternt kundeprosjekt)
5.42  *
5.42 c                   eval      *in59  = *off
5.42 c                   eval      a1epro = *blank
5.42 c                   eval      a1kpro = 0
5.42 c                   if        fokpro <> 0
5.42 c                   eval      *in59  = *on
5.42 c                   eval      fkprl1_kund = fokund
5.42 c                   eval      fkprl1_kpro = fokpro
5.42 c     fkprl1_key    chain     fkprl1r
5.42 c                   if        %found
5.42 c                   eval      a1epro = flepro
5.42 c                   eval      a1kpro = fokpro
5.42 c                   endif
5.42 c                   endif
      *
      * Finner hvilken mva-sats
      * som skal benyttes
      *
5.50 c*                  call      'FÅ705R'
5.50 c*                  parm                    wwfirm
5.50 c*                  parm                    fobdat
5.50 c*                  parm                    wpmvas
5.50 c*                  parm                    wpmvat
5.50 c*                  parm                    wpmvaf
      *
      * Hente inn betalingsbetingelser
      *
     C                   exsr      sbbetb
      *
      * Er det registrert
      * leveringsadresse?
      *
     C                   MOVE      *OFF          *IN31
     C     FONAVN        IFNE      *BLANK
     C                   MOVE      *ON           *IN31
     C                   MOVE      FONAVN        A2NAVN
     C                   MOVE      FOADR1        A2ADR1
     C                   MOVE      FOADR2        A2ADR2
     C                   MOVE      FOSTED        A2STED
     C                   ENDIF
      *
      * Er det registrert
      * leveringsdato?
      *
     C                   MOVE      *OFF          *IN32
     C     FOLDAT        IFNE      *loval
     C                   MOVE      *ON           *IN32
     C                   ENDIF
5.43  *
5.43  * Er det registrert
5.43  * leveringsbetingelser
5.43  *
5.43 c                   eval      w_retk = *blank
5.43 c                   eval      w_rtx1 = *blank
5.43 c                   eval      w_rtx2 = *blank
5.43 c                   eval      w_rtx3 = *blank
5.43 c                   if        folbet <> 0
5.43 c                   call      'RS718R'
5.43 c                   parm                    w_retk
5.43 c                   parm                    folbet
5.43 c                   parm                    w_rtx1
5.43 c                   parm                    w_rtx2
5.43 c                   parm                    w_rtx3
5.43 c                   eval      a1lbet = w_rtx1
5.43 c                   endif
      *
      * Er det registrert
      * kundens referanse?
      *
     C                   MOVE      *OFF          *IN33
     C     FODREF        IFNE      *BLANK
     C                   MOVE      *ON           *IN33
     C                   MOVE      FODREF        A1DREF
     C                   ENDIF
      *
      * Er det registrert
      * leveringsmåte?
      *
     C                   MOVE      *OFF          *IN34
     C     FOLMTX        IFNE      *BLANK
     C                   MOVE      *ON           *IN34
     C                   MOVE      FOLMTX        A1LMTX
     C                   ENDIF
      *
      * Er det registrert
      * rekvisisjon?
      *
     C                   MOVE      *OFF          *IN35
     C     FOREKV        IFNE      *BLANK
     C                   MOVE      *ON           *IN35
     C                   MOVE      FOREKV        A1REKV
     C                   ENDIF
3.31  *
3.31  * Skal faktura skrives uten rabatter,
3.31  * kun med nettobeløp ?
3.31  *
3.31 c                   eval      *in39  = *off
3.31 c                   if        foneto = 1
3.31 c                   eval      *in39  = *on
3.31 c                   endif
3.33  *
3.33  * Hente inn telefon/fax/mobil fra kunde
3.33  *
3.33 c                   call      'FÅ710R'
3.33 c                   parm                    wwfirm
3.33 c                   parm                    a1kund
3.33 c                   parm                    fokpro
3.33 c                   parm                    w_tlfn
3.33 c                   parm                    w_tlfx
3.33 c                   parm                    w_mobn
3.33 c                   eval      a1tlfn = w_tlfn
3.33 c                   eval      a1tlfx = w_tlfx
3.33 c                   eval      a1mobn = w_mobn
5.21  *
5.21  * Overstyre med mobilnummer fra ordrehode
5.21  * dersom oppgitt
5.21  *
5.21 c                   if        fomobi <> *blank
5.21 c                   eval      a1mobn = 'Mob: ' + fomobi
5.21 c                   endif
      *
      * Flytte øvrige felter
      *
     C                   MOVE      FOREKV        A1REKV
     C     *hms          MOVE      FOTIME        A1TIME
     C                   MOVE      FOSELG        A1SELG
6.23 C                   EVAL      X_MOBI = *BLANK
6.23 C                   EVAL      X_MOBN = *BLANK
6.23  *
6.23 C                   IF        FAAMSA = 1
6.23 C                   EVAL      RA09L1_IKOD = FOSELG
6.23 C     RA09L1_KEY    chain     RA09L1
6.23 C                   IF        RAIMOB <> *BLANK
6.23 C                   MOVE      '/'           D_TEGN
6.23 C                   MOVE      RAIMOB        D_MOBN
6.23 C                   MOVE      X_MOBI        X_MOBN
6.23 C                   ENDIF
6.23 C                   ENDIF
6.23  *
     C                   MOVE      FOVREF        A1VREF
5.01  *
5.01  * Legg ut kundenummer i parameter
5.01  *
5.01 c                   if        l_outq = 'E_MAIL_ASP'
5.01 c                   eval      p_kund = fokund
5.61 c                   eval      p_kpro = fokpro
5.02 c                   eval      p_numm = fonumm
5.02 c                   eval      p_selg = foselg
5.01 c                   endif
3.12  *
3.12  *  Hent inn firma/avd. opplysninger dersom
3.12  *  kode for det er satt i rutineregister
3.12  *
5.41 c                   if        l_prfi = 1 or
5.41 c                             l_prfi = 2
5.41 c                   eval      w_prfi = l_prfi
3.12 c                   eval      w_ffir = wwfirm
3.12 c                   eval      w_avde = foavde
3.12  *
3.12 c                   call      'FÅ707R'
3.12 c                   parm                    w_prfi
3.12 c                   parm                    w_ffir
3.12 c                   parm                    w_avde
3.12 c                   parm                    w_fnav
3.12 c                   parm                    w_fad1
3.12 c                   parm                    w_fad2
3.12 c                   parm                    w_fste
3.12 c                   parm                    w_fftx
3.12 c                   parm                    w_tfax
3.12 c                   parm                    w_ftlf
3.12 c                   parm                    w_ffax
6.31 c                   parm                    w_mail
6.31 c                   parm                    w_weba
3.12  *
3.12 c                   eval      a1fnav = w_fnav
3.12 c                   eval      a1fad1 = w_fad1
3.12 c                   eval      a1fad2 = w_fad2
3.12 c                   eval      a1fste = w_fste
3.12 c                   eval      a1fftx = w_fftx
3.12 c                   eval      a1tfax = w_tfax
3.12 c                   eval      a1ftlf = w_ftlf
3.12 c                   eval      a1ffax = w_ffax
3.12 c                   endif
5.22  *
5.22  * Legger inn '/' mellom
5.22  * telefon og telefax
5.22  *
5.22 c                   eval      a1skra =  ' '
5.22 c                   if        a1ftlf <> *blank and
5.22 c                             a1ffax <> *blank
5.22 c                   eval      a1skra =  '/'
5.22 c                   endif
6.28  * Hent inn avdelingsinfo - uavhengig av om dette ligger i firmatagger
6.28 c                   exsr      hnt_avde
      *
      * Skrive heading
      *
pdf  c                   if        b_pdfp = *off
     C                   Z-ADD     0             WLTELL
     C                   WRITE     A1HDR
     C                   WRITE     A2HDR
pdf  c                   else
pdf   * Vi skriver til XML taggene for heading
pdf  c                   exsr      xml_head
pdf  c                   endif
      *
      * Skriv heading over
      * varelinjer
      *
pdf  c                   if        b_pdfp = *off
     C     VAOSAM        IFEQ      1
     C                   ADD       2             WLTELL
     C                   WRITE     A4HDR                                30
     C                   ENDIF
pdf  c                   endif
      *
5.52  *
5.52  * Behandling dersom kjørekontorløsning
5.52  *
5.52  * Er kjørekontorløsning aktivert ?
5.52  *
5.52 c                   if        faakjk <> 1
5.52 c                   goto      xslutt
5.52 c                   endif
5.52  *
5.52  * Oppdaterer loggfile med at
5.52  * ordrebekreftelse er kjørt
5.52  *
5.52 c                   eval      d_firm = l_firm
5.52 c                   eval      d_user = l_user
5.52 c                   eval      d_wsid = l_wsid
5.60 c                   eval      d_aarr = %subdt(fobdat:*years)
5.52 c                   eval      d_numm = fonumm
5.52 c                   eval      d_suff = fosuff
5.52 c                   eval      d_kode = '1'
5.52 c                   time                    d_date
5.52 c                   time                    d_time
5.52  *
5.52  * Kaller program for oppdatering
5.52  *
5.52 c                   call      'FU900R'
5.52 c                   parm                    w_stat
5.52 c                   parm                    d_urec
5.52  *
     C                   GOTO      XSLUTT
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Heading U/L4-brudd                                              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG01A        TAG
      *
      * Skriv heading over
      * varelinjer
      *
pdf  c                   if        b_pdfp = *off
     C     VAOSAM        IFEQ      1
     C                   ADD       2             WLTELL
     C                   WRITE     A4HDR                                30
     C                   ENDIF
pdf  c                   endif
      *
     C                   GOTO      XSLUTT
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * D1DET Behandle detail D1                                        *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG02         TAG
      *
      * Nullstilling av variabler
      *
      *
     C                   MOVE      *BLANK        D1VARE
     C                   MOVE      *BLANK        D1TEK1
     C                   MOVE      *BLANK        D1TEK2
     C                   MOVE      *BLANK        D1ENH1
     C                   MOVE      *BLANK        D1TINE
3.32 c                   move      *zero         d1benr
5.22 c                   move      *zero         d1lety
     C                   MOVE      *ZERO         D1ANT0
     C                   MOVE      *ZERO         D1ANT1
     C                   MOVE      *ZERO         D1ANT2
     C                   MOVE      *ZERO         D1ANT3
     C                   MOVE      *OFF          *IN44
     C                   MOVE      *OFF          *IN46
      *
     C                   MOVE      FKSONR        WWNUMM
     C                   MOVE      FKSSUF        WWSUFF
     C                   MOVE      FKSLIN        WWLINE
     C     KEY02         CHAIN     FODTL1R                            62
      *
      * Hent linje-type
      *
     C                   MOVE      FDLTYP        WWLTYP
     C     KEY08         CHAIN     VLTYL1R                            68
      *
      * Sjekker om linjen ikke skrives på ordretypen
      *
     C     FOOTYP        CABEQ     VALO01        XSLUTT
      *
     C     FOOTYP        CABEQ     VALO02        XSLUTT
      *
     C     FOOTYP        CABEQ     VALO03        XSLUTT
      *
     C     FOOTYP        CABEQ     VALO04        XSLUTT
      *
      * Sjekker om tekstlinjer
      *
     C     VALKTX        CABEQ     1             TAG02A
      *
      * Oppslag mot vareregister
      *
     C                   MOVE      FDVARE        WWVARE
     C     KEY11         CHAIN     VVARL1R                            69
      *
      * Sjekk om tilbud/netto-pris
      *
     C     FDSUMR        IFEQ      *ZERO
     C                   MOVE      *ON           *IN46
     C                   MOVE      *BLANK        D1TINE
     C                   MOVE      FDkpri        WWPKOD
     C     KEY19         CHAIN     VPKOL1R                            69
     C     *IN69         IFEQ      *OFF
     C                   MOVE      vaptxt        D1TINE
     C                   END
     C                   END
3.13  *
3.13  * Dersom vare er hentet fra LVR,
3.13  * sett inn  2 desimaler som std.
3.13  *
3.13 c                   if        fdlvre = 1
3.13 c                   eval      vvdesi = 2
3.13 c                   endif
      *
      * Test på antall desimaler
      *
     C     VVDESI        COMP      0                                      40
     C     VVDESI        COMP      1                                      41
     C     VVDESI        COMP      2                                      42
     C     VVDESI        COMP      3                                      43
     C   40              Z-ADD     FDANTA        D1ANT0
     C   41              Z-ADD     FDANTA        D1ANT1
     C   42              Z-ADD     FDANTA        D1ANT2
     C   43              Z-ADD     FDANTA        D1ANT3
      *
      * Varelinje
      *
      *
     C                   MOVE      FDVARE        D1VARE
     C                   MOVEL     FDTEK1        D1TEK1
     C                   MOVE      FDENH1        D1ENH1
3.32 c                   move      fdbenr        d1benr
     C                   Z-ADD     FDsapr        D1BPRI
5.22 c                   z-add     fdlety        d1lety
      *
      * Beregne snittrabatt
      *
     C     100           SUB       FDRAB1        W1RAB1
     C                   MULT      FDRAB2        W1RAB1
     C                   DIV       100           W1RAB1
     C                   ADD       FDRAB1        W1RAB1
3.31  *
3.31  * Skal rabatter vises som nettobeløp
3.31  * uten prosentsatser ?
3.31  *
3.31 c                   if        *in39  = *on
3.31 c                   eval      d1bpri = d1bpri -
3.31 c                                     (d1bpri * w1rab1 / 100)
3.31 c                   endif
3.11  *
3.11  * Beregne varelinjerabatt
3.11  *
3.11 C     FDSUMS        DIV       100           W1BELX           13 4
3.11 C     W1BELX        MULT(H)   W1RAB1        W1SUMR
3.11  *
3.11  * Netto pris
3.11  *
3.11 C                   Z-ADD     FDANTA        W1ANTA
3.11 C     W1ANTA        IFEQ      0
3.11 C                   Z-ADD     1             W1ANTA
3.11 C                   ENDIF
3.11  *
3.11 C     FDSUMS        SUB       w1SUMR        W1NPRI
3.11 C     W1NPRI        DIV       W1ANTA        D1NPRI
3.11 C                   Z-ADD     W1SUMR        D1RABB
6.35 c**                 Z-ADD     W1RAB1        D1RABP
6.35 c                   eval(h)   d1rabp = w1rab1
      *
      * Sum Beløp
      *
     C                   Z-ADD     FDSUMS        D1BBEL
3.11 C     FDSUMS        SUB       w1SUMR        D1NBEL
      *
      * Skal mva. beregnes ?
      *
     C     AFMVAK        IFEQ      1
     C                   MOVE      *ON           *IN37
     C                   ENDIF
      *
5.50  * Henter mva-kode, beregn mva
5.50  * + legger ut riktig sats på varlinje
5.50  *
6.12 c                   eval      d1mvap = 0
6.12 c                   eval      w_mvas = 0
6.12  *
5.50 c                   if        fdomva <> *blank
5.50 c                   eval      w_stat = *blank
5.50 c                   eval      w_mvak = fdomva
5.50 c                   time                    w_dato
5.50  *
5.50 c                   call      'RS205R'
5.50 c                   parm                    w_stat
5.50 c                   parm                    w_mvak
5.50 c                   parm                    w_mvtx
5.50 c                   parm                    w_dato
5.50 c                   parm                    w_mvas
5.50 c                   parm                    w_mvat
5.50 c                   parm                    w_mvaf
5.50 c                   parm                    w_bpro
5.50  *
5.50 c                   if        w_mvas > 0
5.50 c                   eval(h)   w_mvab = w_mvab + (d1nbel * w_mvas / 100)
5.50 c                   eval(h)   d1mvap = w_mvas
6.12 c                   exsr      xarray
5.50 c                   endif
5.50 c                   endif
      *
      * Akkumuler til overføringssum
      *
     C                   ADD       D1NBEL        O1TRSP
3.11  *
3.11  * Med i ordrerabattgrunnlaget ?
3.11  *
3.11 c     FORABP        IFGT      *ZEROS
3.11 c     VVKORD        ANDEQ     *ZEROS
3.11 c                   ADD       D1NBEL        W1RABG
3.11 c                   ENDIF
3.11  *
3.11  * Varsle linjer som ikke inngår
3.11  *
3.11 c                   MOVE      *BLANK        D1INFO
3.11 c     FORABP        IFGT      *ZEROS
3.11 c     VVKORD        ANDEQ     1
3.11 c                   MOVE      '*'           D1INFO
3.11 c                   ENDIF
      *
      * Skriv varelinjer
      *
     C     TAG02A        TAG
pdf   *
pdf  c                   if        b_pdfp = *off
pdf   *
     C                   ADD       1             WLTELL
     C     VALKTX        IFNE      1
     C                   WRITE     D1DET                                30
     C                   ELSE
     C                   MOVEL     FDTEK1        D1TEK1
     C                   MOVEL     FDTEK2        D1TEK2
     C                   MOVE      *ON           *IN44
     C                   WRITE     D2DET                                30
     C                   END
      *
      * Er det overflow ?
      *
     C     *IN30         CASEQ     *ON           XOVRFL
     C                   ENDCS
5.22  *
5.22  * Skriv varelinje for tekst 2
5.22  * dersom den er oppgitt
5.22  *
5.22 c                   if        fdtek2 <> *blank
5.22 c                   if        valktx <> 1
5.22 c                   add       1             wltell
5.22 c                   eval      d1tek2 = fdtek2
5.22 c                   write     d1det2                               30
5.22  *
5.22  * Er det overflow ?
5.22  *
5.22 c                   if        *in30 = *on
5.22 c                   exsr      xovrfl
5.22 c                   endif
5.22  *
5.22 c                   endif
5.22 c                   endif
pdf   * Skriver XML tagger for detaljer
pdf  c                   else
pdf  c                   exsr      xml_deta
pdf  c                   endif
5.34  *
5.34 c                   exsr      skr_leng
      *
     C                   GOTO      XSLUTT
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Behandling av tekstlinjer                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     TAG03         TAG
      *
     C                   MOVE      FKSONR        WWNUMM
     C                   MOVE      FKSSUF        WWSUFF
     C                   MOVE      FKSLIN        WWLINE
     C     KEY03         CHAIN     FOTXL1R                            63
      *
      * Gå ut dersom det
      * ikke er oppsamling,
      * og linje-nummer er
      * større enn 5000.
      * Da skal print fore-
      * gå tilslutt på L4.
      *
     C     VAOSAM        IFEQ      0
     C     FKSLIN        IFGE      5000
     C                   GOTO      XSLUTT
     C                   END
     C                   ENDIF
      *
     C                   MOVEL     FTTEXT        E1TEXT
pdf  c                   if        b_pdfp = *off
pdf   *
     C                   ADD       1             WLTELL
     C                   WRITE     E1DET                                30
      *
      * Er det overflow ?
      *
     C     *IN30         CASEQ     *ON           XOVRFL
     C                   ENDCS
pdf   * Skriver XML tagger for tekstlinjer
pdf  c                   else
pdf  c                   if        b_topt = *off
pdf  c                   exsr      xml_topt_str
pdf  c                   eval      b_topt = *on
pdf  c                   endif
pdf  c                   exsr      xml_topptxt
pdf  c                   endif
      *
     C     XSLUTT        TAG
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * T1TOT Behandle total T1                                         *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Null-stille variabler
      *
     CL4                 Z-ADD     0             T1TOTB
     CL4                 Z-ADD     0             T1TMVA
      *
      * Netto beløp
      *
     CL4   FOTOTS        SUB       FOTOTR        T1TNET
3.11  *
3.11  * BEHANDLE ORDRERABATT
3.11  *
3.11 CL4   W1RABG        IFGT      *ZEROS
3.11 CL4   W1RABG        MULT      FORABP        W1RABB
3.11 CL4                 DIV       100           W1RABB
3.11 CL4                 Z-ADD     FORABP        R1RABP
3.11 CL4                 Z-ADD     W1RABG        R1RABG
3.11 CL4                 Z-ADD(H)  W1RABB        R1RABB
3.11 C*4                 SUB       R1RABB        T1TNET
3.11 CL4                 MULT      -1            R1RABB
pdf  cl4                 if        b_pdfp = *off
3.11 CL4                 WRITE     R1RAB
pdf  cl4                 else
pdf  cl4                 exsr      xml_rabatt
pdf  cl4                 endif
3.11 CL4                 Z-ADD     0             W1RABB
3.11 CL4                 Z-ADD     0             W1RABG
3.11 CL4                 ENDIF
      *
      * Skal mva. beregnes ?
      *
     CL4                 MOVE      *ON           *IN37
5.50 C*4   T1TNET        MULT      WPMVAT        T1TOTB
5.50 C*4   T1TOTB        SUB       T1TNET        T1TMVA
      *
      * Finne ut om det er
      * plass til å skrive
      * avslutning uten å
      * skifte til ny side
      * først.
      *
      * Trekker ut heading
      *
     CL4   l_alin        SUB       24            WLTEST
      *
      * Trekker ut antall
      * linjer skrevet
      *
     CL4                 SUB       WLTELL        WLTEST
      *
      * Trekker ut plassbehov
      * for avslutning
      *
     CL4                 SUB       10            WLTEST
      *
      * Skrive ny heading ?
      *
pdf  cl4                 if        b_pdfp = *off
     CL4   WLTEST        IFLT      0
     CL4                 WRITE     A1HDR
     CL4                 WRITE     A2HDR
     CL4                 Z-ADD     0             WLTELL
     CL4                 ENDIF
      *
      * Skrive totalsum
      *
     CL4                 WRITE     T1TOT                                30
pdf  cl4                 else
pdf  cl4                 exsr      xml_netto
pdf  cl4                 endif
6.12  *
6.12  * Beregner mva for de forskjellige satser
6.12  *
6.12 cl4                 eval      mbe = (mgr - mor) * msa / 100
6.12 cl4                 xfoot     mbe           w_xmbe
6.12 cl4                 eval      t1totb = t1tnet + w_xmbe
6.12  *
6.12 cl4   1             do        9             m
6.12 cl4                 if        mko(m) <> ' '
6.12 cl4                 eval      t1mvas = msa(m)
6.12 cl4                 eval      t1mvag = mgr(m) - mor(m)
6.12 cl4                 eval      t1tmva = mbe(m)
pdf  cl4                 if        b_pdfp = *off
6.12 cl4                 write     t1tot2                               30
pdf  cl4                 else
pdf  cl4                 exsr      xml_vat
pdf  cl4                 endif
6.12 cl4                 endif
6.12 cl4                 enddo
6.12  *
pdf  cl4                 if        b_pdfp = *off
6.12 cl4                 write     t1tot3                               30
pdf  cl4                 else
pdf  cl4                 exsr      xml_totaler
pdf  cl4                 endif
6.12  *
      *
      * Skrive tekstlinjer
      * dersom det ikke er
      * oppsamling og linje
      * nummer er større enn
      * 5000.
      *
     CL4   VAOSAM        IFEQ      0
     CL4                 MOVE      FKSONR        WWNUMM
     CL4                 MOVE      FKSSUF        WWSUFF
     CL4                 Z-ADD     5000          WWLINE
     CL4   KEY03         SETLL     FOTXL1R
     CL4                 READ      FOTXL1R                                63
     CL4   *IN63         CABEQ     *ON           TAG99
      *                                                                 .
     CL4   WWNUMM        DOWEQ     FTNUMM
     CL4   WWSUFF        IFEQ      FTSUFF
      *                                                               . .
     CL4                 MOVEL     FTTEXT        E1TEXT
pdf  cl4                 if        b_pdfp = *off
     CL4                 ADD       1             WLTELL
     CL4                 WRITE     E1DET                                30
      *                                                               . .
      * Er det overflow ?                                             . .
      *                                                               . .
     CL4   *IN30         IFEQ      *ON
     CL4                 WRITE     A1HDR
     CL4                 WRITE     A2HDR
     CL4                 Z-ADD     0             WLTELL
     CL4                 ENDIF
pdf   *
pdf   * Skriver XML tagger for tekstlinjer
pdf  cl4                 else
pdf  cl4                 if        b_bott = *off
pdf  cl4                 exsr      xml_bott_str
pdf  cl4                 eval      b_bott = *on
pdf  cl4                 endif
pdf  cl4                 exsr      xml_bunntxt
pdf  cl4                 endif
     CL4                 ENDIF
      *                                                               . .
     CL4                 READ      FOTXL1R                                63
     CL4   *IN63         CABEQ     *ON           TAG99
     CL4                 ENDDO
     CL4                 ENDIF
      *
     CL4   TAG99         TAG
pdf   *
pdf  cl4                 if        b_pdfp = *on
6.37  *
6.37  * Sjekk at utplukksfila inneholder minst en gyldig ordre
6.37  *
6.37 cl4                 if        fcycle <> 0
pdf   * Skriv xml fila på disk
pdf  cl4                 exsr      xml_end
pdf   * Hvis forhåndvisning må vi kjøre linken
pdf  cl4                 if        l_skje = 1 and
pdf  c                             l_bach = w_jkey
pdf  cl4                 exsr      pdf_preview
pdf  cl4                 endif
6.37 cl4                 endif
pdf   * Avslutt jobbiden
pdf  cl4                 call      'AB710R'
pdf  cl4                 parm                    l_bach
pdf   *
pdf   * Hvis utskrift av nytt tilbud må vi finne ny id til xml og java
pdf  cl4                 if        *inlr = *off
pdf   *
pdf  cl4                 eval      w_kode = '0'
pdf  cl4                 eval      w_firm = l_firm
pdf  cl4                 eval      w_fell = 'NXTKLI'
pdf  cl4                 eval      w_type = *blank
pdf  cl4                 eval      w_fast = *blank
pdf  cl4                 eval      w_numm = *zero
pdf   *
pdf  cl4                 call      'AS100R'
pdf  cl4                 parm                    w_kode
pdf  cl4                 parm                    w_firm
pdf  cl4                 parm                    w_fell
pdf  cl4                 parm                    w_type
pdf  cl4                 parm                    w_fast
pdf  cl4                 parm                    w_numm
pdf   *
pdf  cl4                 eval      w_jnav = 'PDF' + %char(w_numm)
Q.01 cl4                 eval      w_jtext = 'Utskrift av prisbekreftelse har +
pdf  c                                       startet'
pdf  cl4                 call      'AB700R'
pdf  cl4                 parm                    w_jnav
pdf  cl4                 parm                    w_jkey
pdf  cl4                 parm                    w_jtxt
pdf   * Vi logger at utskriftprogrammet har startet
pdf  cl4                 eval      w_jstat = 10
Q.01 cl4                 eval      w_jtext = 'Utskrift av prisbekreftelse har +
pdf  c                                       startet'
pdf  cl4                 call      'AB705R'
pdf  cl4                 parm                    l_bach
pdf  cl4                 parm                    w_jstat
pdf  cl4                 parm                    w_jtext
pdf   * Vi skriver xml for miljø formater
pdf  cl4                 exsr      xml_envm
pdf  cl4                 endif
pdf  cl4                 endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Sjekk/Hent tekst for betalingsbetingelser         RS203R       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     C     SBBETB        BEGSR
      *
     c                   eval      wpcbda = *loval
     c                   eval      wpcfda = *loval
      *
     c                   call      'FÅ703R'
     c                   parm                    wwfirm
     c                   parm                    fobetb
     c                   parm                    wpcbda
     c                   parm                    wpretk
     c                   parm                    wpcfda
     c                   parm                    wpctx1
     c                   parm                    wpctx2
      *
     C                   MOVE      *BLANK        A1BTX1
     C                   MOVE      *BLANK        A1BTX2
      *
     C     WPRETK        IFEQ      *BLANK
     C                   MOVEL     WPCTX1        A1BTX1
     C                   MOVEL     WPCTX2        A1BTX2
     C                   ENDIF
      *
     C                   ENDSR
5.34  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
5.34  * Subrutine for utskrift av lengdespesifikasjoner
5.34  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
5.34  *
5.34 c     skr_leng      begsr
5.34  *
5.34 c                   eval      b_leng = *off
5.34  *
5.34 c                   eval      fvlsl1_numm = wwnumm
5.34 c                   eval      fvlsl1_suff = wwsuff
5.34 c                   eval      fvlsl1_line = wwline
5.34 c     fvlsl1_key    setll     fvlsl1
5.34 c     fvlsl1_key    reade     fvlsl1
5.34  *
5.34 c                   dow       not %eof
5.34 c                   eval(h)   w_leng = fvleng
5.34 c                   eval(h)   w_anta = fvanta
5.34 c                   eval      f1text = %char(w_leng) + ' mm x ' +
5.34 c                                      %char(w_anta) + ' stk'
5.34 c                   if        b_leng = *off
5.34 c                   eval      b_leng = *on
5.34 c                   endif
5.34  *
pdf  c                   if        b_pdfp = *off
pdf   *
5.34 c                   write     f1det                                30
5.34 c     *in30         caseq     *on           xovrfl
5.34 c                   endcs
pdf   * Vi skriver til XML taggene for lengdeinformasjon
pdf  c                   else
pdf  c                   exsr      xml_spec
pdf  c                   endif
5.34 c     fvlsl1_key    reade     fvlsl1
5.34 c                   enddo
5.34  *
5.34 c*                  if        b_leng = *on
5.34 c*                  eval      f1text = *blank
5.34 c*                  write     f1det                                30
5.34 c*    *in30         caseq     *on           xovrfl
5.34 c*                  endcs
5.34 c*                  endif
5.34  *
5.34 c     end_leng      endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for overflow                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     XOVRFL        BEGSR
pdf   *
pdf  c                   if        b_pdfp = *off
      *
     C                   MOVE      *ON           *IN45
     C                   WRITE     O1DET
     C                   WRITE     A1HDR
     C                   WRITE     A2HDR
     C                   MOVE      *OFF          *IN45
     C                   WRITE     O1DET
     C                   Z-ADD     0             WLTELL
      *
pdf  c                   endif
      *
     C                   ENDSR
6.12  *
6.12  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.12  * Subrutine for array-håndtering av mva
6.12  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.12  *
6.12 c     xarray        begsr
6.12  *
6.12 c     1             do        9             m
6.12 c                   if        mko(m) = w_mvak or
6.12 c                             mko(m) = ' '
6.12 c                   eval      mko(m) = w_mvak
6.12 c                   eval      msa(m) = w_mvas
6.12 c                   eval      mgr(m) = mgr(m) + d1nbel
6.12  *
6.12 c                   if        forabp > 0
6.12 c                   if        vvkord = 0
6.12 c                   eval      mog(m) = mog(m) + d1nbel
6.12 c                   eval      mor(m) = mog(m) * forabp / 100
6.12 c                   endif
6.12 c                   endif
6.12  *
6.12 c                   leave
6.12 c                   endif
6.12 c                   enddo
6.12  *
6.12 c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for oppstart                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     XSTRSR        BEGSR
      *
     C                   Z-ADD     1             FCYCLE            1 0
      *
      * Legger inn firma i nøkkel
      *
     C                   MOVE      FKSFIR        WWFIRM
      *
      * Hente Kunde-tilbuds-nummer
      *
     C     KEY09         CHAIN     FSTSL1R                            69
      *
     C     *IN69         IFEQ      *OFF
     C                   MOVE      FAAKUN        W0KUND
     C                   END
      *
      * Slår opp ordretype
      *
     C                   MOVE      FKSOTY        WWOTYP
     C     KEY07         CHAIN     VOTYL1R                            67
      *
      * Er ordretype negativ ?
      *
     C     VAOKRE        IFEQ      '-'
     C                   MOVE      *ON           *IN36
     C                   ENDIF
6.12  *
6.12  * Nullstilling av array's
6.12  *
6.12 c                   eval      mko = *blank
6.12 c                   eval      msa = *zero
6.12 c                   eval      mgr = *zero
6.12 c                   eval      mbe = *zero
6.12 c                   eval      mog = *zero
6.12 c                   eval      mor = *zero
      *
6.18  * Slår opp etter firmainformasjon
6.18  *
6.18 c                   if        afprfi = 1 or
6.18 c                             afprfi = 2
6.18 c     afirl1_key    chain     afirl1r
6.18 c                   endif
6.18  *
     C                   ENDSR
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Miljø variabler         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_envm      begsr
pdf   * Hvis skjermvisning skal vi ikke lagre i spoolfile
pdf  c                   if        l_skje = 1
pdf  c                   eval      w_spol = 'true'
pdf  c                   else
pdf  c                   eval      w_spol = 'false'
pdf  c                   endif
pdf   *
pdf   /Free
pdf        // Finne nytt batch nummer
pdf            UpdHTMLVar('BatchNo':               w_jkey);
Q.01           UpdHTMLVar('Batchtype':  'PRISBEKREFTELSE');
pdf            UpdHTMLVar('Username':              l_user);
pdf            WrtSection('Topp');
pdf
pdf        // Finn credetial variabler
pdf            UpdHTMLVar('IPAdr':                  ' ');
pdf            UpdHTMLVar('User':                l_user);
pdf            UpdHTMLVar('PW':                     ' ');
pdf            UpdHTMLVar('Schema':        'ADB'+l_filg);
pdf            UpdHTMLVar('Companyno':    %char(l_firm));
6.33           UpdHTMLVar('Departmentnoarkiv': %char(l_avde));
pdf            WrtSection('Credential');
pdf
pdf        // Finn report command variabler
pdf            UpdHTMLVar('Jaspertemplate':      d_jasm);
pdf            UpdHTMLVar('Logo':           jasper_logo);
pdf            UpdHTMLVar('Keepspool':           w_spol);
pdf            WrtSection('ReportCommand');
pdf   /End-free
pdf   *
pdf   * Hvis skjermvisning skal ikke PDF skrives
pdf   *
pdf  c                   if        l_skje = 0 and
pdf  c                             l_mail = 0
6.21  * Hvis *ARKIV er valgt som skriver, skal det ikke skrives ut
6.21 c                   if        l_utqm <> '*ARKIV'
pdf   *
pdf  c                   if        l_land = 1
pdf  c                   eval      w_land = 'LANDSCAPE'
pdf  c                   else
pdf  c                   eval      w_land = 'PORTRAIT'
pdf  c                   endif
6.15  * Sjekk at valgt outq støttes av skriveren. Kan skli gjennom hvis
6.15  * jobben legges på jobbkø.
6.15 c                   eval      p_ok = '0'
6.15 c                   call      'AP612R'
6.15 c                   parm                    l_filg
6.15 c                   parm                    l_outq
6.15 c                   parm                    p_ok
6.15  * Hvis feil utkø, logges dette i transaksjonsloggen
6.15 c                   if        p_ok = '0'
6.15 c                   eval      w_jstat = 20
6.15 c                   eval      w_jtext = 'Ugyldig utkø '+ l_outq + ' er val+
6.15 c                             gt. Ingen utskrift er generert. Utskrift kan+
6.15 c                              arkiveres.'
6.15 c                   call      'AB705R'
6.15 c                   parm                    l_bach
6.15 c                   parm                    w_jstat
6.15 c                   parm                    w_jtext
6.15 c                   else
pdf   * Hent inn skuffinformasjon for skriveren
6.29 c                   eval      w_dtray = *blank
6.29 c                   eval      w_gtray = *blank
pdf  c                   call      'AP611R'
pdf  c                   parm                    l_filg
pdf  c                   parm                    l_outq
6.29 c                   parm                    w_dtray
6.29 c                   parm                    w_gtray
6.29  * Hent inn skuffinformasjon for skriveren - default inskuff
6.29 c                   eval      w_draw1 = *blank
6.29 c                   movel     w_dtray       w_skuf
6.29 c                   call      'AP614R'
6.29 c                   parm                    l_outq
6.29 c                   parm                    w_skuf
6.29 c                   parm                    w_draw1
6.17  *
6.17 c                   if        l_copy > 0
6.17 c                   eval      w_copy = l_copy
6.17 c                   else
6.17 c                   eval      w_copy = 1
6.17 c                   endif
pdf   *
pdf   /Free
pdf        // Finn print informasjon
pdf            UpdHTMLVar('Printername':         l_outq);
617            UpdHTMLVar('Copies':       %char(w_copy));
pdf            UpdHTMLVar('Papersource':        w_draw1);
pdf            UpdHTMLVar('Lastpagedrawer':         ' ');
pdf            UpdHTMLVar('Duplex':             'false');
pdf            UpdHTMLVar('Quality':                ' ');
pdf            UpdHTMLVar('Sorting':                ' ');
pdf            UpdHTMLVar('Staple':              'true');
pdf            UPDHTMLVar('Alignment':           w_land);
pdf            WrtSection('PrintCommand');
pdf   /End-free
6.15 c                   endif
6.21 c                   endif
pdf  c                   endif
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Heading                 *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_head      begsr
pdf   *
pdf  c                   eval      w_str_in = *blanks
pdf  c                   eval      w_str_out = *blanks
pdf  c                   eval      w_mtxt = *blanks
pdf  c                   eval      x_numm = %char(a1numm)+a1suff
pdf  c                   eval      x_betb = a1btx1 + ' ' + a1btx2
6.23 c                   eval      w_selgn = %trim(%char(a1selg) + x_mobi)
pdf   *
pdf   * Hvis mail skal skrives, må vi hente mail informasjon
pdf   *
pdf  c                   if        l_mail = 1
pdf  c                   eval      p_kule = 'K'
6.38 c                   if        folkun <> 0
6.38 c                   eval      p_kund = folkun
6.38 c                   else
pdf  c                   eval      p_kund = fokund
6.38 c                   endif
pdf  c                   eval      p_kpro = fokpro
pdf  c                   eval      p_numm = fonumm
pdf  c                   eval      p_selg = foselg
pdf  c                   eval      p_in03 = *off
pdf   * Henter ut mailserver
pdf  c                   eval      p_serv = *blank
pdf  c                   eval      p_stat = *blank
pdf  c                   call      'AM705C'
pdf  c                   parm                    p_serv
pdf  c                   parm                    p_stat
pdf   *
pdf  c                   call      'FO798R'
pdf  c                   parm                    p_kule
pdf  c                   parm                    p_kund
pdf  c                   parm                    p_kpro
pdf  c                   parm                    p_numm
6.30 c                   parm                    p_suff
pdf  c                   parm                    p_selg
pdf  c                   parm                    p_navn
pdf  c                   parm                    p_emal
6.30 c                   parm                    p_ema2
6.30 c                   parm                    p_ema3
pdf  c                   parm                    p_emne
pdf  c                   parm                    p_txt1
pdf  c                   parm                    p_txt2
pdf  c                   parm                    p_txt3
pdf  c                   parm                    p_txt4
pdf  c                   parm                    p_pers
6.30 c                   parm                    p_kopi
pdf  c                   parm                    p_inif
pdf  c                   parm                    p_in03
6.2F  * Scann av strenger
6.2F  *
6.2F c                   eval      p_str_in = *blank
6.2F c                   eval      p_lr = '0'
6.2F c                   movel     p_emne        p_str_in
6.2F c                   call      'AP613R'
6.2F c                   parm                    p_str_in
6.2F c                   parm                    p_str_out
6.2F c                   parm                    p_lr
6.2F c                   movel     p_str_out     w_pemne
6.18  * Scann av strenger
6.18  *
6.18 c                   eval      p_str_in = *blank
6.18 c                   eval      p_lr = '0'
6.18 c                   movel     p_txt1        p_str_in
6.18 c                   call      'AP613R'
6.18 c                   parm                    p_str_in
6.18 c                   parm                    p_str_out
6.18 c                   parm                    p_lr
6.18 c                   movel     p_str_out     w_ptxt1
6.18  *
6.18 c                   eval      p_str_in = *blank
6.18 c                   eval      p_lr = '0'
6.18 c                   movel     p_txt2        p_str_in
6.18 c                   call      'AP613R'
6.18 c                   parm                    p_str_in
6.18 c                   parm                    p_str_out
6.18 c                   parm                    p_lr
6.18 c                   movel     p_str_out     w_ptxt2
6.18  *
6.18 c                   eval      p_str_in = *blank
6.18 c                   eval      p_lr = '0'
6.18 c                   movel     p_txt3        p_str_in
6.18 c                   call      'AP613R'
6.18 c                   parm                    p_str_in
6.18 c                   parm                    p_str_out
6.18 c                   parm                    p_lr
6.18 c                   movel     p_str_out     w_ptxt3
6.18  *
6.18 c                   eval      p_str_in = *blank
6.18 c                   eval      p_lr = '0'
6.18 c                   movel     p_txt4        p_str_in
6.18 c                   call      'AP613R'
6.18 c                   parm                    p_str_in
6.18 c                   parm                    p_str_out
6.18 c                   parm                    p_lr
6.18 c                   movel     p_str_out     w_ptxt4
6.18  *
6.18 c                   eval      p_str_in = *blank
6.18 c                   eval      p_lr = '0'
6.18 c                   movel     p_pers        p_str_in
6.18 c                   call      'AP613R'
6.18 c                   parm                    p_str_in
6.18 c                   parm                    p_str_out
6.18 c                   parm                    p_lr
6.18 c                   movel     p_str_out     w_ppers
6.18  *
6.18 c                   eval      w_mtxt = %trim(w_ptxt1) + crlf +
6.18 c                                      %trim(w_ptxt2) + crlf +
6.18 c                                      %trim(w_ptxt3) + crlf +
6.18 c                                      %trim(w_ptxt4) + crlf +
6.18 c                                      %trim(w_ppers)
6.18 c**
6.18 c**                 eval      w_mtxt = %trim(p_txt1) + crlf +
6.18 c**                                    %trim(p_txt2) + crlf +
6.18 c**                                    %trim(p_txt3) + crlf +
6.18 c**                                    %trim(p_txt4) + crlf +
6.18 c**                                    %trim(p_pers)
pdf   *
6.30 c                   if        p_kopi = *blanks
6.30 c                   eval      p_kopi = d_emal
pdf  c                   endif
pdf   *
pdf  c                   if        p_in03 = *off
pdf   *
pdf   /Free
pdf        // Skriv mailinformasjon
6.30           WrtSection('MailCommandStart');
6.30      //   UpdHTMLVar('Receivers':           p_emal);
6.30           if %Trim(p_emal)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_emal);
6.30           WrtSection('MailReceiver');
6.30           endif;
6.30           if %Trim(p_ema2)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_ema2);
6.30           WrtSection('MailReceiver');
6.30           endif;
6.30           if %Trim(p_ema3)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_ema3);
6.30           WrtSection('MailReceiver');
6.30           endif;
pdf            UpdHTMLVar('CC':                     ' ');
6.30           UpdHTMLVar('BCC':                 p_kopi);
6.30           UpdHTMLVar('Sender':              p_kopi);
6.2F      //   UpdHTMLVar('Subject':             p_emne);
6.2F           UpdHTMLVar('Subject':            w_pemne);
pdf            UpdHTMLVar('Message':             w_mtxt);
pdf            UpdHTMLVar('SMTPServer':          p_serv);
pdf            UPDHTMLVar('SMTPUser':               ' ');
pdf            UPDHTMLVar('SMTPPw':                 ' ');
6.30       //  WrtSection('MailCommand');
6.30           WrtSection('MailCommandEnd');
pdf   /End-free
pdf  c                   endif
pdf  c                   endif
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Firma
6.14 c                   eval      w_1fnav = *blank
6.14 c                   eval      w_1fad1 = *blank
6.14 c                   eval      w_1fad2 = *blank
6.14 c                   eval      w_1navn = *blank
6.14 c                   eval      w_1gate = *blank
6.14 c                   eval      w_1adr2 = *blank
6.14 c                   eval      w_2navn = *blank
6.14 c                   eval      w_2adr1 = *blank
6.14 c                   eval      w_2adr2 = *blank
      *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     a1fnav        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_1fnav
      *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     a1fad1        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.17 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_1fad1
      *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     a1fad2        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_1fad2
pdf   *
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Partner
pdf   *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     a1navn        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_1navn
      *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     a1gate        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_1gate
      *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     a1adr2        P_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_1adr2
      *
6.20 c                   eval      p_str_in = *blank
6.20 c                   eval      p_lr = '0'
6.20 c                   movel     a1dref        P_str_in
6.20 c                   call      'AP613R'
6.20 c                   parm                    p_str_in
6.20 c                   parm                    p_str_out
6.20 c                   parm                    p_lr
6.20 c                   movel     p_str_out     w_1dref
      *
6.20 c                   eval      p_str_in = *blank
6.20 c                   eval      p_lr = '0'
6.20 c                   movel     a1vref        P_str_in
6.20 c                   call      'AP613R'
6.20 c                   parm                    p_str_in
6.20 c                   parm                    p_str_out
6.20 c                   parm                    p_lr
6.20 c                   movel     p_str_out     w_1vref
      * Avdelingsinformasjon - navn
6.28 c                   eval      p_str_in = *blank
6.28 c                   eval      p_lr = '0'
6.28 c                   movel     w_dnavn       P_str_in
6.28 c                   call      'AP613R'
6.28 c                   parm                    p_str_in
6.28 c                   parm                    p_str_out
6.28 c                   parm                    p_lr
6.28 c                   movel     p_str_out     w_dnavn
      * Avdelingsinformasjon - adresse
6.28 c                   eval      p_str_in = *blank
6.28 c                   eval      p_lr = '0'
6.28 c                   movel     w_dadr1       P_str_in
6.28 c                   call      'AP613R'
6.28 c                   parm                    p_str_in
6.28 c                   parm                    p_str_out
6.28 c                   parm                    p_lr
6.28 c                   movel     p_str_out     w_dadr1
      * Avdelingsinformasjon - adresse 2
6.28 c                   eval      p_str_in = *blank
6.28 c                   eval      p_lr = '0'
6.28 c                   movel     w_dadr2       P_str_in
6.28 c                   call      'AP613R'
6.28 c                   parm                    p_str_in
6.28 c                   parm                    p_str_out
6.28 c                   parm                    p_lr
6.28 c                   movel     p_str_out     w_dadr2
      * Avdelingsinformasjon - poststed
6.28 c                   eval      p_str_in = *blank
6.28 c                   eval      p_lr = '0'
6.28 c                   movel     w_dpstd       P_str_in
6.28 c                   call      'AP613R'
6.28 c                   parm                    p_str_in
6.28 c                   parm                    p_str_out
6.28 c                   parm                    p_lr
6.28 c                   movel     p_str_out     w_dpstd
      * Rekvisisjonsnummer
6.2A c                   eval      p_str_in = *blank
6.2A c                   eval      p_lr = '0'
6.2A c                   movel     forekv        P_str_in
6.2A c                   call      'AP613R'
6.2A c                   parm                    p_str_in
6.2A c                   parm                    p_str_out
6.2A c                   parm                    p_lr
6.2A c                   movel     p_str_out     w_rekv
8.02  *
8.02 c                   eval      w_price = 'true'
pdf   /Free
pdf
8.02       // Freedef tagg
8.02           UpdHTMLVar('PrintPriceOnDocument': w_price);
8.02           UpdHTMLVar('PrintDiscountOnDocument': w_price);
pdf        // Skriv firmavariabler
6.22           UpdHTMLVar('Reporttext':            a1txt1);
6.14           UpdHTMLVar('CompanyName':          w_1fnav);
6.14           UpdHTMLVar('Companyadress1':       w_1fad1);
6.14           UpdHTMLVar('Companyadress2':       w_1fad2);
pdf            UpdHTMLVar('Companypostalcode':        ' ');
pdf            UpdHTMLVar('Companypostoffice':     a1fste);
pdf            UpdHTMLVar('Companyphone':          a1ftlf);
pdf            UpdHTMLVar('Companyfax':            a1ffax);
6.27           UpdHTMLVar('Companyorgno':          a1fftx);
617            UpdHTMLVar('Companygiro':    %char(aafbgi));
6.31           UpdHTMLVar('Companyemail':   %trim(w_mail));
6.31           UpdHTMLVar('Companywebpage': %trim(w_weba));
6.28           WrtSection('Company');
6.28
6.28           UpdHTMLVar('Departmentno':    %char(foavde));
6.28           UpdHTMLVar('Departmentname':        w_dnavn);
6.28           UpdHTMLVar('Departmentadress1':     w_dadr1);
6.28           UpdHTMLVar('Departmentadress2':     w_dadr2);
6.28           UpdHTMLVar('Departmentpostalcode':      ' ');
6.28           UpdHTMLVar('Departmentpostoffice':  w_dpstd);
6.28           UpdHTMLVar('Departmentphone':       w_dphon);
6.28           UpdHTMLVar('Departmentfax':         w_dfaxn);
6.28           WrtSection('Department');
pdf
pdf            test(de) *dmy a1bdat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(a1bdat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Creationdate':   %char(tmpdate : *iso));
pdf            test(te) *hms a1time;
pdf            if %error;
pdf            tmptime = *loval;
pdf            else;
pdf            tmptime = %time(a1time : *hms);
pdf            endif;
pdf            UpdHTMLVar('Creationtime': %char(tmptime : *hms));
6.28           WrtSection('Creation');
pdf
pdf        // Skriv partnerinfo (kunde)
pdf            UpdHTMLVar('Partnerno':      %char(a1kund));
pdf            UpdHTMLVar('Partnercategory':%char(a1katg));
6.14           UpdHTMLVar('Partnername':          w_1navn);
6.14           UpdHTMLVar('Partneradress1':       w_1gate);
6.14           UpdHTMLVar('Partneradress2':       w_1adr2);
pdf            UpdHTMLVar('Partnerpostalcode':        ' ');
pdf            UpdHTMLVar('Partnerpostoffice':     a1sted);
pdf            UpdHTMLVar('Partnerphone':          a1tlfn);
pdf            UpdHTMLVar('Partnercellphone':      a1mobn);
pdf            UpdHTMLVar('Partnerfax':            rktlfx);
pdf            UpdHTMLVar('Salesdocumentno':       x_numm);
6.20           UpdHTMLVar('Partnerrefname':       w_1dref);
pdf            UpdHTMLVar('Partnerrefphone':       fomobi);
pdf            UpdHTMLVar('Partnerrefmail':           ' ');
6.2A     //    UpdHTMLVar('Requisitionno':         forekv);
6.2A           UpdHTMLVar('Requisitionno':         w_rekv);
pdf            WrtSection('Partner');
pdf
pdf        // Selger informasjon
6.23           UpdHTMLVar('Salesrefno':           w_selgn);
6.20           UpdHTMLVar('Salesrefname':         w_1vref);
6.28           UpdHTMLVar('Salesrefemail':         raiema);
6.28           UpdHTMLVar('Salesrefcellphone':     raimob);
pdf            WrtSection('SalesRef');
pdf   /End-free
pdf   *
6.2H c                   eval      p_str_in = *blank
6.2H c                   eval      p_lr = '0'
6.2H c                   movel     a1lmtx        p_str_in
6.2H c                   call      'AP613R'
6.2H c                   parm                    p_str_in
6.2H c                   parm                    p_str_out
6.2H c                   parm                    p_lr
6.2H c                   movel     p_str_out     w_lmtx
      *
6.2H c                   eval      p_str_in = *blank
6.2H c                   eval      p_lr = '0'
6.2H c                   movel     folbtx        p_str_in
6.2H c                   call      'AP613R'
6.2H c                   parm                    p_str_in
6.2H c                   parm                    p_str_out
6.2H c                   parm                    p_lr
6.2H c                   movel     p_str_out     w_lbtx
pdf  c                   if        %trim(a2navn) <> *blank
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Prosjekt
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     a2navn        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_2navn
      *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     a2adr1        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_2adr1
      *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     a2adr2        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_2adr2
      *
6.28 c                   eval      p_str_in = *blank
6.28 c                   eval      p_lr = '0'
6.28 c                   movel     a1lmtx        p_str_in
6.28 c                   call      'AP613R'
6.28 c                   parm                    p_str_in
6.28 c                   parm                    p_str_out
6.28 c                   parm                    p_lr
6.28 c                   movel     p_str_out     w_lmtx
      *
6.28 c                   eval      p_str_in = *blank
6.28 c                   eval      p_lr = '0'
6.28 c                   movel     folbtx        p_str_in
6.28 c                   call      'AP613R'
6.28 c                   parm                    p_str_in
6.28 c                   parm                    p_str_out
6.28 c                   parm                    p_lr
6.28 c                   movel     p_str_out     w_lbtx
pdf   *
pdf   /Free
pdf        // Prosjekt informasjon
6.2E       //  UpdHTMLVar('Projectno':                '0');
6.2E           UpdHTMLVar('Projectno':      %char(a1kpro));
6.14       //  UpdHTMLVar('Projectname':           a2navn);
6.14           UpdHTMLVar('Projectname':          w_2navn);
6.14       //  UpdHTMLVar('Projectadress1':        a2adr1);
6.14           UpdHTMLVar('Projectadress1':       w_2adr1);
6.14       //  UpdHTMLVar('Projectadress2':        a2adr2);
6.14           UpdHTMLVar('Projectadress2':       w_2adr2);
pdf            UpdHTMLVar('Projectpostalcode':        ' ');
pdf            UpdHTMLVar('Projectpostoffice':     a2sted);
pdf            WrtSection('Project');
pdf   /End-free
pdf  c                   endif
pdf   /Free
6.28           UpdHTMLVar('Currency':              fovalk);
6.28           UpdHTMLVar('Discountcat':    %char(forkat));
6.28           UpdHTMLVar('Agent':          %char(fosped));
6.28           WrtSection('InfoHead1');

6.28           UpdHTMLVar('Deliverymethod':              w_lmtx);
pdf            test(de) *dmy a1ldat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(a1ldat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Deliverydate': %char(tmpdate : *iso));
6.28           UpdHTMLVar('Deliverytype':         %char(folety));
6.28           UpdHTMLVar('Deliveryterms':               w_lbtx);
6.28           UpdHTMLVar('Drivingroute':         %char(fokjor));
6.28           WrtSection('DeliveryInfo');
pdf
6.28           UpdHTMLVar('District':             %char(fodist));
6.28           UpdHTMLVar('Warehouse':            %char(folage));
6.28           UpdHTMLVar('Documenttype':                footyp);
pdf            UpdHTMLVar('Paymentcondition':            x_betb);
6.28           UpdHTMLVar('Orderreference':                 ' ');
6.28           WrtSection('InfoHead2');
pdf
pdf        //  Legg ut 'heading' på linje
pdf            WrtSection('OrderLines');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Detaljer                *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_deta      begsr
pdf   * Sørg for at vi har skrevet siste tag for topptext før vi begynner
pdf   * med detaljer.
pdf  c                   if        b_topt = *on
pdf  c                   exsr      xml_topt_end
pdf  c                   eval      b_topt = *off
pdf  c                   endif
pdf   *
6.2G c                   eval      w_lvar = *blank
pdf   *
pdf  c                   if        valktx <> 1
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Varetekster
6.14 c                   eval      w_tek1 = *blank
6.14 c                   eval      w_tek2 = *blank
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     d1tek1        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_tek1
pdf   *
pdf  c                   if        fdtek2 <> *blank
6.16 c                   movel     fdtek2        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_tek2
pdf  c                   endif
      * Lev.varenummer
6.2G c                   eval      p_str_in = *blank
6.2G c                   eval      p_lr = '0'
6.2G c                   movel     fdlvar        P_str_in
6.2G c                   call      'AP613R'
6.2G c                   parm                    p_str_in
6.2G c                   parm                    p_str_out
6.2G c                   parm                    p_lr
6.2G c                   movel     p_str_out     w_lvar
      *
6.34 c                   eval      w_kamp = *blank
6.34 c                   if        fdkamp <> *blank
6.34 c                   eval      p_str_in = *blank
6.34 c                   eval      p_lr = '0'
6.34 c                   movel     fdkamp        p_str_in
6.34 c                   call      'AP613R'
6.34 c                   parm                    p_str_in
6.34 c                   parm                    p_str_out
6.34 c                   parm                    p_lr
6.34 c                   movel     p_str_out     w_kamp
6.34 c                   endif
pdf   *
pdf  c                   eval      w_mark = 'false'
pdf  c                   if        d1info = '*'
pdf  c                   eval      w_mark = 'true '
pdf  c                   endif
6.2B  * Hvis nettopriset kunde, skal ikke rabatten vises
6.2B c                   if        *in39 = *on
6.2B c                   eval      d1rabp = 0
6.2B c                   endif
pdf   * Håndtere riktig antall desimaler
pdf  c                   if        *in40 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant0))
pdf  c                   callp     updHTMLVar('NoDecimals':        '0')
pdf  c                   elseif    *in41 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant1))
pdf  c                   callp     updHTMLVar('NoDecimals':        '1')
pdf  c                   elseif    *in42 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant2))
pdf  c                   callp     updHTMLVar('NoDecimals':        '2')
pdf  c                   elseif    *in43 = *on
pdf  c                   callp     updHTMLVar('Quantity':%char(d1ant3))
pdf  c                   callp     updHTMLVar('NoDecimals':        '3')
pdf  c                   endif
6.28  *
6.36 c                   eval      w_lddt = 0
6.28 c                   if        fdldat <> *loval
6.28 c     *dmy          move      fdldat        w_lddt
6.28 c                   endif
pdf   *
pdf   /Free
pdf        // Skriv detaljer
pdf            UpdHTMLVar('Itemno':             d1vare);
6.14           UpdHTMLVar('Text1':              w_tek1);
6.14           UpdHTMLVar('Text2':              w_tek2);
pdf            UpdHTMLVar('Unit':                d1enh1);
pdf            UpdHTMLVar('Vat':          %char(d1mvap));
pdf            UpdHTMLVar('Netprice':     %char(d1bpri));
pdf            UpdHTMLVar('Discount':     %char(d1rabp));
617            UpdHTMLVar('Discountremark':    d1tine);
pdf            UpdHTMLVar('Totalsum':     %char(d1nbel));
pdf            UpdHTMLVar('Linetype':    %char(d1lety));
pdf            UpdHTMLVar('Bookingno':   %char(d1benr));
pdf            UpdHTMLVar('DiscountAccounting': %trim(w_mark));
6.28           UpdHTMLVar('Currency':           fovalk);
6.28           UpdHTMLVar('Nobbno':      %char(fdnobb));
6.28           UpdHTMLVar('Lineno':      %char(fdline));
6.28           UpdHTMLVar('Warehouse':   %char(fdlage));
6.28           test(de) *dmy w_lddt;
6.28
6.28           if %error;
6.28           tmpdate = *loval;
6.28           else;
6.28           tmpdate = %date(w_lddt : *dmy);
6.28           endif;
6.28
6.28           UpdHTMLVar('Deliverydate': %char(tmpdate : *iso));
6.2G     //    UpdHTMLVar('Partneritemno':       fdlvar);
6.2G           UpdHTMLVar('Partneritemno':%trim(w_lvar));
6.34     //    UpdHTMLVar('Campaign':            fdkamp);
6.34           UpdHTMLVar('Campaign':     %trim(w_kamp));
6.28           UpdHTMLVar('Gtin':           %char(fdeann));
pdf            WrtSection('Line');
pdf
pdf   /End-free
pdf   *
pdf  c                   else
6.14 c                   eval      w_tek1 = *blank
6.14 c                   eval      w_tek2 = *blank
pdf  c                   movel     fdtek1        d1tek1
pdf  c                   movel     fdtek2        d1tek2
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Tekstlinjer
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     d1tek1        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_tek1
pdf   *
6.16 c                   movel     d1tek2        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_tek2
6.19 c**6.25             eval      w_tek0 = %trim(w_tek1) + ' ' + %trim(w_tek2)
6.25 c                   if        %subst(d1tek1:35:1) = ' ' or
6.25 c                             %subst(d1tek2:1:1) = ' '
6.25 c                   eval      w_tek0 = %trim(w_tek1) + ' ' + %trim(w_tek2)
6.25 c                   else
6.25 c                   eval      w_tek0 = %trim(w_tek1) + %trimr(w_tek2)
6.25 c                   endif
pdf   *
pdf   /Free
6.14      //   UpdHTMLVar('Text1':              d1tek1);
6.19           UpdHTMLVar('Text1':       %trim(w_tek0));
6.19           UpdHTMLVar('Text2':                 ' ');
pdf            WrtSection('TextLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endif
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Spesifikasjoner         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_spec      begsr
pdf   *
pdf   /Free
pdf        // Skriv spesifikasjoner
pdf            UpdHTMLVar('Text1':       f1text);
pdf            UpdHTMLVar('Text2':          ' ');
pdf            WrtSection('TextLine');
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Rabatt                  *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_rabatt    begsr
pdf   *
pdf   /Free
pdf        // Skriv rabattlinjer
pdf            UpdHTMLVar('Discountinpercent':   %char(r1rabp));
pdf            UpdHTMLVar('Discountbasis':       %char(r1rabg));
pdf            UpdHTMLVar('Sumdiscount':         %char(r1rabb));
pdf            WrtSection('DiscountLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Netto                   *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_netto     begsr
6.24  * Sørg for at vi har skrevet siste tag for topptext før vi begynner
6.24  * med detaljer. (Ved tomme dokumenter m/kun topptekst)
6.24 c                   if        b_topt = *on
6.24 c                   exsr      xml_topt_end
6.24 c                   eval      b_topt = *off
6.24 c                   endif
pdf   * Sørg for at vi har skrevet siste tag for bunntext før vi
pdf   * avslutter.
pdf  c                   if        b_bott = *on
pdf  c                   exsr      xml_bott_end
pdf  c                   eval      b_bott = *off
pdf  c                   endif
pdf   *
pdf   /Free
pdf        // Skriv nettolinje
pdf            UpdHTMLVar('Sumnettoexcvat':       %char(t1tnet));
pdf            WrtSection('NettoLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Vat linjer              *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_vat       begsr
pdf   *
pdf   /Free
pdf
pdf        // Skriv vatlinje
pdf            UpdHTMLVar('Vatpercent':           %char(t1mvas));
pdf            UpdHTMLVar('Vatbasis':             %char(t1mvag));
pdf            UpdHTMLVar('Sumvat':               %char(t1tmva));
pdf            WrtSection('VatLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Totaler                 *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_totaler   begsr
pdf   *
pdf   /Free
pdf        //  UpdHTMLVar('Totrabkat':       %char(t1rkat));
pdf        // Skriv totallinje
pdf            UpdHTMLVar('Sumtotal':             %char(t1totb));
6.28           UpdHTMLVar('Rounding':                      '0');
pdf            WrtSection('TotalLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Topptekst start         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_topt_str  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('TopTextStart');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Topptekst               *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_topptxt   begsr
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Topptekst
6.26 c                   eval      w_f11t = *blanks
6.16 c                   movel     e1text        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.26 c**                 movel     p_str_out     e1text
6.26 c                   movel     p_str_out     w_f11t
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
6.26      //   UpdHTMLVar('Toptext':     e1text);
6.26           UpdHTMLVar('Toptext':     w_f11t);
pdf            WrtSection('TopTextLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Topptekst slutt         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_topt_end  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('TopTextEnd');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Bunntekst start         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_bott_str  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('BottomTextStart');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Bunntekst               *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_bunntxt   begsr
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Topptekst
6.26 c                   eval      w_f11t = *blanks
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '0'
6.16 c                   movel     e1text        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.26 c**                 movel     p_str_out     e1text
6.26 c                   movel     p_str_out     w_f11t
pdf   *
pdf   /Free
pdf        // Skriv bunntekst
6.26       //  UpdHTMLVar('Bottomtext':  e1text);
6.26           UpdHTMLVar('Bottomtext':  w_f11t);
pdf            WrtSection('BottomTextLine');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Bunntekst slutt         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_bott_end  begsr
pdf   *
pdf   /Free
pdf        // Skriv tekstlinjer
pdf            WrtSection('BottomTextEnd');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Slutt                   *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_end       begsr
pdf   * Sørg for at vi har skrevet siste tag for bunntext før vi begynner
pdf   * avslutter.
pdf  c                   if        b_bott = *on
pdf  c                   exsr      xml_bott_end
pdf  c                   eval      b_bott = *off
pdf  c                   endif
pdf   * Skriv xmlfila til disk
pdf   /Free
pdf            WrtSection('EndOrderLines');
pdf   /End-free
pdf   *
pdf   * Hvis denne ikke skal arkiveres, lages ikke archive tagg.
pdf   *
pdf  c                   if        l_arch = 1
6.13  * Lag tag for visning i arkivklienten
6.13 c                   eval      w_dspl = *blank
Q.01 c                   eval      w_dspl = 'Prisbekreftelse: '+%char(a1numm)+
6.13 c                             ' Kunde: ' +  %trim(%char(fokund) + ' - ' +
6.13 c                             %trim(a1navn) + '  Beløp ' + %char(t1totb))
p.14  *
6.16 c                   eval      p_str_in = *blank
6.16 c                   eval      p_lr = '1'
6.16 c                   movel     w_dspl        p_str_in
6.16 c                   call      'AP613R'
6.16 c                   parm                    p_str_in
6.16 c                   parm                    p_str_out
6.16 c                   parm                    p_lr
6.16 c                   movel     p_str_out     w_dspl
6.2C  * Referansetagg
6.2C c                   eval      w_refn = *blank
6.2D c                   eval      w_refn = %char(%subdt(w_date:*years)) +
8.03 c*                            %char(a1numm)
8.03 c                             %char(a1numm) + '-' + %char(fosuff)
pdf   /Free
pdf        // Skriv metattags
6.13
6.2C           UpdHTMLVar('Refno':          %trim(w_refn));
6.13           UpdHTMLVar('Displaytag':     %trim(w_dspl));
pdf            WrtSection('ArchiveCommandStart');
6.13
pdf            UpdHTMLVar('Metavalue':      %char(a1numm));
pdf            UpdHTMLVar('Metakey':        'ORDRENUMMER');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':             l_user);
pdf            UpdHTMLVar('Metakey':             'BRUKER');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue': %char(w_date:*iso));
pdf            UpdHTMLVar('Metakey':               'DATO');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':      %char(a1kund));
pdf            UpdHTMLVar('Metakey':         'KUNDENUMMER');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':            w_1navn);
pdf            UpdHTMLVar('Metakey':          'KUNDENAVN');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':      %char(t1totb));
pdf            UpdHTMLVar('Metakey':              'BELOP');
pdf            WrtSection('MetaTag');
6.22
6.22           UpdHTMLVar('Metavalue':             a1txt1);
6.22           UpdHTMLVar('Metakey':         'RUTINETEKST');
6.22           WrtSection('MetaTag');
6.2C
6.2C           UpdHTMLVar('Metavalue':             l_ruti);
6.2C           UpdHTMLVar('Metakey':             'RUTINE');
6.2C           WrtSection('MetaTag');
6.2C
6.2C           UpdHTMLVar('Metavalue':      %char(l_firm));
6.2C           UpdHTMLVar('Metakey':              'FIRMA');
6.2C           WrtSection('MetaTag');
6.2C
6.2C           UpdHTMLVar('Metavalue':             l_wsid);
6.2C           UpdHTMLVar('Metakey':             'SKJERM');
6.2C           WrtSection('MetaTag');
pdf
pdf            WrtSection('ArchiveCommandEnd');
pdf   /End-free
8.03  *
8.03  * Skriv inn i tabell for bruk til søk i arkiv.
8.03  *
8.03         exec sql
8.03         insert into xlkost
8.03           (xofirm,xoyear,xodocn,xosuff,xobatc,
8.03            xobatt,xorefn,xostmp)
8.03         values(:w_firm,:w_year,:a1numm,:wwsuff,:w_jkey,
8.03                'PRISBEKREFTELSE',:w_refn,:w_stmp);
8.03         commit;
pdf   *
pdf  c                   endif
pdf   *
pdf   /Free
pdf            WrtSection('Footer');
pdf   /End-free
pdf   * Skriv xml fila til disk
pdf  c                   eval      XML_Output = XML_path + l_filg +'/'+
Q.01 c                             'Pris_'+ %trim(w_jkey) + '.xml'
pdf   *
pdf  c                   callp     WrtHtmlToStmf(XML_Output: 819)
6.32  * Skriver til datakø for å aktivere sniffer, hvis dataq er aktiv
6.32 c                   if        d_dtaq = '1'
6.32 c                   eval      p_xmlf = xml_output
6.32 c                   eval      p_filg = 'ADB'+l_filg
6.32 c                   call      'AP629C'
6.32 c                   parm                    p_filg
6.32 c                   parm                    p_xmlf
6.32 c                   endif
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Skjermvisning           *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     pdf_preview   begsr
pdf   *
pdf   * Vi kaller program for launch av PDF i browser
pdf  c                   call      'AP621R'
pdf  c                   parm                    w_jkey
pdf   *
pdf  c                   endsr
6.28  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.28  * Subrutiner for XML/jasper integrasjon - Detaljer                *
6.28  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.28 c     hnt_avde      begsr
6.28  * Hent inn avdelingsinformasjon
6.28 c
6.28 c                   eval      w_ddeno = foavde
6.28 c                   eval      w_dnavn = *blank
6.28 c                   eval      w_dadr1 = *blank
6.28 c                   eval      w_dadr2 = *blank
6.28 c                   eval      w_dpcde = *zeros
6.28 c                   eval      w_dpstd = *blank
6.28 c                   eval      w_dphon = *blank
6.28 c                   eval      w_dfaxn = *blank
6.28  *
6.28 c                   eval      ra07pf_avde = foavde
6.28 c     ra07pf_key    chain     ra07pfr                            90
6.28 c                   if        *in90  = *off
6.28 c                   eval      w_dnavn = ragtxt
6.28 c                   eval      w_dadr1 = ragadr
6.28 c                   eval      w_dadr2 = ragad2
6.28 c                   eval      w_dpcde = ragpnr
6.28 c                   eval      w_dpstd = (%char(ragpnr) + ' ' + ragste)
6.28 c                   if        ragtlf <> *blank
6.28 c                   eval      w_dphon = ragtlf
6.28 c                   endif
6.28 c                   if        ragfax <> *blank
6.28 c                   eval      w_dfaxn = ragfax
6.28 c                   endif
6.28 c                   endif
6.28  *
6.28 c                   endsr
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     C     *INZSR        BEGSR
5.01  *
5.01  * Parametre
5.01  *
5.01 c     *entry        plist
5.01 c                   parm                    p_mail
5.01 c                   parm                    p_kund
5.61 c                   parm                    p_kpro
5.02 c                   parm                    p_numm
5.02 c                   parm                    p_selg
      *
     C     *LIKE         DEFINE    A1BTX1        WPCTX1
     C     *LIKE         DEFINE    A1BTX2        WPCTX2
     C     *LIKE         DEFINE    FAAKUN        W0KUND
     C     *LIKE         DEFINE    VAOTYP        WWOTYP
     C     *LIKE         DEFINE    FOKUND        WWKUND
     C     *LIKE         DEFINE    FOFIRM        WWFIRM
     C     *LIKE         DEFINE    FOWSID        WWWSID
     C     *LIKE         DEFINE    FONUMM        WWNUMM
     C     *LIKE         DEFINE    FOSUFF        WWSUFF
     C     *LIKE         DEFINE    FDLINE        WWLINE
     C     *LIKE         DEFINE    FDLTYP        WWLTYP
     C     *LIKE         DEFINE    VAPKOD        WWPKOD
     C     *LIKE         DEFINE    FDNUMM        SANUMM
     C     *LIKE         DEFINE    VVVARE        WWVARE
     C     *LIKE         DEFINE    FDANTA        W1ANTA
6.35 c**   *LIKE         DEFINE    FDsapr        W1RAB1
     C     *LIKE         DEFINE    FDsapr        W1NPRI
     C     *LIKE         DEFINE    FDsapr        D1RABB
3.11 C     *LIKE         DEFINE    FDsapr        W1SUMR
      *
     C     *LIKE         DEFINE    FDsapr        D1NPRI
      *
      *
     C     *LIKE         DEFINE    FDSUMS        D1BBEL
      *
      *  Nullstilling av felter som ikke kan redefineres
      *
     C                   MOVE      *BLANK        WPRETK            1
     C                   MOVE      *ZERO         WPMVAS            6 2
     C                   MOVE      *ZERO         WPMVAT            5 4
     C                   MOVE      *ZERO         WPMVAF           10 9
      *
     C                   MOVE      *BLANK        WWRUTI           10
     C                   MOVE      *ZERO         WLTELL            3 0
     C                   MOVE      *ZERO         WLTEST            3 0
      *
3.11 C                   MOVE      *ZERO         W1RABB           11 3
3.11 C                   MOVE      *ZERO         W1RABG           11 2
      *
6.23  * Key for posisjonering på selgere
6.23  *
6.23 c     ra09l1_key    klist
6.23 c                   kfld                    wwfirm
6.23 c                   kfld                    ra09l1_ikod
      *
      * Key for Heading-file
      *
      *
     C     KEY01         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWNUMM
     C                   KFLD                    WWSUFF
      *
      * Key for Detalj-file
      *
     C     KEY02         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWNUMM
     C                   KFLD                    WWSUFF
     C                   KFLD                    WWLINE
      *
      * Key for Tekst-linjer
      *
     C     KEY03         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWNUMM
     C                   KFLD                    WWSUFF
     C                   KFLD                    WWLINE
      *
      * Key for kunderegister
      *
     C     KEY04         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWKUND
      *
      * Key for firmaregister
      *
     C     KEY06         KLIST
     C                   KFLD                    WWFIRM
      *
      * Key for ordretyper
      *
     C     KEY07         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWOTYP
      *
      * Key for linjetyper
      *
     C     KEY08         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWLTYP
      *
      * Key for statusregister
      *
     C     KEY09         KLIST
     C                   KFLD                    WWFIRM
      *
      * Key for formular-register
      *
     C     KEY10         KLIST
     C                   KFLD                    WWRUTI
      *
      * Key for vare-register
      *
     C     KEY11         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWVARE
      *
      * Key for priskode-register
      *
     C     KEY19         KLIST
     C                   KFLD                    WWFIRM
     C                   KFLD                    WWPKOD
5.34  *
5.34  * Key for oppslag på lengdespesif.linje
5.34  *
5.34 c     fvlsl1_key    klist
5.34 c                   kfld                    wwfirm
5.34 c                   kfld                    fvlsl1_numm
5.34 c                   kfld                    fvlsl1_suff
5.34 c                   kfld                    fvlsl1_line
5.42  *
5.42  * Key for oppslag på kundeprosjekt
5.42  *
5.42 c     fkprl1_key    klist
5.42 c                   kfld                    wwfirm
5.42 c                   kfld                    fkprl1_kund
5.42 c                   kfld                    fkprl1_kpro
      *
6.17  * Key for firmaregister
6.17  *
6.17 c     afirl1_key    klist
6.17 c                   kfld                    wwfirm
6.28  *
6.28  * Key for oppslag på avdelings-register
6.28  *
6.28 c     ra07pf_key    klist
6.28 c                   kfld                    w_firm
6.28 c                   kfld                    ra07pf_avde
      * Hente inn rutinenavn
      * og meldingstekst
      *
     C                   MOVE      l_ruti        WWRUTI
      *
     C     KEY10         CHAIN     AFORL1R                            69
     C  N69              MOVE      AFTXT1        A1TXT1
     C  N69              MOVE      AFMLD1        T1MLD1
5.01  *
5.01  * Sjekker om dette skal sendes
5.01  * som e-mail
5.01  *
5.01 c                   if        l_outq = 'E_MAIL_ASP'
5.01 c                   eval      p_mail = 'J'
5.01 c                   endif
pdf   *
pdf   * Sjekk om vi skal bruke JASPER og XML generering av dokumenter
pdf  c                   if        l_poff = '1'
pdf  c                   eval      b_pdfp = *off
pdf  c                   eval      b_topt = *off
pdf  c                   eval      b_bott = *off
pdf  c                   eval      w_pdf = 0
pdf  c                   eval      w_pdf_ds = *blanks
pdf  c                   eval      w_ruti = l_ruti
pdf   *
pdf  c                   call      'AP609R'
pdf  c                   parm                    w_ruti
pdf  c                   parm                    w_pdf
pdf  c                   parm                    w_pdf_ds
pdf  c                   eval      d_pdf_ds = w_pdf_ds
pdf   * Vi skal kjøre med jasper
pdf  c                   if        w_pdf = 1 and
pdf  c                             %trim(d_xmlm) <> *blanks
pdf  c                   eval      p_mail = '0'
pdf  c                   eval      w_jkey = l_bach
pdf   *
pdf   * Hent inn xml templaten
pdf   *
pdf  c                   callp     GetHTMLIFS(d_xmlm :'<AS400>')
6.2I c                   callp     ClrHtmlBuffer
pdf   *
pdf   * Finn hvor xml'en skal legges
pdf   *
pdf  c                   eval      XML_path = *blanks
pdf  c                   eval      XML_path = %trim(d_path)
pdf   *
pdf   * Finn path til logo
pdf   *
pdf  c                   eval      jasper_logo = *blanks
pdf  c                   eval      jasper_logo = %trim(d_logo)
pdf   *
pdf   * Jobbnummer er allerede generert i AP600R. Overføres i *lda
pdf   *
pdf  c                   time                    w_date
8.03 c                   eval      w_year = %subdt(w_date:*years)
8.03 c                   time                    w_stmp
pdf   * Vi logger ar utskriftprogrammet har startet
pdf  c                   eval      w_jstat = 10
Q.01 c                   eval      w_jtext = 'Utskrift av prisbekreftelse har +
pdf  c                                       startet'
pdf  c                   call      'AB705R'
pdf  c                   parm                    l_bach
pdf  c                   parm                    w_jstat
pdf  c                   parm                    w_jtext
pdf   * Vi skriver xml for miljø formater
pdf  c                   exsr      xml_envm
pdf  c                   eval      b_pdfp = *on
pdf   *
pdf  c                   endif
pdf   * Hvis et eller annet er galt med parametrene, logges og kjør uten PROA
pdf  c                   if        %trim(d_xmlm) = *blanks
pdf  c                   eval      b_pdfp = *off
pdf   * Vi logger at noe er galt med parametrene
pdf  c                   eval      w_jstat = 20
pdf  c                   eval      w_jtext = 'Finner ikke path til xml !!! +
pdf  c                             Sjekk rutineregister !'
pdf  c                   call      'AB705R'
pdf  c                   parm                    l_bach
pdf  c                   parm                    w_jstat
pdf  c                   parm                    w_jtext
pdf  c                   endif
pdf  c                   else
pdf  c                   eval      b_pdfp = *off
pdf  c                   endif
      *
pdf  c                   if        l_bach = *blank
pdf  c                   eval      b_pdfp = *off
pdf  c                   endif
      *
     C                   ENDSR
      *
