      /TITLE  Vedlikehold statuskoder fellesprogram
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RA000R                                              *
      * Beskrivelse . . : Vedlikehold statuskoder fellesprogram               *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *           061003  Lagt inn vedlokehold av E-handelsinformasjon   KOB  *
7.xx  * 7.00  010316 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       10 = Roll                                                 *
      *       12 = Sfldsp                                               *
      *       13 = Sfldspctl                                            *
      *       14 = Sflclr                                               *
      *       15 = Sflend                                               *
      *       16 = Readc 16 on, no more records                         *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
     fra000d    cf   e             workstn
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d wpakod          s              2  0
     d wpk01a          s              1
     d wpk02a          s              2
     d wpk02n          s              2  0
     d wpk03a          s              3
     d wpk03n          s              3  0
     d wpk04n          s              4  0
     d w_firm          s                   like(l_firm)
     d w_user          s                   like(l_user)
      *
     c     dummy         tag
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Åpningsbilde for valg av kodetype
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av kodetype                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Nullstille
      *
     c                   move      00            a2valg
      *
      * Bare data
      *
     c     a2tagb        tag
      *
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c     *inkc         cabeq     *on           xslutt
      *
      * Er kode for valg ugyldig
      *
     c                   if        a2valg <> 00 and                                      .....
     c                             a2valg <> 01 and                                          .
     c                             a2valg <> 02 and                                          .
     c                             a2valg <> 03 and                                          .
     c                             a2valg <> 04 and                                          .
     c                             a2valg <> 05 and                                          .
     c                             a2valg <> 06 and                                          .
     c                             a2valg <> 07 and                                          .
     c                             a2valg <> 08 and                                          .
     c                             a2valg <> 09                                              .
     c                   move      *on           *in31                                       .
     c                   goto      a2tagb                                                    .
     c                   endif                                                           .....
      *
      * Call program for statuskode 0 - Firma
      *
     c                   if        a2valg = 00                                           .....
     c                   call      'AA008R'                                                  .
     c                   goto      a2tagb                                                    .
     c                   endif                                                           .....
      *
      * Call program for statuskode 1 - Regnskapskoder
      *
     c                   if        a2valg = 01                                           .....
     c                   call      'RA001R'                                                  .
     c                   goto      a2tagb                                                    .
     c                   endif                                                           .....
      *
      * Call program for statuskode 2 - OCR-koder
      *
     c                   if        a2valg = 02                                           .....
     c                   call      'RA002R'                                                  .
     c                   goto      a2tagb                                                    .
     c                   endif                                                           .....
      *
      * Call program for statuskode 3 - Reskontrokoder
      *
     c                   if        a2valg = 03                                           .....
     c                   call      'RA003R'                                                  .
     c                   goto      a2tagb                                                    .
     c                   endif                                                           .....
      *
      * Call program for statuskode 4 - Sist brukte nummer
      *
     c                   if        a2valg = 04                                           .....
     c                   call      'RA004R'                                                  .
     c                   parm                    w_firm                                      .
     c                   parm                    wpk04n                                      .
     c                   goto      a2tagb                                                    .
     c                   endif                                                           .....
      *
      * Call program for statuskode 5 - Betalingsvarsel
      *
     c                   if        a2valg = 05                                           .....
     c                   call      'RA005R'                                                  .
     c                   goto      a2tagb                                                    .
     c                   endif                                                           .....
      *
      * Call program for statuskode 6 - Rentenota
      *
     c                   if        a2valg = 06                                           .....
     c                   call      'RA006R'                                                  .
     c                   goto      a2tagb                                                    .
     c                   endif                                                           .....
      *
      * Call program for statuskode 7 - Registreringsbilde
      *
     c                   if        a2valg = 07                                           .....
     c                   call      'RA007R'                                                  .
     c                   goto      a2tagb                                                    .
     c                   endif                                                           .....
      *
      * Call program for statuskode 8 - E-handelsinformasjon
      *
     c                   if        a2valg = 08                                           .....
     c                   call      'RA008R'                                                  .
     c                   goto      a2tagb                                                    .
     c                   endif                                                           .....
      *
      * Call program for statuskode 9 - Factoringinformasjon
      *
     c                   if        a2valg = 09                                           .....
     c                   call      'RA009R'                                                  .
     c                   goto      a2tagb                                                    .
     c                   endif                                                           .....
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   eval      wpk02n = *zero
     c                   eval      wpk03n = *zero
     c                   eval      wpk04n = *zero
     c                   eval      wpk01a = *blank
     c                   eval      wpk02a = *blank
     c                   eval      wpk03a = *blank
      *
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   move      l_firm        w_firm
      *
      * Initiere felter
      *
     c                   eval      a2valg = *zero
      *
      * Key for bruker-file
      *
     c     key03         klist
     c                   kfld                    w_user
      *
     c                   endsr
