     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                       *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RA104R                                              *
      * Beskrivelse . . : Vedlikehold av koder  - faste konti                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
T5.00 * R5.00     220802  Firma i parameter til RH500R                   HFL
T5.00 * R5.40     010405  Fjernet alle feilkontor fra faste konti        KOB
T5.00 * R5.40     010405  Fjernet faktoring kundenummer                  KOB
T5.00 * R5.40     010405  Lagt inn ny konto for mva på utenl.tjenester   KOB
T5.00 * R5.42     011005  Lagt inn ny konto for interimsføring           KOB
T5.00 * R5.50     150307  Fjernet kode knyttet til investeringsavgift    KOB
T6.20 * R6.20     131210  Fjernet gammelt prosjektregister               KOB
7.xx  * 7.00  010316 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
      *                                                                       *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    62-69 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-61 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fra04l1    if   e           k disk    rename(ra04pfr:ra04l1r)
     fra04lu    uf a e           k disk    rename(ra04pfr:ra04lur)
     frkunlr    if   e           k disk    rename(rkunpfr:rkunlrr)
     frlevlr    if   e           k disk    rename(rlevpfr:rlevlrr)
6.20 f**rprolr    if   e           k disk    rename(rpropfr:rprolrr)
     fra104d    cf   e             workstn
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d wpknav          s                   like(rknavn)
     d wpkund          s                   like(rkkund)
     d wplevr          s                   like(rllevr)
     d wplnav          s                   like(rlnavn)
6.20 d*wwakti          s
6.20 d wwakti          s              6
     d wwgkod          s                   like(rada01)
     d wwkont          s                   like(radk01)
     d wwkund          s                   like(rkkund)
     d wwlevr          s                   like(rllevr)
6.20 d*wwpkto          s                   like(rpkont)
6.20 d*wwpros          s                   like(rppros)
6.20 d*wwpsps          s                   like(rpspes)
     d wwspes          s                   like(rads01)
6.20 d wwpkto          s              6
6.20 d wwpros          s              5  0
6.20 d wwpsps          s              4  0
     d spge01          s              4  0
      *
     d wwtext          s             30
     d wwtex2          s             30
     d wpgtxt          s             20
      *
     d w_user          s                   like(l_user)
      *
     d p_stat          s              1
     d w_firm          s                   like(radfir)
     d p_kont          s                   like(radk01)
     d p_spes          s                   like(rads01)
     d p_avde          s                   like(rada01)
     d p_text          s             30
      *
     c     dummy         tag
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for vedlikehold av faste konti             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
      *
     c                   exfmt     a2bld
      *
      * UTGÅENDE MVA
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA01'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da01
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK01'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk01
     c                   move      p_spes        a2ds01
     c                   endif
      *
     c                   if        a2da01 = *zero
     c                   move      p_avde        a2da01
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * UTGÅENDE MVA UTENLANDSKE TJENESTER
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA08'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da08
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK08'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk08
     c                   move      p_spes        a2ds08
     c                   endif
      *
     c                   if        a2da08 = *zero
     c                   move      p_avde        a2da08
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * INNGÅENDE MVA
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA02'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da02
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK02'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk02
     c                   move      p_spes        a2ds02
     c                   endif
      *
     c                   if        a2da02 = *zero
     c                   move      p_avde        a2da02
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * FYLKESSKATTESJEFEN
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA04'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da04
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK04'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk04
     c                   move      p_spes        a2ds04
     c                   endif
      *
     c                   if        a2da04 = *zero
     c                   move      p_avde        a2da04
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * KUNDER
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA05'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da05
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK05'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk05
     c                   move      p_spes        a2ds05
     c                   endif
      *
     c                   if        a2da05 = *zero
     c                   move      p_avde        a2da05
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * LEVERANDØRER
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA06'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da06
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK06'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk06
     c                   move      p_spes        a2ds06
     c                   endif
      *
     c                   if        a2da06 = *zero
     c                   move      p_avde        a2da06
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * KONTANTRABATT KUNDER
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA07'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zero
     c                   move      p_avde        a2da07
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK07'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk07
     c                   move      p_spes        a2ds07
     c                   endif
      *
     c                   if        a2da07 = *zero
     c                   move      p_avde        a2da07
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * RENTEINNTEKTER
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA11'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da11
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK11'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk11
     c                   move      p_spes        a2ds11
     c                   endif
      *
     c                   if        a2da11 = *zero
     c                   move      p_avde        a2da11
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * AGIO
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA12'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da12
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK12'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk12
     c                   move      p_spes        a2ds12
     c                   endif
      *
     c                   if        a2da12 = *zero
     c                   move      p_avde        a2da12
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * DISAGIO
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA13'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da13
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK13'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk13
     c                   move      p_spes        a2ds13
     c                   endif
      *
     c                   if        a2da13 = *zero
     c                   move      p_avde        a2da13
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * ØREAVRUNDING
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA14'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da14
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK14'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk14
     c                   move      p_spes        a2ds14
     c                   endif
      *
     c                   if        a2da14 = *zero
     c                   move      p_avde        a2da14
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * BANK
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA15'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da15
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK15'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk15
     c                   move      p_spes        a2ds15
     c                   endif
      *
     c                   if        a2da15 = *zero
     c                   move      p_avde        a2da15
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * KONTANTRABATT LEVERANDØRER
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA16'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da16
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK16'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk16
     c                   move      p_spes        a2ds16
     c                   endif
      *
     c                   if        a2da16 = *zero
     c                   move      p_avde        a2da16
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * KASSE
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA17'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da17
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK17'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk17
     c                   move      p_spes        a2ds17
     c                   endif
      *
     c                   if        a2da17 = *zero
     c                   move      p_avde        a2da17
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Betalingsgebyr
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA20'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da20
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK20'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk20
     c                   move      p_spes        a2ds20
     c                   endif
      *
     c                   if        a2da20 = *zero
     c                   move      p_avde        a2da20
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Interimskonto
      *
      * Call program for avdeling
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DA21'
      *
     c                   call      'RA107R'
     c                   parm                    w_firm
     c                   parm                    p_avde
     c                   parm                    wpgtxt
      *
     c                   if        p_avde <> *zeros
     c                   move      p_avde        a2da21
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Call program for konto
      *
     c                   if        *inkd = *on and
     c                             w_afld = 'A2DK21'
      *
     c                   call      'RH500R'
T5.00c                   parm                    w_firm
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   if        p_kont <> *zero
     c                   move      p_kont        a2dk21
     c                   move      p_spes        a2ds21
     c                   endif
      *
     c                   if        a2da21 = *zero
     c                   move      p_avde        a2da21
     c                   endif
      *
     c                   goto      a2tagb
     c                   endif
      *
      * Gå ut
      *
     c     *inkc         cabeq     *on           xslutt
     c     *inkl         cabeq     *on           xslutt
      /eject
      *
      * KONTROLL -  KONTROLL  - KONTROLL
      *
     c                   move      w_firm        radfir
     c                   move      w_firm        w_firm
      *
      * Utgående mva
      *
     c                   if        a2da01 <> *zero
     c                             or a2dk01 <> *zero
     c                             or a2ds01 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk01        p_kont
     c                   move      a2ds01        p_spes
     c                   move      a2da01        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in30
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in31
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in31
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in31
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in31
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * Inngående mva
      *
     c                   if        a2da02 <> *zero
     c                             or a2dk02 <> *zero
     c                             or a2ds02 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk02        p_kont
     c                   move      a2ds02        p_spes
     c                   move      a2da02        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in32
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in33
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in33
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in33
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in31
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * Inngående mva  utenlandske tjenester
      *
     c                   if        a2da08 <> *zero
     c                             or a2dk08 <> *zero
     c                             or a2ds08 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk08        p_kont
     c                   move      a2ds08        p_spes
     c                   move      a2da08        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in32
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in33
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in33
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in33
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in31
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * FYLKESSKATTESJEFEN
      *
     c                   if        a2da04 <> *zero
     c                             or a2dk04 <> *zero
     c                             or a2ds04 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk04        p_kont
     c                   move      a2ds04        p_spes
     c                   move      a2da04        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in36
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in37
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in37
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in37
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in37
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * KUNDER
      *
     c                   if        a2da05 <> *zero
     c                             or a2dk05 <> *zero
     c                             or a2ds05 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk05        p_kont
     c                   move      a2ds05        p_spes
     c                   move      a2da05        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in38
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in39
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in39
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in39
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in31
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * LEVERANDØRER
      *
     c                   if        a2da06 <> *zero
     c                             or a2dk06 <> *zero
     c                             or a2ds06 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk06        p_kont
     c                   move      a2ds06        p_spes
     c                   move      a2da06        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in40
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in41
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in41
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in41
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in31
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * KONTANTRABATT KUNDER
      *
     c                   if        a2da07 <> *zero
     c                             or a2dk07 <> *zero
     c                             or a2ds07 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk07        p_kont
     c                   move      a2ds07        p_spes
     c                   move      a2da07        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in42
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in43
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in43
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in43
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in43
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * RENTEINNTEKTER
      *
     c                   if        a2da11 <> *zero
     c                             or a2dk11 <> *zero
     c                             or a2ds11 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk11        p_kont
     c                   move      a2ds11        p_spes
     c                   move      a2da11        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in48
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in49
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in49
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in49
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in49
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * AGIO
      *
     c                   if        a2da12 <> *zero
     c                             or a2dk12 <> *zero
     c                             or a2ds12 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk12        p_kont
     c                   move      a2ds12        p_spes
     c                   move      a2da12        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in50
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in51
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in51
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in51
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in51
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * DISAGIO
      *
     c                   if        a2da13 <> *zero
     c                             or a2dk13 <> *zero
     c                             or a2ds13 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk13        p_kont
     c                   move      a2ds13        p_spes
     c                   move      a2da13        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in52
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in53
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in53
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in53
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in53
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * ØREAVRUNDING
      *
     c                   if        a2da14 <> *zero
     c                             or a2dk14 <> *zero
     c                             or a2ds14 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk14        p_kont
     c                   move      a2ds14        p_spes
     c                   move      a2da14        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in54
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in55
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in55
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in55
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in55
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * BANK
      *
     c                   if        a2da15 <> *zero
     c                             or a2dk15 <> *zero
     c                             or a2ds15 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk15        p_kont
     c                   move      a2ds15        p_spes
     c                   move      a2da15        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in56
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in57
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in57
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in57
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in57
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * KONTANTRABATT LEVERANDØRER
      *
     c                   if        a2da16 <> *zero
     c                             or a2dk16 <> *zero
     c                             or a2ds16 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk16        p_kont
     c                   move      a2ds16        p_spes
     c                   move      a2da16        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in58
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in59
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in59
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in59
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in59
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * KASSE
      *
     c                   if        a2da17 <> *zero
     c                             or a2dk17 <> *zero
     c                             or a2ds17 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk17        p_kont
     c                   move      a2ds17        p_spes
     c                   move      a2da17        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in62
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in63
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in63
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in63
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in63
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * Inkassoprovisjon
      *
     c                   if        a2da19 <> *zero
     c                             or a2dk19 <> *zero
     c                             or a2ds19 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk19        p_kont
     c                   move      a2ds19        p_spes
     c                   move      a2da19        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in65
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in66
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in66
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in66
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in31
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * Betalingsgebyrer
      *
     c                   if        a2da20 <> *zero
     c                             or a2dk20 <> *zero
     c                             or a2ds20 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk20        p_kont
     c                   move      a2ds20        p_spes
     c                   move      a2da20        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in67
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in68
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in68
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in68
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in31
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      * Interimskonto
      *
     c                   if        a2da21 <> *zero or
     c                             a2dk21 <> *zero or
     c                             a2ds21 <> *zero
      *
     c                   move      *off          *in80
     c                   move      *off          *in81
     c                   move      *off          *in82
     c                   move      *off          *in83
     c                   move      a2dk21        p_kont
     c                   move      a2ds21        p_spes
     c                   move      a2da21        p_avde
     c                   call      'RS740R'
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
      * Avdeling finnes ikke
      *
     c                   if        p_stat = 'A'
     c                   move      *on           *in69
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Konto finnes ikke
      *
     c                   if        p_stat = 'N'
     c                   move      *on           *in70
     c                   move      *on           *in80
     c                   goto      a2tagb
     c                   endif
      *
      * Er konto sperret?
      *
     c                   if        p_stat = 'S'
     c                   move      *on           *in70
     c                   move      *on           *in81
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis avdeling er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'M'
     c                   move      *on           *in70
     c                   move      *on           *in82
     c                   goto      a2tagb
     c                   endif
      *
      * Hvis spesifikasjon er utfylt, må konto også utfylles
      *
     c                   if        p_stat = 'K'
     c                   move      *on           *in31
     c                   move      *on           *in83
     c                   goto      a2tagb
     c                   endif
      *
     c                   endif
      *
      /eject
      *
      * Oppdater file
      *
     c     ra04lu_key    chain     ra04lu                             61
      *
     c                   move      a2da01        rada01
     c                   move      a2dk01        radk01
     c                   move      a2ds01        rads01
      *
     c                   move      a2da02        rada02
     c                   move      a2dk02        radk02
     c                   move      a2ds02        rads02
      *
     c                   move      a2da04        rada04
     c                   move      a2dk04        radk04
     c                   move      a2ds04        rads04
      *
     c                   move      a2da05        rada05
     c                   move      a2dk05        radk05
     c                   move      a2ds05        rads05
      *
     c                   move      a2da06        rada06
     c                   move      a2dk06        radk06
     c                   move      a2ds06        rads06
      *
     c                   move      a2da07        rada07
     c                   move      a2dk07        radk07
     c                   move      a2ds07        rads07
      *
     c                   move      a2da08        rada08
     c                   move      a2dk08        radk08
     c                   move      a2ds08        rads08
      *
     c                   move      a2da11        rada11
     c                   move      a2dk11        radk11
     c                   move      a2ds11        rads11
      *
     c                   move      a2da12        rada12
     c                   move      a2dk12        radk12
     c                   move      a2ds12        rads12
      *
     c                   move      a2da13        rada13
     c                   move      a2dk13        radk13
     c                   move      a2ds13        rads13
      *
     c                   move      a2da14        rada14
     c                   move      a2dk14        radk14
     c                   move      a2ds14        rads14
      *
     c                   move      a2da15        rada15
     c                   move      a2dk15        radk15
     c                   move      a2ds15        rads15
      *
     c                   move      a2da16        rada16
     c                   move      a2dk16        radk16
     c                   move      a2ds16        rads16
      *
     c                   move      a2da17        rada17
     c                   move      a2dk17        radk17
     c                   move      a2ds17        rads17
      *
     c                   move      a2da19        rada19
     c                   move      a2dk19        radk19
     c                   move      a2ds19        rads19
      *
     c                   move      a2da20        rada20
     c                   move      a2dk20        radk20
     c                   move      a2ds20        rads20
      *
     c                   move      a2da21        rada21
     c                   move      a2dk21        radk21
     c                   move      a2ds21        rads21
      *
     c                   if        *in61 = *off
     c                   update    ra04lur
     c                   else
     c                   write     ra04lur
     c                   endif
      /space 3
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wwtext = *blank
     c                   eval      wwtex2 = *blank
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   move      l_firm        w_firm
     c                   move      l_user        w_user
      *
      * Hent faste konti
      *
     c     ra04l1_key    chain     ra04l1                             61
      *
     c                   if        *in61 = *off
      *
     c                   move      rada01        a2da01
     c                   move      radk01        a2dk01
     c                   move      rads01        a2ds01
      *
     c                   move      rada02        a2da02
     c                   move      radk02        a2dk02
     c                   move      rads02        a2ds02
      *
     c                   move      rada04        a2da04
     c                   move      radk04        a2dk04
     c                   move      rads04        a2ds04
      *
     c                   move      rada05        a2da05
     c                   move      radk05        a2dk05
     c                   move      rads05        a2ds05
      *
     c                   move      rada06        a2da06
     c                   move      radk06        a2dk06
     c                   move      rads06        a2ds06
      *
     c                   move      rada07        a2da07
     c                   move      radk07        a2dk07
     c                   move      rads07        a2ds07
      *
     c                   move      rada08        a2da08
     c                   move      radk08        a2dk08
     c                   move      rads08        a2ds08
      *
     c                   move      rada11        a2da11
     c                   move      radk11        a2dk11
     c                   move      rads11        a2ds11
      *
     c                   move      rada12        a2da12
     c                   move      radk12        a2dk12
     c                   move      rads12        a2ds12
      *
     c                   move      rada13        a2da13
     c                   move      radk13        a2dk13
     c                   move      rads13        a2ds13
      *
     c                   move      rada14        a2da14
     c                   move      radk14        a2dk14
     c                   move      rads14        a2ds14
      *
     c                   move      rada15        a2da15
     c                   move      radk15        a2dk15
     c                   move      rads15        a2ds15
      *
     c                   move      rada16        a2da16
     c                   move      radk16        a2dk16
     c                   move      rads16        a2ds16
      *
     c                   move      rada17        a2da17
     c                   move      radk17        a2dk17
     c                   move      rads17        a2ds17
      *
     c                   move      rada19        a2da19
     c                   move      radk19        a2dk19
     c                   move      rads19        a2ds19
      *
     c                   move      rada20        a2da20
     c                   move      radk20        a2dk20
     c                   move      rads20        a2ds20
      *
     c                   move      rada21        a2da21
     c                   move      radk21        a2dk21
     c                   move      rads21        a2ds21
      *
     c                   endif
      *
      * Key for koderegister
      *
     c     ra04l1_key    klist
     c                   kfld                    w_firm
      *
      * Key for koderegister
      *
     c     ra04lu_key    klist
     c                   kfld                    w_firm
      *
      * Key for kunderegister
      *
     c     rkunlr_key    klist
     c                   kfld                    w_firm
     c                   kfld                    wwkund
      *
      * Key for leverandørregister
      *
     c     rlevlr_key    klist
     c                   kfld                    w_firm
     c                   kfld                    wwlevr
      *
      * Key for prosjektregister
      *
     c     rprolr_key    klist
     c                   kfld                    w_firm
     c                   kfld                    wwpros
     c                   kfld                    wwakti
     c                   kfld                    wwpkto
     c                   kfld                    wwpsps
      *
     c                   endsr
