     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
      *                                                                       *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RA201R                                              *
      * Beskrivelse . . : Poster fra Adrea           - parameter              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     fra201d    cf   e             workstn
      *
     d                uds
     d pfirm                 300    302  0
     d pnavn                         30
     d puser                         10
     d pdato                          6  0
     d praar                          4  0
     d pperf                          2  0
     d ppert                          2  0
     d pavdf                          4  0
     d pavdt                          4  0
     d psyst                 471    472  0
     d psumm                 473    473
     d psums                 474    474
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d w_aar           s              4  0
     d w_mnd           s              2  0
     d w_in03          s              1
      *
     c     a2taga        tag
      *
     c                   exfmt     a2bld
      *
     c                   eval      *in31 = *off
     c                   eval      *in32 = *off
     c                   eval      *in33 = *off
     c                   eval      *in34 = *off
     c                   eval      *in35 = *off
     c                   eval      *in36 = *off
      *
      * Gå ut
      *
B001 c                   if        *inkc = *on
 001 c                   eval      w_in03 = '1'
 001 c                   goto      slutt
E001 c                   endif
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero
     c                   move      udate         a2pkda
     c                   endif
      *
     c     *dmy          test(d)                 a2pkda                 33
     c                   if        *in33 = *on
     c                   goto      a2taga
     c                   endif
      *
      * Kontroll av regnskapsår
      *
B001 c                   if        a2prÅr > *year
 001 c                   move      *on           *in32
 001 c                   goto      a2taga
E001 c                   endif
      *
      * Kontroll av regnskapsperiode
      *
B001 c                   if        a2pper <= *zero
 001 c                   move      *on           *in35
 001 c                   goto      a2taga
E001 c                   endif
      *
B001 c                   if        a2pper > 13
 001 c                   move      *on           *in35
 001 c                   goto      a2taga
E001 c                   endif
      *
      *  PARAMETER - OK
      *
     c                   move      l_firm        pfirm
     c                   move      l_fnav        pnavn
     c                   move      l_user        puser
     c                   move      a2pkda        pdato
     c                   move      a2prÅr        praar
     c                   move      *zeros        pperf
     c                   move      a2pper        ppert
      *
     c     slutt         tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   move      udate         a2pkda
      *
      * Beregn periode
      *
     c                   eval      w_aar= *year
      *
     c     umonth        sub       1             w_mnd
      *
B001 c                   if        w_mnd= *zero
 001 c                   movel     12            w_mnd
 001 c     w_aar         sub       1             w_aar
 001 c                   move      w_aar         a2prÅr
X001 c                   else
 001 c                   move      w_aar         a2prÅr
E001 c                   endif
      *
     c                   move      w_mnd         a2pper
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_in03
      *
     c                   endsr
