     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
      *                                                                       *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RA210R                                              *
      * Beskrivelse . . : Kunder til Adra Match                               *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     frkunl1    ip   e           k disk    rename(rkunpfr:rkunl1r)
     frlevl1    if   e           k disk    rename(rlevpfr:rlevl1r)
     fadrkund   o    f  256        disk
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d w_aar           s              4  0
     d w_mnd           s              2  0
     d w_fgr           s              3
     d w_sted          s             25
     d w_ponr          s              4
     d w_kund          s              6
     d krec            s            256
      *
     d rlevl1_firm     s                    like(rlfirm)
     d rlevl1_levr     s                    like(rllevr)
      *
     c                   move      rkponr        w_ponr
     c                   if        w_ponr        =
     c                             %subst(rksted:1:4)
     c                   eval      w_sted = %subst(rksted:6:25)
     c                   else
     c                   eval      w_sted = rksted
     c                   endif
     c                   move      rkkund        w_kund
     c                   dow       %subst(w_kund:1:1) = '0'
     c                   eval      %subst(w_kund:1:5) =
     c                             %subst(w_kund:2:5)
     c                   eval      %subst(w_kund:6:1) = *blank
     c                   enddo
      *
     c                   eval      krec  = '         '  +
     c                                        w_kund    +
     c                                        rknavn    +
     c                                        '     '   +
     c                             %subst(rkgate:1:25)  +
     c                             %subst(rkadr2:1:25)  +
     c                             w_ponr               +
     c                             w_sted               +
     c                             '                   '
     c                   except    kundrec
      *
     clr                 eval      rlevl1_firm = *zero
     clr                 eval      rlevl1_levr = *zero
     clr   rlevl1_key    setll     rlevl1
     clr                 read      rlevl1
     clr                 dow       not %eof(rlevl1)
     clr                 exsr      lever
     clr                 read      rlevl1
     clr                 enddo
      *
     c     lever         begsr
     c                   move      rlponr        w_ponr
     c                   if        w_ponr        =
     c                             %subst(rlsted:1:4)
     c                   eval      w_sted = %subst(rlsted:6:25)
     c                   else
     c                   eval      w_sted = rlsted
     c                   endif
     c                   move      rllevr        w_kund
     c                   dow       %subst(w_kund:1:1) = '0'
     c                   eval      %subst(w_kund:1:5) =
     c                             %subst(w_kund:2:5)
     c                   eval      %subst(w_kund:6:1) = *blank
     c                   enddo
      *
     c                   eval      krec  = '         '  +
     c                                        w_kund    +
     c                                        rlnavn    +
     c                                        '     '   +
     c                             %subst(rlgate:1:25)  +
     c                             %subst(rladr2:1:25)  +
     c                             w_ponr               +
     c                             w_sted               +
     c                             '                   '
     c                   except    kundrec
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_fgr
 001  *
     c     rlevl1_key    klist
     c                   kfld                    rlevl1_firm
     c                   kfld                    rlevl1_levr
      *
     c
      *
     c                   endsr
     oadrkund   e            kundrec
     o                       krec               256
