     h option(*nodebugio) datedit(*dmy)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RA601R                                              *
      * Beskrivelse . . : Utskrift av koderegister                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      * V5.40     020405  Fjernet Factoring kundenummer                  KOB  *
      * V5.50     080306  Skriver telefonnr. og E-mail adresse.          HFL  *
      * V5.60     140308  Lagt inn om sperrede koder skal med            HFL  *
6.20  * V6.20     230211  Feltlengden på avdeling er endret fra 20 til 30bsa  *
      *                                                                       *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fafirl1    if   e           k disk
     fraa1l1    if   e           k disk    rename(raa1pfr:raa1l1r)
     fraa2l1    if   e           k disk    rename(raa2pfr:raa2l1r)
     fraa3l1    if   e           k disk    rename(raa3pfr:raa3l1r)
     fraa4l1    if   e           k disk    rename(raa4pfr:raa4l1r)
     fraa5l1    if   e           k disk    rename(raa5pfr:raa5l1r)
     fraa6l1    if   e           k disk    rename(raa6pfr:raa6l1r)
      *
     fra01l1    if   e           k disk    rename(ra01pfr:ra01l1r)
     fra02l1    if   e           k disk    rename(ra02pfr:ra02l1r)
     fra03l1    if   e           k disk    rename(ra03pfr:ra03l1r)
     fra04l1    if   e           k disk    rename(ra04pfr:ra04l1r)
     fra05l1    if   e           k disk    rename(ra05pfr:ra05l1r)
     fra06l1    if   e           k disk    rename(ra06pfr:ra06l1r)
     fra07l1    if   e           k disk    rename(ra07pfr:ra07l1r)
     fra08l1    if   e           k disk    rename(ra08pfr:ra08l1r)
     fra09l1    if   e           k disk    rename(ra09pfr:ra09l1r)
     fra10l1    if   e           k disk    rename(ra10pfr:ra10l1r)
     fra11l1    if   e           k disk    rename(ra11pfr:ra11l1r)
     fra12l1    if   e           k disk    rename(ra12pfr:ra12l1r)
     fra13l1    if   e           k disk    rename(ra13pfr:ra13l1r)
     fra14l1    if   e           k disk    rename(ra14pfr:ra14l1r)
     fra15l1    if   e           k disk    rename(ra15pfr:ra15l1r)
     fra16l1    if   e           k disk    rename(ra16pfr:ra16l1r)
     fra17l1    if   e           k disk    rename(ra17pfr:ra17l1r)
     fra18l1    if   e           k disk    rename(ra18pfr:ra18l1r)
     fra19l1    if   e           k disk    rename(ra19pfr:ra19l1r)
     fra20l1    if   e           k disk    rename(ra20pfr:ra20l1r)
     fra21l1    if   e           k disk    rename(ra21pfr:ra21l1r)
     fra22l1    if   e           k disk    rename(ra22pfr:ra22l1r)
     fra23l1    if   e           k disk    rename(ra23pfr:ra23l1r)
     fra24l1    if   e           k disk    rename(ra24pfr:ra24l1r)
     fra25l1    if   e           k disk    rename(ra25pfr:ra25l1r)
     fra26l1    if   e           k disk    rename(ra26pfr:ra26l1r)
     fra27l1    if   e           k disk    rename(ra27pfr:ra27l1r)
     fra28l1    if   e           k disk    rename(ra28pfr:ra28l1r)
     fra601p    o    e             printer oflind(*in30)
      *
     d txt             s             30    dim(29) ctdata perrcd(1)
     d kto             s             30    dim(29) ctdata perrcd(1)
      *
     d                uds
E5.00d  ix                   300    329    dim(30)
T5.60d  l_pksp               350    350
      *
     d  l_wsid               901    910
     d  l_firm               944    946  0
     d  l_fnav               951    980
     d  l_user               911    920
      *
     d ktotxt          s             30
     d p_stat          s              1
     d p_avde          s              4  0
     d p_kont          s              5  0
     d p_spes          s              4  0
     d p_text          s             30
      *
     d ktxt            s             30
     d sider           s              3  0
     d wpretk          s              1
     d w_akod          s                   like(raakod)
     d w_akti          s              3
     d w_atxt          s                   like(raatxt)
     d w_bkod          s                   like(rabkod)
     d w_ckod          s                   like(rackod)
     d w_da01          s                   like(rada01)
     d w_dk01          s                   like(radk01)
     d w_ds01          s                   like(rads01)
     d w_ekod          s                   like(raekod)
     d w_firm          s                   like(ra1fir)
     d w_fkod          s                   like(rafkod)
     d w_gkod          s                   like(ragkod)
     d w_hkod          s                   like(rahkod)
     d w_ikod          s                   like(raikod)
     d w_jkod          s                   like(rajkod)
     d w_kkod          s                   like(rakkod)
     d w_lkod          s                   like(ralkod)
     d w_mkod          s                   like(ramkod)
     d w_nkod          s                   like(rankod)
     d w_okod          s                   like(raokod)
     d w_pkod          s                   like(rapkod)
     d w_qkod          s                   like(raqkod)
     d w_rkod          s                   like(rarkod)
     d w_skod          s                   like(raskod)
     d w_text          s                   like(p_text)
     d w_tex2          s                   like(p_text)
     d w_tkod          s                   like(ratkod)
     d w_ukod          s                   like(raukod)
     d w_vkod          s                   like(ravkod)
     d w_wkod          s                   like(rawkod)
     d w_xkod          s                   like(raxrko)
     d w_yrut          s                   like(rayrut)
     d w_zsak          s                   like(razsak)
     d w_agrp          s                   like(reagrp)
     d w_bgrp          s                   like(rebkod)
     d w_1hkt          s                   like(ra1hkt)
     d w_1hrs          s                   like(ra1hrs)
      *
     c     dummy         tag
      *
      /eject
      *
      *  Behandle utskrift av
      *  statuskoder
      *
     c                   if        ix(1) = '1'
     c                   exsr      kod00
     c                   endif
      *
      *  Behandle utskrift av
      *  bilagskoder
      *
     c                   if        ix(2) = '1'
     c                   exsr      kod01
     c                   endif
      *
      *  Behandle utskrift av
      *  betalingsmåte
      *
     c                   if        ix(3) = '1'
     c                   exsr      kod02
     c                   endif
      *
      *  Behandle utskrift av
      *  betalingsbetingelse
      *
     c                   if        ix(4) = '1'
     c                   exsr      kod03
     c                   endif
      *
      *  Behandle utskrift av
      *  faste konti
      *
     c                   if        ix(5) = '1'
     c                   exsr      kod04
     c                   endif
      *
      *  Behandle utskrift av
      *  MVA-koder
      *
     c                   if        ix(6) = '1'
     c                   exsr      kod05
     c                   endif
      *
      *  Behandle utskrift av
      *  rabattgrupper
      *
     c                   if        ix(7) = '1'
     c                   exsr      kod06
     c                   endif
      *
      *  Behandle utskrift av
      *  avdeling
      *
     c                   if        ix(8) = '1'
     c                   exsr      kod07
     c                   endif
      *
      *  Behandle utskrift av
      *  distrikt
      *
     c                   if        ix(9) = '1'
     c                   exsr      kod08
     c                   endif
      *
      *  Behandle utskrift av
      *  selger
      *
     c                   if        ix(10) = '1'
     c                   exsr      kod09
     c                   endif
      *
      *  Behandle utskrift av
      *  lager
      *
     c                   if        ix(11) = '1'
     c                   exsr      kod10
     c                   endif
      *
      *  Behandle utskrift av
      *  kundekategori
      *
     c                   if        ix(12) = '1'
     c                   exsr      kod11
     c                   endif
      *
      *  Behandle utskrift av
      *  land
      *
     c                   if        ix(13) = '1'
     c                   exsr      kod12
     c                   endif
      *
      *  Behandle utskrift av
      *  fordelingsnøkkel
      *
     c                   if        ix(14) = '1'
     c                   exsr      kod13
     c                   endif
      *
      *  Behandle utskrift av
      *  leverandørkategori
      *
     c                   if        ix(15) = '1'
     c                   exsr      kod14
     c                   endif
      *
      *  Behandle utskrift av
      *  mengde
      *
     c                   if        ix(16) = '1'
     c                   exsr      kod15
     c                   endif
      *
      *  Behandle utskrift av
      *  valuta
      *
     c                   if        ix(17) = '1'
     c                   exsr      kod16
     c                   endif
      *
      *  Behandle utskrift av
      *  forsendelsesmåte
      *
     c                   if        ix(18) = '1'
     c                   exsr      kod17
     c                   endif
      *
      *  Behandle utskrift av
      *  leveringsbetingelse
      *
     c                   if        ix(19) = '1'
     c                   exsr      kod18
     c                   endif
      *
      *  Behandle utskrift av
      *  kontoklasse
      *
     c                   if        ix(20) = '1'
     c                   exsr      kod19
     c                   endif
      *
      *  Behandle utskrift av
      *  kontogruppe
      *
     c                   if        ix(21) = '1'
     c                   exsr      kod20
     c                   endif
      *
      *  Behandle utskrift av
      *  aktivitet
      *
     c                   if        ix(22) = '1'
     c                   exsr      kod21
     c                   endif
      *
      *  Behandle utskrift av
      *  speditør
      *
     c                   if        ix(23) = '1'
     c                   exsr      kod22
     c                   endif
      *
      *  Behandle utskrift av
      *  virksomhet
      *
     c                   if        ix(24) = '1'
     c                   exsr      kod23
     c                   endif
      *
      *  Behandle utskrift av
      *  reklamasjonsårsak
      *
     c                   if        ix(25) = '1'
     c                   exsr      kod24
     c                   endif
      *
      *  Behandle utskrift av
      *  kjørerute
      *
     c                   if        ix(26) = '1'
     c                   exsr      kod25
     c                   endif
      *
      *  Behandle utskrift av
      *  produktansvarlig
      *
     c                   if        ix(27) = '1'
     c                   exsr      kod26
     c                   endif
      *
      *  Behandle utskrift av
      *  kostnadsbærergruppe
      *
     c                   if        ix(28) = '1'
     c                   exsr      kod27
     c                   endif
      *
      *  Behandle utskrift av
      *  kostnadsbærer
      *
     c                   if        ix(29) = '1'
     c                   exsr      kod28
     c                   endif
      /space 3
      *
     c     slutt         tag
      *
     c                   eval      *inlr = *on
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av stauskoder                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod00         begsr
      *
      * Hent statuskode 1
      *
     c     keya1         chain     raa1l1                             60
      *
     c                   eval      w_1hkt = ra1hkt + 1
     c                   eval      w_1hrs = ra1hrs + 1
      *
      * Hent statuskode 2
      *
     c     keya2         chain     raa2l1                             60
      *
      * Hent statuskode 3
      *
     c     keya3         chain     raa3l1                             60
      *
      * Hent statuskode 4
      *
     c                   eval      ra4aar = *zeros
     c     keya4         chain     raa4l1                             60
      *
      * Hent statuskode 5
      *
     c     keya5         chain     raa5l1                             60
      *
      * Hent statuskode 6
      *
     c     keya6         chain     raa6l1                             60
      *
     c                   move      txt(1)        ktxt
      *
     c                   write     head1
      *
     c                   write     l00
     c                   exsr      koda4
      *
     c     *dmy          move      ra6dat        l06dat
      *
     c                   write     l00b
      *
     c                   eval      sider = sider + 1
      *
     c     end00         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av sist brukte nummer                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     koda4         begsr
      *
     c                   move      0001          ra4aar
     c     keya4         setll     raa4l1
      *
      * Les årlige koder
      *
     c     lesa4         tag
      *
     c                   read      raa4l1r                                10
     c                   if        *in10 = *on
     c                   goto      enda4
     c                   endif
      *
     c                   if        ra4fir > w_firm
     c                   goto      enda4
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l01h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l00a                                         LINJE SKRIVES
      *
     c                   goto      lesa4
      *
     c     enda4         endsr
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av bilagskoder                           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod01         begsr
      *
     c                   eval      w_akod = *zeros
     c     key01         setll     ra01l1
      *
     c                   move      txt(2)        ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l01h
      *
      * Les bilagskoder
      *
     c     les01         tag
      *
     c                   read      ra01l1r                                10
     c                   if        *in10 = *on
     c                   goto      end01
     c                   endif
      *
     c                   if        raafir > w_firm
     c                   goto      end01
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l01h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l01                                          LINJE SKRIVES
      *
     c                   goto      les01
      *
     c     end01         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av betalingsmåter                        *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod02         begsr
      *
     c                   eval      w_bkod = *zeros
     c     key02         setll     ra02l1
      *
     c                   move      txt(3)        ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l02h
      *
     c     les02         tag
      *
     c                   read      ra02l1r                                10
     c                   if        *in10 = *on
     c                   goto      end02
     c                   endif
      *
     c                   if        rabfir > w_firm
     c                   goto      end02
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l02h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l02                                          LINJE SKRIVES
      *
     c                   goto      les02
      *
     c     end02         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av betalingsbetingelser                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod03         begsr
      *
     c                   eval      w_ckod = *zeros
     c     key03         setll     ra03l1
      *
     c                   move      txt(4)        ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l03h
      *
     c     les03         tag
      *
     c                   read      ra03l1r                                10
     c                   if        *in10 = *on
     c                   goto      end03
     c                   endif
      *
     c                   if        rabfir > w_firm
     c                   goto      end03
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l03h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l03                                          LINJE SKRIVES
      *
     c                   if        ractx2 <> *blank
     c                   write     l03t                                         EKSTRA TEKST SKRIVES
     c                   endif
      *
     c                   goto      les03
      *
     c     end03         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av faste konti                           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod04         begsr
      *
     c                   eval      w_ckod = *zeros
     c     key04         chain     ra04l1                             90
      *
     c                   move      txt(5)        ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l04h
      *
      * UTGÅENDE MVA
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk01 <> 0
     c                   move      kto(1)        ktotxt
     c                   move      rada01        p_avde
     c                   move      radk01        p_kont
     c                   move      rads01        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * INNGÅENDE MVA
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk02 <> 0
     c                   move      kto(2)        ktotxt
     c                   move      rada02        p_avde
     c                   move      radk02        p_kont
     c                   move      rads02        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * INVESTERINGSAVGIFT
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk03 <> 0
     c                   move      kto(3)        ktotxt
     c                   move      rada03        p_avde
     c                   move      radk03        p_kont
     c                   move      rads03        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * FYLKESSKATTESJEFEN
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk04 <> 0
     c                   move      kto(4)        ktotxt
     c                   move      rada04        p_avde
     c                   move      radk04        p_kont
     c                   move      rads04        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * DEBITORER
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk05 <> 0
     c                   move      kto(5)        ktotxt
     c                   move      rada05        p_avde
     c                   move      radk05        p_kont
     c                   move      rads05        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * KREDITORER
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk06 <> 0
     c                   move      kto(6)        ktotxt
     c                   move      rada06        p_avde
     c                   move      radk06        p_kont
     c                   move      rads06        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * KONTANTRABATT KUNDER
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk07 <> 0
     c                   move      kto(7)        ktotxt
     c                   move      rada07        p_avde
     c                   move      radk07        p_kont
     c                   move      rads07        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * RENTEINNTEKTER
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk11 <> 0
     c                   move      kto(11)       ktotxt
     c                   move      rada11        p_avde
     c                   move      radk11        p_kont
     c                   move      rads11        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * AGIO
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk12 <> 0
     c                   move      kto(12)       ktotxt
     c                   move      rada12        p_avde
     c                   move      radk12        p_kont
     c                   move      rads12        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * DISAGIO
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk13 <> 0
     c                   move      kto(13)       ktotxt
     c                   move      rada13        p_avde
     c                   move      radk13        p_kont
     c                   move      rads13        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * ØREAVRUNDING
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk14 <> 0
     c                   move      kto(14)       ktotxt
     c                   move      rada14        p_avde
     c                   move      radk14        p_kont
     c                   move      rads14        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * BANK
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk15 <> 0
     c                   move      kto(15)       ktotxt
     c                   move      rada15        p_avde
     c                   move      radk15        p_kont
     c                   move      rads15        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * KONTANTRABATT LEVERANDØRER
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk16 <> 0
     c                   move      kto(16)       ktotxt
     c                   move      rada16        p_avde
     c                   move      radk16        p_kont
     c                   move      rads16        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * KASSE
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk17 <> 0
     c                   move      kto(17)       ktotxt
     c                   move      rada17        p_avde
     c                   move      radk17        p_kont
     c                   move      rads17        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * INKASSOPROVISJON
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk19 <> 0
     c                   move      kto(19)       ktotxt
     c                   move      rada19        p_avde
     c                   move      radk19        p_kont
     c                   move      rads19        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
      * BETALINGSGEBYRER
      *
     c                   eval      w_text = *blank
      *
     c                   if        radk20 <> 0
     c                   move      kto(20)       ktotxt
     c                   move      rada20        p_avde
     c                   move      radk20        p_kont
     c                   move      rads20        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l04                                          LINJE SKRIVES
      *
     c                   write     l04k                                         LINJE SKRIVES
      *
     c     end04         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av MVA-koder                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod05         begsr
      *
     c                   eval      w_ekod = *blank
     c     key05         setll     ra05l1
      *
     c                   move      txt(6)        ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l05h
      *
     c     les05         tag
      *
     c                   read      ra05l1r                                10
     c                   if        *in10 = *on
     c                   goto      end05
     c                   endif
      *
     c                   if        raefir > w_firm
     c                   goto      end05
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l05h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c     *dmy          move      raemda        l05mda
     c     *dmy          move      raepda        l05pda
      *
     c                   write     l05                                          LINJE SKRIVES
      *
     c                   goto      les05
      *
     c     end05         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av rabattgruppe                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod06         begsr
      *
     c                   eval      w_fkod = *zeros
     c     key06         setll     ra06l1
      *
     c                   move      txt(7)        ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l06h
      *
     c     les06         tag
      *
     c                   read      ra06l1r                                10
     c                   if        *in10 = *on
     c                   goto      end06
     c                   endif
      *
     c                   if        raffir > w_firm
     c                   goto      end06
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l06h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l06                                          LINJE SKRIVES
      *
     c                   goto      les06
      *
     c     end06         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av avdeling                              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod07         begsr
      *
     c                   eval      w_gkod = *zeros
     c     key07         setll     ra07l1
      *
     c                   move      txt(8)        ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l07h
      *
     c     les07         tag
      *
     c                   read      ra07l1r                                10
     c                   if        *in10 = *on
     c                   goto      end07
     c                   endif
      *
     c                   if        ragfir > w_firm
     c                   goto      end07
     c                   endif
      *
T5.60 * Skal sperrede koder med?
      *
T5.60c                   if        l_pksp = 'N' and
T5.60c                             ragspr = 'J'
T5.60c                   goto      les07
T5.60c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l07h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l07                                          LINJE SKRIVES
      *
     c                   goto      les07
      *
     c     end07         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av distrikt                              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod08         begsr
      *
     c                   eval      w_hkod = *zeros
     c     key08         setll     ra08l1
      *
     c                   move      txt(9)        ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l08h
      *
     c     les08         tag
      *
     c                   read      ra08l1r                                10
     c                   if        *in10 = *on
     c                   goto      end08
     c                   endif
      *
     c                   if        rahfir > w_firm
     c                   goto      end08
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l08h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l08                                          LINJE SKRIVES
      *
     c                   goto      les08
      *
     c     end08         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av selger                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod09         begsr
      *
     c                   eval      w_ikod = *zeros
     c     key09         setll     ra09l1
      *
     c                   move      txt(10)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l09h
      *
     c     les09         tag
      *
     c                   read      ra09l1r                                10
     c                   if        *in10 = *on
     c                   goto      end09
     c                   endif
      *
     c                   if        raifir > w_firm
     c                   goto      end09
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l09h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l09                                          LINJE SKRIVES
      *
     c                   goto      les09
      *
     c     end09         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av lager                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod10         begsr
      *
     c                   eval      w_jkod = *zeros
     c     key10         setll     ra10l1
      *
     c                   move      txt(11)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l10h
      *
     c     les10         tag
      *
     c                   read      ra10l1r                                10
     c                   if        *in10 = *on
     c                   goto      end10
     c                   endif
      *
     c                   if        rajfir > w_firm
     c                   goto      end10
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l10h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l10                                          LINJE SKRIVES
      *
     c                   goto      les10
      *
     c     end10         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av kundekategori                         *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod11         begsr
      *
     c                   eval      w_kkod = *zeros
     c     key11         setll     ra11l1
      *
     c                   move      txt(12)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l11h
      *
     c     les11         tag
      *
     c                   read      ra11l1r                                10
     c                   if        *in10 = *on
     c                   goto      end11
     c                   endif
      *
     c                   if        rakfir > w_firm
     c                   goto      end11
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l11h
     c                   eval      *in30 = *off
     c                   enddo
      *
      * Hente inn kontotekst
      *
     c                   eval      p_text = *blank
      *
     c                   if        rakkto <> 0
      *
     c                   move      rakavd        p_avde
     c                   move      rakkto        p_kont
     c                   move      raksps        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l11                                          LINJE SKRIVES
      *
     c                   goto      les11
      *
     c     end11         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av land                                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod12         begsr
      *
     c                   eval      w_lkod = *blanks
     c     key12         setll     ra12l1
      *
     c                   move      txt(13)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l12h
      *
     c     les12         tag
      *
     c                   read      ra12l1r                                10
     c                   if        *in10 = *on
     c                   goto      end12
     c                   endif
      *
     c                   if        ralfir > w_firm
     c                   goto      end12
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l12h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l12                                          LINJE SKRIVES
      *
     c                   goto      les12
      *
     c     end12         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av fordelingsnøkler                      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod13         begsr
      *
     c                   eval      w_mkod = *zeros
     c     key13         setll     ra13l1
      *
     c                   move      txt(14)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l13h
      *
     c     les13         tag
      *
     c                   read      ra13l1r                                10
     c                   if        *in10 = *on
     c                   goto      end13
     c                   endif
      *
     c                   if        ramfir > w_firm
     c                   goto      end13
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l13h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l13                                          LINJE SKRIVES
      *
     c                   goto      les13
      *
     c     end13         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av leverandørkategori                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod14         begsr
      *
     c                   eval      w_nkod = *zeros
     c     key14         setll     ra14l1
      *
     c                   move      txt(15)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l14h
      *
     c     les14         tag
      *
     c                   read      ra14l1r                                10
     c                   if        *in10 = *on
     c                   goto      end14
     c                   endif
      *
     c                   if        ranfir > w_firm
     c                   goto      end14
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l14h
     c                   eval      *in30 = *off
     c                   enddo
      *
      * Hente inn kontotekst
      *
     c                   eval      p_text = *blank
      *
     c                   if        rankto <> 0
     c                   move      ranavd        p_avde
     c                   move      rankto        p_kont
     c                   move      ransps        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
     c                   write     l14                                          LINJE SKRIVES
      *
     c                   goto      les14
      *
     c     end14         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av mengde                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod15         begsr
      *
     c                   eval      w_okod = *zeros
     c     key15         setll     ra15l1
      *
     c                   move      txt(16)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l15h
      *
     c     les15         tag
      *
     c                   read      ra15l1r                                10
     c                   if        *in10 = *on
     c                   goto      end15
     c                   endif
      *
     c                   if        raofir > w_firm
     c                   goto      end15
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l15h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l15                                          LINJE SKRIVES
      *
     c                   goto      les15
      *
     c     end15         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av valutakurs                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod16         begsr
      *
     c                   eval      w_pkod = *zeros
     c     key16         setll     ra16l1
      *
     c                   move      txt(17)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l16h
      *
     c     les16         tag
      *
     c                   read      ra16l1r                                10
     c                   if        *in10 = *on
     c                   goto      end16
     c                   endif
      *
     c                   if        rapfir > w_firm
     c                   goto      end16
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l16h
     c                   eval      *in30 = *off
     c                   enddo
      *
      * Hente inn kontotekst
      *
     c                   eval      p_text = *blank
      *
     c                   if        rapkto <> 0
     c                   move      rapavd        p_avde
     c                   move      rapkto        p_kont
     c                   move      rapsps        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
     c                   endif
      *
     c     *dmy          move      rapdat        l16dat
      *
     c                   write     l16                                          LINJE SKRIVES
      *
     c                   goto      les16
      *
     c     end16         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av forsendelsesmåte                      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod17         begsr
      *
     c                   eval      w_qkod = *zeros
     c     key17         setll     ra17l1
      *
     c                   move      txt(18)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l18h
      *
     c     les17         tag
      *
     c                   read      ra17l1r                                10
     c                   if        *in10 = *on
     c                   goto      end17
     c                   endif
      *
     c                   if        raqfir > w_firm
     c                   goto      end17
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l17h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l17                                          LINJE SKRIVES
      *
     c                   goto      les17
      *
     c     end17         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av leveringsbetingelse                   *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod18         begsr
      *
     c                   eval      w_rkod = *zeros
     c     key18         setll     ra18l1
      *
     c                   move      txt(19)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l18h
      *
     c     les18         tag
      *
     c                   read      ra18l1r                                10
     c                   if        *in10 = *on
     c                   goto      end18
     c                   endif
      *
     c                   if        rarfir > w_firm
     c                   goto      end18
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l18h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l18                                          LINJE SKRIVES
      *
     c                   goto      les18
      *
     c     end18         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av kontoklasse                           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod19         begsr
      *
     c                   eval      w_skod = *zeros
     c     key19         setll     ra19l1
      *
     c                   move      txt(20)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l19h
      *
     c     les19         tag
      *
     c                   read      ra19l1r                                10
     c                   if        *in10 = *on
     c                   goto      end19
     c                   endif
      *
     c                   if        rasfir > w_firm
     c                   goto      end19
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l19h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l19                                          LINJE SKRIVES
      *
     c                   goto      les19
      *
     c     end19         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av kontogrupper                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod20         begsr
      *
     c                   eval      w_tkod = *zeros
     c     key20         setll     ra20l1
      *
     c                   move      txt(21)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l20h
      *
     c     les20         tag
      *
     c                   read      ra20l1r                                10
     c                   if        *in10 = *on
     c                   goto      end20
     c                   endif
      *
     c                   if        ratfir > w_firm
     c                   goto      end20
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l20h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l20                                          LINJE SKRIVES
      *
     c                   goto      les20
      *
     c     end20         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av aktivitet                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod21         begsr
      *
     c                   eval      w_ukod = *zeros
     c     key21         setll     ra21l1
      *
     c                   move      txt(22)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l21h
      *
     c     les21         tag
      *
     c                   read      ra21l1r                                10
     c                   if        *in10 = *on
     c                   goto      end21
     c                   endif
      *
     c                   if        raufir > w_firm
     c                   goto      end21
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l21h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l21                                          LINJE SKRIVES
      *
     c                   goto      les21
      *
     c     end21         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av speditør                              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod22         begsr
      *
     c                   eval      w_vkod = *zeros
     c     key22         setll     ra22l1
      *
     c                   move      txt(23)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l22h
      *
     c     les22         tag
      *
     c                   read      ra22l1r                                10
     c                   if        *in10 = *on
     c                   goto      end22
     c                   endif
      *
     c                   if        ravfir > w_firm
     c                   goto      end22
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l22h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l22                                          LINJE SKRIVES
      *
     c                   goto      les22
      *
     c     end22         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av virksomhet                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod23         begsr
      *
     c                   eval      w_wkod = *zeros
     c     key23         setll     ra23l1
      *
     c                   move      txt(24)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l23h
      *
     c     les23         tag
      *
     c                   read      ra23l1r                                10
     c                   if        *in10 = *on
     c                   goto      end23
     c                   endif
      *
     c                   if        rawfir > w_firm
     c                   goto      end23
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l23h
     c                   eval      *in30 = *off
     c                   enddo
      *
      * Hente inn kontotekst
      *
     c                   eval      p_text = *blank
      *
     c                   if        rawkto <> 0
     c                   move      rawavd        p_avde
     c                   move      rawkto        p_kont
     c                   move      rawsps        p_spes
     c                   call      'RS740R'                                      kontoplan-
     c                   parm                    p_stat
     c                   parm                    p_kont
     c                   parm                    p_spes
     c                   parm                    p_avde
     c                   parm                    p_text
      *
     c                   endif
      *
      * Hente inn bilagskodetekst
      *
     c                   move      rawbik        w_akod
      *
     c     key01         chain     ra01l1r                            61
      *
     c                   if        *in61 = *off                                          .....
     c                   move      raatxt        w_atxt                                      .
     c                   else                                                                .
     c                   eval      w_atxt = *blank                                           .
     c                   endif                                                           .....
      *
     c                   write     l23                                          LINJE SKRIVES
      *
     c                   goto      les23
      *
     c     end23         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av reklamasjonsårsak                     *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod24         begsr
      *
     c                   eval      w_vkod = *zeros
     c     key24         setll     ra24l1
      *
     c                   move      txt(25)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l24h
      *
     c     les24         tag
      *
     c                   read      ra24l1r                                10
     c                   if        *in10 = *on
     c                   goto      end24
     c                   endif
      *
     c                   if        raxfir > w_firm
     c                   goto      end24
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l24h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l24                                          LINJE SKRIVES
      *
     c                   goto      les24
      *
     c     end24         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av kjørerute                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod25         begsr
      *
     c                   eval      w_yrut = *zeros
     c     key25         setll     ra25l1
      *
     c                   move      txt(26)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l25h
      *
     c     les25         tag
      *
     c                   read      ra25l1r                                10
     c                   if        *in10 = *on
     c                   goto      end25
     c                   endif
      *
     c                   if        rayfir > w_firm
     c                   goto      end25
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l25h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l25                                          LINJE SKRIVES
      *
     c                   goto      les25
      *
     c     end25         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av produktansvarlig                      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod26         begsr
      *
     c                   eval      w_zsak = *zeros
     c     key26         setll     ra26l1
      *
     c                   move      txt(27)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l26h
      *
     c     les26         tag
      *
     c                   read      ra26l1r                                10
     c                   if        *in10 = *on
     c                   goto      end26
     c                   endif
      *
     c                   if        razfir > w_firm
     c                   goto      end26
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l26h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l26                                          LINJE SKRIVES
      *
     c                   goto      les26
      *
     c     end26         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av kostnadsbærergruppe                   *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod27         begsr
      *
E5.00c                   eval      w_agrp = *blanks
     c     key27         setll     ra27l1
      *
     c                   move      txt(28)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l27h
      *
     c     les27         tag
      *
     c                   read      ra27l1r                                10
     c                   if        *in10 = *on
     c                   goto      end27
     c                   endif
      *
     c                   if        reafir > w_firm
     c                   goto      end27
     c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l27h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l27                                          LINJE SKRIVES
      *
     c                   goto      les27
      *
     c     end27         endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for utskrift av kostnadsbærer                         *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     kod28         begsr
      *
     c                   eval      w_bgrp = *zeros
     c     key28         setll     ra28l1
      *
     c                   move      txt(29)       ktxt
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l28h
      *
     c     les28         tag
      *
     c                   read      ra28l1r                                10
     c                   if        *in10 = *on
     c                   goto      end28
     c                   endif
      *
     c                   if        rebfir > w_firm
     c                   goto      end28
     c                   endif
      *
T5.60 * Skal sperrede koder med?
      *
T5.60c                   if        l_pksp = 'N' and
T5.60c                             rebspr = 'J'
T5.60c                   goto      les28
T5.60c                   endif
      *
     c   30              do
     c                   eval      sider = sider + 1
     c                   write     head1                                        HEADING SKRIVES
     c                   write     l28h
     c                   eval      *in30 = *off
     c                   enddo
      *
     c                   write     l28                                          LINJE SKRIVES
      *
     c                   goto      les28
      *
     c     end28         endsr
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      * Legge inn firma-nummer
      *
     c                   move      l_firm        w_firm
      *
      * Hent firma-record
      *
     c     firkey        chain     afirl1                             60
      *
      * Key for firma-record
      *
     c     firkey        klist
     c                   kfld                    w_firm
      *
      * Key for statuskode 1
      *
     c     keya1         klist
     c                   kfld                    w_firm
      *
      * Key for statuskode 2
      *
     c     keya2         klist
     c                   kfld                    w_firm
      *
      * Key for statuskode 3
      *
     c     keya3         klist
     c                   kfld                    w_firm
      *
      * Key for statuskode 4
      *
     c     keya4         klist
     c                   kfld                    w_firm
     c                   kfld                    ra4aar
      *
      * Key for statuskode 5
      *
     c     keya5         klist
     c                   kfld                    w_firm
      *
      * Key for statuskode 6
      *
     c     keya6         klist
     c                   kfld                    w_firm
      *
      * Key for bilagskoder
      *
     c     key01         klist
     c                   kfld                    w_firm
     c                   kfld                    w_akod
      *
      * Key for betalingsmåte
      *
     c     key02         klist
     c                   kfld                    w_firm
     c                   kfld                    w_bkod
      *
      * Key for betalingsbetingelse
      *
     c     key03         klist
     c                   kfld                    w_firm
     c                   kfld                    w_ckod
      *
      * Key for faste konti
      *
     c     key04         klist
     c                   kfld                    w_firm
      *
      * Key for MVA-koder
      *
     c     key05         klist
     c                   kfld                    w_firm
     c                   kfld                    w_ekod
      *
      * Key for rabattgruppe
      *
     c     key06         klist
     c                   kfld                    w_firm
     c                   kfld                    w_fkod
      *
      * Key for avdeling
      *
     c     key07         klist
     c                   kfld                    w_firm
     c                   kfld                    w_gkod
      *
      * Key for distrikt
      *
     c     key08         klist
     c                   kfld                    w_firm
     c                   kfld                    w_hkod
      *
      * Key for selger
      *
     c     key09         klist
     c                   kfld                    w_firm
     c                   kfld                    w_ikod
      *
      * Key for lager
      *
     c     key10         klist
     c                   kfld                    w_firm
     c                   kfld                    w_jkod
      *
      * Key for kundekategori
      *
     c     key11         klist
     c                   kfld                    w_firm
     c                   kfld                    w_kkod
      *
      * Key for land
      *
     c     key12         klist
     c                   kfld                    w_firm
     c                   kfld                    w_lkod
      *
      * Key for fordelingsnøkler
      *
     c     key13         klist
     c                   kfld                    w_firm
     c                   kfld                    w_mkod
      *
      * Key for leverandørkategori
      *
     c     key14         klist
     c                   kfld                    w_firm
     c                   kfld                    w_nkod
      *
      * Key for mengde
      *
     c     key15         klist
     c                   kfld                    w_firm
     c                   kfld                    w_okod
      *
      * Key for valutakurser
      *
     c     key16         klist
     c                   kfld                    w_firm
     c                   kfld                    w_pkod
      *
      * Key for forsendelsesmåte
      *
     c     key17         klist
     c                   kfld                    w_firm
     c                   kfld                    w_qkod
      *
      * Key for leveringsbetingelse
      *
     c     key18         klist
     c                   kfld                    w_firm
     c                   kfld                    w_rkod
      *
      * Key for kontoklasse
      *
     c     key19         klist
     c                   kfld                    w_firm
     c                   kfld                    w_skod
      *
      * Key for kontogruppe
      *
     c     key20         klist
     c                   kfld                    w_firm
     c                   kfld                    w_tkod
      *
      * Key for aktivitet
      *
     c     key21         klist
     c                   kfld                    w_firm
     c                   kfld                    w_ukod
      *
      * Key for speditør
      *
     c     key22         klist
     c                   kfld                    w_firm
     c                   kfld                    w_vkod
      *
      * Key for virksomhet
      *
     c     key23         klist
     c                   kfld                    w_firm
     c                   kfld                    w_wkod
      *
      * Key for reklamasjonsårsak
      *
     c     key24         klist
     c                   kfld                    w_firm
     c                   kfld                    w_xkod
      *
      * Key for kjørerute
      *
     c     key25         klist
     c                   kfld                    w_firm
     c                   kfld                    w_yrut
      *
      * Key for produktansvarlig
      *
     c     key26         klist
     c                   kfld                    w_firm
     c                   kfld                    w_zsak
      *
      * Key for kostnadsbærergruppe
      *
     c     key27         klist
     c                   kfld                    w_firm
     c                   kfld                    w_agrp
      *
      * Key for kostnadsbærer
      *
     c     key28         klist
     c                   kfld                    w_firm
     c                   kfld                    w_bgrp
      *
     c                   endsr
      /eject
**
FIRMAOPPLYSNINGER                       00
BILAGSKODER                             01
BETALINGSMÅTE                           02
BETALINGSBETINGELSE                     03
FASTE KONTI                             04
MVA-KODER                               05
RABATTGRUPPE                            06
AVDELING                                07
DISTRIKT                                08
SELGER                                  09
LAGER                                   10
KUNDEKATEGORI                           11
LAND                                    12
FORDELINGSNØKLER                        13
LEVERANDØRKATEGORI                      14
MENGDE                                  15
VALUTAKURSER                            16
FORSENDELSEMÅTE                         17
LEVERINGSBETINGELSE                     18
KONTOKLASSER                            19
KONTOGRUPPER                            20
AKTIVITET                               21
SPEDITØR                                22
VIRKSOMHET                              23
REKLAMASJONSÅRSAK                       24
KJØRERUTE                               25
PRODUKTANSVARLIG                        26
KOSTNADSBÆRERGRUPPE                     27
KOSTNADSBÆRER                           28
**
UTGÅENDE MERVERDIAVGIFT......:          01
INNGÅENDE MERVERDIAVGIFT.....:          02
INVESTERINGSAVGIFT...........:          03
FYLKES-SKATTESJEFEN..........:          04
KONTO FOR KUNDER.............:          05
KONTO FOR LEVERANDØRER.......:          06
KONTO FOR KUNDE-RABATT.......:          07
FEILKONTO KUNDER.............:          08
FEILKONTO LEVERANDØRER.......:          09
FEILKONTO HOVEDBOK...........:          10
KONTO FOR RENTEINNTEKTER.....:          11
KONTO FOR AGIO...............:          12
KONTO FOR DISAGIO............:          13
KONTO FOR ØRE-AVRUNDING......:          14
KONTO FOR BANK...............:          15
KONTO FOR LEVERANDØR-RABATT..:          16
KONTO FOR KASSE..............:          17
PROSJEKTNR. (FEILP. NR.).....:          18
KONTO FOR POSTGIRO...........:          19
KONTO FOR BANKGEBYRER........:          20
ØVRE GRENSE HOVEDBOKSKONTO...:          21
ØVRE GRENSE KUNDEKONTO.......:          22
FACTORING-KUNDENR............:          23
LEDIG........................:          24
LEDIG........................:          25
