     h option(*nodebugio) datedit(*dmy)
     h decedit('0.')
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : RB003R
      * Beskrivelse . . : Leser linjer fra BOVF til kommaseparert til
      *                   (Business)
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * ----- ------ ---- -------------------------------------------------
      *       181012 nho  Visma  Business
6.22  * V6.20 051113 nho  Avstand mellom felter
6.23  * V6.20 141014 nho  Test på firma
6.24  * V6.20 120515 nho  Val.dato skal være lik bilagsdato
6.nu  * V6.30 230614 bof  sjekket mtp.nummerutvidelse
7.00  *K00 8.00 170321 sst Legger ut avdeling på salgsposteringene
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     fbovfl1    ip   e           k disk
     fsohel1    if   e           k disk    rename(sohepfr:sohel1r)
      *
      *
     frv02pf    o    e           k disk
      *
      * Definering av Local data area
      *
     d                uds
     d l_firm                944    946  0
      *
     d valdat          s                   like(bffdat)
     d nval08          s              8  0
     d nval04          s              4  0
     d nfor08          s              8  0
     d nfor04          s              4  0
     d nbil08          s              8  0
     d nbil04          s              4  0
     d tell            s              1  0
     d f1momd          s                   like(bfdmom)
     d f1momc          s                   like(bfcmom)
6.30 d f1avde          s                   like(soavde)
     d zfbelp          s             12  4
     d w_binr          s                   like(sobinr)
     d w_firm          s                   like(sofirm)
     d w_aarr          s                   like(soaarr)
      *
      * Datastruktur for valuteringsdato
     d                 ds
     d d_fdati                 1     10
     d  d_fa                   1      4
     d  d_f1                   5      5
     d  d_fn                   6      7
     d  d_f2                   8      8
     d  d_fd                   9     10
     d*
      * Nøkkel dato
     d                 ds
     d d_dati                  1     10
     d  d_aa                   1      4
     d  d_a1                   5      5
     d  d_mn                   6      7
     d  d_a2                   8      8
     d  d_dd                   9     10
      *
      *
      * Datastruktur for forfallsdato
     d                 ds
     d f_fdati                 1     10
     d  f_fa                   1      4
     d  f_f1                   5      5
     d  f_fn                   6      7
     d  f_f2                   8      8
     d  f_fd                   9     10
     d*
      *
      * Datastruktur for bilagsdato
     d                 ds
     d b_fdati                 1     10
     d  b_fa                   1      4
     d  b_f1                   5      5
     d  b_fn                   6      7
     d  b_f2                   8      8
     d  b_fd                   9     10
     d*
      *
      * Key for oppslag på faktura-hode-register
     c     sohel1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_aarr
     c                   kfld                    w_binr
      *
      *
6.23  *
6.23 c                   if        l_firm <> bffirm
6.23 c                   goto      slutt
6.23 c                   endif
     c* Heading for kjøring
     c                   if        tell   = 0
     c                   add       1             tell
     c                   eval      rvdata = *blank
     c                   eval      rvdata = %trim('@FIRM_BEGIN(2217)')
     c                   write     rv02pfr
      *
     c                   eval      rvdata = *blank
     c                   eval      rvdata = %trim('@IMPORT_METHOD(3)')
     c                   write     rv02pfr
      *
     c                   eval      rvdata = *blank
     c                   eval      rvdata = %trim('@WaBnd(Descr,ValDT)')
     c                   write     rv02pfr
      *
     c                   eval      rvdata = *blank
      *
      *
      * Dagense dato
     c                   time                    valdat
     c                   movel     valdat        d_fdati
     c                   movel     d_fa          nval08
     c                   movel     d_fn          nval04
     c                   move      d_fd          nval04
     c                   move      nval04        nval08
6.22 c                   eval      rvdata = %trim('"KREDITSYSTEM" "') +
     c                                      %char(nval08) +
     c                                      %trim('"')
     c                   write     rv02pfr
      *
     c                   eval      rvdata = *blank
     c                   eval      rvdata = %trim('@WaVo(VoNo,VoDt,') +
     c                                           ('ValDt,Votp,Txt,') +
     c                                           ('DbAcNo,DbTxcd,CrAcNo,') +
     c                                           ('CrTxCd,InvoNo,Am,R1,') +
     c                                           ('DueDt,Cid,R2)')
     c                   write     rv02pfr
      *
     c                   endif
      *
      ***********************************************************
     c
     c* Blanker felt
     c                   eval      d_dati  = *blanks
      *
     c                   move      bfbdat        d_dati
      *
      * Forfallsdato
     c                   movel     bffdat        f_fdati
     c                   movel     f_fa          nfor08
     c                   movel     f_fn          nfor04
     c                   move      f_fd          nfor04
     c                   move      nfor04        nfor08
      *
      * Bilagsdato
     c                   movel     bfbdat        b_fdati
     c                   movel     b_fa          nbil08
     c                   movel     b_fn          nbil04
     c                   move      b_fd          nbil04
     c                   move      nbil04        nbil08
     c*
      * Beløp skal legges ut med 4 desimaler
     c                   z-add     bfbelp        zfbelp
      * Legger ut detaljer fra bovf
      * Nullstiller
     c                   eval      f1momd = '0'
     c                   eval      f1momc = '0'
      *
     c                   exsr      control_init
     c                   if        bfdkto <> *zeros and
     c                             bfdkto >=  1000 and
     c                             bfdkto <=  9999
     c                   eval      f1momd = bfdmom
     c                   endif
      *
     c                   if        bfckto <> *zeros and
     c                             bfckto >=  1000 and
     c                             bfckto <=  9999
     c                   eval      f1momc = bfcmom
     c                   eval      f1momd = '0'
     c                   endif
7.00  *
7.00  *   Legger på avdeling fra SOHE
7.00  *
7.00 c                   eval      f1avde = *zeros
7.00  *
7.00 c                   if        not %eof(sohel1)
7.00 c                   eval      f1avde = soavde
7.00 c                   endif
      *
     c*
     c**********
     c                   eval      rvdata = *blank
      * Start
     c                   eval      rvdata = %trim('"') +
      * Bilagsnr.
     c                                     %char(bfbiln)     + '" "' +
      * Bil.dato
     c                                     %char(nbil08)     + '" "' +
      * Val.dat fra heading
6.24 c*                                    %char(nval08)    + '" "' +
6.24 c                                     %char(nbil08)    + '" "' +
      * Bil.type
     c                                     %char(bfbilk)     + '" "' +
      * Bil.tekst
     c                                     %trim(bftext)     + '" "' +
      * Deb.konto
     c                                     %char(bfdkto)     + '" "' +
      * Deb.mva kode
     c                                     %trim(f1momd)     + '" "' +
      *
      * Kredkonto
     c                                     %char(bfckto)     + '" "' +
      * Kredit mva kode
     c                                     %trim(f1momc)     + '" "' +
      * Fakturanr (Bilagsnummer)
     c                                     %char(bfbiln)     + '" "' +
      *
      * Beløp på linje
     c                                     %char(zfbelp)     + '" "' +
      * Avdeling?? Kan prosjekt legges her?
     c                                     %trim('" "') +
      * Forfallsdato
     c                                     %char(nfor08)    + '" "' +
      * Kid nr ???????
     c                                     %trim(sokidd)    + '" "' +
      * Prosjekt
     c                                     %trim(bfproj)    + '"'
      *
     c                   write     rv02pfr
      *
6.23 c     slutt         tag
      *
     c     dd999         tag
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     control_init  begsr
      *
     c                   eval      w_firm = bffirm
     c                   eval      w_binr = bfbiln
     c                   move      d_aa          w_aarr
      * Finner siste faktura-hode for faktura
      *
     c     sohel1_key    setll     sohel1
     c     sohel1_key    reade     sohel1                                 90
     c                   if        *in90 = *on
     c                   goto      avslutt
     c                   endif
      *
     c                   dow       *in90 = *off
     c     sohel1_key    reade     sohel1                                 90
     c                   enddo
      *
     c     avslutt       tag
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
