     h option(*nodebugio) datedit(*dmy)
     h decedit('0.')
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : RB009R
      * Beskrivelse . . : Leser linjer fra BOVF til kommaseparert til
      *                   (Business)
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * ----- ------ ---- -------------------------------------------------
      *       181012 nho  Visma  Business
6.22  * V6.20 051113 nho  Avstand mellom felter
6.23  * V6.20 141014 nho  Test på firma
6.30  * 210815 nho   Nytt program vedr summering Visma Business
7.00  * V7.00 260419 nho  Henter inn konvertering av bilagskode
7.01  * V7.00 240619 nho  Henter inn firm_begin
7.03  *       120521 mst  Henter avvikende momskode, hvis den finnes
8.00  *       050422 sst  Henter kidd med GETKIDD
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     fbobfut    ip   e           k disk
8.00 f**sohel1    if   e           k disk    rename(sohepfr:sohel1r)
7.00 frb10l1    if   e           k disk    rename(rb10pfr:rb10l1r)
7.03 frb00l1    if   e           k disk    rename(rb00pfr:rb00l1r)
      *
      *
     frv02pf    o    e           k disk
      *
      * Definering av Local data area
      *
     d                uds
     d l_firm                944    946  0
      *
     d valdat          s                   like(bffdat)
     d nval08          s              8  0
     d nval04          s              4  0
     d nfor08          s              8  0
     d nfor04          s              4  0
     d nbil08          s              8  0
     d nbil04          s              4  0
     d tell            s              1  0
7.00 d xxbilk          s              5  0
7.03 d*f1momd          s                   like(bfdmom)
7.03 d*f1momc          s                   like(bfcmom)
7.03 d f1momd          s                   like(r00nko)
7.03 d f1momc          s                   like(r00nko)
     d zfbelp          s             12  4
     d w_binr          s                   like(bfbiln)
     d w_firm          s              3  0
     d w_aarr          s              4  0
7.03 d rb00l1_gkod     s                   like(r00kod)
7.03 d w_type          s             10
8.00  *
8.00 d p_kidd          s             25
8.00 d p_kidr          s              9
      *
7.00  * Variabler for nøkler
7.00  *
7.00 d rb10l1_gkod     s                   like(raakod)
      *
      * Datastruktur for valuteringsdato
     d                 ds
     d d_fdati                 1     10
     d  d_fa                   1      4
     d  d_f1                   5      5
     d  d_fn                   6      7
     d  d_f2                   8      8
     d  d_fd                   9     10
     d*
      * Nøkkel dato
     d                 ds
     d d_dati                  1     10
     d  d_aa                   1      4
     d  d_a1                   5      5
     d  d_mn                   6      7
     d  d_a2                   8      8
     d  d_dd                   9     10
      *
      *
      * Datastruktur for forfallsdato
     d                 ds
     d f_fdati                 1     10
     d  f_fa                   1      4
     d  f_f1                   5      5
     d  f_fn                   6      7
     d  f_f2                   8      8
     d  f_fd                   9     10
     d*
      *
      * Datastruktur for bilagsdato
     d                 ds
     d b_fdati                 1     10
     d  b_fa                   1      4
     d  b_f1                   5      5
     d  b_fn                   6      7
     d  b_f2                   8      8
     d  b_fd                   9     10
     d*
      *
8.00  * Key for oppslag på faktura-hode-register
8.00 c*    sohel1_key    klist
8.00 c*                  kfld                    w_firm
8.00 c*                  kfld                    w_aarr
8.00 c*                  kfld                    w_binr
      *
7.00  * Key for posisjonering på bilagskoder
7.00  *
7.00 c     rb10l1_key    klist
7.00 c                   kfld                    w_firm
7.00 c                   kfld                    rb10l1_gkod
7.00  *
7.03  * Key for posisjonering på koder (moms)
7.03  *
7.03 c     rb00l1_key    klist
7.03 c                   kfld                    w_firm
7.03 c                   kfld                    w_type
7.03 c                   kfld                    rb00l1_gkod
      *
6.23  *
6.23 c                   if        l_firm <> bffirm
6.23 c                   goto      slutt
6.23 c                   endif
     c* Heading for kjøring
     c                   if        tell   = 0
     c                   add       1             tell
7.01 c                   read      rb10l1                                 90
     c                   eval      rvdata = *blank
7.01 c***                eval      rvdata = %trim('@FIRM_BEGIN(2217)')
7.01 c                   eval      rvdata = %trim('@FIRM_BEGIN(') +
7.01 c                                      %trim(rafirb) +
7.01 c                                      %trim(')')
     c                   write     rv02pfr
      *
     c                   eval      rvdata = *blank
     c                   eval      rvdata = %trim('@IMPORT_METHOD(3)')
     c                   write     rv02pfr
      *
     c                   eval      rvdata = *blank
     c                   eval      rvdata = %trim('@WaBnd(Descr,ValDT)')
     c                   write     rv02pfr
      *
     c                   eval      rvdata = *blank
      *
      *
      * Dagense dato
     c                   time                    valdat
     c                   movel     valdat        d_fdati
     c                   movel     d_fa          nval08
     c                   movel     d_fn          nval04
     c                   move      d_fd          nval04
     c                   move      nval04        nval08
6.22 c                   eval      rvdata = %trim('"KREDITSYSTEM" "') +
     c                                      %char(nval08) +
     c                                      %trim('"')
     c                   write     rv02pfr
      *
     c                   eval      rvdata = *blank
     c                   eval      rvdata = %trim('@WaVo(VoNo,VoDt,') +
     c                                           ('ValDt,Votp,Txt,') +
     c                                           ('DbAcNo,DbTxcd,CrAcNo,') +
     c                                           ('CrTxCd,InvoNo,Am,R1,') +
     c                                           ('DueDt,Cid,R2)')
     c                   write     rv02pfr
      *
     c                   endif
      *
      ***********************************************************
     c
     c* Blanker felt
     c                   eval      d_dati  = *blanks
      *
     c                   move      bfbdat        d_dati
      *
      * Forfallsdato
     c                   movel     bffdat        f_fdati
     c                   movel     f_fa          nfor08
     c                   movel     f_fn          nfor04
     c                   move      f_fd          nfor04
     c                   move      nfor04        nfor08
      *
      * Bilagsdato
     c                   movel     bfbdat        b_fdati
     c                   movel     b_fa          nbil08
     c                   movel     b_fn          nbil04
     c                   move      b_fd          nbil04
     c                   move      nbil04        nbil08
     c*
      * Beløp skal legges ut med 4 desimaler
     c                   z-add     bfbelp        zfbelp
      * Legger ut detaljer fra bovf
      * Nullstiller
7.03 c                   eval      f1momd = *blanks
7.03 c                   eval      f1momc = *blanks
      *
8.00  *  Henter ev kidd
8.00  *
8.00 c                   call      'GETKIDD'
8.00 c                   parm                    bfbiln
8.00 c                   parm                    bfbdat
8.00 c                   parm                    bfkref
8.00 c                   parm                    p_kidd
8.00 c                   parm                    p_kidr
      *
7.00  * Sjekker om bilagstype skal konverteres
7.00 c                   eval      xxbilk = bfbilk
7.00 c                   eval      rb10l1_gkod = bfbilk
7.00 c     rb10l1_key    chain     rb10l1
7.00 c                   if        %found
7.00 c                   eval      xxbilk = rankod
7.00 c                   endif
7.00  *
      *
     c                   if        bfdkto <> *zeros and
     c                             bfdkto >=  1000 and
     c                             bfdkto <=  9999
     c                   eval      f1momd = bfdmom
7.03  * Sjekker om momskode  skal konverteres
7.03 c                   eval      w_type      = 'MVAKODE'
7.03 c*                  move      f1momd        rb00l1_gkod
7.03 c                   move      bfdmom        rb00l1_gkod
7.03 c     rb00l1_key    chain     rb00l1
7.03 c                   if        %found
7.03 c*                  movel     r00nko        f1momd
7.03 c                   move      r00nko        f1momd
7.03 c                   endif
     c                   endif
      *
     c                   if        bfckto <> *zeros and
     c                             bfckto >=  1000 and
     c                             bfckto <=  9999
     c                   eval      f1momc = bfcmom
s.ss c**                 eval      f1momd = '0'
7.03  * Sjekker om momskode  skal konverteres
7.03 c                   eval      w_type      = 'MVAKODE'
7.03 c*                  move      f1momc        rb00l1_gkod
7.03 c                   move      bfcmom        rb00l1_gkod
7.03 c     rb00l1_key    chain     rb00l1
7.03 c                   if        %found
7.03 c*                  movel     r00nko        f1momc
7.03 c                   move      r00nko        f1momc
7.03 c                   endif
     c                   endif
      *
     c*
     c**********
     c                   eval      rvdata = *blank
      * Start
     c                   eval      rvdata = %trim('"') +
      * Bilagsnr.
     c                                     %char(bfbiln)     + '" "' +
      * Bil.dato
     c                                     %char(nbil08)     + '" "' +
      * Val.dat fra heading
     c                                     %char(nval08)    + '" "' +
      * Bil.type
7.00 c**                                   %char(bfbilk)     + '" "' +
7.00 c                                     %char(xxbilk)     + '" "' +
      * Bil.tekst
     c                                     %trim(bftext)     + '" "' +
      * Deb.konto
     c                                     %char(bfdkto)     + '" "' +
      * Deb.mva kode
s.ss c**                                   %trim(f1momd)     + '" "' +
s.ss c                                     %trim(f1momd)     + '" "' +
      *
      * Kredkonto
     c                                     %char(bfckto)     + '" "' +
      * Kredit mva kode
s.ss c**                                   %trim(f1momc)     + '" "' +
s.ss c                                     %trim(f1momc)     + '" "' +
      * Fakturanr (Bilagsnummer)
     c                                     %char(bfbiln)     + '" "' +
      *
      * Beløp på linje
     c                                     %char(zfbelp)     + '" "' +
      * Avdeling?? Kan prosjekt legges her?
     c                                     %trim('" "') +
      * Forfallsdato
     c                                     %char(nfor08)    + '" "' +
      * Kid nr ???????
8.00 c                                     %trim(p_kidd)    + '" "' +
      * Prosjekt
     c                                     %trim(bfproj)    + '"'
      *
     c                   write     rv02pfr
      *
      *
6.23 c     slutt         tag
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
