     h option(*nodebugio) datedit(*dmy)
     h decedit('0.')
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : RB012R
      * Beskrivelse . . : Leser linjer fra LOVF til kommaseparert til
      *                   (Uni Micro)
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * ----- ------ ---- -------------------------------------------------
      *       091120 sst  Nytt program  Une Micro
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     flovupf    ip   e           k disk
     frb10l1    if   e           k disk    rename(rb10pfr:rb10l1r)
     frb00l1    if   e           k disk    rename(rb00pfr:rb00l1r)
      *
      *
     frv03pf    o    e           k disk
      *
      * Definering av Local data area
      *
     d                uds
     d l_firm                944    946  0
      *
     d w_firm          s                   like(lgfirm)
     d w_type          s             10
     d valdat          s                   like(lgfdat)
     d nval08          s              8  0
     d nval04          s              4  0
     d nfor08          s              8  0
     d nfor04          s              4  0
     d nbil08          s              8  0
     d nbil04          s              4  0
     d tell            s              1  0
     d nbsfak          s              7  0
     d f1momd          s                   like(lgdmom)
     d f1momc          s                   like(lgcmom)
     d f1avde          s                   like(lgcavd)
     d zfbeld          s             12  4
     d zfbelc          s             12  4
     d xxbilk          s              5  0
     d xxmvad          s              3
     d xxmvac          s              3
     d rb10l1_gkod     s                   like(raakod)
     d rb00l1_gkod     s                   like(r00kod)
     d w_peri          s              2
     d w_forf          s              6  0
     d w_ffd           s              6  0
     d w_ffc           s              6  0
     d w_fdat          s              6  0
     d w_bdat          s              6  0
      *
      * Datastruktur for valuteringsdato
     d                 ds
     d d_fdati                 1     10
     d  d_fa                   1      4
     d  d_f1                   5      5
     d  d_fn                   6      7
     d  d_f2                   8      8
     d  d_fd                   9     10
     d*
      * Nøkkel dato
     d                 ds
     d d_dati                  1     10
     d  d_aa                   1      4
     d  d_a1                   5      5
     d  d_mn                   6      7
     d  d_a2                   8      8
     d  d_dd                   9     10
      *
      *
      * Datastruktur for forfallsdato
     d                 ds
     d f_fdati                 1     10
     d  f_fa                   1      4
     d  f_f1                   5      5
     d  f_fn                   6      7
     d  f_f2                   8      8
     d  f_fd                   9     10
     d*
      *
      * Datastruktur for bilagsdato
     d                 ds
     d b_fdati                 1     10
     d  b_fa                   1      4
     d  b_f1                   5      5
     d  b_fn                   6      7
     d  b_f2                   8      8
     d  b_fd                   9     10
     d*
      *
      * Key for posisjonering på bilagskoder
      *
     c     rb10l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rb10l1_gkod
      *
     c     rb00l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_type
     c                   kfld                    rb00l1_gkod
      *
     c                   if        l_firm <> lgfirm
     c                   goto      slutt
     c                   endif
      *
     c                   eval      rvdata = *blank
      *
      *___________________________________________________________
     c
     c* Blanker felt
     c                   eval      d_dati  = *blanks
     c                   eval      nbsfak = *zeros
     c                   movel     lgsfak        nbsfak
      *
     c                   move      lgbdat        d_dati
      *
      * Forfallsdato
     c     *dmy          move      lgfdat        w_fdat
      *
      * Bilagsdato
     c     *dmy          move      lgbdat        w_bdat
     c                   movel     lgperi        w_peri
     c*
      * Beløp skal legges ut med 4 desimaler
     c                   eval      zfbeld = lgbelp
     c                   eval      zfbelc = lgbelp -1
      * Legger ut detaljer fra bovf
      * Nullstiller
     c                   eval      f1momd = '0'
     c                   eval      f1momc = '0'
      *
     c                   exsr      control_init
      * Sjekker om bilagstype skal konverteres
     c                   eval      xxbilk = lgbilk
     c                   eval      rb10l1_gkod = lgbilk
     c     rb10l1_key    chain     rb10l1
     c                   if        %found
     c                   eval      xxbilk = rankod
     c                   endif
      *
      *
     c                   if        lgdkto >=  1000 and
     c                             lgdkto <=  9999
     c                   eval      f1momd = lgdmom
     c                   eval      f1momc = '0'
     c                   endif
      *
     c                   if        lgckto >=  1000 and
     c                             lgckto <=  9999
     c                   eval      f1momc = lgcmom
     c                   eval      f1momd = '0'
     c                   endif
      *
      * Sjekker om momskode  skal konverteres  debet
     c                   eval      xxmvad = f1momd
     c                   eval      w_type      = 'MVAKODE'
     c                   eval      rb00l1_gkod = f1momd
     c     rb00l1_key    chain     rb00l1
     c                   if        %found
     c                   eval      xxmvad = r00nko
     c                   endif
      *
      * Sjekker om momskode  skal konverteres  kredit
     c                   eval      xxmvac = f1momc
     c                   eval      rb00l1_gkod = f1momc
     c     rb00l1_key    chain     rb00l1
     c                   if        %found
     c                   eval      xxmvac = r00nko
     c                   endif
      *
     c*
     c**********
     c                   if        lgdkto > 0
     c                   eval      rvdata = *blank
      * Start
      * Recordart
     c                   eval      rvdata = '60'             + ',' +
      * Bilagsnr.
     c                                     %char(lgbiln)     + ',' +
      * Bil.dato
     c                                     %char(w_bdat)     + ',' +
      * Deb.konto
     c                                     %char(lgdkto)     + ',' +
      * Avdeling
     c                                     %char(lgdavd)     + ',' +
      * Prosjekt
     c                                     %trim(lgproj)     + ',' +
      * Deb.mva kode
     c                                     %trim(xxmvad)     + ',' +
      * Bil.tekst
     c                                     %trim(lgtext)     + ',' +
      * Beløp på linje
     c                                     %char(zfbeld)     + ',' +
      * Operatør
     c                                     'Uni'             + ',' +
      * Dim.5
     c                                     '0'               + ',' +
      * Dim.6
     c                                     '0'               + ',' +
      * Dim.7
     c                                     '0'               + ',' +
      * Dim.8
     c                                     '0'               + ',' +
      * Periode
     c                                     w_peri            + ',' +
      * Fakturanr (Bilagsnummer)
     c                                     %char(lgbiln)     + ',' +
      * Forfallsdato
     c                                     %char(w_fdat)     + ',' +
      * Valutakode
     c                                     %trim(lgvalk)     + ',' +
      * Valutabeløp
     c                                     '0'               + ',' +
      * Funksjon/Ansvar (dim3)
     c                                     '0'               + ',' +
      * Område          (dim4)
     c                                     '0'               + ','
      *
     c                   write     rv03pfr
     c                   endif
      * _____________________________________________________
     c                   if        lgckto > 0
     c                   eval      rvdata = *blank
      * Start
      * Recordart
     c                   eval      rvdata = '60'             + ',' +
      * Bilagsnr.
     c                                     %char(lgbiln)     + ',' +
      * Bil.dato
     c                                     %char(w_bdat)     + ',' +
      * Deb.konto
     c                                     %char(lgckto)     + ',' +
      * Avdeling
     c                                     %char(lgcavd)     + ',' +
      * Prosjekt
     c                                     %trim(lgproj)     + ',' +
      * Deb.mva kode
     c                                     %trim(xxmvac)     + ',' +
      * Bil.tekst
     c                                     %trim(lgtext)     + ',' +
      * Beløp på linje
     c                                     %char(zfbelc)     + ',' +
      * Operatør
     c                                     'Uni'             + ',' +
      * Dim.5
     c                                     '0'               + ',' +
      * Dim.6
     c                                     '0'               + ',' +
      * Dim.7
     c                                     '0'               + ',' +
      * Dim.8
     c                                     '0'               + ',' +
      * Periode
     c                                     w_peri            + ',' +
      * Fakturanr (Bilagsnummer)
     c                                     %char(lgbiln)     + ',' +
      * Forfallsdato
     c                                     %char(w_fdat)     + ',' +
      * Valutakode
     c                                     %trim(lgvalk)     + ',' +
      * Valutabeløp
     c                                     '0'               + ',' +
      * Funksjon/Ansvar (dim3)
     c                                     '0'               + ',' +
      * Område          (dim4)
     c                                     '0'               + ','
      *
     c                   write     rv03pfr
     c                   endif
      *
     c     slutt         tag
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     control_init  begsr
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
