     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
      *                                                                       *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RE602R                                              *
      * Beskrivelse . . : Saldo/budsjett til Trioplan - parameter             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     fre602d    cf   e             workstn
      *
     d                uds
     d pfirm                 300    302  0                                      Firma
     d pnavn                         30                                         Navn
     d puser                         10                                         BruerI
     d pdato                          6  0                                      Pr. da
     d praar                          4  0                                      Pr. år
     d pperf                          2  0                                      Period
     d ppert                          2  0                                      Period
     d pavdf                          4  0                                      Avd. f
     d pavdt                          4  0                                      Avd. t
     d prapp                          2  0                                      Rappor
     d psumm                          1                                         Avd.su
     d psums                          1                                         Avd.su
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d w_aar           s              4  0
     d w_mnd           s              2  0
     d w_in03          s              1
      *
     c/eject
      *
     c     a2taga        tag
      *
     c                   exfmt     a2bld
      *
     c                   eval      *in31 = *off
     c                   eval      *in32 = *off
     c                   eval      *in33 = *off
     c                   eval      *in34 = *off
     c                   eval      *in35 = *off
     c                   eval      *in36 = *off
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   eval      w_in03 = '1'                                     .
     c                   goto      slutt                                            .
     c                   endif                                                  .....
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c     *dmy          test(d)                 a2pkda                 33
     c                   if        *in33 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Kontroll av REGNSKAPSÅR
      *
     c                   if        a2prÅr > *year                                        .....
     c                   move      *on           *in32                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  PARAMETER - OK
      *
     c                   move      l_firm        pfirm
     c                   move      l_fnav        pnavn
     c                   move      a2pkda        pdato
     c                   move      a2prÅr        praar
     c                   move      *zeros        pperf
     c                   move      *zeros        ppert
     c                   move      *zeros        pavdf
     c                   move      *zeros        pavdt
     c                   move      *blank        psumm
     c                   move      *blank        psums
      *
     c     slutt         tag
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    w_in03
      *
     c                   move      udate         a2pkda
      *
      * Beregner periode
      *
     c                   eval      w_aar= *year
      *
     c     umonth        sub       1             w_mnd
     c                   if        w_mnd= *zero                                          .....
     c                   movel     12            w_mnd                                       .
     c     w_aar         sub       1             w_aar                                       .
     c                   move      w_aar         a2prÅr                                      .
     c                   else                                                                .
     c                   move      w_aar         a2prÅr                                      .
     c                   endif                                                           .....
      *
      * Parameterliste
      *
     c                   endsr
      *
