     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
      *                                                                       *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RE630R                                              *
      * Beskrivelse . . : Konteringsinformasjon til Nexstep Arkiv - Paramter  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      * R5.50     111007  Endret dimensjon slik at:                           *
      *                   01 = Avdeling                                       *
      *                   02 = Konto                                          *
      *                   03 = Kostnaadsbærer                                 *
      *                   04 = Prosjekt                                       *
      *                   05 = Aktivitet                                      *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     fre630d    cf   e             workstn
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d p_kont          s              1
     d p_avde          s              1
     d p_spes          s              1
     d p_pros          s              1
     d p_akti          s              1
      *
     d w_in03          s              1
      *
     c/eject
      *
     c     a2taga        tag
      *
     c                   exfmt     a2bld
      *
     c                   eval      *in31 = *off
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   eval      w_in03 = '1'                                     .
     c                   goto      slutt                                            .
     c                   endif                                                  .....
      *
      *  PARAMETER - OK
      *
     c                   eval      p_kont = a2kont
     c                   eval      p_avde = a2avde
     c                   eval      p_spes = a2spes
     c                   eval      p_pros = a2pros
     c                   eval      p_akti = a2akti
      *
     c                   call      'RE631R'
     c                   parm                    p_kont
     c                   parm                    p_avde
     c                   parm                    p_spes
     c                   parm                    p_pros
     c                   parm                    p_akti
      *
     c     slutt         tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    w_in03
      *
     c                   eval      a2kont = 'J'
     c                   eval      a2avde = 'J'
     c                   eval      a2spes = 'J'
     c                   eval      a2pros = 'J'
     c                   eval      a2akti = 'J'
      *
     c                   endsr
