     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
      *                                                                       *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RE632R                                              *
      * Beskrivelse . . : Skriver etiketter til Nexstep Arkiv                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     fre632d    cf   e             workstn
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d w_biln          s              6  0
     d w_firm          s              3  0
      *
     c/eject
      *
     c     a2taga        tag
      *
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   goto      slutt                                            .
     c                   endif                                                  .....
      *
      * Parameter
      *
     c                   eval      w_biln = a2bilf                              .....
      *
     c                   dow       w_biln < a2bilt + 1
      *
      * Skriv etikett for Nexstep Arkiv
      *
     c                   call      'RF011C'
     c                   parm                    w_firm
     c                   parm                    a2raar
     c                   parm                    w_biln
      *
     c                   eval      w_biln = w_biln + 1                          .....
     c                   enddo                                                  .....
      *
     c                   eval      a2bilf = 0                                   .....
     c                   eval      a2bilt = 0                                   .....
      *
     c                   goto      a2taga                                           .
      *
     c     slutt         tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      a2raar = *year
     c                   eval      w_firm = l_firm
      *
     c                   endsr
