      /TITLE  ASOKON Opprydding i filer
     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON
      * Program . . . . : RF405R
      * Beskrivelse . . : Flytte firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fraa1l1    if   e           k disk    rename(raa1pfr:raa1l1r)
     fraa1lu    o    e           k disk    rename(raa1pfr:raa1lur)
     fraa2l1    if   e           k disk    rename(raa2pfr:raa2l1r)
     fraa2lu    o    e           k disk    rename(raa2pfr:raa2lur)
     fraa3l1    if   e           k disk    rename(raa3pfr:raa3l1r)
     fraa3lu    o    e           k disk    rename(raa3pfr:raa3lur)
     fraa4l1    if   e           k disk    rename(raa4pfr:raa4l1r)
     fraa4lu    o    e           k disk    rename(raa4pfr:raa4lur)
     fraa5l1    if   e           k disk    rename(raa5pfr:raa5l1r)
     fraa5lu    o    e           k disk    rename(raa5pfr:raa5lur)
     fraa6l1    if   e           k disk    rename(raa6pfr:raa6l1r)
     fraa6lu    o    e           k disk    rename(raa6pfr:raa6lur)
     fraa7l1    if   e           k disk    rename(raa7pfr:raa7l1r)
     fraa7lu    o    e           k disk    rename(raa7pfr:raa7lur)
     fraa8l1    if   e           k disk    rename(raa8pfr:raa8l1r)
     fraa8lu    o    e           k disk    rename(raa8pfr:raa8lur)
      *
     fra01l1    if   e           k disk    rename(ra01pfr:ra01l1r)
     fra01lu    o    e           k disk    rename(ra01pfr:ra01lur)
     fra02l1    if   e           k disk    rename(ra02pfr:ra02l1r)
     fra02lu    o    e           k disk    rename(ra02pfr:ra02lur)
     fra03l1    if   e           k disk    rename(ra03pfr:ra03l1r)
     fra03lu    o    e           k disk    rename(ra03pfr:ra03lur)
     fra04l1    if   e           k disk    rename(ra04pfr:ra04l1r)
     fra04lu    o    e           k disk    rename(ra04pfr:ra04lur)
     fra05l1    if   e           k disk    rename(ra05pfr:ra05l1r)
     fra05lu    o    e           k disk    rename(ra05pfr:ra05lur)
     fra06l1    if   e           k disk    rename(ra06pfr:ra06l1r)
     fra06lu    o    e           k disk    rename(ra06pfr:ra06lur)
     fra07l1    if   e           k disk    rename(ra07pfr:ra07l1r)
     fra07lu    o    e           k disk    rename(ra07pfr:ra07lur)
     fra08l1    if   e           k disk    rename(ra08pfr:ra08l1r)
     fra08lu    o    e           k disk    rename(ra08pfr:ra08lur)
     fra09l1    if   e           k disk    rename(ra09pfr:ra09l1r)
     fra09lu    o    e           k disk    rename(ra09pfr:ra09lur)
     fra10l1    if   e           k disk    rename(ra10pfr:ra10l1r)
     fra10lu    o    e           k disk    rename(ra10pfr:ra10lur)
     fra11l1    if   e           k disk    rename(ra11pfr:ra11l1r)
     fra11lu    o    e           k disk    rename(ra11pfr:ra11lur)
     fra12l1    if   e           k disk    rename(ra12pfr:ra12l1r)
     fra12lu    o    e           k disk    rename(ra12pfr:ra12lur)
     fra13l1    if   e           k disk    rename(ra13pfr:ra13l1r)
     fra13lu    o    e           k disk    rename(ra13pfr:ra13lur)
     fra14l1    if   e           k disk    rename(ra14pfr:ra14l1r)
     fra14lu    o    e           k disk    rename(ra14pfr:ra14lur)
     fra15l1    if   e           k disk    rename(ra15pfr:ra15l1r)
     fra15lu    o    e           k disk    rename(ra15pfr:ra15lur)
     fra16l1    if   e           k disk    rename(ra16pfr:ra16l1r)
     fra16lu    o    e           k disk    rename(ra16pfr:ra16lur)
     fra17l1    if   e           k disk    rename(ra17pfr:ra17l1r)
     fra17lu    o    e           k disk    rename(ra17pfr:ra17lur)
     fra18l1    if   e           k disk    rename(ra18pfr:ra18l1r)
     fra18lu    o    e           k disk    rename(ra18pfr:ra18lur)
     fra19l1    if   e           k disk    rename(ra19pfr:ra19l1r)
     fra19lu    o    e           k disk    rename(ra19pfr:ra19lur)
     fra20l1    if   e           k disk    rename(ra20pfr:ra20l1r)
     fra20lu    o    e           k disk    rename(ra20pfr:ra20lur)
     fra21l1    if   e           k disk    rename(ra21pfr:ra21l1r)
     fra21lu    o    e           k disk    rename(ra21pfr:ra21lur)
     fra22l1    if   e           k disk    rename(ra22pfr:ra22l1r)
     fra22lu    o    e           k disk    rename(ra22pfr:ra22lur)
     fra23l1    if   e           k disk    rename(ra23pfr:ra23l1r)
     fra23lu    o    e           k disk    rename(ra23pfr:ra23lur)
     fra24l1    if   e           k disk    rename(ra24pfr:ra24l1r)
     fra24lu    o    e           k disk    rename(ra24pfr:ra24lur)
     fra25l1    if   e           k disk    rename(ra25pfr:ra25l1r)
     fra25lu    o    e           k disk    rename(ra25pfr:ra25lur)
     fra26l1    if   e           k disk    rename(ra26pfr:ra26l1r)
     fra26lu    o    e           k disk    rename(ra26pfr:ra26lur)
     fra27l1    if   e           k disk    rename(ra27pfr:ra27l1r)
     fra27lu    o    e           k disk    rename(ra27pfr:ra27lur)
     fra28l1    if   e           k disk    rename(ra28pfr:ra28l1r)
     fra28lu    o    e           k disk    rename(ra28pfr:ra28lur)
     fra70l1    if   e           k disk    rename(ra70pfr:ra70l1r)
     fra70lu    o    e           k disk    rename(ra70pfr:ra70lur)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
     d w_firm          s              3  0
      *
      * Statuskoder
      *
     c     raa1l1_key    setll     raa1l1                                 90
     c     raa1l1_key    reade     raa1l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ra1fir = w_firm
     c                   write     raa1lur
     c     raa1l1_key    reade     raa1l1                                 90
     c                   enddo
      *
     c     raa2l1_key    setll     raa2l1                                 90
     c     raa2l1_key    reade     raa2l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ra2fir = w_firm
     c                   write     raa2lur
     c     raa2l1_key    reade     raa2l1                                 90
     c                   enddo
      *
     c     raa3l1_key    setll     raa3l1                                 90
     c     raa3l1_key    reade     raa3l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ra3fir = w_firm
     c                   write     raa3lur
     c     raa3l1_key    reade     raa3l1                                 90
     c                   enddo
      *
     c     raa4l1_key    setll     raa4l1                                 90
     c     raa4l1_key    reade     raa4l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ra4fir = w_firm
     c                   write     raa4lur
     c     raa4l1_key    reade     raa4l1                                 90
     c                   enddo
      *
     c     raa5l1_key    setll     raa5l1                                 90
     c     raa5l1_key    reade     raa5l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ra5fir = w_firm
     c                   write     raa5lur
     c     raa5l1_key    reade     raa5l1                                 90
     c                   enddo
      *
     c     raa6l1_key    setll     raa6l1                                 90
     c     raa6l1_key    reade     raa6l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ra6fir = w_firm
     c                   write     raa6lur
     c     raa6l1_key    reade     raa6l1                                 90
     c                   enddo
      *
     c     raa7l1_key    setll     raa7l1                                 90
     c     raa7l1_key    reade     raa7l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ra7fir = w_firm
     c                   write     raa7lur
     c     raa7l1_key    reade     raa7l1                                 90
     c                   enddo
      *
     c     raa8l1_key    setll     raa8l1                                 90
     c     raa8l1_key    reade     raa8l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ra8fir = w_firm
     c                   write     raa8lur
     c     raa8l1_key    reade     raa8l1                                 90
     c                   enddo
      *
      * Bilagskoder
      *
     c     ra01l1_key    setll     ra01l1                                 90
     c     ra01l1_key    reade     ra01l1                                 90
     c                   dow       *in90 = *off
     c                   eval      raafir = w_firm
     c                   write     ra01lur
     c     ra01l1_key    reade     ra01l1                                 90
     c                   enddo
      *
      * Betalingsmåter
      *
     c     ra02l1_key    setll     ra02l1                                 90
     c     ra02l1_key    reade     ra02l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rabfir = w_firm
     c                   write     ra02lur
     c     ra02l1_key    reade     ra02l1                                 90
     c                   enddo
      *
      * Betalingsbetingelser
      *
     c     ra03l1_key    setll     ra03l1                                 90
     c     ra03l1_key    reade     ra03l1                                 90
     c                   dow       *in90 = *off
     c                   eval      racfir = w_firm
     c                   write     ra03lur
     c     ra03l1_key    reade     ra03l1                                 90
     c                   enddo
      *
      * Faste konti
      *
     c     ra04l1_key    setll     ra04l1                                 90
     c     ra04l1_key    reade     ra04l1                                 90
     c                   dow       *in90 = *off
     c                   eval      radfir = w_firm
     c                   write     ra04lur
     c     ra04l1_key    reade     ra04l1                                 90
     c                   enddo
      *
      * MVA koder
      *
     c     ra05l1_key    setll     ra05l1                                 90
     c     ra05l1_key    reade     ra05l1                                 90
     c                   dow       *in90 = *off
     c                   eval      raefir = w_firm
     c                   write     ra05lur
     c     ra05l1_key    reade     ra05l1                                 90
     c                   enddo
      *
      * Rabattkategori
      *
     c     ra06l1_key    setll     ra06l1                                 90
     c     ra06l1_key    reade     ra06l1                                 90
     c                   dow       *in90 = *off
     c                   eval      raffir = w_firm
     c                   write     ra06lur
     c     ra06l1_key    reade     ra06l1                                 90
     c                   enddo
      *
      * Avdeling
      *
     c     ra07l1_key    setll     ra07l1                                 90
     c     ra07l1_key    reade     ra07l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ragfir = w_firm
     c                   write     ra07lur
     c     ra07l1_key    reade     ra07l1                                 90
     c                   enddo
      *
      * Distrikt
      *
     c     ra08l1_key    setll     ra08l1                                 90
     c     ra08l1_key    reade     ra08l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rahfir = w_firm
     c                   write     ra08lur
     c     ra08l1_key    reade     ra08l1                                 90
     c                   enddo
      *
      * Selger
      *
     c     ra09l1_key    setll     ra09l1                                 90
     c     ra09l1_key    reade     ra09l1                                 90
     c                   dow       *in90 = *off
     c                   eval      raifir = w_firm
     c                   write     ra09lur
     c     ra09l1_key    reade     ra09l1                                 90
     c                   enddo
      *
      * Lager
      *
     c     ra10l1_key    setll     ra10l1                                 90
     c     ra10l1_key    reade     ra10l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rajfir = w_firm
     c                   write     ra10lur
     c     ra10l1_key    reade     ra10l1                                 90
     c                   enddo
      *
      * Kundekategori
      *
     c     ra11l1_key    setll     ra11l1                                 90
     c     ra11l1_key    reade     ra11l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rakfir = w_firm
     c                   write     ra11lur
     c     ra11l1_key    reade     ra11l1                                 90
     c                   enddo
      *
      * Land
      *
     c     ra12l1_key    setll     ra12l1                                 90
     c     ra12l1_key    reade     ra12l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ralfir = w_firm
     c                   write     ra12lur
     c     ra12l1_key    reade     ra12l1                                 90
     c                   enddo
      *
      * Fordelingsnøkler
      *
     c     ra13l1_key    setll     ra13l1                                 90
     c     ra13l1_key    reade     ra13l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ramfir = w_firm
     c                   write     ra13lur
     c     ra13l1_key    reade     ra13l1                                 90
     c                   enddo
      *
      * Leverandørkategori
      *
     c     ra14l1_key    setll     ra14l1                                 90
     c     ra14l1_key    reade     ra14l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ranfir = w_firm
     c                   write     ra14lur
     c     ra14l1_key    reade     ra14l1                                 90
     c                   enddo
      *
      * Mengde
      *
     c     ra15l1_key    setll     ra15l1                                 90
     c     ra15l1_key    reade     ra15l1                                 90
     c                   dow       *in90 = *off
     c                   eval      raofir = w_firm
     c                   write     ra15lur
     c     ra15l1_key    reade     ra15l1                                 90
     c                   enddo
      *
      * Valuta
      *
     c     ra16l1_key    setll     ra16l1                                 90
     c     ra16l1_key    reade     ra16l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rapfir = w_firm
     c                   write     ra16lur
     c     ra16l1_key    reade     ra16l1                                 90
     c                   enddo
      *
      * Forsendelsesmåte
      *
     c     ra17l1_key    setll     ra17l1                                 90
     c     ra17l1_key    reade     ra17l1                                 90
     c                   dow       *in90 = *off
     c                   eval      raqfir = w_firm
     c                   write     ra17lur
     c     ra17l1_key    reade     ra17l1                                 90
     c                   enddo
      *
      * Leveringsbetingelse
      *
     c     ra18l1_key    setll     ra18l1                                 90
     c     ra18l1_key    reade     ra18l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rarfir = w_firm
     c                   write     ra18lur
     c     ra18l1_key    reade     ra18l1                                 90
     c                   enddo
      *
      * Kontoklasse
      *
     c     ra19l1_key    setll     ra19l1                                 90
     c     ra19l1_key    reade     ra19l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rasfir = w_firm
     c                   write     ra19lur
     c     ra19l1_key    reade     ra19l1                                 90
     c                   enddo
      *
      * Kontogruppe
      *
     c     ra20l1_key    setll     ra20l1                                 90
     c     ra20l1_key    reade     ra20l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ratfir = w_firm
     c                   write     ra20lur
     c     ra20l1_key    reade     ra20l1                                 90
     c                   enddo
      *
      * Aktivitet
      *
     c     ra21l1_key    setll     ra21l1                                 90
     c     ra21l1_key    reade     ra21l1                                 90
     c                   dow       *in90 = *off
     c                   eval      raufir = w_firm
     c                   write     ra21lur
     c     ra21l1_key    reade     ra21l1                                 90
     c                   enddo
      *
      * Speditør
      *
     c     ra22l1_key    setll     ra22l1                                 90
     c     ra22l1_key    reade     ra22l1                                 90
     c                   dow       *in90 = *off
     c                   eval      ravfir = w_firm
     c                   write     ra22lur
     c     ra22l1_key    reade     ra22l1                                 90
     c                   enddo
      *
      * Virksomhet
      *
     c     ra23l1_key    setll     ra23l1                                 90
     c     ra23l1_key    reade     ra23l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rawfir = w_firm
     c                   write     ra23lur
     c     ra23l1_key    reade     ra23l1                                 90
     c                   enddo
      *
      * Reklamasjonsårsak
      *
     c     ra24l1_key    setll     ra24l1                                 90
     c     ra24l1_key    reade     ra24l1                                 90
     c                   dow       *in90 = *off
     c                   eval      raxfir = w_firm
     c                   write     ra24lur
     c     ra24l1_key    reade     ra24l1                                 90
     c                   enddo
      *
      * Kjørerute
      *
     c     ra25l1_key    setll     ra25l1                                 90
     c     ra25l1_key    reade     ra25l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rayfir = w_firm
     c                   write     ra25lur
     c     ra25l1_key    reade     ra25l1                                 90
     c                   enddo
      *
      * Produktansvarlig
      *
     c     ra26l1_key    setll     ra26l1                                 90
     c     ra26l1_key    reade     ra26l1                                 90
     c                   dow       *in90 = *off
     c                   eval      razfir = w_firm
     c                   write     ra26lur
     c     ra26l1_key    reade     ra26l1                                 90
     c                   enddo
      *
      * Kostnadsbærergruppe
      *
     c     ra27l1_key    setll     ra27l1                                 90
     c     ra27l1_key    reade     ra27l1                                 90
     c                   dow       *in90 = *off
     c                   eval      reafir = w_firm
     c                   write     ra27lur
     c     ra27l1_key    reade     ra27l1                                 90
     c                   enddo
      *
      * Kostnadsbærer
      *
     c     ra28l1_key    setll     ra28l1                                 90
     c     ra28l1_key    reade     ra28l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rebfir = w_firm
     c                   write     ra28lur
     c     ra28l1_key    reade     ra28l1                                 90
     c                   enddo
      *
      * Formulartekster
      *
     c     ra70l1_key    setll     ra70l1                                 90
     c     ra70l1_key    reade     ra70l1                                 90
     c                   dow       *in90 = *off
     c                   eval      r70fir = w_firm
     c                   write     ra70lur
     c     ra70l1_key    reade     ra70l1                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    w_firm
      *
     c     raa1l1_key    klist
     c                   kfld                    l_firm
      *
     c     raa2l1_key    klist
     c                   kfld                    l_firm
      *
     c     raa3l1_key    klist
     c                   kfld                    l_firm
      *
     c     raa4l1_key    klist
     c                   kfld                    l_firm
      *
     c     raa5l1_key    klist
     c                   kfld                    l_firm
      *
     c     raa6l1_key    klist
     c                   kfld                    l_firm
      *
     c     raa7l1_key    klist
     c                   kfld                    l_firm
      *
     c     raa8l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra01l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra02l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra03l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra04l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra05l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra06l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra07l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra08l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra09l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra10l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra11l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra12l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra13l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra14l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra15l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra16l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra17l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra18l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra19l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra20l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra21l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra22l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra23l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra24l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra25l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra26l1_key    klist
     c                   kfld                    l_firm
      *
      *
     c     ra27l1_key    klist
     c                   kfld                    l_firm
      *
      *
     c     ra28l1_key    klist
     c                   kfld                    l_firm
      *
     c     ra70l1_key    klist
     c                   kfld                    l_firm
      *
     c                   endsr
