      /TITLE  ASOKON Opprydding i filer
     h option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON
      * Program . . . . : Rf402R
      * Beskrivelse . . : Slette firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fraa1lu    uf   e           k disk
     fraa2lu    uf   e           k disk
     fraa3lu    uf   e           k disk
     fraa4lu    uf   e           k disk
     fraa5lu    uf   e           k disk
     fraa6lu    uf   e           k disk
     fraa7lu    uf   e           k disk
      *
     fra01lu    uf   e           k disk
     fra02lu    uf   e           k disk
     fra03lu    uf   e           k disk
     fra04lu    uf   e           k disk
     fra05lu    uf   e           k disk
     fra06lu    uf   e           k disk
     fra07lu    uf   e           k disk
     fra08lu    uf   e           k disk
     fra09lu    uf   e           k disk
     fra10lu    uf   e           k disk
     fra11lu    uf   e           k disk
     fra12lu    uf   e           k disk
     fra13lu    uf   e           k disk
     fra14lu    uf   e           k disk
     fra15lu    uf   e           k disk
     fra16lu    uf   e           k disk
     fra17lu    uf   e           k disk
     fra18lu    uf   e           k disk
     fra19lu    uf   e           k disk
     fra20lu    uf   e           k disk
     fra21lu    uf   e           k disk
     fra22lu    uf   e           k disk
     fra23lu    uf   e           k disk
     fra24lu    uf   e           k disk
     fra25lu    uf   e           k disk
     fra26lu    uf   e           k disk
     fra27lu    uf   e           k disk
     fra28lu    uf   e           k disk
     fra70lu    uf   e           k disk
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
      * Statuskoder
      *
     c                   read      raa1lu                                 90
     c                   dow       *in90 = *off
     c                   if        ra1fir = l_firm
     c                   delete    raa1pfr
     c                   endif
     c                   read      raa1lu                                 90
     c                   enddo
      *
     c                   read      raa2lu                                 90
     c                   dow       *in90 = *off
     c                   if        ra2fir = l_firm
     c                   delete    raa2pfr
     c                   endif
     c                   read      raa2lu                                 90
     c                   enddo
      *
     c                   read      raa3lu                                 90
     c                   dow       *in90 = *off
     c                   if        ra3fir =  l_firm
     c                   delete    raa3pfr
     c                   endif
     c                   read      raa3lu                                 90
     c                   enddo
      *
     c                   read      raa4lu                                 90
     c                   dow       *in90 = *off
     c                   if        ra4fir = l_firm
     c                   delete    raa4pfr
     c                   endif
     c                   read      raa4lu                                 90
     c                   enddo
      *
     c                   read      raa5lu                                 90
     c                   dow       *in90 = *off
     c                   if        ra5fir = l_firm
     c                   delete    raa5pfr
     c                   endif
     c                   read      raa5lu                                 90
     c                   enddo
      *
     c                   read      raa6lu                                 90
     c                   dow       *in90 = *off
     c                   if        ra6fir = l_firm
     c                   delete    raa6pfr
     c                   endif
     c                   read      raa6lu                                 90
     c                   enddo
      *
     c                   read      raa7lu                                 90
     c                   dow       *in90 = *off
     c                   if        ra7fir = l_firm
     c                   delete    raa7pfr
     c                   endif
     c                   read      raa7lu                                 90
     c                   enddo
      *
      * Bilagskoder
      *
     c                   read      ra01lu                                 90
     c                   dow       *in90 = *off
     c                   if        raafir = l_firm
     c                   delete    ra01pfr
     c                   endif
     c                   read      ra01lu                                 90
     c                   enddo
      *
      * Betalingsmåter
      *
     c                   read      ra02lu                                 90
     c                   dow       *in90 = *off
     c                   if        rabfir = l_firm
     c                   delete    ra02pfr
     c                   endif
     c                   read      ra02lu                                 90
     c                   enddo
      *
      * Betalingsbetingelser
      *
     c                   read      ra03lu                                 90
     c                   dow       *in90 = *off
     c                   if        racfir = l_firm
     c                   delete    ra03pfr
     c                   endif
     c                   read      ra03lu                                 90
     c                   enddo
      *
      * Faste konti
      *
     c                   read      ra04lu                                 90
     c                   dow       *in90 = *off
     c                   if        radfir = l_firm
     c                   delete    ra04pfr
     c                   endif
     c                   read      ra04lu                                 90
     c                   enddo
      *
      * MVA koder
      *
     c                   read      ra05lu                                 90
     c                   dow       *in90 = *off
     c                   if        raefir = l_firm
     c                   delete    ra05pfr
     c                   endif
     c                   read      ra05lu                                 90
     c                   enddo
      *
      * Rabattkategori
      *
     c                   read      ra06lu                                 90
     c                   dow       *in90 = *off
     c                   if        raffir = l_firm
     c                   delete    ra06pfr
     c                   endif
     c                   read      ra06lu                                 90
     c                   enddo
      *
      * Avdeling
      *
     c                   read      ra07lu                                 90
     c                   dow       *in90 = *off
     c                   if        ragfir = l_firm
     c                   delete    ra07pfr
     c                   endif
     c                   read      ra07lu                                 90
     c                   enddo
      *
      * Distrikt
      *
     c                   read      ra08lu                                 90
     c                   dow       *in90 = *off
     c                   if        rahfir = l_firm
     c                   delete    ra08pfr
     c                   endif
     c                   read      ra08lu                                 90
     c                   enddo
      *
      * Selger
      *
     c                   read      ra09lu                                 90
     c                   dow       *in90 = *off
     c                   if        raifir = l_firm
     c                   delete    ra09pfr
     c                   endif
     c                   read      ra09lu                                 90
     c                   enddo
      *
      * Lager
      *
     c                   read      ra10lu                                 90
     c                   dow       *in90 = *off
     c                   if        rajfir = l_firm
     c                   delete    ra10pfr
     c                   endif
     c                   read      ra10lu                                 90
     c                   enddo
      *
      * Kundekategori
      *
     c                   read      ra11lu                                 90
     c                   dow       *in90 = *off
     c                   if        rakfir = l_firm
     c                   delete    ra11pfr
     c                   endif
     c                   read      ra11lu                                 90
     c                   enddo
      *
      * Land
      *
     c                   read      ra12lu                                 90
     c                   dow       *in90 = *off
     c                   if        ralfir = l_firm
     c                   delete    ra12pfr
     c                   endif
     c                   read      ra12lu                                 90
     c                   enddo
      *
      * Fordelingsnøkler
      *
     c                   read      ra13lu                                 90
     c                   dow       *in90 = *off
     c                   if        ramfir = l_firm
     c                   delete    ra13pfr
     c                   endif
     c                   read      ra13lu                                 90
     c                   enddo
      *
      * Leverandørkategori
      *
     c                   read      ra14lu                                 90
     c                   dow       *in90 = *off
     c                   if        ranfir = l_firm
     c                   delete    ra14pfr
     c                   endif
     c                   read      ra14lu                                 90
     c                   enddo
      *
      * Mengde
      *
     c                   read      ra15lu                                 90
     c                   dow       *in90 = *off
     c                   if        raofir = l_firm
     c                   delete    ra15pfr
     c                   endif
     c                   read      ra15lu                                 90
     c                   enddo
      *
      * Valuta
      *
     c                   read      ra16lu                                 90
     c                   dow       *in90 = *off
     c                   if        rapfir = l_firm
     c                   delete    ra16pfr
     c                   endif
     c                   read      ra16lu                                 90
     c                   enddo
      *
      * Forsendelsesmåte
      *
     c                   read      ra17lu                                 90
     c                   dow       *in90 = *off
     c                   if        raqfir = l_firm
     c                   delete    ra17pfr
     c                   endif
     c                   read      ra17lu                                 90
     c                   enddo
      *
      * Leveringsbetingelse
      *
     c                   read      ra18lu                                 90
     c                   dow       *in90 = *off
     c                   if        rarfir = l_firm
     c                   delete    ra18pfr
     c                   endif
     c                   read      ra18lu                                 90
     c                   enddo
      *
      * Kontoklasse
      *
     c                   read      ra19lu                                 90
     c                   dow       *in90 = *off
     c                   if        rasfir = l_firm
     c                   delete    ra19pfr
     c                   endif
     c                   read      ra19lu                                 90
     c                   enddo
      *
      * Kontogruppe
      *
     c                   read      ra20lu                                 90
     c                   dow       *in90 = *off
     c                   if        ratfir = l_firm
     c                   delete    ra20pfr
     c                   endif
     c                   read      ra20lu                                 90
     c                   enddo
      *
      * Aktivitet
      *
     c                   read      ra21lu                                 90
     c                   dow       *in90 = *off
     c                   if        raufir = l_firm
     c                   delete    ra21pfr
     c                   endif
     c                   read      ra21lu                                 90
     c                   enddo
      *
      * Speditør
      *
     c                   read      ra22lu                                 90
     c                   dow       *in90 = *off
     c                   if        ravfir = l_firm
     c                   delete    ra22pfr
     c                   endif
     c                   read      ra22lu                                 90
     c                   enddo
      *
      * Virksomhet
      *
     c                   read      ra23lu                                 90
     c                   dow       *in90 = *off
     c                   if        rawfir = l_firm
     c                   delete    ra23pfr
     c                   endif
     c                   read      ra23lu                                 90
     c                   enddo
      *
      * Reklamasjonsårsak
      *
     c                   read      ra24lu                                 90
     c                   dow       *in90 = *off
     c                   if        raxfir = l_firm
     c                   delete    ra24pfr
     c                   endif
     c                   read      ra24lu                                 90
     c                   enddo
      *
      * Kjørerute
      *
     c                   read      ra25lu                                 90
     c                   dow       *in90 = *off
     c                   if        rayfir = l_firm
     c                   delete    ra25pfr
     c                   endif
     c                   read      ra25lu                                 90
     c                   enddo
      *
      * Produktansvarlig
      *
     c                   read      ra26lu                                 90
     c                   dow       *in90 = *off
     c                   if        razfir = l_firm
     c                   delete    ra26pfr
     c                   endif
     c                   read      ra26lu                                 90
     c                   enddo
      *
      * Kostnadsbærergruppe
      *
     c                   read      ra27lu                                 90
     c                   dow       *in90 = *off
     c                   if        reafir = l_firm
     c                   delete    ra27pfr
     c                   endif
     c                   read      ra27lu                                 90
     c                   enddo
      *
      * Kostnadsbærer
      *
     c                   read      ra28lu                                 90
     c                   dow       *in90 = *off
     c                   if        rebfir = l_firm
     c                   delete    ra28pfr
     c                   endif
     c                   read      ra28lu                                 90
     c                   enddo
      *
      * Formulartekster
      *
     c                   read      ra70lu                                 90
     c                   dow       *in90 = *off
     c                   if        r70fir = l_firm
     c                   delete    ra70pfr
     c                   endif
     c                   read      ra70lu                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
