      /TITLE  ASOKON Opprydding i filer
     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON
      * Program . . . . : RF406R
      * Beskrivelse . . : Flytte firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
6.20  *       280314 NHO  Kun regkompilert pga fil RFOS......
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
T5.40 * V5.40 150605 HFL  Leser RKLAL1 i stedet for RKLAPF.
6.10  * V6.10 210909 BSA  Lagt inn sporingsfelter for utvalgte OKO filer.
6.11  * V6.10 060510 BSA  Endret sporingsfunksjonalitet
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     frfobl1    if   e           k disk    rename(rforpfr:rfobl1r)
     frfoblu    o    e           k disk    rename(rforpfr:rfoblur)
     frforl1    if   e           k disk    rename(rforpfr:rforl1r)
     frforlu    o    e           k disk    rename(rforpfr:rforlur)
     frfosl1    if   e           k disk    rename(rforpfr:rfosl1r)
     frfoslu    o    e           k disk    rename(rforpfr:rfoslur)
     frhovl1    if   e           k disk    rename(rhovpfr:rhovl1r)
     frhovlu    o    e           k disk    rename(rhovpfr:rhovlur)
     frhsal1    if   e           k disk    rename(rhsapfr:rhsal1r)
     frhsalu    o    e           k disk    rename(rhsapfr:rhsalur)
     frhtrl1    if   e           k disk    rename(rhtrpfr:rhtrl1r)
     frhtrlu    o    e           k disk    rename(rhtrpfr:rhtrlur)
E5.40frklal1    if   e           k disk    rename(rklapfr:rklal1r)
     frklalu    o    e           k disk    rename(rklapfr:rklalur)
     frksal1    if   e           k disk    rename(rksapfr:rksal1r)
     frksalu    o    e           k disk    rename(rksapfr:rksalur)
     frksol1    if   e           k disk    rename(rksopfr:rksol1r)
     frksolu    o    e           k disk    rename(rksopfr:rksolur)
     frktrl1    if   e           k disk    rename(rktrpfr:rktrl1r)
     frktrlu    o    e           k disk    rename(rktrpfr:rktrlur)
     frkunl1    if   e           k disk    rename(rkunpfr:rkunl1r)
     frkunlu    o    e           k disk    rename(rkunpfr:rkunlur)
     frlbapf    if   e           k disk    rename(rlbapfr:rlbapfr)
     frlbalu    o    e           k disk    rename(rlbapfr:rlbalur)
     frlsol1    if   e           k disk    rename(rlsopfr:rlsol1r)
     frlsolu    o    e           k disk    rename(rlsopfr:rlsolur)
     frltrl1    if   e           k disk    rename(rltrpfr:rltrl1r)
     frltrlu    o    e           k disk    rename(rltrpfr:rltrlur)
     frlevl1    if   e           k disk    rename(rlevpfr:rlevl1r)
     frlevlu    o    e           k disk    rename(rlevpfr:rlevlur)
     frrf0l1    if   e           k disk    rename(rrf0pfr:rrf0l1r)
     frrf0lu    o    e           k disk    rename(rrf0pfr:rrf0lur)
     frrf5l1    if   e           k disk    rename(rrf5pfr:rrf5l1r)
     frrf5lu    o    e           k disk    rename(rrf5pfr:rrf5lur)
     frrf8l1    if   e           k disk    rename(rrf8pfr:rrf8l1r)
     frrf8lu    o    e           k disk    rename(rrf8pfr:rrf8lur)
     frrf9l1    if   e           k disk    rename(rrf9pfr:rrf9l1r)
     frrf9lu    o    e           k disk    rename(rrf9pfr:rrf9lur)
     frzuml1    if   e           k disk    rename(rzumpfr:rzuml1r)
     frzumlu    o    e           k disk    rename(rzumpfr:rzumlur)
     frca0l1    if   e           k disk    rename(rca0pfr:rca0l1r)
     frca0lu    o    e           k disk    rename(rca0pfr:rca0lur)
     frcnfl1    if   e           k disk    rename(rcnfpfr:rcnfl1r)
     frcnflu    o    e           k disk    rename(rcnfpfr:rcnflur)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
     d w_firm          s              3  0
      *
      * Fordeling fra budsjett
      *
     c     rfobl1_key    setll     rfobl1                                 90
     c     rfobl1_key    reade     rfobl1                                 90
     c                   dow       *in90 = *off
     c                   eval      rffirm = w_firm
     c                   write     rfoblur
     c     rfobl1_key    reade     rfobl1                                 90
     c                   enddo
      *
      * Fordelingsparametre
      *
     c     rforl1_key    setll     rforl1                                 90
     c     rforl1_key    reade     rforl1                                 90
     c                   dow       *in90 = *off
     c                   eval      rffirm = w_firm
6.10 c                   time                    rfedat
6.10 c                   time                    rfetim
6.10 c                   eval      rfeusr = l_user
6.10 c                   time                    rfodat
6.10 c                   time                    rfotim
6.10 c                   eval      rfousr = l_user
     c                   write     rforlur
     c     rforl1_key    reade     rforl1                                 90
     c                   enddo
      *
      * Fordeling fra saldo
      *
     c     rfosl1_key    setll     rfosl1                                 90
     c     rfosl1_key    reade     rfosl1                                 90
     c                   dow       *in90 = *off
     c                   eval      rffirm = w_firm
     c                   write     rfoslur
     c     rfosl1_key    reade     rfosl1                                 90
     c                   enddo
      *
      * Kontoplan
      *
     c     rhovl1_key    setll     rhovl1                                 90
     c     rhovl1_key    reade     rhovl1                                 90
     c                   dow       *in90 = *off
     c                   eval      rhfirm = w_firm
6.10 c                   time                    rhedat
6.10 c                   time                    rhetim
6.10 c                   eval      rheusr = l_user
6.10 c                   time                    rhodat
6.10 c                   time                    rhotim
6.10 c                   eval      rhousr = l_user
     c                   write     rhovlur
     c     rhovl1_key    reade     rhovl1                                 90
     c                   enddo
      *
      * Hovedbokssaldo
      *
     c     rhsal1_key    setll     rhsal1                                 90
     c     rhsal1_key    reade     rhsal1                                 90
     c                   dow       *in90 = *off
     c                   eval      rifirm = w_firm
6.10 c                   time                    riedat
6.10 c                   time                    rietim
6.10 c                   eval      rieusr = l_user
6.10 c                   time                    riodat
6.10 c                   time                    riotim
6.10 c                   eval      riousr = l_user
     c                   write     rhsalur
     c     rhsal1_key    reade     rhsal1                                 90
     c                   enddo
      *
      * Hovedboksposteringer
      *
     c     rhtrl1_key    setll     rhtrl1                                 90
     c     rhtrl1_key    reade     rhtrl1                                 90
     c                   dow       *in90 = *off
     c                   eval      rbfirm = w_firm
6.10 c                   time                    rbodat
6.10 c                   time                    rbotim
6.10 c                   eval      rbousr = l_user
6.10 c                   time                    rbedat
6.10 c                   time                    rbetim
6.10 c                   eval      rbeusr = l_user
     c                   write     rhtrlur
     c     rhtrl1_key    reade     rhtrl1                                 90
     c                   enddo
      *
      * Kladdeblokk
      *
E5.40c     rklal1_key    setll     rklal1                                 90
E5.40c     rklal1_key    reade     rklal1                                 90
     c                   dow       *in90 = *off
     c                   eval      rxfirm = w_firm
6.10 c                   time                    rxodat
6.10 c                   time                    rxotim
6.10 c                   eval      rxousr = l_user
6.10 c                   time                    rxedat
6.10 c                   time                    rxetim
6.10 c                   eval      rxeusr = l_user
     c                   write     rklalur
E5.40c     rklal1_key    reade     rklal1                                 90
     c                   enddo
      *
      * Kunder spesialavtale
      *
     c     rksal1_key    setll     rksal1                                 90
     c     rksal1_key    reade     rksal1                                 90
     c                   dow       *in90 = *off
     c                   eval      rksafi = w_firm
6.10 c                   time                    rkodat
6.10 c                   time                    rkotim
6.10 c                   eval      rkousr = l_user
6.10 c                   time                    rkenda
6.10 c                   time                    rkenti
6.10 c                   eval      rkeusr = l_user
     c                   write     rksalur
     c     rksal1_key    reade     rksal1                                 90
     c                   enddo
      *
      * Kunder søketekst
      *
     c     rksol1_key    setll     rksol1                                 90
     c     rksol1_key    reade     rksol1                                 90
     c                   dow       *in90 = *off
     c                   eval      rksfir = w_firm
     c                   write     rksolur
     c     rksol1_key    reade     rksol1                                 90
     c                   enddo
      *
      * Kundeposteringer
      *
     c     rktrl1_key    setll     rktrl1                                 90
     c     rktrl1_key    reade     rktrl1                                 90
     c                   dow       *in90 = *off
     c                   eval      rnfirm = w_firm
6.10 c                   time                    rnodat
6.10 c                   time                    rnotim
6.10 c                   eval      rnousr = l_user
6.10 c                   time                    rnedat
6.10 c                   time                    rnetim
6.10 c                   eval      rneusr = l_user
     c                   write     rktrlur
     c     rktrl1_key    reade     rktrl1                                 90
     c                   enddo
      *
      * Kunder
      *
     c     rkunl1_key    setll     rkunl1                                 90
     c     rkunl1_key    reade     rkunl1                                 90
     c                   dow       *in90 = *off
     c                   eval      rkfirm = w_firm
6.10 c                   time                    rkndat
6.10 c                   time                    rkntim
6.10 c                   eval      rknsig = l_user
6.10 c                   time                    rkedat
6.10 c                   time                    rketim
6.10 c                   eval      rkesig = l_user
6.11 c                   time                    rk2dpt
6.11 c                   eval      rkepgm = 'RF406R    '
     c                   write     rkunlur
     c     rkunl1_key    reade     rkunl1                                 90
     c                   enddo
      *
      * Leverandører bank
      *
     c     rlbapf_key    setll     rlbapf                                 90
     c     rlbapf_key    reade     rlbapf                                 90
     c                   dow       *in90 = *off
     c                   eval      rvfirm = w_firm
6.10 c                   time                    rvodat
6.10 c                   time                    rvotim
6.10 c                   eval      rvousr = l_user
6.10 c                   time                    rvedat
6.10 c                   time                    rvetim
6.10 c                   eval      rveusr = l_user
     c                   write     rlbalur
     c     rlbapf_key    reade     rlbapf                                 90
     c                   enddo
      *
      * Leverandør søketekst
      *
     c     rlsol1_key    setll     rlsol1                                 90
     c     rlsol1_key    reade     rlsol1                                 90
     c                   dow       *in90 = *off
     c                   eval      rlsfir = w_firm
     c                   write     rlsolur
     c     rlsol1_key    reade     rlsol1                                 90
     c                   enddo
      *
      * Leverandørposteringer
      *
     c     rltrl1_key    setll     rltrl1                                 90
     c     rltrl1_key    reade     rltrl1                                 90
     c                   dow       *in90 = *off
     c                   eval      rofirm = w_firm
6.10 c                   time                    roodat
6.10 c                   time                    rootim
6.10 c                   eval      roousr = l_user
6.10 c                   time                    roedat
6.10 c                   time                    roetim
6.10 c                   eval      roeusr = l_user
     c                   write     rltrlur
     c     rltrl1_key    reade     rltrl1                                 90
     c                   enddo
      *
      * Leverandører
      *
     c     rlevl1_key    setll     rlevl1                                 90
     c     rlevl1_key    reade     rlevl1                                 90
     c                   dow       *in90 = *off
     c                   eval      rlfirm = w_firm
6.10 c                   time                    rlndat
6.10 c                   time                    rlntim
6.10 c                   eval      rlnsig = l_user
6.10 c                   time                    rledat
6.10 c                   time                    rletim
6.10 c                   eval      rlesig = l_user
6.11 c                   time                    rl2dpt
6.11 c                   eval      rlepgm = 'RF406R    '
     c                   write     rlevlur
     c     rlevl1_key    reade     rlevl1                                 90
     c                   enddo
      *
      * Resultatrapporter heading
      *
     c     rrf0l1_key    setll     rrf0l1                                 90
     c     rrf0l1_key    reade     rrf0l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rr0fir = w_firm
     c                   write     rrf0lur
     c     rrf0l1_key    reade     rrf0l1                                 90
     c                   enddo
      *
      * Resultatrapporter
      *
     c     rrf5l1_key    setll     rrf5l1                                 90
     c     rrf5l1_key    reade     rrf5l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rr5fir = w_firm
     c                   write     rrf5lur
     c     rrf5l1_key    reade     rrf5l1                                 90
     c                   enddo
      *
      * Resultatrapporter
      *
     c     rrf8l1_key    setll     rrf8l1                                 90
     c     rrf8l1_key    reade     rrf8l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rr8fir = w_firm
     c                   write     rrf8lur
     c     rrf8l1_key    reade     rrf8l1                                 90
     c                   enddo
      *
      * Resultatrapporte saldo
      *
     c     rrf9l1_key    setll     rrf9l1                                 90
     c     rrf9l1_key    reade     rrf9l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rr9fir = w_firm
     c                   write     rrf9lur
     c     rrf9l1_key    reade     rrf9l1                                 90
     c                   enddo
      *
      * Hovedbok sumposter
      *
     c     rzuml1_key    setll     rzuml1                                 90
     c     rzuml1_key    reade     rzuml1                                 90
     c                   dow       *in90 = *off
     c                   eval      rzfirm = w_firm
6.10 c                   time                    rzodat
6.10 c                   time                    rzotim
6.10 c                   eval      rzousr = l_user
6.10 c                   time                    rzedat
6.10 c                   time                    rzetim
6.10 c                   eval      rzeusr = l_user
     c                   write     rzumlur
     c     rzuml1_key    reade     rzuml1                                 90
     c                   enddo
      *
      * Inkasso saksregister
      *
     c     rcnfl1_key    setll     rcnfl1                                 90
     c     rcnfl1_key    reade     rcnfl1                                 90
     c                   dow       *in90 = *off
     c                   eval      rcnfir = w_firm
     c                   write     rcnflur
     c     rcnfl1_key    reade     rcnfl1                                 90
     c                   enddo
      *
      * Inkasso faste data
      *
     c     rca0l1_key    setll     rca0l1                                 90
     c     rca0l1_key    reade     rca0l1                                 90
     c                   dow       *in90 = *off
     c                   eval      rc0fir = w_firm
     c                   write     rca0lur
     c     rca0l1_key    reade     rca0l1                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    w_firm
      *
     c     rfobl1_key    klist
     c                   kfld                    l_firm
      *
     c     rforl1_key    klist
     c                   kfld                    l_firm
      *
     c     rfosl1_key    klist
     c                   kfld                    l_firm
      *
     c     rhovl1_key    klist
     c                   kfld                    l_firm
      *
     c     rhsal1_key    klist
     c                   kfld                    l_firm
      *
     c     rhtrl1_key    klist
     c                   kfld                    l_firm
      *
E5.40c     rklal1_key    klist
     c                   kfld                    l_firm
      *
     c     rksal1_key    klist
     c                   kfld                    l_firm
      *
     c     rksol1_key    klist
     c                   kfld                    l_firm
      *
     c     rktrl1_key    klist
     c                   kfld                    l_firm
      *
     c     rkunl1_key    klist
     c                   kfld                    l_firm
      *
     c     rlbapf_key    klist
     c                   kfld                    l_firm
      *
     c     rlsol1_key    klist
     c                   kfld                    l_firm
      *
     c     rltrl1_key    klist
     c                   kfld                    l_firm
      *
     c     rlevl1_key    klist
     c                   kfld                    l_firm
      *
     c     rprhl1_key    klist
     c                   kfld                    l_firm
      *
     c     rprll1_key    klist
     c                   kfld                    l_firm
      *
     c     rprxl1_key    klist
     c                   kfld                    l_firm
      *
     c     rrf0l1_key    klist
     c                   kfld                    l_firm
      *
     c     rrf5l1_key    klist
     c                   kfld                    l_firm
      *
     c     rrf8l1_key    klist
     c                   kfld                    l_firm
      *
     c     rrf9l1_key    klist
     c                   kfld                    l_firm
      *
     c     rzuml1_key    klist
     c                   kfld                    l_firm
      *
     c     rca0l1_key    klist
     c                   kfld                    l_firm
      *
     c     rcnfl1_key    klist
     c                   kfld                    l_firm
      *
     c                   endsr
