      /TITLE  Felles, utskrift kontaktperson - parameter
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK630R                                              *
      * Beskrivelse . . : Felles, utskrift kontaktperson - parameter          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ----------------------------------------------------*
      * R5.50     230806  Nytt program.                                  HFL
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
     frf630d    cf   e             workstn
      *
     d s               s              1  0
     d wpakod          s              2  0
     d wpdat1          s              8  0
     d p_in03          s              1
     d w_firm          s                   like(l_firm)
     d w_user          s                   like(l_user)
     d w_tell          s              1  0
      *
      * Datastruktur for parameter
     d                uds
     d pkund                 300    300                                         Pr. dato
     d pknrf                          6  0                                      Nr. f.o.m.
     d pknrt                          6  0                                      Nr. t.o.m.
     d pkavf                          4  0                                      Avdeling f.o.m.
     d pkavt                          4  0                                      Avdeling t.o.m.
     d pkktf                          4  0                                      Kategori f.o.m.
     d pkktt                          4  0                                      Kategori t.o.m.
     d pself                          4  0                                      Selger f.o.m.
     d pselt                          4  0                                      Selger t.o.m.
     d pkdif                          4  0                                      Distrikt f.o.m.
     d pkdit                          4  0                                      Distrikt t.o.m.
     d plevr                          1                                         Pr. år
     d plnrf                          6  0                                      Nr. f.o.m.
     d plnrt                          6  0                                      Nr. t.o.m.
     d plavf                          4  0                                      Avdeling f.o.m.
     d plavt                          4  0                                      Avdeling t.o.m.
     d plktf                          4  0                                      Kategori f.o.m.
     d plktt                          4  0                                      Kategori t.o.m.
     d pldif                          4  0                                      Distrikt f.o.m.
     d pldit                          4  0                                      Distrikt t.o.m.
     d palle                          1                                         Alfa/Numerisk
      *
     d l_wsid                901    910                                         Bruker
     d l_user                911    920                                         Bruker
     d l_firm                944    946  0                                      Firma
     d l_fnav                951    980                                         Navn
      *
      /eject
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c                   exfmt     a2bld
      *
     c                   eval      *in31 = *off
     c                   eval      *in32 = *off
     c                   eval      *in33 = *off
     c                   eval      *in34 = *off
     c                   eval      *in35 = *off
     c                   eval      *in36 = *off
     c                   eval      *in37 = *off
     c                   eval      *in38 = *off
     c                   eval      *in39 = *off
     c                   eval      *in40 = *off
     c                   eval      *in41 = *off
     c                   eval      *in42 = *off
     c                   eval      *in43 = *off
     c                   eval      *in44 = *off
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Sjekke om kunde, leverandør eller alle
      *
     c                   if        a2pkun <> 'J' and                                     .....
     c                             a2pkun <> ' '                                             .
     c                   move      *on           *in31                          Pos.cur.     .
     c                   move      *on           *in44                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
     c                   if        a2plev <> 'J' and                                     .....
     c                             a2plev <> ' '                                             .
     c                   move      *on           *in37                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
     c                   if        a2pall <> 'J' and                                     .....
     c                             a2pall <> ' '                                             .
     c                   move      *on           *in42                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *                                                                                  .....
      * En må velges
      *                                                                                  .....
     c                   eval      w_tell = *zero
     c                   if        a2pkun <> *blank                                      .....
     c                   eval      w_tell = w_tell + 1
     c                   endif                                                           .....
     c                   if        a2plev <> *blank                                      .....
     c                   eval      w_tell = w_tell + 1
     c                   endif                                                           .....
     c                   if        a2pall <> *blank                                      .....
     c                   eval      w_tell = w_tell + 1
     c                   endif                                                           .....
      *
     c                   if        w_tell <> 1                                           .....
     c                   move      *on           *in44                                       .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll kundenummer
      *
     c                   if        a2pkuf > a2pkut                                       .....
     c                   move      *on           *in32                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll avdeling
      *
     c                   if        a2pkaf > a2pkat                                       .....
     c                   move      *on           *in33                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll kundekategori
      *
     c                   if        a2pkkf > a2pkkt                                       .....
     c                   move      *on           *in34                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll selger
      *
     c                   if        a2psef > a2pset                                       .....
     c                   move      *on           *in35                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll distrikt
      *
     c                   if        a2pkdf > a2pkdt                                       .....
     c                   move      *on           *in36                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll leverandører
      *
     c                   if        a2plef > a2plet                                       .....
     c                   move      *on           *in38                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll leverandør avdeling
      *
     c                   if        a2plaf > a2plat                                       .....
     c                   move      *on           *in39                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll leverandørkategori
      *
     c                   if        a2plkf > a2plkt                                       .....
     c                   move      *on           *in40                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll leverandør distrikt
      *
     c                   if        a2pldf > a2pldt                                       .....
     c                   move      *on           *in41                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Skriv parameter
      *
     c                   move      a2pkun        pkund
     c                   move      a2pkuf        pknrf
     c                   move      a2pkut        pknrt
     c                   move      a2pkaf        pkavf
     c                   move      a2pkat        pkavt
     c                   move      a2pkkf        pkktf
     c                   move      a2pkkt        pkktt
     c                   move      a2psef        pself
     c                   move      a2pset        pselt
     c                   move      a2pkdf        pkdif
     c                   move      a2pkdt        pkdit
      *
     c                   move      a2plev        plevr
     c                   move      a2plef        plnrf
     c                   move      a2plet        plnrt
     c                   move      a2plaf        plavf
     c                   move      a2plat        plavt
     c                   move      a2plkf        plktf
     c                   move      a2plkt        plktt
     c                   move      a2pldf        pldif
     c                   move      a2pldt        pldit
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      p_in03 = ' '
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   move      l_user        w_user
     c                   move      l_firm        w_firm
     c                   eval      a2pkuf = *zeros
     c                   eval      a2pkut = 999999
     c                   eval      a2pkaf = *zeros
     c                   eval      a2pkat = 9999
     c                   eval      a2pkkf = *zeros
     c                   eval      a2pkkt = 9999
     c                   eval      a2psef = *zeros
     c                   eval      a2pset = 9999
     c                   eval      a2pkdf = *zeros
     c                   eval      a2pkdt = 9999
      *
     c                   eval      a2plef = *zeros
     c                   eval      a2plet = 999999
     c                   eval      a2plaf = *zeros
     c                   eval      a2plat = 9999
     c                   eval      a2plkf = *zeros
     c                   eval      a2plkt = 9999
     c                   eval      a2pldf = *zeros
     c                   eval      a2pldt = 9999
      *
      * Hent bruker-record
      *
     c     key03         chain     ausrl1                             63
      *
      *  Sjekk om begrenset til avdeling
      *
     c                   if        abbavd = 'J'                                          .....
     c                   move      *on           *in30                          Protect.     .
     c                   move      absavd        a2pkaf                                      .
     c                   move      absavd        a2pkat                                      .
     c                   move      absavd        a2plaf                                      .
     c                   move      absavd        a2plat                                      .
     c                   endif                                                           .....
      *
      * Key for bruker-file
      *
     c     key03         klist
     c                   kfld                    w_user
      *
     c                   endsr
      /eject
