      /TITLE         Slette poster i fra rtrapf
 6.11 * R6.11     180112  Test på firma må skje dersom manuell registr.  NHO  *
7.01  *K00        060720  lagt på return + ab705r + switchstyring        bof  *
     frbunlu    uf   e           k disk
      *
610  d rbunlu_nivo     s                   like(rsnivo)
610  d rbunlu_memb     s                   like(rsmemb)
610  d rbunlu_firm     s                   like(rsfirm)
610  d rbunlu_bunt     s                   like(rsbunt)
      *
7.01 d w_firm          s              3  0
     d w_memb          s             10
7.01 d w_jkey          s             41
7.01 d w_jnav          s             15
7.01 d w_jsta          s              2  0
7.01 d w_jmld          s            200
      *
      *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      * LOCAL DATA
      *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      *
     d                uds
     d l_firm                944    946  0
7.01 d l_filg                931    933
      *
7.01   dcl-s co402_verdi1  char(1);
7.01   dcl-s co402_verdi2  char(2048);
7.01   DCL-PR CO402R EXTPGM('CO402R');
7.01     p_filgrp            char(3)     const;
7.01     p_firm              packed(3:0) const;
7.01     p_lager             packed(2:0) const;
7.01     p_nokkel            char(50)    const;
7.01     p_verdi1            char(1);
7.01     p_verdi2            char(2048);
7.01   END-PR;
7.01 d u_logg          s              1    inz(*off)                            logging ajltpf
      *
     c     rbunlu_key    klist
610  c                   kfld                    rbunlu_nivo
610  c                   kfld                    rbunlu_memb
     c                   kfld                    rbunlu_firm
     c                   kfld                    rbunlu_bunt
      *
7.01 c                   if        u_logg = *on
7.01 c                   eval      w_jsta = 10
7.01 c                   eval      w_jmld = 'Start RF704R        '
7.01 c                   eval      w_jnav = 'OKON_RF704R-'
7.01 c                   call      'AB700R'
7.01 c                   parm                    w_jnav
7.01 c                   parm                    w_jkey
7.01 c                   parm                    w_jmld
7.01 c                   eval      w_jsta = 10
7.01 c                   eval      w_jmld = 'Start RF704R       '
7.01 c                   call      'AB705R'
7.01 c                   parm                    w_jkey
7.01 c                   parm                    w_jsta
7.01 c                   parm                    w_jmld
7.01 c                   endif
7.01  *
      *
     c     rbunlu_key    setll     rbunlu
      *
     c     start         tag
     c                   read      rbunlu                                 15
      *
     c                   if        *in15 = *on
     c                   goto      slutt
     c                   end
      *
      *
6.11 c                   if        rsfirm <> rbunlu_firm
6.11 c                   goto      slutt
6.11 c                   endif
      *
610   *
610  c                   if        rsmemb <> w_memb
     c                   goto      slutt
     c                   else
     c                   delete    rbunlu
610  c                   endif
      *
     c                   goto      start
      *
     c     slutt         tag
7.01 c                   if        u_logg = *on
7.01 c                   eval      w_jsta = 10
7.01 c                   eval      w_jmld = 'Slutt RF704R før LR'
7.01 c                   call      'AB705R'
7.01 c                   parm                    w_jkey
7.01 c                   parm                    w_jsta
7.01 c                   parm                    w_jmld
7.01 c                   endif
7.01  *
     c                   eval      *inlr = *on
      *
7.01 c                   if        u_logg = *on
7.01 c                   eval      w_jsta = 10
7.01 c                   eval      w_jmld = 'Slutt RF704R etter LR'
7.01 c                   call      'AB705R'
7.01 c                   parm                    w_jkey
7.01 c                   parm                    w_jsta
7.01 c                   parm                    w_jmld
7.01 c                   endif
7.01 c                   return
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_memb
      *
     c                   eval      rbunlu_nivo = *blank
     c                   eval      rbunlu_memb = w_memb
6.11 c                   eval      rbunlu_firm = l_firm
     c                   eval      rbunlu_bunt = *zeros
      *
7.01 c                   eval      w_firm = l_firm
7.01  * Test om logging skal gjøres
7.01  *
7.01   CallP CO402R(l_filg:w_firm:0:'RF-PROG LOGGING':
7.01                    co402_verdi1:co402_verdi2);
7.01   if co402_verdi1 = '1';
7.01     u_logg = *on;
7.01   endif;
     c                   endsr
