      /TITLE         Sjekk av filen rtral1 mot bruker
     frtral1    if   e           k disk    rename(rtrapfr:rtral1r)
      *
610  d rtral1_nivo     s                   like(rtnivo)
610  d rtral1_memb     s                   like(rtmemb)
610  d rtral1_firm     s                   like(rtfirm)
     d rtral1_bunt     s                   like(rtbunt)
     d rtral1_linj     s                   like(rtlinj)
      *
     d w_memb          s             10
      *
      *
      *
     c     rtral1_key    klist
610  c                   kfld                    rtral1_nivo
610  c                   kfld                    rtral1_memb
     c                   kfld                    rtral1_firm
     c                   kfld                    rtral1_bunt
     c                   kfld                    rtral1_linj
      *
      *
     c     rtral1_key    setll     rtral1
     c                   read      rtral1                                 15
      *
     c                   if        *in15 = *on
     c                   eval      w_memb = *blanks
     c                   goto      slutt
     c                   end
      *
610   *
610  c                   if        rtmemb <> w_memb
     c                   eval      w_memb = *blanks
610  c                   endif
      *
      *
     c     slutt         tag
     c                   eval      *inlr = *on
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_memb
      *
     c                   eval      rtral1_nivo = *blank
     c                   eval      rtral1_memb = w_memb
     c                   eval      rtral1_firm = 0
     c                   eval      rtral1_bunt = 0
     c                   eval      rtral1_linj = 0
      *
     c                   endsr
