      /TITLE         Slette poster i fra rtrapf
6.11  * 6.11      211111  Slett av poster i RTRZLU                        NHO *
      *
     frtrzlu    uf   e           k disk
      *
610  d rtrzlu_firm     s                   like(rz1fir)
      *
     d w_memb          s             10
     d w_bunt          s              5  0
      *
      *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      * LOCAL DATA
      *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      *
     d                uds
     d l_firm                944    946  0
      *
      *
     c     rtrzlu_key    klist
610  c                   kfld                    rtrzlu_firm
      *
      *
     c     rtrzlu_key    setll     rtrzlu
      *
     c     start         tag
     c                   read      rtrzlu                                 15
      *
     c                   if        *in15 = *on
     c                   goto      slutt
     c                   end
      *
     c                   if        rz1fir <> l_firm
     c                   goto      slutt
     c                   endif
      *
      *
     c                   if        rz1unt <> w_bunt
     c                   goto      start
     c                   end
      *
      *
     c                   if        rz1emb <> w_memb
     c                   goto      start
     c                   end
      *
      *
     c                   delete    rtrzlu
      *
     c                   goto      start
      *
     c     slutt         tag
     c                   eval      *inlr = *on
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_memb
     c                   parm                    w_bunt
      *
     c                   eval      rtrzlu_firm = l_firm
      *
     c                   endsr
