      /TITLE         Slette poster i fra rtrapf
6.11  * 6.11      281011  Slett kun angitt buntnr, samt test på firma     NHO *
      *
     frtralu    uf   e           k disk
      *
610  d rtralu_nivo     s                   like(rtnivo)
610  d rtralu_memb     s                   like(rtmemb)
610  d rtralu_firm     s                   like(rtfirm)
610  d rtralu_bunt     s                   like(rtbunt)
610  d rtralu_linj     s                   like(rtlinj)
      *
     d w_memb          s             10
     d w_bunt          s                   like(rtbunt)
      *
      *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      * LOCAL DATA
      *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      *
     d                uds
     d l_firm                944    946  0
      *
      *
     c     rtralu_key    klist
610  c                   kfld                    rtralu_nivo
610  c                   kfld                    rtralu_memb
     c                   kfld                    rtralu_firm
     c                   kfld                    rtralu_bunt
     c                   kfld                    rtralu_linj
      *
      *
     c     rtralu_key    setll     rtralu
      *
     c     start         tag
     c                   read      rtralu                                 15
      *
     c                   if        *in15 = *on
     c                   goto      slutt
     c                   end
      *
     c                   if        rtfirm <> l_firm
     c                   goto      slutt
     c                   endif
      *
610   *
610  c                   if        rtmemb <> w_memb
     c                   goto      slutt
     c                   end
      *
610  c                   if        rtbunt <> w_bunt
     c                   goto      slutt
     c                   end
      *
     c                   delete    rtralu
      *
     c                   goto      start
      *
     c     slutt         tag
     c                   eval      *inlr = *on
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_memb
     c                   parm                    w_bunt
      *
     c                   eval      rtralu_nivo = *blank
     c                   eval      rtralu_memb = w_memb
     c                   eval      rtralu_firm = l_firm
     c                   eval      rtralu_bunt = w_bunt
     c                   eval      rtralu_linj = *zeros
      *
     c                   endsr
