      /TITLE         Slette poster i fra rtripf
      *------------------------------------------------------------------------
7.01  *K00        060720  lagt på return + ab705r   + swichtstyring      bof  *
     frjoulu    uf   e           k disk
      *
7.01 d                uds
7.01 d l_firm                944    946  0
7.01 d l_filg                931    933
      *
610  d rjoulu_nivo     s                   like(rjnivo)
610  d rjoulu_memb     s                   like(rjmemb)
610  d rjoulu_sort     s                   like(rjsort)
      *
7.01 d w_firm          s              3  0
     d w_memb          s             10
7.01 d w_jkey          s             41
7.01 d w_jnav          s             15
7.01 d w_jsta          s              2  0
7.01 d w_jmld          s            200
      *
      *
7.01   dcl-s co402_verdi1  char(1);
7.01   dcl-s co402_verdi2  char(2048);
7.01   DCL-PR CO402R EXTPGM('CO402R');
7.01     p_filgrp            char(3)     const;
7.01     p_firm              packed(3:0) const;
7.01     p_lager             packed(2:0) const;
7.01     p_nokkel            char(50)    const;
7.01     p_verdi1            char(1);
7.01     p_verdi2            char(2048);
7.01   END-PR;
7.01 d u_logg          s              1    inz(*off)                            logging ajltpf
      *
      *
     c     rjoulu_key    klist
610  c                   kfld                    rjoulu_nivo
610  c                   kfld                    rjoulu_memb
     c                   kfld                    rjoulu_sort
      *
7.01 c                   if        u_logg = *on
7.01 c                   eval      w_jsta = 10
7.01 c                   eval      w_jmld = 'Start RF702R        '
7.01 c                   eval      w_jnav = 'OKON_RF702R-'
7.01 c                   call      'AB700R'
7.01 c                   parm                    w_jnav
7.01 c                   parm                    w_jkey
7.01 c                   parm                    w_jmld
7.01 c                   eval      w_jsta = 10
7.01 c                   eval      w_jmld = 'Start RF702R       '
7.01 c                   call      'AB705R'
7.01 c                   parm                    w_jkey
7.01 c                   parm                    w_jsta
7.01 c                   parm                    w_jmld
7.01 c                   endif
7.01  *
      *
     c     rjoulu_key    setll     rjoulu
      *
     c     start         tag
     c                   read      rjoulu                                 15
      *
     c                   if        *in15 = *on
     c                   goto      slutt
     c                   end
      *
610   *
610  c                   if        rjmemb <> w_memb
     c                   goto      slutt
     c                   else
     c                   delete    rjoulu
610  c                   endif
      *
     c                   goto      start
      *
     c     slutt         tag
7.01 c                   if        u_logg = *on
7.01 c                   eval      w_jsta = 10
7.01 c                   eval      w_jmld = 'Slutt RF702R før LR'
7.01 c                   call      'AB705R'
7.01 c                   parm                    w_jkey
7.01 c                   parm                    w_jsta
7.01 c                   parm                    w_jmld
7.01 c                   endif
7.01  *
     c                   eval      *inlr = *on
      *
7.01 c                   if        u_logg = *on
7.01 c                   eval      w_jsta = 10
7.01 c                   eval      w_jmld = 'Slutt RF702R etter LR'
7.01 c                   call      'AB705R'
7.01 c                   parm                    w_jkey
7.01 c                   parm                    w_jsta
7.01 c                   parm                    w_jmld
     c                   endif
      *
7.01 c                   return
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_memb
      *
     c                   eval      rjoulu_nivo = *blank
     c                   eval      rjoulu_memb = w_memb
     c                   eval      rjoulu_sort = *blanks
      *
7.01 c                   eval      w_firm = l_firm
7.01  * Test om logging skal gjøres
7.01  *
7.01   CallP CO402R(l_filg:w_firm:0:'RF-PROG LOGGING':
7.01                    co402_verdi1:co402_verdi2);
7.01   if co402_verdi1 = '1';
7.01     u_logg = *on;
7.01   endif;
      *
     c                   endsr
