      /TITLE         Slette poster i fra rtrapf
6.11  * 6.11      211111  Slett av poster i rtrzl1                        NHO *
      *
     frtrzl3    uf   e           k disk    rename(rtrzpfr:rtrzl3r)
      *
      *
     d rtrzl3_memb     s                   like(rz1emb)
610  d rtrzl3_firm     s                   like(rz1fir)
     d rtrzl3_bunt     s                   like(rz1unt)
      *
     d w_bunt          s                   like(rz1unt)
     d w_memb          s                   like(rz1emb)
      *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      * LOCAL DATA
      *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      *
     d                uds
     d l_firm                944    946  0
      *
      *
     c     rtrzl3_key    klist
     c                   kfld                    rtrzl3_memb
610  c                   kfld                    rtrzl3_firm
     c                   kfld                    rtrzl3_bunt
      *
      *
     c     rtrzl3_key    setll     rtrzl3
      *
     c     start         tag
     c                   read      rtrzl3                                 15
      *
     c                   if        *in15 = *on
     c                   goto      slutt
     c                   end
      *
     c                   if        rz1emb <> w_memb
     c                   goto      slutt
     c                   endif
      *
      *
     c                   if        rz1unt <> w_bunt
     c                   goto      start
     c                   end
      *
      *
     c                   if        rz1fir <> l_firm
     c                   goto      start
     c                   end
      *
     c                   delete    rtrzl3
      *
     c                   goto      start
      *
     c     slutt         tag
     c                   eval      *inlr = *on
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_memb
     c                   parm                    w_bunt
      *
     c                   eval      rtrzl3_firm = l_firm
     c                   eval      rtrzl3_memb = w_memb
     c                   eval      rtrzl3_bunt = w_bunt
      *
     c                   endsr
