      /TITLE         Slette poster i fra rtrapf
6.11  * 6.11      211111  Slett av poster i rtx2L1                        NHO *
      *
     frtx2l1    uf   e           k disk    rename(rtx2pfr:rtx2l1r)
      *
610  d rtx2l1_firm     s                   like(rx2fir)
      *
     d rtx2l1_memb     s             10
     d rtx2l1_bunt     s              5  0
      *
     d w_bunt          s              5  0
     d w_memb          s             10
      *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      * LOCAL DATA
      *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      *
     d                uds
     d l_firm                944    946  0
      *
      *
     c     rtx2l1_key    klist
     c                   kfld                    rtx2l1_memb
610  c                   kfld                    rtx2l1_firm
     c                   kfld                    rtx2l1_bunt
      *
      *
     c     rtx2l1_key    setll     rtx2l1
      *
     c     start         tag
     c                   read      rtx2l1                                 15
      *
     c                   if        *in15 = *on
     c                   goto      slutt
     c                   end
      *
     c                   if        rx2fir <> l_firm
     c                   goto      slutt
     c                   endif
      *
      *
     c                   if        rx2unt <> w_bunt
     c                   goto      start
     c                   end
      *
      *
     c                   if        rx2emb <> w_memb
     c                   goto      start
     c                   end
      *
     c                   delete    rtx2l1
      *
     c                   goto      start
      *
     c     slutt         tag
     c                   eval      *inlr = *on
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_memb
     c                   parm                    w_bunt
      *
     c                   eval      rtx2l1_firm = l_firm
     c                   eval      rtx2l1_memb = w_memb
     c                   eval      rtx2l1_bunt = w_bunt
      *
     c                   endsr
