      /TITLE         Slette poster i fra rtrapf
6.11  * 6.11      211111  Slett av poster i RTRXL2                        NHO *
      *
     frtrxl2    uf   e           k disk
     f**sfdebug   o    f  128        disk
      *
610  d rtrxl2_firm     s                   like(rx1fir)
      *
     d rtrxl2_memb     s             10
     d rtrxl2_bunt     s              5  0
      *
     d w_bunt          s              5  0
     d w_memb          s             10
      *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      * LOCAL DATA
      *++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      *
     d                uds
     d l_firm                944    946  0
      *
      *
     c     rtrxl2_key    klist
     c                   kfld                    rtrxl2_memb
610  c                   kfld                    rtrxl2_firm
     c                   kfld                    rtrxl2_bunt
      *
      *
     c     rtrxl2_key    setll     rtrxl2
      *
     c     start         tag
     c                   read      rtrxl2                                 15
     c**                 except    debug
      *
     c                   if        *in15 = *on
     c                   goto      slutt
     c                   end
      *
     c                   if        rx1fir <> l_firm
     c                   goto      slutt
     c                   endif
      *
      *
     c                   if        rx1unt <> w_bunt
     c                   goto      start
     c                   end
      *
      *
     c                   if        rx1emb <> w_memb
     c                   goto      start
     c                   end
      *
      *
     c**                 except    debugd
     c                   delete    rtrxl2
      *
     c                   goto      start
      *
     c     slutt         tag
     c                   eval      *inlr = *on
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_memb
     c                   parm                    w_bunt
      *
     c                   eval      rtrxl2_firm = l_firm
     c                   eval      rtrxl2_memb = w_memb
     c                   eval      rtrxl2_bunt = w_bunt
      *
     c                   endsr
     o**sfdebug   e            debug
     o**                                           10 'Lest:'
     o**                       rtrxl2_firm         15
     o**                       rtrxl2_memb         26
     o**                       rtrxl2_bunt         33
     o**                       rx1fir              40
     o**                       rx1emb              51
     o**                       rx1unt              58
     o**sfdebug   e            debugd
     o**                                           10 'Delete'
