      /TITLE  Endrer regnskaps-periode og -år på transaksjoner
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RF952R                                              *
      * Beskrivelse . . : Endring av regnskaps-periode og -år                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *           020703  Fjernet kontroll av regnskapsår +-1                 *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     frf952d    cf   e             workstn
      *
     d p_firm          s              3  0                                      Firma
     d p_navn          s             30                                         Navn
     d p_user          s             10                                         BruerI
     d p_dato          s              6  0                                      Pr. da
     d p_aarf          s              4  0                                      Pr. år
     d p_aart          s              4  0                                      Pr. år
     d p_perf          s              2  0                                      Period
     d p_pert          s              2  0                                      Pr. pe
     d p_jour          s              5  0                                      Pr. pe
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d waar            s              4  0
     d wmnd            s              2  0
     d w_in03          s              1
     d w_firm          s              3  0
     d w_user          s                   like(l_user)
      *
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for registrering av parametre              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   eval      w_in03 = '1'                                     .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c     *dmy          test(d)                 a2pkda                 31
     c                   if        *in31 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av regnskapsår
      *
     c                   if        a2aarf = *zero                                        .....
     c                   move      *on           *in32                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av journalnr
      *
     c                   if        a2pjnr = *zero                                        .....
     c                   eval      *in35 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Skriv parameter
      *
     c                   move      w_user        p_user
     c                   move      a2pkda        p_dato
     c                   move      a2aarf        p_aarf
     c                   move      a2aart        p_aart
     c                   move      a2perf        p_perf
     c                   move      a2pert        p_pert
     c                   move      a2pjnr        p_jour
      *
      * Call program for oppdatering
      *
     c                   call      'RF953R'
     c                   parm                    p_firm
     c                   parm                    p_navn
     c                   parm                    p_user
     c                   parm                    p_dato
     c                   parm                    p_aarf
     c                   parm                    p_aart
     c                   parm                    p_perf
     c                   parm                    p_pert
     c                   parm                    p_jour
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   move      l_user        w_user
     c                   move      l_firm        w_firm
      *
     c                   move      udate         a2pkda
      *
      * Beregner periode
      *
     c                   move      *year         waar
      *
     c                   eval      wmnd = *month - 1
     c                   if        wmnd = *zero                                          .....
     c                   movel     12            wmnd                                        .
     c                   eval      waar = waar - 1                                           .
     c                   move      waar          a2aarf                                      .
     c                   move      waar          a2aart                                      .
     c                   else                                                                .
     c                   move      waar          a2aarf                                      .
     c                   move      waar          a2aart                                      .
     c                   endif                                                           .....
      *
     c                   move      wmnd          a2perf
     c                   move      wmnd          a2pert
      *
     c                   eval      w_in03 = ' '
      *
     c                   endsr
