     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * System  . . . . : ASOKON
      * Program . . . . : RH290R                                        *
      * Beskrivelse . . : Oppdatering av saldomatrise - parameter       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                               *
      * Tilpasset for . :                                               *
      *                                                                 *
      * Referanse  Dato   Endringsbeskrivelse                      Sign.*
      * --------- ------  ----------------------------------------------*
T5.30 * V5.30     200904  Lagt inn mulighet for regnskapsår > *year       HFL *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
     frh290d    cf   e             workstn
      *
     d                uds
     d rhpkda                300    305
     d rhprÅr                         4
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d a2prÅr          s              4  0
     d wpakod          s              2  0
     d wpdat1          s              6  0
     d p_in03          s              1
     d w_aar           s              2  0
     d w_firm          s                   like(l_firm)
     d w_user          s                   like(l_user)
T5.30d var             s             40    dim(2) ctdata perrcd(1)               Varsel m/svarkrav
T5.30d wsavli          s              2  0
T5.30d wsavpo          s              3  0
      *
     c     dummy         tag
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c                   move      a2pkda        w_aar
      *
     c     *dmy          test(d)                 a2pkda                 33
     c                   if        *in33 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av regnskapsår
T5.30 *  Varsel ved regnskapsår større enn *year
      *
S5.30c*                  if        a2prÅr = *zero                                        .....
S5.30c*                            or a2prÅr > *year                                     .....
T5.30c                   if        a2prÅr > *year
T5.30c                   movel     var(1)        m1mld1
T5.30c                   movel     var(2)        m1mld2
T5.30c                   move      'N'           m1svar
T5.30c                   exsr      xm1win
T5.30c                   if        m1svar = 'N' or
T5.30c                             a2prÅr = *zero                                        .....
     c                   eval      *in34 = *on                                               .
     c                   goto      a2taga                                                    .
T5.30c                   endif
     c                   endif                                                           .....
      *
      * Skriv parameter
      *
     c                   move      a2pkda        rhpkda
     c                   move      a2prÅr        rhprÅr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
T5.30 * M1WIN Behandle bilde for melding med svar                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
T5.30c     xm1win        begsr
      *
T5.30c                   eval      wsavli = 6
T5.30c                   eval      wsavpo = 22
T5.30c                   eval      w_arow = wsavli
T5.30c                   eval      w_acol = wsavpo
      *
T5.30c                   exfmt     m1win
      *
T5.30c                   if        *inkc = *on
T5.30c                   move      'N'           m1svar
T5.30c                   endif
      *
T5.30c                   endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   eval      wpdat1 = 0
      *
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   move      l_user        w_user
     c                   move      l_firm        w_firm
      *
     c                   move      udate         a2pkda
      *
      * Beregner periode
      *
     c                   move      *year         a2prÅr
      *
     c                   eval      p_in03 = ' '
      *
      * Hent bruker-record
      *
     c     key03         chain     ausrl1                             63
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
      * Key for bruker-file
      *
     c     key03         klist
     c                   kfld                    w_user
      *
     c                   endsr
**
Valgt år er større enn inneværende år.
Bekreft dersom dette er riktig.
