      /TITLE  Utskrift av kostnadsbærerrapport - parameter
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * Program . . . . : RH626R                                              *
      * Beskrivelse . . : Utskrift av kostnadsbærerrapport - parameter        *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
T400  * V4.00     120202  Nytt pgm. basert på RH620R                     HFL  *
T5.01 * V5.01     100303  Endret std.-verdier.                           HFL  *
T5.01 * V5.31     010405  Fjernet status i call til RH500R               KOB  *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     frh626d    cf   e             workstn
      *
     d                uds
     d rhpkda                300    305  0
     d rhprÅr                         4  0
     d rhpper                         2  0
     d rhppef                         2  0
     d rhppet                         2  0
     d rhpbØf                         4  0
     d rhpbØt                         4  0
     d rhpbÆf                         2
     d rhpbÆt                         2
     d rhpktf                         5  0
     d rhpktt                         5  0
     d rhpavf                         4  0
     d rhpavt                         4  0
     d rhpsrt                         1
     d rhpsml                         1
     d rhpavv                         1
     d rhpkgs                         1
     d rhpkks                         1
     d*rhpgrs                         1                                         K.bærergruppesum
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
     d waar            s              4  0
     d wmnd            s              2  0
     d wpakod          s              2  0
     d wpdat1          s              6  0
     d wpin03          s              1  0
     d wpokok          s              1
     d wwaar           s              2  0
     d w_firm          s                   like(l_firm)
     d w_user          s                   like(l_user)
      *
     d p_stat          s              1
     d p_kont          s                   like(a2pktf)
     d p_spes          s                   like(a2pbØf)
     d p_avde          s                   like(a2pavf)
     d p_text          s             30
     d p_agrp          s                   like(a2pbÆf)
     d p_bkod          s                   like(a2pbØf)
     d wpgtxt          s             20
      *
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
      *
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      1             wpin03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
     C                   eval      *in40 = *off
     C                   eval      *in41 = *off
     C                   eval      *in42 = *off
     C                   eval      *in43 = *off
     C                   eval      *in44 = *off
     C                   eval      *in45 = *off
     C                   eval      *in46 = *off
     C                   eval      *in47 = *off
      *
      * Spørring på kostnadsbærer
      * Fra k.bærer
     c                   if        *inkd = *on and
     c                             wactfe = 'A2PBØF'
     c                   call      'RA528R'
     c*                  parm                    p_stat                           info       .
     c                   parm                    w_firm                           info       .
     c                   parm                    p_bkod                           info       .
     c                   parm                    p_text                           info       .
      *                                                                 .
     c                   if        p_bkod <> *zero                                           .
     C                   eval      *in41 = *on
     c                   move      p_bkod        a2pbØf                                      .
     c                   endif                                                               .
     c                   goto      a2tagb
     c                   endif
      *
      * Til k.bærer
     c                   if        *inkd = *on and
     c                             wactfe = 'A2PBØT'
     c                   call      'RA528R'
     c*                  parm                    p_stat                           info       .
     c                   parm                    w_firm                           info       .
     c                   parm                    p_bkod                           info       .
     c                   parm                    p_text                           info       .
      *                                                                 .
     c                   if        p_bkod <> *zero                                           .
     C                   eval      *in42 = *on
     c                   move      p_bkod        a2pbØt                                      .
     c                   endif                                                               .
     c                   goto      a2tagb
     c                   endif
      *
      * Spørring på kostnadsbærergruppe
      * Fra k.bærergruppe
     c                   if        *inkd = *on and
     c                             wactfe = 'A2PBÆF'
     c                   call      'RA527R'
     c*                  parm                    p_stat                           info       .
     c                   parm                    w_firm                           info       .
     c                   parm                    p_agrp                           info       .
     c                   parm                    p_text                           info       .
      *                                                                 .
     c                   if        p_agrp <> *blanks                                         .
     C                   eval      *in43 = *on
     c                   move      p_agrp        a2pbÆf                                      .
     c                   endif                                                               .
     c                   goto      a2tagb
     c                   endif
      *
      * Til k.bærergruppe
     c                   if        *inkd = *on and
     c                             wactfe = 'A2PBÆT'
     c                   call      'RA527R'
     c*                  parm                    p_stat                           info       .
     c                   parm                    w_firm                           info       .
     c                   parm                    p_agrp                           info       .
     c                   parm                    p_text                           info       .
      *                                                                 .
     c                   if        p_agrp <> *blanks                                         .
     C                   eval      *in44 = *on
     c                   move      p_agrp        a2pbÆt                                      .
     c                   endif                                                               .
     c                   goto      a2tagb
     c                   endif
      *
      * Spørring på konto
      * Fra konto
     c                   if        *inkd = *on and
     c                             wactfe = 'A2PKTF'
     c                   call      'RH500R'
     c                   parm                    w_firm                           info       .
     c                   parm                    p_kont                           info       .
     c                   parm                    p_spes                           info       .
     c                   parm                    p_avde                           info       .
     c                   parm                    p_text                           info       .
      *                                                                 .
     c                   if        p_kont <> *zero                                           .
     C                   eval      *in45 = *on
     c                   move      p_kont        a2pktf                                      .
     c                   endif                                                               .
     c                   goto      a2tagb
     c                   endif
      *
      * Til konto
     c                   if        *inkd = *on and
     c                             wactfe = 'A2PKTT'
     c                   call      'RH500R'
     c                   parm                    w_firm                           info       .
     c                   parm                    p_kont                           info       .
     c                   parm                    p_spes                           info       .
     c                   parm                    p_avde                           info       .
     c                   parm                    p_text                           info       .
      *                                                                 .
     c                   if        p_kont <> *zero                                           .
     C                   eval      *in46 = *on
     c                   move      p_kont        a2pktt                                      .
     c                   endif                                                               .
     c                   goto      a2tagb
     c                   endif
      *
      * Spørring på avdeling
      * Fra avd.
     c                   if        *inkd = *on and
     c                             wactfe = 'A2PAVF'
     c                   call      'RA507R'
     c                   parm                    w_firm                           info       .
     c                   parm                    p_avde                           info       .
     c                   parm                    wpgtxt                           info       .
      *                                                                 .
     c                   if        p_avde <> *zero                                           .
     C                   eval      *in47 = *on
     c                   move      p_avde        a2pavf                                      .
     c                   endif                                                               .
     c                   goto      a2tagb
     c                   endif
      *
      * Til avd.
     c                   if        *inkd = *on and
     c                             wactfe = 'A2PAVT'
     c                   call      'RA507R'
     c                   parm                    w_firm                           info       .
     c                   parm                    p_avde                           info       .
     c                   parm                    wpgtxt                           info       .
      *                                                                 .
     c                   if        p_avde <> *zero                                           .
     C*                  eval      *in47 = *on
     c                   move      p_avde        a2pavt                                      .
     c                   endif                                                               .
     c                   goto      a2tagb
     c                   endif
      *
      *  Kontroll avdeling
      *
     c                   if        a2pavf > a2pavt                                       .....
     c                   eval      *in31 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll kostnadsbærer
      *
     c                   if        a2pbØf > a2pbØt                                       .....
     c                   eval      *in36 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll kostnadsbærergruppe
      *
     c                   if        a2pbÆf > a2pbÆt                                       .....
     c                   eval      *in37 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll konto
      *
     c                   if        a2pktf > a2pktt                                       .....
     c                   eval      *in32 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c                   move      a2pkda        wwaar
      *
     c     *dmy          test(d)                 a2pkda                 33
     c                   if        *in33 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av regnskapsår
      *
     c                   if        a2prÅr > *year                                        .....
     c                   eval      *in34 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av periode fra - til
      *
     c                   if        a2ppef > a2ppet                                       .....
     c                   eval      *in35 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Skriv parameter
      *
     c                   move      a2pkda        rhpkda
     c                   move      a2prÅr        rhprÅr
     c                   move      a2pper        rhpper
     c                   move      a2ppef        rhppef
     c                   move      a2ppet        rhppet
     c                   move      a2pavf        rhpavf
     c                   move      a2pavt        rhpavt
     c                   move      a2pbØf        rhpbØf
     c                   move      a2pbØt        rhpbØt
     c                   move      a2pbÆf        rhpbÆf
     c                   move      a2pbÆt        rhpbÆt
     c                   move      a2pktf        rhpktf
     c                   move      a2pktt        rhpktt
E400 c                   move      'B'           rhpsrt
     c                   move      a2psml        rhpsml
     c                   move      a2pavv        rhpavv
     c                   move      a2pkgs        rhpkgs
     c                   move      a2pkks        rhpkks
     c*                  move      a2pgrs        rhpgrs
      *
      /space 3
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   eval      wpdat1 = 0
     c                   eval      wpokok = *blank
      *
      * Legge inn firmanummer
      *
     c                   move      l_user        w_user
     c                   move      l_firm        w_firm
     c                   eval      a2pavf = *zeros
     c                   move      9999          a2pavt
     c                   eval      a2pbØf = *zeros
     c                   move      9999          a2pbØt
     c                   eval      a2pbÆf = *blanks
     c                   eval      a2pbÆt = *blanks
     c                   eval      a2pktf = *zeros
     c                   move      99999         a2pktt
S400 c*                  move      'K'           a2psrt
     c                   move      'B'           a2psml
     c                   move      'P'           a2pavv
E5.01c                   move      'N'           a2pkgs
E5.01c                   move      'N'           a2pkks
     c*                  move      'J'           a2pgrs
      *
     c                   move      udate         a2pkda
      *
      * Beregner periode
      *
     c                   move      *year         waar
      *
     c                   eval      wmnd = *month - 1
      *
     c                   if        wmnd = *zero                                          .....
     c                   movel     12            wmnd                                        .
     c                   eval      waar = waar - 1                                           .
     c                   move      waar          a2prÅr                                      .
     c                   else                                                            .....
     c                   move      waar          a2prÅr                                      .
     c                   endif                                                           .....
      *
     c                   move      wmnd          a2pper
     c                   move      wmnd          a2ppef
     c                   move      wmnd          a2ppet
      *
     c                   eval      wpin03 = *zero
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    wpin03
      *
     c                   endsr
