     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RH620R                                              *
      * Beskrivelse . . : Hovedbok - saldobalanse - utskrift/parameter        *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
T400  * V4.00     260402  Lagt inn parameter om bærer skal spesifiseres   HFL *
T5.30 * V5.30     080904  Lagt inn mulighet for regnskapsår > *year       HFL *
T5.50 * V5.50     220507  Lagt inn parameter om avd. skal spesifiseres.   HFL *
7.xx  * 7.xx      120618  Endringer reltart til ny GUI. NB Kan kun gjelde BKV
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     frh620d    cf   e             workstn
      *
     d                uds
     d rhpkda                300    305  0
     d rhprÅr                         4  0
     d rhpper                         2  0
     d rhppef                         2  0
     d rhppet                         2  0
     d rhpavf                         4  0
     d rhpavt                         4  0
     d rhpbØf                         4  0
     d rhpbØt                         4  0
     d rhpktf                         5  0
     d rhpktt                         5  0
     d rhpsrt                         1
     d rhpsml                         1
     d rhpavv                         1
     d rhpkgs                         1
     d rhpkks                         1
T400 d rhpspb                         1
T5.50d rhpspa                         1
     d rhanul                         1
     d rhpa01                         4  0
     d rhpa02                         4  0
     d rhpa03                         4  0
     d rhpa04                         4  0
     d rhpa05                         4  0
     d rhpa06                         4  0
     d rhpa07                         4  0
     d rhpa08                         4  0
     d rhpa09                         4  0
     d rhpa10                         4  0
     d rhpa11                         4  0
     d rhpa12                         4  0
     d rhpa13                         4  0
     d rhpa14                         4  0
     d rhpa15                         4  0
     d rhpa16                         4  0
     d rhpa17                         4  0
     d rhpa18                         4  0
     d rhpa19                         4  0
     d rhpa20                         4  0
     d rhpa21                         4  0
     d rhpa22                         4  0
     d rhpa23                         4  0
     d rhpa24                         4  0
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d waar            s              4  0
     d wmnd            s              2  0
     d wpakod          s              2  0
     d wpdat1          s              6  0
     d p_in03          s              1
     d wpokok          s              1
     d wwaar           s              2  0
     d w_firm          s                   like(l_firm)
     d w_user          s                   like(l_user)
T5.30d var             s             40    dim(2) ctdata perrcd(1)               Varsel m/svarkrav
T5.30d wsavli          s              2  0
T5.30d wsavpo          s              3  0
      *
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
      *
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      *  Kontroll avdeling
      *
     c                   if        a2pavf > a2pavt                                       .....
     c                   eval      *in31 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll kostnadsbærer
      *
     c                   if        a2pbØf > a2pbØf                                       .....
     c                   eval      *in36 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll konto
      *
     c                   if        a2pktf > a2pktt                                       .....
     c                   eval      *in32 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c                   move      a2pkda        wwaar
      *
     c     *dmy          test(d)                 a2pkda                 33
     c                   if        *in33 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av regnskapsår
T5.30 *  Varsel ved regnskapsår større enn *year
      *
     c                   if        a2prÅr > *year
T5.30c                   movel     var(1)        m1mld1
T5.30c                   movel     var(2)        m1mld2
T5.30c                   move      'N'           m1svar
T5.30c                   exsr      xm1win
T5.30c                   if        m1svar = 'N'
     c                   eval      *in34 = *on                                               .
     c                   goto      a2taga                                                    .
T5.30c                   endif
     c                   endif                                                           .....
      *
      *  Kontroll av periode fra - til
      *
     c                   if        a2ppef > a2ppet                                       .....
     c                   eval      *in35 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Skriv parameter
      *
     c                   move      a2pkda        rhpkda
     c                   move      a2prÅr        rhprÅr
     c                   move      a2pper        rhpper
     c                   move      a2ppef        rhppef
     c                   move      a2ppet        rhppet
     c                   move      a2pavf        rhpavf
     c                   move      a2pavt        rhpavt
     c                   move      a2pbØf        rhpbØf
     c                   move      a2pbØt        rhpbØt
     c                   move      a2pktf        rhpktf
     c                   move      a2pktt        rhpktt
     c                   move      a2psrt        rhpsrt
     c                   move      a2psml        rhpsml
     c                   move      a2pavv        rhpavv
     c                   move      a2pkgs        rhpkgs
     c                   move      a2pkks        rhpkks
T400 c                   move      a2pspb        rhpspb
T5.50c                   move      a2pspa        rhpspa
     c                   move      a2anul        rhanul
     c                   move      a2pa01        rhpa01
     c                   move      a2pa02        rhpa02
     c                   move      a2pa03        rhpa03
     c                   move      a2pa04        rhpa04
     c                   move      a2pa05        rhpa05
     c                   move      a2pa06        rhpa06
     c                   move      a2pa07        rhpa07
     c                   move      a2pa08        rhpa08
     c                   move      a2pa09        rhpa09
     c                   move      a2pa10        rhpa10
     c                   move      a2pa11        rhpa11
     c                   move      a2pa12        rhpa12
     c                   move      a2pa13        rhpa13
     c                   move      a2pa14        rhpa14
     c                   move      a2pa15        rhpa15
     c                   move      a2pa16        rhpa16
     c                   move      a2pa17        rhpa17
     c                   move      a2pa18        rhpa18
     c                   move      a2pa19        rhpa19
     c                   move      a2pa20        rhpa20
     c                   move      a2pa21        rhpa21
     c                   move      a2pa22        rhpa22
     c                   move      a2pa23        rhpa23
     c                   move      a2pa24        rhpa24
      *
      /space 3
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
T5.30 * M1WIN Behandle bilde for melding med svar                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
T5.30c     xm1win        begsr
      *
T5.30c                   eval      wsavli = 6
T5.30c                   eval      wsavpo = 22
T5.30c                   eval      w_arow = wsavli
T5.30c                   eval      w_acol = wsavpo
      *
T5.30c                   exfmt     m1win
      *
T5.30c                   if        *inkc = *on
T5.30c                   move      'N'           m1svar
T5.30c                   endif
      *
T5.30c                   endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   eval      wpdat1 = 0
     c                   eval      wpokok = *blank
      *
      * Legge inn firmanummer
      *
     c                   move      l_user        w_user
     c                   move      l_firm        w_firm
     c                   eval      a2pavf = *zeros
     c                   move      9999          a2pavt
     c                   eval      a2pbØf = *zeros
     c                   move      9999          a2pbØt
     c                   eval      a2pktf = *zeros
     c                   move      99999         a2pktt
     c                   move      'K'           a2psrt
     c                   move      'B'           a2psml
     c                   move      'P'           a2pavv
     c                   move      'J'           a2pkgs
     c                   move      'J'           a2pkks
T400 c                   move      'J'           a2pspb
T5.50c                   move      'N'           a2pspa
     c                   move      'J'           a2anul
      *
     c                   move      udate         a2pkda
      *
      * Beregner periode
      *
     c                   move      *year         waar
      *
     c                   eval      wmnd = *month - 1
      *
     c                   if        wmnd = *zero                                          .....
     c                   movel     12            wmnd                                        .
     c                   eval      waar = waar - 1                                           .
     c                   move      waar          a2prÅr                                      .
     c                   else                                                            .....
     c                   move      waar          a2prÅr                                      .
     c                   endif                                                           .....
      *
     c                   move      wmnd          a2pper
     c                   move      wmnd          a2ppef
     c                   move      wmnd          a2ppet
      *
     c                   eval      p_in03 = ' '
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
     c                   endsr
**
Valgt periode er neste år.
Bekreft dersom dette er riktig.
