      /TITLE  Utskrift av hovedbok - notatblokk  parameter
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RH628R                                              *
      * Beskrivelse . . : Utskrift av hovedbok - notatblokk parameter         *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
6.20  * R6.20     231014  Prosjekt skal være blank, også aktivitet nho
      * --------- ------  ----------------------------------------------------*
      * R5.30     200704  Nytt program.                                  HFL
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
     frh628d    cf   e             workstn
      *
     d s               s              1  0
     d wpakod          s              2  0
     d wpdat1          s              8  0
     d p_in03          s              1
     d w_firm          s                   like(l_firm)
     d w_user          s                   like(l_user)
      *
      *RESKONTRO - Datastruktur for parameter
     d                uds
     d pdato                 300    305  0                                      Pr. dato
     d paarf                          4  0                                      Pr. år
     d paart                          4  0                                      Pr. år
     d pperf                          2  0                                      Periode f.o.m.
     d ppert                          2  0                                      Periode t.o.m.
     d pknrf                          5  0                                      Nr. f.o.m.
     d pknrt                          5  0                                      Nr. t.o.m.
     d pavdf                          4  0                                      Avdeling f.o.m.
     d pavdt                          4  0                                      Avdeling t.o.m.
     d pspef                          4  0                                      Kategori f.o.m.
     d pspet                          4  0                                      Kategori t.o.m.
6.20 d*pprof                          6  0                                      Selger f.o.m.
6.20 d*pprot                          6  0                                      Selger t.o.m.
6.20 d pprof                          6                                         Selger f.o.m.
6.20 d pprot                          6                                         Selger t.o.m.
     d kun                            6  0 dim(10)                              Tabell-enkeltkonti
     d paktf                          3                                         Distrikt f.o.m.
     d paktt                          3                                         Distrikt t.o.m.
     d plagf                          2  0                                      Lager f.o.m
     d plagt                          2  0                                      Lager t.o.m
     d psagr                          1                                         Saldotest(J/N)
     d psabe                          7  0                                      Saldogrense i kroner
     d pktid                          1                                         Kredittest(J/N)
     d pktdg                          5  0                                      Kreditgrense i dager
     d pkgrn                          1                                         Kredit overskredet
     d pedat                         10d   datfmt(*iso)                         Endringsdato
      *
      *  Hva skal skrives på liste                                Valg: J/N=Ja/N
EAS01d pnota                          1                                         Valutabeløp
     d pkper                          1                                         K.person
     d ptlf                           1                                         Tlf.nr
     d pkomp                          1                                         Komprimert
     d psald                          1                                         Kun saldo
     d pkjop                          1                                         Kun saldo
      *
      *  Hvordan skal liste sorteres                              Valg: J/N=Ja/N
     d pkats                          1                                         Kategori
     d pavds                          1                                         Avdeling
     d psels                          1                                         Selger
     d psort                          1                                         Alfa/Numerisk
     d petik                          1  0                                      Etikettype
     d ptype                          1                                         Listetype
     d prabk                          1                                         Rabattkategori
     d ppsla                          1                                         Påslagstabell
     d pssal                          1                                         Stigende saldo
      *
     d l_wsid                901    910                                         Bruker
     d l_user                911    920                                         Bruker
     d l_firm                944    946  0                                      Firma
     d l_fnav                951    980                                         Navn
      *
      /eject
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c                   exfmt     a2bld
      *
     c                   eval      *in31 = *off
     c                   eval      *in32 = *off
     c                   eval      *in33 = *off
     c                   eval      *in34 = *off
     c                   eval      *in35 = *off
     c                   eval      *in36 = *off
     c                   eval      *in37 = *off
     c                   eval      *in38 = *off
     c                   eval      *in39 = *off
     c                   eval      *in40 = *off
     c                   eval      *in41 = *off
     c                   eval      *in42 = *off
     c                   eval      *in43 = *off
     c                   eval      *in44 = *off
     c                   eval      *in45 = *off
     c                   eval      *in46 = *off
     c                   eval      *in47 = *off
     c                   eval      *in48 = *off
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Sjekke om "Eldre enn dato" er gyldig
      *
     c*                  if        a2peda = *zero                                        .....
     c*                  move      *date         a2peda                                      .
     c*                  endif                                                           .....
      *
     c*    *dmy          test(d)                 a2peda                 31
     c*                  if        *in31 = *on                                           .....
     c*                  goto      a2taga                                                    .
     c*                  endif                                                           .....
      *
      *  Kontroll kontonummer
      *
     c                   if        a2pknf > a2pknt                                       .....
     c                   move      *on           *in32                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll avdeling
      *
     c                   if        a2pavf > a2pavt                                       .....
     c                   move      *on           *in33                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll spes.
      *
     c                   if        a2pbØf > a2pbØt                                       .....
     c                   move      *on           *in34                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll prosjekt
      *
     c                   if        a2pprf > a2pprt                                       .....
     c                   move      *on           *in35                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll aktivitet
      *
     c                   if        a2pakf > a2pakt                                       .....
     c                   move      *on           *in36                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll bare konti med notater
      *
     c*                  if        a2pnot <> 'J' and                                     .....
     c*                            a2pnot <> ' '                                             .
     c*                  move      *on           *in37                          Pos.cur.     .
     c*                  goto      a2taga                                                    .
     c*                  endif                                                           .....
      *
      *  Kontroll type sortering
      *
     c*                  if        a2psrt <> 'J' and                                     .....
     c*                            a2psrt <> ' '                                             .
     c*                  move      *on           *in41                          Pos.cur.     .
     c*                  goto      a2taga                                                    .
     c*                  endif                                                           .....
      *
      * Skriv parameter
      *
     c                   move      a2pknf        pknrf
     c                   move      a2pknt        pknrt
     c                   move      a2pavf        pavdf
     c                   move      a2pavt        pavdt
     c                   move      a2pbØf        pspef
     c                   move      a2pbØt        pspet
     c                   move      a2pprf        pprof
     c                   move      a2pprt        pprot
     c                   move      a2pakf        paktf
     c                   move      a2pakt        paktt
     c*    *dmy          move      a2peda        pedat
     c*                  move      a2pnot        pnota
     c*                  move      a2psal        psald
     c*                  move      a2prab        prabk
     c*                  move      a2ppsl        ppsla
     c*                  move      a2psrt        psort
     c*                  move      a2ptyp        ptype
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   eval      wpdat1 = 0
      *
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   move      l_user        w_user
     c                   move      l_firm        w_firm
     c                   eval      a2pknf = *zeros
     c                   move      999999        a2pknt
     c                   eval      a2pavf = *zeros
     c                   move      9999          a2pavt
     c                   eval      a2pbØf = *zeros
     c                   move      9999          a2pbØt
6.20 c*                  eval      a2pprf = *zeros
6.20 c*                  move      999999        a2pprt
     c                   eval      a2pakf = *blanks
6.20 c*                  move      '999'         a2pakt
      *
     c*                  move      udate         a2peda
      *
     c*                  move      'E'           a2ptyp
      *
NAS01c*                  move      'J'           a2pnot
     c*                  move      'J'           a2psrt
      *
      * Hent bruker-record
      *
     c     key03         chain     ausrl1                             63
      *
      *  Sjekk om begrenset til avdeling
      *
     c                   if        abbavd = 'J'                                          .....
     c                   move      *on           *in30                          Protect.     .
     c                   move      absavd        a2pavf                                      .
     c                   move      absavd        a2pavt                                      .
     c                   endif                                                           .....
      *
     c                   eval      p_in03 = ' '
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
      * Key for bruker-file
      *
     c     key03         klist
     c                   kfld                    w_user
      *
     c                   endsr
      /eject
