     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RH630R                                        *
      * Beskrivelse . . : Hovedbok - utskrift/parameter                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                               *
      * Tilpasset for . :                                               *
      *                                                                 *
      * Referanse  Dato   Endringsbeskrivelse                      Sign.*
      * --------- ------  ----------------------------------------------*
T5.30 * V5.30     080904  Lagt inn mulighet for regnskapsår > *year       HFL *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
     frh630d    cf   e             workstn
      *
     d bkt             s              5  0 dim(41)                              KONTI
     d ukt             s              5  0 dim(41)                              KONTI
      *
     d                uds
     d rhpkda                300    305  0
     d rhprÅr                         4  0
     d rhpper                         2  0
     d rhppef                         2  0
     d rhppet                         2  0
     d rhpavf                         4  0
     d rhpavt                         4  0
     d rhpbØf                         4  0
     d rhpbØt                         4  0
     d rhpktf                         5  0
     d rhpktt                         5  0
     d rhpsrt                         1
     d rhpsml                         1
     d rhpavv                         1
     d rhpkgs                         1
     d rhpkks                         1
     d rhpsps                         1
     d rhpktu                         1
     d rhpk01                         5  0
     d rhpk02                         5  0
     d rhpk03                         5  0
     d rhpk04                         5  0
     d rhpk05                         5  0
     d rhpk06                         5  0
     d rhpk07                         5  0
     d rhpk08                         5  0
     d rhpk09                         5  0
     d rhpk10                         5  0
     d rhpk11                         5  0
     d rhpk12                         5  0
     d rhpk13                         5  0
     d rhpk14                         5  0
     d rhpk15                         5  0
     d rhpk16                         5  0
     d rhpk17                         5  0
     d rhpk18                         5  0
     d rhpk19                         5  0
     d rhpk20                         5  0
     d rhpk21                         5  0
     d rhpk22                         5  0
     d rhpk23                         5  0
     d rhpk24                         5  0
     d rhpk25                         5  0
     d rhpk26                         5  0
     d rhpk27                         5  0
     d rhpk28                         5  0
     d rhpk29                         5  0
     d rhpk30                         5  0
     d rhpk31                         5  0
     d rhpk32                         5  0
     d rhpk33                         5  0
     d rhpk34                         5  0
     d rhpk35                         5  0
     d rhpk36                         5  0
     d rhpk37                         5  0
     d rhpk38                         5  0
     d rhpk39                         5  0
     d rhpk40                         5  0
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d flytt           s              1
     d m               s              2  0
     d n               s              2  0
     d o               s              2  0
     d waar            s              4  0
     d wkont           s              5  0
     d wmnd            s              2  0
     d wpakod          s              2  0
     d wpdat1          s              6  0
     d p_in03          s              1
     d wpokok          s              1
     d wwaar           s              2  0
     d w_firm          s                   like(l_firm)
     d w_user          s                   like(l_user)
     d w_navn          s                   like(l_fnav)
T5.30d var             s             40    dim(2) ctdata perrcd(1)               Varsel m/svarkrav
T5.30d wsavli          s              2  0
T5.30d wsavpo          s              3  0
      *
      /eject
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
      *
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      *  Kontroll avdeling
      *
     c                   if        a2pavf > a2pavt                                       .....
     c                   eval      *in31 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll kostnadsbærer
      *
     c                   if        a2pbØf > a2pbØt                                       .....
     c                   eval      *in33 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll konto
      *
     c                   if        a2pktf > a2pktt                                       .....
     c                   eval      *in32 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c                   move      a2pkda        wwaar
      *
     c     *dmy          test(d)                 a2pkda                 33
     c                   if        *in33 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Kontroll av regnskapsår
T5.30 * Varsel ved regnskapsår større enn *year
      *
     c                   if        a2prÅr > *year                                        .....
T5.30c                   movel     var(1)        m1mld1
T5.30c                   movel     var(2)        m1mld2
T5.30c                   move      'N'           m1svar
T5.30c                   exsr      xm1win
T5.30c                   if        m1svar = 'N'
     c                   eval      *in34 = *on                                               .
     c                   goto      a2taga                                                    .
T5.30c                   endif
     c                   endif                                                           .....
      *
      * Kontroll av periode fra - til
      *
     c                   if        a2ppef > a2ppet                                       .....
     c                   eval      *in35 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Sjekk konti i tabell
      *
     c                   move      a2pk01        bkt(01)
     c                   move      a2pk01        bkt(01)
     c                   move      a2pk02        bkt(02)
     c                   move      a2pk03        bkt(03)
     c                   move      a2pk04        bkt(04)
     c                   move      a2pk05        bkt(05)
     c                   move      a2pk06        bkt(06)
     c                   move      a2pk07        bkt(07)
     c                   move      a2pk08        bkt(08)
     c                   move      a2pk09        bkt(09)
     c                   move      a2pk10        bkt(10)
     c                   move      a2pk11        bkt(11)
     c                   move      a2pk12        bkt(12)
     c                   move      a2pk13        bkt(13)
     c                   move      a2pk14        bkt(14)
     c                   move      a2pk15        bkt(15)
     c                   move      a2pk16        bkt(16)
     c                   move      a2pk17        bkt(17)
     c                   move      a2pk18        bkt(18)
     c                   move      a2pk19        bkt(19)
     c                   move      a2pk20        bkt(20)
     c                   move      a2pk20        bkt(20)
     c                   move      a2pk21        bkt(21)
     c                   move      a2pk22        bkt(22)
     c                   move      a2pk23        bkt(23)
     c                   move      a2pk24        bkt(24)
     c                   move      a2pk25        bkt(25)
     c                   move      a2pk26        bkt(26)
     c                   move      a2pk27        bkt(27)
     c                   move      a2pk28        bkt(28)
     c                   move      a2pk29        bkt(29)
     c                   move      a2pk30        bkt(30)
     c                   move      a2pk31        bkt(31)
     c                   move      a2pk32        bkt(32)
     c                   move      a2pk33        bkt(33)
     c                   move      a2pk34        bkt(34)
     c                   move      a2pk35        bkt(35)
     c                   move      a2pk36        bkt(36)
     c                   move      a2pk37        bkt(37)
     c                   move      a2pk38        bkt(38)
     c                   move      a2pk39        bkt(39)
     c                   move      a2pk40        bkt(40)
      *
     c                   eval      m = *zeros
     c                   eval      n = *zeros
      *
      * Dersom valg av enkeltkonti- flytt foran i tabell
      *
     c     1             do        40            n                                       .....
      *                                                                 .
     c                   if        bkt(n) <> *zeros                                   .....  .
     c                   eval      m = m + 1                                              .  .
     c                   move      bkt(n)        ukt(m)                                   .
      *                                                              .  .
      * Sjekk om konto fra - til og                                  .  .
      * konto i tabell overlapper hverandre                          .  .
      *                                                              .  .
     c                   if        a2pktu <> 'U'                                          .  .
     c                   if        bkt(n) >= a2pktf                                       .  .
     c                   if        bkt(n) <= a2pktt                                       .  .
     c                   eval      *in36 = *on                                            .  .
     c                   goto      a2taga                                                 .  .
     c                   endif                                                            .  .
     c                   endif                                                            .  .
     c                   endif                                                            .  .
      *                                                              .  .
     c                   endif                                                        .....  .
      *                                                                 .
     c                   enddo                                                           .....
      *
      * Sorter tabell
      *
     c     ftab          tag
      *
     c                   eval      wkont = *zeros
     c                   eval      o = 1
     c                   eval      flytt = *blank                                         .  .
      *
     c     1             do        m             n                                       .....
      *                                                                 .
     c                   eval      o = o + 1                                                 .
      *                                                                 .
     c                   if        ukt(o) <> *zero                                    .....  .
     c                   if        ukt(o) < ukt(n)                                        .  .
     c                   move      ukt(n)        wkont                                    .  .
     c                   move      ukt(o)        ukt(n)                                   .  .
     c                   move      wkont         ukt(o)                                   .  .
     c                   move      'F'           flytt                                    .  .
     c                   endif                                                            .  .
     c                   endif                                                        .....  .
      *                                                                 .
     c                   enddo                                                           .....
      *                                                                 .
     c                   if        flytt = 'F'                                        .....  .
     c                   goto      ftab
     c                   endif
      *
      * Skriv parameter
      *
     c                   move      a2pkda        rhpkda
     c                   move      a2prÅr        rhprÅr
     c                   move      a2ppef        rhpper
     c                   move      a2ppef        rhppef
     c                   move      a2ppet        rhppet
     c                   move      a2pavf        rhpavf
     c                   move      a2pavt        rhpavt
     c                   move      a2pbØf        rhpbØf
     c                   move      a2pbØt        rhpbØt
     c                   move      a2pktf        rhpktf
     c                   move      a2pktt        rhpktt
     c                   move      ukt(01)       rhpk01
     c                   move      ukt(01)       rhpk01
     c                   move      ukt(02)       rhpk02
     c                   move      ukt(03)       rhpk03
     c                   move      ukt(04)       rhpk04
     c                   move      ukt(05)       rhpk05
     c                   move      ukt(06)       rhpk06
     c                   move      ukt(07)       rhpk07
     c                   move      ukt(08)       rhpk08
     c                   move      ukt(09)       rhpk09
     c                   move      ukt(10)       rhpk10
     c                   move      ukt(11)       rhpk11
     c                   move      ukt(12)       rhpk12
     c                   move      ukt(13)       rhpk13
     c                   move      ukt(14)       rhpk14
     c                   move      ukt(15)       rhpk15
     c                   move      ukt(16)       rhpk16
     c                   move      ukt(17)       rhpk17
     c                   move      ukt(18)       rhpk18
     c                   move      ukt(19)       rhpk19
     c                   move      ukt(20)       rhpk20
     c                   move      ukt(20)       rhpk20
     c                   move      ukt(21)       rhpk21
     c                   move      ukt(22)       rhpk22
     c                   move      ukt(23)       rhpk23
     c                   move      ukt(24)       rhpk24
     c                   move      ukt(25)       rhpk25
     c                   move      ukt(26)       rhpk26
     c                   move      ukt(27)       rhpk27
     c                   move      ukt(28)       rhpk28
     c                   move      ukt(29)       rhpk29
     c                   move      ukt(30)       rhpk30
     c                   move      ukt(31)       rhpk31
     c                   move      ukt(32)       rhpk32
     c                   move      ukt(33)       rhpk33
     c                   move      ukt(34)       rhpk34
     c                   move      ukt(35)       rhpk35
     c                   move      ukt(36)       rhpk36
     c                   move      ukt(37)       rhpk37
     c                   move      ukt(38)       rhpk38
     c                   move      ukt(39)       rhpk39
     c                   move      ukt(40)       rhpk40
     c                   move      a2pktu        rhpktu
     c                   move      a2psrt        rhpsrt
     c                   eval      rhpsps = *blank
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
T5.30 * M1WIN Behandle bilde for melding med svar                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
T5.30c     xm1win        begsr
      *
T5.30c                   eval      wsavli = 6
T5.30c                   eval      wsavpo = 22
T5.30c                   eval      w_arow = wsavli
T5.30c                   eval      w_acol = wsavpo
      *
T5.30c                   exfmt     m1win
      *
T5.30c                   if        *inkc = *on
T5.30c                   move      'N'           m1svar
T5.30c                   endif
      *
T5.30c                   endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   eval      wpdat1 = 0
     c                   eval      wpokok = *blank
      *
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   move      l_user        w_user
     c                   move      l_firm        w_firm
     c                   move      l_fnav        w_navn
     c                   eval      a2pavf = *zeros
     c                   move      9999          a2pavt
     c                   eval      a2pbØf = *zeros
     c                   move      9999          a2pbØt
     c                   eval      a2pktf = *zeros
     c                   move      99999         a2pktt
     c                   move      'K'           a2psrt
     c                   move      ' '           a2pktu
      *
     c                   move      udate         a2pkda
      *
      * Beregner periode
      *
     c                   move      *year         waar
      *
     c                   eval      wmnd = *month - 1
     c                   if        wmnd = *zero                                          .....
     c                   movel     12            wmnd                                        .
     c                   eval      waar = waar - 1                                           .
     c                   move      waar          a2prÅr                                      .
     c                   else                                                                .
     c                   move      waar          a2prÅr                                      .
     c                   endif                                                           .....
      *
     c                   move      wmnd          a2ppef
     c                   move      wmnd          a2ppet
      *
      * Hent bruker-record
      *
     c     ausrl1_key    chain     ausrl1                             63
      *
      *  Sjekk om begrenset til avdeling
      *
     c                   if        abbavd = '1'                                          .....
     c                   eval      *in30 = *on                                               .
     c                   move      absavd        a2pavf                                      .
     c                   move      absavd        a2pavt                                      .
     c                   move      'K'           a2psrt                                      .
     c                   endif                                                           .....
      *
     c                   eval      p_in03 = ' '
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
      * Key for bruker-file
      *
     c     ausrl1_key    klist
     c                   kfld                    w_user
      *
     c                   endsr
**
Valgt periode er neste år.
Bekreft dersom dette er riktig.
