     h/TITLE  Stikkprøver,hovedbok - parameter
     h datedit(*dmy)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RF653R                                              *
      * Beskrivelse . . : Stikkprøver,hovedbok  - parameter                   *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *                                                                       *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     frh653d    cf   e             workstn
      *
     d                uds
     d rhpfir                300    302  0
     d rhpnav                        30
     d rhpusr                        10
     d rhpkda                         6  0
     d rhprÅr                         4  0
     d rhpper                         2  0
     d rhppef                         2  0
     d rhppet                         2  0
     d rhpavf                         4  0
     d rhpavt                         4  0
     d rhpktf                         5  0
     d rhpktt                         5  0
     d rhpsrt                         1
     d rhpbel                384    394  2
     d rhpran                         4  0
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d waar            s              4  0
     d wmnd            s              2  0
     d w_in03          s              1
     d w_aar           s              2  0
     d w_firm          s                   like(l_firm)
     d w_user          s                   like(l_user)
      *
      *
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
     c/eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
     c                   exfmt     a2bld
      *
      * Gå ut
      *
B001 c                   if        *inkc = *on                                  .....
 001 c                   eval      w_in03 = '1'                                     .
 001 c                   goto      xslutt                                           .
E001 c                   endif                                                  .....
      *
      *  Kontroll avdeling
      *
B001 c                   if        a2pavt = *zeros                                       .....
 001 c                   eval      a2pavt = a2pavf                                           .
E001 c                   endif                                                           .....
      *
B001 c                   if        a2pavf > a2pavt                                       .....
 001 c                   eval      *in31 = *on                                               .
 001 c                   goto      a2taga                                                    .
E001 c                   endif                                                           .....
      *
      *  Kontroll konto
      *
B001 c                   if        a2pktt = *zeros                                       .....
 001 c                   eval      a2pktt = a2pktf                                           .
E001 c                   endif                                                           .....
      *
B001 c                   if        a2pktf > a2pktt                                       .....
 001 c                   eval      *in32 = *on                                               .
 001 c                   goto      a2taga                                                    .
E001 c                   endif                                                           .....
      *
      * Sjekke om kjøredato er gyldig
      *
      *
      * Kontroll av regnskapsår
      *
B001 c                   if        a2prÅr > *year                                        .....
 001 c                   eval      *in34 = *on                                               .
 001 c                   goto      a2taga                                                    .
E001 c                   endif                                                           .....
      *
      * Kontroll av periode fra - til
      *
B001 c                   if        a2ppef > a2ppet                                       .....
 001 c                   eval      *in35 = *on                                               .
 001 c                   goto      a2taga                                                    .
E001 c                   endif                                                           .....
      *
      * Skriv parameter
      *
     c                   eval      rhpfir = l_firm
     c                   eval      rhpnav = l_fnav
     c                   eval      rhpusr = w_user
     c                   eval      rhpkda = a2pkda
     c                   eval      rhprÅr = a2prÅr
     c                   eval      rhppef = a2ppef
     c                   eval      rhppet = a2ppet
     c                   eval      rhpavf = a2pavf
     c                   eval      rhpavt = a2pavt
     c                   eval      rhpktf = a2pktf
     c                   eval      rhpktt = a2pktt
     c                   eval      rhpbel = a2pbel
     c                   eval      rhpran = a2pran
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      w_user = l_user
     c                   eval      w_firm = l_firm
     c                   eval      a2pavf = *zeros
     c                   eval      a2pavt = 9999
     c                   eval      a2pktf = *zeros
     c                   eval      a2pktt = 99999
     c                   eval      a2pbel = *zeros
     c                   eval      a2pran = *zeros
      *
     c                   eval      a2pkda = udate
      *
      * Beregner periode
      *
     c                   eval      waar = *year
      *
     c     *month        sub       1             wmnd
B001 c                   if        wmnd = *zero                                          .....
 001 c                   movel     12            wmnd                                        .
 001 c     waar          sub       1             waar                                        .
 001 c                   eval      a2prÅr = waar                                             .
X001 c                   else                                                                .
 001 c                   eval      a2prÅr = waar                                             .
E001 c                   endif                                                           .....
      *
     c                   eval      a2ppef = 01
     c                   eval      a2ppet = wmnd
      *
     c                   eval      w_in03 = ' '
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_in03
      *
     c                   endsr
