     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RH655R                                              *
      * Beskrivelse . . : Hovedbok - tabellarisk - utskrift/parameter         *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     frh655d    cf   e             workstn
      *
     d                uds
     d rhpkda                300    305  0
     d rhprÅr                         4  0
     d rhpper                         2  0
     d rhppef                         2  0
     d rhppet                         2  0
     d rhpavf                         4  0
     d rhpavt                         4  0
     d rhpbØf                         4  0
     d rhpbØt                         4  0
     d rhpktf                         5  0
     d rhpktt                         5  0
     d rhpsrt                         1
     d rhpsml                         1
     d rhpavv                         1
     d rhpkgs                         1
     d rhpkks                         1
T400 d rhpspb                         1
     d rhanul                         1
     d rhpa01                         4  0
     d rhpa02                         4  0
     d rhpa03                         4  0
     d rhpa04                         4  0
     d rhpa05                         4  0
     d rhpa06                         4  0
     d rhpa07                         4  0
     d rhpa08                         4  0
     d rhpa09                         4  0
     d rhpa10                         4  0
     d rhpa11                         4  0
     d rhpa12                         4  0
     d rhpa13                         4  0
     d rhpa14                         4  0
     d rhpa15                         4  0
     d rhpa16                         4  0
     d rhpa17                         4  0
     d rhpa18                         4  0
     d rhpa19                         4  0
     d rhpa20                         4  0
     d rhpa21                         4  0
     d rhpa22                         4  0
     d rhpa23                         4  0
     d rhpa24                         4  0
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d waar            s              4  0
     d wmnd            s              2  0
     d wpakod          s              2  0
     d wpdat1          s              6  0
     d p_in03          s              1
     d wpokok          s              1
     d wwaar           s              2  0
     d w_firm          s                   like(l_firm)
     d w_user          s                   like(l_user)
      *
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
      *
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      *  Kontroll avdeling
      *
     c                   if        a2pavf > a2pavt                                       .....
     c                   eval      *in31 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll kostnadsbærer
      *
     c                   if        a2pbØf > a2pbØf                                       .....
     c                   eval      *in36 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll konto
      *
     c                   if        a2pktf > a2pktt                                       .....
     c                   eval      *in32 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c                   move      a2pkda        wwaar
      *
     c     *dmy          test(d)                 a2pkda                 33
     c                   if        *in33 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av regnskapsår
      *
     c                   if        a2prÅr > *year                                        .....
     c                   eval      *in34 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av periode fra - til
      *
     c                   if        a2ppef > a2ppet                                       .....
     c                   eval      *in35 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Skriv parameter
      *
     c                   move      a2pkda        rhpkda
     c                   move      a2prÅr        rhprÅr
     c                   move      a2pper        rhpper
     c                   move      a2ppef        rhppef
     c                   move      a2ppet        rhppet
     c                   move      a2pavf        rhpavf
     c                   move      a2pavt        rhpavt
     c                   move      a2pbØf        rhpbØf
     c                   move      a2pbØt        rhpbØt
     c                   move      a2pktf        rhpktf
     c                   move      a2pktt        rhpktt
     c                   move      a2psrt        rhpsrt
     c                   move      'B'           rhpsml
     c                   move      'P'           rhpavv
     c                   move      'J'           rhpkgs
     c                   move      'J'           rhpkks
T400 c                   move      'J'           rhpspb
     c                   move      'J'           rhanul
      *
      /space 3
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   eval      wpdat1 = 0
     c                   eval      wpokok = *blank
      *
      * Legge inn firmanummer
      *
     c                   move      l_user        w_user
     c                   move      l_firm        w_firm
     c                   eval      a2pavf = *zeros
     c                   move      9999          a2pavt
     c                   eval      a2pbØf = *zeros
     c                   move      9999          a2pbØt
     c                   eval      a2pktf = *zeros
     c                   move      99999         a2pktt
     c                   move      'K'           a2psrt
      *
     c                   move      udate         a2pkda
      *
      * Beregner periode
      *
     c                   move      *year         waar
      *
     c                   eval      wmnd = *month - 1
      *
     c                   if        wmnd = *zero                                          .....
     c                   movel     12            wmnd                                        .
     c                   eval      waar = waar - 1                                           .
     c                   move      waar          a2prÅr                                      .
     c                   else                                                            .....
     c                   move      waar          a2prÅr                                      .
     c                   endif                                                           .....
      *
     c                   move      wmnd          a2pper
     c                   move      wmnd          a2ppef
     c                   move      wmnd          a2ppet
      *
     c                   eval      p_in03 = ' '
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
     c                   endsr
