     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RH662R                                        *
      * Beskrivelse . . : Hovedbok - mva-oppgave på nytt - parameter    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                               *
      * Tilpasset for . :                                               *
      *                                                                 *
      * Referanse  Dato   Endringsbeskrivelse                      Sign.*
      * --------- ------  ----------------------------------------------*
      * V5.40     110806  Nytt program                             HFL
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
     frh662d    cf   e             workstn
      *
     d                uds
     d rhpkda                300    305  0
     d rhprÅr                         4  0
     d rhpper                         2  0
     d rhpmva                         1  0
     d rhpmv0                         1
     d rhptst                         1
     d rhpost                         1
     d rhpsps                         1
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d wpakod          s              2  0
     d wpdat1          s              6  0
     d p_in03          s              1
     d wpokok          s              1
     d wwaar           s              2  0
     d w_firm          s              3  0
     d w_user          s                   like(l_user)
     d w_navn          s                   like(l_fnav)
     d var             s             40    dim(2) ctdata perrcd(1)               Varsel m/svarkrav
     d wsavli          s              2  0
     d wsavpo          s              3  0
      *
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c                   move      a2pkda        wwaar
      *
     c     *dmy          test(d)                 a2pkda                 33
     c                   if        *in33 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av regnskapsår
      *  Varsel ved regnskapsår større enn *year
      *
     c                   if        a2prÅr > *year                                        .....
     c                   movel     var(1)        m1mld1
     c                   movel     var(2)        m1mld2
     c                   move      'N'           m1svar
     c                   exsr      xm1win
     c                   if        m1svar = 'N'
     c                   eval      *in34 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif
     c                   endif                                                           .....
      *
      * Skriv parameter til LDA
      *
     c                   move      a2pkda        rhpkda
     c                   move      a2prÅr        rhprÅr
     c                   move      a2pper        rhpper
     c                   move      a2pmva        rhpmva
     c                   move      a2pmv0        rhpmv0
E5.40c                   move      'O'           rhptst
     c                   move      a2psps        rhpsps
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * M1WIN Behandle bilde for melding med svar                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xm1win        begsr
      *
     c                   eval      wsavli = 6
     c                   eval      wsavpo = 22
     c                   eval      w_arow = wsavli
     c                   eval      w_acol = wsavpo
      *
     c                   exfmt     m1win
      *
     c                   if        *inkc = *on
     c                   move      'N'           m1svar
     c                   endif
      *
     c                   endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
      *
     c                   eval      wpdat1 = 0
     c                   eval      wpokok = *blank
      *
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   move      l_user        w_user
     c                   move      l_firm        w_firm
     c                   movel     l_fnav        w_navn
      *
     c                   move      udate         a2pkda
      *
      * Sett inn std.verdier i parameterbilde
      *
     c                   if        *month = 01                                           .....
     c                             or *month = 02                                            .
     c                   eval      a2prÅr = *year - 1                                        .
     c                   move      12            a2pper                                      .
     c                   move      6             a2pmva                                      .
     c                   endif                                                           .....
      *
     c                   if        *month = 03                                           .....
     c                             or *month = 04                                            .
     c                   move      *year         a2prÅr                                      .
     c                   move      02            a2pper                                      .
     c                   move      1             a2pmva                                      .
     c                   endif                                                           .....
      *
     c                   if        *month = 05                                           .....
     c                             or *month = 06                                            .
     c                   move      *year         a2prÅr                                      .
     c                   move      04            a2pper                                      .
     c                   move      2             a2pmva                                      .
     c                   endif                                                           .....
      *
     c                   if        *month = 07                                           .....
     c                             or *month = 08                                            .
     c                   move      *year         a2prÅr                                      .
     c                   move      06            a2pper                                      .
     c                   move      3             a2pmva                                      .
     c                   endif                                                           .....
      *
     c                   if        *month = 09                                           .....
     c                             or *month = 10                                            .
     c                   move      *year         a2prÅr                                      .
     c                   move      08            a2pper                                      .
     c                   move      4             a2pmva                                      .
     c                   endif                                                           .....
      *
     c                   if        *month = 11                                           .....
     c                             or *month = 12                                            .
     c                   move      *year         a2prÅr                                      .
     c                   move      10            a2pper                                      .
     c                   move      5             a2pmva                                      .
     c                   endif                                                           .....
      *
     c                   move      'N'           a2pmv0
     c*                  move      'J'           a2ptst
     c                   move      'N'           a2psps
     c                   eval      p_in03 = ' '
      *
      * Hent bruker-record
      *
     c     ausrl1_key    chain     ausrl1                             63
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
      * Key for bruker-file
      *
     c     ausrl1_key    klist
     c                   kfld                    w_user
      *
     c                   endsr
**
Valgt periode er neste år.
Bekreft dersom dette er riktig.
