     H datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RH964R                                              *
      * Beskrivelse . . : Hovedbok omkjøring av journal - parameter           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
     frh964d    cf   e             workstn
      *
     d                uds
     d rhpkda                300    305  0
     d rhprÅr                         4  0
     d rhpper                         2  0
     d rhppef                         2  0
     d rhppet                         2  0
     d rhpavf                         4  0
     d rhpavt                         4  0
     d rhpjof                         5  0
     d rhpjot                         5  0
     d rhpsrt                         1
     d rhpsml                         1
     d rhpavv                         1
     d rhpkgs                         1
     d rhpkks                         1
     d rhpsps                         1
     d rhpktu                         1
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d waar            s              4  0
     d wmnd            s              2  0
     d wpakod          s              2  0
     d p_in03          s              1
      *
     d w_user          s                   like(l_user)
     d w_firm          s                   like(l_firm)
     d w_navn          s                   like(l_fnav)
      *
      /eject
     c     dummy         tag
      *
      * Benyttede skjermbilder.
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
      *
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Kontroll av regnskapsår
      *
     c                   if        a2prÅr > *year                                        .....
     c                   eval      *in34 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Kontroll av journal fra - til
      *
     c                   if        a2pktf = *zero                                        .....
     c                   if        a2pktt = *zero                                            .
     c                   move      00001         a2pktf                                      .
     c                   move      99999         a2pktt                                      .
     c                   endif                                                               .
     c                   endif                                                           .....
      *
      * Skriv parameter
      *
     c                   move      a2prÅr        rhprÅr
     c                   move      a2pktf        rhpjof
     c                   move      a2pktt        rhpjot
      *
      /space 3
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   eval      p_in03 = ' '
      *
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   move      l_user        w_user
     c                   move      l_firm        w_firm
      *
      * Beregner periode
      *
     c                   move      *year         waar
      *
     c                   eval      wmnd = *month - 1
     c                   if        wmnd = *zero                                          .....
     c                   movel     12            wmnd                                        .
     c                   eval      waar = waar - 1                                           .
     c                   move      waar          a2prÅr                                      .
     c                   else                                                                .
     c                   move      waar          a2prÅr                                      .
     c                   endif                                                           .....
      *
      * Hent bruker-record
      *
     c     ausrl1_key    chain     ausrl1                             63
      *
      *  Sjekk om begrenset til avdeling
      *
     c                   if        abbavd = '1'                                          .....
     c                   eval      *in30 = *on                                               .
     c                   endif                                                           .....
      *
      * Sett kode for styring av overskrift på journal
      *
E5.00c                   eval      rhpsml = ' '
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
      * Key for bruker-file
      *
     c     ausrl1_key    klist
     c                   kfld                    w_user
      *
     c                   endsr
