      /TITLE  Kvalitetskontroll kunderegister - parameter
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK624R                                              *
      * Beskrivelse . . : Kvalitetskontroll kunderegisterer - parameter       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ----------------------------------------------------*
      * V5.50     201005  Nytt program                                   KOB  *
7.xx  * 7.xx      180516  Endringer reltart til ny GUI. NB Kan kun gjelde BSA
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *   * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
     frk624d    cf   e             workstn
      *
     d                uds
     d l_katf                300    303  0
     d l_katt                         4  0
     d l_kadr                         1
     d l_kstd                         1
     d l_kkat                         1
     d l_korg                         1
     d l_kpnr                         1
     d l_kkpe                         1
     d l_kema                         1
     d l_ktlf                         1
     d l_kfax                         1
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d p_in03          s              1
     d p_kode          s              4  0
     d p_tx30          s             30
     d w_firm          s              3  0
      *
      /eject
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c                   exfmt     a2bld
      *
     c                   eval      *in31 = *off
     c                   eval      *in32 = *off
     c                   eval      *in33 = *off
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Spørring
      *
     c                   if        *inkd = *on
     c                   exsr      spr_rut
     c                   goto      a2taga
     c                   endif
      *
      *  Kontroll kundekategori
      *
     c                   if        a2katf > a2katt                                       .....
     c                   move      *on           *in34                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Skriv parameter til local
      *
     c                   eval      l_katf = a2katf
     c                   eval      l_katt = a2katt
     c                   eval      l_kadr = a2kadr
     c                   eval      l_kstd = a2kstd
     c                   eval      l_kkat = a2kkat
     c                   eval      l_korg = a2korg
     c                   eval      l_kpnr = a2kpnr
     c                   eval      l_kkpe = a2kkpe
     c                   eval      l_kema = a2kema
     c                   eval      l_ktlf = a2ktlf
     c                   eval      l_kfax = a2kfax
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      /eject
      *
      * Subrutine for forespørsel
      *
     c     spr_rut       begsr
      *
      * Call program for kundekategori fra
      *
     c                   if        w_afld = 'A2KATF'
     c                   eval      p_kode = a2katf
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2katf = p_kode
     c                   eval      *in53 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for kundekategori til
      *
     c                   if        w_afld = 'a2katt'
     c                   eval      p_kode = a2katt
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2katt = p_kode
     c                   eval      *in54 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
     c     end_spr_rut   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   eval      a2katf = *zeros
     c                   move      9999          a2katt
      *
     c                   eval      p_in03 = ' '
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
     c                   endsr
      /eject
