      /TITLE  Utskrift av kundeetiketter - parameter
     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK622R                                        *
      * Beskrivelse . . : Utskrift av kundeetiketter - parameter        *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                               *
      * Tilpasset for . :                                               *
      *                                                                 *
      * Referanse  Dato   Endringsbeskrivelse                      Sign.*
      * --------- ------  ----------------------------------------------*
      * V5.30     090304  Lagt inn spørrefunksjoner i skjermbildet  KOB *     *
      * V5.40     190406  Kan skrive kontaktperson (laser)          HFL *
      * V5.50     070607  Kan velge inntil 21 enkeltkunder.         HFL *
      * V5.50     210607  Kontaktperson er ikke i kunderegister.    HFL *
6.20  * V6.20     090907  Endret lengde på distrikt                 NHO *
7.xx  * 7.xx      180516  Endringer reltart til ny GUI. NB Kan kun gjelde BSA
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
     frk622d    cf   e             workstn
T5.50frkunlr    if   e           k disk    rename(rkunpfr:rkunlrr)
      *
T5.50d n               s              2  0
T5.50d rkunlr_kund     s                   like(rkkund)
T5.50d wkun            s              8  0
     d wpakod          s              2  0
     d wpdat1          s              8  0
      *
     d p_in03          s              1
     d p_stat          s              1
     d p_kode          s              4  0
     d p_kund          s              6  0
6.20 d*p_dist          s              2  0
6.20 d p_dist          s              4  0
     d p_lagr          s              2  0
     d p_tx30          s             30
      *
     d w_firm          s              3  0
     d wpokok          s              1
      *
T5.50 *RESKONTRO - Datastruktur for parameter
     d                uds
     d pdato                 300    305  0                                      Pr. dato
     d paarf                          4  0                                      Pr. år
     d paart                          4  0                                      Pr. år
     d pperf                          2  0                                      Periode f.o.m.
     d ppert                          2  0                                      Periode t.o.m.
     d pavdf                          4  0                                      Avdeling f.o.m.
     d pavdt                          4  0                                      Avdeling t.o.m.
     d pkatf                          4  0                                      Kategori f.o.m.
     d pkatt                          4  0                                      Kategori t.o.m.
     d pself                          4  0                                      Selger f.o.m.
     d pselt                          4  0                                      Selger t.o.m.
     d pknrf                          6  0                                      Nr. f.o.m.
     d pknrt                          6  0                                      Nr. t.o.m.
     d kun                            6  0 dim(21)                              Tabell-enkeltkunder
6.20 d*pdisf                          2  0                                      Distrikt f.o.m.
6.20 d pdisf                          4  0                                      Distrikt f.o.m.
6.20 d*pdist                          2  0                                      Distrikt t.o.m.
6.20 d pdist                          4  0                                      Distrikt t.o.m.
     d plagf                          2  0                                      Lager f.o.m
     d plagt                          2  0                                      Lager t.o.m
     d psagr                          1                                         Saldotest(J/N)
     d psabe                          7  0                                      Saldogrense i kroner
     d pktid                          1                                         Kredittest(J/N)
     d pktdg                          5  0                                      Kreditgrense i dager
     d pkgrn                          1                                         Kredit overskredet
     d pedat                         10d   datfmt(*iso)                         Endringsdato
     d ppass                          1                                         Passive
      *
      *  Hva skal skrives på liste                                Valg: J/N=Ja/N
     d pvalu                          1                                         Valutabeløp
     d pkper                          1                                         K.person
     d ptlf                           1                                         Tlf.nr
     d pkomp                          1                                         Komprimert
     d psald                          1                                         Kun saldo
     d pkjop                          1                                         Kun saldo
      *
      *  Hvordan skal liste sorteres                              Valg: J/N=Ja/N
     d pkats                          1                                         Kategori
     d pavds                          1                                         Avdeling
     d psels                          1                                         Selger
     d psort                          1                                         Alfa/Numerisk
     d petik                          1  0                                      Etikettype
     d ptype                          1                                         Listetype
     d prabk                          1                                         Rabattkategori
     d ppsla                          1                                         Påslagstabell
     d pssal                          1                                         Stigende saldo
      *
     d l_wsid                901    910                                         Bruker
     d l_user                911    920                                         Bruker
     d l_firm                944    946  0                                      Firma
     d l_fnav                951    980                                         Navn
      *
      /eject
     c     dummy         tag
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c                   eval      *in31 = *off
     c                   eval      *in32 = *off
     c                   eval      *in33 = *off
     c                   eval      *in34 = *off
     c                   eval      *in35 = *off
     c                   eval      *in36 = *off
     c                   eval      *in37 = *off
     c                   eval      *in38 = *off
      *
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Spørring
      *
     c                   if        *inkd = *on
     c                   exsr      spr_rut
     c                   goto      a2taga
     c                   endif
      *
      *  Kontroll kundenummer
      *
     c                   if        a2pknf > a2pknt                                       .....
     c                   move      *on           *in32                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll avdeling
      *
     c                   if        a2pavf > a2pavt                                       .....
     c                   move      *on           *in33                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll kundekategori
      *
     c                   if        a2pkaf > a2pkat                                       .....
     c                   move      *on           *in34                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll selger
      *
     c                   if        a2psef > a2pset                                       .....
     c                   move      *on           *in35                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll distrikt
      *
     c                   if        a2pdif > a2pdit                                       .....
     c                   move      *on           *in36                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
T5.50 *  Kontroll av enkelt-kunder
      *
     c                   move      a2pkn1        kun(01)
     c                   move      a2pkn2        kun(02)
     c                   move      a2pkn3        kun(03)
     c                   move      a2pkn4        kun(04)
     c                   move      a2pkn5        kun(05)
     c                   move      a2pkn6        kun(06)
     c                   move      a2pkn7        kun(07)
     c                   move      a2pkn8        kun(08)
     c                   move      a2pkn9        kun(09)
     c                   move      a2pk10        kun(10)
     c                   move      a2pk11        kun(11)
     c                   move      a2pk12        kun(12)
     c                   move      a2pk13        kun(13)
     c                   move      a2pk14        kun(14)
     c                   move      a2pk15        kun(15)
     c                   move      a2pk16        kun(16)
     c                   move      a2pk17        kun(17)
     c                   move      a2pk18        kun(18)
     c                   move      a2pk19        kun(19)
     c                   move      a2pk20        kun(20)
     c                   move      a2pk21        kun(21)
      *
     c                   xfoot     kun           wkun
      *
     c                   eval      n = 1
     c                   if        wkun <> 0                                             .....
      *                                                                 .
     c                   dou       n > 21                                                ... .
      *                                                               . .
     c                   if        kun(n) <> *zeros                                        . .
     c                   move      kun(n)        rkunlr_kund                               . .
     c     rkunlr_key    chain     rkunlr                                                  . .
      *                                                               . .
     c                   if        not%found                                               . .
     c                   move      *on           *in47                          Pos.cur.     .
     c                   eval      *in11 = n = 1                                           . .
     c                   eval      *in12 = n = 2                                           . .
     c                   eval      *in13 = n = 3                                           . .
     c                   eval      *in14 = n = 4                                           . .
     c                   eval      *in15 = n = 5                                           . .
     c                   eval      *in16 = n = 6                                           . .
     c                   eval      *in17 = n = 7                                           . .
     c                   eval      *in18 = n = 8                                           . .
     c                   eval      *in19 = n = 9                                           . .
     c                   eval      *in20 = n = 10                                          . .
     c                   eval      *in21 = n = 11                                          . .
     c                   eval      *in22 = n = 12                                          . .
     c                   eval      *in23 = n = 13                                          . .
     c                   eval      *in24 = n = 14                                          . .
     c                   eval      *in25 = n = 15                                          . .
     c                   eval      *in26 = n = 16                                          . .
     c                   eval      *in27 = n = 17                                          . .
     c                   eval      *in28 = n = 18                                          . .
     c                   eval      *in29 = n = 19                                          . .
     c                   eval      *in70 = n = 20                                          . .
     c                   eval      *in70 = n = 21                                          . .
     c                   eval      *in96 = *on                                             . .
     c                   goto      a2taga                                                  . .
     c                   endif                                                             . .
      *                                                               . .
     c                   endif                                                             . .
      *                                                               . .
     c                   eval      n = n + 1                                               . .
      *                                                               . .
     c                   enddo                                                           ... .
      *
     c                   endif                                                           .....
      *
      *  Kontroll type etiketter
      *
     c                   if        a2peti <> 1 and                                       .....
     c                             a2peti <> 3 and                                           .
     c                             a2peti <> 4                                               .
     c                   move      *on           *in37                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                               .
      *
      * Skriv parameter
      *
     c                   move      a2pknf        pknrf
     c                   move      a2pknt        pknrt
     c                   move      a2pavf        pavdf
     c                   move      a2pavt        pavdt
     c                   move      a2pkaf        pkatf
     c                   move      a2pkat        pkatt
     c                   move      a2psef        pself
     c                   move      a2pset        pselt
     c                   move      a2pdif        pdisf
     c                   move      a2pdit        pdist
     c                   move      a2plaf        plagf
     c                   move      a2plat        plagt
     c                   move      a2peti        petik
     c                   move      a2psrt        psort
     c                   move      a2pass        ppass
S5.50c*                  move      a2kper        pkper
      *
      /space 3
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      /eject
      *
      * Subrutine for forespørsel
      *
     c     spr_rut       begsr
      *
      * Call kunder fra
      *
     c                   if        w_afld = 'A2PKNF'
     c                   eval      p_kund = a2pknf
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pknf = p_kund
     c                   eval      *in57 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunder til
      *
     c                   if        w_afld = 'A2PKNT'
     c                   eval      p_kund = a2pknt
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pknt = p_kund
     c                   eval      *in58 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for avdeling fra
      *
     c                   if        w_afld = 'A2PAVF'
     c                   eval      p_kode = a2pavf
     c                   call      'RA507R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2pavf = p_kode
     c                   eval      *in51 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for avdeling til
      *
     c                   if        w_afld = 'A2PAVT'
     c                   eval      p_kode = a2pavt
     c                   call      'RA507R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2pavt = p_kode
     c                   eval      *in52 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for kundekategori fra
      *
     c                   if        w_afld = 'A2PKAF'
     c                   eval      p_kode = a2pkaf
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2pkaf = p_kode
     c                   eval      *in53 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for kundekategori til
      *
     c                   if        w_afld = 'A2PKAT'
     c                   eval      p_kode = a2pkat
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2pkat = p_kode
     c                   eval      *in54 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for selger fra
      *
     c                   if        w_afld = 'A2PSEF'
     c                   eval      p_kode = a2psef
     c                   call      'RA509R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2psef = p_kode
     c                   eval      *in55 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for selger til
      *
     c                   if        w_afld = 'A2PSET'
     c                   eval      p_kode = a2pset
     c                   call      'RA509R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2pset = p_kode
     c                   eval      *in56 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for distrikt fra
      *
     c                   if        w_afld = 'A2PDIF'
     c                   eval      p_dist = a2pdif
     c                   call      'RA510R'
     c                   parm                    w_firm
     c                   parm                    p_dist
     c                   parm                    p_tx30
      *
     c                   eval      a2pdif = p_dist
     c                   eval      *in59 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for distrikt til
      *
     c                   if        w_afld = 'A2PDIT'
     c                   eval      p_dist = a2pdit
     c                   call      'RA510R'
     c                   parm                    w_firm
     c                   parm                    p_dist
     c                   parm                    p_tx30
      *
     c                   eval      a2pdit = p_dist
     c                   eval      *in60 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for lager fra
      *
     c                   if        w_afld = 'A2PLAF'
     c                   eval      p_lagr = a2plaf
     c                   call      'RA510R'
     c                   parm                    w_firm
     c                   parm                    p_lagr
     c                   parm                    p_tx30
      *
     c                   eval      a2plaf = p_lagr
     c                   eval      *in61 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for lager til
      *
     c                   if        w_afld = 'A2PLAT'
     c                   eval      p_lagr = a2plat
     c                   call      'RA510R'
     c                   parm                    w_firm
     c                   parm                    p_lagr
     c                   parm                    p_tx30
      *
     c                   eval      a2plat = p_lagr
     c                   eval      *in62 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      *
T5.50 * Call kunde 01
      *
     c                   if        w_afld = 'A2PKN1'
     c                   eval      p_kund = a2pkn1
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn1 = p_kund
     c                   eval      *in11 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 02
      *
     c                   if        w_afld = 'A2PKN2'
     c                   eval      p_kund = a2pkn2
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn2 = p_kund
     c                   eval      *in12 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 03
      *
     c                   if        w_afld = 'A2PKN3'
     c                   eval      p_kund = a2pkn3
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn3 = p_kund
     c                   eval      *in13 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 04
      *
     c                   if        w_afld = 'A2PKN4'
     c                   eval      p_kund = a2pkn4
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn4 = p_kund
     c                   eval      *in14 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 05
      *
     c                   if        w_afld = 'A2PKN5'
     c                   eval      p_kund = a2pkn5
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn5 = p_kund
     c                   eval      *in15 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 06
      *
     c                   if        w_afld = 'A2PKN6'
     c                   eval      p_kund = a2pkn6
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn6 = p_kund
     c                   eval      *in16 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 07
      *
     c                   if        w_afld = 'A2PKN7'
     c                   eval      p_kund = a2pkn7
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn7 = p_kund
     c                   eval      *in17 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 08
      *
     c                   if        w_afld = 'A2PKN8'
     c                   eval      p_kund = a2pkn8
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn8 = p_kund
     c                   eval      *in18 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 09
      *
     c                   if        w_afld = 'A2PKN9'
     c                   eval      p_kund = a2pkn9
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn9 = p_kund
     c                   eval      *in19 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 10
      *
     c                   if        w_afld = 'A2PK10'
     c                   eval      p_kund = a2pk10
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pk10 = p_kund
     c                   eval      *in20 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
T5.50 * Call kunde 11
      *
     c                   if        w_afld = 'A2PK11'
     c                   eval      p_kund = a2pk11
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pk11 = p_kund
     c                   eval      *in21 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 12
      *
     c                   if        w_afld = 'A2PK12'
     c                   eval      p_kund = a2pk12
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pk12 = p_kund
     c                   eval      *in22 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 13
      *
     c                   if        w_afld = 'A2PK13'
     c                   eval      p_kund = a2pk13
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pk13 = p_kund
     c                   eval      *in23 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 14
      *
     c                   if        w_afld = 'A2PK14'
     c                   eval      p_kund = a2pk14
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pk14 = p_kund
     c                   eval      *in24 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 15
      *
     c                   if        w_afld = 'A2PK15'
     c                   eval      p_kund = a2pk15
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pk15 = p_kund
     c                   eval      *in25 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 16
      *
     c                   if        w_afld = 'A2PK16'
     c                   eval      p_kund = a2pk16
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pk16 = p_kund
     c                   eval      *in26 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 17
      *
     c                   if        w_afld = 'A2PK17'
     c                   eval      p_kund = a2pk17
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pk17 = p_kund
     c                   eval      *in27 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 18
      *
     c                   if        w_afld = 'A2PK18'
     c                   eval      p_kund = a2pk18
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pk18 = p_kund
     c                   eval      *in28 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 19
      *
     c                   if        w_afld = 'A2PK19'
     c                   eval      p_kund = a2pk19
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pk19 = p_kund
     c                   eval      *in29 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 20
      *
     c                   if        w_afld = 'A2PK20'
     c                   eval      p_kund = a2pk20
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pk20 = p_kund
     c                   eval      *in70 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 21
      *
     c                   if        w_afld = 'A2PK21'
     c                   eval      p_kund = a2pk21
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pk21 = p_kund
     c                   eval      *in71 = *on
     c                   goto      end_spr_rut
T5.50c                   endif
      *
     c     end_spr_rut   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   eval      wpdat1 = 0
     c                   eval      wpokok = *blank
      *
      * Legge inn firma-
      * nummer og navn
      * fra parameter
      *
     c                   move      l_firm        w_firm
     c                   eval      a2pknf = *zeros
     c                   move      999999        a2pknt
     c                   eval      a2pavf = *zeros
     c                   move      9999          a2pavt
     c                   eval      a2pkaf = *zeros
     c                   move      9999          a2pkat
     c                   eval      a2psef = *zeros
     c                   move      9999          a2pset
     c                   eval      a2pdif = *zeros
     c                   move      9999          a2pdit
     c                   eval      a2plaf = *zeros
     c                   move      99            a2plat
      *
     c                   eval      a2pkn1 = *zeros
     c                   eval      a2pkn2 = *zeros
     c                   eval      a2pkn3 = *zeros
     c                   eval      a2pkn4 = *zeros
     c                   eval      a2pkn5 = *zeros
     c                   eval      a2pkn6 = *zeros
     c                   eval      a2pkn7 = *zeros
     c                   eval      a2pkn8 = *zeros
     c                   eval      a2pkn9 = *zeros
     c                   eval      a2pk10 = *zeros
     c                   eval      a2pk11 = *zeros
     c                   eval      a2pk12 = *zeros
     c                   eval      a2pk13 = *zeros
     c                   eval      a2pk14 = *zeros
     c                   eval      a2pk15 = *zeros
     c                   eval      a2pk16 = *zeros
     c                   eval      a2pk17 = *zeros
     c                   eval      a2pk18 = *zeros
     c                   eval      a2pk19 = *zeros
     c                   eval      a2pk20 = *zeros
     c                   eval      a2pk21 = *zeros
      *
     c                   move      4             a2peti
     c                   move      ' '           a2psrt
     c                   move      ' '           a2pass
S5.50c*                  move      ' '           a2kper
      *
      * Hent bruker-record
      *
     c     key03         chain     ausrl1                             63
      *
      *  Sjekk om begrenset til avdeling
      *
     c                   if        abbavd = 'J'                                          .....
     c                   move      *on           *in30                          Protect.     .
     c                   move      absavd        a2pavf                                      .
     c                   move      absavd        a2pavt                                      .
     c                   endif                                                           .....
      *
     c                   eval      p_in03 = ' '
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
      * Key for bruker-file
      *
     c     key03         klist
     c                   kfld                    l_user
      *
      * Key for kunderegister
      *
     c     rkunlr_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rkunlr_kund
      *
     c                   endsr
