     h datedit(*dmy.) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON
      * Program . . . . : RK633R
      * Beskrivelse . . : Utskrift av mantall
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       170304 KOB  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     frk633d    cf   e             workstn
      *
     d w_firm          s              3  0
      *
     d                 ds
      *                                                      Parameter-inn
     d ldprec                        64
     d  ldalme                        4  0 overlay(ldprec)
     d  ldpaar                        4  0 overlay(ldprec:5)
     d  ldfdat                       10d   datfmt(*iso)
     d                                     overlay(ldprec:09)
     d  ldtdat                       10d   datfmt(*iso)
     d                                     overlay(ldprec:19)
     d  ldvari                        1  0 overlay(ldprec:35)
      *
      * Definering av Local Data Area
      *
     d lda            uds
     d l_ruti                800    809
     d l_chgv                844    844
     d l_sfir                944    946  0
      *
5.21 d w_in03          s              1
5.21 d w_tvbt          s              1
5.21 d w_btch          s              1
     d w_fdat          s                   like(ldfdat)
     d w_tdat          s                   like(ldtdat)
     d w_valg          s              1
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Behandle bilde for registrering av parametre                   *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     b1tag         tag
      *
      *  Nullstiller variable som skal vises i skjermbildet
      *
     c                   eval      b1vari = 1
      *
     c     b1tagb        tag
      *
     c                   exfmt     b1bld
      *
      * Behandling av standard funksjonstaster
      *
     c                   select
     c                   when      *inkc
     c                   goto      xslutt
     c                   endsl
      *
      *  Legger inntastede opplysninger i Hjelpe-felter for Parameter
      *
     c                   move      b1alme        ldalme
     c                   move      b1vari        ldvari
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Inntasting er ferdig !  Oppstart av utvalg/utskriftsprogrammer *
      *  Kaller opp neste 'CL'-program                                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
      *  Legg inn verdi for bare henting av opplysninger
      *
     c                   eval      l_chgv = '1'                                  KODE VISE BILDE
      *
     c                   if        ldvari = 1
     c                   eval      l_ruti = 'RK634'                              RUTINE
     c                   else
     c                   eval      l_ruti = 'RK635'                              RUTINE
     c                   endif
      *
     c                   out       *dtaara
      *
      *  Kaller opp program før utskrift
      *
5.21 c                   call      'AP600R'
5.21 c                   parm                    l_ruti
5.21 c                   parm                    l_chgv
5.21 c                   parm                    w_tvbt
5.21 c                   parm                    w_in03
5.21 c                   parm                    w_btch
      *
      *  F4=Legge jobb på jobbkø
      *
     c                   if        *inkd = *on
     c                   move      '1'           w_valg
     c                   endif
      *
      *  Kaller opp subprogram
      *
     c                   call      'RK633C'
     c                   parm                    ldprec
     c                   parm                    w_valg
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Avslutt program                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     *inzsr        begsr
      *
      *  Definisjon av local data area for output
      *
     c     *dtaara       define    *lda          lda
      *
5.21 c                   eval      w_in03 = *blank
      *
      *  Nullstilling av felter som ikke kan redefineres
      *
     c                   eval      w_valg = *zero
      *
     c                   eval      w_firm      = l_sfir
      *
     c                   endsr
