      /TITLE  Utskrift av reskontroliste kunder - parameter
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK645R                                              *
      * Beskrivelse . . : Utskrift av reskontroliste kunder - parameter       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      * V5.30     100505  Endret test av kundenr. fra - til              HFL  *
6.20  * R6.20     090911  Rekompilert pga endring i RPARRKDS            *NHO
7.xx  * 7.xx  060516 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
      *                                                                       *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
     frk645d    cf   e             workstn
     frkunl1    if   e           k disk    rename(rkunpfr:rkunl1r)
      *
     d n               s              2  0
     d s               s              1  0
     d waar            s              4  0
     d wkun            s              7  0
     d wmnd            s              2  0
     d wpakod          s              2  0
     d wpdat1          s              6  0
      *
     d p_in03          s              1
     d p_stat          s              1
     d p_kode          s              4  0
     d p_kund          s              6  0
     d p_tx30          s             30
      *
     d w_aar           s              2  0
     d w_firm          s              3  0
     d w_user          s                   like(l_user)
      *
     d rkunl1_kund     s                   like(rkkund)
      *
      *  Parameter
     d/COPY QCPYLESRC,RPARRKDS
      *
      /eject
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Send skjermbilde
      *
     c                   exfmt     a2bld
      *
     c                   eval      *in31 = *off
     c                   eval      *in32 = *off
     c                   eval      *in33 = *off
     c                   eval      *in34 = *off
     c                   eval      *in35 = *off
     c                   eval      *in36 = *off
     c                   eval      *in37 = *off
     c                   eval      *in38 = *off
     c                   eval      *in39 = *off
     c                   eval      *in40 = *off
     c                   eval      *in41 = *off
     c                   eval      *in42 = *off
     c                   eval      *in43 = *off
     c                   eval      *in44 = *off
     c                   eval      *in45 = *off
     c                   eval      *in46 = *off
     c                   eval      *in47 = *off
     c                   eval      *in48 = *off
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Spørring
      *
     c                   if        *inkd = *on
     c                   exsr      spr_rut
     c                   goto      a2taga
     c                   endif
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c                   move      a2pkda        w_aar
      *
     c     *dmy          test(d)                 a2pkda                 31
     c                   if        *in31 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Kontroll av regnskapsår
      *
     c                   if        a2pÅrt > *year                                        .....
     c                   move      *on           *in32                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
     c                   if        a2pÅrf <= *zero                                       .....
     c                   move      *on           *in37                          Melding      .
     c                   move      *on           *in45                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
     c                   if        a2pÅrt <= *zero                                       .....
     c                   move      *on           *in38                          Melding      .
     c                   move      *on           *in45                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
     c                   if        a2pÅrf > a2pÅrt                                       .....
     c                   move      *on           *in39                          Melding      .
     c                   move      *on           *in45                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av regnskapsperiode
      *
     c                   if        a2ppef <= *zero                                       .....
     c                   move      *on           *in37                          Melding      .
     c                   move      *on           *in45                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
     c                   if        a2ppet <= *zero                                       .....
     c                   move      *on           *in38                          Melding      .
     c                   move      *on           *in45                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
     c                   if        a2ppef > a2ppet                                       .....
     c                   move      *on           *in39                          Melding      .
     c                   move      *on           *in45                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll avdeling
      *
     c                   if        a2pavf > a2pavt                                       .....
     c                   move      *on           *in33                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll kundekategori
      *
     c                   if        a2pkaf > a2pkat                                       .....
     c                   move      *on           *in34                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll selger
      *
     c                   if        a2psef > a2pset                                       .....
     c                   move      *on           *in48                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av kundenr. fra - til
      *
     c                   if        a2pknf > a2pknt                                       .....
     c                   move      *on           *in40                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av enkelt-kunder
      *
     c                   move      a2pkn1        kun(01)
     c                   move      a2pkn2        kun(02)
     c                   move      a2pkn3        kun(03)
     c                   move      a2pkn4        kun(04)
     c                   move      a2pkn5        kun(05)
     c                   move      a2pkn6        kun(06)
     c                   move      a2pkn7        kun(07)
     c                   move      a2pkn8        kun(08)
     c                   move      a2pkn9        kun(09)
     c                   move      a2pkn0        kun(10)
      *
     c                   xfoot     kun           wkun
     c                   eval      n = 1
     c                   if        wkun <> 0                                             .....
      *                                                                 .
     c                   dou       n > 10                                                ... .
      *                                                               . .
     c                   if        kun(n) <> *zeros                                        . .
     c                   eval      rkunl1_kund = kun(n)                                    . .
     c     rkunl1_key    chain     rkunl1                             61                   . .
      *                                                               . .
     c   61              do                                                                . .
     c                   move      *on           *in47                          Pos.cur.     .
     c                   eval      *in11 = n = 1                                           . .
     c                   eval      *in12 = n = 2                                           . .
     c                   eval      *in13 = n = 3                                           . .
     c                   eval      *in14 = n = 4                                           . .
     c                   eval      *in15 = n = 5                                           . .
     c                   eval      *in16 = n = 6                                           . .
     c                   eval      *in17 = n = 7                                           . .
     c                   eval      *in18 = n = 8                                           . .
     c                   eval      *in19 = n = 9                                           . .
     c                   eval      *in20 = n = 10                                          . .
     c                   eval      *in96 = *on                                             . .
     c                   goto      a2taga                                                  . .
     c                   enddo                                                             . .
      *                                                               . .
     c                   endif                                                             . .
      *                                                               . .
     c                   eval      n = n + 1                                               . .
      *                                                               . .
     c                   enddo                                                           ... .
      *                                                                 .
     c                   endif                                                           .....
      *
T5.30 * Hvis ingen utfylt - skriv alle
      *
T5.30c                   if        wkun   = 0 and                                        .....
T5.30c                             a2pknf = 0 and                                        .....
T5.30c                             a2pknt = 0
T5.30c                   eval      a2pknt = 999999
T5.30c                   endif                                                           .....
      *
      *  Kontroll av utvalg (valuta, kategori og avdeling)
      *
     c                   if        a2pval <> 'J'                                         .....
     c                   if        a2pval <> ' '                                             .
     c                   move      *on           *in42                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                               .
     c                   endif                                                           .....
      *
     c                   if        a2pktg <> 'J'                                         .....
     c                   if        a2pktg <> ' '                                             .
     c                   move      *on           *in35                          Melding      .
     c                   move      *on           *in46                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                               .
     c                   endif                                                           .....
      *
     c                   if        a2pavd <> 'J'                                         .....
     c                   if        a2pavd <> ' '                                             .
     c                   move      *on           *in36                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                               .
     c                   endif                                                           .....
      *
      *  Alfabetisk eller Numerisk
      *
     c                   if        a2palf <> 'J'                                         .....
     c                   if        a2palf <> ' '                                             .
     c                   move      *on           *in41                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                               .
     c                   endif                                                           .....
      *
      * Kontroll av sum-nivåer
      * kun et kan være utfylt
      *
     c                   eval      s = 0
      *
     c                   if        a2pktg = 'J'
     c                   eval      s = s + 1
     c                   endif
      *
     c                   if        a2pavd = 'J'
     c                   eval      s = s + 1
     c                   endif
      *
     c                   if        a2pslg = 'J'
     c                   eval      s = s + 1
     c                   endif
      *
     c                   if        s > 1                                                 .....
     c                   move      *on           *in43                          Melding      .
     c                   move      *on           *in46                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Skriv parameter
      *
     c                   move      a2pkda        pdato
     c                   move      a2pÅrf        paarf
     c                   move      a2pÅrt        paart
     c                   move      a2ppef        pperf
     c                   move      a2ppet        ppert
     c                   move      a2pavf        pavdf
     c                   move      a2pavt        pavdt
     c                   move      a2pkaf        pkatf
     c                   move      a2pkat        pkatt
     c                   move      a2psef        pself
     c                   move      a2pset        pselt
     c                   move      a2pval        pvalu
     c                   move      a2pknf        pknrf
     c                   move      a2pknt        pknrt
     c                   move      a2pktg        pkats
     c                   move      a2pavd        pavds
     c                   move      a2pslg        psels
     c                   move      a2palf        psort
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      *
      * Subrutine for forespørsel
      *
     c     spr_rut       begsr
      *
      * Call program for avdeling fra
      *
     c                   if        w_afld = 'A2PAVF'
     c                   eval      p_kode = a2pavf
     c                   call      'RA507R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2pavf = p_kode
     c                   eval      *in51 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for avdeling til
      *
     c                   if        w_afld = 'A2PAVT'
     c                   eval      p_kode = a2pavt
     c                   call      'RA507R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2pavt = p_kode
     c                   eval      *in52 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for kundekategori fra
      *
     c                   if        w_afld = 'A2PKAF'
     c                   eval      p_kode = a2pkaf
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2pkaf = p_kode
     c                   eval      *in53 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for kundekategori til
      *
     c                   if        w_afld = 'A2PKAT'
     c                   eval      p_kode = a2pkat
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2pkat = p_kode
     c                   eval      *in54 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for selger fra
      *
     c                   if        w_afld = 'A2PSEF'
     c                   eval      p_kode = a2psef
     c                   call      'RA509R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2psef = p_kode
     c                   eval      *in55 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call program for selger til
      *
     c                   if        w_afld = 'A2PSET'
     c                   eval      p_kode = a2pset
     c                   call      'RA509R'
     c                   parm                    w_firm
     c                   parm                    p_kode
     c                   parm                    p_tx30
      *
     c                   eval      a2pset = p_kode
     c                   eval      *in56 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunder fra
      *
     c                   if        w_afld = 'A2PKNF'
     c                   eval      p_kund = a2pknf
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pknf = p_kund
     c                   eval      *in57 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunder til
      *
     c                   if        w_afld = 'A2PKNT'
     c                   eval      p_kund = a2pknt
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pknt = p_kund
     c                   eval      *in58 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 01
      *
     c                   if        w_afld = 'A2PKN1'
     c                   eval      p_kund = a2pkn1
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn1 = p_kund
     c                   eval      *in11 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 02
      *
     c                   if        w_afld = 'A2PKN2'
     c                   eval      p_kund = a2pkn2
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn2 = p_kund
     c                   eval      *in12 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 03
      *
     c                   if        w_afld = 'A2PKN3'
     c                   eval      p_kund = a2pkn3
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn3 = p_kund
     c                   eval      *in13 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 04
      *
     c                   if        w_afld = 'A2PKN4'
     c                   eval      p_kund = a2pkn4
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn4 = p_kund
     c                   eval      *in14 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 05
      *
     c                   if        w_afld = 'A2PKN5'
     c                   eval      p_kund = a2pkn5
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn5 = p_kund
     c                   eval      *in15 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 06
      *
     c                   if        w_afld = 'A2PKN6'
     c                   eval      p_kund = a2pkn6
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn6 = p_kund
     c                   eval      *in16 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 07
      *
     c                   if        w_afld = 'A2PKN7'
     c                   eval      p_kund = a2pkn7
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn7 = p_kund
     c                   eval      *in17 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 08
      *
     c                   if        w_afld = 'A2PKN8'
     c                   eval      p_kund = a2pkn8
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn8 = p_kund
     c                   eval      *in18 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 09
      *
     c                   if        w_afld = 'A2PKN9'
     c                   eval      p_kund = a2pkn9
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn9 = p_kund
     c                   eval      *in19 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
      * Call kunde 10
      *
     c                   if        w_afld = 'A2PKN0'
     c                   eval      p_kund = a2pkn0
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    p_kund
     c                   parm                    p_tx30
      *
     c                   eval      a2pkn0 = p_kund
     c                   eval      *in20 = *on
     c                   goto      end_spr_rut
     c                   endif
      *
     c     end_spr_rut   endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   eval      wpdat1 = 0
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   move      l_user        w_user
     c                   move      l_firm        w_firm
     c                   eval      a2pavf = *zeros
     c                   eval      a2pavt = 9999
     c                   eval      a2pkaf = *zeros
     c                   eval      a2pkat = 9999
     c                   eval      a2psef = *zeros
     c                   eval      a2pset = 9999
     c                   eval      a2pknf = *zeros
E5.30c                   eval      a2pknt = *zeros
     c                   eval      a2pkn1 = *zeros
     c                   eval      a2pkn2 = *zeros
     c                   eval      a2pkn3 = *zeros
     c                   eval      a2pkn4 = *zeros
     c                   eval      a2pkn5 = *zeros
     c                   eval      a2pkn6 = *zeros
     c                   eval      a2pkn7 = *zeros
     c                   eval      a2pkn8 = *zeros
     c                   eval      a2pkn9 = *zeros
     c                   eval      a2pkn0 = *zeros
      *
     c                   move      ' '           a2pval
     c                   move      'J'           a2palf
      *
     c                   move      udate         a2pkda
     c                   eval      kun = *zeros
      *
      * Beregner periode
      *
     c                   move      *year         waar
      *
     c                   eval      wmnd = umonth - 1
     c                   if        wmnd = *zero                                          .....
     c                   movel     12            wmnd                                        .
     c                   eval      waar = waar - 1                                           .
     c                   move      waar          a2pÅrf                                      .
     c                   move      waar          a2pÅrt                                      .
     c                   else                                                                .
     c                   move      waar          a2pÅrf                                      .
     c                   move      waar          a2pÅrt                                      .
     c                   endif                                                           .....
      *
     c                   move      01            a2ppef
     c                   move      wmnd          a2ppet
      *
      * Hent bruker-record
      *
     c     ausrl1_key    chain     ausrl1                             63
      *
      *  Sjekk om begrenset til avdeling
      *
     c                   if        abbavd = 'J'                                          .....
     c                   move      *on           *in30                          Protect.     .
     c                   move      absavd        a2pavf                                      .
     c                   move      absavd        a2pavt                                      .
     c                   endif                                                           .....
      *
     c                   eval      p_in03 = *zero
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
      * Key for bruker-file
      *
     c     ausrl1_key    klist
     c                   kfld                    w_user
      *
      * Key for kunderegister
      *
     c     rkunl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rkunl1_kund
      *
     c                   endsr
