     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK658R                                              *
      * Beskrivelse . . : Oppdatering av antall ganger purret                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Ref.  Dato   Sign Endringsbeskrivelse                                 *
      * ----- ------ ---- --------------------------------------------------- *
6.10  * V6.10 210909 BSA  Lagt inn sporingsfelter
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     frktrlu    uf   e           k disk    rename(rktrpfr:rktrlur)
     frk658d    cf   e             workstn
      *
      *  LDA
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d w_firm          s              3  0
     d w_pdat          s                   like(rnpdat)
      *
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
     c     a2taga        tag
      *
     c                   exfmt     a2bld
      *
     c                   eval      *in31 = *off
     c                   eval      *in32 = *off
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   goto      slutt                                            .
     c                   endif                                                  .....
      *
      * Sjekke om dato er gyldig
      *
     c     *dmy          test(d)                 a2pdat                 31
     c                   if        *in31 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
     c     *dmy          test(d)                 a2fdat                 32
     c                   if        *in32 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
     c     rktrlu_key    setll     rktrlur                                60
     c     rktrlu_key    reade     rktrlur                                60
      *
B001 c                   dow       *in60 = *off
      *
      * Test mot dato
      *
     c     *dmy          move      a2pdat        w_pdat
      *
B001 c                   if        rnpdat = w_pdat
      *
      *  Oppdater antall ganger purret
      *
B001 c                   if        a2gngr = 'J'
     c                   eval      rnantp = rnantp - 1
E001 c                   endif
      *
      *  Oppdater siste purredato
      *
     c     *dmy          move      a2fdat        rnpdat
      *
6.10 c                   time                    rnedat
6.10 c                   time                    rnetim
6.10 c                   eval      rneusr = l_user
 001 c                   update    rktrlur
E001 c                   endif
      *
     c     rktrlu_key    reade     rktrlur                                60
     c                   enddo
      *
     c     slutt         tag
      *
     c                   seton                                        lr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      w_firm = l_firm
      *
      * Key for kundeposteringer
      *
     c     rktrlu_key    klist
     c                   kfld                    w_firm
      *
     c                   endsr
