pdf  h option(*nodebugio) datedit(*dmy) decedit('0.')
pdf  h DftActgrp(*No) BndDir('CGIDEV2/CGIDEV2')
pdf   /copy hspecsbnd
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK654R                                              *
      * Beskrivelse . . : Utskrift av betalingsvarsel u/giro (A4)             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *           060903  Nytt program                                   KOB
      *           060104  Endringer vedr. styring av bankgiroutskrift    KOB
T5.20 * V5.20     170204  Feil firma i RBUNPF når <> 0.                  HFL  *
T5.20 * V5.30     203204  Lagt inn kontroll om bilag skal renteberegnes  KOB  *
T5.20 * V5.30     273204  Lagt inn kontroll om kunden skal renteberegnes KOB  *
T5.20 * V5.30     030504  Lagt inn kontroll mot rentegrense              KOB  *
T5.20 * V5.30     121004  En blank linje før "Med hilsen .."             HFL  *
T5.30 * V5.30     020605  Skriver ikke "Oppgi kid..." hvis kid er blank  HFL  *
T5.40 * V5.40     150806  Skal ikke renteberegne kode 1.                 HFL  *
5.49  * R5.49 140206 AMD  Lagt inn dummyparameter v/call til AK700R           *
5.49  * R5.60 200908 KOB  Lagt inn test på landkode NO ved gebyrberegn.  KOB  *
pdf   * R6.10 120710 BSA  Lagt inn Jasper/xml utskrift                        *
6.10  * R6.10 011010 bsa  Tillegg av faste tagger. Display tag + ordrenummer
6.10  *                   hvis den finnes.
6.11  * R6.10 300910 bsa  Hvis konvtertering av spesialtegn, legges til flere tegn
6.11  *                   som kan gjøre at noen av disse faller utenfor pga av felt-
6.11  *                   lengde.
6.12  * R6.10 071010 bsa  Legger inn test om gyldig utkø. Hvis ikke, legger vi ikke
6.12  *                   ut "printer kommand" tagger.
6.13  * R6.10 221010 bsa  Kaller eget program for scann av tegn.
6.14  * R6.10 041110 bsa  Div. manglende info.
6.15  * R6.10 160311 bsa  Ved valg av *ARKIV som skriver skal den kun arkiveres
6.16  * R6.10 270411 bsa  Tar hensyn til ledetekster i eget register
6.20  * R6.20 100511 bsa  Legger ut rutinetekst som metatagg.
6.21  * R6.20 130511 bsa  Manglende scann av e-mail tekst + formatering
6.17  * R6.10 100412 bsa  Sjekker om telefonnummer benyttes
6.18  * R6.10 180412 nho  Flytter blank til RTPROS
6.22  * R6.20 280612 bsa  Firmanavn konverteres for mange ganger
6.23  * R6.20 040712 bsa  Strukturendring av og nye xml tagger
6.24  * R6.20 101012 bsa  Bruker feil variabel som tekst. D1TEXT er kun
6.24  *                   16 pos, mens felt er 20 pos.
6.25  * R6.20 181012 bsa  Håndterer giroskuff
6.26  * R6.20 041212 bsa  Legger ut nytt unikt refno, utvidet metatagger
6.27  * R6.20 040113 bsa  Endret oppbygging av refno
6.28  * R6.20 100113 bsa  Manglende firmainformasjon
6.29  * R6.20 260313 bsa  Legger ut xml'ene i samme mappe som ved fakturering.
6.29  *                   Da behandles de i rekkefølge.
6.2A  * R6.20 151013 bsa  Feil avsender på mail
6.2B  * R6.20 311013 bsa  Legger e-postadresse som en del av ordlyden
6.2B  *                   på avsender.
6.2C  * R6.20 111213 bsa  Feil ved flytting av ledetekster
6.2D  * R6.20 030414 bsa  Feil rekkefølge på metatagger
6.nu  * R6.30 160614 bof  Endringer i forb. nummerutvidelse
6.nu  * R6.30 140814 nho  Endring vedr kid, sett etter FO616R                 *
6.30  * R6.30 150914 bsa  Utvidet parameterliste til FO798R. Håndtering av
6.30  *                   flere mailfelter.
6.31  * 6.30  280115 bsa  Skriver til datakø for å trigge java sniffer
6.32  * 6.30  200415 bsa  Nullstiller minne ved innhenting av XML mal.
6.nu  * R6.20     280515  Utvidelse av kort kid                          NHO  *
6.33  * 6.30  040915 bsa  Legger ut avdeling som tagg for arkiveringsformål.
6.34  * 6.30  251016 bsa  Blir feil i adressefelter ved repeterende bruk av
6.34  *                   konvertert streng.
6.35  * 6.30  201217 bsa  Scanner tekst for ugyldige tegn.
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     frkwbl2    if   e           k disk    rename(rkwbpfr:rkwbl2r)
     frkunl1    if   e           k disk    rename(rkunpfr:rkunl1r)
     fafirl1    if   e           k disk    rename(afirpfr:afirl1r)
     faforl1    if   e           k disk    rename(aforpfr:aforl1r)
     fraa4l1    if   e           k disk    rename(raa4pfr:raa4l1r)
     fraa4lu    uf a e           k disk    rename(raa4pfr:raa4lur)
     fraa5l1    if   e           k disk    rename(raa5pfr:raa5l1r)
     fraa6l1    if   e           k disk    rename(raa6pfr:raa6l1r)
     fra01l1    if   e           k disk    rename(ra01pfr:ra01l1r)
     fra04l1    if   e           k disk    rename(ra04pfr:ra04l1r)
     fra11l1    if   e           k disk    rename(ra11pfr:ra11l1r)
     fra12l1    if   e           k disk    rename(ra12pfr:ra12l1r)
     fra16l1    if   e           k disk    rename(ra16pfr:ra16l1r)
     fra70l1    if   e           k disk    rename(ra70pfr:ra70l1r)
6.23 fra07pf    if   e           k disk
     frbunlu    uf a e           k disk    rename(rbunpfr:rbunlur)
     frtrapf    o  a e           k disk    rename(rtrapfr:rtrapfr)
     frgirpf    o  a e           k disk    rename(rgirpfr:rgirpfr)
     frkw2lu    o  a e           k disk    rename(rkw2pfr:rkw2lur)
     frk654p    o    e             printer infds(d_infds)
      *
      * Formulartekster 5 språk
      *
     d btab            s             12    dim(5)
     d ktab            s             12    dim(5)
     d dtab            s              8    dim(5)
     d stab            s             12    dim(5)
     d rtab            s             54    dim(5)
     d ftab            s              8    dim(5)
      *
     d fo1             s             79    dim(5)
     d fo2             s             79    dim(5)
     d fo3             s             79    dim(5)
     d fo4             s             79    dim(5)
     d fo5             s             79    dim(5)
     d fo6             s             79    dim(5)
     d fo7             s             79    dim(5)
     d fo8             s             79    dim(5)
     d fo9             s             79    dim(5)
     d fo10            s             79    dim(5)
     d fo11            s             79    dim(5)
     d fo12            s             79    dim(5)
     d fo13            s             79    dim(5)
     d fo14            s             79    dim(5)
     d fo15            s             79    dim(5)
      *
     d                 ds
     d for01                         79
     d  forb                         12    overlay(for01:5)
     d  fork                         12    overlay(for01:39)
     d  ford                          8    overlay(for01:54)
     d  fors                         12    overlay(for01:65)
      *
     d                 ds
     d for02                         79
     d  forr                         54    overlay(for02:06)
     d  forf                          8    overlay(for02:65)
      *
      *  LDA området
      *
     d                uds
     d  pfirm                300    302  0
     d  pnavn                303    332
     d  puser                333    342
     d  pkdat                343    348  0
     d  praar                349    352  0
     d  prper                353    354  0
     d  pavdf                355    358  0
     d  pavdt                359    362  0
     d  pkatf                363    366  0
     d  pkatt                367    370  0
     d  pself                371    374  0
     d  pselt                375    378  0
     d  pknrf                379    384  0
     d  pknrt                385    390  0
     d  kun                  391    450  0 dim(10)
     d  pknr1                391    396  0
     d  pknr2                397    402  0
     d  pknr3                403    408  0
     d  pknr4                409    414  0
     d  pknr5                415    420  0
     d  pknr6                421    426  0
     d  pknr7                427    432  0
     d  pknr8                433    438  0
     d  pknr9                439    444  0
     d  pknr0                445    450  0
     d  pfdat                451    456  0
     d  plope                457    459  0
     d  ppkod                460    460
     d  ppros                461    464  2
     d  pgrns                465    466  0
     d  pgbyr                466    467
     d  pmini                468    469  0
     d  pbskr                470    470
     d  pegrn                471    471
     d  pajor                472    472
     d  ptext                473    473  0
     d  ppunr                474    474  0
     d  ppbeh                475    475
     d  palfa                476    476
     d  pdfgg                477    482  0
     d  pgeby                483    485  0
     d  pparam               300    490
      *
pdf  d l_poff                584    584
6.15 d l_utqm                585    594
pdf  d l_bach                595    635
pdf  d l_arch                636    636  0
pdf  d l_skje                637    637  0
pdf  d l_land                638    638  0
pdf  d l_exlp                639    639  0
pdf  d l_mail                640    640  0
     d l_ruti                800    809
pdf  d l_outq                810    819
6.14 d l_copy                838    843  0
pdf  d l_akop                838    843  0
     d l_oflw                860    862  0
pdf  d l_bgir                881    881  0
     d l_kidk                883    883  0
     d l_ocrk                885    885  0
      *
6.26 d l_wsid                901    910
     d l_user                911    920
pdf  d l_filg                931    933
     d l_firm                944    946  0
6.33 d l_avde                947    950  0
     d l_fnav                951    980
      *
     d l               s              2  0
     d n               s              2  0
     d w               s              2  0
      *
      * Informasjon fra printer-file
      *
     d d_infds         ds
     d  d_linnbr             367    368B 0
     d  d_pagnbr             369    372B 0
      *
      * Datastruktur for kid-feltet
      *
     d                 ds
     d d_kkid                        21
     d  d_kkus                       20    overlay(d_kkid)
     d   d_kfir                       3  0 overlay(d_kkus)
     d   d_kkod                       1  0 overlay(d_kkus:4)
6.nu d   d_ktyp                       1  0 overlay(d_kkus:5)
6.nu d   d_kled                       1  0 overlay(d_kkus:6)
6.nu d   d_kkto                       6  0 overlay(d_kkus:7)
6.nu d   d_kbil                       8  0 overlay(d_kkus:13)
     d  d_kmod                        1  0 overlay(d_kkid:21)
      *
610  d rbunlu_nivo     s                   like(rsnivo)
610  d rbunlu_memb     s                   like(rsmemb)
610  d w_memb          s                   like(rsmemb)
     d w_prfi          s              1  0
     d w_ffir          s              3  0
     d w_fnav          s             30
     d w_fad1          s             30
     d w_fad2          s             30
     d w_fste          s             30
     d w_fftx          s             30
     d w_tfax          s              8
     d w_ftlf          s             11
     d w_ffax          s             11
     d w_tbnk          s             10
     d w_fbgi          s             13
      *
6.nu d*w_kidr          s              6  0
6.nu d w_kidr          s              8  0
     d w_ksif          s              1  0
     d w_kkus          s             24
     d w_kkid          s             21
5.49 d w_kki2          s             24
      *
     d w_firm          s                   like(rkfirm)
     d w_kund          s                   like(rkkund)
     d w_kund_gml      s                   like(rkkund)
     d w_6pgr          s                   like(ra6pgr)
     d w_kont          s              4  0
     d w_avde          s              4  0
     d w_spes          s              4  0
     d w_pkdat         s               d   datfmt(*iso)
     d w_pmfo          s                   like(rapmfo)
     d w_pmti          s                   like(rapmti)
     d w_rest          s             11  2
     d w_valr          s             11  2
     d w_rgrl          s             11  2
     d w_rent          s             11  2
     d w_rpro          s              5  2
     d w_geby          s              5  2
     d w_sald          s             11  2
6.NU d w_nota          s              8  0
     d w_aprt          s              1  0
     d wlinje          s              5  0
6.23 d w_davd          s                   like(rkavde)
6.26 d w_refn          s             50
      *
     d p_stat          s              1
     d p_akod          s              2  0
     d p_atxt          s             20
     d t0kkid          s             21
pdf  d p_mail          s              1
pdf  d p_kund          s              6  0
pdf  d p_kpro          s              6  0
6.nu d p_numm          s              8  0
6.30 d p_suff          s              2  0
pdf  d p_selg          s              4  0
pdf  d p_serv          s             35
pdf  d p_kule          s              1
pdf  d p_navn          s             30
pdf  d p_emal          s             50
pdf  d p_ema2          s             50
6.30 d p_ema3          s             50
6.30 d p_kopi          s             50
pdf  d p_emne          s             50
pdf  d p_txt1          s             50
pdf  d p_txt2          s             50
pdf  d p_txt3          s             50
pdf  d p_txt4          s             50
pdf  d p_pers          s             50
pdf  d p_inif          s             40
pdf  d p_in03          s              1
pdf  d b_pdfp          s              1    inz(*off)
pdf  d b_first         s              1    inz(*off)
6.16 d b_geby          s              1    inz(*off)
6.16 d b_rent          s              1    inz(*off)
6.16 d b_inka          s              1    inz(*off)
6.16 d b_kidd          s              1    inz(*off)
6.12 d p_ok            s              1
6.13 d p_lr            s              1
6.13 d p_str_in        s            512
6.13 d p_str_out       s            512
6.31 d p_filg          s             10
6.31 d p_xmlf          s            256
pdf  d x_numm          s             15
pdf  d x_vref          s             25
pdf  d x_betb          s             42
pdf  d w_bdat          s               d   datfmt(*iso)
pdf  d w_date          s               d   datfmt(*iso)
pdf  d w_kode          s              1
pdf  d w_fell          s              6
pdf  d w_type          s              2
pdf  d w_fast          s             10
pdf  d w_ruti          s             10
6.nu d w_numm          s              8  0
pdf  d w_pdf           s              1  0
pdf  d w_bgir          s              5
pdf  d w_jnav          s             15
pdf  d w_jkey          s             41
pdf  d w_jtxt          s             35
pdf  d w_pdf_ds        s            512
pdf  d w_mtxt          s            300
pdf  d w_jstat         s              2  0
pdf  d w_jtext         s            200
pdf  d w_mark          s              5
pdf  d w_spol          s              5
pdf  d w_land          s              9
pdf  d w_time          s               T
pdf  d w_ntyp          s             79
pdf  d w_path          s            256
pdf  d w_str_in        s            512
pdf  d w_str_out       s            512
pdf  d w_x             s              3  0
6.25 d w_draw1         s             25
6.25 d w_draw2         s             25
6.25 d w_giro          s             25
6.25 d w_skuf          s             25
6.25 d w_dtray         s             10
6.25 d w_gtray         s             10
6.10 d w_dspl          s            100
6.13 d w_tek1          s            512
6.11 d w_1fnav         s             50
6.11 d w_1fad1         s             50
6.11 d w_1fad2         s             50
6.11 d w_1navn         s             50
6.11 d w_1gate         s             50
6.11 d w_1adr2         s             50
6.11 d w_2navn         s             50
6.11 d w_2adr1         s             50
6.11 d w_2adr2         s             50
6.14 d w_copy          s              3  0
6.16 d w_posi          s              3  0
6.35 d w_tl8           s            150
6.35 d w_tl3           s            150
6.35 d w_tl11          s            150
6.35 d w_tl12          s            150
6.35 d w_tl13          s            150
6.35 d w_tl14          s            150
6.35 d w_tl15          s            150
6.35 d w_tl4           s            150
6.35 d w_tl6           s            150
6.35 d w_tl7           s            150
6.35 d w_tl9           s            150
6.35 d w_tl10          s            150
6.35 d w_9fkpr         s            150
6.21 d w_ptxt1         s             75
6.21 d w_ptxt2         s             75
6.21 d w_ptxt3         s             75
6.21 d w_ptxt4         s             75
6.21 d w_pemne         s             75
6.21 d w_ppers         s             50
6.21 d crlf            c                   const(X'0d25')
6.23 d w_ddeno         s                   like(ragkod)
6.23 d w_dnavn         s             50
6.23 d w_dadr1         s             50
6.23 d w_dadr2         s             50
6.23 d w_dpcde         s                   like(ragpnr)
6.23 d w_dpstd         s             50
6.23 d w_dphon         s                   like(ragtlf)
6.23 d w_dfaxn         s                   like(ragfax)
pdf   *
pdf  d XML_Output      s            256a   Varying
pdf  d XML_path        s            256a   Varying
pdf  d                                     Inz('/home/asp/print/adb')
pdf  d jasper_mal      s            256a   inz('file:/home/asp/print/maler/+
pdf  d                                     betvarsel/betvarsel.jasper')
pdf  d jasper_logo     s            256a   varying
pdf  d tmpdate         s               D
pdf  d tmptime         s               T
pdf   *
pdf  d d_pdf_ds        ds
pdf  d  d_xmlm                       75
pdf  d  d_jasm                       75
pdf  d  d_logo                       75
pdf  d  d_path                      100
6.29 d  d_emal                       50
6.29 d  d_fifo                       75
6.29 d  d_fkop                        1
6.31 d  d_dtaq                        1
6.31 d  d_sign                        1
      *
6.16 d                 ds
6.16 d d_datein                       6  0
6.16 d  d_dagin                       2  0 overlay(d_datein:1)
6.16 d  d_mndin                       2  0 overlay(d_datein:3)
6.16 d  d_aarin                       2  0 overlay(d_datein:5)
6.16  *
6.16 d                 ds
6.16 d d_dateut                       8
6.16 d  d_dagut                       2  0 overlay(d_dateut:1)
6.16 d  d_sep1                        1    overlay(d_dateut:3) inz('.')
6.16 d  d_mndut                       2  0 overlay(d_dateut:4)
6.16 d  d_sep2                        1    overlay(d_dateut:6) inz('.')
6.16 d  d_aarut                       2  0 overlay(d_dateut:7)
      *
     d rkunl1_kund     s                   like(rkkund)
     d ra11l1_kkod     s                   like(rakkod)
     d ra01l1_akod     s                   like(raakod)
     d ra12l1_lkod     s                   like(ralkod)
     d ra16l1_pkod     s                   like(rapkod)
     d ra70l1_0kod     s                   like(r70kod)
     d ra70l1_0spr     s                   like(r70spr)
     d ra70l1_0lin     s                   like(r70lin)
     d rbunlu_bunt     s                   like(rsbunt)
     d aforl1_ruti     s                   like(afruti)
     d raa4l1_4aar     s                   like(ra4aar)
     d raa4lu_4aar     s                   like(ra4aar)
6.23 d ra07pf_avde     s                   like(ragkod)
      *
pdf   /copy prototypeb
pdf   /copy usec
     c/eject
      *
     c     dummy         tag
      *
     c     rkwbl2_key    setll     rkwbl2                                 60
     c     rkwbl2_key    reade     rkwbl2                                 60
      *
     c                   dow       *in60 = *off
      *
      * Brudd på kunde
      *
     c                   if        rnkund <> w_kund_gml
      *
     c                   if        w_kund_gml <> *hival
     c                   exsr      brd_kund
     c                   eval      a1side = 1
     c                   eval      *in15 = *off
     c                   endif
pdf   * PDF er aktivert
pdf  c                   if        b_pdfp = *on
pdf   * Hvis første gang skal vi ikke finne nytt batchnummer
pdf  c                   if        b_first = *off
pdf  c                   exsr      pdf_batchno
pdf  c                   exsr      pdf_logg
pdf  c                   exsr      xml_envm
pdf  c                   endif
pdf   * Vi skriver xml for miljø formater
pdf  c                   endif
      *
     c                   exsr      ny_kund
     c                   eval      w_kund_gml = rnkund
     c                   endif
      *
      * Klargjør detalj-linje for utskrift
      *
      * Flytte NOK til valuta for enklere behandling
      * dersom ikke valutapostering
      *
     c                   if        rnvalb = 0
     c                   eval      rnvalb = rnbelØ
     c                   eval      rnvalr = rnrest
     c                   endif
      *
     c                   eval      d1biln = rnbiln
     c                   eval      d1text = rntext
     c                   eval      d1belØ = rnvalb
     c                   eval      d1rest = rnvalr
      *
      * Antall purringer kan ikke overstige 9
      *
T5.00c                   if        rnantp = 9
T5.00c                   eval      d1antp = rnantp
T5.00c                   else
     c                   eval      d1antp = rnantp + 1
T5.00c                   endif
      *
     c     *dmy          move      rnbdat        d1bdat
      *
     c     *dmy          move      rnfdat        d1fdat
      *
      * Sjekk om posten er purret  - *in15 styrer utskrift purretekst
      *
     c                   if        rnantp >= ptext - 1
     c                   eval      *in15 = *on
     c                   endif
      *
      * Summer totalt forfalt
      *
     c                   eval      w_rest = w_rest + rnrest
     c                   eval      w_valr = w_valr + rnvalr
      *
      * Sjekk om kunden skal renteberegnes
      *
E5.40c                   if        rkrenk <> 2 and
T5.40c                             rkrenk <> 1
      *
      * Sjekk om bilagskode skal renteberegnes
      *
     c                   eval      ra01l1_akod = rnbilk
     c     ra01l1_key    chain     ra01l1
      *
     c                   if        %found and
     c                             raarnk = ' '
     c                   eval      w_rgrl = w_rgrl + rnvalr
     c                   endif
      *
     c                   endif
      *
      * Skrive detaljlinje
      *
pdf  c                   if        b_pdfp = *off
     c                   write(e)  d1det
     c                   exsr      overflow
pdf  c                   else
pdf  c                   exsr      xml_deta
pdf  c                   endif
      *
     c     rkwbl2_key    reade     rkwbl2                                 60
     c                   enddo
      *
     c/space 3
      *
     c     slutt         tag
      *
     c                   eval      w_rent = 0
      *
     c                   if        pgbyr = 'J'
     c                   exsr      beh_gebyr
     c                   endif
      *
     c                   if        ppros > 0
     c                   exsr      beh_rente
     c                   endif
      *
      * Beregn saldo inkl. gebyr og rente
      *
     c                   eval      w_sald = w_rest + w_geby + w_rent
      *
     c                   exsr      xkidd
      *
      * Skriv postering
      *
     c                   if        pajor = 'J'
     c                   exsr      skr_post
     c                   endif
      *
      * Skriv bankgiro-fil hvis angitt i rutineregisteret
      *
     c                   if        afbgir = 1
     c                   exsr      skr_giro
     c                   endif
      *
      * Skriv slutten
      *
     c                   exsr      skr_slut
      *
      * Oppdater sist brukte rentenotanr.
      *
     c                   eval      raa4lu_4aar = praar
     c     raa4lu_key    chain     raa4lu
      *
     c                   eval      ra4sno = w_nota
      *
     c                   if        %found
     c                   update    raa4lur
     c                   else
     c                   eval      ra4fir = w_firm
     c                   eval      ra4aar = praar
     c                   write     raa4lur
     c                   endif
      *
pdf  c                   if        b_pdfp = *on
pdf  c                   exsr      xml_end
pdf   * Avslutt jobbiden
pdf  c                   call      'AB710R'
pdf  c                   parm                    l_bach
pdf  c                   endif
      *
     c                   seton                                        lr
      *
     c/eject
      *
      * Brudd på kundenummer
      *
     c     ny_kund       begsr
      *
     c                   eval      *in15 = *off
      *
     c                   eval      w_nota = w_nota + 1
     c                   eval      *in87 = *on
     c                   eval      *in79 = *off
      *
      * Les kunderegister
      *
     c                   eval      raltxt = *blank
     c                   eval      a1land = *blank
      *
     c                   eval      rkunl1_kund = rnkund
     c     rkunl1_key    chain     rkunl1                             10
      *
      *  Hent inn avd. opplysninger dersom
      *  kode for det er satt i rutineregister
      *
6.23 c                   eval      w_davd = rkavde
      *
     c                   if        afprfi = 2
     c                   eval      w_prfi = afprfi
     c                   eval      w_ffir = w_firm
     c                   eval      w_avde = rkavde
      *
     c                   call      'RÅ707R'
     c                   parm                    w_prfi
     c                   parm                    w_ffir
     c                   parm                    w_avde
     c                   parm                    w_fnav
     c                   parm                    w_fad1
     c                   parm                    w_fad2
     c                   parm                    w_fste
     c                   parm                    w_fftx
     c                   parm                    w_tfax
     c                   parm                    w_ftlf
     c                   parm                    w_ffax
     c                   parm                    w_tbnk
     c                   parm                    w_fbgi
      *
     c                   eval      a1fnav = w_fnav
     c                   eval      a1fad1 = w_fad1
     c                   eval      a1fad2 = w_fad2
     c                   eval      a1fste = w_fste
     c                   eval      a1fftx = w_fftx
     c                   eval      a1tfax = w_tfax
     c                   eval      a1ftlf = w_ftlf
     c                   eval      a1ffax = w_ffax
     c                   eval      a1tbnk = w_tbnk
     c                   eval      a1fbgi = w_fbgi
      *
      * Skal firmanavn droppes på rentenota ?
      *
     c                   if        w_aprt = 1
     c                   eval      a1fnav = *blank
     c                   eval      a1fad1 = *blank
     c                   eval      a1fad2 = *blank
     c                   eval      a1fste = *blank
     c                   eval      a1fftx = *blank
     c                   eval      a1tfax = *blank
     c                   eval      a1ftlf = *blank
     c                   eval      a1ffax = *blank
     c                   eval      a1tbnk = *blank
     c                   eval      a1fbgi = *blank
     c                   endif
      *
     c                   endif
      *
      * Klargjør kundedata for utskrift
      *
     c                   move      rkkund        a1kund
     c                   move      rknavn        a1navn
     c                   move      rkgate        a1gate
     c                   move      rkadr2        a1adr2
     c                   move      rksted        a1sted
      *
      * Henter avvikende rentesats fra kundekategori
      *
     c                   if        ppros > 0
     c                   eval      ra11l1_kkod = rkkatg
     c     ra11l1_key    chain     ra11l1
      *
     c                   if        %found and
     c                             rakavp <> 0
     c                   eval      w_rpro= rakavp
     c                   else
     c                   eval      w_rpro= ppros
     c                   endif
     c                   endif
      *
      * Hente landnavn og språk
      *
     c                   eval      ra12l1_lkod = rkland
     c     ra12l1_key    chain     ra12l1r
      *
     c                   if        %found
     c                   movel     raltxt        a1land
     c                   else
     c                   eval      a1land = *blank
     c                   endif
      *
      * Klargjør linjer i topp med ledetekst
      *
     c                   if        ralspr > 5 or
     c                             ralspr < 1
     c                   move      1             ralspr
     c                   endif
      *
     c                   if        fo1(ralspr) <> *blank
     c                   eval      *in79 = *on
     c                   else
     c                   eval      *in79 = *off
     c                   endif
      *
     c                   if        fo1(ralspr) <> *blank
     c                   eval      bktxt = btab(ralspr)
     c                   eval      kutxt = ktab(ralspr)
     c                   eval      datxt = dtab(ralspr)
     c                   eval      sitxt = stab(ralspr)
     c                   eval      fftxt = ftab(ralspr)
      *
6.2C c*                  movea     rtab(ralspr)  t1tl2
6.2C c*                  movea     fo3(ralspr)   t1tl3
6.2C c*                  movea     fo4(ralspr)   t1tl4
6.2C c*                  movea     fo5(ralspr)   t1tl5
6.2C c*                  movea     fo6(ralspr)   t1tl6
6.2C c*                  movea     fo7(ralspr)   t1tl7
6.2C c*                  movea     fo8(ralspr)   t1tl8
6.2C c*                  movea     fo9(ralspr)   t1tl9
6.2C c*                  movea     fo10(ralspr)  t1tl10
6.2C c*                  movea     fo11(ralspr)  t1tl11
6.2C c*                  movea     fo12(ralspr)  t1tl12
6.2C c*                  movea     fo13(ralspr)  t1tl13
6.2C c*                  movea     fo14(ralspr)  t1tl14
6.2C c*                  movea     fo15(ralspr)  t1tl15
6.2C c                   move      rtab(ralspr)  t1tl2
6.2C c                   move      fo3(ralspr)   t1tl3
6.2C c                   move      fo4(ralspr)   t1tl4
6.2C c                   move      fo5(ralspr)   t1tl5
6.2C c                   move      fo6(ralspr)   t1tl6
6.2C c                   move      fo7(ralspr)   t1tl7
6.2C c                   move      fo8(ralspr)   t1tl8
6.2C c                   move      fo9(ralspr)   t1tl9
6.2C c                   move      fo10(ralspr)  t1tl10
6.2C c                   move      fo11(ralspr)  t1tl11
6.2C c                   move      fo12(ralspr)  t1tl12
6.2C c                   move      fo13(ralspr)  t1tl13
6.2C c                   move      fo14(ralspr)  t1tl14
6.2C c                   move      fo15(ralspr)  t1tl15
     c                   endif
      *
     c                   eval      a1side = 1
      *
      * Skrive heading av betalingsvarsel pr. kunde
      *
pdf  c                   if        b_pdfp = *off
     c                   write(e)  a1hdr
pdf  c                   else
pdf  c                   exsr      xml_head
pdf  c                   endif
      *
     c                   endsr
      *
     c/eject
      *
      * Subrutine for avslutning av kunde
      *
     c     brd_kund      begsr
      *
     c                   eval      w_rent = 0
      *
     c                   if        pgbyr = 'J'
     c                   exsr      beh_gebyr
     c                   endif
      *
     c                   if        ppros > 0
     c                   exsr      beh_rente
     c                   endif
      *
      * Beregn saldo inkl. gebyr
      *
     c                   eval      w_sald = w_rest + w_geby + w_rent
      *
     c                   exsr      xkidd
      *
      * Skriv postering
      *
     c                   if        pajor = 'J'
     c                   exsr      skr_post
     c                   endif
      *
      * Skriv bankgiro-fil hvis angitt i rutineregisteret
      *
     c                   if        afbgir = 1
     c                   exsr      skr_giro
     c                   endif
      *
      * Skriv slutten
      *
     c                   exsr      skr_slut
pdf   * Legg ut xml fila
pdf  c                   if        b_pdfp = *on
pdf  c                   exsr      xml_end
pdf   * Avslutt jobbiden
pdf  c                   call      'AB710R'
pdf  c                   parm                    l_bach
pdf  c                   endif
      *
     c                   endsr
      *
     c/eject
      *
     c     skr_giro      begsr
      *
      *  Klargjør kundedata for giro-utskrift
      *
     c                   move      rkfirm        rgfirm
     c                   move      rkkund        rgkund
     c                   move      rknavn        rgnavn
     c                   move      rkgate        rggate
     c                   move      rkadr2        rgadr2
     c                   move      rksted        rgsted
     c                   move      rkpers        rgpers
     c                   move      rktlfn        rgtlfn
     c                   move      rktlfx        rgtlfx
     c                   move      rkbgir        rgbgir
     c                   move      rklagr        rglagr
     c                   move      rkslgr        rgslgr
     c                   move      rkdist        rgdist
     c                   move      rkkatg        rgkatg
     c                   move      rkbetb        rgbetb
     c                   move      rkbetm        rgbetm
     c                   move      rkfrie        rgfrie
     c                   move      rkavde        rgavde
     c                   move      rkftnr        rgftnr
     c                   eval      rgbgif = w_fbgi
      *
     c     *dmy          move      pkdat         rgbdat
     c     *dmy          move      pfdat         rgfdat
      *
     c                   eval      rgbiln = w_nota
     c                   eval      rgkkid = w_kkid
      *
      * Legg ut beløp
      *
     c                   if        pbskr = 'S'
     c                   eval      rgakti = 'S'
     c                   eval      rgbelØ = w_sald
     c                   endif
      *
     c                   if        pbskr = 'R'
     c                   eval      rgakti = 'R'
     c                   eval      rgbelØ = pgeby + w_rent
     c                   endif
      *
     c                   if        pbskr = 'G'
     c                   eval      rgakti = 'G'
     c                   eval      rgbelØ = w_geby
     c                   endif
      *
     c                   write     rgirpfr
      *
     c                   endsr
     c/eject
      *
      * Posterings-grunnlag
      *
     c     skr_post      begsr
      *
     c                   eval      wlinje = wlinje + 1
     c                   move      'T'           rtreid
     c                   move      w_firm        rtfirm
     c                   move      rsbunt        rtbunt
     c                   move      wlinje        rtlinj
     c                   eval      rtstat = *blank
     c     *dmy          move      pkdat         rtbdat
     c                   move      praar         rtrper
     c                   movel     prper         rtrper
     c                   move      w_nota        rtbiln
     c                   eval      rtdavd = *zeros
     c                   move      rkkund        rtdkto
     c                   eval      rtdsps = *zeros
     c                   eval      rtdmva = *zeros
      *
     c                   eval      rtcavd = w_avde
     c                   eval      rtckto = w_kont
     c                   eval      rtcsps = w_spes
     c                   eval      rtcmva = *zeros
6.18 c**                 eval      rtpros = *zeros
6.18 c                   eval      rtpros = *blank
     c                   eval      rtrefn = *zeros
     c     *dmy          move      pkdat         rtfdat
      *
     c                   eval      rtbelØ = w_geby + w_rent
      *
     c                   eval      rtvalk = *blank
      *
     c                   eval      rtakti = *blank
     c                   eval      rtmngd = *zeros
     c                   eval      rtmngk = *zeros
     c                   eval      rtresn = rkkund
     c                   eval      rtvirk = *blank
     c                   eval      rtatte = *zeros
     c                   eval      rtkrys = *blank
     c                   eval      rtkidi = *blank
     c                   eval      rtbilk = 97
     c                   eval      rttext = p_atxt
     c                   eval      rtbetb = 0
     c                   eval      rtbref = *blank
      *
610  c                   eval      rtnivo = *blank
610  c                   eval      rtmemb = w_memb
610  c                   time                    rtedat
610  c                   time                    rtetim
610  c                   eval      rteusr = l_user
     c                   write     rtrapfr
      *
     c                   endsr
     c/eject
      *
     c     beh_gebyr     begsr
      *
      * Hent valutakurs
      *
     c                   eval      w_pmfo = *blank
     c                   eval      w_pmti = 1
      *
     c                   if        rkland <> *blank and
     c                             rkland <> 'NO'
     c                   eval      ra16l1_pkod = rnvalk
     c     ra16l1_key    chain     ra16l1r
      *
     c                   if        %found
     c                   eval      w_pmfo = rapmfo
     c                   eval      w_pmti = rapmti
     c                   endif
     c                   endif
      *
      * Beregn gebyr
      *
     c                   eval(h)   w_geby = w_geby * w_pmti
      *
     c                   endsr
     c/eject
      *
     c     beh_rente     begsr
      *
      * Hent valutakurs
      *
     c                   eval      w_pmfo = *blank
     c                   eval      w_pmti = 1
      *
     c                   if        rkland <> *blank
     c                   eval      ra16l1_pkod = rnvalk
     c     ra16l1_key    chain     ra16l1r
      *
     c                   if        %found
     c                   eval      w_pmfo = rapmfo
     c                   eval      w_pmti = rapmti
     c                   endif
     c                   endif
      *
      * Beregn rente
      *
     c                   eval(h)   w_rent = w_rgrl * ppros / 12 / 100 * w_pmti
      *
      * Sjekk mot rentegrense
      *
     c                   if        w_rent < w_6pgr
     c                   eval      w_rent = 0
     c                   endif
      *
     c                   endsr
      *
     c/eject
      *
      * Skriv slutten på betalingsvarsel
      *
     c     skr_slut      begsr
      *
      * Skrive totaler pr. kunde/rentenota
      *
     c                   eval      t1forf = w_rest
6.16  * Styrer hvilke tekster som skal skrives
6.16 c                   eval      b_geby = *off
6.16 c                   eval      b_rent = *off
6.16 c                   eval      b_inka = *off
6.16 c                   eval      b_kidd = *off
      *
pdf  c                   if        b_pdfp = *off
     c                   write(e)  t1tot
     c                   exsr      overflow
pdf  c                   endif
      *
      * Skriv gebyr
      *
     c                   if        w_geby <> 0
     c                   eval      t2geby = w_geby
6.16 c                   eval      b_geby = *on
pdf  c                   if        b_pdfp = *off
     c                   write(e)  t2geb
pdf  c                   endif
     c                   endif
     c                   exsr      overflow
      *
      * Skriv renter
      *
     c                   if        w_rent <> 0
     c                   eval      t2rpro = ppros
     c                   eval      t2rent = w_rent
6.16 c                   eval      b_rent = *on
pdf  c                   if        b_pdfp = *off
     c                   write(e)  t2ren
pdf  c                   endif
     c                   endif
     c                   exsr      overflow
      *
     c                   eval      t3sald = w_sald
      *
pdf  c                   if        b_pdfp = *off
     c                   write(e)  t3tot
     c                   exsr      overflow
      *
     c                   write(e)  t4tot
     c                   exsr      overflow
      *
     c                   if        *in15
      *
     c                   write(e)  t5tot
     c                   exsr      overflow
      *
     c                   write(e)  t6tot
     c                   exsr      overflow
      *
     c                   write(e)  t7tot
     c                   exsr      overflow
      *
     c                   endif
      *
     c                   write(e)  t8tot
     c                   exsr      overflow
      *
T5.30c                   if        t0kkid <> *blanks
     c                   write(e)  t9tot
     c                   exsr      overflow
T5.30c                   endif
pdf  c                   else
6.16 c                   if        *in15
6.16 c                   eval      b_inka = *on
6.16 c                   endif
6.16 c                   if        t0kkid <> *blanks
6.16 c                   eval      b_kidd = *on
6.16 c                   endif
pdf   * Lag xml
pdf  c                   exsr      xml_totaler
pdf  c                   endif
      *
      * Nullstill arbeidsfelt
      *
     c                   eval      w_sald = 0
     c                   eval      w_rent = 0
     c                   eval      w_rgrl = 0
     c                   eval      w_rest = 0
     c                   eval      w_valr = 0
      *
     c                   endsr
      *
     c/eject
      *
      * Subrutine for klargjøring
      *
     c     klargj        begsr
      *
      * Leser inn formulartekster
      *
     c                   eval      btab = *blank
     c                   eval      ktab = *blank
     c                   eval      dtab = *blank
     c                   eval      stab = *blank
     c                   eval      rtab = *blank
     c                   eval      ftab = *blank
      *
     c                   eval      fo1 = *blank
     c                   eval      fo2 = *blank
     c                   eval      fo3 = *blank
     c                   eval      fo4 = *blank
     c                   eval      fo5 = *blank
     c                   eval      fo6 = *blank
     c                   eval      fo7 = *blank
     c                   eval      fo8 = *blank
     c                   eval      fo9 = *blank
     c                   eval      fo10 = *blank
     c                   eval      fo11 = *blank
     c                   eval      fo12 = *blank
     c                   eval      fo13 = *blank
     c                   eval      fo14 = *blank
     c                   eval      fo15 = *blank
      *
      * Hent formulartekster fra koderegister
      * for de land som er lagt inn
      *
     c                   eval      n = 1
     c                   dou       n > 5
     c                   exsr      leslin
     c                   eval      n = n + 1
     c                   enddo
      *
      * Behandler statusrecord nr. 04
      *
     c                   eval      raa4l1_4aar = praar
     c     raa4l1_key    chain     raa4l1
     c                   if        %found
     c                   eval      w_nota = ra4sno
     c                   else
     c                   eval      w_nota = 0
     c                   endif
      *
      * Behandler faste bilagskoder
      *
     c                   move      97            p_akod
     c                   call      'RS701R'
     c                   parm                    p_stat
     c                   parm                    p_akod
     c                   parm                    p_atxt
      *
     c                   if        p_stat = 'N'
     c                   eval      p_atxt = 'Rente/purregebyr'
     c                   endif
      *
      * Hent hovedbokskonto for renter/renter
      *
     c     ra04l1_key    chain     ra04l1
      *
     c                   if        %found
     c                   eval      w_kont = radk11
     c                   eval      w_avde = rada11
     c                   eval      w_spes = rads11
     c                   endif
      *
      *  Finn ledig buntnr. for rente-poster
      *
610  c                   eval      rbunlu_nivo = *blank
610  c                   eval      rbunlu_memb = w_memb
     c                   eval      rbunlu_bunt = 99999
     c     rbunlu_key    setgt     rbunlu
     c                   readp     rbunlu                                 61
      *
     c   61              eval      rsbunt = 1
     c  n61              eval      rsbunt = rsbunt + 1
      *
     c                   move      praar         rsraar
     c                   movel     prper         rsrper
     c                   move      wlinje        rssist
     c                   move      udate         rspdat
      *
      * Beregn innsigelsesfrist
      *
     c     *dmy          move      pkdat         w_pkdat
     c                   eval      w = 14
     c     w_pkdat       adddur    w : *d        w_pkdat
     c     *dmy          move      w_pkdat       t8dato
      *
     c                   eval      w_geby = pgeby
     c                   eval      rtbelØ = 0
E5.20c                   eval      rsfirm = w_firm
     c                   eval      rsstat = *blank
     c                   eval      rsfØrs = 1
     c                   eval      rsbsum = *zeros
     c                   eval      rspsum = *zeros
     c                   eval      rspdeb = *zeros
     c                   eval      rspkre = *zeros
      *
610  c                   eval      rsnivo = *blank
610  c                   eval      rsmemb = w_memb
610  c                   time                    rsedat
610  c                   time                    rsetim
610  c                   eval      rseusr = l_user
     c                   write     rbunlur
      *
     c                   endsr
     c/eject
      *
      * Subrutine for innlesing av formulartekster
      *
     c     leslin        begsr
      *
     c                   eval      l = 1
      *
     c                   dou       l > 15
      *
     c                   eval      ra70l1_0kod = 70
     c                   eval      ra70l1_0spr = n
     c                   eval      ra70l1_0lin = l
     c     ra70l1_key    chain     ra70l1r
      *
     c                   if        %found
     c                   select
      *
     c                   when      l = 1
     c                   move      r70ltx        fo1(r70spr)
     c                   move      fo1(r70spr)   for01
     c                   move      forb          btab(r70spr)
     c                   move      fork          ktab(r70spr)
     c                   move      ford          dtab(r70spr)
     c                   move      fors          stab(r70spr)
      *
     c                   when      l = 2
     c                   move      r70ltx        fo2(r70spr)
     c                   move      fo2(r70spr)   for02
     c                   move      forr          rtab(r70spr)
     c                   move      forf          ftab(r70spr)
      *
     c                   when      l = 3
     c                   move      r70ltx        fo3(r70spr)
      *
     c                   when      l = 4
     c                   move      r70ltx        fo4(r70spr)
      *
     c                   when      l = 5
     c                   move      r70ltx        fo5(r70spr)
      *
     c                   when      l = 6
     c                   move      r70ltx        fo6(r70spr)
      *
     c                   when      l = 7
     c                   move      r70ltx        fo7(r70spr)
      *
     c                   when      l = 8
     c                   move      r70ltx        fo8(r70spr)
      *
     c                   when      l = 9
     c                   move      r70ltx        fo9(r70spr)
      *
     c                   when      l = 10
     c                   move      r70ltx        fo10(r70spr)
      *
     c                   when      l = 11
     c                   move      r70ltx        fo11(r70spr)
      *
     c                   when      l = 12
     c                   move      r70ltx        fo12(r70spr)
      *
     c                   when      l = 13
     c                   move      r70ltx        fo13(r70spr)
      *
     c                   when      l = 14
     c                   move      r70ltx        fo14(r70spr)
      *
     c                   when      l = 15
     c                   move      r70ltx        fo15(r70spr)
      *
     c                   endsl
     c                   endif
      *
     c                   eval      l = l + 1
     c                   enddo
      *
     c                   endsr
     c/eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * XKIDD  Klargjør kidd                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xkidd         begsr
      *
      * Løsning for å kunne benytte kortere kidd-nummer,
      *
      * Bygger opp kiddfelt (lang versjon)
      *
     c                   eval      d_kfir = w_firm
     c                   eval      d_kkod = 2
     c                   eval      d_kled = *zero
6.nu c                   eval      d_ktyp = *zero
     c                   eval      d_kkto = rkkund
     c                   eval      d_kbil = w_nota
     c                   eval      w_kkus = d_kkus
     c                   eval      w_ksif = *zero
      *
      * Beregning av sjekksiffer på kiddfelt (lang versjon)
      *
     c                   call      'AK720R'
     c                   parm                    w_kkus
     c                   parm                    w_ksif
      *
     c                   eval      d_kmod = w_ksif
     c                   eval      w_kkid = d_kkid
      *
      * Oppdatering av kidd-referanse-fil
      *
     c                   select
     c                   when      l_kidk = 0
     c                   move      *blank        t0kkid
      *
     c                   when      l_kidk = 1
     c                   eval      t0kkid = %trim(w_kkid)
      *
     c                   when      l_kidk = 2
     c                   call      'AK700R'
     c                   parm                    w_firm
     c                   parm                    w_kkid
     c                   parm                    w_kidr
     c                   parm                    w_ksif
5.49 c                   parm                    w_kki2
      *
     c                   move      *blank        d_kkid
     c                   move      w_kidr        d_kkus
     c                   move      w_ksif        d_kmod
     c                   eval      w_kkid = d_kkid
     c                   eval      t0kkid = %trim(w_kkid)
      *
     c                   endsl
      *
     c                   endsr
      *
     c/eject
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for kontroll av overflow                              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     overflow      begsr
      *
      * Er det overflow ?
      *
     c                   if        %error = '1'
     c                   eval      a1side = a1side + 1
pdf  c                   if        b_pdfp = *off
     c                   write(e)  a1hdr
pdf  c                   endif
     c                   endif
      *
     c                   endsr
     c/space 3
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Miljø variabler         *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_envm      begsr
pdf   * Hvis skjermvisning skal vi ikke lagre i spoolfile
pdf  c                   if        l_skje = 1
pdf  c                   eval      w_spol = 'true'
pdf  c                   else
pdf  c                   eval      w_spol = 'false'
pdf  c                   endif
pdf   *
pdf   /Free
pdf        // Finne nytt batch nummer
pdf            UpdHTMLVar('Batchno':              w_jkey);
pdf            UpdHTMLVar('Batchtype': 'BETALINGSVARSEL');
pdf            UpdHTMLVar('Username':             l_user);
pdf            WrtSection('Topp');
pdf
pdf        // Finn credentials variabler
pdf            UpdHTMLVar('IPAdr':                  ' ');
pdf            UpdHTMLVar('User':                l_user);
pdf            UpdHTMLVar('PW':                     ' ');
pdf            UpdHTMLVar('Schema':        'ADB'+l_filg);
pdf            UpdHTMLVar('Companyno':    %char(l_firm));
6.33           UpdHTMLVar('Departmentnoarkiv': %char(l_avde));
pdf            WrtSection('Credential');
pdf
pdf        // Finn report command variabler
pdf            UpdHTMLVar('Jaspertemplate':      d_jasm);
pdf            UpdHTMLVar('Logo':           jasper_logo);
pdf            UpdHTMLVar('Keepspool':           w_spol);
pdf            WrtSection('ReportCommand');
pdf   /End-free
pdf   *
pdf   * Hvis skjermvisning skal ikke PDF skrives
pdf  c                   if        l_skje = 0 and
pdf  c                             l_mail = 0
6.15  * Hvis *ARKIV er valgt som skriver, skal det ikke skrives ut
6.15 c                   if        l_utqm <> '*ARKIV'
pdf   *
pdf  c                   if        l_land = 1
pdf  c                   eval      w_land = 'LANDSCAPE'
pdf  c                   else
pdf  c                   eval      w_land = 'PORTRAIT'
pdf  c                   endif
6.12  * Sjekk at valgt outq støttes av skriveren. Kan skli gjennom hvis
6.12  * jobben legges på jobbkø.
6.12 c                   eval      p_ok = '0'
6.12 c                   call      'AP612R'
6.12 c                   parm                    l_filg
6.12 c                   parm                    l_outq
6.12 c                   parm                    p_ok
6.12  * Hvis feil utkø, logges dette i transaksjonsloggen
6.12 c                   if        p_ok = '0'
6.12 c                   eval      w_jstat = 20
6.12 c                   eval      w_jtext = 'Ugyldig utkø '+ l_outq + ' er val+
6.12 c                             gt. Ingen utskrift er generert. Utskrift kan+
6.12 c                              arkiveres.'
6.12 c                   call      'AB705R'
6.12 c                   parm                    l_bach
6.12 c                   parm                    w_jstat
6.12 c                   parm                    w_jtext
6.12 c                   else
pdf   * Hent inn skuffinformasjon for skriveren
6.25 c                   eval      w_dtray = *blank
6.25 c                   eval      w_gtray = *blank
pdf  c                   call      'AP611R'
pdf  c                   parm                    l_filg
pdf  c                   parm                    l_outq
6.25 c                   parm                    w_dtray
6.25 c                   parm                    w_gtray
6.25  * Hent inn skuffinformasjon for skriveren - default inskuff
6.25 c                   eval      w_draw1 = *blank
6.25 c                   movel     w_dtray       w_skuf
6.25 c                   call      'AP614R'
6.25 c                   parm                    l_outq
6.25 c                   parm                    w_skuf
6.25 c                   parm                    w_draw1
6.25  * Hent inn skuffinformasjon for skriveren - giroskuff
6.25 c                   eval      w_draw2 = *blank
6.25 c                   movel     'GIROSKUFF'   w_giro
6.25 c                   call      'AP614R'
6.25 c                   parm                    l_outq
6.25 c                   parm                    w_giro
6.25 c                   parm                    w_draw2
6.14  *
6.14 c                   if        l_akop = 0
6.14 c                   eval      l_akop = 1
6.14 c                   endif
pdf   *
pdf   /Free
pdf        // Finn print informasjon
pdf            UpdHTMLVar('Printername':         l_outq);
pdf            UpdHTMLVar('Copies':       %char(l_akop));
pdf            UpdHTMLVar('Papersource':        w_draw1);
pdf            UpdHTMLVar('Lastpagedrawer':     w_draw2);
pdf            UpdHTMLVar('Duplex':             'false');
pdf            UpdHTMLVar('Quality':                ' ');
pdf            UpdHTMLVar('Sorting':                ' ');
pdf            UpdHTMLVar('Staple':              'true');
pdf            UPDHTMLVar('Alignment':           w_land);
pdf            WrtSection('PrintCommand');
pdf   /End-free
6.12 c                   endif
6.15 c                   endif
pdf  c                   endif
pdf   *
pdf   * Hvis mail skal skrives, må vi hente mail informasjon
pdf   *
pdf  c                   if        l_mail = 1
pdf  c                   eval      p_kule = 'K'
pdf  c                   eval      p_kund = a1kund
pdf  c                   eval      p_kpro = *zero
pdf  c                   eval      p_numm = *zero
6.30 c                   eval      p_suff = *zero
pdf  c                   eval      p_selg = *zero
pdf   * Henter tilbake mailserver
pdf  c                   eval      p_serv = *blank
pdf  c                   eval      p_stat = *blank
pdf  c                   call      'AM705C'
pdf  c                   parm                    p_serv
pdf  c                   parm                    p_stat
pdf   *
pdf  c                   eval      p_in03 = *off
pdf  c                   call      'FO798R'
pdf  c                   parm                    p_kule
pdf  c                   parm                    p_kund
pdf  c                   parm                    p_kpro
pdf  c                   parm                    p_numm
6.30 c                   parm                    p_suff
pdf  c                   parm                    p_selg
pdf  c                   parm                    p_navn
pdf  c                   parm                    p_emal
6.30 c                   parm                    p_ema2
6.30 c                   parm                    p_ema3
pdf  c                   parm                    p_emne
pdf  c                   parm                    p_txt1
pdf  c                   parm                    p_txt2
pdf  c                   parm                    p_txt3
pdf  c                   parm                    p_txt4
pdf  c                   parm                    p_pers
6.30 c                   parm                    p_kopi
pdf  c                   parm                    p_inif
pdf  c                   parm                    p_in03
6.21  * Scann av strenger
6.21  *
6.21 c                   eval      p_str_in = *blank
6.21 c                   eval      p_lr = '0'
6.21 c                   movel     p_emne        p_str_in
6.21 c                   call      'AP613R'
6.21 c                   parm                    p_str_in
6.21 c                   parm                    p_str_out
6.21 c                   parm                    p_lr
6.21 c                   movel     p_str_out     w_pemne
6.21  * Scann av strenger
6.21  *
6.21 c                   eval      p_str_in = *blank
6.21 c                   eval      p_lr = '0'
6.21 c                   movel     p_txt1        p_str_in
6.21 c                   call      'AP613R'
6.21 c                   parm                    p_str_in
6.21 c                   parm                    p_str_out
6.21 c                   parm                    p_lr
6.21 c                   movel     p_str_out     w_ptxt1
6.21  *
6.21 c                   eval      p_str_in = *blank
6.21 c                   eval      p_lr = '0'
6.21 c                   movel     p_txt2        p_str_in
6.21 c                   call      'AP613R'
6.21 c                   parm                    p_str_in
6.21 c                   parm                    p_str_out
6.21 c                   parm                    p_lr
6.21 c                   movel     p_str_out     w_ptxt2
6.21  *
6.21 c                   eval      p_str_in = *blank
6.21 c                   eval      p_lr = '0'
6.21 c                   movel     p_txt3        p_str_in
6.21 c                   call      'AP613R'
6.21 c                   parm                    p_str_in
6.21 c                   parm                    p_str_out
6.21 c                   parm                    p_lr
6.21 c                   movel     p_str_out     w_ptxt3
6.21  *
6.21 c                   eval      p_str_in = *blank
6.21 c                   eval      p_lr = '0'
6.21 c                   movel     p_txt4        p_str_in
6.21 c                   call      'AP613R'
6.21 c                   parm                    p_str_in
6.21 c                   parm                    p_str_out
6.21 c                   parm                    p_lr
6.21 c                   movel     p_str_out     w_ptxt4
6.21  *
6.21 c                   eval      p_str_in = *blank
6.21 c                   eval      p_lr = '0'
6.21 c                   movel     p_pers        p_str_in
6.21 c                   call      'AP613R'
6.21 c                   parm                    p_str_in
6.21 c                   parm                    p_str_out
6.21 c                   parm                    p_lr
6.21 c                   movel     p_str_out     w_ppers
6.21  *
6.21 c                   eval      w_mtxt = %trim(w_ptxt1) + crlf +
6.21 c                                      %trim(w_ptxt2) + crlf +
6.21 c                                      %trim(w_ptxt3) + crlf +
6.21 c                                      %trim(w_ptxt4) + crlf +
6.21 c                                      %trim(w_ppers)
6.21 c**                 eval      w_mtxt = p_txt1+p_txt2+p_txt3+p_txt4
pdf   *
pdf   /Free
pdf        // Skriv mailinformasjon
6.30           WrtSection('MailCommandStart');
6.30       //  UpdHTMLVar('Receivers':           p_emal);
6.30           if %Trim(p_emal)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_emal);
6.30           WrtSection('MailReceiver');
6.30           endif;
6.30           if %Trim(p_ema2)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_ema2);
6.30           WrtSection('MailReceiver');
6.30           endif;
6.30           if %Trim(p_ema3)<> *blanks;
6.30           UpdHTMLVar('Receivers':           p_ema3);
6.30           WrtSection('MailReceiver');
6.30           endif;
pdf            UpdHTMLVar('CC':                     ' ');
6.30           UpdHTMLVar('BCC':                 p_kopi);
6.2A     //    UpdHTMLVar('Sender':              l_user);
6.30           UpdHTMLVar('Sender':              p_kopi);
6.21     //    UpdHTMLVar('Subject':             p_emne);
6.21           UpdHTMLVar('Subject':             w_pemne);
pdf            UpdHTMLVar('Message':             w_mtxt);
pdf            UpdHTMLVar('SMTPServer':          p_serv);
pdf            UPDHTMLVar('SMTPUser':               ' ');
pdf            UPDHTMLVar('SMTPPw':                 ' ');
6.30     //    WrtSection('MailCommand');
6.30           WrtSection('MailCommandEnd');
pdf   /End-free
pdf  c                   endif
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Heading                 *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_head      begsr
pdf   *
pdf  c                   time                    w_time
pdf  c                   eval      w_ntyp = *blanks
6.16 c**                 if        *in79 = *on
pdf  c                   eval      w_ntyp = t1tl2
6.16 c**                 else
6.16 c**                 eval      w_ntyp = 'B E T A L I N G S V A R S E L'
6.16 c**                 endif
pdf  c*                  eval      x_betb = a1btx1 + ' ' + a1btx2
pdf   * Vi må oversette aktuelle tekster til "xml" tegn - Firma
6.11 c                   eval      w_1fnav = *blank
6.11 c                   eval      w_1fad1 = *blank
6.11 c                   eval      w_1fad2 = *blank
6.11 c                   eval      w_1navn = *blank
6.11 c                   eval      w_1gate = *blank
6.11 c                   eval      w_1adr2 = *blank
6.11 c                   eval      w_2navn = *blank
6.11 c                   eval      w_2adr1 = *blank
6.11 c                   eval      w_2adr2 = *blank
6.16 c                   eval      w_tl3 = *blanks
6.35 c                   eval      w_tl4 = *blanks
6.35 c                   eval      w_tl6 = *blanks
6.35 c                   eval      w_tl7 = *blanks
6.16 c                   eval      w_tl8 = *blanks
6.35 c                   eval      w_tl9 = *blanks
6.35 c                   eval      w_9fkpr = *blanks
6.35 c                   eval      w_tl10 = *blanks
6.35 c                   eval      w_tl11 = *blanks
6.35 c                   eval      w_tl12 = *blanks
6.16 c                   eval      w_tl13 = *blanks
6.16 c                   eval      w_tl14 = *blanks
6.35 c                   eval      w_tl15 = *blanks
      *
6.13 c                   eval      p_str_in = *blank
6.13 c                   eval      p_lr = '0'
6.13 c                   movel     a1fnav        p_str_in
6.13 c                   call      'AP613R'
6.13 c                   parm                    p_str_in
6.13 c                   parm                    p_str_out
6.13 c                   parm                    p_lr
6.18 c**                 movel     p_str_out     a1fnav
6.13 c                   movel     p_str_out     w_1fnav
      *
6.13 c                   eval      p_str_in = *blank
6.13 c                   eval      p_lr = '0'
6.13 c                   movel     a1fad1        p_str_in
6.13 c                   call      'AP613R'
6.13 c                   parm                    p_str_in
6.13 c                   parm                    p_str_out
6.13 c                   parm                    p_lr
6.34 c**                 movel     p_str_out     a1fad1
6.13 c                   movel     p_str_out     w_1fad1
      *
6.13 c                   eval      p_str_in = *blank
6.13 c                   eval      p_lr = '0'
6.13 c                   movel     a1fad2        p_str_in
6.13 c                   call      'AP613R'
6.13 c                   parm                    p_str_in
6.13 c                   parm                    p_str_out
6.13 c                   parm                    p_lr
6.34 c**                 movel     p_str_out     a1fad2
6.13 c                   movel     p_str_out     w_1fad2
      *
      * Vi må oversette aktuelle tekster til "xml" tegn - Partner
      *
6.13 c                   eval      p_str_in = *blank
6.13 c                   eval      p_lr = '0'
6.13 c                   movel     a1navn        p_str_in
6.13 c                   call      'AP613R'
6.13 c                   parm                    p_str_in
6.13 c                   parm                    p_str_out
6.13 c                   parm                    p_lr
6.34 c**                 movel     p_str_out     a1navn
6.13 c                   movel     p_str_out     w_1navn
      *
6.13 c                   eval      p_str_in = *blank
6.13 c                   eval      p_lr = '0'
6.13 c                   movel     a1gate        p_str_in
6.13 c                   call      'AP613R'
6.13 c                   parm                    p_str_in
6.13 c                   parm                    p_str_out
6.13 c                   parm                    p_lr
6.34 c**                 movel     p_str_out     a1gate
6.13 c                   movel     p_str_out     w_1gate
      *
6.13 c                   eval      p_str_in = *blank
6.13 c                   eval      p_lr = '0'
6.13 c                   movel     a1adr2        p_str_in
6.13 c                   call      'AP613R'
6.13 c                   parm                    p_str_in
6.13 c                   parm                    p_str_out
6.13 c                   parm                    p_lr
6.34 c**                 movel     p_str_out     a1adr2
6.13 c                   movel     p_str_out     w_1adr2
6.13  *
6.16 c                   eval      d_datein = pkdat
6.16 c                   eval      d_dagut = d_dagin
6.16 c                   eval      d_mndut = d_mndin
6.16 c                   eval      d_aarut = d_aarin
6.16 c                   eval      w_tl3 = %trim(t1tl3) + ' ' + d_dateut
      *
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     w_tl3         P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_tl3
6.23  * Hent inn avdelingsinfo - uavhengig av om dette ligger i firmatagger
6.23 c                   exsr      hnt_avde
      * Avdelingsinformasjon - navn
6.23 c                   eval      p_str_in = *blank
6.23 c                   eval      p_lr = '0'
6.23 c                   movel     w_dnavn       P_str_in
6.23 c                   call      'AP613R'
6.23 c                   parm                    p_str_in
6.23 c                   parm                    p_str_out
6.23 c                   parm                    p_lr
6.23 c                   movel     p_str_out     w_dnavn
      * Avdelingsinformasjon - adresse
6.23 c                   eval      p_str_in = *blank
6.23 c                   eval      p_lr = '0'
6.23 c                   movel     w_dadr1       P_str_in
6.23 c                   call      'AP613R'
6.23 c                   parm                    p_str_in
6.23 c                   parm                    p_str_out
6.23 c                   parm                    p_lr
6.23 c                   movel     p_str_out     w_dadr1
      * Avdelingsinformasjon - adresse 2
6.23 c                   eval      p_str_in = *blank
6.23 c                   eval      p_lr = '0'
6.23 c                   movel     w_dadr2       P_str_in
6.23 c                   call      'AP613R'
6.23 c                   parm                    p_str_in
6.23 c                   parm                    p_str_out
6.23 c                   parm                    p_lr
6.23 c                   movel     p_str_out     w_dadr2
      * Avdelingsinformasjon - poststed
6.23 c                   eval      p_str_in = *blank
6.23 c                   eval      p_lr = '0'
6.23 c                   movel     w_dpstd       P_str_in
6.23 c                   call      'AP613R'
6.23 c                   parm                    p_str_in
6.23 c                   parm                    p_str_out
6.23 c                   parm                    p_lr
6.23 c                   movel     p_str_out     w_dpstd
      *
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     w_tl4         P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_tl4
6.13  *
pdf   /Free
pdf        // Skriv firmavariabler
6.20           UpdHTMLVar('Reporttext':            aftxt1);
6.11           UpdHTMLVar('CompanyName':          w_1fnav);
6.11           UpdHTMLVar('Companyadress1':       w_1fad1);
6.11           UpdHTMLVar('Companyadress2':       w_1fad2);
pdf            UpdHTMLVar('Companypostalcode':        ' ');
pdf            UpdHTMLVar('Companypostoffice':     a1fste);
pdf            UpdHTMLVar('Companyphone':          a1ftlf);
pdf            UpdHTMLVar('Companyfax':            a1ffax);
pdf            UpdHTMLVar('Companyorgno':          a1fftx);
pdf            UpdHTMLVar('Companygiro':           a1fbgi);
6.28           UpdHTMLVar('Companyemail':   %trim(aamail));
6.28           UpdHTMLVar('Companywebpage': %trim(aaweba));
pdf            WrtSection('Company');
6.23
6.23           UpdHTMLVar('Departmentno':    %char(w_davd));
6.23           UpdHTMLVar('Departmentname':        w_dnavn);
6.23           UpdHTMLVar('Departmentadress1':     w_dadr1);
6.23           UpdHTMLVar('Departmentadress2':     w_dadr2);
6.23           UpdHTMLVar('Departmentpostalcode':      ' ');
6.23           UpdHTMLVar('Departmentpostoffice':  w_dpstd);
6.23           UpdHTMLVar('Departmentphone':       w_dphon);
6.23           UpdHTMLVar('Departmentfax':         w_dfaxn);
6.23           WrtSection('Department');
pdf
pdf            UpdHTMLVar('Creationdate':     %char(w_date:*iso));
pdf
pdf            UpdHTMLVar('Creationtime': %char(w_time : *hms));
pdf            WrtSection('Creation');
pdf
pdf        // Skriv partnerinfo (kunde)
pdf            UpdHTMLVar('Partnerno':      %char(a1kund));
6.11           UpdHTMLVar('Partnername':          w_1navn);
6.11           UpdHTMLVar('Partneradress1':       w_1gate);
6.11           UpdHTMLVar('Partneradress2':       w_1adr2);
pdf            UpdHTMLVar('Partnerpostalcode':        ' ');
pdf            UpdHTMLVar('Partnerpostoffice':     a1sted);
pdf            UpdHTMLVar('Partnerphone':          rktlfn);
pdf            UpdHTMLVar('Partnercellphone':      rkmobn);
pdf            UpdHTMLVar('Partnerfax':            rktlfx);
pdf            UpdHTMLVar('Noticetype':            w_ntyp);
pdf            UpdHTMLVar('Documentno':     %char(w_nota));
pdf
pdf            test(de) *dmy pkdat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(pkdat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Ratedate':   %char(tmpdate : *iso));
pdf
pdf            test(de) *dmy pfdat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(pfdat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Duedateheader':   %char(tmpdate : *iso));
pdf        //  UpdHTMLVar('Rateinpercent':   %char(w_rpro));
pdf
pdf            UpdHTMLVar('Accountdate':     %char(w_date:*iso));
pdf            UpdHTMLVar('Bankaccount':               a1fbgi);
pdf
pdf            WrtSection('Partner');
pdf
6.35           UpdHTMLVar('Leadtoptext':         %trim(w_tl3));
6.16           WrtSection('LeadTopText');
6.35           UpdHTMLVar('Leadtoptext':         %trim(w_tl4));
6.16           WrtSection('LeadTopText');
pdf
6.16           WrtSection('LeadTopEnd');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Detaljer                *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_deta      begsr
pdf   *
6.11 c                   eval      w_tek1 = *blank
6.13 c                   eval      p_str_in = *blank
6.13 c                   eval      p_lr = '0'
6.24 c**                 movel     d1text        p_str_in
6.24 c                   movel     rntext        p_str_in
6.13 c                   call      'AP613R'
6.13 c                   parm                    p_str_in
6.13 c                   parm                    p_str_out
6.13 c                   parm                    p_lr
6.13 c                   movel     p_str_out     w_tek1
pdf   *
pdf   /Free
pdf        // Skriv detaljer
6.11       //  UpdHTMLVar('Text':               d1text);
6.11           UpdHTMLVar('Text':               w_tek1);
pdf            UpdHTMLVar('Appendixno':  %char(d1biln));
pdf
pdf            test(de) *dmy d1bdat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(d1bdat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Appendixdate': %char(tmpdate : *iso));
pdf
pdf            test(de) *dmy d1fdat;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(d1fdat : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Duedateline': %char(tmpdate : *iso));
pdf
pdf            UpdHTMLVar('Amount':       %char(d1belØ));
pdf            UpdHTMLVar('Restamount':       %char(d1rest));
pdf            UpdHTMLVar('Reminder':       %char(d1antp));
pdf
pdf            WrtSection('Line');
pdf
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Totaler                 *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_totaler   begsr
pdf   *
pdf  c                   eval      w_bgir = *blanks
pdf  c                   if        l_bgir = 0
pdf  c                   eval      w_bgir = 'false'
pdf  c                   else
pdf  c                   eval      w_bgir = 'true'
pdf  c                   endif
6.16  *
6.16  * Slå sammen tekster og felter i ledetekst
6.16 c                   if        b_rent = *on
6.16 c                   eval      w_posi = %scan('%':t1tl8)
6.16 c                   if        w_posi > 0
6.16 c                   eval      w_tl8 = %trim(%subst(t1tl8:1:w_posi-1))+ ' '+
6.16 c                                     %trim(%char(t2rpro)) + ' ' +
6.16 c                                     %trim(%subst(t1tl8:w_posi:79-w_posi))
6.16 c                   else
6.16 c                   eval      w_tl8 = t1tl8
6.16 c                   endif
6.16 c                   endif
      *
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     w_tl8         P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_tl8
6.16  * Inkassoinfo
6.16 c                   if        b_inka = *on
6.16 c                   eval      d_datein = t8dato
6.16 c                   eval      d_dagut = d_dagin
6.16 c                   eval      d_mndut = d_mndin
6.16 c                   eval      d_aarut = d_aarin
6.16 c                   eval      w_tl13 = %trim(t1tl13) + ' ' + d_dateut
6.16 c                   endif
6.16  * Med hilsen osv....
6.17 c                   if        %trim(t9ftfn) <> *blanks
6.16 c                   eval      w_tl14 = %trim(t1tl14) + ' ' + %trim(t9fkpr)+
6.16 c                                      ' ,' + %trim(t9ftfn)
6.17 c                   else
6.17 c                   eval      w_tl14 = %trim(t1tl14) + ' ' + %trim(t9fkpr)
6.17 c                   endif
6.35  * Scanner tekster for ugyldige tegn
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     t1tl11        P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_tl11
6.35  * Scanner tekster for ugyldige tegn
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     t1tl12        P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_tl12
6.35  * Scanner tekster for ugyldige tegn
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     t1tl15        P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_tl15
6.35  * Scanner tekster for ugyldige tegn
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     w_tl13        P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_tl13
6.35  * Scanner tekster for ugyldige tegn
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     w_tl14        P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_tl14
6.35  * Scanner tekster for ugyldige tegn
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     t1tl6         P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_tl6
6.35  * Scanner tekster for ugyldige tegn
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     t1tl7         P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_tl7
6.35  * Scanner tekster for ugyldige tegn
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     t1tl9         P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_tl9
6.35  * Scanner tekster for ugyldige tegn
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     t1tl10        P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_tl10
6.35  * Scanner tekster for ugyldige tegn
6.35 c                   eval      p_str_in = *blank
6.35 c                   eval      p_lr = '0'
6.35 c                   movel     t9fkpr        P_str_in
6.35 c                   call      'AP613R'
6.35 c                   parm                    p_str_in
6.35 c                   parm                    p_str_out
6.35 c                   parm                    p_lr
6.35 c                   movel     p_str_out     w_9fkpr
6.16  *
pdf   /Free
pdf        // Skriv totallinje
pdf            UpdHTMLVar('Sumrestamount':      %char(t1forf));
pdf            UpdHTMLVar('Reminderfee':        %char(t2geby));
pdf            UpdHTMLVar('Balance':            %char(t3sald));
pdf            test(de) *dmy t8dato;
pdf            if %error;
pdf            tmpdate = *loval;
pdf            else;
pdf            tmpdate = %date(t8dato : *dmy);
pdf            endif;
pdf            UpdHTMLVar('Debtcollectiondate': %char(tmpdate : *iso));
6.16
6.16           WrtSection('TotalLineStart');
6.16
6.35           UpdHTMLVar('Leadmiddletext':      %trim(w_tl6));
6.16           UpdHTMLVar('Leadmiddlevalue':    %char(t1forf));
6.16           WrtSection('LeadMiddleText');
6.16
6.16           if b_geby = *on;
6.35           UpdHTMLVar('Leadmiddletext':      %trim(w_tl7));
6.16           UpdHTMLVar('Leadmiddlevalue':    %char(t2geby));
6.16           WrtSection('LeadMiddleText');
6.16           endif;
6.16
6.16           if b_rent = *on;
6.35           UpdHTMLVar('Leadmiddletext':      %trim(w_tl8));
6.16           UpdHTMLVar('Leadmiddlevalue':    %char(t2rent));
6.16           WrtSection('LeadMiddleText');
6.16           endif;
6.16
6.35           UpdHTMLVar('Leadmiddletext':      %trim(w_tl9));
6.16           UpdHTMLVar('Leadmiddlevalue':    %char(t3sald));
6.16           WrtSection('LeadMiddleText');
6.16
6.35           UpdHTMLVar('Leadmiddletext':     %trim(w_tl10));
6.16           UpdHTMLVar('Leadmiddlevalue':              ' ');
6.16           WrtSection('LeadMiddleText');
6.16
6.16       //  WrtSection('LeadMiddleEnd');
6.16
6.35           UpdHTMLVar('Paymentnoticeref':  %trim(w_9fkpr));
pdf            UpdHTMLVar('Paymentnoticephone':        t9ftfn);
pdf            UpdHTMLVar('Paymentnoticeemail':        t9feml);
pdf            UpdHTMLVar('Overduepercentage':  %char(t2rpro));
pdf            UpdHTMLVar('Overdueamount':      %char(t2rent));
pdf            UpdHTMLVar('Bankaccount':              a1fbgi);
pdf            UpdHTMLVar('Kidno':                     t0kkid);
pdf            UpdHTMLVar('Printgiro':                 w_bgir);
pdf
6.16       //  WrtSection('TotalLine');
6.16           WrtSection('LeadMiddleEnd');
pdf
6.16           if b_inka = *on;
6.35           UpdHTMLVar('Leadbottomtext':     %trim(t1tl11));
6.16           WrtSection('LeadBottomText');
6.35           UpdHTMLVar('Leadbottomtext':     %trim(t1tl12));
6.16           WrtSection('LeadBottomText');
6.35           UpdHTMLVar('Leadbottomtext':     %trim(w_tl13));
6.16           WrtSection('LeadBottomText');
6.16           endif;
pdf
6.16           UpdHTMLVar('Leadbottomtext':               ' ');
6.16           WrtSection('LeadBottomText');
6.35           UpdHTMLVar('Leadbottomtext':     %trim(w_tl14));
6.16           WrtSection('LeadBottomText');
6.2B           UpdHTMLVar('Leadbottomtext':            t9feml);
6.2B           WrtSection('LeadBottomText');
6.16
6.16           if b_kidd = *on;
6.16           UpdHTMLVar('Leadbottomtext':               ' ');
6.16           WrtSection('LeadBottomText');
6.16           UpdHTMLVar('Leadbottomtext':               ' ');
6.16           WrtSection('LeadBottomText');
6.35           UpdHTMLVar('Leadbottomtext':     %trim(w_tl15));
6.16           WrtSection('LeadBottomText');
6.16           endif;
pdf
6.16           WrtSection('LeadBottomEnd');
pdf   /End-free
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf   * Subrutiner for XML/jasper integrasjon - Slutt                   *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
pdf  c     xml_end       begsr
pdf   *
pdf   * Hvis denne ikke skal arkiveres, lages ikke archive tagg.
pdf   *
pdf  c                   if        l_arch = 1
6.10  * Lag tag for vising i arkivklienten
6.10 c                   eval      w_dspl = *blank
6.26 c                   eval      w_dspl = 'Betalingsvarsel nr: '+
6.10 c                             %char(w_nota) +
6.10 c                             ' Kunde: ' +  %trim(%char(a1kund) + ' - ' +
6.10 c                             %trim(a1navn) + '  Beløp ' + %char(t3sald))
6.10  *
6.13 c                   eval      p_str_in = *blank
6.13 c                   eval      p_lr = '0'
6.13 c                   movel     w_dspl        p_str_in
6.13 c                   call      'AP613R'
6.13 c                   parm                    p_str_in
6.13 c                   parm                    p_str_out
6.13 c                   parm                    p_lr
6.13 c                   movel     p_str_out     w_dspl
6.26  * Referansetagg
6.26 c                   eval      w_refn = *blank
6.27 c**                 eval      w_refn = 'BV-' + %char(w_nota) +
6.27 c**                           '-' + %char(%subdt(w_date:*years))
6.27 c                   eval      w_refn = %char(%subdt(w_date:*years)) +
6.27 c                             %char(w_nota)
pdf   /Free
pdf
6.26           UpdHTMLVar('Refno':          %trim(w_refn));
6.10           UpdHTMLVar('Displaytag':     %trim(w_dspl));
pdf            WrtSection('ArchiveCommandStart');
pdf
6.2D           UpdHTMLVar('Metavalue':     %char(w_nota));
6.2D           UpdHTMLVar('Metakey':        'NOTANUMMER');
6.26           WrtSection('MetaTag');
pdf
6.2D           UpdHTMLVar('Metavalue':     %char(rsbunt));
6.2D           UpdHTMLVar('Metakey':        'BUNTNUMMER');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':      %char(a1kund));
pdf            UpdHTMLVar('Metakey':         'KUNDENUMMER');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':            w_1navn);
pdf            UpdHTMLVar('Metakey':          'KUNDENAVN');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metavalue':      %char(t3sald));
pdf            UpdHTMLVar('Metakey':              'BELOP');
pdf            WrtSection('MetaTag');
6.26
6.26           UpdHTMLVar('Metavalue':       %char(pfdat));
6.26           UpdHTMLVar('Metakey':            'FORFALL');
6.26           WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metakey': %char(w_date:*iso));
pdf            UpdHTMLVar('Metavalue':           'DATO');
pdf            WrtSection('MetaTag');
pdf
pdf            UpdHTMLVar('Metakey':             l_user);
pdf            UpdHTMLVar('Metavalue':         'BRUKER');
pdf            WrtSection('MetaTag');
6.20
6.20           UpdHTMLVar('Metavalue':             aftxt1);
6.20           UpdHTMLVar('Metakey':         'RUTINETEKST');
6.20           WrtSection('MetaTag');
6.26
6.26           UpdHTMLVar('Metavalue':             l_ruti);
6.26           UpdHTMLVar('Metakey':             'RUTINE');
6.26           WrtSection('MetaTag');
6.26
6.26           UpdHTMLVar('Metavalue':      %char(l_firm));
6.26           UpdHTMLVar('Metakey':              'FIRMA');
6.26           WrtSection('MetaTag');
6.26
6.26           UpdHTMLVar('Metavalue':             l_wsid);
6.26           UpdHTMLVar('Metakey':             'SKJERM');
6.26           WrtSection('MetaTag');
6.20
pdf            WrtSection('ArchiveCommandEnd');
pdf   /End-free
pdf  c                   endif
pdf   *
pdf   * Skriv xmlfila til disk
pdf   /Free
pdf            WrtSection('Footer');
pdf   /End-free
6.29 c                   if        %trim(d_fifo) = *blanks
pdf  c                   eval      XML_Output = XML_path + l_filg +'/'+
pdf  c                             'Betva_'+ %trim(w_jkey) + '.xml'
6.29 c                   else
6.29 c                   eval      XML_Output = %trim(d_fifo) + '/'+
6.29 c                             'Betva_'+ %trim(w_jkey) + '.xml'
6.29 c                   endif
pdf   *
pdf  c                   callp     WrtHtmlToStmf(XML_Output: 819)
6.31  * Skriver til datakø for å aktivere sniffer, hvis dataq er aktiv
6.31 c                   if        d_dtaq = '1'
6.31 c                   eval      p_xmlf = xml_output
6.31 c                   eval      p_filg = 'ADB'+l_filg
6.31 c                   call      'AP629C'
6.31 c                   parm                    p_filg
6.31 c                   parm                    p_xmlf
6.31 c                   endif
pdf   * Ikke lenger første xml
pdf  c                   eval      b_first = *off
pdf   *
pdf  c                   endsr
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
pdf   * Subrutine for etablering av batchnummer
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
pdf   *
pdf  c     pdf_batchno   begsr
pdf   *
pdf   * Vi starter med logging av jobb, og får tilbake unik jobbid.
pdf   * Først få jobbnummer
pdf   *
pdf  c                   eval      w_kode = '0'
pdf  c                   eval      w_firm = l_firm
pdf  c                   eval      w_fell = 'NXTKLI'
pdf  c                   eval      w_type = *blank
pdf  c                   eval      w_fast = *blank
pdf  c                   eval      w_numm = *zero
pdf   *
pdf  c                   call      'AS100R'
pdf  c                   parm                    w_kode
pdf  c                   parm                    w_firm
pdf  c                   parm                    w_fell
pdf  c                   parm                    w_type
pdf  c                   parm                    w_fast
pdf  c                   parm                    w_numm
pdf   *
pdf  c                   eval      w_jnav = 'PDF' + %char(w_numm)
pdf  c                   eval      w_jtxt = 'Utskrift av PDF'
pdf  c                   call      'AB700R'
pdf  c                   parm                    w_jnav
pdf  c                   parm                    w_jkey
pdf  c                   parm                    w_jtxt
pdf  c                   eval      l_bach = w_jkey
pdf   *
pdf  c     end_batchno   endsr
pdf   *
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
pdf   * Subrutine for logging av fremdrift
pdf   * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
pdf   *
pdf  c     pdf_logg      begsr
pdf   *
pdf   * Vi logger at utskriftprogrammet har startet
pdf  c                   eval      w_jstat = 10
pdf  c                   eval      w_jtext = 'Utskrift av rentenota har startet'
pdf  c                   call      'AB705R'
pdf  c                   parm                    w_jkey
pdf  c                   parm                    w_jstat
pdf  c                   parm                    w_jtext
pdf   *
pdf  c     end_logg      endsr
6.23  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.23  * Subrutiner for XML/jasper integrasjon - Detaljer                *
6.23  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
6.23 c     hnt_avde      begsr
6.23  * Hent inn avdelingsinformasjon
6.23 c
6.23 c                   eval      w_ddeno = w_davd
6.23 c                   eval      w_dnavn = *blank
6.23 c                   eval      w_dadr1 = *blank
6.23 c                   eval      w_dadr2 = *blank
6.23 c                   eval      w_dpcde = *zeros
6.23 c                   eval      w_dpstd = *blank
6.23 c                   eval      w_dphon = *blank
6.23 c                   eval      w_dfaxn = *blank
6.23  *
6.23 c                   eval      ra07pf_avde = w_davd
6.23 c     ra07pf_key    chain     ra07pfr                            90
6.23 c                   if        *in90  = *off
6.23 c                   eval      w_dnavn = ragtxt
6.23 c                   eval      w_dadr1 = ragadr
6.23 c                   eval      w_dadr2 = ragad2
6.23 c                   eval      w_dpcde = ragpnr
6.23 c                   eval      w_dpstd = (%char(ragpnr) + ' ' + ragste)
6.23 c                   if        ragtlf <> *blank
6.23 c                   eval      w_dphon = ragtlf
6.23 c                   endif
6.23 c                   if        ragfax <> *blank
6.23 c                   eval      w_dfaxn = ragfax
6.23 c                   endif
6.23 c                   endif
6.23  *
6.23 c                   endsr
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
610  c     *entry        plist
610  c                   parm                    w_memb
     c                   eval      w_kund_gml = *hival
      *
     c                   eval      rgtext = 'Rente/purregebyr'
      *
      * Key for transaksjonsregister
      *
     c     rkwbl2_key    klist
     c                   kfld                    w_firm
      *
      * Key for kunderegister
      *
     c     rkunl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rkunl1_kund
      *
      * Key for firmaregister
      *
     c     afirl1_key    klist
     c                   kfld                    w_firm
      *
      * Key for rutine-register
      *
     c     aforl1_key    klist
     c                   kfld                    aforl1_ruti
      *
      * Key for statuskode 4
      *
     c     raa4l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    raa4l1_4aar
      *
      * Key for statuskode 4
      *
     c     raa4lu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    raa4lu_4aar
      *
      * Key for statuskode 5
      *
     c     raa5l1_key    klist
     c                   kfld                    w_firm
      *
      * Key for statuskode 6
      *
     c     raa6l1_key    klist
     c                   kfld                    w_firm
      *
      * Key for bilagskoder
      *
     c     ra01l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra01l1_akod
      *
      * Key for faste konti
      *
     c     ra04l1_key    klist
     c                   kfld                    w_firm
      *
      * Key for kundekategori
      *
     c     ra11l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra11l1_kkod
      *
      * Key for landkoder
      *
     c     ra12l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra12l1_lkod
      *
      * Key for valutakoder
      *
     c     ra16l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra16l1_pkod
      *
      * Key for formular-register
      *
     c     ra70l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra70l1_0kod
     c                   kfld                    ra70l1_0spr
     c                   kfld                    ra70l1_0lin
      *
      * Key for buntregister
      *
     c     rbunlu_key    klist
610  c                   kfld                    rbunlu_nivo
610  c                   kfld                    rbunlu_memb
     c                   kfld                    w_firm
     c                   kfld                    rbunlu_bunt
6.23  *
6.23  * Key for oppslag på avdelings-register
6.23  *
6.23 c     ra07pf_key    klist
6.23 c                   kfld                    w_firm
6.23 c                   kfld                    ra07pf_avde
      *
     c                   eval      w_firm = l_firm
pdf   *
pdf   * Sjekk om vi skal bruke JASPER og XML generering av dokumenter
pdf  c                   if        l_poff = '1'
pdf  c                   eval      b_pdfp = *off
pdf  c                   eval      w_pdf = 0
pdf  c                   eval      w_pdf_ds = *blanks
pdf  c                   eval      w_ruti = l_ruti
pdf   *
pdf  c                   call      'AP609R'
pdf  c                   parm                    w_ruti
pdf  c                   parm                    w_pdf
pdf  c                   parm                    w_pdf_ds
pdf  c                   eval      d_pdf_ds = w_pdf_ds
pdf   * Vi skal kjøre med jasper
pdf  c                   if        w_pdf = 1 and
pdf  c                             %trim(d_xmlm) <> *blanks
pdf  c                   eval      p_mail = '0'
pdf   * Hent inn xml templaten
pdf  c                   callp     GetHTMLIFS(d_xmlm :'<AS400>')
6.32 c                   callp     ClrHtmlBuffer
pdf   *
pdf   * Finn hvor xml'en skal legges
pdf   *
pdf  c                   eval      XML_path = *blanks
pdf  c                   eval      XML_path = %trim(d_path)
pdf   *
pdf   * Finn path til logo
pdf   *
pdf  c                   eval      jasper_logo = *blanks
pdf  c                   eval      jasper_logo = %trim(d_logo)
pdf   *
pdf   * Første jobbnummer er allerede generert i AP600R. Overføres i *lda
pdf   *
pdf  c                   eval      w_jkey = l_bach
pdf  c                   time                    w_date
pdf   * Vi logger at utskriftprogrammet har startet
pdf  c                   exsr      pdf_logg
pdf  c                   eval      b_pdfp = *on
pdf  c                   eval      b_first = *on
pdf   *
pdf  c                   endif
pdf  c                   else
pdf  c                   eval      b_pdfp = *off
pdf  c                   endif
      *
      * Hente inn formular-register
      *
     c                   eval      aforl1_ruti = l_ruti
     c     aforl1_key    chain     aforl1r
      *
     c                   if        not%found
     c                   eval      afinst = 1
     c                   eval      afprfi = 1
     c                   endif
      *
      * Instillinger av blankett
      *
pdf  c                   if        b_pdfp = *off
     c                   if        afinst = 1
     c                   write(e)  a0hdr
     c                   endif
pdf  c                   endif
      *
      *  Hent inn firma opplysninger dersom
      *  kode for det er satt i rutineregister
      *
     c                   if        afprfi = 1
     c                   eval      w_prfi = afprfi
     c                   eval      w_ffir = w_firm
     c                   eval      w_avde = rkavde
      *
     c                   call      'RÅ707R'
     c                   parm                    w_prfi
     c                   parm                    w_ffir
     c                   parm                    w_avde
     c                   parm                    w_fnav
     c                   parm                    w_fad1
     c                   parm                    w_fad2
     c                   parm                    w_fste
     c                   parm                    w_fftx
     c                   parm                    w_tfax
     c                   parm                    w_ftlf
     c                   parm                    w_ffax
     c                   parm                    w_tbnk
     c                   parm                    w_fbgi
      *
     c                   eval      a1fnav = w_fnav
     c                   eval      a1fad1 = w_fad1
     c                   eval      a1fad2 = w_fad2
     c                   eval      a1fste = w_fste
     c                   eval      a1fftx = w_fftx
     c                   eval      a1tfax = w_tfax
     c                   eval      a1ftlf = w_ftlf
     c                   eval      a1ffax = w_ffax
     c                   eval      a1tbnk = w_tbnk
     c                   eval      a1fbgi = w_fbgi
      *
      * Skal firmanavn droppes på betlingsvarsel ?
      *
     c                   if        w_aprt = 1
     c                   eval      a1fnav = *blank
     c                   eval      a1fad1 = *blank
     c                   eval      a1fad2 = *blank
     c                   eval      a1fste = *blank
     c                   eval      a1fftx = *blank
     c                   eval      a1tfax = *blank
     c                   eval      a1ftlf = *blank
     c                   eval      a1ffax = *blank
     c                   eval      a1tbnk = *blank
     c                   eval      a1fbgi = *blank
     c                   endif
      *
     c                   endif
      *
      * Hente inn kontaktperson
      *
     c     raa5l1_key    chain     raa5l1r
      *
     c                   if        %found
     c                   eval      t9fkpr = ra5kpr
T5.50c                   eval      t9ftfn = ra5tfn
T5.50c                   eval      t9feml = ra5eml
     c                   else
     c                   eval      t9fkpr = *blank
T5.50c                   eval      t9ftfn = *blank
T5.50c                   eval      t9feml = *blank
     c                   endif
T5.50c                   if        t9ftfn <> *blank
T5.50c                   eval      *in88  = *on
T5.50c                   endif
T5.50c                   if        t9feml <> *blank
T5.50c                   eval      *in89  = *on
T5.50c                   endif
      *
      * Hente inn rentegrense
      *
     c     raa6l1_key    chain     raa6l1r
      *
     c                   if        %found
     c                   eval      w_6pgr = ra6pgr
     c                   else
     c                   eval      w_6pgr = 0
     c                   endif
      *
     c                   exsr      klargj
pdf   * Vi skriver xml for miljø formater
pdf  c                   if        b_pdfp = *on
pdf  c                   exsr      xml_envm
pdf  c                   endif
6.28  * hent informasjon fra firmareg
6.28 c     afirl1_key    chain     afirl1r
6.28  *
     c                   endsr
