     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK668R                                              *
      * Beskrivelse . . : Sjekker poster mot rentegrense                      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *                                                                       *
      *                                                                       *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     frkwbl2    if   e           k disk    rename(rkwbpfr:rkwbl2r)
     frkwblu    uf   e           k disk    rename(rkwbpfr:rkwblur)
     fraa6l1    if   e           k disk    rename(raa6pfr:raa6l1r)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
     d rkwblu_kund     s                   like(rnkund)
      *
     d w_firm          s                   like(rnfirm)
     d w_rdat          s                   like(rnrdat)
     d w_renk          s                   like(rnrenk)
     d w_rsum          s                   like(rwrent)
     d w_rgrn          s                   like(ra6pgr)
      *
     d g_kund          s                   like(rnkund)
      *
      *  Les posteringer
      *
     c     rkwbl2_key    setll     rkwbl2r                                61
     c     rkwbl2_key    reade     rkwbl2r                                61
      *
     c                   eval      g_kund = rnkund
      *
     c                   dow       *in61 = *off
      *
      *  Summer rentebeløp
      *
     c                   eval      w_rsum = w_rsum + rwrent
      *
     c                   if        g_kund <> rnkund and
     c                             w_rsum < w_rgrn
     c                   exsr      slett_post
     c                   eval      w_rsum = 0
     c                   eval      g_kund = rnkund
     c                   endif
      *
     c     rkwbl2_key    reade     rkwbl2r                                61
     c                   enddo
      *
     c     slutt         tag
      *
     c                   eval      *inlr = *on
      *
     c     slett_post    begsr
      *
      * Subrutine for sletting av poster
      *
     c                   eval      rkwblu_kund = g_kund
      *
     c     rkwblu_key    setll     rkwblu                                 92
     c     rkwblu_key    reade     rkwblu                                 92
      *
     c                   dow       *in92 = *off
      *
     c                   delete    rkwblu
      *
     c     rkwblu_key    reade     rkwblu                                 92
      *
     c                   enddo
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      w_firm = l_firm
      *
      * Key for kundeposteringer
      *
     c     rkwbl2_key    klist
     c                   kfld                    w_firm
      *
      * Key for kundeposteringer
      *
     c     rkwblu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rkwblu_kund
      *
      * Key for statuskode 6
      *
     c     raa6l1_key    klist
     c                   kfld                    w_firm
      *
     c     raa6l1_key    chain     raa6l1                             99
      *
     c                   if        %found
     c                   eval      w_rgrn= ra6pgr
     c                   endif
      *
     c                   endsr
