     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK680R                                              *
      * Beskrivelse . . : Utskrift av factoringliste - parameter              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
T5.30 * R5.40     120405  Nytt program                                   KOB  *
      * R5.40     120406  Lagt inn utskrift i bilagsnummerrekkefølge     KOB  *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     frkunl1    if   e           k disk    rename(rkunpfr:rkunl1r)
     fraa5l1    if   e           k disk    rename(raa5pfr:raa5l1r)
     frkwapf    uf a e           k disk
     frk680d    cf   e             workstn
      *
     d                uds
     d  pfirm                300    302  0
     d  pnavn                303    332
     d  puser                333    342
     d  pkdat                343    348  0
     d  praar                349    352  0
     d  prper                353    354  0
     d  pbskr                469    469
     d  palfa                475    475
     d  pbilk                476    477  0
     d  pparam               300    490
      *
     d  l_user               911    920
     d  l_firm               944    946  0
     d  l_fnav               951    980
      *
     d n               s              2  0
     d waar            s              4  0
     d wkun            s              7  0
     d wmnd            s              2  0
     d wpakod          s              2  0
     d wpdat1          s              6  0
      *
     d p_in03          s              1
     d p_stat          s              1
     d p_kode          s              4  0
     d p_kund          s              6  0
     d p_tx30          s             30
      *
     d w_firm          s              3  0
     d w_dato          s               d   datfmt(*iso)
     d w_dagr          s              2  0 inz(14)
     d x_dato          s               d   datfmt(*iso)
      *
      * Definering av variabler i nøkler
      *
     d rkunl1_kund     s                   like(rkkund)
      *
      /eject
      *
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
      *
     c                   exfmt     a2bld
      *
     c                   eval      *in11 = *off
     c                   eval      *in12 = *off
     c                   eval      *in13 = *off
     c                   eval      *in14 = *off
     c                   eval      *in15 = *off
     c                   eval      *in16 = *off
     c                   eval      *in17 = *off
     c                   eval      *in18 = *off
     c                   eval      *in19 = *off
     c                   eval      *in20 = *off
     c                   eval      *in31 = *off
     c                   eval      *in32 = *off
     c                   eval      *in33 = *off
     c                   eval      *in34 = *off
     c                   eval      *in35 = *off
     c                   eval      *in36 = *off
     c                   eval      *in37 = *off
     c                   eval      *in38 = *off
     c                   eval      *in39 = *off
     c                   eval      *in40 = *off
     c                   eval      *in41 = *off
     c                   eval      *in42 = *off
     c                   eval      *in44 = *off
     c                   eval      *in45 = *off
     c                   eval      *in46 = *off
     c                   eval      *in47 = *off
     c                   eval      *in48 = *off
     c                   eval      *in49 = *off
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      1             p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c     *dmy          test(d)                 a2pkda                 31
     c                   if        *in31 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Skriv parameter (LDA)
      *
     c                   move      a2pkda        pkdat
     c                   move      a2pskr        pbskr                                       .
     c                   move      a25raf        palfa                                       .
     c                   move      a2bilk        pbilk                                       .
      *
      * Skriv parameter (RKWAPF)
      *
     c                   eval      rwkkey = *blanks
     c                   movel     pfirm         rwkkey
      *
     c     kwakey        chain     rkwapf                             99
     c                   move      pparam        rwkrec
      *
     c                   if        *in99 = *on
     c                   write     rkwapfr
     c                   else
     c                   update    rkwapfr
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   eval      wpdat1 = 0
      *
      * Legg inn firma-nr. og navn + std.verdier for parameter
      *
     c                   move      l_firm        w_firm
      *
     c                   time                    w_dato
     c     *dmy          move      w_dato        a2pkda
      *
     c                   eval      a25raf = 'B'                                              .
T5.30c                   eval      pfirm = l_firm
     c                   eval      pkdat = *zeros
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
      * Key for parameterfil
      *
     c     kwakey        klist
     c                   kfld                    rwkkey
      *
     c                   endsr
