     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK683R                                              *
      * Beskrivelse . . : Overføring av factoringposter - parameter           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      * R5.40     140405  Nytt program                                   KOB  *
      *                                                                       *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fraa9l1    if   e           k disk    rename(raa9pfr:raa9l1r)
     frk683d    cf   e             workstn
      *
     d                uds
     d  pfirm                300    302  0
     d  pnavn                303    332
     d  puser                333    342
     d  pkdat                343    348  0
     d  praar                349    352  0
     d  prper                353    354  0
     d  pajor                472    472
     d  pform                473    482
     d  pparam               300    490
      *
     d  l_user               911    920
     d  l_firm               944    946  0
     d  l_fnav               951    980
      *
     d w_in03          s              1
     d w_firm          s                   like(l_firm)
      *
      /eject
      *
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
      *
     c                   exfmt     a2bld
      *
     c                   eval      *in20 = *off
     c                   eval      *in31 = *off
     c                   eval      *in32 = *off
     c                   eval      *in33 = *off
     c                   eval      *in34 = *off
     c                   eval      *in35 = *off
     c                   eval      *in36 = *off
     c                   eval      *in37 = *off
     c                   eval      *in38 = *off
     c                   eval      *in39 = *off
     c                   eval      *in40 = *off
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   eval      w_in03 = '1'                                     .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c     *dmy          test(d)                 a2pkda                 31
     c                   if        *in31 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av ajourføring
      *
     c                   if        a2areg <> 'J' and                                     .....
     c                             a2areg <> ' '                                             .
     c                   move      *on           *in35                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Skriv parameter (LDA)
      *
     c                   eval      pkdat = a2pkda
     c                   eval      pajor = a2areg
     c                   eval      praar = a2prÅr
     c                   eval      prper = a2prpe
     c                   eval      pform = a2form
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      * Legg inn firma-nr. og navn + std.verdier for parameter
      *
     c                   move      l_firm        w_firm
     c                   move      udate         a2pkda
     c                   move      *month        a2prpe
     c                   move      *year         a2prÅr
      *
      * Hent statusrecord/factoring
      *
     c     raa9l1_key    chain     raa9l1
      *
     c                   eval      a2areg = ra9reg
     c                   eval      a2form = ra9fmt
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_in03
      *
      * Key for statusopplysninger/factoring
      *
     c     raa9l1_key    klist
     c                   kfld                    w_firm
      *
     c                   endsr
