     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK690R                                        *
      * Beskrivelse . . : Utskrift av generalnota - parameter           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                               *
      * Tilpasset for . :                                               *
      *                                                                 *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      * V5.50 260907 HFL  Mulig med generalnota for en kunde            *
7.xx  * 7.xx      120618  Endringer reltart til ny GUI. NB Kan kun gjelde BKV
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
T5.50frkunl1    if   e           k disk    rename(rkunpfr:rkunl1r)
     frk690d    cf   e             workstn
      *
     d                 ds
     d w6bdat                         6  0
     d  w6bdag                        2  0 overlay(w6bdat)
     d  w6bmnd                        2  0 overlay(w6bdat:3)
     d  w6baar                        2  0 overlay(w6bdat:5)
      *
     d                 ds
     d w_bdat                         8  0
     d  w_baar                        4  0 overlay(w_bdat)
     d  w_bmnd                        2  0 overlay(w_bdat:5)
     d  w_bdag                        2  0 overlay(w_bdat:7)
      *
     d                uds
     d pdato                 300    305  0
     d pbdat                          8  0
     d praar                          4  0
     d prper                          2  0
     d pbtyp                          1
     d pforf                          1
     d pbetb                          1
T5.50d ppknf                          6  0
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d waar            s              4  0
     d wmnd            s              2  0
     d wpakod          s              2  0
     d wpdat1          s              6  0
     d p_in03          s              1
     d wpokok          s              1
     d w_aar           s              2  0
     d w_firm          s              3  0
     d w_user          s                   like(l_user)
T5.50d rkunl1_kund     s                   like(rkkund)
      *
      /eject
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
      *
     c                   eval      *in31 = *off
     c                   eval      *in32 = *off
     c                   eval      *in33 = *off
      *
     c                   exfmt     a2bld
T5.50c                   eval      *in34 = *off
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c     *dmy          test(d)                 a2pkda                 31
     c                   if        *in31 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av regnskapsår
      *
     c                   if        a2prÅr <> waar                                        .....
     c                             and a2prÅr <> *year                                       .
     c                   move      *on           *in32                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
T5.50 *  Kontroll av kundenr.
      *
T5.50c                   if        a2pknf <> *zeros                                        . .
T5.50c                   eval      rkunl1_kund = a2pknf                                    . .
T5.50c     rkunl1_key    chain     rkunl1                             61                   . .
      *
T5.50c                   if        *in61 = *on                                             . .
T5.50c                   move      *on           *in34                          Pos.cur.     .
T5.50c                   goto      a2taga                                                    .
T5.50c                   endif                                                             . .
T5.50c                   endif                                                             . .
      *
      * Skriv parameter
      *
     c                   move      a2pkda        pdato
      *
      * Snu bilagsdato og
      * utvid til 8 siffer
      *
     c                   move      a2pkda        w6bdat
     c                   move      w6baar        w_baar
      *
     c                   if        w6baar > 80
     c                   eval      w_baar = w_baar + 1900
     c                   else
     c                   eval      w_baar = w_baar + 2000
     c                   endif
      *
     c                   move      w6bmnd        w_bmnd
     c                   move      w6bdag        w_bdag
     c                   move      w_bdat        pbdat
      *
     c                   move      a2prÅr        praar
     c                   move      a2pper        prper
     c                   move      a2btyp        pbtyp
     c                   move      a2forf        pforf
     c                   move      a2betb        pbetb
T5.50c                   move      a2pknf        ppknf
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   eval      wpdat1 = 0
     c                   eval      wpokok = *blank
      *
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   move      l_user        w_user
     c                   move      l_firm        w_firm
     c                   move      udate         a2pkda
      *
     c                   eval      w6bdat = *zeros
     c                   eval      w_bdat = *zeros
      *
      * BEREGNER PERIODE
      *
     c                   move      *year         waar
      *
     c                   eval      wmnd = umonth - 1
     c                   if        wmnd = *zero                                          .....
     c                   movel     12            wmnd                                        .
     c                   eval      waar = waar - 1                                           .
     c                   move      waar          a2prÅr                                      .
     c                   else                                                                .
     c                   move      waar          a2prÅr                                      .
     c                   endif                                                           .....
      *
     c                   move      wmnd          a2pper
      *
     c                   eval      a2btyp = *blank
     c                   eval      a2forf = *blank
     c                   eval      a2betb = *blank
      *
     c                   eval      p_in03 = ' '
      *
      * Hent bruker-record
      *
     c     ausrl1_key    chain     ausrl1                             63
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
      * Key for bruker-file
      *
     c     ausrl1_key    klist
     c                   kfld                    w_user
      *
      * Key for kunderegister
      *
     c     rkunl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rkunl1_kund
      *
     c                   endsr
