     h/TITLE  Utskrift av autogiro - parameter
     h option(*nodebugio)
     h datedit(*dmy)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK811R                                              *
      * Beskrivelse . . : Utskrift av autogiro - parameter                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *           070203  Bilagsdato tatt ut, kjøredato = forfallsdato   GR   *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
     frk811d    cf   e             workstn
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d                 ds
     d d_parm                       120
     d  pfirm                         3  0 overlay(d_parm)
     d  pnavn                        30    overlay(d_parm:4)
     d  puser                        10    overlay(d_parm:34)
     d  pkdat                         6  0 overlay(d_parm:44)
     d  praar                         4  0 overlay(d_parm:50)
     d  prper                         2  0 overlay(d_parm:54)
     d  pavdf                         4  0 overlay(d_parm:56)
     d  pavdt                         4  0 overlay(d_parm:60)
     d  pkatf                         4  0 overlay(d_parm:64)
     d  pkatt                         4  0 overlay(d_parm:68)
     d  pself                         4  0 overlay(d_parm:72)
     d  pselt                         4  0 overlay(d_parm:76)
     d  pknrf                         6  0 overlay(d_parm:80)
     d  pknrt                         6  0 overlay(d_parm:86)
6.NU d  pbilf                         8  0 overlay(d_parm:92)
6.NU d  pbilt                         8  0 overlay(d_parm:100)
     d  pfdat                         6  0 overlay(d_parm:108)
     d  palfa                         1    overlay(d_parm:114)
      *
     d w_parm          s            120
     d waar            s              4  0
     d wmnd            s              2  0
     d wpakod          s              2  0
     d wpdat1          s              6  0
     d*wplist          s                   like(aqulda)
     d wpokok          s              1
     d wwaar           s              2  0
     d w_firm          s              3  0
     d w_udat          s               d   datfmt(*iso)
     d w_odat          s              6  0
      *
     d*COPY QCPYLESRC,RA03PFDS
     d*COPY QCPYLESRC,ASDATODS
     c/eject
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
     c/eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
      *
     c                   exfmt     a2bld
      *
     c                   eval      *in31 = *off
     c                   eval      *in32 = *off
     c                   eval      *in33 = *off
     c                   eval      *in34 = *off
     c                   eval      *in35 = *off
     c                   eval      *in36 = *off
     c                   eval      *in37 = *off
     c                   eval      *in38 = *off
     c                   eval      *in39 = *off
     c                   eval      *in40 = *off
     c                   eval      *in41 = *off
     c                   eval      *in42 = *off
     c                   eval      *in44 = *off
     c                   eval      *in45 = *off
     c                   eval      *in46 = *off
     c                   eval      *in47 = *off
     c                   eval      *in48 = *off
     c                   eval      *in49 = *off
      *
      * Valg av firma
      *
     c                   if        *inka = *on                                           .....
     c                   if        abbfir = *blank                                    .....  .
     c                   call      'AA002R'                                               .  .
     c                   parm                    l_user                                   .  .
     c     key03         chain     ausrl1                             63                  .  .
     c                   move      absfir        w_firm                                   .  .
      *                                                              .  .
      *  Sjekk om begrenset til avdeling                             .  .
      *                                                              .  .
     c                   if        abbavd = 'J'                                           .  .
     c                   move      *on           *in30                          Protect.     .
     c                   move      absavd        a2pavf                                   .  .
     c                   move      absavd        a2pavt                                   .  .
     c                   endif                                                            .  .
      *                                                              .  .
     c                   goto      a2taga                                                 .  .
     c                   endif                                                        .....  .
     c                   endif                                                           .....
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Klargjør for kontroll av dato'er
      *
     c*                  if        a2pkda = *zero                                        .....
     c*                  move      udate         a2pkda                                      .
     c*                  endif                                                           .....
     c*                  move      a2pkda        wwaar
     c*                  movel     a2pkda        aqida1                         Kjøredato
     c*                  move      1900          aqida1
     c*                  if        wwaar < 83
     c*                  move      2000          aqida1
     c*                  endif
     c*                  move      wwaar         aqida1                          -år
     c*                  move      'DMÅ'         aqidm1                         Datoformat
      *
     c*                  move      aqulda        wplist
     c*                  call      'ASDATO'                                     Beregn div.
     c*                  parm                    wplist                          utfra dato
     c*                  move      wplist        aqulda
      *
      *
      * Sjekke om kjøredato er gyldig -> Kjøredato er nå forfallsdato
      *
     c*                  if        aqa1ok = 'N'                                          .....
     c*                  move      *on           *in31                          Pos.cur.     .
     c*                  goto      a2taga                                                    .
     c*                  endif                                                           .....
     c                   if        a2pkda = *zero                                        .....
     c                   move      w_odat        a2pkda                                      .
     c                   endif                                                           .....
     c     *dmy          test(d)                 a2pkda                 31
     c                   if        *in31  = *on
     c                   goto      a2taga
     c                   endif
      *
      *  Kontroll avdeling
      *
     c                   if        a2pavf > a2pavt                                       .....
     c                   move      *on           *in43                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll kundekategori
      *
     c                   if        a2pkaf > a2pkat                                       .....
     c                   move      *on           *in42                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll selger
      *
     c                   if        a2psef > a2pset                                       .....
     c                   move      *on           *in44                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av kundenr. fra - til
      *
     c                   if        a2pknf > a2pknt                                       .....
     c                   move      *on           *in48                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av bila/faktura-nr. fra - til
      *
     c                   if        a2pbif > a2pbit                                       .....
     c                   move      *on           *in47                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av ALFABETISK/NUMERISK SORTERING
      *
     c                   if        a2palf <> 'J'                                         .....
     c                   if        a2palf <> ' '                                             .
     c                   move      *on           *in45                          Pos.cur.     .
     c                   goto      a2taga                                                    .
     c                   endif                                                               .
     c                   endif                                                           .....
      *
      * Skriv parameter (LDA)
      *
     c                   eval      puser = l_user
     c                   move      a2pkda        pkdat
     c*                  move      a2pfda        pfdat
     c                   move      a2pavf        pavdf
     c                   move      a2pavt        pavdt
     c                   move      a2pkaf        pkatf
     c                   move      a2pkat        pkatt
     c                   move      a2psef        pself
     c                   move      a2pset        pselt
     c                   move      a2pknf        pknrf
     c                   move      a2pknt        pknrt
     c                   move      a2pbif        pbilf
     c                   move      a2pbit        pbilt
     c                   move      a2palf        palfa
      *
     c                   eval      w_parm = d_parm
     c                   call      'RK811C'
     c                   parm                    w_parm
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      wpakod = *zero
     c                   z-add     0             wpdat1
     c                   eval      wpokok = *blank
      *
      *
      * Legg inn firma-nr. og navn + std.verdier for parameter
      *
     c                   move      l_firm        w_firm
     c                   move      *zeros        a2pavf
     c                   move      9999          a2pavt
     c                   move      *zeros        a2pkaf
     c                   move      9999          a2pkat
     c                   move      *zeros        a2psef
     c                   move      9999          a2pset
     c                   move      *zeros        a2pknf
     c                   move      999999        a2pknt
     c                   move      *zeros        a2pbif
     c                   move      999999        a2pbit
     c                   move      'J'           a2palf
     c*                  move      udate         a2pkda
     c*                  move      udate         a2pfda
      *
     c                   time                    w_udat
     c     *dmy          move      w_udat        w_odat
     c                   move      w_odat        a2pkda
      *
     c*                  move      *zeros        aqulda
     c                   eval      pfirm = l_firm
     c                   eval      pkdat = *zeros
     c                   eval      pfdat = *zeros
     c                   eval      pavdf = *zeros
     c                   eval      pavdt = *zeros
     c                   eval      pkatf = *zeros
     c                   eval      pkatt = *zeros
     c                   eval      pself = *zeros
     c                   eval      pselt = *zeros
     c                   eval      pknrf = *zeros
     c                   eval      pknrt = *zeros
     c                   eval      pbilf = *zeros
     c                   eval      pbilt = *zeros
      * BEREGNER PERIODE
     c                   eval      waar = *year
     c                   eval      wmnd = *month
     c                   if        wmnd = *zero                                          .....
     c                   movel     12            wmnd                                        .
      **                   MOVE WAAR      A2PRÅR                        .
     c                   else                                                                .
      **                   MOVE WAAR      A2PRÅR                        .
     c                   endif                                                           .....
      **                   MOVE WMND      A2PRPE
     c                   eval      praar = waar
     c                   eval      prper = 13
      *
      * Hent bruker-record
      *
     c     key03         chain     ausrl1                             63
      *
      *  Sjekk om begrenset til avdeling
      *
     c                   if        abbavd = 'J'                                          .....
     c                   move      *on           *in30                          Protect.     .
     c                   move      absavd        a2pavf                                      .
     c                   move      absavd        a2pavt                                      .
     c                   endif                                                           .....
      *
      * Key for bruker-file
      *
     c     key03         klist
     c                   kfld                    l_user
      *
     c                   endsr
