     h/TITLE    Oppdat. av autogiro - parameter
     h option(*nodebugio)
     h datedit(*dmy)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK815R                                              *
      * Beskrivelse . . : Oppdat. av autogiro - parameter                     *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *           110203  Flyttet parameterdata fra LDA til ord.param.    GR  *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     frkwapf    if   e           k disk
     d                uds
     d lcuser                911    920
     d lcfirm                944    946  0
     d lcnavn                951    980
      *
     d                 ds
     d d_parm                       120
     d  pfirm                         3  0 overlay(d_parm)
     d  pnavn                        30    overlay(d_parm:4)
     d  puser                        10    overlay(d_parm:34)
     d  pkdat                         6  0 overlay(d_parm:44)
     d  praar                         4  0 overlay(d_parm:50)
     d  prper                         2  0 overlay(d_parm:54)
     d  pavdf                         4  0 overlay(d_parm:56)
     d  pavdt                         4  0 overlay(d_parm:60)
     d  pkatf                         4  0 overlay(d_parm:64)
     d  pkatt                         4  0 overlay(d_parm:68)
     d  pself                         4  0 overlay(d_parm:72)
     d  pselt                         4  0 overlay(d_parm:76)
     d  pknrf                         6  0 overlay(d_parm:80)
     d  pknrt                         6  0 overlay(d_parm:86)
     d  pbilf                         6  0 overlay(d_parm:92)
     d  pbilt                         6  0 overlay(d_parm:98)
     d  pfdat                         6  0 overlay(d_parm:104)
     d  palfa                         1    overlay(d_parm:110)
      *
     d wpakod          s              2  0
     d wpdat1          s              6  0
     d wpokok          s              1
     d w_parm          s            120
      *
     c/EJECT
     c     dummy         tag
     c                   eval      rwkkey = *blanks
     c                   movel     lcfirm        rwkkey
     c     kwakey        chain     rkwapf                             10
     c                   eval      w_parm = rwkrec
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
     c/EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    w_parm
      *
     c                   eval      wpakod = *zero
     c                   z-add     0             wpdat1
     c                   eval      wpokok = *blank
      *
     c     kwakey        klist
     c                   kfld                    rwkkey
      *
     c                   endsr
     c/EJECT
