     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RK920R                                              *
      * Beskrivelse . . : Årsrutine - kunder                                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      * V5.50     090607  Lagt inn nullstilling av felt for almenninger  KOB  *
      * V5.50     020108  Kjøp i år ble ikke 0-stilt.                    HFL  *
6.10  * V6.10     230909  Lagt inn sporingsfelter                        BSA
6.11  * V6.10     070510  Endret sporingsfunksjonalitet                  BSA
6.30  * V6.30     110914  Felt flyttet fra RKUN til RKME (rkkjal)        BSA
      *                                                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     frkunlu    upe  e           k disk    rename(rkunpfr:rkunlur)
6.30 frkmelu    uf   e           k disk    rename(rkmepfr:rkmelur)
6.30 f                                     prefix(rx:2)
      *
6.10 d                uds
6.10 d l_user                911    920
6.30  *
6.30  * Definering av variable i nøkler
6.30  *
6.30 d rkmelu_firm     s                   like(rxfirm)
6.30 d rkmelu_kund     s                   like(rxkund)
      *
     c                   eval      rksaif = rksald
     c                   eval      rkkjØf = rkkjØp
T5.50c                   eval      rkkjØp = 0
6.30 c**                 eval      rkkjal = 0
     c                   eval      rkgral = 0
      *
6.10 c*                  time                    rkedat
6.10 c*                  time                    rketim
6.10 c*                  eval      rkesig = l_user
6.11 c                   time                    rk2dpt
6.11 c                   eval      rkepgm = 'RK920R    '
     c                   update    rkunlur
6.30  *
6.30  * Må oppdatere felt på RKME
6.30  *
6.30 c                   eval      rkmelu_firm = rkfirm
6.30 c                   eval      rkmelu_kund = rkkund
6.30 c     rkmelu_key    chain     rkmelu
6.30 c                   if        %found
6.30 c                   eval      rxkjal = 0
6.30 c                   time                    rxmeda
6.30 c                   time                    rxmeti
6.30 c                   eval      rxmeus = l_user
6.30 c                   update    rkmelur
6.30 c                   endif
6.30  *
     c     slutt         tag
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
6.30  *
6.30  * Key for memosaldo
6.30  *
6.30 c     rkmelu_key    klist
6.30 c                   kfld                    rkmelu_firm
6.30 c                   kfld                    rkmelu_kund
      *
     c                   endsr
