     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      * System  . . . . : ASOKON
      * Program . . . . : RK985r                                        *
      * Beskrivelse . . : Uttrekk til Visma                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      * Spesialversjon. :                                               *
      * Tilpasset for . :                                               *
      *                                                                 *
      * Referanse  Dato   Endringsbeskrivelse                      Sign.*
      * --------- ------  ----------------------------------------------*
      *                   Nytt program oktober  2012                NHO *
7.00  *            260419 Vedlikehold av bilagskode Nexstep/Ny      NHO *
7.01  *            030519 Test av Mamut                             NHO *
7.02  *            100220 Fjernet vedlikehold av bilagskodetabell   NHO *
7.02  *                   Lagt inn test av lager på Visma Business  NHO *
7.03  *K00  sst    031120 Uni Micro Integrasjon                         *
7.04  *K00  mst    150621 Visma Global lagerposter                      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     frk985d    cf   e             workstn
      *
     d                uds
     d rpfirm                300    310  0
     d rprdat                          d   datfmt(*iso)
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d p_in03          s              1
      *
      /eject
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg                                   *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2tagb        tag
      *
      *
      * Setter 'N' til alle valg
     c                   eval      a2glfa = 'N'
     c                   eval      a2glbu = 'N'
7.04 c                   eval      a2glla = 'N'
     c                   eval      a2gsfa = 'N'
     c                   eval      a2gsbu = 'N'
     c                   eval      a2bufa = 'N'
     c                   eval      a2bubu = 'N'
7.02 c***                eval      a2vedl = 'N'
7.02 c                   eval      a2bula = 'N'
7.01 c                   eval      a2mafa = 'N'
7.01 c                   eval      a2mabu = 'N'
     c                   eval      a2gsbu = 'N'
7.03 c                   eval      a2umfa = 'N'
7.03 c                   eval      a2umbu = 'N'
7.03 c                   eval      a2umla = 'N'
      *
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Visma / Global faktureringsposter
     c                   if        a2glfa = 'J'
     c                   call      'RV001C'
     c                   goto      a2tagb                                                    .
     c                   endif
      *
      *
      * Visma / Global butikkposter
     c                   if        a2glbu = 'J'
     c                   call      'RV002C'
     c                   goto      a2tagb                                                    .
     c                   endif
7.04  *
7.04  * Visma / Global lagerposter
7.04 c                   if        a2glla = 'J'
7.04 c                   call      'RV012C'
7.04 c                   goto      a2tagb                                                    .
7.04 c                   endif
      *
      * Visma / Global sum (DI-syst) fakturaposter
     c                   if        a2gsfa = 'J'
     c                   call      'RV009C'
     c                   goto      a2tagb                                                    .
     c                   endif
      *
      *
      * Visma / Global sum (DI-syst) butikkposter
     c                   if        a2gsbu = 'J'
     c                   call      'RV003C'
     c                   goto      a2tagb                                                    .
     c                   endif
      *
      * Visma / Business faktureringsposter
     c                   if        a2bufa = 'J'
     c                   call      'RB001C'
     c                   goto      a2tagb                                                    .
     c                   endif
      *
      *
      * Visma / Business butikkposter
     c                   if        a2bubu = 'J'
     c                   call      'RB002C'
     c                   goto      a2tagb                                                    .
     c                   endif
      *
      *
7.02  * Visma / Business lagerposter
7.02 c                   if        a2bula = 'J'
7.02 c                   call      'RB003C'
7.02 c                   goto      a2tagb                                                    .
7.02 c                   endif
      *
      *
      *
      *
      * Mamut / fakturaposter
     c                   if        a2mafa = 'J'
     c                   call      'RMA01C'
     c                   goto      a2tagb
     c                   endif
      *
7.01  * Mamut / butikkposter
7.01 c                   if        a2mabu = 'J'
7.01 c                   call      'RMA02C'
7.01 c                   goto      a2tagb                                                    .
7.01 c                   endif
      *
7.03  *
7.03  * Uni Micro        faktureringsposter
7.03 c                   if        a2umfa = 'J'
7.03 c                   call      'RB031C'
7.03 c                   goto      a2tagb                                                    .
7.03 c                   endif
7.03  *
7.03  * Uni Micro        butikkposter
7.03 c                   if        a2umbu = 'J'
7.03 c                   call      'RB041C'
7.03 c                   goto      a2tagb                                                    .
7.03 c                   endif
7.03  *
7.03  * Uni Micro        lagerposter
7.03 c                   if        a2umla = 'J'
7.03 c                   call      'RB051C'
7.03 c                   goto      a2tagb                                                    .
7.03 c                   endif
      *
      *
7.00  * Vedlikehold av bilagskoder Nexstep og Ny
7.02 c**                 if        a2vedl = 'J'
7.02 c**                 call      'RB100R'
7.02 c**                 goto      a2tagb                                                    .
7.02 c**                 endif
      *
     c                   goto      a2tagb
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c                   eval      p_in03 = ' '
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
      *
     c                   endsr
