     h datedit(*dmy.) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RM009R
      * Beskrivelse . . : Leser linjer fra FOVF til kommaseparert til
      *
9.01  *       100209 nho  Utlegg av poster til Mamut
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *
     ffovil1    if   e           k disk    rename(fovipfr:fovfil1)
     ffovupf    o    e             disk    rename(fovupfr:fovul1r)
      *
     d w_mvag          s                   like(ffbelp)
     d w_belØ          s                   like(ffbelp)
     d w_belp          s                   like(ffbelp)
     d w_tell          s              1  0
     d w_fØrs          s              1  0
610  d w_dkto          s                   like(ffdkto)
610  d w_ckto          s                   like(ffckto)
610  d w_tdkoh         s              4  0
610  d w_tckoh         s              4  0
610  d w_tdko          s              1  0
610  d w_tcko          s              1  0
6.21 d w_tdko2         s              2  0
6.21 d w_tcko2         s              2  0
6.22 d x               s              1  0
     d fovfl1_firm     s                   like(fffirm)
      *
6.11 d                uds
6.11 d l_user                911    920
6.11 d l_firm                944    946  0
      *
      *
      * Key for posisjonering på bilagskode
      *
      /eject
610  c                   eval      fovfl1_firm = l_firm
      *
610  c     fovfl1_firm   setll     fovil1
610   **********************************************************************
     c     nyles         tag
610   *
610  c                   read      fovil1                                 15
610   *
610   * Eof
610  c                   if        *in15  = '1'
610  c                   move      *on           *inlr
610  c                   goto      ut
610  c                   endif
      *
      * Test på inneværend firma
      *
     c                   if        fffirm <> l_firm
610  c                   move      *on           *inlr
610  c                   goto      ut
610  c                   endif
      *
6.22 c                   if        x = 1
6.22 c                   eval      x = 0
6.22 c                   z-add     0             w_fØrs
6.22 c                   endif
610   * Flytter konto til hjelpefelt første gang det er salgskonto
     c                   if        w_fØrs = 0
     c                   z-add     ffdkto        w_tdkoh
     c                   z-add     ffckto        w_tckoh
6.21 c                   movel     ffdkto        w_tdko2
6.21 c                   movel     ffckto        w_tcko2
     c                   movel     w_tdkoh       w_tdko
     c                   movel     w_tckoh       w_tcko
6.21 c                   if        w_tdko = 3 and
6.21 c                             w_tdko2 = *zeros
     c                   add       1             w_fØrs
     c                   endif
6.21 c                   if        w_tcko = 3 and
6.21 c                             w_tcko2 = *zeros
     c                   add       1             w_fØrs
     c                   endif
     c                   endif
610   *
      * Tester brudd / debet
6.22 c                   if        ffdkto > 9999 and
6.22 c                             w_tdko = 3
6.22 c***  6.23          eval      w_tdko = 0
6.22 c                   eval      x = 1
6.22 c                   endif
610  c                   if        w_fØrs = 1 and
     c                             w_tdko = 3
     c                   if        ffdkto <> w_tdkoh
610  c                   readp     fovil1                                 15
     c                   eval      ffbelp = w_belp
     c                   eval      ffmvag = w_mvag
     c                   write     fovul1r
     c                   eval      w_belp = 0
610  c                   z-add     0             w_fØrs
     c                   goto      nyles
     c                   else
     c                   add       ffbelp        w_belp
     c                   add       ffmvag        w_mvag
     c                   goto      nyles
610  c                   endif
610  c                   endif
6.10  *
      * Tester brudd / kredit
6.22 c                   if        ffckto > 9999 and
6.22 c                             w_tcko = 3
6.22 c*** 6.23           eval      w_tcko = 0
6.22 c                   eval      x = 1
6.22 c                   endif
610  c                   if        w_fØrs = 1 and
     c                             w_tcko = 3
     c                   if        ffckto <> w_tckoh
610  c                   readp     fovil1                                 15
     c                   eval      ffbelp = w_belp
     c                   eval      ffmvag = w_mvag
     c                   write     fovul1r
     c                   eval      w_belp = 0
610  c                   z-add     0             w_fØrs
     c                   goto      nyles
     c                   else
     c                   add       ffbelp        w_belp
     c                   add       ffmvag        w_mvag
     c                   goto      nyles
610  c                   endif
610  c                   endif
6.10  *
      *
      *
     c                   write     fovul1r
     c                   eval      w_belp = 0
     c                   eval      w_mvag = 0
      *
      ******************************************************
      *  AVSLUTT DENNE TRANS                               *
      ******************************************************
      *
     c     ut            tag
610  c                   if        *inlr = '0'
610  c                   goto      nyles
610  c                   endif
      *
     c                   if        *inlr  =  '1'   and
     c                             w_belp > 0
610  c                   readp     fovil1                                 15
     c                   eval      ffbelp =  w_belp
     c                   eval      ffmvag =  w_mvag
     c                   write     fovul1r
610  c                   endif
      *
     c/eject
      *
