     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RM720R                                              *
      * Beskrivelse . . : Kontroll av gyldig eiendom                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *           170303  Nytt program                                   KOB  *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                       *
      *  BRUK AV INDIKATORER                                                  *
      *                                                                       *
      *    60-61 = Fileindikatorer chain etc.                                 *
      *                                                                       *
      *  BRUK AV RETURKODE                                                    *
      *                                                                       *
      *  Kode i statusfelt(p_stat = N) : post finnes ikke                     *
      *                                                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     frmeil1    if   e           k disk    rename(rmeipfr:rmeil1r)
      *
     d w_firm          s                   like(rmefir)
      *
     d p_stat          s              1
     d p_ealm          s                   like(rmealm)
     d p_egnr          s                   like(rmegnr)
     d p_ebnr          s                   like(rmebnr)
     d p_enav          s                   like(rmenav)
      *
     d rmeil1_ealm     s                   like(rmealm)
     d rmeil1_egnr     s                   like(rmegnr)
     d rmeil1_ebnr     s                   like(rmebnr)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Sjekke kode
      *
     c                   eval      rmeil1_ealm = p_ealm                                      .
     c                   eval      rmeil1_egnr = p_egnr                                      .
     c                   eval      rmeil1_ebnr = p_ebnr                                      .
     c     rmeil1_key    chain     rmeil1r                            60
      *
     c                   if        *in60 = *on                                           .....
     c                   eval      p_stat = 'N'                                              .
     c                   eval      p_enav = 'Eiendommen er ikke gyldig'                      .
     c                   else                                                            .....
     c                   eval      p_stat = *blank                                           .
     c                   eval      p_enav = rmenav                                           .
     c                   endif                                                           .....
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     slutt         tag
     c                   eval      *inlr = *on
     c                   return
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     *inzsr        begsr
      *
     c                   eval      w_firm = l_firm
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_stat
     c                   parm                    p_ealm
     c                   parm                    p_egnr
     c                   parm                    p_ebnr
     c                   parm                    p_enav
      *
      * Key for eiendom
      *
     c     rmeil1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rmeil1_ealm
     c                   kfld                    rmeil1_egnr
     c                   kfld                    rmeil1_ebnr
      *
     c                   endsr
