     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASPGPLK
      * Program . . . . : RMP001R
      * Beskrivelse . . : Sette inn aut. start av MalProff under IPL
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       050922 sst  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fasbslu    uf a e           k disk    rename(asbspfr:asbslur)
      *
      * Definering av parametere
      *
      * Definering av variable
      *
     d asbslu_lin      s              3  0 inz(0)
      *
     d lin             s              3  0 inz(0)
     d sbs             s              3    inz('   ')
      *
     c     asbslu_key    setll     asbslu
     c                   read      asbslu
     c                   dow       not %eof(asbslu)
     c                   if        aysubs = 'MALPROFF'
     c                   eval      sbs    = 'OK '
     c                   leave
     c                   endif
     c                   eval      lin = aylinj
     c                   read      asbslu
     c                   enddo
     c                   if        sbs <> 'OK '
     c                   eval      aylinj = lin + 10
     c                   eval      aysubs = 'MALPROFF'
     c                   eval      aybibl = 'ASPDRIFT'
     c                   eval      aytext = 'Overføring fra MalProff'
     c                   time                    ayodat
     c                   time                    ayotim
     c                   eval      ayousr = 'RMP001R'
     c                   time                    ayedat
     c                   time                    ayetim
     c                   eval      ayeusr = 'RMP001R'
     c                   write     asbslur
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *  Parameterliste
      *
     c     asbslu_key    klist
     c                   kfld                    asbslu_lin
     c                   endsr
