     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : NXCLOUD
      * Program . . . . : ROM01R
      * Beskrivelse . . : Finn aktuelt økosystem
      *
      * Spesialversjon. : Midlertidig versjon som slår opp mot XTILPF
      * Tilpasset for . : XLBYGG
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       290125 ask  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fxtill1    if a e           k disk    rename(xtilpfr:xtill1r)
      *
      *
      * Definering av variabler i nøkler
      *
     d xtill1_regi     s                   like(xtregi)
     d xtill1_felt     s                   like(xtfelt)
     d xtill1_xkey     s                   like(xtxkey)
      *
      * Definering av variable
      *
     d w_firm          s                   like(l_firm)
     d w_okkod         s              2  0
      *
     d                uds
7.06 d l_firm                944    946  0
      *
      * Henter økonomisystem fra tilleggs register
      *
     c                   eval      xtill1_regi = 'FSTSPF'
     c                   eval      xtill1_felt = 'OKOSYS'
     c                   eval      xtill1_xkey = ' '
     c     xtill1_key    chain     xtill1
     c                   if        %found(xtill1)
     c                   eval      w_okkod = xtnumm
     c                   else
     c                   eval      w_okkod = 0
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  avslutt program                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
      *
     c                   seton                                        lr
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    w_okkod
      *
      *  Key for tilleggsregister
      *
     c     xtill1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    xtill1_regi
     c                   kfld                    xtill1_felt
     c                   kfld                    xtill1_xkey
      *
      *  Henter firmanummer fra LDA
      *
     c                   move      l_firm        w_firm
      *
     c                   endsr
