     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOKON
      * Program . . . . : RP100R
      * Beskrivelse . . : Prosjekt, vedlikehold 2013 -
      *
      * Spesialversjon. :             Prosj.leder
      * Tilpasset for . :             opprettet dato
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       150917 sst  Nytt program
6.30  *       301117 sst  Hent pr.leder fra pr.leder(P) eller Selger(S)
9.01  *       220819 sst  Prosjektregnskap Fase 2,  August 2019
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      *       LR = Avslutt program
      *       10 = Rollup
      *       11 = Rolldown
      *       12 = Sfldsp
      *       13 = Sfldspctl
      *       14 = Sflclr
      *       15 = Sflend
      *       21 = Home-key
      *       22 = Plassering av cursor
      *       30 = Protect av felter ved vise
      *    31-79 = Varsle m/feilmeldinger/skjermindikatorer
      *    80-99 = Arbeidsindikatorer
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     frp1pl1    if   e           k disk    rename(rp1ppfr:rp1pl1r)
     frp2ul1    if   e           k disk    rename(rp2upfr:rp2ul1r)
     frp3al1    if   e           k disk    rename(rp3apfr:rp3al1r)
     frp3al2    if   e           k disk    rename(rp3apfr:rp3al2r)
     frp3alr    if   e           k disk    rename(rp3apfr:rp3alrr)
     frp3alu    uf a e           k disk    rename(rp3apfr:rp3alur)
     f*rp4olu    uf a e           k disk    rename(rp4opfr:rp4olur)
     frkunl1    if   e           k disk    rename(rkunpfr:rkunl1r)
     filonl1    if   e           k disk    rename(ilonpfr:ilonl1r)
     fra07l1    if   e           k disk    rename(ra07pfr:ra07l1r)
6.30 fra09l1    if   e           k disk    rename(ra09pfr:ra09l1r)
     frprrl1    if   e           k disk    rename(rprrpfr:rprrl1r)
     frhtrlc    if   e           k disk    rename(rhtrpfr:rhtrlcr)
     fra21l1    if   e           k disk    rename(ra21pfr:ra21l1r)
      *
     frp120d    cf   e             workstn sfile(b1sfl:w_srrn)
     f                                     infds(dspfbk)
      *
     d lo              c                   'abcdefghijklmnopqrstuvwxyzæøå'
     d up              c                   'ABCDEFGHIJKLMNOPQRSTUVWXYZÆØÅ'
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av Information Data Structure - display feedback
      *
     d dspfbk          ds
     d  d_fcrn               378    379I 0
      *
      * Definering av variabler i nøkler
      *
     d rp1pl1_pros     s                   like(rp1pro)
     d r2upl1_upro     s                   like(rp2upr)
     d rp3al1_pros     s                   like(rp3pro)
     d rp3al1_upro     s                   like(rp3upr)
     d rp3al1_akti     s                   like(rp3akt)
     d rp3al2_besk     s                   like(rp3alf)
     d rp3al2_akti     s                   like(rp3akt)
     d rp3alr_pros     s                   like(rp3pro)
     d rp3alr_upro     s                   like(rp3upr)
     d rp3alr_akti     s                   like(rp3akt)
     d rp3alu_pros     s                   like(rp3akt)
     d rp3alu_upro     s                   like(rp3upr)
     d rp3alu_akti     s                   like(rp3akt)
     d rkunl1_kund     s                   like(rkkund)
     d ilonl1_kli      s                   like(ilrkli)
     d ilonl1_lnr      s                   like(ilrlnr)
     d ra07l1_frm      s                   like(ragfir)
     d ra07l1_kod      s                   like(ragkod)
6.30 d ra09l1_fir      s                   like(raifir)
6.30 d ra09l1_kod      s                   like(raikod)
     d rprrl1_fir      s                   like(rphfir)
     d rprrl1_rap      s                   like(rphrap)
     d rprrl1_lin      s                   like(rphlin)
     d rprrl1_uli      s                   like(rphuli)
     d rhtrlc_fir      s                   like(rbfirm)
     d rhtrlc_pro      s                   like(rbhpro)
     d ra21l1_kod      s                   like(raukod)
      *
      * Definering av variable
      *
     d w_fcrn          s              4  0
     d w_stel          s              4  0
     d w_spge          s              4  0
     d w_srrn          s              4  0
     d w_sfrn          s                   like(w_srrn)
     d w_ssrn          s                   like(w_srrn)
      *
     d w_seqe          s              1
     d b_forn          s              1    inz(*off)
     d b_oppr          s              1    inz(*off)
     d b_anul          s              1    inz(*off)
     d b_feil          s              1    inz(*off)
     d b_subf          s              1    inz(*off)
      *
     d w_firm          s              3  0
     d s_pros          s                   like(rp3pro)
     d s_upro          s                   like(rp3upr)
     d s_akti          s                   like(rp3akt)
     d s_aktiv         s                   like(rp2sts)
      *
     d w_pknr          s                   like(rkkund)
     d w_pkna          s                   like(rknavn)
     d w_dato          s             10
     d w_datd          s                   like(rp1fsd)
     d w_1alf          s                   like(rp1alf)
     d w_datx          s             10
     d w_datn          s              6  0
     d w_lnr           s                   like(ilrlnr)
6.30 d w_lnr4          s              4  0
     d w_lnav          s                   like(ilrnav)
     d p_avd           s                   like(ilravd)
     d p_valg          s              1
     d p_pros          s                   like(rp1pro)
     d p_upro          s                   like(rp2upr)
     d p_tx30          s             30
     d p_rapx          s              4
     d w_fper          s              6  0
     d p_rapt          s             30
     d p_firm          s              3
9.01 d p_fdat          s              6  0
9.01 d p_tdat          s              6  0
9.01 d p_knav          s             30
9.01 d p_selg          s              4  0
9.01 d p_kunf          s              6  0
     d w3avde          s              4
     d w3prol          s              5
     d w_sumi          s              8  0
     d w_sumix         s             11  0
     d w_sumk          s              8  0
     d w_sumkx         s             11  0
     d w_buo           s              8  0
     d w_but           s              8  0
     d w_rest          s              8  0
     d w_pros          s              8  0
     d w_mld1          s             50
     d w_stat          s              1
     d w_spor          s              1    inz('5')
     d w_endr          s              1    inz('2')
     d w_a51           s              1  0 inz(0)
     d p_kod           s                   like(raukod)
     d p_txt           s                   like(rautxt)
     d i               s              3  0
     d w_blank         s                   like(rp1pro)
     d                                     inz(' ')
6.30  * w_prlslg styr om Pr.leder hentes fra prosj.leder(P) eller selger(S)
6.30 d w_prlslg        s              1    inz('S')
      *
      * Definering av konstanter
      *
     d c_sfil          s              2  0 inz(12)
      *
      * Forklaring på spesielle felter
      * som benyttes ved sub-files.
      * - - - - - - - - - - - - - - - - -
      * w_fcrn - Første recordnummer på siden
      * w_stel - Subfile-teller
      * w_spge - Sidestørrelse i subfile (page)
      * w_srrn - Relativt recordnummer i subfile
      * w_sfrn - Første recordnummer på siste side
      * w_ssrn - Siste recordnummer på siste side
      * w_curn - Current recordnummer på siden
      * w_virn - Side og cursorplassering som skal vises
      * w_afld - Aktivt feltnavn
      * w_arow - Aktiv rad for cursor
      * w_acol - Aktiv kolonne for cursor
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      * B1SFL  - B1 Subfile - record
      * B2CTL  - B2 Subfile - control record
      * B2CMD  - B2 Eget skjermbilde for CMD-taster
      * C1BLD  - C1 Skjermbilde for innlegging av nøkkel ved oppretting
      * C1MSG  - C1 Meldingsbilde for C1BLD
      * C2BLD  - C2 Skjermbilde for opprette/endre/vise
      * D1WIN  - D1 Vindu for slette (Delete)
      * K1WIN  - K1 Vindu for kopiere
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B2CTL Behandle åpningsbildet med subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Send Alt
      *
     c     b2taga        tag
      *
     c                   write     b2cmd
      *
      * Bare data
      *
     c     b2tagb        tag
      *
     c                   exsr      dsp_subfile
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkb
     c                   exsr      HentAkt
     c                   exsr      forny
     c                   goto      b2taga
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   when      *inke
     c                   exsr      forny
     c                   goto      b2tagb
     c                   when      *inkf
     c                   exsr      xc1bld
     c                   goto      b2taga
     c                   when      *inkg
     c                   eval      c3frap = *blank
     c                   eval      c3tilp = *blank
     c                   eval      c3hit  = *blank
     c                   exsr      xc3bld
     c                   goto      b2taga
     c                   when      *inkj
     c                   eval      c3frap = *blank
     c                   exsr      xc3bld
     c                   goto      b2taga
     c                   when      *inkk
     c                   select
     c                   when      w_a51 = 0
     c*                  eval      b2head = 'Budsj.Innt. Budsj.Kost.   Inntekt -
     c*                              Kostnad  '
7.xx c                   eval      b2hea1 = 'Budsj.Innt.'
7.xx c                   eval      b2hea2 = 'Budsj.Kost.'
7.xx c                   eval      b2hea3 = 'Inntekt'
7.xx c                   eval      b2hea4 = 'Kostnad'
     c                   eval      w_a51 = 1
     c                   when      w_a51 = 1
     c*                  eval      b2head = 'Budsj.Innt.  Virk.Innt.  -
     c*                            Gjennstår    Utført %'
7.xx c                   eval      b2hea1 = 'Budsj.Innt.'
7.xx c                   eval      b2hea2 = 'Virk.Innt.'
7.xx c                   eval      b2hea3 = 'Gjennstår'
7.xx c                   eval      b2hea4 = 'Utført %'
     c                   eval      w_a51 = 2
     c                   when      w_a51 = 2
     c*                  eval      b2head = 'Budsj.Kost.  Virk.Kost.  -
     c*                            Gjennstår    Utført %'
7.xx c                   eval      b2hea1 = 'Budsj.Kost.'
7.xx c                   eval      b2hea2 = 'Virk.Kost.'
7.xx c                   eval      b2hea3 = 'Gjennstår'
7.xx c                   eval      b2hea4 = 'Utført %'
     c                   eval      w_a51 = 3
     c                   when      w_a51 = 3
     c*                  eval      b2head = 'Fra dato    Til dato     -
     c*                            Avd.     Pr.leder'
7.xx c                   eval      b2hea1 = 'Fra dato'
7.xx c                   eval      b2hea2 = 'Til dato'
7.xx c                   eval      b2hea3 = 'Avd.'
7.xx c                   eval      b2hea4 = 'Pr.leder'
     c                   eval      w_a51 = 0
     c                   endsl
     c                   exsr      forny
     c                   goto      b2taga
     c                   when      *in10
     c                   exsr      crt_subfile
     c                   goto      b2tagb
     c                   when      *in21
     c                   eval      *in22 = *on
     c                   goto      b2taga
     c                   endsl
      *
      * Utvalg   Aktiv/alle
      *
     c                   if        b2aktiv <> s_aktiv
     c                   eval      s_aktiv  = b2aktiv
     c                   exsr      forny
     c                   goto      b2tagb
     c                   endif
      *
      * Utvalg   Prosjekt/Under Prosjekt
      *
     c                   if        b2pros  <> s_pros
     c                             or b2upro  <> s_upro
     c                   eval      s_pros   = b2pros
     c                   eval      s_upro   = b2upro
     c                   exsr      forny
     c                   goto      b2tagb
     c                   endif
      *
      * Posisjonering
      *
     c                   if        b2akti <> *blank or
     c                             b2besk <> *blank
     c                   exsr      posisjoner
     c                   goto      b2tagb
     c                   endif
      *
      * Behandling av subfile
      *
     c                   exsr      subfile
      *
     c                   if        b_subf = *on
     c                   goto      b2taga
     c                   endif
      *
      * Retur til første bilde
      *
     c                   goto      b2tagb
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for fornying av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     forny         begsr
      *
     c                   select
     c                   when      w_seqe = 'B'
     c     rp3al2_key    setll     rp3al2
     c                   other
     c     rp3al1_key    setll     rp3al1
     c                   endsl
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c     end_forny     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for posisjonering i subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     posisjoner    begsr
      *
      * Posisjoner startverdi på underprosjekt
      *
     c                   if        b2akti <> *blank
     c                   eval      w_seqe = ' '
     c                   eval      rp3al1_akti = b2akti
     c     rp3al1_key    setll     rp3al1
     c                   endif
      *
      * Posisjoner startverdi på teskt
      *
     c                   if        b2besk <> *blank
     c                   eval      w_seqe = 'B'
     c                   eval      rp3al2_besk = b2besk
     c                   eval      rp3al2_akti = *blank
     c     rp3al2_key    setll     rp3al2
     c                   endif
      *
      * Blanker subfile, og fyller opp i.h.t. posisjonering
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
      * Blanker posisjoneringsfelter
      *
     c                   eval      b2akti = *blank
     c                   eval      b2besk = *blank
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     subfile       begsr
      *
     c                   eval      b_forn = *off
     c                   eval      b_subf = *off
      *
     c                   eval      w_virn = w_fcrn
      *
      * Leser og behandler subfile
      *
     c                   do        w_ssrn
     c                   readc     b1sfl                                  16
      *
     c                   if        *in16
     c                   leave
     c                   endif
      *
     c                   eval      b_subf = *on
     c                   eval      w_virn = w_srrn
      *
      * Endre post
      *
     c                   if        b1valg = 2
     c                   eval      c1akti = b1akti
     c                   exsr      xc2bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
      *  Gå ev videre til aktivitet
     c*                  if        c2rak = 'J'
     c*                  call      'RP120R'
     c*                  parm                    p_pros
     c*                  parm                    c1upro
     c*                  parm                    w_endr
     c*                  endif
     c                   iter
     c                   endif
      *
      * Kopiere post
      *
     c                   if        b1valg = 3
     c                   eval      k1akti = b1akti
     c                   exsr      xk1win
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Slette post
      *
     c                   if        b1valg = 4
     c                   eval      d1akti = b1akti
     c                   exsr      xd1win
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Vise post
      *
     c                   if        b1valg = 5
     c                   eval      c1akti = b1akti
     c                   exsr      xc2bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Skrive rapport
      *
     c                   if        b1valg = 6
     c                   eval      c3frap = p_pros
     c                   eval      c3tilp = p_pros
     c                   exsr      xc3bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Se på varelinjer ordre
      *
     c                   if        b1valg = 7
     c                   call      'RP555R  '
     c                   parm                    w_firm
     c                   parm                    p_pros
     c                   parm                    p_upro
     c                   parm                    b1akti
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Vise poster
      *
     c                   if        b1valg = 8
     c                   call      'RP510R  '
     c                   parm                    w_firm
     c                   parm                    p_pros
     c** Bør med?        parm                    p_upro
     c** Bør med?        parm                    b1akti
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Se på bestillinger
      *
     c                   if        b1valg = 9
     c                   call      'RP550R  '
     c                   parm                    w_firm
     c                   parm                    p_pros
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
     c                   enddo
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c     end_subfile   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av skjermbilde for ny rad (C1BLD)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc1bld        begsr
      *
     c                   eval      b_oppr = *on
     c                   eval      b_forn = *off
      *
     c                   eval      c1akti = *blank
      *
     c     c1taga        tag
      *
     c                   exfmt     c1bld
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      end_c1bld
     c                   endsl
      *
     c                   if        c1akti = *blank
     c                   goto      end_c1bld
     c                   endif
      *
      * Validering
      *
      *
      * Sender opp informasjonsbilde dersom rad finnes fra før
      *
     c                   eval      rp3alr_akti = c1akti
     c     rp3alr_key    chain     rp3alr
     c                   if        %found
     c                   exsr      xc1msg
     c                   if        b_anul = *on
     c                   goto      c1taga
     c                   endif
     c                   endif
      *
      * Kaller vedlikeholdsprogram
      *
     c                   eval      *in23 = *on
     c                   exsr      xc2bld
      *
     c     end_c1bld     tag
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c                   eval      b_oppr = *off
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for utlegging av opprettelsesmelding
      * Meldingsbildet legges ut dersom det forsøkes å opprette en rad som
      * finnes fra før.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc1msg        begsr
      *
     c                   eval      b_anul = *off
      *
     c                   exfmt     c1msg
      *
      * Behandling av funksjonstaster
      *
     c                   if        *inkc or *inkl
     c                   eval      b_anul = *on
     c                   goto      end_c1msg
     c                   endif
      *
     c     end_c1msg     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å behandle bilde for ny/endring/vise (C2BLD)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc2bld        begsr
      *
     c                   eval      w_arow = 0
     c                   eval      w_acol = 0
      *
     c                   eval      rp3alr_akti = c1akti
     c     rp3alr_key    chain     rp3alr
      * sven
     c                   if        %found
     c                   eval      c2besk = rp3txt
     c                   move      rp3fsd        c2fsd
     c                   move      rp3fed        c2fed
     c                   eval      c2prl  = rp3prl
6.30 c                   if        w_PrlSlg = 'P'
     c                   eval      ilonl1_kli  = l_firm
     c                   eval      ilonl1_lnr  = rp3prl
     c     ilonl1_key    chain     ilonl1
     c                   if        %found(ilonl1)
     c                   eval      c2prx  = ilrnav
     c                   else
     c                   eval      c2prx  = *blank
     c                   endif
6.30 c                   else
6.30 c                   eval      ra09l1_fir  = l_firm
6.30 c                   eval      ra09l1_kod  = rp3prl
6.30 c     ra09l1_key    chain     ra09l1
6.30 c                   if        %found(ra09l1)
6.30 c                   eval      c2prx  = raitxt
6.30 c                   else
6.30 c                   eval      c2prx  = *blank
6.30 c                   endif
6.30 c                   endif
      *
     c                   eval      c2avd  = rp3avd
     c                   eval      ra07l1_kod  = rp3avd
     c     ra07l1_key    chain     ra07l1
     c                   if        %found(ra07l1)
     c                   eval      c2avx  = ragtxt
     c                   else
     c                   eval      c2avx  = *blank
     c                   endif
     c                   eval      c2knr  = rp3knr
     c                   eval      rkunl1_kund = rp3knr
     c     rkunl1_key    chain     rkunl1
     c                   if        %found(rkunl1)
     c                   eval      c2kna  = rknavn
     c                   else
     c                   eval      c2kna  = *blank
     c                   endif
     c                   eval      c2buo  = rp3buo
     c                   eval      c2but  = rp3but
     c*                  eval      c2pty  = rp3pty
     c                   eval      c2sts  = rp3sts
     c*                  eval      c2rak  = rp3rak
     c*                  eval      c2alf  = rp3alf
     c                   eval      c2eusr = rp3eav
     c                   eval      c2prl  = rp3prl
     c                   if        c2prl  = *zero
     c                   eval      c2prl  = rp2prl
     c                   endif
     c                   if        c2prl  = *zero
     c                   eval      c2prl  = rp1prl
     c                   endif
     c     *dmy          move      rp3eda        c2edat
     c                   else
9.01 c                   eval      c2besk = *blank
9.01 c                   move      p_fdat        c2fsd
9.01 c                   move      p_tdat        c2fed
9.01 c                   eval      c2prl  = p_selg
     c                   eval      c2avd  = rp1avd
     c                   eval      c2knr  = p_kunf
     c*                  eval      c2pty  = *blank
     c                   eval      c2sts  = *blank
     c*                  eval      c2rak  = *blank
     c                   eval      c2buo  = *zero
     c                   eval      c2but  = *zero
     c                   eval      c2kna  = *blank
     c                   eval      c2eusr = *blank
     c                   eval      c2edat = 0
     c                   eval      c2eusr = *blank
     c                   endif
      *
     c                   if        b1valg = 3
     c                   eval      c1akti = k1akti
     c                   endif
      *
     c                   if        b1valg = 5
     c                   eval      *in30 = *on
     c                   endif
      *
     c     c2tagb        tag
      *
     c                   exfmt     c2bld
      *
     c                   setoff                                       232425
     c                   setoff                                       262728
      *
     c                   if        *inkc or *inkl or *in30
     c                   goto      end_c2bld
     c                   endif
      *
      * Spørring
      *
      *  Prosjekt
     c                   if        *inkd = *on and
     c                             w_afld = 'C2PRL'
     c                   eval      w_lnr       = *zero
     c                   eval      w_lnav      = *blank
6.30 c                   if        w_PrlSlg = 'P'
     c                   call      'RP603R  '
     c                   PARM                    w_firm
     c                   PARM                    w_lnr
     c                   PARM                    w_lnav
6.30 c                   else
6.30 c                   eval      w_lnr4 = *zero
6.30 c                   call      'RA509R  '
6.30 c                   PARM                    w_firm
6.30 c                   PARM                    w_lnr4
6.30 c                   PARM                    w_lnav
6.30 c                   eval      w_lnr = w_lnr4
6.30 c                   endif
     c                   if        w_lnr <> *zero
     c                   eval      c2prl  = w_lnr
     c                   eval      c2prx  = w_lnav
     c                   endif
     c                   goto      c2tagb
     c                   endif
      *  Avdeling
     c*                  if        *inkd = *on and
     c*                            w_afld = 'C2AVD '
     c*                  eval      p_avd       = *zero
     c*                  eval      p_tx30      = *blank
     c*                  call      'RA507R  '
     c*                  PARM                    w_firm
     c*                  PARM                    p_avd
     c*                  PARM                    p_tx30
     c*                  if        p_avd <> *zero
     c*                  eval      c2avd  = p_avd
     c*                  eval      c2avx  = p_tx30
     c*                  endif
     c*                  goto      c2tagb
     c*                  endif
      *  Kunde
     c*                  if        *inkd = *on and
     c*                            w_afld = 'C2KNR '
     c*                  eval      w_pknr      = *zero
     c*                  eval      w_pkna      = *blank
     c*                  call      'RK500R  '
     c*                  PARM                    w_firm
     c*                  PARM                    w_pknr
     c*                  PARM                    w_pkna
     c*                  eval      c2knr  = w_pknr
     c*                  eval      c2kna  = w_pkna
     c*                  goto      c2tagb
     c*                  endif
      *  prosjekt raport.
     c                   if        *inkf = *on
     c                   eval      c3frap = p_pros
     c                   eval      c3tilp = p_pros
     c*                  eval      c3frau = c1upro
     c*                  eval      c3tilu = c1upro
     c                   exsr      xc3bld
     c                   goto      c2tagb
     c                   endif
      *  Spørring prosjektposter
     c                   if        *inkg = *on
     c                   call      'RP510R  '
     c                   parm                    w_firm
     c                   parm                    p_pros
     c* Bør med          parm                    p_upro
     c* Bør med          parm                    c1akti
     c                   goto      c2tagb
     c                   endif
      *  Spørring ordre /Bestilling
     c                   if        *inkh = *on
     c                   call      'RP550R  '
     c                   parm                    w_firm
     c                   parm                    p_pros
     c*  Bør med         parm                    p_upro
     c*  Bør med         parm                    c1akti
     c                   goto      c2tagb
     c                   endif
      *
      * Validering av input
      *
     c                   if        c2besk = *blank
     c                   eval      *in23 = *on
     c                   goto      c2tagb
     c                   endif
      *  Start Dato
     c                   if        c2fsd = *blank
     c                   eval      *in24 = *on
     c                   goto      c2tagb
     c                   endif
     c                   eval      w_dato = c2fsd
     c                   eval      w_datn = *zero
     c                   exsr      reddato
      *
     c                   if        w_datn > *zero
     c     *dmy          test (d)                w_datn                 25
     c                   if        *in25 = *on
     c                   goto      c2tagb
     c                   else
     c     *dmy          move      w_datn        w_datd
     c                   move      w_datd        c2fsd
     c                   endif
     c                   endif
      *  Slutt Dato
     c                   if        c2fed = *blank
     c                   eval      *in26 = *on
     c                   goto      c2tagb
     c                   endif
     c                   eval      w_dato = c2fed
     c                   eval      w_datn = *zero
     c                   exsr      reddato
      *
     c                   if        w_datn > *zero
     c     *dmy          test (d)                w_datn                 27
     c                   if        *in27 = *on
     c                   goto      c2tagb
     c                   else
     c     *dmy          move      w_datn        w_datd
     c                   move      w_datd        c2fed
     c                   endif
     c                   endif
      *  Prosjektleder
     c                   if        c2prl  <> 0
6.30 c                   if        w_PrlSlg = 'P'
     c                   eval      ilonl1_kli  = l_firm
     c                   eval      ilonl1_lnr  = c2prl
     c     ilonl1_key    chain     ilonl1
     c                   if        not %found(ilonl1)
     c                   eval      c2prx  = ilrnav
     c                   eval      *in37 = *on
     c                   goto      c2tagb
     c                   endif
6.30 c                   else
6.30 c                   eval      ra09l1_fir  = l_firm
6.30 c                   eval      ra09l1_kod  = c2prl
6.30 c     ra09l1_key    chain     ra09l1
6.30 c                   if        %found(ra09l1)
6.30 c                   eval      c2prx  = raitxt
6.30 c                   else
6.30 c                   eval      *in37 = *on
6.30 c                   goto      c2tagb
6.30 c                   endif
6.30 c                   endif
     c                   endif
      *  Kunde
     c                   if        c2knr  = *zero and
     c                             rp1pty  = 'K'
     c                   eval      *in28 = *on
     c                   goto      c2tagb
     c                   endif
      *
     c                   if        c2knr  > *zero
     c                   eval      rkunl1_kund = c2knr
     c     rkunl1_key    chain     rkunl1
     c                   if        not %found(rkunl1)
     c                   eval      *in29 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *  Prosjkettype
     c*                  if        c2pty <> 'I ' and
     c*                            c2pty <> 'K '
     c*                  eval      *in35 = *on
     c*                  goto      c2tagb
     c*                  endif
      *  Prosjketstatus
     c                   if        c2sts <> 'A' and
     c                             c2sts <> 'O' and
     c                             c2sts <> ' '
     c                   eval      *in36 = *on
     c                   goto      c2tagb
     c                   endif
      *
      * Oppdatering
      *
     c                   clear                   rp3alur
     c*                  clear                   rp4olur
      *
     c                   eval      rp3alu_akti = c1akti
     c     rp3alu_key    chain     rp3alur
      *
     c                   eval      rp3txt = c2besk
     c     lo:up         xlate     c2besk        rp3alf
     c*                  eval      rp1fsd = c2fsd
     c                   move      c2fsd         rp3fsd
     c*                  eval      rp1fed = c2fed
     c                   move      c2fed         rp3fed
     c                   eval      rp3prl = c2prl
     c                   eval      rp3avd = c2avd
     c                   eval      rp3knr = c2knr
     c                   eval      rp3krf = c2kref
     c                   eval      rp3krt = c2ktlf
     c                   movel     c2kmal        rp3krm
     c                   eval      rp3buo = c2buo
     c                   eval      rp3but = c2but
     c*                  eval      rp3pty = c2pty
     c                   eval      rp3sts = c2sts
      *
     c                   time                    rp3eda
     c                   time                    rp3eti
     c                   eval      rp3eav = l_user
      *
     c                   if        %found
     c                   update    rp3alur
     c                   else
     c                   eval      rp3pro = p_pros
     c                   eval      rp3upr = p_upro
     c                   eval      rp3akt = c1akti
     c                   time                    rp3oda
     c                   time                    rp3oti
     c                   eval      rp3oav = l_user
     c                   write     rp3alur
     c                   endif
      *
      * Oppdater subfile
      *
     c                   if        b1valg = 2
     c                   eval      b1besk = rp3txt
     c                   eval      b1fsd = rp3fsd
     c                   eval      b1fed = rp3fed
     c                   eval      b1avd  = rp3avd
     c                   eval      b1prl  = rp3prl
     c                   endif
      *
     c                   if        b_oppr = *on or
     c                             b1valg = 3
     c                   eval      b_forn = *on
     c                   endif
      *
     c     end_c2bld     tag
      *
     c                   eval      *in30  = *off
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å behandle utskrift av prosjekt  (C3BLD)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc3bld        begsr
      *
     c                   eval      w_arow = 3
     c                   eval      w_acol = 5
     c                   eval      c3fper = *blank
     c                   eval      w_fper = 200000 + uyear*100 + umonth
     c                   move      w_fper        c3tper
     c                   eval      c3avde = *zero
     c                   eval      c3prol = *zero
     c                   eval      c3rapp = *zero
     c                   eval      c3aktiv = '1'
      *
     c     c3tagb        tag
      *
     c                   exfmt     c3bld
      *
     c                   if        *inkc or *inkl
     c                   goto      end_c3bld
     c                   endif
      *
      * Spørring
      *
      *  Prosjekt fra
     c                   if        *inkd = *on and
     c                             w_afld = 'C3FRAP'
     c                   call      'RP500R  '
     c                   PARM                    w_firm
     c                   PARM                    c3frap
     c                   PARM                    w_1alf
     c                   goto      c3tagb
     c                   endif
      *  Prosjekt til
     c                   if        *inkd = *on and
     c                             w_afld = 'C3TILP'
     c                   call      'RP500R  '
     c                   PARM                    w_firm
     c                   PARM                    c3tilp
     c                   PARM                    w_1alf
     c                   goto      c3tagb
     c                   endif
      *  Prosjektleder
     c                   if        *inkd = *on and
     c                             w_afld = 'C3PRL'
     c                   eval      w_lnr       = *zero
     c                   eval      w_lnav      = *blank
6.30 c                   if        w_PrlSlg = 'P'
     c                   call      'RP603R  '
     c                   PARM                    w_firm
     c                   PARM                    w_lnr
     c                   PARM                    w_lnav
6.30 c                   else
6.30 c                   eval      w_lnr4 = *zero
6.30 c                   call      'RA509R  '
6.30 c                   PARM                    w_firm
6.30 c                   PARM                    w_lnr4
6.30 c                   PARM                    w_lnav
6.30 c                   eval      w_lnr = w_lnr4
6.30 c                   endif
     c                   if        w_lnr <> *zero
     c                   move      w_lnr         c3prol
     c                   eval      c3prox = w_lnav
     c                   endif
     c                   goto      c3tagb
     c                   endif
      *  Avdeling
     c                   if        *inkd = *on and
     c                             w_afld = 'C3AVDE'
     c                   eval      p_avd       = *zero
     c                   eval      p_tx30      = *blank
     c                   call      'RA507R  '
     c                   PARM                    w_firm
     c                   PARM                    p_avd
     c                   PARM                    p_tx30
     c                   if        p_avd <> *zero
     c                   move      p_avd         c3avde
     c                   eval      c3avdx = p_tx30
     c                   endif
     c                   goto      c3tagb
     c                   endif
      *  Rapport
     c                   if        *inkd = *on and
     c                             w_afld = 'C3RAPP'
     c                   move      w_firm        p_firm
     c                   eval      p_rapx      = *zero
     c                   eval      p_rapt      = *blank
     c                   call      'RP604R  '
     c                   PARM                    p_firm
     c                   PARM                    p_rapx
     c                   PARM                    p_rapt
     c                   if        p_rapx <> *zero
     c                   move      p_rapx        c3rapp
     c                   movel     p_rapt        c3rapt
     c                   endif
     c                   goto      c3tagb
     c                   endif
      *
     c                   move      c3avde        w3avde
     c                   move      c3prol        w3prol
      *   blank = alle, '1' = aktive '2' = sluttmeldte '3'=Aktive m/poster
     c                   eval      w_stat = c3aktiv
      *
      *   Rapport
     c                   move      *zero         p_rapx
     c                   move      c3rapp        p_rapx
     c                   eval      rprrl1_fir = w_firm
     c                   eval      rprrl1_rap = c3rapp
     c                   eval      rprrl1_lin = *zero
     c                   eval      rprrl1_uli = *zero
     c     rprrl1_key    chain     rprrl1
     c                   if        %found(rprrl1) and
     c                             rphfun = 'K'
     c                   call      'RP802C '
     c                   parm                    c3fper
     c                   parm                    c3tper
     c                   parm                    c3frap
     c                   parm                    c3tilp
     c                   parm                    p_rapx
     c                   parm                    w3avde
     c                   parm                    w3prol
     c                   parm                    w_stat
     c                   parm                    c3hit
     c                   else
     c                   call      'RP801C '
     c                   parm                    c3fper
     c                   parm                    c3tper
     c                   parm                    c3frap
     c                   parm                    c3tilp
     c                   parm                    p_rapx
     c                   parm                    w3avde
     c                   parm                    w3prol
     c                   parm                    w_stat
     c                   parm                    c3hit
     c                   endif
      *
      *
     c     end_c3bld     tag
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å redigere inntastet dato
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     reddato       begsr
      *
     c                   if        %subst(w_dato:5:1) = '-' and
     c                             %subst(w_dato:8:1) = '-'
     c                   goto      redend
     c                   endif
      *
     c                   movel     udate         w_datx
     c                   if        %subst(w_dato:2:9) = *blank
     c                   eval      %subst(w_datx:01:1) = '0'
     c                   eval      %subst(w_datx:02:1) = %subst(w_dato:1:1)
     c                   elseif    %subst(w_dato:3:8) = *blank
     c                   eval      %subst(w_datx:01:2) = %subst(w_dato:1:2)
     c                   elseif    %subst(w_dato:5:6) = *blank
     c                   eval      %subst(w_datx:01:2) = %subst(w_dato:1:2)
     c                   eval      %subst(w_datx:03:2) = %subst(w_dato:3:2)
     c                   elseif    %subst(w_dato:7:4) = *blank
     c                   eval      %subst(w_datx:01:2) = %subst(w_dato:1:2)
     c                   eval      %subst(w_datx:03:2) = %subst(w_dato:3:2)
     c                   eval      %subst(w_datx:05:2) = %subst(w_dato:5:2)
     c                   endif
     c                   movel     w_datx        w_datn
     c     redend        endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av slette-bildet (D1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xd1win        begsr
      *
     c                   eval      rp3alr_pros = p_pros
     c                   eval      rp3alr_upro = p_upro
     c                   eval      rp3alr_akti = d1akti
     c     rp3alr_key    chain     rp3alr
      *
      * sjekker om det finnes poster, da kan man ikke slette
      *
     c                   eval      rhtrlc_fir = w_firm
     c                   eval      rhtrlc_pro = p_pros
     c     rhtrlc_key    setll     rhtrlc
     c     rhtrlc_key    reade     rhtrlc
     c                   dow       not %eof(rhtrlc)
     c                   if            rbhpro = p_pros
     c                             and rbupro = p_upro
     c                             and rbakti = d1akti
     c                   eval      w_mld1 = 'Kan ikke slettes, de+
     c                                       t finnes transaksjone+
     c                                       r '
     c                   call      'AA005R'
     c                   parm                    w_mld1
     c                   leavesr
     c                   endif
     c                   enddo
      *
     c                   exfmt     d1win
      *
     c                   if        *inkc or *inkl
     c                   goto      end_d1win
     c                   endif
      *
     c                   eval      b_forn = *on
      *
      * Sletter rad
      *
     c                   eval      rp3alu_pros = p_pros
     c                   eval      rp3alu_upro = p_upro
     c                   eval      rp3alu_akti = d1akti
     c     rp3alu_key    chain     rp3alur
     c                   if        %found(rp3alu)
     c                   delete    rp3alur
     c                   endif
     c*                  eval      rp4olu_arbo = p_pros
     c*    rp4olu_key    chain     rp4olur
     c*                  if        %found(rp4olu)
     c*                  delete    rp4olur
     c*                  endif
      *
     c     end_d1win     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å behandle kopierings-bildet (K1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xk1win        begsr
      *
      * Tar vare på nøkkel til rad det skal kopieres fra
      *
     c                   eval      s_akti = k1akti
      *
      * Fyller kopierings-bildet
      *
     c                   eval      rp3alr_akti = k1akti
     c     rp3alr_key    chain     rp3alr
      *
     c     k1tagb        tag
      *
     c                   exfmt     k1win
      *
     c                   if        *inkc or *inkl
     c                   goto      end_k1win
     c                   endif
      *
      * Sjekk om utfylt
      *
     c                   if        k1akti = *blank
     c                   eval      *in31 = *on
     c                   goto      k1tagb
     c                   endif
      *
      * Sjekker om rad finnes fra før
      *
     c                   eval      rp3alr_akti = k1akti
     c     rp3alr_key    chain     rp3alr
     c                   if        %found
     c                   eval      *in33 = *on
     c                   goto      k1tagb
     c                   endif
      *
      * Kaller vedlikeholdsprogram
      *
     c                   eval      c1akti = s_akti
     c                   exsr      xc2bld
      *
     c     end_k1win     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for tømming av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     clr_subfile   begsr
      *
     c                   eval      *in14 = *on
     c                   write     b2ctl
     c                   eval      *in14 = *off
      *
     c                   eval      *in15 = *off
     c                   eval      w_srrn = 0
     c                   eval      w_sfrn = 0
     c                   eval      w_ssrn = 0
     c                   eval      w_spge = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å fylle opp subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     crt_subfile   begsr
      *
     c                   eval      w_spge = w_spge + c_sfil
     c                   eval      w_srrn = w_ssrn
      *
     c                   dou       w_srrn = w_spge
      *
     c                   select
     c                   when      w_seqe = 'B'
     c                   read      rp3al2                                 15
     c                   other
     c                   read      rp3al1                                 15
     c                   endsl
      *
     c                   if        *in15  or
     c                             rp3frm <> w_firm
     c                   leave
     c                   endif
      *
     c                   if        b2aktiv = 'J' and
     c                             rp3sts  = 'A'
     c                   iter
     c                   endif
      *        Valgt prosjekt
     c                   if        p_pros <> *blank and
     c                             rp3pro <> p_pros
     c                   leave
     c                   endif
      *        Valgt under prosjekt
     c                   if        p_upro <> *blank and
     c                             rp3upr <> p_upro
     c                   leave
     c                   endif
      *        Valgt aktivitet
     c*                  if        b2akti <> *blank and
     c*                            rp3akt <> b2akti
     c*                  leave
     c*                  endif
      *        Valgt prosjektleder
     c*                  if        b2vprl <> *zero and
     c*                            rp3arl <> b2vprl
     c*                  iter
     c*                  endif
      *
     c                   eval      w_srrn = w_srrn + 1
      *
     c                   eval      b1valg = 0
     c                   eval      b1akti = rp3akt
     c                   eval      b1besk = rp3txt
     c                   eval      b1fsd  = rp3fsd
     c                   eval      b1fed  = rp3fed
     c                   eval      b1avd  = rp3avd
     c                   eval      b1prl  = rp3prl
     c                   eval      b1buo  = rp3buo
     c                   eval      b1but  = rp3but
      *
     c                   select
     c                   when      w_a51  = 0
      * dato informasjon
     c                   eval      b1flt1 = *blank
     c                   eval      b1flt2 = *blank
     c                   eval      b1flt3 = *blank
     c                   eval      b1flt4 = *blank
     c                   if        b1fsd <> *loval
     c     *dmy          move      b1fsd         w_datn
     c                   eval      b1flt1 = %editw(w_datn : '  .  .  ')
     c                   endif
     c                   if        b1fed <> *loval
     c     *dmy          move      b1fed         w_datn
     c                   eval      b1flt2 = %editw(w_datn : '  .  .  ')
     c                   endif
     c                   eval      b1flt3 = %editw(b1avd: '    0')
     c                   eval      b1flt4 = %editw(b1prl: '    0')
     c                   eval      *in41 = *off
      *
     c                   when      w_a51 = 1
      * beløpsinformasjon
     c                   eval      b1flt1 = *blank
     c                   eval      b1flt2 = *blank
     c                   eval      b1flt3 = *blank
     c                   eval      b1flt4 = *blank
     c                   exsr      finn_sum
     c                   eval      w_buo  = b1buo
     c                   eval      w_but  = b1but
     c                   eval      b1flt1 = %editw(w_buo :'  .   .   -')
     c                   eval      b1flt2 = %editw(w_but :'  .   .   -')
     c                   eval      b1flt3 = %editw(w_sumi:'  .   .   -')
     c                   eval      b1flt4 = %editw(w_sumk:'  .   .   -')
     c                   if        w_sumi < w_sumk
     c                   eval      *in41 = *on
     c                   else
     c                   eval      *in41 = *off
     c                   endif
      *
     c                   when      w_a51 = 2
      * Inntekts informasjon
     c                   eval      b1flt1 = *blank
     c                   eval      b1flt2 = *blank
     c                   eval      b1flt3 = *blank
     c                   eval      b1flt4 = *blank
     c                   exsr      finn_sum
     c                   eval      w_buo  = b1buo
     c                   eval      w_but  = b1but
     c                   eval      w_rest = w_buo - w_sumi
     c                   if        w_buo <> 0
     c                   eval(h)   w_pros = w_sumi * 100 / w_buo
     c                   else
     c                   eval      w_pros = 0
     c                   endif
     c                   eval      b1flt1 = %editw(w_buo :'  .   .   -')
     c                   eval      b1flt2 = %editw(w_sumi:'  .   .   -')
     c                   eval      b1flt3 = %editw(w_rest:'  .   .   -')
     c                   eval      b1flt4 = %editw(w_pros:'  .   .   -')
     c                   if        w_rest < 0
     c                   eval      *in41 = *on
     c                   else
     c                   eval      *in41 = *off
     c                   endif
      *
     c                   when      w_a51 = 3
      * Kostnads informasjon
     c                   eval      b1flt1 = *blank
     c                   eval      b1flt2 = *blank
     c                   eval      b1flt3 = *blank
     c                   eval      b1flt4 = *blank
     c                   exsr      finn_sum
     c                   eval      w_buo  = b1buo
     c                   eval      w_but  = b1but
     c                   eval      w_rest = w_but - w_sumk
     c                   if        w_but <> 0
     c                   eval(h)   w_pros = w_sumk * 100 / w_but
     c                   else
     c                   eval      w_pros = 0
     c                   endif
     c                   eval      b1flt1 = %editw(w_but :'  .   .   -')
     c                   eval      b1flt2 = %editw(w_sumk:'  .   .   -')
     c                   eval      b1flt3 = %editw(w_rest:'  .   .   -')
     c                   eval      b1flt4 = %editw(w_pros:'  .   .   -')
     c                   if        w_rest < 0
     c                   eval      *in41 = *on
     c                   else
     c                   eval      *in41 = *off
     c                   endif
     c                   endsl
      *
     c                   write     b1sfl
      *
     c                   enddo
      *
     c                   if        w_srrn > w_ssrn
     c                   eval      w_sfrn = w_ssrn + 1
     c                   endif
      *
     c                   eval      w_ssrn = w_srrn
     c                   eval      w_virn = w_sfrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for display av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     dsp_subfile   begsr
      *
     c                   if        w_srrn <> 0
     c                   eval      *in12 = *on
     c                   else
     c                   write     b2cmd
     c                   endif
      *
     c                   eval      *in13 = *on
     c                   exfmt     b2ctl
      *
     c                   eval      *in12 = *off
     c                   eval      *in13 = *off
     c                   eval      *in22 = *off
      *
     c                   eval      w_fcrn = d_fcrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å hente summer av prosjekt
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     finn_sum      begsr
      *
     c                   eval      w_sumi = 0
     c                   eval      w_sumk = 0
     c                   eval      w_sumix = 0
     c                   eval      w_sumkx = 0
      * inntekter
     c                   eval      rprrl1_fir = w_firm
     c                   eval      rprrl1_rap = 9700
     c                   eval      rprrl1_lin = 10
     c                   eval      rprrl1_uli = *zero
     c                   dow       rprrl1_lin < 20
     c     rprrl1_key    chain     rprrl1
     c                   if        %found(rprrl1)
      * inntekter
     c                   eval      rhtrlc_fir = w_firm
     c                   eval      rhtrlc_pro = p_pros
     c     rhtrlc_key    setll     rhtrlc
     c     rhtrlc_key    reade     rhtrlc
     c                   dow       not %eof(rhtrlc) and
     c                             rbhpro = p_pros
      *  ssdebug
     c                   eval      rbupro = rbupro
     c                   eval      rbakti = rbakti
     c                   eval      rp3akt = rp3akt
     c                   if            rbupro = p_upro
     c                             and rbakti = rp3akt
     c                             and rbkont >= rphktf
     c                             and rbkont <= rphktt
     c                   if        rphfun = '-'
     c                   eval(h)   w_sumix = w_sumix - rbneto
     c                   else
     c                   eval(h)   w_sumix = w_sumix + rbneto
     c                   endif
     c                   endif
     c     rhtrlc_key    reade     rhtrlc
     c                   enddo
      *
     c                   endif
      *
     c                   eval      rprrl1_lin = rprrl1_lin + 1
     c                   enddo
      *
      *
      * utgifter varekjøp
     c                   eval      rprrl1_fir = w_firm
     c                   eval      rprrl1_rap = 9700
     c                   eval      rprrl1_lin = 20
     c                   eval      rprrl1_uli = *zero
     c                   dow       rprrl1_lin < 30
     c     rprrl1_key    chain     rprrl1
     c                   if        %found(rprrl1)
     c                   eval      rhtrlc_fir = w_firm
     c                   eval      rhtrlc_pro = p_pros
     c     rhtrlc_key    setll     rhtrlc
     c     rhtrlc_key    reade     rhtrlc
     c                   dow       not %eof(rhtrlc)
     c                   if            rbupro = p_upro
     c                             and rbakti = rp3akt
     c                             and rbkont >= rphktf
     c                             and rbkont <= rphktt
     c                   if        rphfun = '-'
     c                   eval(h)   w_sumkx = w_sumkx - rbneto
     c                   else
     c                   eval(h)   w_sumkx = w_sumkx + rbneto
     c                   endif
     c                   endif
     c     rhtrlc_key    reade     rhtrlc
     c                   enddo
      *
     c                   endif
      *
     c                   eval      rprrl1_lin = rprrl1_lin + 1
     c                   enddo
      * utgifter lønn
     c                   eval      rprrl1_fir = w_firm
     c                   eval      rprrl1_rap = 9700
     c                   eval      rprrl1_lin = 30
     c                   eval      rprrl1_uli = *zero
     c                   dow       rprrl1_lin < 40
     c     rprrl1_key    chain     rprrl1
     c                   if        %found(rprrl1)
     c                   eval      rhtrlc_fir = w_firm
     c                   eval      rhtrlc_pro = p_pros
     c     rhtrlc_key    setll     rhtrlc
     c     rhtrlc_key    reade     rhtrlc
     c                   dow       not %eof(rhtrlc)
     c                   if            rbupro = p_upro
     c                             and rbakti = rp3akt
     c                             and rbkont >= rphktf
     c                             and rbkont <= rphktt
     c                   if        rphfun = '-'
     c                   eval(h)   w_sumkx = w_sumkx - rbneto
     c                   else
     c                   eval(h)   w_sumkx = w_sumkx + rbneto
     c                   endif
     c                   endif
     c     rhtrlc_key    reade     rhtrlc
     c                   enddo
      *
     c                   endif
      *
     c                   eval      rprrl1_lin = rprrl1_lin + 1
     c                   enddo
      * andre kostnader
     c                   eval      rprrl1_fir = w_firm
     c                   eval      rprrl1_rap = 9700
     c                   eval      rprrl1_lin = 55
     c                   eval      rprrl1_uli = *zero
     c                   dow       rprrl1_lin < 60
     c     rprrl1_key    chain     rprrl1
     c                   if        %found(rprrl1)
      * utgifter
     c                   eval      rhtrlc_fir = w_firm
     c                   eval      rhtrlc_pro = p_pros
     c     rhtrlc_key    setll     rhtrlc
     c     rhtrlc_key    reade     rhtrlc
     c                   dow       not %eof(rhtrlc)
     c                   if            rbupro = p_upro
     c                             and rbakti = rp3akt
     c                             and rbkont >= rphktf
     c                             and rbkont <= rphktt
     c                   if        rphfun = '-'
     c                   eval(h)   w_sumkx = w_sumkx - rbneto
     c                   else
     c                   eval(h)   w_sumkx = w_sumkx + rbneto
     c                   endif
     c                   endif
     c     rhtrlc_key    reade     rhtrlc
     c                   enddo
      *
     c                   endif
      *
     c                   eval      rprrl1_lin = rprrl1_lin + 1
     c                   enddo
      * finans kostnader
     c                   eval      rprrl1_fir = w_firm
     c                   eval      rprrl1_rap = 9700
     c                   eval      rprrl1_lin = 60
     c                   eval      rprrl1_uli = *zero
     c                   dow       rprrl1_lin < 70
     c     rprrl1_key    chain     rprrl1
     c                   if        %found(rprrl1)
      * utgifter
     c                   eval      rhtrlc_fir = w_firm
     c                   eval      rhtrlc_pro = p_pros
     c     rhtrlc_key    setll     rhtrlc
     c     rhtrlc_key    reade     rhtrlc
     c                   dow       not %eof(rhtrlc)
     c                   if            rbupro = p_upro
     c                             and rbakti = rp3akt
     c                             and rbkont >= rphktf
     c                             and rbkont <= rphktt
     c                   if        rphfun = '-'
     c                   eval(h)   w_sumkx = w_sumkx - rbneto
     c                   else
     c                   eval(h)   w_sumkx = w_sumkx + rbneto
     c                   endif
     c                   endif
     c     rhtrlc_key    reade     rhtrlc
     c                   enddo
      *
     c                   endif
      *
     c                   eval      rprrl1_lin = rprrl1_lin + 1
     c                   enddo
      *
     c                   if        %abs(w_sumix) <= 99999999
     c                   eval      w_sumi = w_sumix
     c                   else
     c                   eval      w_sumi = 99999999
     c                   endif
      *
     c                   if        %abs(w_sumkx) <= 99999999
     c                   eval      w_sumk = w_sumkx
     c                   else
     c                   eval      w_sumk = 99999999
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å hente standard aktiviteter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     HentAkt       begsr
     c                   eval      p_txt = 'RP120R'
     c                   eval      p_kod = *blank
     c                   call      'RA521R'
     c                   parm                    w_firm
     c                   parm                    p_kod
     c                   parm                    p_txt
     c                   eval      i = %scan(',':p_txt)
     c                   dow       i > 0
     c                   eval      p_kod = %subst(p_txt:1:i-1)
     c                   eval      p_txt = %subst(p_txt:i+1:30-i)
     c                   eval      rp3alu_akti = p_kod
     c     rp3alu_key    chain     rp3alu
     c                   if        not %found(rp3alu)
     c                   eval      rp3pro = p_pros
     c                   eval      rp3upr = p_upro
     c                   eval      rp3akt = p_kod
     c                   eval      ra21l1_kod = p_kod
     c     ra21l1_key    chain     ra21l1
     c                   if        %found(ra21l1)
     c                   eval      rp3txt = rautxt
     c                   eval      rp3tx2 = rautx2
     c                   endif
     c                   eval      rp3fsd = rp2fsd
     c                   eval      rp3fed = rp2fed
     c                   time                    rp3oda
     c                   time                    rp3eda
     c                   time                    rp3oti
     c                   time                    rp3eti
     c                   eval      rp3eav = l_user
     c                   eval      rp3oav = l_user
     c                   write     rp3alur
     c                   endif
     c                   eval      i = %scan(',':p_txt)
     c                   enddo
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_pros
     c                   parm                    p_upro
     c                   parm                    p_valg
9.01 c                   parm                    p_fdat
9.01 c                   parm                    p_tdat
9.01 c                   parm                    p_selg
9.01 c                   parm                    p_kunf
9.01 c                   parm                    p_knav
      *
      * Key for les av prosjekt
      *
     c     rp1pl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    p_pros
      *
      * Key for les av under prosjekt
      *
     c     rp2ul1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    p_pros
     c                   kfld                    p_upro
      *
      * Key for posisjonering på underprosjkt
      *
     c     rp3al1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    p_pros
     c                   kfld                    p_upro
     c                   kfld                    rp3al1_akti
      *
      * Key for posisjonering på tekst
      *
     c     rp3al2_key    klist
     c                   kfld                    w_firm
     c                   kfld                    p_pros
     c                   kfld                    p_upro
     c                   kfld                    rp3al2_besk
      *
      * Key for les på prosjekt
      *
     c     rp3alr_key    klist
     c                   kfld                    w_firm
     c                   kfld                    p_pros
     c                   kfld                    p_upro
     c                   kfld                    rp3alr_akti
      *
      * Key for oppdatering av prosjket
      *
     c     rp3alu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    p_pros
     c                   kfld                    p_upro
     c                   kfld                    rp3alu_akti
      *
      * Key for oppdatering av arbeidsordre
      *
     c*    rp4olu_key    klist
     c*                  kfld                    w_firm
     c*                  kfld                    rp4olu_arbo
      *
      * Key for oppslag på kunde
      *
     c     rkunl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rkunl1_kund
      *
      * Key for oppslag på Prosjektleder
      *
     c     ilonl1_key    klist
     c                   kfld                    ilonl1_kli
     c                   kfld                    ilonl1_lnr
      *
      * Key for oppslag på avdeling
      *
     c     ra07l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra07l1_kod
6.30  *
6.30  * Key for oppslag på Selger
6.30  *
6.30 c     ra09l1_key    klist
6.30 c                   kfld                    ra09l1_fir
6.30 c                   kfld                    ra09l1_kod
      *
      * Key for posisjonering på prosjekt-rapport
      *
     c     rprrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rprrl1_rap
     c                   kfld                    rprrl1_lin
     c                   kfld                    rprrl1_uli
      *
      * Key for les på posteringer
      *
     c     rhtrlc_key    klist
     c                   kfld                    rhtrlc_fir
     c                   kfld                    rhtrlc_pro
      *
      * Key for les på aktivitet std.
      *
     c     ra21l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra21l1_kod
      *
     c                   eval      w_firm = l_firm
      *
      * Initierer skjermbildet
      *
     c                   eval      *in22 = *on
      *
      * Hente prosjekt
      *
     c     rp1pl1_key    chain     rp1pl1
      *
     c                   eval      b2pros = p_pros
     c                   eval      b2upro = p_upro
      *
      * Hente under prosjekt
      *
     c     rp2ul1_key    chain     rp2ul1
      *
     c                   eval      b2uprt = rp2txt
      *
      * Posisjonerer databasen, og fyller opp subfile
      *
     c                   eval      b2aktiv     = 'J'
     c                   eval      s_aktiv     = 'J'
     c                   eval      s_pros      = p_pros
     c                   eval      s_upro      = p_upro
     c                   eval      w_seqe      = *blank
     c                   eval      rp3al1_akti = *blank
     c     rp3al1_key    setll     rp3al1
      *
     c*                  eval      b2head = 'Fra dato    Til dato     -
     c*                            Avd.     Pr.leder'
7.xx c                   eval      b2hea1 = 'Fra dato'
7.xx c                   eval      b2hea2 = 'Til dato'
7.xx c                   eval      b2hea3 = 'Avd.'
7.xx c                   eval      b2hea4 = 'Pr.leder'
     c                   exsr      crt_subfile
      *
     c                   endsr
