     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOKON
      * Program . . . . : RP141R
      * Beskrivelse . . : Prosjekt, Oppdatere prosjetk i sodt fra sohe på en ordre
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       110320 sst  Nytt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
7.03 fsodtlu    uf   e           k disk    rename(sodtpfr:sodtlur)
7.03 fsohel1    if   e           k disk    rename(sohepfr:sohel1r)
      *
      * Definering av Local data area
      *
     d                udS
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      *
      * Definering av variabler i nøkler
      *
     d sodtlu_aarr     s                   like(sdaarr)
     d sodtlu_binr     s                   like(sdbinr)
     d sodtlu_numm     s                   like(sdnumm)
     d sodtlu_suff     s                   like(sdsuff)
     d sohel1_aarr     s                   like(soaarr)
     d sohel1_binr     s                   like(sobinr)
     d sohel1_numm     s                   like(sonumm)
7.03 d sohel1_suff     s                   like(sosuff)
      *
      * Definering av variable
      *
     d w_firm          s              3  0
      *
     d p_aarr          s              4
     d p_binr          s              8
     d p_numm          s              8
     d p_suff          s              2
     d w_aarr          s              4  0
     d w_binr          s              8  0
     d w_numm          s              8  0
     d w_suff          s              2  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *   Oppdatere sodtPF   fra sohePF
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   eval      sohel1_aarr = w_aarr
     c                   eval      sohel1_binr = w_binr
     c                   eval      sohel1_numm = w_numm
     c                   eval      sohel1_suff = w_suff
     c     sohel1_key    chain     sohel1
      *
     c                   if        %found(sohel1)
     c                   eval      sodtlu_aarr = w_aarr
     c                   eval      sodtlu_binr = w_binr
     c                   eval      sodtlu_numm = w_numm
     c                   eval      sodtlu_suff = w_suff
     c     sodtlu_key    setll     sodtlu
     c     sodtlu_key    reade     sodtlu
      *
     c                   dow       not %eof(sodtlu)
      *
     c                   eval      sdproj = soproj
     c*                  eval      fdupro = foupro
     c                   eval      sdakti = soakti
      *
     c                   update    sodtlur
      *
     c     sodtlu_key    reade     sodtlu
     c                   enddo
     c                   endif
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_aarr
     c                   parm                    p_binr
     c                   parm                    p_numm
     c                   parm                    p_suff
      *
     c     sodtlu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    sodtlu_aarr
     c                   kfld                    sodtlu_binr
     c                   kfld                    sodtlu_numm
     c                   kfld                    sodtlu_suff
      *
     c     sohel1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    sohel1_aarr
     c                   kfld                    sohel1_binr
     c                   kfld                    sohel1_numm
     c                   kfld                    sohel1_suff
      *
     c                   eval      w_firm  = l_firm
     c                   eval      w_aarr = %dec(p_aarr:4:0)
     c                   eval      w_binr = %dec(p_binr:8:0)
     c                   eval      w_numm = %dec(p_numm:6:0)
     c                   eval      w_suff = %dec(p_suff:2:0)
      *
     c                   endsr
