     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOKON
      * Program . . . . : RR611R                                        *
      * Beskrivelse . . : Henting av tekstlinjer - resultatrapporter    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      * Spesialversjon. :                                               *
      * Tilpasset for . :                                               *
      *                                                                 *
      * Referanse  Dato   Endringsbeskrivelse                      Sign.*
      * --------- ------  ----------------------------------------------*
      *                   Nytt program desember 95                 KOB. *
      *                                                                 *
      *                                                                 *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *    60-61 = Fileindikatorer chain etc.                           *
      *                                                                 *
      *  BRUK AV RETURKODE                                              *
      *                                                                 *
      *  N = Slutt på tekstlinjer                                       *
      *  S = Start lesing av tekstlinjer                                *
      *      fra linjenr p_5LIN                                         *
      *  F = Avslutt program (setter på LR)                             *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     frrf5l1    if   e           k disk    rename(rrf5pfr:rrf5l1r)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d p_retk          s              1
     d p_5abl          s                   like(rr5abl)
     d p_5lin          s                   like(rr5lin)
     d p_5rap          s                   like(rr5rap)
     d p_5txt          s                   like(rr5txt)
     d w_5fir          s                   like(rr5fir)
     d w_5lin          s                   like(rr5lin)
     d w_5rap          s                   like(rr5rap)
      *
     c     dummy         tag
      /EJECT
      *
      * Sett startverdi
      *
     c                   if        p_retk = 'S'                                          .....
     c                   move      *off          *in60                                       .
     c                   move      l_firm        w_5fir                                      .
     c                   move      p_5rap        w_5rap                                      .
     c                   move      p_5lin        w_5lin                                      .
     c     key05         setll     rrf5l1                                                    .
     c                   endif                                                           .....
      *
      * Avslutt
      *
     c                   if        p_retk = 'F'                                          .....
     c                   move      *on           *inlr                                       .
     c                   goto      slutt                                                     .
     c                   endif                                                           .....
      *
     c                   eval      p_retk = *blank
     c                   eval      p_5txt = *blank
      *
      * Les neste linje
      *
     c                   read      rrf5l1r                                60
      *
     c                   if        *in60 = *off                                          .....
     c                   if        rr5fir > w_5fir                                           .
     c                             or rr5rap > p_5rap                                        .
     c                   move      *on           *in60                                       .
     c                   endif                                                               .
     c                   endif                                                           .....
      *
     c                   if        *in60 = *on                                           .....
     c                   move      'N'           p_retk                                      .
     c                   goto      slutt                                                     .
     c                   endif                                                           .....
      *
     c                   move      rr5lin        p_5lin                                      .
     c                   move      rr5txt        p_5txt                                      .
     c                   move      rr5abl        p_5abl                                      .
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     slutt         tag
      *
      *                    SETON                     LR
     c                   return
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_retk
     c                   parm                    p_5rap
     c                   parm                    p_5lin
     c                   parm                    p_5txt
     c                   parm                    p_5abl
      *
      * Legge inn
      * firmanummer
      *
     c                   move      l_firm        w_5fir
      *
     c                   if        p_5lin = *zeros
     c                   move      p_5rap        w_5rap
     c                   move      p_5lin        w_5lin
     c     key05         setll     rrf5l1
     c                   endif
      *
     c                   eval      p_5txt = *blank
      *
      * Key for tekstlinjer
      *
     c     key05         klist
     c                   kfld                    w_5fir
     c                   kfld                    w_5rap
     c                   kfld                    w_5lin
      *
     c                   endsr
