     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOKON
      * Program . . . . : RR621R                                        *
      * Beskrivelse . . : Utskrift av resultatrapport - parameter       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                               *
      * Tilpasset for . :                                               *
      *                                                                 *
      * Referanse  Dato   Endringsbeskrivelse                      Sign.*
      * --------- ------  ----------------------------------------------*
      *                                                                 *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *       KA = F1  = Valg av firma                                  *
      *       KC = F3  = Exit                                           *
      *                                                                 *
      *       LR = Avslutt program                                      *
      *       30 = Protect av felter ved vise                           *
      *    31-59 = Varsle m/feilmeldinger/skjermindikatorer             *
      *    60-69 = Fileindikatorer chain etc.                           *
      *    70-79 = Arbeidsindikatorer i sub-rutiner                     *
      *    80-89 = Arbeidsindikatorer ordinære                          *
      *    90-99 = Benyttes ved std. sub-rutiner                        *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fausrl1    if   e           k disk
     frrf0l1    if   e           k disk    rename(rrf0pfr:rrf0l1r)
     frr621d    cf   e             workstn
      *
     d                uds
     d rhprap                300    301  0
     d rhpkda                         6  0
     d rhprÅr                         4  0
     d rhpper                         2  0
     d rhppef                         2  0
     d rhppet                         2  0
     d rhpavf                         4  0
     d rhpavt                         4  0
     d rhpsrt                         1
     d rhpsml                         1
     d rhpavv                         1
     d rhphel                         1
     d rhplin                         1
     d rhanul                         1
     d rhpnul                         1
     d rhpa01                         4  0
     d rhpa02                         4  0
     d rhpa03                         4  0
     d rhpa04                         4  0
     d rhpa05                         4  0
     d rhpa06                         4  0
     d rhpa07                         4  0
     d rhpa08                         4  0
     d rhpa09                         4  0
     d rhpa10                         4  0
     d rhpa11                         4  0
     d rhpa12                         4  0
     d rhpa13                         4  0
     d rhpa14                         4  0
     d rhpa15                         4  0
     d rhpa16                         4  0
     d rhpa17                         4  0
     d rhpa18                         4  0
     d rhpa19                         4  0
     d rhpa20                         4  0
     d rhpa21                         4  0
     d rhpa22                         4  0
     d rhpa23                         4  0
     d rhpa24                         4  0
      *
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d waar            s              4  0
     d wmnd            s              2  0
     d p_in03          s              1
     d p_0rap          s              2  0
     d w_aar           s              2  0
     d w_firm          s                   like(rr0fir)
      *
     d rrf0l1_0rap     s                   like(rr0rap)
      *
     c     dummy         tag
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Definering av felter                                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      *
      * A2BLD  - A2 Bilde for valg av parametre
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * A2BLD Behandle bilde for valg av utskriftskriteria              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     a2taga        tag
      *
      * Bare data
      *
     c     a2tagb        tag
     c                   exfmt     a2bld
      *
      * Gå ut
      *
     c                   if        *inkc = *on                                  .....
     c                   move      '1'           p_in03                             .
     c                   goto      xslutt                                           .
     c                   endif                                                  .....
      *
      * Kontroll av rapport
      *
     c                   eval      rrf0l1_0rap = a20rap
     c     rrf0l1_key    chain     rrf0l1                             60
     c                   if        *in60 = *on
     c                   goto      a2taga                                                    .
     c                   endif
      *
      *  Kontroll avdeling
      *
     c                   if        a2pavf > a2pavt                                       .....
     c                   move      *on           *in31                                       .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Sjekke om kjøredato er gyldig
      *
     c                   if        a2pkda = *zero                                        .....
     c                   move      udate         a2pkda                                      .
     c                   endif                                                           .....
      *
     c     *dmy          test(d)                 a2pkda                 33
     c                   if        *in33 = *on                                           .....
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      *  Kontroll av periode fra - til
      *
     c                   if        a2ppef > a2ppet                                       .....
     c                   eval      *in35 = *on                                               .
     c                   goto      a2taga                                                    .
     c                   endif                                                           .....
      *
      * Skriv parameter
      *
     c                   move      a20rap        rhprap
     c                   move      a2pkda        rhpkda
     c                   move      a2prÅr        rhprÅr
     c                   move      a2pper        rhpper
     c                   move      a2ppef        rhppef
     c                   move      a2ppet        rhppet
     c                   move      a2pavf        rhpavf
     c                   move      a2pavt        rhpavt
     c                   move      a2psrt        rhpsrt
     c                   move      a2psml        rhpsml
     c                   move      a2pavv        rhpavv
     c                   move      a2phel        rhphel
     c                   move      a2plin        rhplin
     c                   move      a2anul        rhanul
     c                   move      a2pnul        rhpnul
     c                   move      a2pa01        rhpa01
     c                   move      a2pa02        rhpa02
     c                   move      a2pa03        rhpa03
     c                   move      a2pa04        rhpa04
     c                   move      a2pa05        rhpa05
     c                   move      a2pa06        rhpa06
     c                   move      a2pa07        rhpa07
     c                   move      a2pa08        rhpa08
     c                   move      a2pa09        rhpa09
     c                   move      a2pa10        rhpa10
     c                   move      a2pa11        rhpa11
     c                   move      a2pa12        rhpa12
     c                   move      a2pa13        rhpa13
     c                   move      a2pa14        rhpa14
     c                   move      a2pa15        rhpa15
     c                   move      a2pa16        rhpa16
     c                   move      a2pa17        rhpa17
     c                   move      a2pa08        rhpa18
     c                   move      a2pa09        rhpa19
     c                   move      a2pa20        rhpa20
     c                   move      a2pa21        rhpa21
     c                   move      a2pa22        rhpa22
     c                   move      a2pa23        rhpa23
     c                   move      a2pa24        rhpa24
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
     c                   eval      *inlr = *on
     c                   return
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_in03
     c                   parm                    p_0rap
      *
      * Legge inn firmanummer og navn fra parameter
      *
     c                   move      l_firm        w_firm
     c                   move      p_0rap        a20rap
      *
      * Hent parametre fra rapporthode
      *
     c                   eval      rrf0l1_0rap = p_0rap
     c     rrf0l1_key    chain     rrf0l1                             60
      *
     c                   eval      a2pavf = *zeros
     c                   move      9999          a2pavt
     c                   move      ' '           a2psrt
     c                   move      rr0bfj        a2psml
     c                   move      rr0avv        a2pavv
     c                   move      rr0hel        a2phel
     c                   move      'J'           a2plin
     c                   move      'J'           a2anul
     c                   move      'N'           a2pnul
      *
     c                   move      udate         a2pkda
      *
      * Beregner periode
      *
     c                   move      *year         waar
      *
     c                   eval      wmnd = umonth - 1
      *
     c                   if        wmnd = *zero                                          .....
     c                   movel     12            wmnd                                        .
     c                   eval      waar = waar - 1                                           .
     c                   move      waar          a2prÅr                                      .
     c                   else                                                            .....
     c                   move      waar          a2prÅr                                      .
     c                   endif                                                           .....
      *
     c                   move      wmnd          a2pper
     c                   move      wmnd          a2ppef
     c                   move      wmnd          a2ppet
      *
     c                   eval      p_in03 = ' '
      *
      * Hent bruker-record
      *
     c     key03         chain     ausrl1                             63
      *
      *  Sjekk om begrenset til avdeling
      *
     c                   if        abbavd = '1'                                          .....
     c                   eval      *in30 = *on                                               .
     c                   move      absavd        a2pavf                                      .
     c                   move      absavd        a2pavt                                      .
     c                   move      ' '           a2psrt                                      .
     c                   endif                                                           .....
      *
      * Key for bruker-file
      *
     c     key03         klist
     c                   kfld                    l_user
      *
      * Key for RESULTAREGISTER - HEADING
      *
     c     rrf0l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rrf0l1_0rap
      *
     c                   endsr
