      /TITLE  Kontroll av gyldig leverandørkategori
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RS714R                                              *
      * Beskrivelse . . : Kontroll av gyldig leverandørkategori               *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *           020100  Nytt program                                   KOB  *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                       *
      *  BRUK AV INDIKATORER                                                  *
      *                                                                       *
      *    60-61 = Fileindikatorer chain etc.                                 *
      *                                                                       *
      *  BRUK AV RETURKODE                                                    *
      *                                                                       *
      *  Kode i statusfelt(p_stat = N) : post finnes ikke                     *
      *                                                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fra14l1    if   e           k disk    rename(ra14pfr:ra14l1r)
      *
     d w_firm          s                   like(ranfir)
      *
     d p_stat          s              1
     d p_nkod          s                   like(rankod)
     d p_ntxt          s                   like(rantxt)
      *
     d ra14l1_nkod     s                   like(rankod)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Sjekke kode
      *
     c                   eval      ra14l1_nkod = p_nkod                                      .
     c     ra14l1_key    chain     ra14l1r                            60
      *
     c                   if        *in60 = *on                                           .....
     c                   eval      p_stat = 'N'                                              .
     c                   eval      p_ntxt = 'Koden er ugyldig  '                             .
     c                   else                                                            .....
     c                   eval      p_stat = *blank                                           .
     c                   eval      p_ntxt = rantxt                                           .
     c                   endif                                                           .....
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     slutt         tag
     c                   eval      *inlr = *on
     c                   return
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av progran                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     *inzsr        begsr
      *
     c                   eval      w_firm = l_firm
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_stat
     c                   parm                    p_nkod
     c                   parm                    p_ntxt
      *
      * Key for kode
      *
     c     ra14l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra14l1_nkod
      *
     c                   endsr
