      /TITLE  Kontroll av gyldig land-kode
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RS712R                                              *
      * Beskrivelse . . : Kontroll av gyldig landkode                         *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *           020100  Nytt program                                   KOB  *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                       *
      *  BRUK AV INDIKATORER                                                  *
      *                                                                       *
      *    60-61 = Fileindikatorer chain etc.                                 *
      *                                                                       *
      *  BRUK AV RETURKODE                                                    *
      *                                                                       *
      *  Kode i statusfelt(p_stat = N) : post finnes ikke                     *
      *                                                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fra12l1    if   e           k disk    rename(ra12pfr:ra12l1r)
      *
     d w_firm          s                   like(ralfir)
      *
     d p_stat          s              1
     d p_lkod          s                   like(ralkod)
     d p_lmna          s                   like(raltxt)
      *
     d ra12l1_lkod     s                   like(ralkod)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Sjekke kode
      *
     c                   eval      ra12l1_lkod = p_lkod                                      .
     c     ra12l1_key    chain     ra12l1r                            60
      *
     c                   if        *in60 = *on                                           .....
     c                   eval      p_stat = 'N'                                              .
     c                   eval      p_lmna = 'Koden er ugyldig  '                             .
     c                   else                                                            .....
     c                   eval      p_stat = *blank                                           .
     c                   eval      p_lmna = raltxt                                           .
     c                   endif                                                           .....
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     slutt         tag
     c                   eval      *inlr = *on
     c                   return
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     *inzsr        begsr
      *
     c                   eval      w_firm = l_firm
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_stat
     c                   parm                    p_lkod
     c                   parm                    p_lmna
      *
      * Key for kode
      *
     c     ra12l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra12l1_lkod
      *
     c                   endsr
