      /TITLE  Kontroll av gyldig kostnadsbærer
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RS728R                                              *
      * Beskrivelse . . : Kontroll av gyldig kostnadsbærer                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *           020100  Nytt program                                   KOB  *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                       *
      *  BRUK AV INDIKATORER                                                  *
      *                                                                       *
      *    60-61 = Fileindikatorer chain etc.                                 *
      *                                                                       *
      *  BRUK AV RETURKODE                                                    *
      *                                                                       *
      *  Kode i statusfelt(p_stat = N) : post finnes ikke                     *
      *                                                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fra28l1    if   e           k disk    rename(ra28pfr:ra28l1r)
      *
     d w_firm          s                   like(rebfir)
      *
     d p_stat          s              1
     d p_bkod          s                   like(rebkod)
     d p_btxt          s                   like(rebtxt)
      *
     d ra28l1_bkod     s                   like(rebkod)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Sjekke kode
      *
     c                   eval      ra28l1_bkod = p_bkod                                      .
     c     ra28l1_key    chain     ra28l1r                            60
      *
     c                   if        *in60 = *on                                           .....
     c                   eval      p_stat = 'N'                                              .
     c                   eval      p_btxt = 'Kostnadsbærer er ugyldig  '                     .
     c                   else                                                            .....
T5.50c                   if        rebspr = 'J'                                          .....
T5.50c                   eval      p_stat = 'S'                                              .
T5.50c                   eval      p_btxt = 'Kostnadsbærer er sperret'                       .
     c                   else                                                            .....
     c                   eval      p_stat = *blank                                           .
     c                   eval      p_btxt = rebtxt                                           .
T5.50c                   endif                                                           .....
     c                   endif                                                           .....
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     slutt         tag
     c                   eval      *inlr = *on
     c                   return
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     *inzsr        begsr
      *
     c                   eval      w_firm = l_firm
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_stat
     c                   parm                    p_bkod
     c                   parm                    p_btxt
      *
      * Key for kode
      *
     c     ra28l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra28l1_bkod
      *
     c                   endsr
