      /TITLE  Kontroll av gyldig prosjekt
     h datedit(*dmy) option(*nodebugio)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASOKON                                              *
      * Program . . . . : RS881R                                              *
      * Beskrivelse . . : Kontroll av gyldig underprosjekt                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Spesialversjon. :                                                     *
      * Tilpasset for . :                                                     *
      *                                                                       *
      * Referanse  Dato   Endringsbeskrivelse                            Sign *
      * --------- ------  ---------------------------------------------- ---- *
      *                                                                       *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *                                                                 *
      *  BRUK AV INDIKATORER                                            *
      *                                                                 *
      *    60-61 = Fileindikatorer chain etc.                           *
      *                                                                 *
      *  BRUK AV RETURKODE                                              *
      *                                                                 *
      *  N = Prosjekt finnes ikke i registeret                          *
      *  S = Prosjekt er avsluttet                                      *
      *                                                                 *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     frp2ul1    if   e           k disk    rename(rp2upfr:rp2ul1r)
     frp1pl1    if   e           k disk    rename(rp1ppfr:rp1pl1r)
      *
     d txt             s             30    dim(2) ctdata perrcd(1)
      *
     d p_firm          s                   like(rp2frm)
     d p_pros          s                   like(rp2pro)
     d p_pupr          s                   like(rp2upr)
     d p_retk          s              1
     d p_txt1          s                   like(rp2txt)
     d p_txt3          s                   like(rp2txt)
     d p_txt2          s                   like(rp2tx2)
      *
     d w_firm          s                   like(rp2frm)
      *
     d rp1pl1_pros     s                   like(rp1pro)
     d rp2ul1_pros     s                   like(rp2pro)
     d rp2ul1_pupr     s                   like(rp2upr)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Parameterliste
      *
     c     *entry        plist
     c                   parm                    p_retk
     c                   parm                    p_pros
     c                   parm                    p_pupr
     c                   parm                    p_txt1
     c                   parm                    p_txt2
     c                   parm                    p_txt3
      *
      * Legge inn firmanummer
      *
     c                   eval      w_firm = l_firm
     c                   eval      p_retk = *blank
     c                   eval      p_txt1 = *blank
     c                   eval      p_txt2 = *blank
     c                   eval      p_txt3 = *blank
      *
      * Sjekke prosjekt
      *
     c                   eval      rp2ul1_pros = p_pros
     c                   eval      rp2ul1_pupr = p_pupr
     c     rp2ul1_key    chain     rp2ul1r                            60
      *
      * Sjekk om prosjekt uten spes. finnes
      *
     c                   if        *in60 = *on
     c     rp2ul1_key    chain     rp2ul1r                            60
     c                   endif
      *
      * Sjekk om prosjekt uten konto finnes
      *
     c                   if        *in60 = *on
     c     rp2ul1_key    chain     rp2ul1                             60
     c                   endif
      *
      * Hent tekst for hovedprosjekt
      *
     c                   eval      rp1pl1_pros = rp2pro
     c     rp1pl1_key    chain     rp1pl1                             61
     c                   if        *in61 = *off
     c                   eval      p_txt3 = rp1txt
     c                   else
     c                   eval      p_txt3 = *blanks
     c                   endif
      * Sjekk om underprosjekt ikke har prosjekt
      *
     c                   if        *in60 = *on
     c                   eval      rp2ul1_pros = *blank
     c     rp2ul1_key    chain     rp2ul1                             60
     c                   move      txt(1)        p_txt1
     c                   endif
      *
     c                   if        *in60 = *on
     c                   move      'N'           p_retk
     c                   move      txt(1)        p_txt1
     c                   goto      slutt
     c                   endif
      *
      * Er prosjekt sperret?
      *
     c**                 if        rp1sts <> *loval
     c**                 move      'S'           p_retk
     c**                 endif
      *
     c                   move      rp2txt        p_txt1
     c                   move      rp2tx2        p_txt2
      /space 3
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     slutt         tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      *
      * Key for prosjekt
      *
     c     rp2ul1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rp2ul1_pros
     c                   kfld                    rp2ul1_pupr
      *
      *
     c     rp1pl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rp1pl1_pros
      *
     c                   endsr
**
UNDERPROSJEKT ER UGYLDIG
PROSJEKTET ER AVSLUTTET
