     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOKON
      * Program . . . . : RT001R
      * Beskrivelse . . : Danne total kontoplan
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       060804 HFL  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     FRT001D    CF   E             WORKSTN
      * LOCAL
     d                uds
     D  WANN                 801    801  0
     D  WWAAR4               810    813  0
     d lcuser                911    920
     d lcfirm                944    946  0
     d lcnavn                951    980
      *
      *          Programstart
      *
     C                   MOVE      *YEAR         XAAR
     C                   MOVE      *ZERO         WANN
      *
     C                   MOVE      lcnavn        WFNAVN
     C                   MOVE      lcuser        WUSER
      *
     C                   WRITE     B000
     C     FEIL          TAG
     C                   EXFMT     B001
     C                   MOVE      XAAR          WWAAR4
     C     *IN01         IFEQ      '1'
     C                   GOTO      SLUTT
     C                   END
      *
     C     *IN12         IFEQ      '0'
     C                   EXSR      KONTR
     C                   ELSE
     C                   Z-ADD     1             WANN
     C                   GOTO      SLUTT
     C                   END
      *
     C     *IN60         IFEQ      '1'
     C     *IN61         OREQ      '1'
     C     *IN62         OREQ      '1'
     C                   GOTO      FEIL
     C                   END
     C     SLUTT         TAG
     C                   SETON                                        LR
      *
      *----------------------------------------------------------------
      *  KONTROLLERER INNTASTEDE VERIER
      *----------------------------------------------------------------
      *
     C     KONTR         BEGSR
     C                   MOVEA     '000'         *IN(60)
      *
     C                   ENDSR                                                                 DATSN
