     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOKON
      * Program . . . . : RT020R
      * Beskrivelse . . : Danne total kontoplan
      *
      *                   Legger på kbærernavn
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       060804 HFL  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fra28l1    if   e           k disk    rename(ra28pfr:ra28l1r)
     Frtotl3    uf   e           k disk    rename(rtotpfr:rtotl3r)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
      *
      * Definering av variabler i nøkler
      *
     d ra28l1_bkod     s                   like(rebkod)
      *
      * Definering av variable
     d w_firm          s                   like(rebfir)
     d wkbare          s                   like(rebkod)
      *
      *   RENAME AV FELTER I RTOTL3
      *----------------------------------------------------------------
     IRTOTL3R
     I              FIRMA                       TOFIRM
      *
      *------------------------------------------------------------------*
      *   HOVEDPROGRAM                                                   *
      *------------------------------------------------------------------*
      *
     C     *IN50         DOWEQ     *OFF
     C                   READ      RTOTL3R                                50
     C     *IN50         IFEQ      *OFF
      *
      *  CHAIN KODEFIL BÆRER VED BRUDD KBARER
      *
     C     KBARER        IFNE      WKBARE
     c                   MOVE      KBARER        ra28l1_bkod
     c     ra28l1_key    chain     ra28l1                             90
     C                   MOVE      KBARER        WKBARE
     C                   END                                                    TOFIRM
      *
     C                   MOVE      rebtxt        KBNAVN
     C                   UPDATE    RTOTL3R
     C                   END                                                    <IN50
     C                   END                                                    <IN50
      *
     C                   MOVE      '1'           *INLR
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for posisjonering på kostnadsbærer
      *
     c     ra28l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra28l1_bkod
      *
     c                   eval      w_firm = l_firm
     c                   endsr
