     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON
      * Program . . . . : RX732R
      * Beskrivelse . . : Oppdaterer mva-grunnlag
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       100204 KOB  Nytt program
6.10  * V6.10 210909 BSA  Lagt inn sporingsfelter
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     frhtrpf    uf   e           k disk    rename(rhtrpfr:rhtrpfr)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
      * Definering av variable
      *
     d w_firm          s                   like(rbfirm)
     d w_pmva          s              2  0
     d w_mdat          s               d   datfmt(*iso)
      *
      * Les hovedboksposter
      *
     c                   read      rhtrpf                                 90
      *
     c                   dow       *in90 = *off
      *
     c                   if        rbraar >= 2004
      *
     c                   if        rbneto < 0 and
     c                             rbmvab < 0 and
     c                             rbmvag > 0
     c                   eval      rbmvag = 0 - rbmvag
6.10 c                   time                    rbedat
6.10 c                   time                    rbetim
6.10 c                   eval      rbeusr = l_user
     c                   update    rhtrpfr
     c                   endif
      *
     c                   if        rbneto > 0 and
     c                             rbmvab > 0 and
     c                             rbmvag < 0
     c                   eval      rbmvag = 0 - rbmvag
6.10 c                   time                    rbedat
6.10 c                   time                    rbetim
6.10 c                   eval      rbeusr = l_user
     c                   update    rhtrpfr
     c                   endif
      *
     c                   endif
      *
     c                   read      rhtrpf                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
