     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOKON
      * Program . . . . : RX737R
      * Beskrivelse . . : Oppdaterer kode for automatposter
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       200705 KOB  Nytt program
6.10  * V6.10 210909 BSA  Lagt inn sporingsfelter
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     frzuml1    uf   e           k disk    rename(rzumpfr:rzuml1r)
     frhtrl4    uf   e           k disk    rename(rhtrpfr:rhtrl4r)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
      * Definering av variable
      *
     d w_firm          s                   like(rbfirm)
      *
     d rhtrl4_raar     s                   like(rbraar)
     d rhtrl4_biln     s                   like(rbbiln)
      *
      * Les sumposter
      *
     c                   read      rzuml1                                 90
      *
     c                   dow       *in90 = *off
      *
     c                   if        rztell = 1
      *
     c                   eval      rhtrl4_raar = rzraar
     c                   eval      rhtrl4_biln = rzbiln
      *
     c     rhtrl4_key    chain     rhtrl4
      *
     c                   if        %found(rhtrl4)
     c                   eval      rbautk = '3'
6.10 c                   time                    rbedat
6.10 c                   time                    rbetim
6.10 c                   eval      rbeusr = l_user
     c                   update    rhtrl4r
     c                   endif
      *
     c                   endif
      *
     c                   read      rzuml1                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for hovedboksposteringer
      *
     c     rhtrl4_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rhtrl4_raar
     c                   kfld                    rhtrl4_biln
      *
     c                   endsr
