     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASVADM
      * Program . . . . : RY132R
      * Beskrivelse . . : Fjerner priser for hardkodede leverandører -3.
      *                   Fjerner lokalt registrerte priser for
      *                   leverandører
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       200298 HKO  Nytt program
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fjvarl1    if   e           k disk    rename(jvarpfr:jvarl1r)
     fjvprlu    uf   e           k disk    rename(jvprpfr:jvprlur)
      *
      * Definering av variable i nøkkler
      *
     d jvprlu_vare     s                   like(jxvare)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *loval        setll     jvarl1
     c                   read      jvarl1                                 90
     c                   dow       *in90 = *off
      *
     c                   if        jvldor = 201698 or
     c                             jvldor = 202633 or
     c                             jvldor = 201889 or
     c                             jvldor = 50955  or
     c                             jvldor = 50997  or
     c                             jvldor = 91515  or
     c                             jvldor = 201124 or
     c                             jvldor = 201469 or
     c                             jvldor = 201940
      *
     c                   eval      jvprlu_vare = jvvare
     c     jvprlu_key    setll     jvprlur
     c     jvprlu_key    reade     jvprlur                                91
     c                   dow       *in91 = *off
     c                   if        jxrsts = 1
     c                   delete    jvprlur
     c                   endif
     c     jvprlu_key    reade     jvprlur                                91
     c                   enddo
      *
     c                   endif
      *
     c                   read      jvarl1                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppdatering av vare-pris
      *
     c     jvprlu_key    klist
     c                   kfld                    jvprlu_vare
      *
     c                   endsr
