     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASVADM
      * Program . . . . : RY752R
      * Beskrivelse . . : FIX: Konverterer enheter på vare-pakninger
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       131099 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fjvpklu    uf   e           k disk    rename(jvpkpfr:jvpklur)
      *
      * Definering av LDA
      *
     d                uds
     d l_firm                944    946  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Leser vare-pakning og bytter enhet
      *
     c                   read      jvpklur                                90
     c                   dow       *in90 = *off
      *
     c                   select
     c                   when      jwenhe = 'BKS'
     c                   eval      jwenhe = 'BOX'
     c                   when      jwenhe = 'GL '
     c                   eval      jwenhe = 'GLA'
     c                   when      jwenhe = 'MTR'
     c                   eval      jwenhe = 'M  '
     c                   when      jwenhe = 'LPM'
     c                   eval      jwenhe = 'LM '
     c                   when      jwenhe = 'PKN'
     c                   eval      jwenhe = 'PAK'
     c                   when      jwenhe = 'SK '
     c                   eval      jwenhe = 'SEK'
     c                   when      jwenhe = 'SP '
     c                   eval      jwenhe = 'SPA'
     c                   when      jwenhe = 'SPR'
     c                   eval      jwenhe = 'STK'
     c                   endsl
      *
     c                   update    jvpklur
      *
     c                   read      jvpklur                                90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
