     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASVADM
      * Program . . . . : RY767R
      * Beskrivelse . . : FIX: Sletter varer fra LVR som ikke er overf. EVR
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       100300 HKO  Nytt program
      *       141003 HKO  Utvidet parameter ved kall av JV400R
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fjvarl1    if   e           k disk    rename(jvarpfr:jvarl1r)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
      *
      * Definering av variable i nøkler
      *
     d jvarl1_vare     s                   like(jvvare)
     d vvarl1_firm     s                   like(vvfirm)
     d vvarl1_vare     s                   like(vvvare)
      *
      * Definering av variable
      *
     d b_inlr          s              1    inz(*off)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Leser vareregisteret
      *
     c                   eval      jvarl1_vare = '90000000'
     c     jvarl1_key    setll     jvarl1
     c                   read      jvarl1r                                90
     c                   dow       *in90 = *off
      *
     c                   if        jvvare < '90000000'
     c                   goto      neste_vare
     c                   endif
      *
     c                   if        jvldor <> 9998 and
     c                             jvldor <> 9999
     c                   goto      neste_vare
     c                   endif
      *
      * Sjekker om varer er overført EVR
      *
     c                   eval      vvarl1_firm = 0
     c                   eval      vvarl1_vare = jvvare
     c     vvarl1_key    chain     vvarl1                             91
     c                   if        *in91 = *off
     c                   goto      neste_vare
     c                   endif
      *
      * Kaller program for sletting av vare i LVR
      *
     c                   eval      b_inlr = *on
      *
     c                   call      'JV400R'
     c                   parm                    vvarl1_firm
     c                   parm                    jvvare
     c                   parm                    b_inlr
      *
     c     neste_vare    tag
      *
     c                   read      jvarl1r                                90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for les på vare
      *
     c     jvarl1_key    klist
     c                   kfld                    jvarl1_vare
      *
      * Key for oppslag på EVR-vare
      *
     c     vvarl1_key    klist
     c                   kfld                    vvarl1_firm
     c                   kfld                    vvarl1_vare
      *
     c                   endsr
