     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASVADM
      * Program . . . . : RY850R
      * Beskrivelse . . : Bytter firmanummer på alle tabeller i LVR
      *
      * NB! Hardkodet firmanummer. Må derfor endres for hver kjøring
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       161296 HKO  Fjernet oppdatering av JMFIPF
      *       160698 HKO  Lagt inn oppdatering av modultekst-register og
      *                   rabattelement-register
      *       031198 HKO  Fjernet oppdatering av søketekst-register
      *       290208 bof  Utvidet forpakning med modulnr.
6.10  *       160210 bsa  Fjernet filer som ikke lenger benyttes
8.01  *PRG2   220622 BOF  Utvidet prisgruppe fra 1 til 2 posisjoner
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
6.10 f*javhpf    uf   e           k disk
6.10 f*javlpf    uf   e           k disk
     fjbetpf    uf   e           k disk
     fjraepf    uf   e           k disk
     fjforpf    uf   e           k disk
     fjkahpf    uf   e           k disk
     fjkavpf    uf   e           k disk
     fjmatpf    uf   e           k disk
     fjpfapf    uf   e           k disk
     fjrappf    uf   e           k disk
     fjrvgpf    uf   e           k disk
     fjrfipf    uf   e           k disk
     fjstspf    uf   e           k disk
     fjvdtpf    uf   e           k disk
     fjwprpf    uf   e           k disk
      *
      * Definering av variable
      *
     d w_firm          s              3  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Oppdaterer firmanummer
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   eval      w_firm = 100
      *
6.10 c*                  read      javhpfr
6.10 c*                  dow       not %eof
6.10 c*                  eval      jhfirm = w_firm
6.10 c*                  update    javhpfr
6.10 c*                  read      javhpfr
6.10 c*                  enddo
6.10  *
6.10 c*                  read      javlpfr
6.10 c*                  dow       not %eof
6.10 c*                  eval      jifirm = w_firm
6.10 c*                  update    javlpfr
6.10 c*                  read      javlpfr
6.10 c*                  enddo
      *
     c                   read      jbetpfr
     c                   dow       not %eof
     c                   eval      jpfirm = w_firm
     c                   update    jbetpfr
     c                   read      jbetpfr
     c                   enddo
      *
     c                   read      jraepfr
     c                   dow       not %eof
     c                   eval      jpefir = w_firm
     c                   update    jraepfr
     c                   read      jraepfr
     c                   enddo
      *
     c                   read      jforpfr
     c                   dow       not %eof
     c                   eval      jzfirm = w_firm
     c                   update    jforpfr
     c                   read      jforpfr
     c                   enddo
      *
     c                   read      jkahpfr
     c                   dow       not %eof
     c                   eval      jmfirm = w_firm
     c                   update    jkahpfr
     c                   read      jkahpfr
     c                   enddo
      *
     c                   read      jkavpfr
     c                   dow       not %eof
     c                   eval      jmvfir = w_firm
     c                   update    jkavpfr
     c                   read      jkavpfr
     c                   enddo
      *
     c                   read      jmatpfr
     c                   dow       not %eof
     c                   eval      jofirm = w_firm
     c                   update    jmatpfr
     c                   read      jmatpfr
     c                   enddo
      *
     c                   read      jpfapfr
     c                   dow       not %eof
     c                   eval      jcfirm = w_firm
     c                   update    jpfapfr
     c                   read      jpfapfr
     c                   enddo
      *
     c                   read      jrappfr
     c                   dow       not %eof
     c                   eval      jrfirm = w_firm
     c                   update    jrappfr
     c                   read      jrappfr
     c                   enddo
      *
     c                   read      jrvgpfr
     c                   dow       not %eof
     c                   eval      jrgfir = w_firm
     c                   update    jrvgpfr
     c                   read      jrvgpfr
     c                   enddo
      *
     c                   read      jrfipfr
     c                   dow       not %eof
     c                   eval      jrffir = w_firm
     c                   update    jrfipfr
     c                   read      jrfipfr
     c                   enddo
      *
     c                   read      jstspfr
     c                   dow       not %eof
     c                   eval      jaafir = w_firm
     c                   update    jstspfr
     c                   read      jstspfr
     c                   enddo
      *
     c                   read      jvdtpfr
     c                   dow       not %eof
     c                   eval      jvdfir = w_firm
     c                   update    jvdtpfr
     c                   read      jvdtpfr
     c                   enddo
      *
     c                   read      jwprpfr
     c                   dow       not %eof
     c                   eval      jbfirm = w_firm
     c                   update    jwprpfr
     c                   read      jwprpfr
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c                   endsr
