     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASVADM
      * Program . . . . : RY992R
      * Beskrivelse . . : KONV: Oppretter tilleggsinfo på modul
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       181003 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fjmodlu    uf   e           k disk    rename(jmodpfr:jmodlur)
     fjvarlg    if   e           k disk    rename(jvarpfr:jvarlgr)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
      *
      * Definering av variable i nøkler
      *
     d jvarlg_modn     s                   like(jvmodn)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c                   read      jmodlur
     c                   dow       not %eof
      *
     c                   eval      jvarlg_modn = jumodn
     c     jvarlg_key    chain     jvarlg
     c                   if        %found
     c                   eval      juldor = jvldor
     c                   eval      juprod = jvprod
     c                   eval      juogrp = jvogrp
     c                   eval      juhgrp = jvhgrp
     c                   eval      juugrp = jvugrp
     c                   eval      jueusr = l_user
     c                   time                    juedat
     c                   time                    juetim
     c                   update    jmodlur
     c                   endif
      *
     c                   read      jmodlur
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppslag på vare
      *
     c     jvarlg_key    klist
     c                   kfld                    jvarlg_modn
      *
     c                   endsr
