     h/Title  ASSTAT: Oppretter standardverdier
     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASSTAT
      * Program . . . . : SA901R
      * Beskrivelse . . : Oppretter standardverdier i rutineregisteret
      *
      * spesialversjon. :
      * tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      * V5.40 150406 KOB  Oppdatert med nye rutiner
      * V5.50 021107 KOB  Fjernet oppdatering hvis rutinen finnes fra før
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     faforlu    uf a e           k disk    rename(aforpfr:aforlur)
      *
     d rut1            s             80    dim(17) ctdata perrcd(1)              rutiner-1
     d rut2            s             80    dim(17) ctdata perrcd(1)              rutiner-2
      *
     d                 ds
     d  a2rec1                 1     80
     d  a2ruti                 1     10
     d  a2prog                11     20
     d  a2txt1                21     60
     d  a2form                61     70
     d  a2outq                71     80
      *
     d                 ds
     d  a2rec2                 1     80
     d  a2acpi                 1      2  0
     d  a2alin                 3      5  0
     d  a2oflw                 6      8  0
     d  a2akop                 9     11  0
     d  a2hldq                12     12
     d  a2prty                13     13
     d  a2inst                14     14  0
     d  a2prfi                15     15  0
     d  a2bgir                16     16  0
     d  a2mvak                19     19  0
     d  a2ocrk                20     20  0
     d  a2apos                21     23  0
     d  a2kidd                24     24  0
     d  a2chgv                25     25  0
      *
     d                uds
     d  l_firm               944    946  0
     d  l_fnav               951    980
      *
      * Definering av variabler i nøkler
      *
     d aforlu_ruti     s                   like(afruti)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Oppretter standard rutiner                                     *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c                   move      *zero         i
     c     i             doueq     17
     c                   add       1             i
     c                   move      rut1(i)       a2rec1
     c                   move      rut2(i)       a2rec2
      *
     c                   move      a2ruti        aforlu_ruti
     c     aforlu_key    chain     aforlur                            90
      *
     c                   if        not%found
     c                   move      a2ruti        afruti
     c                   move      a2txt1        aftxt1
     c                   move      *blank        aftxt2
     c                   move      *blank        afmld1
     c                   move      *blank        afmld2
     c                   move      *blank        afmld3
     c                   move      a2form        afform
     c                   move      a2outq        afoutq
     c                   move      a2acpi        afacpi
     c                   move      a2alin        afalin
     c                   move      a2apos        afapos
     c                   move      a2oflw        afoflw
     c                   move      a2akop        afakop
     c                   move      a2hldq        afhldq
     c                   move      *zeros        afsave
     c                   move      a2prty        afprty
     c                   move      a2inst        afinst
     c                   move      a2prfi        afprfi
     c                   move      a2bgir        afbgir
     c                   move      a2mvak        afmvak
     c                   move      a2kidd        afkidk
     c                   move      a2ocrk        afocrk
     c                   move      *zeros        afipds
     c                   move      *blank        afhex1
     c                   move      *blank        afhex2
     c                   move      a2prog        afprog
     c                   move      a2chgv        afchgv
     c                   move      *blank        aftvbt
     c                   move      *blank        af0rot
     c                   move      *zeros        afskin
     c                   move      *zeros        afskut
     c                   move      *blank        afpkva
     c                   move      *blank        afdplx
     c                   move      *zeros        afarki
     c                   move      *zeros        afetik
     c                   move      *zeros        afwork
     c                   move      *zeros        afpdfa
      *
     c                   write     aforlur
     c                   endif
      *
     c***                if        %found
     c***                move      a2txt1        aftxt1
     c***                move      a2acpi        afacpi
     c***                move      a2alin        afalin
     c***                move      a2apos        afapos
     c***                move      a2oflw        afoflw
     c***                move      a2chgv        afchgv
      *
     c***                update    aforlur
     c***                endif
      *
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Avslutt program                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
      *
     c                   seton                                        lr
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     csr   *inzsr        begsr
      *
      *  Nullstilling av felter som ikke kan redefineres
      *
     c                   move      *zero         i                 2 0
      *
      *  Key for file : Formular-rutine-register
      *
     c     aforlu_key    klist
     c                   kfld                    aforlu_ruti
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Tar inn parameter fra forrige program                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     csr                 endsr
      *
**     R u t i n e r  (1)
SB611               Utskrift av budsjett-register           *STD      *JOB
SF600               Utskrift av kvitteringsliste            *STD      *JOB
SF611               Utskrift av utvalgsstatistikk           *STD      *JOB
SF613               Utskrift av salgsstatistikk             *STD      *JOB
SF615               Utskrift av dekningsstatistikk          *STD      *JOB
SF621               Utskrift av mengdestatistikk            *STD      *JOB
SF623               Utskrift av butikk-statistikk           *STD      *JOB
SF625               Utskrift av multistatistikk             *STD      *JOB
SF627               Utskrift av ny salgsstatistikk          *STD      *JOB
SF629               Utskrift av mengde-statistikk (m3)      *STD      *JOB
SF631               Utskrift av mail, etiketter             *STD      *JOB
SF653               Utskrift av bruksrettytelser, sammendrag1XA4      *JOB
SF654               Utskrift av bruksrettytelser, detaljert 1XA4      *JOB
SF661               Oppdatering av PC-fil                   *STD      *JOB
SI600               Utskrift av kvitteringsliste            *STD      *JOB
SI611               Utskrift av innkjøpsstatistikk          *STD      *JOB
SI621               Utskrift av mengdestatistikk            *STD      *JOB
**     R u t i n e r  (2)
1004804400100000000013201  SB611    Utskrift av budsjett-register
1004804400100000000013201  SF600    Utskrift av kvitteringsliste
1004804400100000000013201  SF611    Utskrift av utvalgsstatistikk
1504804400100000000019801  SF613    Utskrift av salgsstatistikk
1504804400100000000019801  SF615    Utskrift av dekningsstatistikk
1504804400100000000019801  SF621    Utskrift av mengdestatistikk
1004804400100000000013201  SF623    Utskrift av butikk-statistikk
1504804400100000000019801  SF625    Utskrift av multistatistikk
1504804400100000000014601  SF627    Utskrift av ny salgsstatistikk
1504804400100000000019801  SF629    Utskrift av mengde-statistikk (m3)
1004804400100000000013201  SF631    Utskrift av mail, etiketter
1007206800100000000008001  SF653    Utskrift av bruksrettytelser, sammendrag
1007206800100000000008001  SF654    Utskrift av bruksrettytelser, detaljert
1004804400100000000013201  SF661    Oppdatering av PC-fil
1004804400100000000013201  SI600    Utskrift av kvitteringsliste
1004804400100000000013201  SI611    Utskrift av innkjøpsstatistikk
1504804400100000000019801  SI621    Utskrift av mengdestatistikk
