      /title  ASSTAT: Kopiering av budsjett (hele)
     h datedit(*dmy.) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  System. . . . . : ASSTAT                                       *
      *  Program . . . . : SBCOLR                                       *
      *  Beskrivelse . . : Kopiering av budsjett (hele)                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  Spesialversjon. :                                              *
      *  Tilpasset for . :                                              *
      *                                                                 *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.*
      *  --------- ------  ---------------------------------------------*
      *                                                                 *
      *                                                                 *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
      *
     fSKBUL1    IF   E           K DISK    RENAME(SKBUPFR:SKBUL1R)
     fSKBULU    UF A E           K DISK    RENAME(SKBUPFR:SKBULUR)
      *
      *
     d                uds
     d dsfirm                944    946  0
      *
     d wwfirm          s                   like(sbfirm)
     d wwfhaa          s                   like(sbhhaa)
     d wwthaa          s                   like(sbhhaa)
     d wwfers          s                   like(sbvers)
     d wwters          s                   like(sbvers)
     d wwkode          s                   like(sbkode)
     d wwaabb          s                   like(sbaabb)
      *
     d wwavde          s                   like(sbavde)
     d wwlage          s                   like(sblage)
     d wwotyp          s                   like(sbotyp)
     d wwland          s                   like(sbland)
     d wwdist          s                   like(sbdist)
     d wwselg          s                   like(sbselg)
     d wwkkat          s                   like(sbkkat)
     d wwkund          s                   like(sbkund)
     d wwogrp          s                   like(sbogrp)
     d wwhgrp          s                   like(sbhgrp)
     d wwugrp          s                   like(sbugrp)
     d wwvare          s                   like(sbvare)
      *
     d wpfirm          s                   like(sbfirm)
     d wpkode          s                   like(sbkode)
     d wpaabb          s                   like(sbaabb)
     d wpfhaa          s                   like(sbhhaa)
     d wpthaa          s                   like(sbhhaa)
     d wpfers          s                   like(sbvers)
     d wpters          s                   like(sbvers)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Kopiering av budsjett                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c                   move      *zero         wwavde
     c                   move      *zero         wwlage
     c                   move      *blank        wwotyp
     c                   move      *blank        wwland
     c                   move      *zero         wwdist
     c                   move      *zero         wwselg
     c                   move      *zero         wwkkat
     c                   move      *zero         wwkund
     c                   move      *zero         wwogrp
     c                   move      *zero         wwhgrp
     c                   move      *zero         wwugrp
     c                   move      *blank        wwvare
     c     frakey        setll     skbul1r
      *
     c     tag02         tag
     c                   move      *off          *in90
     c                   read      skbul1r                                90
      *
     c     *in90         ifeq      *off
     c     wwfirm        ifeq      sbfirm
     c     wwfhaa        ifeq      sbhhaa
     c     wwfers        ifeq      sbvers
     c     wwkode        ifeq      sbkode
     c     wwaabb        ifeq      sbaabb
      *
     c     tilkey        chain     skbulur                            92
     c     *in92         ifeq      *on
     c                   move      wwthaa        sbhhaa
     c                   move      wwters        sbvers
     c                   write     skbulur
     c                   endif
      *
     c                   goto      tag02
     c                   endif
     c                   endif
     c                   endif
     c                   endif
     c                   endif
     c                   endif
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Avslutt program                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     XSLUTT        TAG
      *
     c                   SETON                                        LR
     c                   RETURN
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     csr   *INZSR        begsr
      *
      * Key for file BUDSJETT-REGISTER
      *
     c     FRAKEY        klist
     c                   kfld                    wwfirm
     c                   kfld                    wwfhaa
     c                   kfld                    wwfers
     c                   kfld                    wwkode
     c                   kfld                    wwaabb
     c                   kfld                    wwavde
     c                   kfld                    wwlage
     c                   kfld                    wwotyp
     c                   kfld                    wwland
     c                   kfld                    wwdist
     c                   kfld                    wwselg
     c                   kfld                    wwkkat
     c                   kfld                    wwkund
     c                   kfld                    wwogrp
     c                   kfld                    wwhgrp
     c                   kfld                    wwugrp
     c                   kfld                    wwvare
      *
      * Key for file BUDSJETT-REGISTER
      *
     c     TILKEY        klist
     c                   kfld                    wwfirm
     c                   kfld                    wwthaa
     c                   kfld                    wwters
     c                   kfld                    wwkode
     c                   kfld                    wwaabb
     c                   kfld                    wwavde
     c                   kfld                    wwlage
     c                   kfld                    wwotyp
     c                   kfld                    wwland
     c                   kfld                    wwdist
     c                   kfld                    wwselg
     c                   kfld                    wwkkat
     c                   kfld                    wwkund
     c                   kfld                    wwogrp
     c                   kfld                    wwhgrp
     c                   kfld                    wwugrp
     c                   kfld                    wwvare
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Tar inn parameter fra forrige program                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     *entry        plist
     c                   parm                    wpfirm
     c                   parm                    wpkode
     c                   parm                    wpaabb
     c                   parm                    wpfhaa
     c                   parm                    wpthaa
     c                   parm                    wpfers
     c                   parm                    wpters
      *
      *  Legger inn firmanummer i nøkklene
      *
     c                   move      wpfirm        wwfirm
      *
      *  Legger inn opplysninger i nøkklene
      *
     c                   move      wpkode        wwkode
     c                   move      wpaabb        wwaabb
      *
     c                   move      wpfhaa        wwfhaa
     c                   move      wpfers        wwfers
      *
     c                   move      wpthaa        wwthaa
     c                   move      wpters        wwters
      *
     csr                 endsr
