      /title  ASSTAT: Sletting av budsjett (hele)
     h datedit(*dmy.) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  System. . . . . : ASSTAT                                       *
      *  Program . . . . : SBDELR                                       *
      *  Beskrivelse . . : Sletting av budsjett (hele)                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  Spesialversjon. :                                              *
      *  Tilpasset for . :                                              *
      *                                                                 *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.*
      *  --------- ------  ---------------------------------------------*
      *                                                                 *
      *                                                                 *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fskbul1    if   e           k disk    rename(skbupfr:skbul1r)
     fskbulu    uf   e           k disk    rename(skbupfr:skbulur)
      *
      *
     d                uds
     d dsfirm                944    946  0
      *
     d wwfirm          s                   like(sbfirm)
     d wwhhaa          s                   like(sbhhaa)
     d wwvers          s                   like(sbvers)
     d wwkode          s                   like(sbkode)
     d wwaabb          s                   like(sbaabb)
      *
     d wwavde          s                   like(sbavde)
     d wwlage          s                   like(sblage)
     d wwotyp          s                   like(sbotyp)
     d wwland          s                   like(sbland)
     d wwdist          s                   like(sbdist)
     d wwselg          s                   like(sbselg)
     d wwkkat          s                   like(sbkkat)
     d wwkund          s                   like(sbkund)
     d wwogrp          s                   like(sbogrp)
     d wwhgrp          s                   like(sbhgrp)
     d wwugrp          s                   like(sbugrp)
     d wwvare          s                   like(sbvare)
      *
     d wpfirm          s                   like(sbfirm)
     d wpkode          s                   like(sbkode)
     d wpaabb          s                   like(sbaabb)
     d wphhaa          s                   like(sbhhaa)
     d wppaar          s                   like(sbhhaa)
     d wpvers          s                   like(sbvers)
     d wppers          s                   like(sbvers)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Sletting av budsjett                                           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c                   move      wphhaa        wwhhaa
     c                   move      wpvers        wwvers
      *
     c                   move      *zero         wwavde
     c                   move      *zero         wwlage
     c                   move      *blank        wwotyp
     c                   move      *blank        wwland
     c                   move      *zero         wwdist
     c                   move      *zero         wwselg
     c                   move      *zero         wwkkat
     c                   move      *zero         wwkund
     c                   move      *zero         wwogrp
     c                   move      *zero         wwhgrp
     c                   move      *zero         wwugrp
     c                   move      *blank        wwvare
     c     budkey        setll     skbul1r
      *
     c     tag02         TAG
     c                   setoff                                           90
     c                   read      skbul1r                                90
      *
     c     *in90         ifeq      *off
     c     wwfirm        ifeq      sbfirm
     c     wwhhaa        ifeq      sbhhaa
     c     wwvers        ifeq      sbvers
     c     wwkode        ifeq      sbkode
     c     wwaabb        ifeq      sbaabb
      *
     c                   move      sbavde        wwavde
     c                   move      sblage        wwlage
     c                   move      sbotyp        wwotyp
     c                   move      sbland        wwland
     c                   move      sbdist        wwdist
     c                   move      sbselg        wwselg
     c                   move      sbkkat        wwkkat
     c                   move      sbkund        wwkund
     c                   move      sbogrp        wwogrp
     c                   move      sbhgrp        wwhgrp
     c                   move      sbugrp        wwugrp
     c                   move      sbvare        wwvare
     c     budkey        chain     skbulur                            92
     c  n92              delete    skbulur
      *
     c                   goto      tag02
     c                   endif
     c                   endif
     c                   endif
     c                   endif
     c                   endif
     c                   endif
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Avslutt program                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     xslutt        tag
      *
     c                   seton                                        lr
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     csr   *inzsr        begsr
      *
      * Key for file BUDSJETT-REGISTER
      *
     c     budkey        klist
     c                   kfld                    wwfirm
     c                   kfld                    wwhhaa
     c                   kfld                    wwvers
     c                   kfld                    wwkode
     c                   kfld                    wwaabb
     c                   kfld                    wwavde
     c                   kfld                    wwlage
     c                   kfld                    wwotyp
     c                   kfld                    wwland
     c                   kfld                    wwdist
     c                   kfld                    wwselg
     c                   kfld                    wwkkat
     c                   kfld                    wwkund
     c                   kfld                    wwogrp
     c                   kfld                    wwhgrp
     c                   kfld                    wwugrp
     c                   kfld                    wwvare
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Tar inn parameter fra forrige program                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     *entry        plist
     c                   parm                    wpfirm
     c                   parm                    wpkode
     c                   parm                    wpaabb
     c                   parm                    wphhaa
     c                   parm                    wppaar
     c                   parm                    wpvers
     c                   parm                    wppers
      *
      *  Legger inn firmanummer i nøkklene
      *
     c                   move      wpfirm        wwfirm
      *
      *  Legger inn opplysninger i nøkklene
      *
     c                   move      wpkode        wwkode
     c                   move      wpaabb        wwaabb
      *
     csr                 endsr
