      /title  Danner nytt budsjett utfra register
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASSTAT
      * Program . . . . : SBFILR
      * Beskrivelse . . : Danner nytt budsjett utfra register
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fsinnpf    ip   f  512        disk
      *
     fskbul1    if   e           k disk    rename(skbupfr:skbul1r)
     fskbulu    uf a e           k disk    rename(skbupfr:skbulur)
      *
     frkunl1    if   e           k disk    rename(rkunpfr:rkunl1r)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
      *
     fvhgrl1    if   e           k disk    rename(vhgrpfr:vhgrl1r)
     fvugrl1    if   e           k disk    rename(vugrpfr:vugrl1r)
      *
      * Definering av parameter (inn)
      *
     d                 ds
     d wsparm                        64
     d  wsfirm                        3  0 overlay(wsparm:01)
     d  wshhaa                        4  0 overlay(wsparm:04)
     d  wsvers                        2    overlay(wsparm:08)
     d  wsakod                       12    overlay(wsparm:10)
     d  wsaabb                        1    overlay(wsparm:22)
     d  wskode                       12    overlay(wsparm:23)
      *
      * Redefinering av variable
      *
     d                 ds
     d umtid                         12  0
     d  h1date                        6  0 overlay(umtid:7)
      *
      * Omdefinering av kode
      *
     d wxkode          ds            12
     d wxkode_11                      1  0
     d wxkode_12                      1  0
     d wxkode_13                      1  0
     d wxkode_21                      1  0
     d wxkode_22                      1  0
     d wxkode_23                      1  0
     d wxkode_24                      1  0
     d wxkode_25                      1  0
     d wxkode_31                      1  0
     d wxkode_32                      1  0
     d wxkode_33                      1  0
     d wxkode_34                      1  0
      *
      * Definering av LocalDataArea
      *
     d                uds
     d lcwsid                901    910
     d lcuser                        10
      *
     d wwvare          s                   like(vvvare)
     d wwkund          s                   like(rkkund)
     d wwhogr          s                   like(vghogr)
     d wwhhgr          s                   like(vghhgr)
     d wwuogr          s                   like(vguogr)
     d wwuhgr          s                   like(vguhgr)
     d wwuugr          s                   like(vguugr)
      *
      * Definering av variable i nøkler
      *
     d w_hhaa          s                   like(sbhhaa)
     d w_vers          s                   like(sbvers)
     d w_kode          s                   like(sbkode)
     d w_aabb          s                   like(sbaabb)
      *
     d skbul1_avde     s                   like(sbavde)
     d skbul1_lage     s                   like(sblage)
     d skbul1_otyp     s                   like(sbotyp)
     d skbul1_land     s                   like(sbland)
     d skbul1_dist     s                   like(sbdist)
     d skbul1_selg     s                   like(sbselg)
     d skbul1_kkat     s                   like(sbkkat)
     d skbul1_kund     s                   like(sbkund)
     d skbul1_ogrp     s                   like(sbogrp)
     d skbul1_hgrp     s                   like(sbhgrp)
     d skbul1_ugrp     s                   like(sbugrp)
     d skbul1_vare     s                   like(sbvare)
      *
     d skbulu_avde     s                   like(sbavde)
     d skbulu_lage     s                   like(sblage)
     d skbulu_otyp     s                   like(sbotyp)
     d skbulu_land     s                   like(sbland)
     d skbulu_dist     s                   like(sbdist)
     d skbulu_selg     s                   like(sbselg)
     d skbulu_kkat     s                   like(sbkkat)
     d skbulu_kund     s                   like(sbkund)
     d skbulu_ogrp     s                   like(sbogrp)
     d skbulu_hgrp     s                   like(sbhgrp)
     d skbulu_ugrp     s                   like(sbugrp)
     d skbulu_vare     s                   like(sbvare)
      *
     d wwbu01          s                   like(sbbu01)
     d wwbu02          s                   like(sbbu02)
     d wwbu03          s                   like(sbbu03)
     d wwbu04          s                   like(sbbu04)
     d wwbu05          s                   like(sbbu05)
     d wwbu06          s                   like(sbbu06)
     d wwbu07          s                   like(sbbu07)
     d wwbu08          s                   like(sbbu08)
     d wwbu09          s                   like(sbbu09)
     d wwbu10          s                   like(sbbu10)
     d wwbu11          s                   like(sbbu11)
     d wwbu12          s                   like(sbbu12)
      *
     d wkavde          s                   like(sbavde)
     d wklage          s                   like(sblage)
     d wkotyp          s                   like(sbotyp)
     d wkland          s                   like(sbland)
     d wkdist          s                   like(sbdist)
     d wkselg          s                   like(sbselg)
     d wkkkat          s                   like(sbkkat)
     d wkkund          s                   like(sbkund)
     d wkogrp          s                   like(sbogrp)
     d wkhgrp          s                   like(sbhgrp)
     d wkugrp          s                   like(sbugrp)
     d wkvare          s                   like(sbvare)
      *
      * Definering av variable
      *
     d w_firm          s                   like(sbfirm)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * INPUT                                                           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     isinnpf    NS  01    1 cS
HOFF i                                  6   13  invare
HOFF i                                 49   53 0inbu01
HOFF i                                 61   65 0inbu02
HOFF i                                 73   77 0inbu03
HOFF i                                 85   89 0inbu04
HOFF i                                 97  101 0inbu05
HOFF i                                109  113 0inbu06
HOFF i                                121  125 0inbu07
HOFF i                                133  137 0inbu08
HOFF i                                145  149 0inbu09
HOFF i                                157  161 0inbu10
HOFF i                                169  173 0inbu11
HOFF i                                181  185 0inbu12
HOFF  *
HOFF i                                 55   57 0inbd01
HOFF i                                 67   69 0inbd02
HOFF i                                 79   81 0inbd03
HOFF i                                 91   93 0inbd04
HOFF i                                103  105 0inbd05
HOFF i                                115  117 0inbd06
HOFF i                                127  129 0inbd07
HOFF i                                139  141 0inbd08
HOFF i                                151  153 0inbd09
HOFF i                                163  165 0inbd10
HOFF i                                175  177 0inbd11
HOFF i                                187  189 0inbd12
      *
     i          NS  99
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * XINIT  Initisiering av utskriften                               *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c   01              goto      tag01
      *
     c                   goto      xslutt
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Tag01  Generering av nye linjer                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     tag01         tag
      *
      * Tar vare på verdier fra forrige
      *
HOFF c     inbu01        mult      1000          wwbu01
HOFF c     inbu02        mult      1000          wwbu02
HOFF c     inbu03        mult      1000          wwbu03
HOFF c     inbu04        mult      1000          wwbu04
HOFF c     inbu05        mult      1000          wwbu05
HOFF c     inbu06        mult      1000          wwbu06
HOFF c     inbu07        mult      1000          wwbu07
HOFF c     inbu08        mult      1000          wwbu08
HOFF c     inbu09        mult      1000          wwbu09
HOFF c     inbu10        mult      1000          wwbu10
HOFF c     inbu11        mult      1000          wwbu11
HOFF c     inbu12        mult      1000          wwbu12
HOFF  *
HOFF c                   add       inbd01        wwbu01
HOFF c                   add       inbd02        wwbu02
HOFF c                   add       inbd03        wwbu03
HOFF c                   add       inbd04        wwbu04
HOFF c                   add       inbd05        wwbu05
HOFF c                   add       inbd06        wwbu06
HOFF c                   add       inbd07        wwbu07
HOFF c                   add       inbd08        wwbu08
HOFF c                   add       inbd09        wwbu09
HOFF c                   add       inbd10        wwbu10
HOFF c                   add       inbd11        wwbu11
HOFF c                   add       inbd12        wwbu12
      *
      * Beregn ny Nøkkel
      *
     c                   exsr      nykey
     c     *in14         cabeq     *on           xslutt
      *
      * Danner ny record
      *
     c     skbulu_key    chain     skbulur                            12
      *
     c     *in12         ifeq      *on
     c                   move      *zero         sbbu01
     c                   move      *zero         sbbu02
     c                   move      *zero         sbbu03
     c                   move      *zero         sbbu04
     c                   move      *zero         sbbu05
     c                   move      *zero         sbbu06
     c                   move      *zero         sbbu07
     c                   move      *zero         sbbu08
     c                   move      *zero         sbbu09
     c                   move      *zero         sbbu10
     c                   move      *zero         sbbu11
     c                   move      *zero         sbbu12
     c                   endif
      *
     c                   add       wwbu01        sbbu01
     c                   add       wwbu02        sbbu02
     c                   add       wwbu03        sbbu03
     c                   add       wwbu04        sbbu04
     c                   add       wwbu05        sbbu05
     c                   add       wwbu06        sbbu06
     c                   add       wwbu07        sbbu07
     c                   add       wwbu08        sbbu08
     c                   add       wwbu09        sbbu09
     c                   add       wwbu10        sbbu10
     c                   add       wwbu11        sbbu11
     c                   add       wwbu12        sbbu12
      *
     c     *in12         ifeq      *off
     c                   update    skbulur
     c                   else
      *
     c                   move      w_firm        sbfirm
     c                   move      w_hhaa        sbhhaa
     c                   move      w_vers        sbvers
     c                   move      w_kode        sbkode
     c                   move      w_aabb        sbaabb
      *
     c                   move      skbulu_avde   sbavde
     c                   move      skbulu_lage   sblage
     c                   move      skbulu_otyp   sbotyp
     c                   move      skbulu_land   sbland
     c                   move      skbulu_dist   sbdist
     c                   move      skbulu_selg   sbselg
     c                   move      skbulu_kkat   sbkkat
     c                   move      skbulu_kund   sbkund
     c                   move      skbulu_ogrp   sbogrp
     c                   move      skbulu_hgrp   sbhgrp
     c                   move      skbulu_ugrp   sbugrp
     c                   move      skbulu_vare   sbvare
      *
     c                   write     skbulur
     c                   endif
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c     xslutt        tag
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Slett  Sletter forrige koden                                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     slett         begsr
      *
     c                   eval      skbul1_avde = *zero
     c                   eval      skbul1_lage = *zero
     c                   eval      skbul1_otyp = *blank
     c                   eval      skbul1_land = *blank
     c                   eval      skbul1_dist = *zero
     c                   eval      skbul1_selg = *zero
     c                   eval      skbul1_kkat = *zero
     c                   eval      skbul1_kund = *zero
     c                   eval      skbul1_ogrp = *zero
     c                   eval      skbul1_hgrp = *zero
     c                   eval      skbul1_ugrp = *zero
     c                   eval      skbul1_vare = *blank
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * XSLETT Slett linjer som finnes                                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     skbul1_key    setll     skbul1
      *
      * Les ...
      *
     c     xslett        tag
     c                   read      skbul1                                 10
     c     *in10         cabeq     *on           xgener
      *
      * Sjekk, Hopp ut dersom ikke riktig
      *
     c     sbfirm        cabne     w_firm        xgener
     c     sbhhaa        cabne     w_hhaa        xgener
     c     sbvers        cabne     w_vers        xgener
     c     sbkode        cabne     w_kode        xgener
     c     sbaabb        cabne     w_aabb        xgener
      *
      * Sletter record
      *
     c                   move      sbavde        skbulu_avde
     c                   move      sblage        skbulu_lage
     c                   move      sbotyp        skbulu_otyp
     c                   move      sbland        skbulu_land
     c                   move      sbdist        skbulu_dist
     c                   move      sbselg        skbulu_selg
     c                   move      sbkkat        skbulu_kkat
     c                   move      sbkund        skbulu_kund
     c                   move      sbogrp        skbulu_ogrp
     c                   move      sbhgrp        skbulu_hgrp
     c                   move      sbugrp        skbulu_ugrp
     c                   move      sbvare        skbulu_vare
     c     skbulu_key    chain     skbulur                            12
      *
     c     *in12         ifeq      *off
     c                   delete    skbulur
     c                   endif
      *
      * Returner til nytt les
      *
     c                   goto      xslett
      *
     c     xgener        endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Danner ny nøkkel                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     nykey         begsr
      *
      * Hent informasjon fra Vare-register
      *
     c                   movel     *blank        wwvare
     c                   movel     invare        wwvare
     c                   movel     '0000'        wwvare
      *
     c     vvarl1_key    chain     vvarl1r                            14
     c  N14              move      vvogrp        wkogrp
     c  N14              move      vvhgrp        wkhgrp
     c  N14              move      vvugrp        wkugrp
     c  N14              move      vvvare        wkvare
      *
      * Hent informasjon fra Kunde-register
      *
     c                   move      sbkund        wwkund
     c     rkunl1_key    chain     rkunl1r                            18
     c  N18              move      rkavde        wkavde
     c  N18              move      rklagr        wklage
     c  N18              move      rkland        wkland
     c  N18              move      rkdist        wkdist
     c  N18              move      rkslgr        wkselg
     c  N18              move      rkkatg        wkkkat
     c  N18              move      rkkund        wkkund
      *
      * Nullstiller alle nøkkelfelter
      *
     c                   eval      skbulu_avde = *zero
     c                   eval      skbulu_lage = *zero
     c                   eval      skbulu_otyp = *blank
     c                   eval      skbulu_land = *blank
     c                   eval      skbulu_dist = *zero
     c                   eval      skbulu_selg = *zero
     c                   eval      skbulu_kkat = *zero
     c                   eval      skbulu_kund = *zero
     c                   eval      skbulu_ogrp = *zero
     c                   eval      skbulu_hgrp = *zero
     c                   eval      skbulu_ugrp = *zero
     c                   eval      skbulu_vare = *blank
      *
      * (11-52) (Avdeling)
      *
     c   41              move      wkavde        skbulu_avde
     c   61              move      wkavde        skbulu_avde
     c   81              move      wkavde        skbulu_avde
      *
      * (12-53) (Lager)
      *
     c   42              move      wklage        skbulu_lage
     c   62              move      wklage        skbulu_lage
     c   82              move      wklage        skbulu_lage
      *
      * (13-51) (Ordretype)
      *
     c   43              move      wkotyp        skbulu_otyp
     c   63              move      wkotyp        skbulu_otyp
     c   83              move      wkotyp        skbulu_otyp
      *
      * (21-25) (Land)
      *
     c   44              move      wkland        skbulu_land
     c   64              move      wkland        skbulu_land
     c   84              move      wkland        skbulu_land
      *
      * (22-23) (Distrikt)
      *
     c   45              move      wkdist        skbulu_dist
     c   65              move      wkdist        skbulu_dist
     c   85              move      wkdist        skbulu_dist
      *
      * (23-24) (Selger)
      *
     c   46              move      wkselg        skbulu_selg
     c   66              move      wkselg        skbulu_selg
     c   86              move      wkselg        skbulu_selg
      *
      * (24-21) (Kundekategori)
      *
     c   47              move      wkkkat        skbulu_kkat
     c   67              move      wkkkat        skbulu_kkat
     c   87              move      wkkkat        skbulu_kkat
      *
      * (25-32) (Kundenummer)
      *
     c   48              move      wkkund        skbulu_kund
     c   68              move      wkkund        skbulu_kund
     c   88              move      wkkund        skbulu_kund
      *
      * (31-14) (Overgruppe)
      *
     c   49              move      wkogrp        skbulu_ogrp
     c   69              move      wkogrp        skbulu_ogrp
     c   89              move      wkogrp        skbulu_ogrp
      *
      * (32-15) (Hovedgruppe)
      *
     c   50              move      wkhgrp        skbulu_hgrp
     c   70              move      wkhgrp        skbulu_hgrp
     c   90              move      wkhgrp        skbulu_hgrp
      *
      * (33-16) (Undergruppe)
      *
     c   51              move      wkugrp        skbulu_ugrp
     c   71              move      wkugrp        skbulu_ugrp
     c   91              move      wkugrp        skbulu_ugrp
      *
      * (34-31) (Varenummer)
      *
     c   52              move      wkvare        skbulu_vare
     c   72              move      wkvare        skbulu_vare
     c   92              move      wkvare        skbulu_vare
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Beregner indaktor for budsjett-begrep                           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     binit         begsr
      *
      * (11-52) (Avdeling)
      *
     c     wxkode_11     ifeq      1
     c                   move      *on           *in41
     c                   endif
     c     wxkode_11     ifeq      2
     c                   move      *on           *in61
     c                   endif
     c     wxkode_11     ifeq      3
     c                   move      *on           *in81
     c                   endif
      *
      * (12-53) (Lager)
      *
     c     wxkode_12     ifeq      1
     c                   move      *on           *in42
     c                   endif
     c     wxkode_12     ifeq      2
     c                   move      *on           *in62
     c                   endif
     c     wxkode_12     ifeq      3
     c                   move      *on           *in82
     c                   endif
      *
      * (13-51) (Ordretype)
      *
     c     wxkode_13     ifeq      1
     c                   move      *on           *in43
     c                   endif
     c     wxkode_13     ifeq      2
     c                   move      *on           *in63
     c                   endif
     c     wxkode_13     ifeq      3
     c                   move      *on           *in83
     c                   endif
      *
      * (21-25) (Land)
      *
     c     wxkode_21     ifeq      1
     c                   move      *on           *in44
     c                   endif
     c     wxkode_21     ifeq      2
     c                   move      *on           *in64
     c                   endif
     c     wxkode_21     ifeq      3
     c                   move      *on           *in84
     c                   endif
      *
      * (22-23) (Distrikt)
      *
     c     wxkode_22     ifeq      1
     c                   move      *on           *in45
     c                   endif
     c     wxkode_22     ifeq      2
     c                   move      *on           *in65
     c                   endif
     c     wxkode_22     ifeq      3
     c                   move      *on           *in85
     c                   endif
      *
      * (23-24) (Selger)
      *
     c     wxkode_23     ifeq      1
     c                   move      *on           *in46
     c                   endif
     c     wxkode_23     ifeq      2
     c                   move      *on           *in66
     c                   endif
     c     wxkode_23     ifeq      3
     c                   move      *on           *in86
     c                   endif
      *
      * (24-21) (Kundekategori)
      *
     c     wxkode_24     ifeq      1
     c                   move      *on           *in47
     c                   endif
     c     wxkode_24     ifeq      2
     c                   move      *on           *in67
     c                   endif
     c     wxkode_24     ifeq      3
     c                   move      *on           *in87
     c                   endif
      *
      * (25-32) (Kundenummer)
      *
     c     wxkode_25     ifeq      1
     c                   move      *on           *in48
     c                   endif
     c     wxkode_25     ifeq      2
     c                   move      *on           *in68
     c                   endif
     c     wxkode_25     ifeq      3
     c                   move      *on           *in88
     c                   endif
      *
      * (31-14) (Overgruppe)
      *
     c     wxkode_31     ifeq      1
     c                   move      *on           *in49
     c                   endif
     c     wxkode_31     ifeq      2
     c                   move      *on           *in69
     c                   endif
     c     wxkode_31     ifeq      3
     c                   move      *on           *in89
     c                   endif
      *
      * (32-15) (Hovedgruppe)
      *
     c     wxkode_32     ifeq      1
     c                   move      *on           *in50
     c                   endif
     c     wxkode_32     ifeq      2
     c                   move      *on           *in70
     c                   endif
     c     wxkode_32     ifeq      3
     c                   move      *on           *in90
     c                   endif
      *
      * (33-16) (Undergruppe)
      *
     c     wxkode_33     ifeq      1
     c                   move      *on           *in51
     c                   endif
     c     wxkode_33     ifeq      2
     c                   move      *on           *in71
     c                   endif
     c     wxkode_33     ifeq      3
     c                   move      *on           *in91
     c                   endif
      *
      * (34-31) (Varenummer)
      *
     c     wxkode_34     ifeq      1
     c                   move      *on           *in52
     c                   endif
     c     wxkode_34     ifeq      2
     c                   move      *on           *in72
     c                   endif
     c     wxkode_34     ifeq      3
     c                   move      *on           *in92
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     csr   *inzsr        begsr
      *
      * Key for vareregister
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    wwvare
      *
      * Key for kunderegister
      *
     c     rkunl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    wwkund
      *
      * Key for hovedgruppe
      *
     c     vhgrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    wwhogr
     c                   kfld                    wwhhgr
      *
      * Key for undergruppe
      *
     c     vugrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    wwuogr
     c                   kfld                    wwuhgr
     c                   kfld                    wwuugr
      *
      * Key for oppdatering av lager-register
      *
     c     skbul1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_hhaa
     c                   kfld                    w_vers
     c                   kfld                    w_kode
     c                   kfld                    w_aabb
     c                   kfld                    skbul1_avde
     c                   kfld                    skbul1_lage
     c                   kfld                    skbul1_otyp
     c                   kfld                    skbul1_land
     c                   kfld                    skbul1_dist
     c                   kfld                    skbul1_selg
     c                   kfld                    skbul1_kkat
     c                   kfld                    skbul1_kund
     c                   kfld                    skbul1_ogrp
     c                   kfld                    skbul1_hgrp
     c                   kfld                    skbul1_ugrp
     c                   kfld                    skbul1_vare
      *
      * Key for oppdatering av lager-register
      *
     c     skbulu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_hhaa
     c                   kfld                    w_vers
     c                   kfld                    w_kode
     c                   kfld                    w_aabb
     c                   kfld                    skbulu_avde
     c                   kfld                    skbulu_lage
     c                   kfld                    skbulu_otyp
     c                   kfld                    skbulu_land
     c                   kfld                    skbulu_dist
     c                   kfld                    skbulu_selg
     c                   kfld                    skbulu_kkat
     c                   kfld                    skbulu_kund
     c                   kfld                    skbulu_ogrp
     c                   kfld                    skbulu_hgrp
     c                   kfld                    skbulu_ugrp
     c                   kfld                    skbulu_vare
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Tar inn parameter fra forrige program                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     *entry        plist
     c                   parm                    dsparm           64
     c                   move      dsparm        wsparm
      *
      *  Hent verdier for begrep + sett på indiaktorer
      *
     c                   move      wskode        wxkode
     c                   exsr      binit
      *
     c                   eval      w_firm      = wsfirm
     c                   eval      w_hhaa      = wshhaa
     c                   eval      w_kode      = wskode
     c                   eval      w_vers      = wsvers
     c                   eval      w_aabb      = wsaabb
      *
     c                   exsr      slett
      *
     csr                 endsr
