      /TITLE  ASSTAT Vedlikehold av budsjett-register
     h datedit(*dmy.) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASSTAT
      * Program . . . . : SC210R
      * Beskrivelse . . : Vedlikehold av budsjett-register
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      * V5.40 070405 KOB  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     fsc210d    cf   e             workstn sfile(b1sfl:srrn01)
      *
     fslakl1    if   e           k disk    rename(slakpfr:slakl1r)
     fslbul1    if   e           k disk    rename(slbupfr:slbul1r)
     fvotyl1    if   e           k disk    rename(votypfr:votyl1r)
     fvogrl1    if   e           k disk    rename(vogrpfr:vogrl1r)
     fvhgrl1    if   e           k disk    rename(vhgrpfr:vhgrl1r)
     fvugrl1    if   e           k disk    rename(vugrpfr:vugrl1r)
     frlevl1    if   e           k disk    rename(rlevpfr:rlevl1r)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
      *
     d mld             s             11    dim(4) ctdata perrcd(1)               MELDINGER
     d txt             s             25    dim(8) ctdata perrcd(1)               TEKSTER
     d cmd             S             18    dim(14) ctdata perrcd(1)              CMD-TASTER
     d rpt             s             15    dim(60) ctdata perrcd(1)
      *
     d isa             s              9  0 dim(12)                               SALDOMATRISE
     d ssa             s             11  2 dim(12)                               SALDOMATRISE
     d san             s             11  2 dim(12)                               SALDOMATRISE
      *
      * Definering av variabler i nøkler
      *
     d votyl1_otyp     s                   like(vaotyp)
     d vogrl1_oogr     s                   like(vgoogr)
     d vhgrl1_hogr     s                   like(vghogr)
     d vhgrl1_hhgr     s                   like(vghhgr)
     d vugrl1_uogr     s                   like(vguogr)
     d vugrl1_uhgr     s                   like(vguhgr)
     d vugrl1_uugr     s                   like(vguugr)
     d rlevl1_levr     s                   like(rllevr)
     d vvarl1_vare     s                   like(vvvare)
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d w_kode_nn       ds            12
     d w_kode_11                      1  0
     d w_kode_12                      1  0
     d w_kode_13                      1  0
     d w_kode_21                      1  0
     d w_kode_22                      1  0
     d w_kode_23                      1  0
     d w_kode_24                      1  0
     d w_kode_25                      1  0
     d w_kode_31                      1  0
     d w_kode_32                      1  0
     d w_kode_33                      1  0
     d w_kode_34                      1  0
      *
     d spge01          s              3  0
     d srrn01          s              4  0
     d sfrn01          s                   like(srrn01)
     d ssrn01          s                   like(srrn01)
      *
     d w_firm          s                   like(scfirm)
     d w_hhaa          s                   like(schhaa)
     d w_vers          s                   like(scvers)
     d w_kode          s                   like(sckode)
     d w_aabb          s                   like(scaabb)
      *
     d w_avde          s                   like(scavde)
     d w_lage          s                   like(sclage)
     d w_otyp          s                   like(scotyp)
     d w_land          s                   like(scland)
     d w_dist          s                   like(scdist)
     d w_selg          s                   like(scselg)
     d w_lkat          s                   like(sclkat)
     d w_levr          s                   like(scldor)
     d w_ogrp          s                   like(scogrp)
     d w_hgrp          s                   like(schgrp)
     d w_ugrp          s                   like(scugrp)
     d w_vare          s                   like(scvare)
      *
      * Definering av variable
      *
     d r1              s              2  0
     d r2              s                   like(r1)
     d r3              s                   like(r1)
      *
     d p_stat          s              1
     d p_gkod          s                   like(scavde)
     d p_hkod          s                   like(scdist)
     d p_ikod          s                   like(scselg)
     d p_jkod          s                   like(sclage)
     d p_kkod          s                   like(sclkat)
     d p_lkod          s                   like(scland)
     d p_tx20          s             20
      *
      * Redefinering til array's
      *
     islbul1r
     i              scbu01                      isa(1)
     i              scbu02                      isa(2)
     i              scbu03                      isa(3)
     i              scbu04                      isa(4)
     i              scbu05                      isa(5)
     i              scbu06                      isa(6)
     i              scbu07                      isa(7)
     i              scbu08                      isa(8)
     i              scbu09                      isa(9)
     i              scbu10                      isa(10)
     i              scbu11                      isa(11)
     i              scbu12                      isa(12)
      *
      *
     islakl1r
     i              shsa01                      ssa(1)
     i              shsa02                      ssa(2)
     i              shsa03                      ssa(3)
     i              shsa04                      ssa(4)
     i              shsa05                      ssa(5)
     i              shsa06                      ssa(6)
     i              shsa07                      ssa(7)
     i              shsa08                      ssa(8)
     i              shsa09                      ssa(9)
     i              shsa10                      ssa(10)
     i              shsa11                      ssa(11)
     i              shsa12                      ssa(12)
      *
     i              shan01                      san(1)
     i              shan02                      san(2)
     i              shan03                      san(3)
     i              shan04                      san(4)
     i              shan05                      san(5)
     i              shan06                      san(6)
     i              shan07                      san(7)
     i              shan08                      san(8)
     i              shan09                      san(9)
     i              shan10                      san(10)
     i              shan11                      san(11)
     i              shan12                      san(12)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * B2BLD Behandle åpningscildet med subfile                        *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
      * Send Alt
      *
     c     b2taga        tag
      *
     c                   write     b2cmd
      *
      * Bare data
      *
     c     b2tagb        tag
      *
     c                   exsr      xdsp01
      *
      * Avslutt program
      *
     c     *inkc         cabeq     *on           xslutt
      *
      * Forny
      *
     c                   if        *inke = *on
     c                   if        sfrn01 <> *zero
     c     sfrn01        chain     b1sfl                              60
     c                   endif
      *
     c     slakl1_key    setll     slakl1
      *
     c                   exsr      xclr01
     c                   exsr      xcrt01
     c                   goto      b2tagb
     c                   endif
      *
      * Roll
      *
     c                   if        *in10 = *on
     c                   exsr      xcrt01
     c                   goto      b2tagb
     c                   endif
      *
      * Home
      *
     c                   if        *in21
     c                   eval      *in22 = *on
     c                   goto      b2taga
     c                   endif
      *
      * Posisjoner
      * startverdi
      *
     c                   if        b2fis1 <> *blank
     c                   move      *zero         w_avde
     c                   move      *zero         w_lage
     c                   move      *blank        w_otyp
     c                   move      *blank        w_land
     c                   move      *zero         w_dist
     c                   move      *zero         w_selg
     c                   move      *zero         w_lkat
     c                   move      *zero         w_levr
     c                   move      *zero         w_ogrp
     c                   move      *zero         w_hgrp
     c                   move      *zero         w_ugrp
     c                   move      *blank        w_vare
      *
     c   41              movel     b2fis1        w_avde
     c   42              movel     b2fis1        w_lage
     c   43              movel     b2fis1        w_otyp
     c   44              movel     b2fis1        w_land
     c   45              movel     b2fis1        w_dist
     c   46              movel     b2fis1        w_selg
     c   47              movel     b2fis1        w_lkat
     c   48              movel     b2fis1        w_levr
     c   49              movel     b2fis1        w_ogrp
     c   50              movel     b2fis1        w_hgrp
     c   51              movel     b2fis1        w_ugrp
     c   52              movel     b2fis1        w_vare
      *
     c     slakl1_key    setll     slakl1
     c                   exsr      xclr01
     c                   exsr      xcrt01
     c                   eval      b2fis1 = *blank
     c                   goto      b2tagb
     c                   endif
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Behandling av subfile                                           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
      * Sjekk om valg er foretatt i subfile
      *
     c                   do        ssrn01
     c                   readc     b1sfl                                  16
     c                   if        *in16 = *on
     c                   leave
     c                   endif
      *
      * Vise post
      *
     c                   if        b1valg = ' 5' or
     c                             b1valg = '5 '
      *
     c                   move      b1vis1        c5vis1
     c                   move      b1vis2        c5vis2
     c                   move      b1vis3        c5vis3
      *
     c                   move      b1avde        w_avde
     c                   move      b1lage        w_lage
     c                   move      b1otyp        w_otyp
     c                   move      b1land        w_land
     c                   move      b1dist        w_dist
     c                   move      b1selg        w_selg
     c                   move      b1lkat        w_lkat
     c                   move      b1ldor        w_levr
     c                   move      b1ogrp        w_ogrp
     c                   move      b1hgrp        w_hgrp
     c                   move      b1ugrp        w_ugrp
     c                   move      b1vare        w_vare
     c                   exsr      xc5bld
     c                   iter
     c                   endif
      *
     c                   enddo
      *
     c                   goto      b2taga
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * C5BLD Behandle bilde for ny - endring - vise                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     xc5bld        begsr
      *
     c     c5tagb        tag
      *
     c                   exsr      xc5les
      *
     c     c5tagc        tag
      *
     c                   exfmt     c5bld
      *
      * Endre kolonne
      *
     c     *inki         ifeq      *on
     c                   EXSR      xv1win
     c                   goto      c5tagb
     c                   endif
      *
      * Forrige år
      *
     c     *inke         ifeq      *on
     c                   SUB       1             v1aar1
     c                   SUB       1             v1aar2
     c                   SUB       1             v1aar3
     c                   goto      c5tagb
     c                   endif
      *
      * Neste år
      *
     c     *inkf         ifeq      *on
     c                   ADD       1             v1aar1
     c                   ADD       1             v1aar2
     c                   ADD       1             v1aar3
     c                   goto      c5tagb
     c                   endif
      *
      * Flere kommandotaster
      *
     c     *inky         ifeq      *on
     c     wc5cmd        ifeq      3
     c                   move      1             wc5cmd
     c                   else
     c                   ADD       1             wc5cmd
     c                   endif
      *
     c                   move      *blank        c5cmd1
     c                   move      *blank        c5cmd2
     c                   move      *blank        c5cmd3
     c                   move      *blank        c5cmd4
      *
     c     wc5cmd        ifeq      1
     c                   move      cmd(3)        c5cmd1
     c                   move      cmd(5)        c5cmd2
     c                   move      cmd(6)        c5cmd3
     c                   move      cmd(09)       c5cmd4
     c                   else
     c     wc5cmd        ifeq      2
     c                   move      cmd(6)        c5cmd1
     c                   move      cmd(14)       c5cmd4
     c                   else
     c     wc5cmd        ifeq      3
     c                   move      cmd(9)        c5cmd1
     c                   move      cmd(13)       c5cmd3
     c                   move      cmd(14)       c5cmd4
     c                   endif
     c                   endif
     c                   endif
     c                   goto      c5tagc
     c                   endif
      *
     c     *inkc         cabeq     *on           c5tag1
     c     *inkl         cabeq     *on           c5tag1
     c     *in30         cabeq     *on           c5tag1
      *
     c     c5tag1        tag
      *
     c                   if        b1valg = ' 5' or
     c                             b1valg = '5 '
     c                   move      srrn01        svrn01
     c                   eval      b1valg = *blank
     c                   update    b1sfl
     c                   endif
      *
     c                   eval      b2fis1 = *blank
     c                   move      *off          *in30
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * V1WIN Behandle bilde for endring av kolonne                     *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     xv1win        begsr
      *
     c                   z-add     9             wactli
     c                   z-add     40            wactpo
     c                   exfmt     v1win
      *
     c                   move      v1aar4        b2hhaa
      *
     c     *inkc         cabeq     *on           v1tag1
     c     *inkl         cabeq     *on           v1tag1
      *
     c     v1tag1        tag
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * XC5LES Leser file og flytter felter til C5BLD                   *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     xc5les        begsr
      *
      * 0-Stiller hele skjermbilde
      *
     c                   move      c5txt1        wstxt1
     c                   move      c5txt2        wstxt2
     c                   move      c5txt3        wstxt3
     c                   move      c5vis1        wsvis1
     c                   move      c5vis2        wsvis2
     c                   move      c5vis3        wsvis3
     c                   move      c5cmd1        wscmd1
     c                   move      c5cmd2        wscmd2
     c                   move      c5cmd3        wscmd3
     c                   move      c5cmd4        wscmd4
      *
     c                   clear                   c5bld
      *
     c                   move      wstxt1        c5txt1
     c                   move      wstxt2        c5txt2
     c                   move      wstxt3        c5txt3
     c                   move      wsvis1        c5vis1
     c                   move      wsvis2        c5vis2
     c                   move      wsvis3        c5vis3
     c                   move      wscmd1        c5cmd1
     c                   move      wscmd2        c5cmd2
     c                   move      wscmd3        c5cmd3
     c                   move      wscmd4        c5cmd4
      *
      * Legger opp heading over fire kolonner
      *
     c     v1inh1        ifeq      'S'
     c                   movel     txt(5)        c5hed1
     c                   move      1             wk1typ
     c                   else
     c     v1inh1        ifeq      'B'
     c                   movel     txt(6)        c5hed1
     c                   move      3             wk1typ
     c                   else
     c     v1inh1        ifeq      'A'
     c                   movel     txt(7)        c5hed1
     c                   move      4             wk1typ
     c                   endif
     c                   endif
     c                   endif
      *
     c     v1inh2        ifeq      'S'
     c                   movel     txt(5)        c5hed2
     c                   move      1             wk2typ
     c                   else
     c     v1inh2        ifeq      'B'
     c                   movel     txt(6)        c5hed2
     c                   move      3             wk2typ
     c                   else
     c     v1inh2        ifeq      'A'
     c                   movel     txt(7)        c5hed2
     c                   move      4             wk2typ
     c                   endif
     c                   endif
     c                   endif
      *
     c     v1inh3        ifeq      'S'
     c                   movel     txt(5)        c5hed3
     c                   move      1             wk3typ
     c                   else
     c     v1inh3        ifeq      'B'
     c                   movel     txt(6)        c5hed3
     c                   move      3             wk3typ
     c                   else
     c     v1inh3        ifeq      'A'
     c                   movel     txt(7)        c5hed3
     c                   move      4             wk3typ
     c                   endif
     c                   endif
     c                   endif
      *
     c     v1inh4        ifeq      'S'
     c                   movel     txt(5)        c5hed4
     c                   move      1             wk4typ
     c                   else
     c     v1inh4        ifeq      'B'
     c                   movel     txt(6)        c5hed4
     c                   move      3             wk4typ
     c                   else
     c     v1inh4        ifeq      'A'
     c                   movel     txt(7)        c5hed4
     c                   move      4             wk4typ
     c                   endif
     c                   endif
     c                   endif
      *
      * Legger opp årstall i de fire kolonner
      *
     c                   movel     v1aar1        wk1hlp
     c                   movel     v1aar2        wk2hlp
     c                   movel     v1aar3        wk3hlp
     c                   movel     v1aar4        wk4hlp
     c                   move      wk1hlp        c5hed1
     c                   move      wk2hlp        c5hed2
     c                   move      wk3hlp        c5hed3
     c                   move      wk4hlp        c5hed4
      *
      * Henter data inn fra saldomatrise og plasserer i skjermbildet
      *
      * Kolonne 1
      *
     c                   move      v1aar1        w_hhaa
     c     key01         chain     slbul1                             60
      *
     c     slakl1_key    chain     slakl1r                            63
      *
     c     v1inh1        ifeq      'B'
     c     w_sabe        ifeq      1
     c     *in60         ifeq      *off
     c                   z-add     isa(1)        c5k101
     c                   z-add     isa(2)        c5k102
     c                   z-add     isa(3)        c5k103
     c                   z-add     isa(4)        c5k104
     c                   z-add     isa(5)        c5k105
     c                   z-add     isa(6)        c5k106
     c                   z-add     isa(7)        c5k107
     c                   z-add     isa(8)        c5k108
     c                   z-add     isa(9)        c5k109
     c                   z-add     isa(10)       c5k110
     c                   z-add     isa(11)       c5k111
     c                   z-add     isa(12)       c5k112
     c                   xfoot     isa           c5k114
     c                   endif
     c                   endif
      *
     c     w_sabe        ifeq      2
      *
     c     *in60         ifeq      *off
     c                   z-add     isa(1)        c5k101
     c     c5k101        add       isa(2)        c5k102
     c     c5k102        add       isa(3)        c5k103
     c     c5k103        add       isa(4)        c5k104
     c     c5k104        add       isa(5)        c5k105
     c     c5k105        add       isa(6)        c5k106
     c     c5k106        add       isa(7)        c5k107
     c     c5k107        add       isa(8)        c5k108
     c     c5k108        add       isa(9)        c5k109
     c     c5k109        add       isa(10)       c5k110
     c     c5k110        add       isa(11)       c5k111
     c     c5k111        add       isa(12)       c5k112
     c                   z-add     c5k112        c5k114
     c                   endif
     c                   endif
     c                   else
     c     w_sabe        ifeq      1
     c     *in63         ifeq      *off
     c     wiaabb        ifeq      'B'
     c                   z-add     ssa(1)        c5k101
     c                   z-add     ssa(2)        c5k102
     c                   z-add     ssa(3)        c5k103
     c                   z-add     ssa(4)        c5k104
     c                   z-add     ssa(5)        c5k105
     c                   z-add     ssa(6)        c5k106
     c                   z-add     ssa(7)        c5k107
     c                   z-add     ssa(8)        c5k108
     c                   z-add     ssa(9)        c5k109
     c                   z-add     ssa(10)       c5k110
     c                   z-add     ssa(11)       c5k111
     c                   z-add     ssa(12)       c5k112
     c                   xfoot     ssa           c5k114
     c                   endif
     c                   endif
     c                   endif
     c                   endif
      *
     c     w_sabe        ifeq      2
      *
     c     *in63         ifeq      *off
     c     wiaabb        ifeq      'B'
     c                   z-add     ssa(1)        c5k101
     c     c5k101        add       ssa(2)        c5k102
     c     c5k102        add       ssa(3)        c5k103
     c     c5k103        add       ssa(4)        c5k104
     c     c5k104        add       ssa(5)        c5k105
     c     c5k105        add       ssa(6)        c5k106
     c     c5k106        add       ssa(7)        c5k107
     c     c5k107        add       ssa(8)        c5k108
     c     c5k108        add       ssa(9)        c5k109
     c     c5k109        add       ssa(10)       c5k110
     c     c5k110        add       ssa(11)       c5k111
     c     c5k111        add       ssa(12)       c5k112
     c                   z-add     c5k112        c5k114
     c                   endif
     c                   endif
     c                   endif
      *
      * Kolonne 2
      *
     c                   move      v1aar2        w_hhaa
     c     key01         chain     slbul1                             60
      *
     c     slakl1_key    chain     slakl1r                            63
      *
     c     v1inh2        ifeq      'B'
     c     w_sabe        ifeq      1
     c     *in60         ifeq      *off
     c                   z-add     isa(1)        c5k201
     c                   z-add     isa(2)        c5k202
     c                   z-add     isa(3)        c5k203
     c                   z-add     isa(4)        c5k204
     c                   z-add     isa(5)        c5k205
     c                   z-add     isa(6)        c5k206
     c                   z-add     isa(7)        c5k207
     c                   z-add     isa(8)        c5k208
     c                   z-add     isa(9)        c5k209
     c                   z-add     isa(10)       c5k210
     c                   z-add     isa(11)       c5k211
     c                   z-add     isa(12)       c5k212
     c                   xfoot     isa           c5k214
     c                   endif
     c                   endif
      *
     c     w_sabe        ifeq      2
     c     *in60         ifeq      *off
     c                   z-add     isa(1)        c5k201
     c     c5k201        add       isa(2)        c5k202
     c     c5k202        add       isa(3)        c5k203
     c     c5k203        add       isa(4)        c5k204
     c     c5k204        add       isa(5)        c5k205
     c     c5k205        add       isa(6)        c5k206
     c     c5k206        add       isa(7)        c5k207
     c     c5k207        add       isa(8)        c5k208
     c     c5k208        add       isa(9)        c5k209
     c     c5k209        add       isa(10)       c5k210
     c     c5k210        add       isa(11)       c5k211
     c     c5k211        add       isa(12)       c5k212
     c                   z-add     c5k212        c5k214
     c                   endif
     c                   endif
     c                   else
     c     w_sabe        ifeq      1
     c     *in63         ifeq      *off
     c     wiaabb        ifeq      'B'
     c                   z-add     ssa(1)        c5k201
     c                   z-add     ssa(2)        c5k202
     c                   z-add     ssa(3)        c5k203
     c                   z-add     ssa(4)        c5k204
     c                   z-add     ssa(5)        c5k205
     c                   z-add     ssa(6)        c5k206
     c                   z-add     ssa(7)        c5k207
     c                   z-add     ssa(8)        c5k208
     c                   z-add     ssa(9)        c5k209
     c                   z-add     ssa(10)       c5k210
     c                   z-add     ssa(11)       c5k211
     c                   z-add     ssa(12)       c5k212
     c                   xfoot     ssa           c5k214
     c                   endif
     c                   endif
     c                   endif
     c                   endif
      *
     c     w_sabe        ifeq      2
      *
     c     *in63         ifeq      *off
     c     wiaabb        ifeq      'B'
     c                   z-add     ssa(1)        c5k201
     c     c5k201        add       ssa(2)        c5k202
     c     c5k202        add       ssa(3)        c5k203
     c     c5k203        add       ssa(4)        c5k204
     c     c5k204        add       ssa(5)        c5k205
     c     c5k205        add       ssa(6)        c5k206
     c     c5k206        add       ssa(7)        c5k207
     c     c5k207        add       ssa(8)        c5k208
     c     c5k208        add       ssa(9)        c5k209
     c     c5k209        add       ssa(10)       c5k210
     c     c5k210        add       ssa(11)       c5k211
     c     c5k211        add       ssa(12)       c5k212
     c                   z-add     c5k212        c5k214
     c                   endif
     c                   endif
     c                   endif
      *
      * Kolonne 3
      *
     c                   move      v1aar3        w_hhaa
     c     key01         chain     slbul1                             60
      *
     c     slakl1_key    chain     slakl1r                            63
      *
     c     v1inh3        ifeq      'B'
     c     w_sabe        ifeq      1
     c     *in60         ifeq      *off
     c                   z-add     isa(1)        c5k301
     c                   z-add     isa(2)        c5k302
     c                   z-add     isa(3)        c5k303
     c                   z-add     isa(4)        c5k304
     c                   z-add     isa(5)        c5k305
     c                   z-add     isa(6)        c5k306
     c                   z-add     isa(7)        c5k307
     c                   z-add     isa(8)        c5k308
     c                   z-add     isa(9)        c5k309
     c                   z-add     isa(10)       c5k310
     c                   z-add     isa(11)       c5k311
     c                   z-add     isa(12)       c5k312
     c                   xfoot     isa           c5k314
     c                   endif
     c                   endif
      *
     c     w_sabe        ifeq      2
     c     *in60         ifeq      *off
     c                   z-add     isa(1)        c5k301
     c     c5k301        add       isa(2)        c5k302
     c     c5k302        add       isa(3)        c5k303
     c     c5k303        add       isa(4)        c5k304
     c     c5k304        add       isa(5)        c5k305
     c     c5k305        add       isa(6)        c5k306
     c     c5k306        add       isa(7)        c5k307
     c     c5k307        add       isa(8)        c5k308
     c     c5k308        add       isa(9)        c5k309
     c     c5k309        add       isa(10)       c5k310
     c     c5k310        add       isa(11)       c5k311
     c     c5k311        add       isa(12)       c5k312
     c                   z-add     c5k312        c5k314
     c                   endif
     c                   endif
     c                   else
     c     w_sabe        ifeq      1
     c     *in63         ifeq      *off
     c     wiaabb        ifeq      'B'
     c                   z-add     ssa(1)        c5k301
     c                   z-add     ssa(2)        c5k302
     c                   z-add     ssa(3)        c5k303
     c                   z-add     ssa(4)        c5k304
     c                   z-add     ssa(5)        c5k305
     c                   z-add     ssa(6)        c5k306
     c                   z-add     ssa(7)        c5k307
     c                   z-add     ssa(8)        c5k308
     c                   z-add     ssa(9)        c5k309
     c                   z-add     ssa(10)       c5k310
     c                   z-add     ssa(11)       c5k311
     c                   z-add     ssa(12)       c5k312
     c                   xfoot     ssa           c5k314
     c                   endif
     c                   endif
     c                   endif
     c                   endif
      *
     c     w_sabe        ifeq      2
      *
     c     *in63         ifeq      *off
     c     wiaabb        ifeq      'B'
     c                   z-add     ssa(1)        c5k301
     c     c5k301        add       ssa(2)        c5k302
     c     c5k302        add       ssa(3)        c5k303
     c     c5k303        add       ssa(4)        c5k304
     c     c5k304        add       ssa(5)        c5k305
     c     c5k305        add       ssa(6)        c5k306
     c     c5k306        add       ssa(7)        c5k307
     c     c5k307        add       ssa(8)        c5k308
     c     c5k308        add       ssa(9)        c5k309
     c     c5k309        add       ssa(10)       c5k310
     c     c5k310        add       ssa(11)       c5k311
     c     c5k311        add       ssa(12)       c5k312
     c                   z-add     c5k312        c5k314
     c                   endif
     c                   endif
     c                   endif
      *
      * Kolonne 4
      *
     c                   move      v1aar4        w_hhaa
     c     key01         chain     slbul1                             60
      *
     c     slakl1_key    chain     slakl1r                            63
      *
     c     v1inh4        ifeq      'B'
     c     w_sabe        ifeq      1
     c     *in60         ifeq      *off
     c                   z-add     isa(1)        c5k401
     c                   z-add     isa(2)        c5k402
     c                   z-add     isa(3)        c5k403
     c                   z-add     isa(4)        c5k404
     c                   z-add     isa(5)        c5k405
     c                   z-add     isa(6)        c5k406
     c                   z-add     isa(7)        c5k407
     c                   z-add     isa(8)        c5k408
     c                   z-add     isa(9)        c5k409
     c                   z-add     isa(10)       c5k410
     c                   z-add     isa(11)       c5k411
     c                   z-add     isa(12)       c5k412
     c                   xfoot     isa           c5k414
     c                   endif
     c                   endif
      *
     c     w_sabe        ifeq      2
     c     *in60         ifeq      *off
     c                   z-add     isa(1)        c5k401
     c     c5k401        add       isa(2)        c5k402
     c     c5k402        add       isa(3)        c5k403
     c     c5k403        add       isa(4)        c5k404
     c     c5k404        add       isa(5)        c5k405
     c     c5k405        add       isa(6)        c5k406
     c     c5k406        add       isa(7)        c5k407
     c     c5k407        add       isa(8)        c5k408
     c     c5k408        add       isa(9)        c5k409
     c     c5k409        add       isa(10)       c5k410
     c     c5k410        add       isa(11)       c5k411
     c     c5k411        add       isa(12)       c5k412
     c                   z-add     c5k412        c5k414
     c                   endif
     c                   endif
     c                   else
     c     w_sabe        ifeq      1
     c     *in63         ifeq      *off
     c     wiaabb        ifeq      'B'
     c                   z-add     ssa(1)        c5k401
     c                   z-add     ssa(2)        c5k402
     c                   z-add     ssa(3)        c5k403
     c                   z-add     ssa(4)        c5k404
     c                   z-add     ssa(5)        c5k405
     c                   z-add     ssa(6)        c5k406
     c                   z-add     ssa(7)        c5k407
     c                   z-add     ssa(8)        c5k408
     c                   z-add     ssa(9)        c5k409
     c                   z-add     ssa(10)       c5k410
     c                   z-add     ssa(11)       c5k411
     c                   z-add     ssa(12)       c5k412
     c                   xfoot     ssa           c5k414
     c                   endif
     c                   endif
     c                   endif
     c                   endif
      *
     c     w_sabe        ifeq      2
      *
     c     *in63         ifeq      *off
     c     wiaabb        ifeq      'B'
     c                   z-add     ssa(1)        c5k401
     c     c5k301        add       ssa(2)        c5k402
     c     c5k302        add       ssa(3)        c5k403
     c     c5k303        add       ssa(4)        c5k404
     c     c5k304        add       ssa(5)        c5k405
     c     c5k305        add       ssa(6)        c5k406
     c     c5k306        add       ssa(7)        c5k407
     c     c5k307        add       ssa(8)        c5k408
     c     c5k308        add       ssa(9)        c5k409
     c     c5k309        add       ssa(10)       c5k410
     c     c5k310        add       ssa(11)       c5k411
     c     c5k311        add       ssa(12)       c5k412
     c                   z-add     c5k312        c5k414
     c                   endif
     c                   endif
     c                   endif
      *
      * Beregn % avvik
      *
     c                   eval      w_pros = 0
     c                   eval      c5mp01 = 0
     c                   eval      c5mp02 = 0
     c                   eval      c5mp03 = 0
     c                   eval      c5mp04 = 0
     c                   eval      c5mp05 = 0
     c                   eval      c5mp06 = 0
     c                   eval      c5mp07 = 0
     c                   eval      c5mp08 = 0
     c                   eval      c5mp09 = 0
     c                   eval      c5mp10 = 0
     c                   eval      c5mp11 = 0
     c                   eval      c5mp12 = 0
      *
     c     c5k301        ifne      0
     c     c5k401        ifne      0
     c                   eval(h)   w_pros = c5k301/c5k401*100
     c                   z-add     w_pros        c5mp01
     c                   endif
     c                   endif
      *
     c     c5k302        ifne      0
     c     c5k402        ifne      0
     c                   eval(h)   w_pros = c5k302/c5k402*100
     c                   z-add     w_pros        c5mp02
     c                   endif
     c                   endif
      *
     c     c5k303        ifne      0
     c     c5k403        ifne      0
     c                   eval(h)   w_pros = c5k303/c5k403*100
     c                   z-add     w_pros        c5mp03
     c                   endif
     c                   endif
      *
     c     c5k304        ifne      0
     c     c5k404        ifne      0
     c                   eval(h)   w_pros = c5k304/c5k404*100
     c                   z-add     w_pros        c5mp04
     c                   endif
     c                   endif
      *
     c     c5k305        ifne      0
     c     c5k405        ifne      0
     c                   eval(h)   w_pros = c5k305/c5k405*100
     c                   z-add     w_pros        c5mp05
     c                   endif
     c                   endif
      *
     c     c5k306        ifne      0
     c     c5k406        ifne      0
     c                   eval(h)   w_pros = c5k306/c5k406*100
     c                   z-add     w_pros        c5mp06
     c                   endif
     c                   endif
      *
     c     c5k307        ifne      0
     c     c5k407        ifne      0
     c                   eval(h)   w_pros = c5k307/c5k407*100
     c                   z-add     w_pros        c5mp07
     c                   endif
     c                   endif
      *
     c     c5k308        ifne      0
     c     c5k408        ifne      0
     c                   eval(h)   w_pros = c5k308/c5k408*100
     c                   z-add     w_pros        c5mp08
     c                   endif
     c                   endif
      *
     c     c5k309        ifne      0
     c     c5k409        ifne      0
     c                   eval(h)   w_pros = c5k309/c5k409*100
     c                   z-add     w_pros        c5mp09
     c                   endif
     c                   endif
      *
     c     c5k310        ifne      0
     c     c5k410        ifne      0
     c                   eval(h)   w_pros = c5k310/c5k410*100
     c                   z-add     w_pros        c5mp10
     c                   endif
     c                   endif
      *
     c     c5k311        ifne      0
     c     c5k411        ifne      0
     c                   eval(h)   w_pros = c5k301/c5k401*100
     c                   z-add     w_pros        c5mp11
     c                   endif
     c                   endif
      *
     c     c5k312        ifne      0
     c     c5k412        ifne      0
     c                   eval(h)   w_pros = c5k301/c5k401*100
     c                   z-add     w_pros        c5mp12
     c                   endif
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Tøm subfile                                                     *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     xclr01        begsr
      *
     c                   move      *on           *in14
     c                   write     b2ctl
     c                   move      *off          *in14
      *
     c                   move      *off          *in15
     c                   eval      srrn01 = 0
     c                   eval      sfrn01 = 0
     c                   eval      ssrn01 = 0
     c                   eval      spge01 = 0
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Fyll opp subfile                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     xcrt01        begsr
      *
     c                   eval      spge01 = spge01 + 10
     c                   eval      srrn01 = ssrn01
      *
     c                   dou       srrn01 = spge01
      *
     c     les01         tag
      *
     c                   read      slakl1                                 15
      *
     c     *in15         cabeq     *on           xend01
      *
     c                   if        shfirm <> w_firm
     c                   goto      les01
     c                   endif
      *
     c                   if        shhhaa <> w_hhaa
     c                   goto      les01
     c                   endif
      *
     c                   if        shkode <> w_kode
     c                   goto      les01
     c                   endif
      *
     c                   eval      srrn01 = srrn01 + 1
      *
     c                   move      shavde        b1avde
     c                   move      shlage        b1lage
     c                   move      shotyp        b1otyp
     c                   move      shland        b1land
     c                   move      shdist        b1dist
     c                   move      shselg        b1selg
     c                   move      shlkat        b1lkat
     c                   move      shldor        b1ldor
     c                   move      shogrp        b1ogrp
     c                   move      shhgrp        b1hgrp
     c                   move      shugrp        b1ugrp
     c                   move      shvare        b1vare
      *
      * Beregner total budsjett
      *
     c                   if        wiaabb = 'B'
     c                   xfoot     ssa           b1sumb
     c                   endif
     c                   if        wiaabb = 'A'
     c                   xfoot     san           b1sumb
     c                   endif
      *
      * Hent tekster fra tabell
      *
     c                   move      *blank        b1vis1
     c                   move      *blank        b1vis2
     c                   move      *blank        b1vis3
      *
     c                   exsr      hnttxt
      *
     c                   write     b1sfl
     c                   enddo
      *
     c     xend01        tag
      *
     c                   if        srrn01 > ssrn01
     c                   eval      sfrn01 = ssrn01 + 1
     c                   endif
      *
     c                   eval      ssrn01 = srrn01
     c                   eval      svrn01 = sfrn01
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Display subfile                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     xdsp01        begsr
      *
     c                   if        srrn01 <> 0
     c                   move      *on           *in12
     c                   endif
      *
     c                   move      *on           *in13
     c                   exfmt     b2ctl
     c                   move      *off          *in12
     c                   move      *off          *in13
     c                   move      *off          *in22
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Hent opplysninger fra register                                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     hnttxt        begsr
      *
      * (11) Avdeling
      *
     c     r1            ifeq      11
     c                   movel     shavde        p_gkod
     c                   call      'RS707R'
     c                   parm                    p_stat
     c                   parm                    p_gkod
     c                   parm                    p_tx20
     c                   eval      b1vis1 = %trim(%editc(shavde:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
     c     r2            ifeq      11
     c                   movel     shavde        p_gkod
     c                   call      'RS707R'
     c                   parm                    p_stat
     c                   parm                    p_gkod
     c                   parm                    p_tx20
     c                   eval      b1vis2 = %trim(%editc(shavde:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
     c     r3            ifeq      11
     c                   movel     shavde        p_gkod
     c                   call      'RS707R'
     c                   parm                    p_stat
     c                   parm                    p_gkod
     c                   parm                    p_tx20
     c                   eval      b1vis3 = %trim(%editc(shavde:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
      *
      * (12) Lager
      *
     c     r1            ifeq      12
     c                   movel     shlage        p_jkod
     c                   call      'RS710R'
     c                   parm                    p_stat
     c                   parm                    p_jkod
     c                   parm                    p_tx20
     c                   eval      b1vis1 = %trim(%editc(shlage:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
     c     r2            ifeq      12
     c                   movel     shlage        p_jkod
     c                   call      'RS710R'
     c                   parm                    p_stat
     c                   parm                    p_jkod
     c                   parm                    p_tx20
     c                   eval      b1vis2 = %trim(%editc(shlage:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
     c     r3            ifeq      12
     c                   movel     shlage        p_jkod
     c                   call      'RS710R'
     c                   parm                    p_stat
     c                   parm                    p_jkod
     c                   parm                    p_tx20
     c                   eval      b1vis3 = %trim(%editc(shlage:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
      *
      * (13) Ordretype
      *
     c     r1            ifeq      13
     c                   movel     shotyp        votyl1_otyp
     c     votyl1_key    chain     votyl1
     c                   eval      b1vis1 = %trim(shotyp) +
     c                                      ' ' + %trim(vaotxt)
     c                   endif
     c     r2            ifeq      13
     c                   movel     shotyp        votyl1_otyp
     c     votyl1_key    chain     votyl1
     c                   eval      b1vis2 = %trim(shotyp) +
     c                                      ' ' + %trim(vaotxt)
     c                   endif
     c     r3            ifeq      13
     c                   movel     shotyp        votyl1_otyp
     c     votyl1_key    chain     votyl1
     c                   eval      b1vis3 = %trim(shotyp) +
     c                                      ' ' + %trim(vaotxt)
     c                   endif
      *
      * (21) Land
      *
     c     r1            ifeq      21
     c                   movel     shland        p_lkod
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_lkod
     c                   parm                    p_tx20
     c                   eval      b1vis1 = %trim(shland) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
     c     r2            ifeq      21
     c                   movel     shland        p_lkod
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_lkod
     c                   parm                    p_tx20
     c                   eval      b1vis2 = %trim(shland) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
     c     r3            ifeq      21
     c                   movel     shland        p_lkod
     c                   call      'RS711R'
     c                   parm                    p_stat
     c                   parm                    p_lkod
     c                   parm                    p_tx20
     c                   eval      b1vis3 = %trim(shland) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
      *
      * (22) Distrikt
      *
     c     r1            ifeq      22
     c                   movel     shdist        p_hkod
     c                   call      'RS708R'
     c                   parm                    p_stat
     c                   parm                    p_hkod
     c                   parm                    p_tx20
     c                   eval      b1vis1 = %trim(%editc(shdist:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
     c     r2            ifeq      22
     c                   movel     shdist        p_hkod
     c                   call      'RS708R'
     c                   parm                    p_stat
     c                   parm                    p_hkod
     c                   parm                    p_tx20
     c                   eval      b1vis2 = %trim(%editc(shdist:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
     c     r3            ifeq      22
     c                   movel     shdist        p_hkod
     c                   call      'RS708R'
     c                   parm                    p_stat
     c                   parm                    p_hkod
     c                   parm                    p_tx20
     c                   eval      b1vis3 = %trim(%editc(shdist:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
      *
      * (23) Selger
      *
     c     r1            ifeq      23
     c                   movel     shselg        p_ikod
     c                   call      'RS709R'
     c                   parm                    p_stat
     c                   parm                    p_ikod
     c                   parm                    p_tx20
     c                   eval      b1vis1 = %trim(%editc(shselg:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
     c     r2            ifeq      23
     c                   movel     shselg        p_ikod
     c                   call      'RS709R'
     c                   parm                    p_stat
     c                   parm                    p_ikod
     c                   parm                    p_tx20
     c                   eval      b1vis2 = %trim(%editc(shselg:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
     c     r3            ifeq      23
     c                   movel     shselg        p_ikod
     c                   call      'RS709R'
     c                   parm                    p_stat
     c                   parm                    p_ikod
     c                   parm                    p_tx20
     c                   eval      b1vis3 = %trim(%editc(shselg:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
      *
      * (24) Kundekategori
      *
     c     r1            ifeq      24
     c                   movel     shlkat        p_kkod
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_tx20
     c                   eval      b1vis1 = %trim(%editc(shlkat:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
     c     r2            ifeq      24
     c                   movel     shlkat        p_lkod
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_tx20
     c                   eval      b1vis2 = %trim(%editc(shlkat:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
     c     r3            ifeq      24
     c                   movel     shlkat        p_kkod
     c                   call      'RS714R'
     c                   parm                    p_stat
     c                   parm                    p_kkod
     c                   parm                    p_tx20
     c                   eval      b1vis3 = %trim(%editc(shlkat:'Z')) +
     c                                      ' ' + %trim(p_tx20)
     c                   endif
      *
      * (25) Leverandør
      *
     c     r1            ifeq      25
     c                   movel     shldor        rlevl1_levr
     c     rlevl1_key    chain     rlevl1
     c                   eval      b1vis1 = %trim(%editc(shldor:'Z')) +
     c                                      ' ' + %trim(rlnavn)
     c                   endif
     c     r2            ifeq      25
     c                   movel     shldor        rlevl1_levr
     c     rlevl1_key    chain     rlevl1
     c                   eval      b1vis2 = %trim(%editc(shldor:'Z')) +
     c                                      ' ' + %trim(rlnavn)
     c                   endif
     c     r3            ifeq      25
     c                   movel     shldor        rlevl1_levr
     c     rlevl1_key    chain     rlevl1
     c                   eval      b1vis3 = %trim(%editc(shldor:'Z')) +
     c                                      ' ' + %trim(rlnavn)
     c                   endif
      *
      * (31) Overgruppe
      *
     c     r1            ifeq      31
     c                   movel     shogrp        vogrl1_oogr
     c     vogrl1_key    chain     vogrl1
     c                   eval      b1vis1 = %trim(%editc(shogrp:'Z')) +
     c                                      ' ' + %trim(vgotxt)
     c                   endif
     c     r2            ifeq      31
     c                   movel     shogrp        vogrl1_oogr
     c     vogrl1_key    chain     vogrl1
     c                   eval      b1vis2 = %trim(%editc(shogrp:'Z')) +
     c                                      ' ' + %trim(vgotxt)
     c                   endif
     c     r3            ifeq      31
     c                   movel     shogrp        vogrl1_oogr
     c     vogrl1_key    chain     vogrl1
     c                   eval      b1vis3 = %trim(%editc(shogrp:'Z')) +
     c                                      ' ' + %trim(vgotxt)
     c                   endif
      *
      * (32) Hovedgruppe
      *
     c     r1            ifeq      32
     c                   movel     shogrp        vhgrl1_hogr
     c                   movel     shhgrp        vhgrl1_hhgr
     c     vhgrl1_key    chain     vhgrl1
     c                   eval      b1vis1 = %trim(%editc(shhgrp:'Z')) +
     c                                      ' ' + %trim(vghtxt)
     c                   endif
     c     r2            ifeq      32
     c                   movel     shogrp        vhgrl1_hogr
     c                   movel     shhgrp        vhgrl1_hhgr
     c     vhgrl1_key    chain     vhgrl1
     c                   eval      b1vis2 = %trim(%editc(shhgrp:'Z')) +
     c                                      ' ' + %trim(vghtxt)
     c                   endif
     c     r3            ifeq      32
     c                   movel     shogrp        vhgrl1_hogr
     c                   movel     shhgrp        vhgrl1_hhgr
     c     vhgrl1_key    chain     vhgrl1
     c                   eval      b1vis3 = %trim(%editc(shhgrp:'Z')) +
     c                                      ' ' + %trim(vghtxt)
     c                   endif
      *
      * (33) Undergruppe
      *
     c     r1            ifeq      33
     c                   movel     shogrp        vugrl1_uogr
     c                   movel     shhgrp        vugrl1_uhgr
     c                   movel     shugrp        vugrl1_uugr
     c     vugrl1_key    chain     vugrl1
     c                   eval      b1vis1 = %trim(%editc(shugrp:'Z')) +
     c                                      ' ' + %trim(vgutxt)
     c                   endif
     c     r2            ifeq      33
     c                   movel     shogrp        vugrl1_uogr
     c                   movel     shhgrp        vugrl1_uhgr
     c                   movel     shugrp        vugrl1_uugr
     c     vugrl1_key    chain     vugrl1
     c                   eval      b1vis2 = %trim(%editc(shugrp:'Z')) +
     c                                      ' ' + %trim(vgutxt)
     c                   endif
     c     r3            ifeq      33
     c                   movel     shogrp        vugrl1_uogr
     c                   movel     shhgrp        vugrl1_uhgr
     c                   movel     shugrp        vugrl1_uugr
     c     vugrl1_key    chain     vugrl1
     c                   eval      b1vis3 = %trim(%editc(shugrp:'Z')) +
     c                                      ' ' + %trim(vgutxt)
     c                   endif
      *
      * (34) Vare
      *
     c     r1            ifeq      34
     c                   movel     shvare        vvarl1_vare
     c     vvarl1_key    chain     vvarl1
     c                   eval      b1vis1 = %trim(shvare) +
     c                                      ' ' + %trim(vvtek1)
     c                   endif
     c     r2            ifeq      34
     c                   movel     shvare        vvarl1_vare
     c     vvarl1_key    chain     vvarl1
     c                   eval      b1vis2 = %trim(shvare) +
     c                                      ' ' + %trim(vvtek1)
     c                   endif
     c     r3            ifeq      34
     c                   movel     shvare        vvarl1_vare
     c     vvarl1_key    chain     vvarl1
     c                   eval      b1vis3 = %trim(shvare) +
     c                                      ' ' + %trim(vvtek1)
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * henter nummer verdier fra array                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     hntarr        begsr
      *
     c                   move      *zero         r1
     c                   move      *zero         r2
     c                   move      *zero         r3
      *
      * (11)
      *
     c     w_kode_11     ifeq      1
     c                   move      11            r1
     c                   move      *on           *in41
     c                   endif
     c     w_kode_11     ifeq      2
     c                   move      11            r2
     c                   move      *on           *in41
     c                   endif
     c     w_kode_11     ifeq      3
     c                   move      11            r3
     c                   move      *on           *in41
     c                   endif
      *
      * (12)
      *
     c     w_kode_12     ifeq      1
     c                   move      12            r1
     c                   move      *on           *in42
     c                   endif
     c     w_kode_12     ifeq      2
     c                   move      12            r2
     c                   move      *on           *in42
     c                   endif
     c     w_kode_12     ifeq      3
     c                   move      12            r3
     c                   move      *on           *in42
     c                   endif
      *
      * (13)
      *
     c     w_kode_13     ifeq      1
     c                   move      13            r1
     c                   move      *on           *in43
     c                   endif
     c     w_kode_13     ifeq      2
     c                   move      13            r2
     c                   move      *on           *in43
     c                   endif
     c     w_kode_13     ifeq      3
     c                   move      13            r3
     c                   move      *on           *in43
     c                   endif
      *
      * (21)
      *
     c     w_kode_21     ifeq      1
     c                   move      21            r1
     c                   move      *on           *in44
     c                   endif
     c     w_kode_21     ifeq      2
     c                   move      21            r2
     c                   move      *on           *in44
     c                   endif
     c     w_kode_21     ifeq      3
     c                   move      21            r3
     c                   move      *on           *in44
     c                   endif
      *
      * (22)
      *
     c     w_kode_22     ifeq      1
     c                   move      22            r1
     c                   move      *on           *in45
     c                   endif
     c     w_kode_22     ifeq      2
     c                   move      22            r2
     c                   move      *on           *in45
     c                   endif
     c     w_kode_22     ifeq      3
     c                   move      22            r3
     c                   move      *on           *in45
     c                   endif
      *
      * (23)
      *
     c     w_kode_23     ifeq      1
     c                   move      23            r1
     c                   move      *on           *in46
     c                   endif
     c     w_kode_23     ifeq      2
     c                   move      23            r2
     c                   move      *on           *in46
     c                   endif
     c     w_kode_23     ifeq      3
     c                   move      23            r3
     c                   move      *on           *in46
     c                   endif
      *
      * (24)
      *
     c     w_kode_24     ifeq      1
     c                   move      24            r1
     c                   move      *on           *in47
     c                   endif
     c     w_kode_24     ifeq      2
     c                   move      24            r2
     c                   move      *on           *in47
     c                   endif
     c     w_kode_24     ifeq      3
     c                   move      24            r3
     c                   move      *on           *in47
     c                   endif
      *
      * (25)
      *
     c     w_kode_25     ifeq      1
     c                   move      25            r1
     c                   move      *on           *in48
     c                   endif
     c     w_kode_25     ifeq      2
     c                   move      25            r2
     c                   move      *on           *in48
     c                   endif
     c     w_kode_25     ifeq      3
     c                   move      25            r3
     c                   move      *on           *in48
     c                   endif
      *
      * (31)
      *
     c     w_kode_31     ifeq      1
     c                   move      31            r1
     c                   move      *on           *in49
     c                   endif
     c     w_kode_31     ifeq      2
     c                   move      31            r2
     c                   move      *on           *in49
     c                   endif
     c     w_kode_31     ifeq      3
     c                   move      31            r3
     c                   move      *on           *in49
     c                   endif
      *
      * (32)
      *
     c     w_kode_32     ifeq      1
     c                   move      32            r1
     c                   move      *on           *in50
     c                   endif
     c     w_kode_32     ifeq      2
     c                   move      32            r2
     c                   move      *on           *in50
     c                   endif
     c     w_kode_32     ifeq      3
     c                   move      32            r3
     c                   move      *on           *in50
     c                   endif
      *
      * (33)
      *
     c     w_kode_33     ifeq      1
     c                   move      33            r1
     c                   move      *on           *in51
     c                   endif
     c     w_kode_33     ifeq      2
     c                   move      33            r2
     c                   move      *on           *in51
     c                   endif
     c     w_kode_33     ifeq      3
     c                   move      33            r3
     c                   move      *on           *in51
     c                   endif
      *
      * (34)
      *
     c     w_kode_34     ifeq      1
     c                   move      34            r1
     c                   move      *on           *in52
     c                   endif
     c     w_kode_34     ifeq      2
     c                   move      34            r2
     c                   move      *on           *in52
     c                   endif
     c     w_kode_34     ifeq      3
     c                   move      34            r3
     c                   move      *on           *in52
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     *inzsr        begsr
      *
     c                   z-add     0             wactli            2 0
     c                   z-add     0             wactpo            3 0
      *
     c                   z-add     0             w_pros           13 3
      *
     c                   move      *zero         wk1typ            1 0
     c                   move      *zero         wk2typ            1 0
     c                   move      *zero         wk3typ            1 0
     c                   move      *zero         wk4typ            1 0
     c                   move      *zero         n                 2 0
     c                   move      *zero         wc5cmd            1 0
     c                   move      *zero         w_sabe            1 0
     c                   move      *blank        wk1hlp            5
     c                   move      *blank        wk2hlp            5
     c                   move      *blank        wk3hlp            5
     c                   move      *blank        wk4hlp            5
      *
     c                   move      *zero         akkpro            9 6
     c                   move      *zero         akkbel           13 0
     c                   move      *zero         work0            13 0
     c                   move      *zero         work2            11 0
     c                   move      *zero         w2rper            2 0
      *
      * Ta vare på verdier for gjennbruk etter bruk av Clear i bilde c5
      *
     c     *like         define    c5txt1        wstxt1
     c     *like         define    c5txt2        wstxt2
     c     *like         define    c5txt3        wstxt3
     c     *like         define    c5vis1        wsvis1
     c     *like         define    c5vis2        wsvis2
     c     *like         define    c5vis3        wsvis3
      *
     c     *like         define    c5cmd1        wscmd1
     c     *like         define    c5cmd2        wscmd2
     c     *like         define    c5cmd3        wscmd3
     c     *like         define    c5cmd4        wscmd4
      *
     c     *like         define    scvers        w_type
      *
      * Key for oppdatering av KUNDE-AKKUMULERINGS-REGISTER
      *
     c     slakl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_hhaa
     c                   kfld                    w_kode
     c                   kfld                    w_avde
     c                   kfld                    w_lage
     c                   kfld                    w_otyp
     c                   kfld                    w_land
     c                   kfld                    w_dist
     c                   kfld                    w_selg
     c                   kfld                    w_lkat
     c                   kfld                    w_levr
     c                   kfld                    w_ogrp
     c                   kfld                    w_hgrp
     c                   kfld                    w_ugrp
     c                   kfld                    w_vare
      *
      * Key for file nummerisk
      *
     c     key01         klist
     c                   kfld                    w_firm
     c                   kfld                    w_hhaa
     c                   kfld                    w_vers
     c                   kfld                    w_kode
     c                   kfld                    w_aabb
     c                   kfld                    w_avde
     c                   kfld                    w_lage
     c                   kfld                    w_otyp
     c                   kfld                    w_land
     c                   kfld                    w_dist
     c                   kfld                    w_selg
     c                   kfld                    w_lkat
     c                   kfld                    w_levr
     c                   kfld                    w_ogrp
     c                   kfld                    w_hgrp
     c                   kfld                    w_ugrp
     c                   kfld                    w_vare
      *
      * Key for sletting
      *
     c     key02         klist
     c                   kfld                    w_firm
     c                   kfld                    w_hhaa
     c                   kfld                    w_vers
     c                   kfld                    w_kode
     c                   kfld                    w_aabb
     c                   kfld                    w_avde
     c                   kfld                    w_lage
     c                   kfld                    w_otyp
     c                   kfld                    w_land
     c                   kfld                    w_dist
     c                   kfld                    w_selg
     c                   kfld                    w_lkat
     c                   kfld                    w_levr
     c                   kfld                    w_ogrp
     c                   kfld                    w_hgrp
     c                   kfld                    w_ugrp
     c                   kfld                    w_vare
      *
      * Key for posisjonering på ordretype
      *
     c     votyl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    votyl1_otyp
      *
      * Key for posisjonering på overgruppe
      *
     c     vogrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vogrl1_oogr
      *
      * Key for posisjonering på hovedgruppe
      *
     c     vhgrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vhgrl1_hogr
     c                   kfld                    vhgrl1_hhgr
      *
      * Key for posisjonering på undergruppe
      *
     c     vugrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vugrl1_uogr
     c                   kfld                    vugrl1_uhgr
     c                   kfld                    vugrl1_uugr
      *
      * Key for posisjonering på kunde
      *
     c     rlevl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rlevl1_levr
      *
      * Key for posisjonering på vare
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarl1_vare
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Tar inn parameter fra forrige program                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *ENTRY        PLIST
     c                   parm                    wihhaa            4 0
     c                   parm                    wivers            2
     c                   parm                    wikode           12
     c                   parm                    wiaabb            1
      *
     c                   move      l_firm        w_firm
      *
     c                   eval      l_fnav = l_fnav
      *
     c                   move      wihhaa        w_hhaa
     c                   move      wivers        w_vers
     c                   move      wikode        w_kode
     c                   move      wiaabb        w_aabb
      *
     c                   move      wikode        w_kode_nn
      *
      * Legger inn faste tekster
      *
     c                   move      wihhaa        b2hhaa
      *
     c                   move      wivers        b2vers
      *
      * Legge inn kode som viser første sett av kommandotaster
      *
     c                   move      1             wc5cmd
     c                   move      cmd(3)        c5cmd1
     c                   move      cmd(5)        c5cmd2
     c                   move      cmd(6)        c5cmd3
     c                   move      cmd(14)       c5cmd4
      *
      * Legger inn tekster for Antall/Beløp
      *
     c                   move      'BELØP '      b2aabb
      *
     c     wiaabb        ifeq      'A'
     c                   move      'ANTALL'      b2aabb
     c                   endif
      *
      * Legge inn kode for saldo/bevegelse
      *
     c                   move      1             w_sabe
      *
      * Legge inn standard valg for kolonner
      *
     c                   move      'S'           v1inh1
     c                   move      'B'           v1inh2
     c                   move      'S'           v1inh3
     c                   move      'B'           v1inh4
     c     b2hhaa        sub       1             v1aar1
     c     b2hhaa        sub       1             v1aar2
     c                   move      b2hhaa        v1aar3
     c                   move      b2hhaa        v1aar4
      *
      * Hent tekster fra tabell
      *
     c                   move      *blank        b2txt1
     c                   move      *blank        b2txt2
     c                   move      *blank        b2txt3
      *
     c                   exsr      hntarr
      *
     c                   if        r1 > *zeros
     c                   movel     rpt(r1)       b2txt1
     c                   movel     rpt(r1)       c5txt1
     c                   endif
      *
     c                   if        r2 > *zeros
     c                   movel     rpt(r2)       b2txt2
     c                   movel     rpt(r2)       c5txt2
     c                   endif
      *
     c                   if        r3 > *zeros
     c                   movel     rpt(r3)       b2txt3
     c                   movel     rpt(r3)       c5txt3
     c                   endif
      *
     c                   eval      *in21 = *on
     c                   eval      *in22 = *on
      *
     c     slakl1_key    setll     slakl1
      *
     c                   exsr      xcrt01
      *
     c                   endsr
      *
      /eject
      **********************  T A B E L L E R  ***************************
**
  Ny post                  001
  Endring                  002
  Vise                     003
* Slettet *                004
**
Vedlikehold av budsjett    001
   Spørring på saldo       002
                 Budsjett  003
                    Saldo  004
 Salg                      005
 Budsjett                  006
 Alt.                      007
Ledig ...                  008
**
Ledig ...                  001
Ledig ...                  002
F3=Gå tilbake              003
Ledig ...                  004
F5=Forrige år              005
F6=Neste år                006
Ledig ...                  007
Ledig ...                  008
F9=Endre kolonne           009
Ledig ...                  010
Ledig ...                  011
Ledig ...                  012
Ledig ...                  013
F24=Flere taster           014
**  SORTERINGSREKKEFØLGE
Ledig                      01
Ledig                      02
Ledig                      03
Ledig                      04
Ledig                      05
Ledig                      06
Ledig                      07
Ledig                      08
Ledig                      09
Ledig                      10
Avdeling                   11
Lager                      12
Ordre-type                 13
Ledig                      14
Ledig                      15
Ledig                      16
Ledig                      17
Ledig                      18
Ledig                      19
Ledig                      20
Land                       21
Distrikt                   22
Selger                     23
Lev. kategori              24
Lev. nummer                25
Ledig                      26
Ledig                      27
Ledig                      28
Ledig                      29
Ledig                      30
Overgruppe                 31
Hovedgruppe                32
Undergruppe                33
Varenummer                 34
Ledig                      35
Ledig                      36
Ledig                      37
Ledig                      38
Ledig                      39
Ledig                      40
Ledig                      41
Ledig                      42
Ledig                      43
Ledig                      44
Ledig                      45
Ledig                      46
Ledig                      47
Ledig                      48
Ledig                      49
Ledig                      50
Ledig                      51
Ledig                      52
Ledig                      53
Ledig                      54
Ledig                      55
Ledig                      56
Ledig                      57
Ledig                      58
Ledig                      59
Ledig                      60
