      /title  ASSTAT: Sletting av budsjett (hele)
     h datedit(*dmy.) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  System. . . . . : ASSTAT                                       *
      *  Program . . . . : SCDELR                                       *
      *  Beskrivelse . . : Sletting av budsjett (hele)                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  Spesialversjon. :                                              *
      *  Tilpasset for . :                                              *
      *                                                                 *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.*
      *  --------- ------  ---------------------------------------------*
      *  V5.40     070405  Nytt program                            KOB  *
      *                                                                 *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fslbul1    if   e           k disk    rename(slbupfr:slbul1r)
     fslbulu    uf   e           k disk    rename(slbupfr:slbulur)
      *
      *
     d                uds
     d dsfirm                944    946  0
      *
     d wwfirm          s                   like(scfirm)
     d wwhhaa          s                   like(schhaa)
     d wwvers          s                   like(scvers)
     d wwkode          s                   like(sckode)
     d wwaabb          s                   like(scaabb)
      *
     d wwavde          s                   like(scavde)
     d wwlage          s                   like(sclage)
     d wwotyp          s                   like(scotyp)
     d wwland          s                   like(scland)
     d wwdist          s                   like(scdist)
     d wwselg          s                   like(scselg)
     d wwlkat          s                   like(sclkat)
     d wwldor          s                   like(scldor)
     d wwogrp          s                   like(scogrp)
     d wwhgrp          s                   like(schgrp)
     d wwugrp          s                   like(scugrp)
     d wwvare          s                   like(scvare)
      *
     d wpfirm          s                   like(scfirm)
     d wpkode          s                   like(sckode)
     d wpaabb          s                   like(scaabb)
     d wphhaa          s                   like(schhaa)
     d wppaar          s                   like(schhaa)
     d wpvers          s                   like(scvers)
     d wppers          s                   like(scvers)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Sletting av budsjett                                           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c                   move      wphhaa        wwhhaa
     c                   move      wpvers        wwvers
      *
     c                   move      *zero         wwavde
     c                   move      *zero         wwlage
     c                   move      *blank        wwotyp
     c                   move      *blank        wwland
     c                   move      *zero         wwdist
     c                   move      *zero         wwselg
     c                   move      *zero         wwlkat
     c                   move      *zero         wwldor
     c                   move      *zero         wwogrp
     c                   move      *zero         wwhgrp
     c                   move      *zero         wwugrp
     c                   move      *blank        wwvare
     c     budkey        setll     slbul1r
      *
     c     TAG02         TAG
     c                   setoff                                           90
     c                   read      slbul1r                                90
      *
     c     *in90         ifeq      *off
     c     wwfirm        ifeq      scfirm
     c     wwhhaa        ifeq      schhaa
     c     wwvers        ifeq      scvers
     c     wwkode        ifeq      sckode
     c     wwaabb        ifeq      scaabb
      *
     c                   move      scavde        wwavde
     c                   move      sclage        wwlage
     c                   move      scotyp        wwotyp
     c                   move      scland        wwland
     c                   move      scdist        wwdist
     c                   move      scselg        wwselg
     c                   move      sclkat        wwlkat
     c                   move      scldor        wwldor
     c                   move      scogrp        wwogrp
     c                   move      schgrp        wwhgrp
     c                   move      scugrp        wwugrp
     c                   move      scvare        wwvare
     c     budkey        chain     slbulur                            92
     c  n92              delete    slbulur
      *
     c                   goto      tag02
     c                   endif
     c                   endif
     c                   endif
     c                   endif
     c                   endif
     c                   endif
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Avslutt program                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     XSLUTT        TAG
      *
     c                   SETON                                        LR
     c                   RETURN
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Subrutine for initiering av program                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     csr   *inzsr        begsr
      *
      * Key for file BUDSJETT-REGISTER
      *
     c     BUDKEY        klist
     c                   kfld                    wwfirm
     c                   kfld                    wwhhaa
     c                   kfld                    wwvers
     c                   kfld                    wwkode
     c                   kfld                    wwaabb
     c                   kfld                    wwavde
     c                   kfld                    wwlage
     c                   kfld                    wwotyp
     c                   kfld                    wwland
     c                   kfld                    wwdist
     c                   kfld                    wwselg
     c                   kfld                    wwlkat
     c                   kfld                    wwldor
     c                   kfld                    wwogrp
     c                   kfld                    wwhgrp
     c                   kfld                    wwugrp
     c                   kfld                    wwvare
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Tar inn parameter fra forrige program                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     *entry        plist
     c                   parm                    wpfirm
     c                   parm                    wpkode
     c                   parm                    wpaabb
     c                   parm                    wphhaa
     c                   parm                    wppaar
     c                   parm                    wpvers
     c                   parm                    wppers
      *
      *  Legger inn firmanummer i nøkklene
      *
     c                   move      wpfirm        wwfirm
      *
      *  Legger inn opplysninger i nøkklene
      *
     c                   move      wpkode        wwkode
     c                   move      wpaabb        wwaabb
      *
     csr                 endsr
