      /title  Danner nytt budsjett utfra register
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASSTAT
      * Program . . . . : SCFILR
      * Beskrivelse . . : Danner nytt budsjett utfra register
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      * V5.40 070405 KOB  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fsinnpf    ip   f  512        disk
      *
     fslbul1    if   e           k disk    rename(slbupfr:slbul1r)
     fslbulu    uf a e           k disk    rename(slbupfr:slbulur)
      *
     frlevl1    if   e           k disk    rename(rlevpfr:rlevl1r)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
      *
     fvhgrl1    if   e           k disk    rename(vhgrpfr:vhgrl1r)
     fvugrl1    if   e           k disk    rename(vugrpfr:vugrl1r)
      *
      * Definering av parameter (inn)
      *
     d                 ds
     d wsparm                        64
     d  wsfirm                        3  0 overlay(wsparm:01)
     d  wshhaa                        4  0 overlay(wsparm:04)
     d  wsvers                        2    overlay(wsparm:08)
     d  wsakod                       12    overlay(wsparm:10)
     d  wsaabb                        1    overlay(wsparm:22)
     d  wskode                       12    overlay(wsparm:23)
      *
      * Redefinering av variable
      *
     d                 ds
     d umtid                         12  0
     d  h1date                        6  0 overlay(umtid:7)
      *
      * Omdefinering av kode
      *
     d wxkode          ds            12
     d wxkode_11                      1  0
     d wxkode_12                      1  0
     d wxkode_13                      1  0
     d wxkode_21                      1  0
     d wxkode_22                      1  0
     d wxkode_23                      1  0
     d wxkode_24                      1  0
     d wxkode_25                      1  0
     d wxkode_31                      1  0
     d wxkode_32                      1  0
     d wxkode_33                      1  0
     d wxkode_34                      1  0
      *
      * Definering av LocalDataArea
      *
     d                uds
     d l_wsid                901    910
     d l_user                        10
      *
     d wwvare          s                   like(vvvare)
     d wwldor          s                   like(rllevr)
     d wwhogr          s                   like(vghogr)
     d wwhhgr          s                   like(vghhgr)
     d wwuogr          s                   like(vguogr)
     d wwuhgr          s                   like(vguhgr)
     d wwuugr          s                   like(vguugr)
      *
      * Definering av variable i nøkler
      *
     d w_hhaa          s                   like(schhaa)
     d w_vers          s                   like(scvers)
     d w_kode          s                   like(sckode)
     d w_aabb          s                   like(scaabb)
      *
     d slbul1_avde     s                   like(scavde)
     d slbul1_lage     s                   like(sclage)
     d slbul1_otyp     s                   like(scotyp)
     d slbul1_land     s                   like(scland)
     d slbul1_dist     s                   like(scdist)
     d slbul1_selg     s                   like(scselg)
     d slbul1_lkat     s                   like(sclkat)
     d slbul1_ldor     s                   like(scldor)
     d slbul1_ogrp     s                   like(scogrp)
     d slbul1_hgrp     s                   like(schgrp)
     d slbul1_ugrp     s                   like(scugrp)
     d slbul1_vare     s                   like(scvare)
      *
     d slbulu_avde     s                   like(scavde)
     d slbulu_lage     s                   like(sclage)
     d slbulu_otyp     s                   like(scotyp)
     d slbulu_land     s                   like(scland)
     d slbulu_dist     s                   like(scdist)
     d slbulu_selg     s                   like(scselg)
     d slbulu_lkat     s                   like(sclkat)
     d slbulu_ldor     s                   like(scldor)
     d slbulu_ogrp     s                   like(scogrp)
     d slbulu_hgrp     s                   like(schgrp)
     d slbulu_ugrp     s                   like(scugrp)
     d slbulu_vare     s                   like(scvare)
      *
     d wwbu01          s                   like(scbu01)
     d wwbu02          s                   like(scbu02)
     d wwbu03          s                   like(scbu03)
     d wwbu04          s                   like(scbu04)
     d wwbu05          s                   like(scbu05)
     d wwbu06          s                   like(scbu06)
     d wwbu07          s                   like(scbu07)
     d wwbu08          s                   like(scbu08)
     d wwbu09          s                   like(scbu09)
     d wwbu10          s                   like(scbu10)
     d wwbu11          s                   like(scbu11)
     d wwbu12          s                   like(scbu12)
      *
     d wkavde          s                   like(scavde)
     d wklage          s                   like(sclage)
     d wkotyp          s                   like(scotyp)
     d wkland          s                   like(scland)
     d wkdist          s                   like(scdist)
     d wkselg          s                   like(scselg)
     d wklkat          s                   like(sclkat)
     d wkldor          s                   like(scldor)
     d wkogrp          s                   like(scogrp)
     d wkhgrp          s                   like(schgrp)
     d wkugrp          s                   like(scugrp)
     d wkvare          s                   like(scvare)
      *
      * Definering av variable
      *
     d w_firm          s                   like(scfirm)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * INPUT                                                           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     isinnpf    NS  01    1 cS
HOFF i                                  6   13  invare
HOFF i                                 49   53 0inbu01
HOFF i                                 61   65 0inbu02
HOFF i                                 73   77 0inbu03
HOFF i                                 85   89 0inbu04
HOFF i                                 97  101 0inbu05
HOFF i                                109  113 0inbu06
HOFF i                                121  125 0inbu07
HOFF i                                133  137 0inbu08
HOFF i                                145  149 0inbu09
HOFF i                                157  161 0inbu10
HOFF i                                169  173 0inbu11
HOFF i                                181  185 0inbu12
HOFF  *
HOFF i                                 55   57 0inbd01
HOFF i                                 67   69 0inbd02
HOFF i                                 79   81 0inbd03
HOFF i                                 91   93 0inbd04
HOFF i                                103  105 0inbd05
HOFF i                                115  117 0inbd06
HOFF i                                127  129 0inbd07
HOFF i                                139  141 0inbd08
HOFF i                                151  153 0inbd09
HOFF i                                163  165 0inbd10
HOFF i                                175  177 0inbd11
HOFF i                                187  189 0inbd12
      *
     i          NS  99
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * XINIT  Initisiering av utskriften                               *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c   01              goto      tag01
      *
     c                   goto      xslutt
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Tag01  Generering av nye linjer                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     tag01         tag
      *
      * Tar vare på verdier fra forrige
      *
HOFF c     inbu01        mult      1000          wwbu01
HOFF c     inbu02        mult      1000          wwbu02
HOFF c     inbu03        mult      1000          wwbu03
HOFF c     inbu04        mult      1000          wwbu04
HOFF c     inbu05        mult      1000          wwbu05
HOFF c     inbu06        mult      1000          wwbu06
HOFF c     inbu07        mult      1000          wwbu07
HOFF c     inbu08        mult      1000          wwbu08
HOFF c     inbu09        mult      1000          wwbu09
HOFF c     inbu10        mult      1000          wwbu10
HOFF c     inbu11        mult      1000          wwbu11
HOFF c     inbu12        mult      1000          wwbu12
HOFF  *
HOFF c                   add       inbd01        wwbu01
HOFF c                   add       inbd02        wwbu02
HOFF c                   add       inbd03        wwbu03
HOFF c                   add       inbd04        wwbu04
HOFF c                   add       inbd05        wwbu05
HOFF c                   add       inbd06        wwbu06
HOFF c                   add       inbd07        wwbu07
HOFF c                   add       inbd08        wwbu08
HOFF c                   add       inbd09        wwbu09
HOFF c                   add       inbd10        wwbu10
HOFF c                   add       inbd11        wwbu11
HOFF c                   add       inbd12        wwbu12
      *
      * Beregn ny Nøkkel
      *
     c                   exsr      nykey
     c     *in14         cabeq     *on           xslutt
      *
      * Danner ny record
      *
     c     slbulu_key    chain     slbulur                            12
      *
     c     *in12         ifeq      *on
     c                   move      *zero         scbu01
     c                   move      *zero         scbu02
     c                   move      *zero         scbu03
     c                   move      *zero         scbu04
     c                   move      *zero         scbu05
     c                   move      *zero         scbu06
     c                   move      *zero         scbu07
     c                   move      *zero         scbu08
     c                   move      *zero         scbu09
     c                   move      *zero         scbu10
     c                   move      *zero         scbu11
     c                   move      *zero         scbu12
     c                   endif
      *
     c                   add       wwbu01        scbu01
     c                   add       wwbu02        scbu02
     c                   add       wwbu03        scbu03
     c                   add       wwbu04        scbu04
     c                   add       wwbu05        scbu05
     c                   add       wwbu06        scbu06
     c                   add       wwbu07        scbu07
     c                   add       wwbu08        scbu08
     c                   add       wwbu09        scbu09
     c                   add       wwbu10        scbu10
     c                   add       wwbu11        scbu11
     c                   add       wwbu12        scbu12
      *
     c     *in12         ifeq      *off
     c                   update    slbulur
     c                   else
      *
     c                   move      w_firm        scfirm
     c                   move      w_hhaa        schhaa
     c                   move      w_vers        scvers
     c                   move      w_kode        sckode
     c                   move      w_aabb        scaabb
      *
     c                   move      slbulu_avde   scavde
     c                   move      slbulu_lage   sclage
     c                   move      slbulu_otyp   scotyp
     c                   move      slbulu_land   scland
     c                   move      slbulu_dist   scdist
     c                   move      slbulu_selg   scselg
     c                   move      slbulu_lkat   sclkat
     c                   move      slbulu_ldor   scldor
     c                   move      slbulu_ogrp   scogrp
     c                   move      slbulu_hgrp   schgrp
     c                   move      slbulu_ugrp   scugrp
     c                   move      slbulu_vare   scvare
      *
     c                   write     slbulur
     c                   endif
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c     xslutt        tag
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Slett  Sletter forrige koden                                    *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     slett         begsr
      *
     c                   eval      slbul1_avde = *zero
     c                   eval      slbul1_lage = *zero
     c                   eval      slbul1_otyp = *blank
     c                   eval      slbul1_land = *blank
     c                   eval      slbul1_dist = *zero
     c                   eval      slbul1_selg = *zero
     c                   eval      slbul1_lkat = *zero
     c                   eval      slbul1_ldor = *zero
     c                   eval      slbul1_ogrp = *zero
     c                   eval      slbul1_hgrp = *zero
     c                   eval      slbul1_ugrp = *zero
     c                   eval      slbul1_vare = *blank
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * XSLETT Slett linjer som finnes                                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     slbul1_key    setll     slbul1
      *
      * Les ...
      *
     c     xslett        tag
     c                   read      slbul1                                 10
     c     *in10         cabeq     *on           xgener
      *
      * Sjekk, Hopp ut dersom ikke riktig
      *
     c     scfirm        cabne     w_firm        xgener
     c     schhaa        cabne     w_hhaa        xgener
     c     scvers        cabne     w_vers        xgener
     c     sckode        cabne     w_kode        xgener
     c     scaabb        cabne     w_aabb        xgener
      *
      * Sletter record
      *
     c                   move      scavde        slbulu_avde
     c                   move      sclage        slbulu_lage
     c                   move      scotyp        slbulu_otyp
     c                   move      scland        slbulu_land
     c                   move      scdist        slbulu_dist
     c                   move      scselg        slbulu_selg
     c                   move      sclkat        slbulu_lkat
     c                   move      scldor        slbulu_ldor
     c                   move      scogrp        slbulu_ogrp
     c                   move      schgrp        slbulu_hgrp
     c                   move      scugrp        slbulu_ugrp
     c                   move      scvare        slbulu_vare
     c     slbulu_key    chain     slbulur                            12
      *
     c     *in12         ifeq      *off
     c                   delete    slbulur
     c                   endif
      *
      * Returner til nytt les
      *
     c                   goto      xslett
      *
     c     xgener        endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Danner ny nøkkel                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     nykey         begsr
      *
      * Hent informasjon fra Vare-register
      *
     c                   movel     *blank        wwvare
     c                   movel     invare        wwvare
     c                   movel     '0000'        wwvare
      *
     c     vvarl1_key    chain     vvarl1r                            14
     c                   if        %found
     c                   move      vvogrp        wkogrp
     c                   move      vvhgrp        wkhgrp
     c                   move      vvugrp        wkugrp
     c                   move      vvvare        wkvare
     c                   endif
      *
      * Hent informasjon fra ldore-register
      *
     c                   move      scldor        wwldor
     c     rlevl1_key    chain     rlevl1r                            18
     c                   if        %found
     c                   move      rlavde        wkavde
     c                   move      rllagr        wklage
     c                   move      rlland        wkland
     c                   move      rldist        wkdist
     c                   move      rlsaks        wkselg
     c                   move      rlkatg        wklkat
     c                   move      rllevr        wkldor
     c                   endif
      *
      * Nullstiller alle nøkkelfelter
      *
     c                   eval      slbulu_avde = *zero
     c                   eval      slbulu_lage = *zero
     c                   eval      slbulu_otyp = *blank
     c                   eval      slbulu_land = *blank
     c                   eval      slbulu_dist = *zero
     c                   eval      slbulu_selg = *zero
     c                   eval      slbulu_lkat = *zero
     c                   eval      slbulu_ldor = *zero
     c                   eval      slbulu_ogrp = *zero
     c                   eval      slbulu_hgrp = *zero
     c                   eval      slbulu_ugrp = *zero
     c                   eval      slbulu_vare = *blank
      *
      * (11-52) (Avdeling)
      *
     c   41              move      wkavde        slbulu_avde
     c   61              move      wkavde        slbulu_avde
     c   81              move      wkavde        slbulu_avde
      *
      * (12-53) (Lager)
      *
     c   42              move      wklage        slbulu_lage
     c   62              move      wklage        slbulu_lage
     c   82              move      wklage        slbulu_lage
      *
      * (13-51) (Ordretype)
      *
     c   43              move      wkotyp        slbulu_otyp
     c   63              move      wkotyp        slbulu_otyp
     c   83              move      wkotyp        slbulu_otyp
      *
      * (21-25) (Land)
      *
     c   44              move      wkland        slbulu_land
     c   64              move      wkland        slbulu_land
     c   84              move      wkland        slbulu_land
      *
      * (22-23) (Distrikt)
      *
     c   45              move      wkdist        slbulu_dist
     c   65              move      wkdist        slbulu_dist
     c   85              move      wkdist        slbulu_dist
      *
      * (23-24) (Selger)
      *
     c   46              move      wkselg        slbulu_selg
     c   66              move      wkselg        slbulu_selg
     c   86              move      wkselg        slbulu_selg
      *
      * (24-21) (ldorekategori)
      *
     c   47              move      wklkat        slbulu_lkat
     c   67              move      wklkat        slbulu_lkat
     c   87              move      wklkat        slbulu_lkat
      *
      * (25-32) (ldorenummer)
      *
     c   48              move      wkldor        slbulu_ldor
     c   68              move      wkldor        slbulu_ldor
     c   88              move      wkldor        slbulu_ldor
      *
      * (31-14) (Overgruppe)
      *
     c   49              move      wkogrp        slbulu_ogrp
     c   69              move      wkogrp        slbulu_ogrp
     c   89              move      wkogrp        slbulu_ogrp
      *
      * (32-15) (Hovedgruppe)
      *
     c   50              move      wkhgrp        slbulu_hgrp
     c   70              move      wkhgrp        slbulu_hgrp
     c   90              move      wkhgrp        slbulu_hgrp
      *
      * (33-16) (Undergruppe)
      *
     c   51              move      wkugrp        slbulu_ugrp
     c   71              move      wkugrp        slbulu_ugrp
     c   91              move      wkugrp        slbulu_ugrp
      *
      * (34-31) (Varenummer)
      *
     c   52              move      wkvare        slbulu_vare
     c   72              move      wkvare        slbulu_vare
     c   92              move      wkvare        slbulu_vare
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Beregner indaktor for budsjett-begrep                           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     binit         begsr
      *
      * (11-52) (Avdeling)
      *
     c     wxkode_11     ifeq      1
     c                   move      *on           *in41
     c                   endif
     c     wxkode_11     ifeq      2
     c                   move      *on           *in61
     c                   endif
     c     wxkode_11     ifeq      3
     c                   move      *on           *in81
     c                   endif
      *
      * (12-53) (Lager)
      *
     c     wxkode_12     ifeq      1
     c                   move      *on           *in42
     c                   endif
     c     wxkode_12     ifeq      2
     c                   move      *on           *in62
     c                   endif
     c     wxkode_12     ifeq      3
     c                   move      *on           *in82
     c                   endif
      *
      * (13-51) (Ordretype)
      *
     c     wxkode_13     ifeq      1
     c                   move      *on           *in43
     c                   endif
     c     wxkode_13     ifeq      2
     c                   move      *on           *in63
     c                   endif
     c     wxkode_13     ifeq      3
     c                   move      *on           *in83
     c                   endif
      *
      * (21-25) (Land)
      *
     c     wxkode_21     ifeq      1
     c                   move      *on           *in44
     c                   endif
     c     wxkode_21     ifeq      2
     c                   move      *on           *in64
     c                   endif
     c     wxkode_21     ifeq      3
     c                   move      *on           *in84
     c                   endif
      *
      * (22-23) (Distrikt)
      *
     c     wxkode_22     ifeq      1
     c                   move      *on           *in45
     c                   endif
     c     wxkode_22     ifeq      2
     c                   move      *on           *in65
     c                   endif
     c     wxkode_22     ifeq      3
     c                   move      *on           *in85
     c                   endif
      *
      * (23-24) (Selger)
      *
     c     wxkode_23     ifeq      1
     c                   move      *on           *in46
     c                   endif
     c     wxkode_23     ifeq      2
     c                   move      *on           *in66
     c                   endif
     c     wxkode_23     ifeq      3
     c                   move      *on           *in86
     c                   endif
      *
      * (24-21) (Leverandørkategori
      *
     c     wxkode_24     ifeq      1
     c                   move      *on           *in47
     c                   endif
     c     wxkode_24     ifeq      2
     c                   move      *on           *in67
     c                   endif
     c     wxkode_24     ifeq      3
     c                   move      *on           *in87
     c                   endif
      *
      * (25-32) (Leverandørnummer)
      *
     c     wxkode_25     ifeq      1
     c                   move      *on           *in48
     c                   endif
     c     wxkode_25     ifeq      2
     c                   move      *on           *in68
     c                   endif
     c     wxkode_25     ifeq      3
     c                   move      *on           *in88
     c                   endif
      *
      * (31-14) (Overgruppe)
      *
     c     wxkode_31     ifeq      1
     c                   move      *on           *in49
     c                   endif
     c     wxkode_31     ifeq      2
     c                   move      *on           *in69
     c                   endif
     c     wxkode_31     ifeq      3
     c                   move      *on           *in89
     c                   endif
      *
      * (32-15) (Hovedgruppe)
      *
     c     wxkode_32     ifeq      1
     c                   move      *on           *in50
     c                   endif
     c     wxkode_32     ifeq      2
     c                   move      *on           *in70
     c                   endif
     c     wxkode_32     ifeq      3
     c                   move      *on           *in90
     c                   endif
      *
      * (33-16) (Undergruppe)
      *
     c     wxkode_33     ifeq      1
     c                   move      *on           *in51
     c                   endif
     c     wxkode_33     ifeq      2
     c                   move      *on           *in71
     c                   endif
     c     wxkode_33     ifeq      3
     c                   move      *on           *in91
     c                   endif
      *
      * (34-31) (Varenummer)
      *
     c     wxkode_34     ifeq      1
     c                   move      *on           *in52
     c                   endif
     c     wxkode_34     ifeq      2
     c                   move      *on           *in72
     c                   endif
     c     wxkode_34     ifeq      3
     c                   move      *on           *in92
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     csr   *inzsr        begsr
      *
      * Key for vareregister
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    wwvare
      *
      * Key for ldoreregister
      *
     c     rlevl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    wwldor
      *
      * Key for hovedgruppe
      *
     c     vhgrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    wwhogr
     c                   kfld                    wwhhgr
      *
      * Key for undergruppe
      *
     c     vugrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    wwuogr
     c                   kfld                    wwuhgr
     c                   kfld                    wwuugr
      *
      * Key for oppdatering av lager-register
      *
     c     slbul1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_hhaa
     c                   kfld                    w_vers
     c                   kfld                    w_kode
     c                   kfld                    w_aabb
     c                   kfld                    slbul1_avde
     c                   kfld                    slbul1_lage
     c                   kfld                    slbul1_otyp
     c                   kfld                    slbul1_land
     c                   kfld                    slbul1_dist
     c                   kfld                    slbul1_selg
     c                   kfld                    slbul1_lkat
     c                   kfld                    slbul1_ldor
     c                   kfld                    slbul1_ogrp
     c                   kfld                    slbul1_hgrp
     c                   kfld                    slbul1_ugrp
     c                   kfld                    slbul1_vare
      *
      * Key for oppdatering av lager-register
      *
     c     slbulu_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_hhaa
     c                   kfld                    w_vers
     c                   kfld                    w_kode
     c                   kfld                    w_aabb
     c                   kfld                    slbulu_avde
     c                   kfld                    slbulu_lage
     c                   kfld                    slbulu_otyp
     c                   kfld                    slbulu_land
     c                   kfld                    slbulu_dist
     c                   kfld                    slbulu_selg
     c                   kfld                    slbulu_lkat
     c                   kfld                    slbulu_ldor
     c                   kfld                    slbulu_ogrp
     c                   kfld                    slbulu_hgrp
     c                   kfld                    slbulu_ugrp
     c                   kfld                    slbulu_vare
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Tar inn parameter fra forrige program                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     *entry        plist
     c                   parm                    dsparm           64
     c                   move      dsparm        wsparm
      *
      *  Hent verdier for begrep + sett på indiaktorer
      *
     c                   move      wskode        wxkode
     c                   exsr      binit
      *
     c                   eval      w_firm      = wsfirm
     c                   eval      w_hhaa      = wshhaa
     c                   eval      w_kode      = wskode
     c                   eval      w_vers      = wsvers
     c                   eval      w_aabb      = wsaabb
      *
     c                   exsr      slett
      *
     csr                 endsr
