      /TITLE  ASSTAT Opprydding i filer
     h option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASSTAT
      * Program . . . . : SF405R
      * Beskrivelse . . : Kopier firma
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       101299 KOB  Nytt program
      * 6.10  110909 BSA  Oppdatert med sporingsinformasjon
8.01  *PRG2   220622 BOF  Utvidet prisgruppe fra 1 til 2 posisjoner - COMP
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fskpml1    if   e           k disk    rename(skpmpfr:skpml1r)
     fskpmlu    o    e           k disk    rename(skpmpfr:skpmlur)
     fskbul1    if   e           k disk    rename(skbupfr:skbul1r)
     fskbulu    o    e           k disk    rename(skbupfr:skbulur)
     fsknil1    if   e           k disk    rename(sknipfr:sknil1r)
     fsknilu    o    e           k disk    rename(sknipfr:sknilur)
     fskakl1    if   e           k disk    rename(skakpfr:skakl1r)
     fskaklu    o    e           k disk    rename(skakpfr:skaklur)
     fskpcl1    if   e           k disk    rename(skpcpfr:skpcl1r)
     fskpclu    o    e           k disk    rename(skpcpfr:skpclur)
     fsstal1    if   e           k disk    rename(sstapfr:sstal1r)
     fsstapf    o    e           k disk    rename(sstapfr:sstapfr)
      *
     fslpml1    if   e           k disk    rename(slpmpfr:slpml1r)
     fslpmlu    o    e           k disk    rename(slpmpfr:slpmlur)
     fslbul1    if   e           k disk    rename(slbupfr:slbul1r)
     fslbulu    o    e           k disk    rename(slbupfr:slbulur)
     fslnil1    if   e           k disk    rename(slnipfr:slnil1r)
     fslnilu    o    e           k disk    rename(slnipfr:slnilur)
     fslakl1    if   e           k disk    rename(slakpfr:slakl1r)
     fslaklu    o    e           k disk    rename(slakpfr:slaklur)
     fsistl1    if   e           k disk    rename(sistpfr:sistl1r)
     fsistpf    o    e           k disk    rename(sistpfr:sistpfr)
      *
     d                uds
     d l_user                911    920
     d l_fgrp                931    933
     d l_firm                944    946  0
     d l_navn                951    980
      *
     d w_firm          s              3  0
      *
      * Kunde parameterregister
      *
     c     skpml1_key    setll     skpml1                                 90
     c     skpml1_key    reade     skpml1                                 90
     c                   dow       *in90 = *off
     c                   eval      spfirm = w_firm
     c                   write     skpmlur
     c     skpml1_key    reade     skpml1                                 90
     c                   enddo
      *
      * Kunde budsjett
      *
     c     skbul1_key    setll     skbul1                                 90
     c     skbul1_key    reade     skbul1                                 90
     c                   dow       *in90 = *off
     c                   eval      sbfirm = w_firm
     c                   write     skbulur
     c     skbul1_key    reade     skbul1                                 90
     c                   enddo
      *
      * Kunde budsjettnivåregister
      *
     c     sknil1_key    setll     sknil1                                 90
     c     sknil1_key    reade     sknil1                                 90
     c                   dow       *in90 = *off
     c                   eval      snfirm = w_firm
     c                   write     sknilur
     c     sknil1_key    reade     sknil1                                 90
     c                   enddo
      *
      * Kunde akkumuleringsregister
      *
     c     skakl1_key    setll     skakl1                                 90
     c     skakl1_key    reade     skakl1                                 90
     c                   dow       *in90 = *off
     c                   eval      safirm = w_firm
     c                   write     skaklur
     c     skakl1_key    reade     skakl1                                 90
     c                   enddo
      *
      * Kunde statistikk PC-register
      *
     c     skpcl1_key    setll     skpcl1                                 90
     c     skpcl1_key    reade     skpcl1                                 90
     c                   dow       *in90 = *off
     c                   eval      ssfirm = w_firm
     c                   write     skpclur
     c     skpcl1_key    reade     skpcl1                                 90
     c                   enddo
      *
      * Kunde statistikkregister
      *
     c     sstal1_key    setll     sstal1                                 90
     c     sstal1_key    reade     sstal1                                 90
     c                   dow       *in90 = *off
     c                   eval      sffirm = w_firm
     c                   write     sstapfr
     c     sstal1_key    reade     sstal1                                 90
     c                   enddo
      *
      * Leverandør parameterregister
      *
     c     slpml1_key    setll     slpml1                                 90
     c     slpml1_key    reade     slpml1                                 90
     c                   dow       *in90 = *off
     c                   eval      srfirm = w_firm
     c                   write     slpmlur
     c     slpml1_key    reade     slpml1                                 90
     c                   enddo
      *
      * Leverandør budsjett
      *
     c     slbul1_key    setll     slbul1                                 90
     c     slbul1_key    reade     slbul1                                 90
     c                   dow       *in90 = *off
     c                   eval      scfirm = w_firm
     c                   write     slbulur
     c     slbul1_key    reade     slbul1                                 90
     c                   enddo
      *
      * Leverandør budsjettnivåregister
      *
     c     slnil1_key    setll     slnil1                                 90
     c     slnil1_key    reade     slnil1                                 90
     c                   dow       *in90 = *off
     c                   eval      smfirm = w_firm
     c                   write     slnilur
     c     slnil1_key    reade     slnil1                                 90
     c                   enddo
      *
      * Leverandør akkumuleringsregister
      *
     c     slakl1_key    setll     slakl1                                 90
     c     slakl1_key    reade     slakl1                                 90
     c                   dow       *in90 = *off
     c                   eval      shfirm = w_firm
     c                   write     slaklur
     c     slakl1_key    reade     slakl1                                 90
     c                   enddo
      *
      * Innkjøpsstatistikk
      *
     c     sistl1_key    setll     sistl1                                 90
     c     sistl1_key    reade     sistl1                                 90
     c                   dow       *in90 = *off
     c                   eval      sifirm = w_firm
6.10 c                   time                    siodat
6.10 c                   time                    siotim
6.10 c                   eval      siousr = l_user
     c                   write     sistpfr
     c     sistl1_key    reade     sistl1                                 90
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     *entry        plist
     c                   parm                    w_firm
      *
     c     skpml1_key    klist
     c                   kfld                    l_firm
      *
     c     skbul1_key    klist
     c                   kfld                    l_firm
      *
     c     sknil1_key    klist
     c                   kfld                    l_firm
      *
     c     skakl1_key    klist
     c                   kfld                    l_firm
      *
     c     skpcl1_key    klist
     c                   kfld                    l_firm
      *
     c     sstal1_key    klist
     c                   kfld                    l_firm
      *
     c     slpml1_key    klist
     c                   kfld                    l_firm
      *
     c     slbul1_key    klist
     c                   kfld                    l_firm
      *
     c     slnil1_key    klist
     c                   kfld                    l_firm
      *
     c     slakl1_key    klist
     c                   kfld                    l_firm
      *
     c     sistl1_key    klist
     c                   kfld                    l_firm
      *
     c                   endsr
