     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASSTAT
      * Program . . . . : SF610R
      * Beskrivelse . . : Kopierer parameter til arbeidsfil
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       281208 KOB  Nytt program
      * V5.60 220109 KOB  Korrigert feil ved firma <> 000
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fskpml1    if   e           k disk    rename(skpmpfr:skpml1r)
     f                                     prefix(x:1)
     fskpwpf    o    e           k disk    rename(skpwpfr:skpwpfr)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
      * Definering av variable
      *
     d w_firm          s                   like(spfirm)
     d w_type          s                   like(sptype)
      *
      * Legg ut parametre i arbeidsfil
      *
     c     skpml1_key    setll     skpml1r
     c     skpml1_key    reade     skpml1r                                61
     c                   dow       *in61 = *off
     c                   eval      spfirm = xpfirm
     c                   eval      sptype = xptype
     c                   eval      spkode = xpkode
     c                   eval      spvalg = xpvalg
     c                   eval      sprest = xprest
     c                   eval      spsyst = xpsyst
     c                   write     skpwpfr
     c     skpml1_key    reade     skpml1r                                61
     c                   enddo
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     C     *entry        plist
     C                   parm                    p_type           10
      *
     c                   eval      w_type = p_type
     c                   eval      w_firm = l_firm
      *
      * Key for file PARAMETER-REGISTER
      *
     c     skpml1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_type
      *
     c                   endsr
