     h datedit(*dmy) option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  System. . . . . : ASSTAT                                       *
      *  Program . . . . : SF629R                                       *
      *  Beskrivelse . . : Utskrift av mengde-statistikk (m3)           *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  Spesialversjon. :                                              *
      *  Tilpasset for . :                                              *
      *                                                                 *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.*
      *  --------- ------  ---------------------------------------------*
      *            170304  Nytt program                                 *
      *  V5.30     230604  Kundeprosjekttekst ble ikke hentet      KOB  *
      *  V5.30     200904  Fjernet rabattgruppe                    KOB  *
      *  V5.40     240305  Lagt ut enhet på rapport                KOB  *
      *  V5.50     301006  Lagt inn selger kasse                   KOB  *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     fskwwpf    ip   e           k disk
     fskpml1    if   e           k disk    rename(skpmpfr:skpml1r)
     frkunl1    if   e           k disk
     frlevl1    if   e           k disk
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     Fvvasl1    if   e           k disk    rename(vvaspfr:vvasl1r)
     fvvenl1    if   e           k disk    rename(vvenpfr:vvenl1r)
     fvahgl1    if   e           k disk
     fvaugl1    if   e           k disk
     fvogrl1    if   e           k disk    rename(vogrpfr:vogrl1r)
     fvhgrl1    if   e           k disk    rename(vhgrpfr:vhgrl1r)
     fvugrl1    if   e           k disk    rename(vugrpfr:vugrl1r)
     fvotyl1    if   e           k disk
     fra06pf    if   e           k disk
     fra07pf    if   e           k disk
     fra08pf    if   e           k disk
     fra09l1    if   e           k disk    rename(ra09pfr:ra09l1r)
     fra10pf    if   e           k disk
     fra11pf    if   e           k disk
     fra12pf    if   e           k disk
     fskbul1    if   e           k disk    rename(skbupfr:skbul1r)
     ffkprl1    if   e           k disk
     fvltpl1    if   e           k disk
     fsf629p    o    e             printer oflind(*in30)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Tabeller                                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     d sal             s              9  0 dim(12)
     d rt              s             25    dim(60) ctdata perrcd(1)             Rapport-tekster
      *
      /space 3
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Data Strukturer                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     d w_rest          ds           330
     d w_text                        30
     d w_srt1                         2  0
     d w_srt2                         2  0
     d w_srt3                         2  0
     d w_sps1                         1a
     d w_sps2                         1a
     d w_sps3                         1a
     d w_sps4                         1a
     d w_sps5                         1a
     d w_sps6                         1a
     d w_pmnd                         2  0
     d w_paar                         4  0
     d w_smli                         1a
     d w_sps7                         1a
     d w_sss1                         1a
     d w_sss2                         1a
     d w_sss3                         1a
     d w_slet                         1a
      *
     d                 ds
     d beg                           15
     d  k6                            6  0 overlay(beg)
     d   k5                           5  0 overlay(k6)
     d    k4                          4  0 overlay(k6)
     d     k3                         3  0 overlay(k6)
     d      k2                        2  0 overlay(k3)
     d       k2a                      2    overlay(k2)
      *
     d                 ds
     d w_xgrp                         7  0
     d  w_xogr                        2  0 overlay(w_xgrp:1)
     d  w_xhgr                        2  0 overlay(w_xgrp:3)
     d  w_xugr                        3  0 overlay(w_xgrp:5)
      *
     d                uds
     d l_wsid                901    910
     d l_user                911    920
     d l_firm                944    946  0
     d l_navn                951    980
      *
     d wxkode          ds            12
     d wxkode_11                      1  0
     d wxkode_12                      1  0
     d wxkode_13                      1  0
     d wxkode_21                      1  0
     d wxkode_22                      1  0
     d wxkode_23                      1  0
     d wxkode_24                      1  0
     d wxkode_25                      1  0
     d wxkode_31                      1  0
     d wxkode_32                      1  0
     d wxkode_33                      1  0
     d wxkode_34                      1  0
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Felt defineringer                                              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     d vvenl1_vare     s                   like(vevare)
     d w_omrl          s                   like(veomre)
     d w_omrs          s                   like(veomre)
     d w_anta          s                   like(sfanta)
      *
     d retur           s              6
     d rp1             s              2  0
     d rp2             s              2  0
     d rp3             s              2  0
      *
      *  Betydning av feltnavn:
      *  1. pos:                            4. pos:
      *   a = antall                         f = i fjor
      *   b = beløp                          i = i år
      *   d = dekningsgrad
      *                                     5. pos:
      *  2. pos:                             4 = sorteringsbegrep 3
      *   n = netto                          5 = sorteringsbegrep 2
      *   s = antall                         6 = sorteringsbegrep 1
      *   a = aktuell m3                     7 = firmatotal
      *   e = nominell m3                    u = utskriftsfelt
      *
      *  3. pos:
      *   p = denne periode
      *   i = hittil
      *
      *                                     Antall hittil i fjor
     d asifu           s              9  0
     d asif4           s             13  3
     d asif5           s             13  3
     d asif6           s             13  3
     d asif7           s             13  3
      *                                     Aktuell m3 hittil i fjor
     d aaif4           s             13  3
     d aaif5           s             13  3
     d aaif6           s             13  3
     d aaif7           s             13  3
      *                                     Nominell m3 hittil i fjor
     d aeif4           s             13  3
     d aeif5           s             13  3
     d aeif6           s             13  3
     d aeif7           s             13  3
      *                                     Antall hittil i år
     d asii4           s             13  3
     d asii5           s             13  3
     d asii6           s             13  3
     d asii7           s             13  3
      *                                     Aktuell m3 hittil i år
     d aaii4           s             13  3
     d aaii5           s             13  3
     d aaii6           s             13  3
     d aaii7           s             13  3
      *                                     Nominell m3 hittil i år
     d aeii4           s             13  3
     d aeii5           s             13  3
     d aeii6           s             13  3
     d aeii7           s             13  3
      *                                     Antall d.p. i fjor
     d aspfu           s              9  0
     d aspf4           s             13  3
     d aspf5           s             13  3
     d aspf6           s             13  3
     d aspf7           s             13  3
      *                                     Aktuell m3 d.p. i fjor
     d aapf4           s             13  3
     d aapf5           s             13  3
     d aapf6           s             13  3
     d aapf7           s             13  3
      *                                     Nominell m3 d.p. i fjor
     d aepf4           s             13  3
     d aepf5           s             13  3
     d aepf6           s             13  3
     d aepf7           s             13  3
      *                                     Antall d.p. i år
     d aspi4           s             13  3
     d aspi5           s             13  3
     d aspi6           s             13  3
     d aspi7           s             13  3
      *                                     Aktuell m3 d.p. i år
     d aapi4           s             13  3
     d aapi5           s             13  3
     d aapi6           s             13  3
     d aapi7           s             13  3
      *                                     Nominell m3 d.p. i år
     d aepi4           s             13  3
     d aepi5           s             13  3
     d aepi6           s             13  3
     d aepi7           s             13  3
      *                                     Netto hittil i fjor
     d bnif4           s             13  2
     d bnif5           s             13  2
     d bnif6           s             13  2
     d bnif7           s             13  2
      *                                     Netto d.p. i fjor
     d bnpf4           s             13  2
     d bnpf5           s             13  2
     d bnpf6           s             13  2
     d bnpf7           s             13  2
      *                                     Netto hittil i år
     d bnii4           s             13  2
     d bnii5           s             13  2
     d bnii6           s             13  2
     d bnii7           s             13  2
      *                                     Netto d.p. i år
     d bnpi4           s             13  2
     d bnpi5           s             13  2
     d bnpi6           s             13  2
     d bnpi7           s             13  2
      *
     d w_dif           s             13  2
     d w_rab           s             13  2
     d w_net           s             13  2
     d w_bid           s             13  2
      *
     d i               s              2  0
     d rap             s              2  0
      *
     d j               s              2  0
     d w_buds          s              1  0
      *
     d textl6          s             30
     d textl5          s             30
     d textl4          s             30
     d enhel6          s              3
     d enhel5          s              3
     d enhel4          s              3
     d rptek           s             30
     d rpenh           s              3
     d rpte1           s              8
     d rpte2           s              8
     d rpte3           s             12
     d utime           s              6  0
      *
     d w_hhaa          s                   like(sbhhaa)
     d w_vers          s                   like(sbvers)
     d w_kode          s                   like(sbkode)
     d w_aabb          s                   like(sbaabb)
      *
     d w_avde          s                   like(sbavde)
     d w_lage          s                   like(sblage)
     d*
     d w_land          s                   like(sbland)
     d w_dist          s                   like(sbdist)
     d w_selg          s                   like(sbselg)
     d w_kkat          s                   like(sbkkat)
      *
     d w_ogrp          s                   like(sbogrp)
     d w_hgrp          s                   like(sbhgrp)
     d w_ugrp          s                   like(sbugrp)
      *
     d w_firm          s                   like(l_firm)
     d w_fkod          s                   like(rafkod)
     d w_gkod          s                   like(ragkod)
     d w_hkod          s                   like(rahkod)
     d w_ikod          s                   like(raikod)
     d w_jkod          s                   like(rajkod)
     d w_kkod          s                   like(rakkod)
     d w_kund          s                   like(rkkund)
     d w_levr          s                   like(rllevr)
     d w_lkod          s                   like(ralkod)
     d w_otyp          s                   like(vaotyp)
     d w_oogr          s                   like(vgoogr)
     d w_hogr          s                   like(vghogr)
     d w_hhgr          s                   like(vghhgr)
     d w_uogr          s                   like(vguogr)
     d w_uhgr          s                   like(vguhgr)
     d w_uugr          s                   like(vguugr)
     d w_vare          s                   like(vvvare)
     d w_kpro          s                   like(flkpro)
     d w_lety          s                   like(vylety)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Input                                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     iskwwpfr       01
     i                                          sffirm        L7
     i                                          swsrt1        L6
     i                                          swsrt2        L5
     i                                          swsrt3        L4
      *
     iskbul1r
     i              sbbu01                      sal(1)
     i              sbbu02                      sal(2)
     i              sbbu03                      sal(3)
     i              sbbu04                      sal(4)
     i              sbbu05                      sal(5)
     i              sbbu06                      sal(6)
     i              sbbu07                      sal(7)
     i              sbbu08                      sal(8)
     i              sbbu09                      sal(9)
     i              sbbu10                      sal(10)
     i              sbbu11                      sal(11)
     i              sbbu12                      sal(12)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Cal_ulationn                                                   *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     dummy         tag
      *
      * Brudd på L6 (SRT1)
      *
     c   l6              do
     c                   eval      aspi6 = 0
     c                   eval      aapi6 = 0
     c                   eval      aepi6 = 0
     c                   eval      asii6 = 0
     c                   eval      aaii6 = 0
     c                   eval      aeii6 = 0
     c                   eval      aspf6 = 0
     c                   eval      aapf6 = 0
     c                   eval      aepf6 = 0
     c                   eval      asif6 = 0
     c                   eval      aaif6 = 0
     c                   eval      aeif6 = 0
     c                   eval      bnii6 = 0
     c                   eval      bnpi6 = 0
     c                   eval      bnif6 = 0
     c                   eval      bnpf6 = 0
      *
     c                   eval      textl6 = *blank
     c                   eval      enhel6 = *blank
     c                   move      swsrt1        beg
     c                   eval      rap = rp1
     c                   exsr      raprut
     c                   movel     rptek         textl6
     c                   movel     rpenh         enhel6
      *
     c                   enddo
      /eject
      *
      * Brudd på L5 (SRT2)
      *
     c   l5              do
     c                   eval      aspi5 = 0
     c                   eval      aapi5 = 0
     c                   eval      aepi5 = 0
     c                   eval      asii5 = 0
     c                   eval      aaii5 = 0
     c                   eval      aeii5 = 0
     c                   eval      aspf5 = 0
     c                   eval      aapf5 = 0
     c                   eval      aepf5 = 0
     c                   eval      asif5 = 0
     c                   eval      aaif5 = 0
     c                   eval      aeif5 = 0
     c                   eval      bnii5 = 0
     c                   eval      bnpi5 = 0
     c                   eval      bnif5 = 0
     c                   eval      bnpf5 = 0
      *
     c                   eval      textl5 = *blank
     c                   eval      enhel5 = *blank
      *
     c                   if        rp2 <> *zeros
     c                   move      swsrt2        beg
     c                   eval      rap = rp2
     c                   exsr      raprut
     c                   movel     rptek         textl5
     c                   movel     rpenh         enhel5
     c                   endif
      *
     c                   enddo
      /eject
      *
      * Brudd på L4 (SRT3)
      *
     c   l4              do
     c                   eval      aspi4 = 0
     c                   eval      aapi4 = 0
     c                   eval      aepi4 = 0
     c                   eval      asii4 = 0
     c                   eval      aaii4 = 0
     c                   eval      aeii4 = 0
     c                   eval      aspf4 = 0
     c                   eval      aapf4 = 0
     c                   eval      aepf4 = 0
     c                   eval      asif4 = 0
     c                   eval      aaif4 = 0
     c                   eval      aeif4 = 0
     c                   eval      bnii4 = 0
     c                   eval      bnpi4 = 0
     c                   eval      bnif4 = 0
     c                   eval      bnpf4 = 0
      *
     c                   eval      textl4 = *blank
     c                   eval      enhel4 = *blank
      *
     c                   if        rp3 <> *zeros
     c                   move      swsrt3        beg
     c                   eval      rap = rp3
     c                   exsr      raprut
     c                   movel     rptek         textl4
     c                   movel     rpenh         enhel4
     c                   endif
      *
     c                   enddo
      /eject
      *
     c                   eval      rptek = *blank
     c                   eval      rpenh = *blank
      *
      * Summering av enkeltposter
      *
      * Sammenligning mot budsjett
      *
     c                   if        *in41 = *on
      *
     c                   if        sfpaar < w_paar
     c                   goto      xslutt
     c                   endif
      *
     c                   if        w_buds <> 1
     c                   exsr      budsjett
     c                   endif
      *
     c                   endif
      *
      * Sammenlign mot i fjor
      *
     c                   if        *in42 = *on
      *
     c                   if        sfpaar < w_paar - 1
     c                   goto      xslutt
     c                   endif
      *
     c                   if        sfpaar = w_paar - 1
     c                   goto      ifjor
     c                   endif
      *
     c                   endif
      *
     c                   eval      w_rab = sfrab1 + sfrab2 + sfrabo             rabatt
     c                   eval      w_net = sfsumb - w_rab                       netto
      *
     c     iÅr           tag
      *
      * Summer til hittil i år
      *
     c                   if        sfpmnd <= w_pmnd
     c                   eval      asii4 = asii4  + sfanta                      antall
     c                   eval      aaii4 = aaii4  + sfakm3                      antall
     c                   eval      aeii4 = aeii4  + sfnom3                      antall
     c                   eval      bnii4 = bnii4  + w_net                       netto
     c                   endif
      *
      * Summer til denne periode i år
      *
     c                   if        sfpmnd = w_pmnd
     c                   eval      aspi4 = aspi4 + sfanta                       antall
     c                   eval      aapi4 = aapi4  + sfakm3                      antall
     c                   eval      aepi4 = aepi4  + sfnom3                      antall
     c                   eval      bnpi4 = bnpi4  + w_net                       netto
     c                   endif
      *
     c                   goto      xslutt
      *
     c     ifjor         tag
      *
     c                   eval      w_rab = sfrab1 + sfrab2 + sfrabo             rabatt
     c                   eval      w_net = sfsumb - w_rab                       netto
      *
      * Summer til hittil i fjor
      *
     c                   if        sfpmnd <= w_pmnd
     c                   eval      asif4 = asif4 + sfanta                       antall
     c                   eval      aaif4 = aaif4  + sfakm3                      antall
     c                   eval      aeif4 = aeif4  + sfnom3                      antall
     c                   eval      bnif4 = bnif4  + w_net                       netto
     c                   endif
      *
      * Summer til denne periode i fjor
      *
     c                   if        sfpmnd = w_pmnd
     c                   eval      aspf4 = aspf4 + sfanta                       antall
     c                   eval      aapf4 = aapf4  + sfakm3                      antall
     c                   eval      aepf4 = aepf4  + sfnom3                      antall
     c                   eval      bnpf4 = bnpf4  + w_net                       netto
     c                   endif
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     xslutt        tag
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Levelbrudd                                                      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
      * Brudd på L4  (SRT3)
      *
     cl4                 exsr      L4brd
     cl4                 if        swsrt3 <> *blank
     c                             and w_sps3 = ' '
     cl4                 write     lin1                                 30
     cl4 73              move      *on           *in30
     cl4                 exsr      overflow
     cl4                 endif
      *
      *
      * Brudd på L5  (SRT2)
      *
     cl5                 exsr      L5brd
     cl5                 if        swsrt2 <> *blank
     c                             and w_sps2 = ' '
     cl5                 write     lin1                                 30
     cl5 72              move      *on           *in30
     cl5                 exsr      overflow
     cl5                 endif
      *
     cL5 58              write     extra                                30
     cL5 58              exsr      overflow
      *
      * Brudd på L6  (SRT1)
      *
     cl6                 exsr      L6brd
     cl6                 if        swsrt1 <> *blank
     c                             and w_sps1 = ' '
     cl6                 write     lin1                                 30
     cl6 71              move      *on           *in30
     cl6                 exsr      overflow
      *
     cl6                 write     und1                                 30
     cl6 71              move      *on           *in30
     cl6                 exsr      overflow
     cl6                 endif
      *
      * Brudd på L7  (FIRMA)
      *
     cl7                 exsr      L7brd
     cl7                 if        w_sps4 = ' '
     cl7                 write     lin1                                 30
     cl7                 exsr      overflow
     cl7                 endif
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for behandling av brudd på L4 (SRT3)                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     L4brd         begsr
      *
      * Summer til neste nivå
      *
     c                   eval      aspi5 = aspi5 + aspi4                        Antall d.p. i år
     c                   eval      asii5 = asii5 + asii4                        Antall hittil i år
     c                   eval      aspf5 = aspf5 + aspf4                        Antall d.p. i fjor
     c                   eval      asif5 = asif5 + asif4                        Antall hittil i fjor
      *
     c                   eval      aapi5 = aapi5 + aapi4                        Antall d.p. i år
     c                   eval      aaii5 = aaii5 + aaii4                        Antall hittil i år
     c                   eval      aapf5 = aapf5 + aapf4                        Antall d.p. i år
     c                   eval      aaif5 = aaif5 + aaif4                        Antall hittil i år
      *
     c                   eval      aepi5 = aepi5 + aepi4                        Antall d.p. i år
     c                   eval      aeii5 = aeii5 + aeii4                        Antall hittil i år
     c                   eval      aepf5 = aepf5 + aepf4                        Antall d.p. i år
     c                   eval      aeif5 = aeif5 + aeif4                        Antall hittil i år
      *
     c                   eval      bnpi5 = bnpi5 + bnpi4                        Netto d.p. i fjor
     c                   eval      bnii5 = bnii5 + bnii4                        Netto hittil i år
     c                   eval      bnpf5 = bnpf5 + bnpf4                        Netto d.p. i år
     c                   eval      bnif5 = bnif5 + bnif4                        Netto hittil i fjor
      *
      *  Flytt til utskriftsfelt
      *
     c                   if        *in64 = *on
     c                   movel     swsrt3        vareu
     c                   movel     textl4        textu
     c                   movel     enhel4        enheu
      *
     c                   eval(h)   asiiu = asii4                                Antall
     c                   eval(h)   aaiiu = aaii4                                Antall
     c                   eval(h)   aeiiu = aeii4                                Antall
     c                   eval(h)   asifu = asif4                                Antall
     c                   eval(h)   bniiu = bnii4                                Netto
     c***                eval(h)   bnifu = bnif4                                Netto i fjor
      *
     c                   eval(h)   aspiu = aspi4                                Antall
     c                   eval(h)   aapiu = aapi4                                Antall
     c                   eval(h)   aepiu = aepi4                                Antall
     c                   eval(h)   aspfu = aspf4                                Antall
     c                   eval(h)   bnpiu = bnpi4                                Netto
     c***                eval(h)   bnpfu = bnpf4                                Netto i fjor
      *
     c                   exsr      beregn
      *
     c                   endif
      *
     c                   endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for behandling av brudd på L5 (SRT2)                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     L5brd         begsr
      *
      * Summer til neste nivå
      *
     c                   eval      aspi6 = aspi6 + aspi5                        Antall d.p. i år
     c                   eval      asii6 = asii6 + asii5                        Antall hittil i år
     c                   eval      aspf6 = aspf6 + aspf5                        Antall d.p. i fjor
     c                   eval      asif6 = asif6 + asif5                        Antall hittil i fjor
      *
     c                   eval      aapi6 = aapi6 + aapi5                        Antall d.p. i år
     c                   eval      aaii6 = aaii6 + aaii5                        Antall hittil i år
     c                   eval      aapf6 = aapf6 + aapf5                        Antall d.p. i år
     c                   eval      aaif6 = aaif6 + aaif5                        Antall hittil i år
      *
     c                   eval      aepi6 = aepi6 + aepi5                        Antall d.p. i år
     c                   eval      aeii6 = aeii6 + aeii5                        Antall hittil i år
     c                   eval      aepf6 = aepf6 + aepf5                        Antall d.p. i år
     c                   eval      aeif6 = aeif6 + aeif5                        Antall hittil i år
      *
     c                   eval      bnpi6 = bnpi6 + bnpi5                        Netto d.p. i fjor
     c                   eval      bnii6 = bnii6 + bnii5                        Netto hittil i år
     c                   eval      bnpf6 = bnpf6 + bnpf5                        Netto d.p. i år
     c                   eval      bnif6 = bnif6 + bnif5                        Netto hittil i fjor
      *
      *  Flytt til utskriftsfelt
      *
     c                   if        *in65 = *on
     c                   movel     swsrt2        vareu
     c                   movel     textl5        textu
     c                   movel     enhel5        enheu
      *
     c                   eval(h)   asiiu = asii5                                Antall
     c                   eval(h)   aaiiu = aaii5                                Antall
     c                   eval(h)   aeiiu = aeii5                                Antall
     c                   eval(h)   asifu = asif5                                Antall
     c                   eval(h)   bniiu = bnii5                                Netto
     c***                eval(h)   bnifu = bnif5                                Netto i fjor
      *
     c                   eval(h)   aspiu = aspi5                                Antall
     c                   eval(h)   aapiu = aapi5                                Antall
     c                   eval(h)   aepiu = aepi5                                Antall
     c                   eval(h)   aspfu = aspf5                                Antall
     c                   eval(h)   bnpiu = bnpi5                                Netto
     c***                eval(h)   bnpfu = bnpf5                                Netto i fjor
      *
     c                   exsr      beregn
      *
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for behandling av brudd på L6 (SRT1)                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     L6brd         begsr
      *
      * Summer til neste nivå
      *
     c                   eval      aspi7 = aspi7 + aspi6                        Antall d.p. i år
     c                   eval      asii7 = asii7 + asii6                        Antall hittil i år
     c                   eval      aspf7 = aspf7 + aspf6                        Antall d.p. i fjor
     c                   eval      asif7 = asif7 + asif6                        Antall hittil i fjor
      *
     c                   eval      aapi7 = aapi7 + aapi6                        Antall d.p. i år
     c                   eval      aaii7 = aaii7 + aaii6                        Antall hittil i år
     c                   eval      aapf7 = aapf7 + aapf6                        Antall d.p. i år
     c                   eval      aaif7 = aaif7 + aaif6                        Antall hittil i år
      *
     c                   eval      aepi7 = aepi7 + aepi6                        Antall d.p. i år
     c                   eval      aeii7 = aeii7 + aeii6                        Antall hittil i år
     c                   eval      aepf7 = aepf7 + aepf6                        Antall d.p. i år
     c                   eval      aeif7 = aeif7 + aeif6                        Antall hittil i år
      *
     c                   eval      bnpi7 = bnpi7 + bnpi6                        Netto d.p. i fjor
     c                   eval      bnii7 = bnii7 + bnii6                        Netto hittil i år
     c                   eval      bnpf7 = bnpf7 + bnpf6                        Netto d.p. i år
     c                   eval      bnif7 = bnif7 + bnif6                        Netto hittil i fjor
      *
      *  Flytt til utskriftsfelt
      *
     c                   if        *in66 = *on
     c                   movel     swsrt1        vareu
     c                   movel     textl6        textu
     c                   movel     enhel6        enheu
      *
     c                   eval(h)   asiiu = asii6                                Antall
     c                   eval(h)   aaiiu = aaii6                                Antall
     c                   eval(h)   aeiiu = aeii6                                Antall
     c                   eval(h)   asifu = asif6                                Antall
     c                   eval(h)   bniiu = bnii6                                Netto
     c***                eval(h)   bnifu = bnif6                                Netto i fjor
      *
     c                   eval(h)   aspiu = aspi6                                Antall
     c                   eval(h)   aapiu = aapi6                                Antall
     c                   eval(h)   aepiu = aepi6                                Antall
     c                   eval(h)   aspfu = aspf6                                Antall
     c                   eval(h)   bnpiu = bnpi6                                Netto
     c***                eval(h)   bnpfu = bnpf6                                Netto i fjor
      *
     c                   exsr      beregn
      *
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for behandling av brudd på L7 (FIRMA)                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     L7brd         begsr
      *
      *  Flytt til utskriftsfelt
      *
     c                   if        *in67 = *on
     c                   movel     l_firm        vareu
     c                   movel     l_navn        textu
      *
     c                   eval(h)   asiiu = asii7                                Antall
     c                   eval(h)   aaiiu = aaii7                                Antall
     c                   eval(h)   aeiiu = aeii7                                Antall
     c                   eval(h)   asifu = asif7                                Antall
     c                   eval(h)   bniiu = bnii7                                Netto
     c***                eval(h)   bnifu = bnif7                                Netto i fjor
      *
     c                   eval(h)   aspiu = aspi7                                Antall
     c                   eval(h)   aapiu = aapi7                                Antall
     c                   eval(h)   aepiu = aepi7                                Antall
     c                   eval(h)   aspfu = aspf7                                Antall
     c                   eval(h)   bnpiu = bnpi7                                Netto
     c***                eval(h)   bnpfu = bnpf7                                Netto i fjor
      *
     c                   exsr      beregn
      *
     c                   endif
      *
     c                   endsr
      *
      /SPACE 3
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for behandling av overflow                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
     c     overflow      begsr
      *
     c                   if        *in30 = *on
     c                   write     HD1A
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for beregning                                         *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     beregn        begsr
      *
      * Beregn pris pr m3 denne periode (nominell)
      *
     c                   eval      bnppr = 0                                    rabatt
     c                   if        aepiu <> 0
     c                   eval      bnppr = bnpiu / aepiu                        rabatt
     c                   endif
      *
      * Beregn pris pr m3 denne periode hitil i år (nominell)
      *
     c                   eval      bnipr = 0                                    rabatt
     c                   if        aeiiu <> 0
     c                   eval      bnipr = bniiu / aeiiu                        rabatt
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for behandling av rapport                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     raprut        begsr
      *
     c                   eval      rptek = *blank
      *
      * ------------------
      * Alt. hovedgruppe
      * ------------------
      *
     c                   if        rap = 11
     c                   move      k2            w_hhgr
     c     hgrkey        chain     vahgl1                             50
     c                   if        *in50 = *off
     c                   movel     vfhtxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * -----------------
      * Alt. undergruppe
      * -----------------
      *
     c                   if        rap = 12
     c                   movel     k5            w_uhgr
     c                   move      k5            w_uugr
     c     ugrkey        chain     vaugl1                             50
     c                   if        *in50 = *off
     c                   movel     vfutxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ------------------
      * Overgruppe
      * ------------------
      *
     c                   if        rap = 14                                               .....
     c                   movel     beg           w_xgrp                                       .
     c                   eval      w_oogr = w_xogr                                            .
     c     vogrl1_key    chain     vogrl1                             50                      .
     c                   if        *in50 = *off
     c                   movel     vgotxt        rptek                                        .
     c                   endif
     c                   goto      endrut                                                     .
     c                   endif                                                            .....
      *
      * ------------------
      * Hovedgruppe
      * ------------------
      *
     c                   if        rap = 15                                               .....
     c                   movel     beg           w_xgrp                                       .
     c                   eval      w_hogr = w_xogr                                            .
     c                   eval      w_hhgr = w_xhgr                                            .
     c     vhgrl1_key    chain     vhgrl1                             50                      .
     c                   if        *in50 = *off
     c                   movel     vghtxt        rptek                                        .
     c                   endif
     c                   goto      endrut                                                     .
     c                   endif                                                            .....
      *
      * ------------------
      * Undergruppe
      * ------------------
      *
     c                   if        rap = 16                                               .....
     c                   movel     beg           w_xgrp                                       .
     c                   eval      w_uogr = w_xogr                                            .
     c                   eval      w_uhgr = w_xhgr                                            .
     c                   eval      w_uugr = w_xugr                                            .
     c     vugrl1_key    chain     vugrl1                             50
     c                   if        *in50 = *off
     c                   movel     vgutxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif                                                            .....
      *
      * ---------------
      * Kundekategori
      * ---------------
      *
     c                   if        rap = 21
     c                   movel     k4            w_kkod
     c     ra11pf_key    chain     ra11pf                             50
     c                   if        *in50 = *off
     c                   movel     raktxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Rabattkategori
      * ---------------
      *
     c                   if        rap = 22
     c                   movel     k3            w_fkod
     c     ra06pf_key    chain     ra06pf                             50
     c                   if        *in50 = *off
     c                   movel     raftxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Distrikt
      * ---------------
      *
     c                   if        rap = 23
     c                   movel     k2            w_hkod
     c     ra08pf_key    chain     ra08pf                             50
     c                   if        *in50 = *off
     c                   movel     rahtxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Selger ordre
      * ---------------
      *
     c                   if        rap = 24
     c                   movel     k4            w_ikod
     c     ra09l1_key    chain     ra09l1                             50
     c                   if        *in50 = *off
     c                   movel     raitxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Selger kasse
      * ---------------
      *
     c                   if        rap = 27
     c                   movel     k4            w_ikod
     c     ra09l1_key    chain     ra09l1                             50
     c                   if        *in50 = *off
     c                   movel     raitxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Land
      * ---------------
      *
     c                   if        rap = 25
     c                   movel     k3            w_lkod
     c     ra12pf_key    chain     ra12pf                             50
     c                   if        *in50 = *off
     c                   movel     raltxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Varenr.
      * ---------------
      *
     c                   if        rap = 31
     c                   movel     beg           w_vare
     c     vvarl1_key    chain     vvarl1                             50
     c                   if        *in50 = *off
     c                   movel     vvtek1        rptek
     C                   move      vvenhs        rpenh
     c                   endif
B002 C                   if        *in50 = *on
 001 C     vvarl1_key    chain     vvasl1                             50
B002 C                   if        *in50 = *off
 002 C                   movel     vvtek1        rptek
     C                   move      vvenhs        rpenh
E002 C                   else
 002 C                   movel     sftek1        rptek
     C                   move      sfenhe        rpenh
E002 C                   endif
E002 C                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Kunde
      * ---------------
      *
     c                   if        rap = 32
     c                   movel     k6            w_kund
     c     rkunl1_key    chain     rkunl1                             50
     c                   if        *in50 = *off
     c                   movel     rknavn        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Kundeprosjekt
      * ---------------
      *
B001 C                   if        rap = 33                                               .....
 001 C                   movel     k6            w_kpro
B001 C                   if        w_kpro <> *zeros                                       .....
 001 C                   move      sfvkun        w_kund
 001 C     fkprl1_key    chain     fkprl1                             50
B002 C                   if        *in50 = *off
 002 C                   movel     flnavn        rptek
E002 C                   endif
E002 C                   endif
 001 C                   goto      endrut
E001 C                   endif                                                            .....
      *
      * ---------------
      * FAKT.NR/KRED.NR
      * ---------------
      *
     c                   if        rap = 42
     c                   movel     'Fakt.nr/'    rpte1
     c                   movel     'Kred.nr '    rpte2
     c                   eval      rpte3 = *blank
     c                   movel     rpte2         rpte3
     c                   movel     rpte1         rptek
     c                   move      rpte3         rptek
     c                   endif
      *
      * ---------------
      * Fakturadato
      * ---------------
      *
     c                   if        rap = 43
     c                   movel     'Fakturad'    rpte1
     c                   movel     'ato     '    rpte2
     c                   eval      rpte3 = *blank
     c                   movel     rpte2         rpte3
     c                   movel     rpte1         rptek
     c                   move      rpte3         rptek
     c                   endif
      *
      * ---------------
      * Ordretype
      * ---------------
      *
     c                   if        rap = 51
     c                   movel     k2a           w_otyp
     c     votyl1_key    chain     votyl1                             50
     c                   if        *in50 = *off
     c                   movel     vaotxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Avdeling
      * ---------------
      *
     c                   if        rap = 52
     c                   movel     k2            w_gkod
     c     ra07pf_key    chain     ra07pf                             50
     c                   if        *in50 = *off
     c                   movel     ragtxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Lager
      * ---------------
      *
     c                   if        rap = 53
     c                   movel     k2            w_jkod
     c     ra10pf_key    chain     ra10pf                             50
     c                   if        *in50 = *off
     c                   movel     rajtxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ----------------
      * Produktansvarlig
      * ----------------
      *
     c                   if        rap = 54
     c                   movel     rt(54)        rptek
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Leveringstype
      * ---------------
      *
     c                   if        rap = 55                                               .....
     c                   movel     rt(55)        rptek
     c                   movel     beg           w_lety
     c     vltpl1_key    chain     vltpl1                             50
     c                   if        *in50 = *off
     c                   movel     vybesk        rptek
     c                   endif
     c                   goto      endrut
     c                   endif                                                            .....
      *
      * ---------------
      * Leverandørnummer
      * ---------------
      *
     c                   if        rap = 56                                               .....
     c                   movel     k6            w_levr
     c     rlevl1_key    chain     rlevl1                             50
     c                   if        *in50 = *off
     c                   movel     rlnavn        rptek
     c                   endif
     c                   goto      endrut
     c                   endif                                                            .....
      *
     c     endrut        endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Henter budsjett                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     budsjett      begsr
      *
     c                   eval      w_buds = 1                                   rabatt
      *
     c                   move      *zero         w_avde
     c                   move      *zero         w_lage
     c                   move      *blank        w_otyp
     c                   move      *blank        w_land
     c                   move      *zero         w_dist
     c                   move      *zero         w_selg
     c                   move      *zero         w_kkat
     c                   move      *zero         w_kund
     c                   move      *zero         w_ogrp
     c                   move      *zero         w_hgrp
     c                   move      *zero         w_ugrp
     c                   move      *blank        w_vare
      *
      * (11-52) (Avdeling)
      *
     c     wxkode_11     ifne      0
     c                   move      sfsavd        w_avde
     c                   endif
      *
      * (12-53) (Lager)
      *
     c     wxkode_12     ifne      0
     c                   move      sflage        w_lage
     c                   endif
      *
      * (13-51) (Ordretype)
      *
     c     wxkode_13     ifne      0
     c                   move      sfotyp        w_otyp
     c                   endif
      *
      * (21-25) (Land)
      *
     c     wxkode_21     ifne      0
     c                   move      sfland        w_land
     c                   endif
      *
      * (22-23) (Distrikt)
      *
     c     wxkode_22     ifne      0
     c                   move      sfdist        w_dist
     c                   endif
      *
      * (23-24) (Selger)
      *
     c     wxkode_23     ifne      0
     c                   move      sfselg        w_selg
     c                   endif
      *
      * (24-21) (Kundekategori)
      *
     c     wxkode_24     ifne      0
     c                   move      sfkkat        w_kkat
     c                   endif
      *
      * (25-32) (Kundenummer)
      *
     c     wxkode_25     ifne      0
     c                   move      sffkun        w_kund
     c                   endif
      *
      * (31-14) (Overgruppe)
      *
     c     wxkode_31     ifne      0
     c                   move      sfogrp        w_ogrp
     c                   endif
      *
      * (32-15) (Hovedgruppe)
      *
     c     wxkode_32     ifne      0
     c                   move      sfhgrp        w_hgrp
     c                   endif
      *
      * (33-16) (Undergruppe)
      *
     c     wxkode_33     ifne      0
     c                   move      sfugrp        w_ugrp
     c                   endif
      *
      * (34-31) (Varenummer)
      *
     c     wxkode_34     ifne      0
     c                   move      sfvare        w_vare
     c                   endif
      *
      * Hent inn opplysninger fra BUDSJETT-REGISTER
      *
     c     budkey        chain     skbul1r                            90
      *
      * Hopper ut dersom record ikke funnet
      *
     c                   if        *in90 = *on
     c                   goto      budslutt
     c                   endif
      *
     c                   eval      j = 0                                        dekningsbidrag
     c                   eval      bnif4 = 0
     c                   eval      bnpf4 = 0
      *
      * Summer til hittil i budsjett
      *
     c     1             do        w_pmnd        j
     c                   add       sal(j)        bnif4
     c                   enddo
      *
      * Summer til denne periode i budsjett
      *
     c                   eval      j = w_pmnd
     c                   eval      bnpf4 = sal(j)
      *
     c     budslutt      endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Danner riktig kode for budsjetnøkkelen                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     hntwxk        begsr
      *
     c                   move      *zero         wxkode
      *
      * (11-52) (Avdeling)
      *
     c     w_srt1        ifeq      52
     c                   move      1             wxkode_11
     c                   endif
     c     w_srt2        ifeq      52
     c                   move      2             wxkode_11
     c                   endif
     c     w_srt3        ifeq      52
     c                   move      3             wxkode_11
     c                   endif
      *
      * (12-53) (Lager)
      *
     c     w_srt1        ifeq      53
     c                   move      1             wxkode_12
     c                   endif
     c     w_srt2        ifeq      53
     c                   move      2             wxkode_12
     c                   endif
     c     w_srt3        ifeq      53
     c                   move      3             wxkode_12
     c                   endif
      *
      * (13-51) (Ordretype)
      *
     c     w_srt1        ifeq      51
     c                   move      1             wxkode_13
     c                   endif
     c     w_srt2        ifeq      51
     c                   move      2             wxkode_13
     c                   endif
     c     w_srt3        ifeq      51
     c                   move      3             wxkode_13
     c                   endif
      *
      * (21-25) (Land)
      *
     c     w_srt1        ifeq      25
     c                   move      1             wxkode_21
     c                   endif
     c     w_srt2        ifeq      25
     c                   move      2             wxkode_21
     c                   endif
     c     w_srt3        ifeq      25
     c                   move      3             wxkode_21
     c                   endif
      *
      * (22-23) (Distrikt)
      *
     c     w_srt1        ifeq      23
     c                   move      1             wxkode_22
     c                   endif
     c     w_srt2        ifeq      23
     c                   move      2             wxkode_22
     c                   endif
     c     w_srt3        ifeq      23
     c                   move      3             wxkode_22
     c                   endif
      *
      * (23-24) (Selger)
      *
     c     w_srt1        ifeq      24
     c                   move      1             wxkode_23
     c                   endif
     c     w_srt2        ifeq      24
     c                   move      2             wxkode_23
     c                   endif
     c     w_srt3        ifeq      24
     c                   move      3             wxkode_23
     c                   endif
      *
      * (24-21) (Kundekategori)
      *
     c     w_srt1        ifeq      21
     c                   move      1             wxkode_24
     c                   endif
     c     w_srt2        ifeq      21
     c                   move      2             wxkode_24
     c                   endif
     c     w_srt3        ifeq      21
     c                   move      3             wxkode_24
     c                   endif
      *
      * (25-32) (Kundenummer)
      *
     c     w_srt1        ifeq      32
     c                   move      1             wxkode_25
     c                   endif
     c     w_srt2        ifeq      32
     c                   move      2             wxkode_25
     c                   endif
     c     w_srt3        ifeq      32
     c                   move      3             wxkode_25
     c                   endif
      *
      * (31-14) (Overgruppe)
      *
     c     w_srt1        ifeq      14
     c                   move      1             wxkode_31
     c                   endif
     c     w_srt2        ifeq      14
     c                   move      2             wxkode_31
     c                   endif
     c     w_srt3        ifeq      14
     c                   move      3             wxkode_31
     c                   endif
      *
      * (32-15) (Hovedgruppe)
      *
     c     w_srt1        ifeq      15
     c                   move      1             wxkode_32
     c                   endif
     c     w_srt2        ifeq      15
     c                   move      2             wxkode_32
     c                   endif
     c     w_srt3        ifeq      15
     c                   move      3             wxkode_32
     c                   endif
      *
      * (33-16) (Undergruppe)
      *
     c     w_srt1        ifeq      16
     c                   move      1             wxkode_33
     c                   endif
     c     w_srt2        ifeq      16
     c                   move      2             wxkode_33
     c                   endif
     c     w_srt3        ifeq      16
     c                   move      3             wxkode_33
     c                   endif
      *
      * (34-31) (Varenummer)
      *
     c     w_srt1        ifeq      31
     c                   move      1             wxkode_34
     c                   endif
     c     w_srt2        ifeq      31
     c                   move      2             wxkode_34
     c                   endif
     c     w_srt3        ifeq      31
     c                   move      3             wxkode_34
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     *inzsr        begsr
      *
     c                   eval      rptek = *blank
      *
      * Behandle kriterier for valg
      *
     c     *entry        plist
     c                   parm                    dstype           10
      *
      * Behandle valg-parameter
      *
     c                   eval      spfirm = l_firm
     c                   eval      sptype = dstype
     c                   eval      spkode = 00
      *
     c     skpml1_key    chain     skpml1r                            50
      *
     c                   movel     sprest        w_rest
      *
      * Legg ut tekster i heading
      *
     c                   eval      rp1 = w_srt1
     c                   eval      rp2 = w_srt2
     c                   eval      rp3 = w_srt3
      *
     c                   if        rp1 <> 0
     c                   eval      wwrt01 = rt(rp1)
     c                   endif
      *
     c                   if        rp2 <> 0
     c                   eval      wwrt02 = rt(rp2)
     c                   eval      *in57 = *on
     c                   endif
      *
     c                   if        rp3 <> 0
     c                   eval      wwrt03 = rt(rp3)
     c                   eval      *in58 = *on
     c                   endif
      *
      *
      * Sjekk sammenligning
      *
     c                   if        w_smli = ' '
     c                   eval      w_smli = 'B'
     c                   endif
      *
     c                   if        w_smli = 'B'
     c                   eval      *in41 = *on
     c                   endif
      *
     c                   if        w_smli = 'F'
     c                   eval      *in42 = *on
     c                   endif
      *
      * Sjekk summering
      *
     c                   eval      *in64 = w_sps1 = ' '                          BEGREP 1
     c                   eval      *in65 = w_sps2 = ' '                          BEGREP 2
     c                   eval      *in66 = w_sps3 = ' '                          BEGREP 3
     c                   eval      *in67 = w_sps4 = ' '                          FIRMA
      *
     c                   eval      *in70 = w_sps7 <> ' '                         BEGREP 1
     c                   eval      *in71 = w_sss1 <> ' '                         BEGREP 1
     c                   eval      *in72 = w_sss2 <> ' '                         BEGREP 1
     c                   eval      *in73 = w_sss3 <> ' '                         BEGREP 1
      *
      * Legger inn verdier i nøkklene
      *
     c                   move      l_firm        w_firm
     c                   move      w_paar        w_hhaa
     c                   move      'O '          w_vers
      *
     c                   time                    utime
     c                   eval      w_date = udate
      *
      * Hent inn budsjettnøkkel
      *
     c                   exsr      hntwxk
     c                   move      wxkode        w_kode
      *
     c                   write     hd1a
      *
      * Key for vareregister
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_vare
      *
      * Key for kunderegister
      *
     c     rkunl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_kund
      *
      * Key for leverandørregister
      *
     c     rlevl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_levr
      *
      * Key for kundeprosjekt
      *
     c     fkprl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_kund
     c                   kfld                    w_kpro
      *
      * Key for alt. hovedgruppe
      *
     c     hgrkey        klist
     c                   kfld                    w_firm
     c                   kfld                    w_hhgr
      *
      * Key for alt. undergruppe
      *
     c     ugrkey        klist
     c                   kfld                    w_firm
     c                   kfld                    w_uhgr
     c                   kfld                    w_uugr
      *
      * Key for overgruppe
      *
     c     vogrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_oogr
      *
      * Key for hovedgruppe
      *
     c     vhgrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_hogr
     c                   kfld                    w_hhgr
      *
      * Key for undergruppe
      *
     c     vugrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_uogr
     c                   kfld                    w_uhgr
     c                   kfld                    w_uugr
      *
      * Key for ORDRETYPE
      *
     c     votyl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_otyp
      *
      * Key for RABATTKATEGORI
      *
     c     ra06pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_fkod
      *
      * Key for AVDELING
      *
     c     ra07pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_gkod
      *
      * Key for DISTRIKT
      *
     c     ra08pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_hkod
      *
      * Key for SELGER
      *
     c     ra09l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_ikod
      *
      * Key for LAGER
      *
     c     ra10pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_jkod
      *
      * Key for KUNDEKATEGORI
      *
     c     ra11pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_kkod
      *
      * Key for LAND
      *
     c     ra12pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_lkod
      *
      * Key for leveringstype
      *
     c     vltpl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_lety
      *
      * Key for BUDSJETT
      *
     c     budkey        klist
     c                   kfld                    w_firm
     c                   kfld                    w_hhaa
     c                   kfld                    w_vers
     c                   kfld                    w_kode
     c                   kfld                    w_aabb
     c                   kfld                    w_avde
     c                   kfld                    w_lage
     c                   kfld                    w_otyp
     c                   kfld                    w_land
     c                   kfld                    w_dist
     c                   kfld                    w_selg
     c                   kfld                    w_kkat
     c                   kfld                    w_kund
     c                   kfld                    w_ogrp
     c                   kfld                    w_hgrp
     c                   kfld                    w_ugrp
     c                   kfld                    w_vare
      *
      * Key for PARAMETER
      *
     c     skpml1_key    klist
     c                   kfld                    spfirm
     c                   kfld                    sptype
     c                   kfld                    spkode
     c                   kfld                    spvalg
      *
     c                   endsr
      *
      /eject
      *
      **********************  T A B E L L E R  ***************************
**       RAPPORT  TEKSTER
Ledig 01                   01
Ledig 02                   02
Ledig 03                   03
Ledig                      04
Ledig                      05
Ledig                      06
Ledig                      07
Ledig                      08
Ledig                      09
Ledig                      10
Alt. hovedgruppe           11
Alt. undergruppe           12
Rabattgrp.                 13
Overgruppe                 14
Hovedgruppe                15
Undergruppe                16
Ledig                      17
Ledig                      18
Ledig                      19
Ledig                      20
Kundekategori              21
Rabattkateg.               22
Distrikt                   23
Selger ordre               24
Land                       25
Hgr.-kundekat.             26
Selger kasse               27
Ledig                      28
Ledig                      29
Ledig                      30
Varenummer                 31
Kunde                      32
Kundeprosjekt              33
Ledig                      34
Ledig                      35
Ledig                      36
Ledig                      37
Ledig                      38
Ledig                      39
Ledig                      40
Periode                    41
Faktnr/Krednr              42
Fakturadato                43
Ledig                      44
Ledig                      45
Ledig                      46
Ledig                      47
Ledig                      48
Ledig                      49
Ledig                      50
Ordretype                  51
Avdeling                   52
Lager                      53
Produktansvarlig           54
Leveringstype              55
Leverandør                 56
Time                       57
Ledig                      58
Ledig                      59
Ledig                      60
