      /title  Utskrift av salgsstatistikk
     h option(*nodebugio)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  System. . . . . : ASSTAT                                       *
      *  Program . . . . : SF627R                                       *
      *  Beskrivelse . . : Utskrift av salgsstatistikk                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *                                                                 *
      *  Spesialversjon. :                                              *
      *  Tilpasset for . :                                              *
      *                                                                 *
      *  Referanse  Dato   Endringsbeskrivelse                     Sign.*
      *  --------- ------  ---------------------------------------------*
      *  V5.30     080304  Henting av navn kundekategori var feil       *
      *  V5.30     080304  Henting av navn rabattkategori var feil      *
      *  V5.30     230604  Kundeprosjekttekst ble ikke hentet      KOB  *
      *  V5.30     200904  Fjernet rabattgruppe                    KOB  *
      *  V5.50     301006  Lagt inn selger kasse                   KOB  *
      *                                                                 *
      *                                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     fskwwpf    ip   e           k disk
     fskpml1    if   e           k disk    rename(skpmpfr:skpml1r)
     frkunl1    if   e           k disk
     frlevl1    if   e           k disk
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     Fvvasl1    if   e           k disk    rename(vvaspfr:vvasl1r)
      *
     fvahgl1    if   e           k disk
     fvaugl1    if   e           k disk
     fvogrl1    if   e           k disk    rename(vogrpfr:vogrl1r)
     fvhgrl1    if   e           k disk    rename(vhgrpfr:vhgrl1r)
     fvugrl1    if   e           k disk    rename(vugrpfr:vugrl1r)
     fvotyl1    if   e           k disk
     fra06pf    if   e           k disk
     fra07pf    if   e           k disk
     fra08pf    if   e           k disk
     fra09l1    if   e           k disk    rename(ra09pfr:ra09l1r)
     fra10pf    if   e           k disk
     fra11pf    if   e           k disk
     fra12pf    if   e           k disk
     fskbul1    if   e           k disk    rename(skbupfr:skbul1r)
     ffkprl1    if   e           k disk
     fvltpl1    if   e           k disk
     fsf627p    o    e             printer oflind(*in30)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Tabeller                                                       *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     d sal             s              9  0 dim(12)
     d rt              s             25    dim(60) ctdata perrcd(1)             Rapport-tekster
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Data Strukturer                                                *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     d w_rest          ds           330
     d w_text                        30
     d w_srt1                         2  0
     d w_srt2                         2  0
     d w_srt3                         2  0
     d w_sps1                         1a
     d w_sps2                         1a
     d w_sps3                         1a
     d w_sps4                         1a
     d w_sps5                         1a
     d w_sps6                         1a
     d w_pmnd                         2  0
     d w_paar                         4  0
     d w_smli                         1a
     d w_sps7                         1a
     d w_sss1                         1a
     d w_sss2                         1a
     d w_sss3                         1a
     d w_slet                         1a
      *
     d                 ds
     d beg                           15
     d  k6                            6  0 overlay(beg)
     d   k5                           5  0 overlay(k6)
     d    k4                          4  0 overlay(k6)
     d     k3                         3  0 overlay(k6)
     d      k2                        2  0 overlay(k3)
     d       k2a                      2    overlay(k2)
      *
     d                 ds
     d w_xgrp                         7  0
     d  w_xogr                        2  0 overlay(w_xgrp:1)
     d  w_xhgr                        2  0 overlay(w_xgrp:3)
     d  w_xugr                        3  0 overlay(w_xgrp:5)
      *
     d                uds
     d l_wsid                901    910
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      *
     d wxkode          ds            12
     d wxkode_11                      1  0
     d wxkode_12                      1  0
     d wxkode_13                      1  0
     d wxkode_21                      1  0
     d wxkode_22                      1  0
     d wxkode_23                      1  0
     d wxkode_24                      1  0
     d wxkode_25                      1  0
     d wxkode_31                      1  0
     d wxkode_32                      1  0
     d wxkode_33                      1  0
     d wxkode_34                      1  0
      *
     D wwkund          s                   like(rkkund)
     D wwkpro          s                   like(flkpro)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Felt defineringer                                              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     d retur           s              6
     d rp1             s              2  0
     d rp2             s              2  0
     d rp3             s              2  0
      *
      *  Betydning av feltnavn:
      *  1. pos:                         3. pos:
      *   b = beløp                       p = denne periode
      *   d = dekningsgrad                i = hittil
      *
      *  2. pos:                         4. pos:
      *   b = brutto                      f = i fjor
      *   r = rabatt                      i = i år
      *   n = netto
      *   k = kost                       5. pos:
      *   d = dekningsbidrag              4 = sorteringsbegrep 3
      *   g = dekningsgrad                5 = sorteringsbegrep 2
      *   s = antall                      6 = sorteringsbegrep 1
      *                                   7 = firmatotal
      *                                   u = utskriftsfelt
      *
      *  Netto salg denne periode
      *                                     Netto d.p. i år
     d bnpi4           s             13  2
     d bnpi5           s             13  2
     d bnpi6           s             13  2
     d bnpi7           s             13  2
      *                                     Netto d.p. i fjor
     d bnpf4           s             13  2
     d bnpf5           s             13  2
     d bnpf6           s             13  2
     d bnpf7           s             13  2
      *                                     Netto d.p. i budsjett
     d bnpb4           s             13  2
     d bnpb5           s             13  2
     d bnpb6           s             13  2
     d bnpb7           s             13  2
      *
      *  Netto salg hittil i år
      *                                     Netto hittil i år
     d bnii4           s             13  2
     d bnii5           s             13  2
     d bnii6           s             13  2
     d bnii7           s             13  2
      *                                     Netto hittil i fjor
     d bnif4           s             13  2
     d bnif5           s             13  2
     d bnif6           s             13  2
     d bnif7           s             13  2
      *                                     Netto hittil i budsjett
     d bnib4           s             13  2
     d bnib5           s             13  2
     d bnib6           s             13  2
     d bnib7           s             13  2
      *
      * Beregnede verdier
      *
     d wbapfu          s             13  4
     d wbapbu          s             13  4
     d wbaifu          s             13  4
     d wbaibu          s             13  4
      *
     d w_dif           s             13  2
     d w_rab           s             13  2
     d w_net           s             13  2
     d w_bid           s             13  2
      *
     d i               s              2  0
     d rap             s              2  0
      *
     d j               s              2  0
     d w_buds          s              1  0
      *
     d textl6          s             30
     d textl5          s             30
     d textl4          s             30
     d rptek           s             30
     d rpte1           s              8
     d rpte2           s              8
     d rpte3           s             12
     d utime           s              6  0
      *
     d w_hhaa          s                   like(sbhhaa)
     d w_vers          s                   like(sbvers)
     d w_kode          s                   like(sbkode)
     d w_aabb          s                   like(sbaabb)
      *
     d w_avde          s                   like(sbavde)
     d w_lage          s                   like(sblage)
      *
     d w_land          s                   like(sbland)
     d w_dist          s                   like(sbdist)
     d w_selg          s                   like(sbselg)
     d w_kkat          s                   like(sbkkat)
      *
     d w_ogrp          s                   like(sbogrp)
     d w_hgrp          s                   like(sbhgrp)
     d w_ugrp          s                   like(sbugrp)
      *
      *
     d w_firm          s                   like(l_firm)
     d w_fkod          s                   like(rafkod)
     d w_gkod          s                   like(ragkod)
     d w_hkod          s                   like(rahkod)
     d w_ikod          s                   like(raikod)
     d w_jkod          s                   like(rajkod)
     d w_kkod          s                   like(rakkod)
     d w_kund          s                   like(rkkund)
     d w_levr          s                   like(rllevr)
     d w_lkod          s                   like(ralkod)
     d w_otyp          s                   like(vaotyp)
     d w_oogr          s                   like(vgoogr)
     d w_hogr          s                   like(vghogr)
     d w_hhgr          s                   like(vghhgr)
     d w_uogr          s                   like(vguogr)
     d w_uhgr          s                   like(vguhgr)
     d w_uugr          s                   like(vguugr)
     d w_vare          s                   like(vvvare)
     d w_kpro          s                   like(flkpro)
     d w_lety          s                   like(vylety)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Input                                                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     iskwwpfr       01
     i                                          sffirm        L7
     i                                          swsrt1        L6
     i                                          swsrt2        L5
     i                                          swsrt3        L4
      *
     iskbul1r
     i              sbbu01                      sal(1)
     i              sbbu02                      sal(2)
     i              sbbu03                      sal(3)
     i              sbbu04                      sal(4)
     i              sbbu05                      sal(5)
     i              sbbu06                      sal(6)
     i              sbbu07                      sal(7)
     i              sbbu08                      sal(8)
     i              sbbu09                      sal(9)
     i              sbbu10                      sal(10)
     i              sbbu11                      sal(11)
     i              sbbu12                      sal(12)
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *  Cal_ulationn                                                   *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     dummy         tag
      *
      * Brudd på L6 (SRT1)
      *
     c   L6              do
     c                   eval      bnpi6 = 0
     c                   eval      bnpb6 = 0
     c                   eval      bnpf6 = 0
     c                   eval      bnii6 = 0
     c                   eval      bnif6 = 0
     c                   eval      bnib6 = 0
      *
     c                   eval      textl6 = *blank
     c                   move      swsrt1        beg
     c                   eval      rap = rp1
     c                   exsr      raprut
     c                   movel     rptek         textl6
      *
     c                   enddo
      /eject
      *
      * Brudd på L5 (SRT2)
      *
     c   L5              do
     c                   eval      bnpi5 = 0
     c                   eval      bnpb5 = 0
     c                   eval      bnpf5 = 0
     c                   eval      bnii5 = 0
     c                   eval      bnif5 = 0
     c                   eval      bnib5 = 0
      *
     c                   eval      textl5 = *blank
      *
     c                   if        rp2 <> *zeros
     c                   move      swsrt2        beg
     c                   eval      rap = rp2
     c                   exsr      raprut
     c                   movel     rptek         textl5
     c                   endif
      *
     c                   enddo
      /eject
      *
      * Brudd på L4 (SRT3)
      *
     c   L4              do
     c                   eval      bnpi4 = 0
     c                   eval      bnpb4 = 0
     c                   eval      bnpf4 = 0
     c                   eval      bnii4 = 0
     c                   eval      bnif4 = 0
     c                   eval      bnib4 = 0
      *
     c                   eval      textl4 = *blank
      *
     c                   if        rp3 <> *zeros
     c                   move      swsrt3        beg
     c                   eval      rap = rp3
     c                   exsr      raprut
     c                   movel     rptek         textl4
     c                   endif
      *
     c                   enddo
      /eject
      *
      * Summering av enkeltposter
      *
      * Sammenligning mot budsjett
      *
     c                   if        *in41 = *on
      *
     c                   if        w_buds <> 1
     c                   exsr      budsjett
     c                   endif
      *
     c                   endif
      *
      * Sammenlign mot i fjor
      *
     c                   if        *in42 = *on
      *
     c                   if        sfpaar < w_paar - 1
     c                   goto      xslutt
     c                   endif
      *
     c                   if        sfpaar = w_paar - 1
     c                   goto      ifjor
     c                   endif
      *
     c                   endif
      *
     c                   eval      w_rab = sfrab1 + sfrab2 + sfrabo             rabatt
     c                   eval      w_net = sfsumb - w_rab                       netto
     c                   eval      w_bid = w_net - sfsumk                       dekningsbidrag
      *
     c     iÅr           tag
      *
      * Summer til hittil i år
      *
     c                   if        sfpmnd <= w_pmnd
     c                   eval      bnii4 = bnii4  + w_net                       netto
     c                   endif
      *
      * Summer til denne periode i år
      *
     c                   if        sfpmnd = w_pmnd
     c                   eval      bnpi4 = bnpi4  + w_net                       netto
     c                   endif
      *
     c                   goto      xslutt
      *
     c     ifjor         tag
      *
     c                   eval      w_rab = sfrab1 + sfrab2 + sfrabo             rabatt
     c                   eval      w_net = sfsumb - w_rab                       netto
     c                   eval      w_bid = w_net - sfsumk                       dekningsbidrag
      *
      * Summer til hittil i fjor
      *
     c                   if        sfpmnd <= w_pmnd
     c                   eval      bnif4 = bnif4  + w_net                       netto
     c                   endif
      *
      * Summer til denne periode i fjor
      *
     c                   if        sfpmnd = w_pmnd
     c                   eval      bnpf4 = bnpf4  + w_net                       netto
     c                   endif
      *
     c                   goto      xslutt
      *
      /space 3
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     xslutt        tag
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Levelbrudd                                                      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
      * Brudd på L4  (SRT3)
      *
     cl4                 exsr      L4brd
     cl4                 if        swsrt3 <> *blank
     c                             and w_sps3 = ' '
     cl4                 write     lin1                                 30
     cl4 73              move      *on           *in30
     cl4                 exsr      overflow
     cl4                 endif
      *
      *
      * Brudd på L5  (SRT2)
      *
     cL5                 exsr      L5brd
     cL5                 if        swsrt2 <> *blank
     c                             and w_sps2 = ' '
     cL5                 write     lin1                                 30
     cL5 72              move      *on           *in30
     cL5                 exsr      overflow
     cL5                 endif
      *
     cL5 58              write     extra                                30
     cL5 58              exsr      overflow
      *
      * Brudd på L6  (SRT1)
      *
     cL6                 exsr      L6brd
     cL6                 if        swsrt1 <> *blank
     c                             and w_sps1 = ' '
     cL6                 write     lin1                                 30
     cL6 71              move      *on           *in30
     cL6                 exsr      overflow
      *
     cL6                 write     und1                                 30
     cL6 71              move      *on           *in30
     cL6                 exsr      overflow
     cL6                 endif
      *
      * Brudd på L7  (FIRMA)
      *
     cl7                 exsr      L7brd
     cl7                 if        w_sps4 = ' '
     cl7                 write     lin1                                 30
     cl7                 exsr      overflow
     cl7                 endif
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for behandling av brudd på L4 (SRT3)                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     L4brd         begsr
      *
      * Summer til neste nivå
      *
     c                   eval      bnpi5 = bnpi5 + bnpi4                        Netto d.p. i fjor
     c                   eval      bnpf5 = bnpf5 + bnpf4                        Netto d.p. i år
     c                   eval      bnpb5 = bnpb5 + bnpb4                        Brutto d.p. i år
     c                   eval      bnii5 = bnii5 + bnii4                        Netto hittil i år
     c                   eval      bnif5 = bnif5 + bnif4                        Netto hittil i fjor
     c                   eval      bnib5 = bnib5 + bnib4                        Rabatt hittil i år
      *
      *  Flytt til utskriftsfelt
      *
     c                   if        *in64 = *on
     c                   movel     swsrt3        vareu
     c                   movel     textl4        textu
      *
     c                   eval(h)   bnpiu = bnpi4                                Netto
     c                   eval(h)   bnpfu = bnpf4                                Netto i fjor
     c                   eval(h)   bnpbu = bnpb4                                Brutto
      *
     c                   eval(h)   bniiu = bnii4                                Netto
     c                   eval(h)   bnifu = bnif4                                Netto i fjor
     c                   eval(h)   bnibu = bnib4                                Rabatt
      *
      *
     c                   exsr      beregn
      *
     c                   endif
      *
     c                   endsr
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for behandling av brudd på L5 (SRT2)                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     L5brd         begsr
      *
      * Summer til neste nivå
      *
     c                   eval      bnpi6 = bnpi6 + bnpi5                        Netto d.p. i fjor
     c                   eval      bnpf6 = bnpf6 + bnpf5                        Netto d.p. i år
     c                   eval      bnpb6 = bnpb6 + bnpb5                        Brutto d.p. i år
     c                   eval      bnii6 = bnii6 + bnii5                        Netto hittil i år
     c                   eval      bnif6 = bnif6 + bnif5                        Netto hittil i fjor
     c                   eval      bnib6 = bnib6 + bnib5                        Rabatt hittil i år
      *
      *  Flytt til utskriftsfelt
      *
     c                   if        *in65 = *on
     c                   movel     swsrt2        vareu
     c                   movel     textl5        textu
      *
     c                   eval(h)   bnpiu = bnpi5                                Netto
     c                   eval(h)   bnpfu = bnpf5                                Netto i fjor
     c                   eval(h)   bnpbu = bnpb5                                Brutto
      *
     c                   eval(h)   bniiu = bnii5                                Netto
     c                   eval(h)   bnifu = bnif5                                Netto i fjor
     c                   eval(h)   bnibu = bnib5                                Rabatt
      *
     c                   exsr      beregn
      *
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for behandling av brudd på L6 (SRT1)                  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     L6brd         begsr
      *
      * Summer til neste nivå
      *
     c                   eval      bnpi7 = bnpi7 + bnpi6                        Netto d.p. i fjor
     c                   eval      bnpf7 = bnpf7 + bnpf6                        Netto d.p. i år
     c                   eval      bnpb7 = bnpb7 + bnpb6                        Brutto d.p. i år
     c                   eval      bnii7 = bnii7 + bnii6                        Netto hittil i år
     c                   eval      bnif7 = bnif7 + bnif6                        Netto hittil i fjor
     c                   eval      bnib7 = bnib7 + bnib6                        Rabatt hittil i år
      *
      *  Flytt til utskriftsfelt
      *
     c                   if        *in66 = *on
     c                   movel     swsrt1        vareu
     c                   movel     textl6        textu
      *
     c                   eval(h)   bnpiu = bnpi6                                Netto
     c                   eval(h)   bnpfu = bnpf6                                Netto i fjor
     c                   eval(h)   bnpbu = bnpb6                                Brutto
     c                   eval(h)   bniiu = bnii6                                Netto
     c                   eval(h)   bnifu = bnif6                                Netto i fjor
     c                   eval(h)   bnibu = bnib6                                Rabatt
      *
     c                   exsr      beregn
      *
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for behandling av brudd på L7 (FIRMA)                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     L7brd         begsr
      *
      *  Flytt til utskriftsfelt
      *
     c                   if        *in67 = *on
     c                   movel     l_firm        vareu
     c                   movel     l_fnav        textu
      *
     c                   eval(h)   bnpiu = bnpi7                                Netto
     c                   eval(h)   bnpfu = bnpf7                                Netto i fjor
     c                   eval(h)   bnpbu = bnpb7                                Brutto
      *
     c                   eval(h)   bniiu = bnii7                                Netto
     c                   eval(h)   bnifu = bnif7                                Netto i fjor
     c                   eval(h)   bnibu = bnib7                                Rabatt
      *
     c                   exsr      beregn
      *
     c                   endif
      *
     c                   endsr
      *
      /SPACE 3
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for behandling av overflow                            *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     overflow      begsr
      *
     c                   if        *in30 = *on
     c                   write     HD1A
     c                   endif
      *
     c                   endsr
      *
      /eject
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for beregning                                         *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     beregn        begsr
      *
     c                   eval      w_buds = 0                                   rabatt
      *
     c                   eval      bapfu = *zeros                               Brutto
     c                   eval      bapbu = *zeros                               Brutto
      *
     c                   eval      baifu = *zeros                               Brutto
     c                   eval      baibu = *zeros                               Brutto
      *
      * Beregn avvik i % - d.p.   (ifjor)
      *
     c                   if        bnpfu <> *zero
     c                   eval(h)   wbapfu = bnpiu * 100 / bnpfu
     c                   z-add     wbapfu        bapfu
     c                   endif
      *
      * Beregn avvik i % - d.p.   (budsjett)
      *
     c                   if        bnpbu <> *zero
     c                   eval(h)   wbapbu = bnpiu * 100 / bnpbu
     c                   z-add     wbapbu        bapbu
     c                   endif
      *
      * Beregn avvik i % - hittil (ifjor)
      *
     c                   if        bnifu <> *zero
     c                   eval(h)   wbaifu = bniiu * 100 / bnifu
     c                   z-add     wbaifu        baifu
     c                   endif
      *
      * Beregn avvik i % - hittil (budsjett)
      *
     c                   if        bnibu <> *zero
     c                   eval(h)   wbaibu = bniiu * 100 / bnibu
     c                   z-add     wbaibu        baibu
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for behandling av rapport                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     raprut        begsr
      *
     c                   eval      rptek = *blank
      *
      * ------------------
      * Alt. hovedgruppe
      * ------------------
      *
     c                   if        rap = 11
     c                   move      k2            w_hhgr
     c     hgrkey        chain     vahgl1                             50
     c                   if        *in50 = *off
     c                   movel     vfhtxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * -----------------
      * Alt. undergruppe
      * -----------------
      *
     c                   if        rap = 12
     c                   movel     k5            w_uhgr
     c                   move      k5            w_uugr
     c     ugrkey        chain     vaugl1                             50
     c                   if        *in50 = *off
     c                   movel     vfutxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ------------------
      * Overgruppe
      * ------------------
      *
     c                   if        rap = 14
     c                   movel     beg           w_xgrp
     c                   eval      w_oogr = w_xogr
     c     vogrl1_key    chain     vogrl1                             50
     c                   if        *in50 = *off
     c                   movel     vgotxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ------------------
      * Hovedgruppe
      * ------------------
      *
     c                   if        rap = 15
     c                   movel     beg           w_xgrp
     c                   eval      w_hogr = w_xogr
     c                   eval      w_hhgr = w_xhgr
     c     vhgrl1_key    chain     vhgrl1                             50
     c                   if        *in50 = *off
     c                   movel     vghtxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ------------------
      * Undergruppe
      * ------------------
      *
     c                   if        rap = 16
     c                   movel     beg           w_xgrp
     c                   eval      w_uogr = w_xogr
     c                   eval      w_uhgr = w_xhgr
     c                   eval      w_uugr = w_xugr
     c     vugrl1_key    chain     vugrl1                             50
     c                   if        *in50 = *off
     c                   movel     vgutxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Kundekategori
      * ---------------
      *
     c                   if        rap = 21
     c                   movel     k2            w_kkod
     c     ra11pf_key    chain     ra11pf                             50
     c                   if        *in50 = *off
     c                   movel     raktxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Rabattkategori
      * ---------------
      *
     c                   if        rap = 22
     c                   movel     k2            w_kkod
     c     ra06pf_key    chain     ra06pf                             50
     c                   if        *in50 = *off
     c                   movel     raftxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Distrikt
      * ---------------
      *
     c                   if        rap = 23
     c                   movel     k2            w_hkod
     c     ra08pf_key    chain     ra08pf                             50
     c                   if        *in50 = *off
     c                   movel     rahtxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Selger ordre
      * ---------------
      *
     c                   if        rap = 24
     c                   movel     k4            w_ikod
     c     ra09l1_key    chain     ra09l1                             50
     c                   if        *in50 = *off
     c                   movel     raitxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Land
      * ---------------
      *
     c                   if        rap = 25
     c                   movel     k3            w_lkod
     c     ra12pf_key    chain     ra12pf                             50
     c                   if        *in50 = *off
     c                   movel     raltxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Selger kasse
      * ---------------
      *
     c                   if        rap = 27
     c                   movel     k4            w_ikod
     c     ra09l1_key    chain     ra09l1                             50
     c                   if        *in50 = *off
     c                   movel     raitxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Varenr.
      * ---------------
      *
     c                   if        rap = 31
     c                   movel     beg           w_vare
     c     vvarl1_key    chain     vvarl1                             50
     c                   if        *in50 = *off
     c                   movel     vvtek1        rptek
     c                   endif
B002 C                   if        *in50 = *on
 001 C     vvarl1_key    chain     vvasl1                             50
B002 C                   if        *in50 = *off
 002 C                   movel     vvtek1        rptek
E002 C                   else
 002 C                   movel     sftek1        rptek
E002 C                   endif
E002 C                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Kunde
      * ---------------
      *
     c                   if        rap = 32
     c                   movel     k6            w_kund
     c     rkunl1_key    chain     rkunl1                             50
     c                   if        *in50 = *off
     c                   movel     rknavn        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Kundeprosjekt
      * ---------------
      *
B001 C                   if        rap = 33                                               .....
 001 C                   movel     k6            wwkpro
B001 C                   if        wwkpro <> *zeros                                       .....
 001 C                   move      sfvkun        wwkund
 001 C     fkprl1_key    chain     fkprl1                             50
B002 C                   if        *in50 = *off
 002 C                   movel     flnavn        rptek
E002 C                   endif
E002 C                   endif
 001 C                   goto      endrut
E001 C                   endif                                                            .....
      *
      * ---------------
      * FAKT.NR/KRED.NR
      * ---------------
      *
     c                   if        rap = 42
     c                   movel     'Fakt.nr/'    rpte1
     c                   movel     'Kred.nr '    rpte2
     c                   eval      rpte3 = *blank
     c                   movel     rpte2         rpte3
     c                   movel     rpte1         rptek
     c                   move      rpte3         rptek
     c                   endif
      *
      * ---------------
      * Fakturadato
      * ---------------
      *
     c                   if        rap = 43
     c                   movel     'Fakturad'    rpte1
     c                   movel     'ato     '    rpte2
     c                   eval      rpte3 = *blank
     c                   movel     rpte2         rpte3
     c                   movel     rpte1         rptek
     c                   move      rpte3         rptek
     c                   endif
      *
      * ---------------
      * Ordretype
      * ---------------
      *
     c                   if        rap = 51
     c                   movel     k2a           w_otyp
     c     votyl1_key    chain     votyl1                             50
     c                   if        *in50 = *off
     c                   movel     vaotxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Avdeling
      * ---------------
      *
     c                   if        rap = 52
     c                   movel     k2            w_gkod
     c     ra07pf_key    chain     ra07pf                             50
     c                   if        *in50 = *off
     c                   movel     ragtxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Lager
      * ---------------
      *
     c                   if        rap = 53
     c                   movel     k2            w_jkod
     c     ra10pf_key    chain     ra10pf                             50
     c                   if        *in50 = *off
     c                   movel     rajtxt        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ----------------
      * Produktansvarlig
      * ----------------
      *
     c                   if        rap = 54
     c                   movel     rt(54)        rptek
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Leveringstype
      * ---------------
      *
     c                   if        rap = 55
     c                   movel     rt(55)        rptek
     c                   movel     beg           w_lety
     c     vltpl1_key    chain     vltpl1                             50
     c                   if        *in50 = *off
     c                   movel     vybesk        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
      * ---------------
      * Leverandørnummer
      * ---------------
      *
     c                   if        rap = 56
     c                   movel     k6            w_levr
     c     rlevl1_key    chain     rlevl1                             50
     c                   if        *in50 = *off
     c                   movel     rlnavn        rptek
     c                   endif
     c                   goto      endrut
     c                   endif
      *
     c     endrut        endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Henter budsjett                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     budsjett      begsr
      *
     c                   eval      w_buds = 1                                   rabatt
      *
     c                   move      *zero         w_avde
     c                   move      *zero         w_lage
     c                   move      *blank        w_otyp
     c                   move      *blank        w_land
     c                   move      *zero         w_dist
     c                   move      *zero         w_selg
     c                   move      *zero         w_kkat
     c                   move      *zero         w_kund
     c                   move      *zero         w_ogrp
     c                   move      *zero         w_hgrp
     c                   move      *zero         w_ugrp
     c                   move      *blank        w_vare
      *
      * (11-52) (Avdeling)
      *
     c     wxkode_11     ifne      0
     c                   move      sfsavd        w_avde
     c                   endif
      *
      * (12-53) (Lager)
      *
     c     wxkode_12     ifne      0
     c                   move      sflage        w_lage
     c                   endif
      *
      * (13-51) (Ordretype)
      *
     c     wxkode_13     ifne      0
     c                   move      sfotyp        w_otyp
     c                   endif
      *
      * (21-25) (Land)
      *
     c     wxkode_21     ifne      0
     c                   move      sfland        w_land
     c                   endif
      *
      * (22-23) (Distrikt)
      *
     c     wxkode_22     ifne      0
     c                   move      sfdist        w_dist
     c                   endif
      *
      * (23-24) (Selger)
      *
     c     wxkode_23     ifne      0
     c                   move      sfselg        w_selg
     c                   endif
      *
      * (24-21) (Kundekategori)
      *
     c     wxkode_24     ifne      0
     c                   move      sfkkat        w_kkat
     c                   endif
      *
      * (25-32) (Kundenummer)
      *
     c     wxkode_25     ifne      0
     c                   move      sffkun        w_kund
     c                   endif
      *
      * (31-14) (Overgruppe)
      *
     c     wxkode_31     ifne      0
     c                   move      sfogrp        w_ogrp
     c                   endif
      *
      * (32-15) (Hovedgruppe)
      *
     c     wxkode_32     ifne      0
     c                   move      sfhgrp        w_hgrp
     c                   endif
      *
      * (33-16) (Undergruppe)
      *
     c     wxkode_33     ifne      0
     c                   move      sfugrp        w_ugrp
     c                   endif
      *
      * (34-31) (Varenummer)
      *
     c     wxkode_34     ifne      0
     c                   move      sfvare        w_vare
     c                   endif
      *
      * Hent inn opplysninger fra BUDSJETT-REGISTER   (Beløp)
      *
     c                   move      'B'           w_aabb
     c     budkey        chain     skbul1r                            90
     c     *in90         cabeq     *on           bud999
      *
     c                   eval      j = 0                                        dekningsbidrag
     c                   eval      bnib4 = 0
     c                   eval      bnpb4 = 0
      *
      * Summer til hittil i budsjett
      *
     c     1             do        w_pmnd        j
     c                   div       1000          sal(j)
     c                   add       sal(j)        bnib4
     c                   enddo
      *
      * Summer til denne periode i budsjett
      *
     c                   eval      j = w_pmnd
     c                   eval      bnpb4 = sal(j)
      *
     c     bud999        endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Danner riktig kode for budsjetnøkkelen                          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     hntwxk        begsr
      *
     c                   move      *zero         wxkode
      *
      * (11-52) (Avdeling)
      *
     c     w_srt1        ifeq      52
     c                   move      1             wxkode_11
     c                   endif
     c     w_srt2        ifeq      52
     c                   move      2             wxkode_11
     c                   endif
     c     w_srt3        ifeq      52
     c                   move      3             wxkode_11
     c                   endif
      *
      * (12-53) (Lager)
      *
     c     w_srt1        ifeq      53
     c                   move      1             wxkode_12
     c                   endif
     c     w_srt2        ifeq      53
     c                   move      2             wxkode_12
     c                   endif
     c     w_srt3        ifeq      53
     c                   move      3             wxkode_12
     c                   endif
      *
      * (13-51) (Ordretype)
      *
     c     w_srt1        ifeq      51
     c                   move      1             wxkode_13
     c                   endif
     c     w_srt2        ifeq      51
     c                   move      2             wxkode_13
     c                   endif
     c     w_srt3        ifeq      51
     c                   move      3             wxkode_13
     c                   endif
      *
      * (21-25) (Land)
      *
     c     w_srt1        ifeq      25
     c                   move      1             wxkode_21
     c                   endif
     c     w_srt2        ifeq      25
     c                   move      2             wxkode_21
     c                   endif
     c     w_srt3        ifeq      25
     c                   move      3             wxkode_21
     c                   endif
      *
      * (22-23) (Distrikt)
      *
     c     w_srt1        ifeq      23
     c                   move      1             wxkode_22
     c                   endif
     c     w_srt2        ifeq      23
     c                   move      2             wxkode_22
     c                   endif
     c     w_srt3        ifeq      23
     c                   move      3             wxkode_22
     c                   endif
      *
      * (23-24) (Selger)
      *
     c     w_srt1        ifeq      24
     c                   move      1             wxkode_23
     c                   endif
     c     w_srt2        ifeq      24
     c                   move      2             wxkode_23
     c                   endif
     c     w_srt3        ifeq      24
     c                   move      3             wxkode_23
     c                   endif
      *
      * (24-21) (Kundekategori)
      *
     c     w_srt1        ifeq      21
     c                   move      1             wxkode_24
     c                   endif
     c     w_srt2        ifeq      21
     c                   move      2             wxkode_24
     c                   endif
     c     w_srt3        ifeq      21
     c                   move      3             wxkode_24
     c                   endif
      *
      * (25-32) (Kundenummer)
      *
     c     w_srt1        ifeq      32
     c                   move      1             wxkode_25
     c                   endif
     c     w_srt2        ifeq      32
     c                   move      2             wxkode_25
     c                   endif
     c     w_srt3        ifeq      32
     c                   move      3             wxkode_25
     c                   endif
      *
      * (31-14) (Overgruppe)
      *
     c     w_srt1        ifeq      14
     c                   move      1             wxkode_31
     c                   endif
     c     w_srt2        ifeq      14
     c                   move      2             wxkode_31
     c                   endif
     c     w_srt3        ifeq      14
     c                   move      3             wxkode_31
     c                   endif
      *
      * (32-15) (Hovedgruppe)
      *
     c     w_srt1        ifeq      15
     c                   move      1             wxkode_32
     c                   endif
     c     w_srt2        ifeq      15
     c                   move      2             wxkode_32
     c                   endif
     c     w_srt3        ifeq      15
     c                   move      3             wxkode_32
     c                   endif
      *
      * (33-16) (Undergruppe)
      *
     c     w_srt1        ifeq      16
     c                   move      1             wxkode_33
     c                   endif
     c     w_srt2        ifeq      16
     c                   move      2             wxkode_33
     c                   endif
     c     w_srt3        ifeq      16
     c                   move      3             wxkode_33
     c                   endif
      *
      * (34-31) (Varenummer)
      *
     c     w_srt1        ifeq      31
     c                   move      1             wxkode_34
     c                   endif
     c     w_srt2        ifeq      31
     c                   move      2             wxkode_34
     c                   endif
     c     w_srt3        ifeq      31
     c                   move      3             wxkode_34
     c                   endif
      *
     c                   endsr
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * Subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
      *
     c     *inzsr        begsr
      *
     c                   eval      rptek = *blank
      *
      * Behandle kriterier for valg
      *
     c     *entry        plist
     c                   parm                    dstype           10
      *
      * Behandle valg-parameter
      *
     c                   eval      spfirm = l_firm
     c                   eval      sptype = dstype
     c                   eval      spkode = 00
      *
     c     skpml1_key    chain     skpml1r                            50
      *
     c                   movel     sprest        w_rest
      *
      * Legg ut tekster i heading
      *
     c                   eval      rp1 = w_srt1
     c                   eval      rp2 = w_srt2
     c                   eval      rp3 = w_srt3
      *
     c                   if        rp1 <> 0
     c                   eval      wwrt01 = rt(rp1)
     c                   endif
      *
     c                   if        rp2 <> 0
     c                   eval      wwrt02 = rt(rp2)
     c                   eval      *in57 = *on
     c                   endif
      *
     c                   if        rp3 <> 0
     c                   eval      wwrt03 = rt(rp3)
     c                   eval      *in58 = *on
     c                   endif
      *
      *
      * Sjekk sammenligning
      *
     c                   if        w_smli = ' '
     c                   eval      w_smli = 'B'
     c                   endif
      *
     c*>                 if        w_smli = 'B'
     c                   eval      *in41 = *on
     c*>                 endif
      *
     c                   if        w_smli = 'F'
     c                   eval      *in42 = *on
     c                   endif
      *
      * Sjekk summering
      *
     c                   eval      *in64 = w_sps1 = ' '                          BEGREP 1
     c                   eval      *in65 = w_sps2 = ' '                          BEGREP 2
     c                   eval      *in66 = w_sps3 = ' '                          BEGREP 3
     c                   eval      *in67 = w_sps4 = ' '                          FIRMA
      *
     c                   eval      *in70 = w_sps7 <> ' '                         BEGREP 1
     c                   eval      *in71 = w_sss1 <> ' '                         BEGREP 1
     c                   eval      *in72 = w_sss2 <> ' '                         BEGREP 1
     c                   eval      *in73 = w_sss3 <> ' '                         BEGREP 1
      *
      * Legger inn verdier i nøkklene
      *
     c                   move      l_firm        w_firm
     c                   move      w_paar        w_hhaa
     c                   move      'O '          w_vers
      *
     c***                time                    utime
     c***                eval      w_date = udate
      *
      * Hent inn budsjettnøkkel
      *
     c                   exsr      hntwxk
     c                   move      wxkode        w_kode
      *
      * Skriv første heading
      *
     c                   write     hd1a
      *
      * Key for vareregister
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_vare
      *
      * Key for kunderegister
      *
     c     rkunl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_kund
      *
      * Key for leverandørregister
      *
     c     rlevl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_levr
      *
      * Key for kundeprosjekt
      *
     c     fkprl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_kund
     c                   kfld                    w_kpro
      *
      * Key for alt. hovedgruppe
      *
     c     hgrkey        klist
     c                   kfld                    w_firm
     c                   kfld                    w_hhgr
      *
      * Key for alt. undergruppe
      *
     c     ugrkey        klist
     c                   kfld                    w_firm
     c                   kfld                    w_uhgr
     c                   kfld                    w_uugr
      *
      * Key for overgruppe
      *
     c     vogrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_oogr
      *
      * Key for hovedgruppe
      *
     c     vhgrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_hogr
     c                   kfld                    w_hhgr
      *
      * Key for undergruppe
      *
     c     vugrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_uogr
     c                   kfld                    w_uhgr
     c                   kfld                    w_uugr
      *
      * Key for ORDRETYPE
      *
     c     votyl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_otyp
      *
      * Key for RABATTKATEGORI
      *
     c     ra06pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_fkod
      *
      * Key for AVDELING
      *
     c     ra07pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_gkod
      *
      * Key for DISTRIKT
      *
     c     ra08pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_hkod
      *
      * Key for SELGER
      *
     c     ra09l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_ikod
      *
      * Key for LAGER
      *
     c     ra10pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_jkod
      *
      * Key for KUNDEKATEGORI
      *
     c     ra11pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_kkod
      *
      * Key for LAND
      *
     c     ra12pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_lkod
      *
      * Key for leveringstype
      *
     c     vltpl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    w_lety
      *
      * Key for BUDSJETT
      *
     c     budkey        klist
     c                   kfld                    w_firm
     c                   kfld                    w_hhaa
     c                   kfld                    w_vers
     c                   kfld                    w_kode
     c                   kfld                    w_aabb
     c                   kfld                    w_avde
     c                   kfld                    w_lage
     c                   kfld                    w_otyp
     c                   kfld                    w_land
     c                   kfld                    w_dist
     c                   kfld                    w_selg
     c                   kfld                    w_kkat
     c                   kfld                    w_kund
     c                   kfld                    w_ogrp
     c                   kfld                    w_hgrp
     c                   kfld                    w_ugrp
     c                   kfld                    w_vare
      *
      * Key for PARAMETER
      *
     c     skpml1_key    klist
     c                   kfld                    spfirm
     c                   kfld                    sptype
     c                   kfld                    spkode
     c                   kfld                    spvalg
      *
     c                   endsr
      *
      /eject
      **********************  T A B E L L E R  ***************************
**       RAPPORT  TEKSTER
Ledig 01                   01
Ledig 02                   02
Ledig 03                   03
Ledig                      04
Ledig                      05
Ledig                      06
Ledig                      07
Ledig                      08
Ledig                      09
Ledig                      10
Alt. hovedgruppe           11
Alt. undergruppe           12
Rabattgrp.                 13
Overgruppe                 14
Hovedgruppe                15
Undergruppe                16
Ledig                      17
Ledig                      18
Ledig                      19
Ledig                      20
Kundekategori              21
Rabattkateg.               22
Distrikt                   23
Selger ordre               24
Land                       25
Hgr.-kundekat.             26
Selger kasse               27
Ledig                      28
Ledig                      29
Ledig                      30
Varenummer                 31
Kunde                      32
Kundeprosjekt              33
Ledig                      34
Ledig                      35
Ledig                      36
Ledig                      37
Ledig                      38
Ledig                      39
Ledig                      40
Periode                    41
Faktnr/Krednr              42
Fakturadato                43
Ledig                      44
Ledig                      45
Ledig                      46
Ledig                      47
Ledig                      48
Ledig                      49
Ledig                      50
Ordretype                  51
Avdeling                   52
Lager                      53
Produktansvarlig           54
Leveringstype              55
Leverandør                 56
Time                       57
Ledig                      58
Ledig                      59
Ledig                      60
