      /TITLE  ASSTAT Spørring på kjøp, param.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASSTAT
      * Program . . . . : SI500R
      * Beskrivelse . . : Spørring på kjøp, param.
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       150198 HKO  Nytt program
      *       271000 KOB  Fjernet referanse til leveringsadresse
7.xx  * 7.00  031016 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fsistpf    if   e           k disk
     frlevl1    if   e           k disk    rename(rlevpfr:rlevl1r)
     f*klal1    if   e           k disk    rename(lklapfr:lklal1r)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     fvvasl1    if   e           k disk    rename(vvaspfr:vvasl1r)
      *
     fSI500d    cf   e             workstn
      *
      * Definering av Local data area
      *
     d                uds
     d l_firm                944    946  0
      *
      * Definering av variabler i nøkler
      *
     d rlevl1_levr     s                   like(rllevr)
     d*lklal1_levr     s                   like(llldor)
     d*lklal1_kode     s                   like(llkode)
     d vvarl1_vare     s                   like(vvvare)
     d vvasl1_vare     s                   like(vvvare)
      *
      * Definering av variable
      *
     d b_feil          s              1    inz(*off)
      *
     d w_dato          s               d   datfmt(*iso)
     d w_dato_alf      s             10
     d w_swtc          s              1  0
      *
     d w_firm          s                   like(sifirm)
     d w_vare          s                   like(sivare)
     d*w_adr1          s                   like(lladr1)
     d*w_adr2          s                   like(lladr2)
     d*w_sted          s                   like(lladr1)
     d*w_rkat          s                   like(llrkat)
     d*w_proj          s                   like(llproj)
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B1 Behandle åpningsbildet
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Initierer bildet
      *
     c                   time                    w_dato
     c                   move      w_dato        w_dato_alf
     c                   movel     w_dato_alf    b1paar
      *
      * Behandler bildet
      *
     c     b1taga        tag
     c                   exfmt     b1bld
      *
      * Behandling av standard funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      b1taga
     c                   endsl
      *
      * Sjekker input-felter
      *
     c                   exsr      sjekk_inp
     c                   if        b_feil = *on
     c                   eval      b_feil = *off
     c                   goto      b1taga
     c                   endif
      *
      * Kaller spørreprogram
      *
     c                   eval      w_dato = *loval
     c                   if        b1bida <> 0
     c     *dmy          move      b1bida        w_dato
     c                   endif
      *
     c                   if        b1vare = 0
      *
     c                   call      'SI501R'
     c                   parm                    w_firm
     c                   parm                    b1paar
     c                   parm                    b1valn
     c***                parm                    b1ladr
     c                   parm                    w_dato
      *
     c                   else
      *
     c                   movel     b1vare        w_vare
      *
     c                   call      'SI502R'
     c                   parm                    w_firm
     c                   parm                    b1paar
     c                   parm                    w_vare
     c                   parm                    b1valn
     c***                parm                    b1ladr
     c                   parm                    w_dato
      *
     c                   endif
      *
     c                   goto      b1taga
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Behandling av spørringer
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     spØrring      begsr
      *
      * Leverandør
      *
     c                   if        wactfe = 'B1VALN'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    b1valn
     c                   parm                    b1lnav
     c                   goto      end_spØrr
     c                   endif
      *
      * Leveringsadresse-kode
      *
     c***                if        wactfe = 'B1LADR'
     c***                CALL      'FSPKLR'
     c***                parm                    w_firm
     c***                parm                    b1valn
     c***                parm                    b1ladr
     c***                parm                    b1lnav
     c***                parm                    w_adr1
     c***                parm                    w_adr2
     c***                parm                    w_sted
     c***                parm                    w_rkat
     c***                parm                    w_proj
     c***                parm                    w_swtc
     c***                goto      end_spØrr
     c***                endif
      *
      * Varenummer
      *
     c                   if        wactfe = 'B1VARE'
     c                   movel     b1vare        w_vare
     c                   CALL      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    b1tek1
     c                   movel     w_vare        b1vare
     c                   goto      end_spØrr
     c                   endif
      *
     c     end_spØrr     endsr
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekker input-felter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_inp     begsr
      *
     c                   eval      b_feil = *off
      *
     c                   eval      b1lnav = *blank
     c                   eval      b1tek1 = *blank
      *
      * År
      *
     c                   if        b1bida <> 0
     c     *dmy          move      b1bida        w_dato
     c                   move      w_dato        w_dato_alf
     c                   movel     w_dato_alf    b1paar
     c                   endif
      *
     c                   if        b1paar = 0
     c                   eval      *in31  = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
      *
      * Dato
      *
     c                   if        b1bida <> 0
     c     *dmy          test(d)                 b1bida                 32
     c                   if        *in32
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
     c                   endif
      *
      * Leverandør / vare
      *
     c                   if        b1valn = 0 and
     c                             b1vare = 0
     c                   eval      *in33  = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
      *
      * Leverandør / leveringsadresse-kode
      *
     c                   if        b1valn <> 0
     c                   eval      rlevl1_levr = b1valn
     c     rlevl1_key    chain     rlevl1                             61
     c                   if        *in61
     c                   eval      *in34  = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
     c                   eval      b1lnav = rlnavn
     c                   endif
      *
     c***                if        b1valn = 0 and
     c***                          b1ladr <> 0
     c***                eval      *in35  = *on
     c***                eval      b_feil = *on
     c***                goto      end_sjekk
     c***                endif
      *
     c***                if        b1ladr <> 0
     c***                eval      lklal1_levr = b1valn
     c***                eval      lklal1_kode = b1ladr
     c***  lklal1_key    chain     lklal1                             61
     c***                if        *in61
     c***                eval      *in36  = *on
     c***                eval      b_feil = *on
     c***                goto      end_sjekk
     c***                endif
     c***                eval      b1lnav = llnavn
     c***                endif
      *
      * Varenummer
      *
     c                   if        b1vare <> 0
     c                   movel     b1vare        vvarl1_vare
     c     vvarl1_key    chain     vvarl1                             61
     c                   if        *in61 = *on
     c                   movel     b1vare        vvasl1_vare
     c     vvasl1_key    chain     vvasl1                             61
     c                   if        *in61 = *on
     c                   eval      *in37  = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
     c                   endif
     c                   eval      b1tek1 = vvtek1
     c                   endif
      *
     c     end_sjekk     endsr
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppslag på leverandør
      *
     c     rlevl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rlevl1_levr
      *
      * Key for oppslag på leverandør/leveringsadresse
      *
     c***  lklal1_key    klist
     c***                kfld                    w_firm
     c***                kfld                    lklal1_levr
     c***                kfld                    lklal1_kode
      *
      * Key for oppslag på vareregister
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarl1_vare
      *
      * Key for oppslag på register over slettede varer
      *
     c     vvasl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvasl1_vare
      *
      *
      * Henter firmakode fra LDA
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
