     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASSTAT
      * Program . . . . : SP529R
      * Beskrivelse . . : Endring av kunde-statistikk, Autoprogram
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
      * Datastruktur - parameter
      *
     d                 ds
     d d_parm                        96
     d  d_firm                       03  0 overlay(d_parm:01)
     d  d_paar                       04  0 overlay(d_parm:04)
     d  d_fper                       02  0 overlay(d_parm:08)
     d  d_tper                       02  0 overlay(d_parm:10)
     d  d_kkat                       01  0 overlay(d_parm:12)
     d  d_dist                       01  0 overlay(d_parm:13)
     d  d_selg                       01  0 overlay(d_parm:14)
     d  d_avde                       01  0 overlay(d_parm:15)
     d  d_lagr                       01  0 overlay(d_parm:16)
     d  d_nobb                       01  0 overlay(d_parm:17)
     d  d_nmod                       01  0 overlay(d_parm:18)
     d  d_ldor                       01  0 overlay(d_parm:19)
     d  d_lvar                       01  0 overlay(d_parm:20)
     d  d_vgrp                       01  0 overlay(d_parm:21)
     d  d_agrp                       01  0 overlay(d_parm:22)
      *
      * Definering av variable
      *
     d w_paar          s              4  0
     d w_jobq          s              1
      *
      * Definering av Local data area
      *
     d                uds
     d l_firm                944    946  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Arbeide med parameter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Legger inn verdier i parameter
      *
     c                   move      l_firm        d_firm
      *
     c                   move      1             d_kkat
     c                   move      1             d_dist
     c                   move      1             d_selg
     c                   move      0             d_avde
     c                   move      0             d_lagr
     c                   move      0             d_nobb
     c                   move      0             d_nmod
     c                   move      0             d_ldor
     c                   move      0             d_lvar
     c                   move      0             d_vgrp
     c                   move      0             d_agrp
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  Kaller opp neste 'CL'-program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Legg på jobbkø
      *
     c                   move      '1'           w_jobq
      *
      *  Kaller opp subprogram
      *
     c                   call      'SF528C'
     c                   parm                    d_parm
     c                   parm                    w_jobq
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Henter verdi til skjermbilde
      *
     c                   eval      d_paar = *year
     c                   eval      d_fper = 01
     c                   eval      d_tper = 12
      *
     c                   endsr
