      /TITLE  ASSTAT Utvalg til parameterfil, kampanje
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASSTAT
      * Program . . . . : SP144R
      * Beskrivelse . . : Utvalg til parameterfil, kampanje
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fsp144d    cf   e             workstn
      *
     fskpml1    if   e           k disk    rename(skpmpfr:skpml1r)
     fskpmlu    uf a e           k disk    rename(skpmpfr:skpmlur)
      *
     d wwfyll          s             10
     d wptext          s             30
     d wwfirm          s                   like(spfirm)
     d wwtype          s                   like(sptype)
     d wwkode          s                   like(spkode)
     d wptype          s                   like(sptype)
      *
     d wwrest          ds           330
     d wwtext                  1     30
     d wwkamp                 31     35
      *
     d                uds
     d dsuser                911    920
     d dsfirm                944    946  0
     d l_fnav                951    980
      *
     d wwvalg          ds
     d  wwfyl1                 1     15
      *
      *
      * bare data
      *
     c     b2tagb        tag
      *
      * slå opp
      * i filen
      *
     c                   movel     wwvalg        spvalg                                      .
     c     key01         chain     skpml1                             60
      *
      * post finnes
      * fra før
      *
     c                   if        *in60 = *off                                          .....
     c                   movel     sprest        wwrest                                      .
     c                   movel     wwkamp        b2kamp                                      .
      *                                                                                      .
     c                   endif                                                           .....
      *
      * post finnes
      * ikke
      *
     c                   if        *in60 = *on                                           .....
     c                   eval      b2kamp = *blank                                           .
     c                   endif                                                           .....
      *
     c                   exfmt     b2bld
      *
      * avslutt program
      *
     c     *inkc         cabeq     *on           xslutt
     c     *inkl         cabeq     *on           xslutt
      *
     c                   eval      sptype = wwtype
     c                   eval      spkode = wwkode
      *
     c     key01         chain     skpmlu                             60
      *
     c                   eval      wwkamp = b2kamp                                           .
     c                   eval      wwtext = 'Kampanje'                                       .
     c                   eval      sprest = wwrest
      * posten finnes
      * fra før
      *
     c                   if        *in60 = *off                                          .....
     c                   if        b2kamp = *blank                                       .....
     c                   delete    skpmlur                                                   .
     c                   else                                                                .
     C                   eval      spsyst = 'K'
     c                   update    skpmlur                                                   .
     c                   endif
     c                   endif
      *
      * posten finnes
      * ikke fra før
      *
     c                   if        *in60 = *on                                           .....
     c                   eval      sptype = wwtype
     c                   eval      spkode = wwkode
     c                   eval      spfirm = wwfirm
     c                   eval      spsyst = 'K'
     c                   write     skpmlur                                                   .
     c                   endif
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      * key for file nummerisk
      *
     c     key01         klist
     c                   kfld                    wwfirm
     c                   kfld                    wwtype
     c                   kfld                    wwkode
     c                   kfld                    wwvalg
      *
      *  tar inn parameter fra forrige program
      *
     c     *entry        plist
     c                   parm                    wptype
     c                   parm                    wptext
      *
     c                   eval      wwfirm = dsfirm
     c                   eval      spfirm = wwfirm
     c                   eval      wwtype = wptype
     c                   eval      wwkode = 44
     c                   eval      wwvalg = *blank
      *
     c                   eval      b2type = wptype
     c                   eval      b2text = wptext
      *
     c                   endsr
