      /TITLE  ASSTAT Utvalg til parameterfil, kampanje
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASSTAT
      * Program . . . . : SR144R
      * Beskrivelse . . : Utvalg til parameterfil, kampanje
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fSR144d    cf   e             workstn
      *
     fslpml1    if   e           k disk    rename(slpmpfr:slpml1r)
     fslpmlu    uf a e           k disk    rename(slpmpfr:slpmlur)
      *
     d wwfyll          s             10
     d wptext          s             30
     d wwfirm          s                   like(srfirm)
     d wwtype          s                   like(srtype)
     d wwkode          s                   like(srkode)
     d wptype          s                   like(srtype)
      *
     d wwrest          ds           330
     d wwtext                  1     30
     d wwkamp                 31     35
      *
     d                uds
     d dsuser                911    920
     d dsfirm                944    946  0
     d l_fnav                951    980
      *
     d wwvalg          ds
     d  wwfyl1                 1     15
      *
      *
      * bare data
      *
     c     b2tagb        tag
      *
      * slå opp
      * i filen
      *
     c                   movel     wwvalg        srvalg                                      .
     c     key01         chain     slpml1                             60
      *
      * post finnes
      * fra før
      *
     c                   if        *in60 = *off                                          .....
     c                   movel     srrest        wwrest                                      .
     c                   movel     wwkamp        b2kamp                                      .
      *                                                                                      .
     c                   endif                                                           .....
      *
      * post finnes
      * ikke
      *
     c                   if        *in60 = *on                                           .....
     c                   eval      b2kamp = *blank                                           .
     c                   endif                                                           .....
      *
     c                   exfmt     b2bld
      *
      * avslutt program
      *
     c     *inkc         cabeq     *on           xslutt
     c     *inkl         cabeq     *on           xslutt
      *
     c                   eval      srtype = wwtype
     c                   eval      srkode = wwkode
      *
     c     key01         chain     slpmlu                             60
      *
     c                   eval      wwkamp = b2kamp                                           .
     c                   eval      wwtext = 'Kampanje'                                       .
     c                   eval      srrest = wwrest
      * posten finnes
      * fra før
      *
     c                   if        *in60 = *off                                          .....
     c                   if        b2kamp = *blank                                       .....
     c                   delete    slpmlur                                                   .
     c                   else                                                                .
     C                   eval      srsyst = 'L'
     c                   update    slpmlur                                                   .
     c                   endif
     c                   endif
      *
      * posten finnes
      * ikke fra før
      *
     c                   if        *in60 = *on                                           .....
     c                   eval      srtype = wwtype
     c                   eval      srkode = wwkode
     c                   eval      srfirm = wwfirm
     c                   eval      srsyst = 'L'
     c                   write     slpmlur                                                   .
     c                   endif
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * avslutt program                                                 *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     xslutt        tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      /eject
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      * subrutine for initiering av program                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
      *
     c     *inzsr        begsr
      *
      * key for file nummerisk
      *
     c     key01         klist
     c                   kfld                    wwfirm
     c                   kfld                    wwtype
     c                   kfld                    wwkode
     c                   kfld                    wwvalg
      *
      *  tar inn parameter fra forrige program
      *
     c     *entry        plist
     c                   parm                    wptype
     c                   parm                    wptext
      *
     c                   eval      wwfirm = dsfirm
     c                   eval      srfirm = wwfirm
     c                   eval      wwtype = wptype
     c                   eval      wwkode = 44
     c                   eval      wwvalg = *blank
      *
     c                   eval      b2type = wptype
     c                   eval      b2text = wptext
      *
     c                   endsr
