      /TITLE  ASSTAT Sletting av poster - Salgsstatistikk
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * System. . . . . : ASSTAT
      * Program . . . . : SX510R
      * Beskrivelse . . : Sletting av poster - Salgsstatistikk
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *
8.01  *PRG2   220622 BOF  Utvidet prisgruppe fra 1 til 2 posisjoner - COMP
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fsstal1    uf   e           k disk    rename(sstapfr:sstal1r)
      *
     d sstal1_firm     s                   like(sffirm)
     d sstal1_paar     s                   like(sfpaar)
     d sstal1_binr     s                   like(sfbinr)
     d sstal1_line     s                   like(sfline)
     d sstal1_bida     s                   like(sfbida)
      *
      * Definering av LDA
      *
     d                uds
     d l_firm                944    946  0
     d l_navn                951    980
      *
      * Datastruktur for parameterliste - inn
      *
     d p_list          s             64
      *
     d                 ds
     d d_list                        64
     d  d_firm                        3  0 overlay(d_list:1)
     d  d_paar                        4  0 overlay(d_list:4)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sletting av poster
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Leser statistikkposter
      *
     c                   eval      sstal1_firm = d_firm
     c                   eval      sstal1_paar = 0
     c     sstal1_key    setll     sstal1r                                90
      *
     c     sstal1_les    tag
     c                   read      sstal1r                                90
      *
     c                   if        sffirm = d_firm and
     c                             sfpaar < d_paar
      *
     c                   delete    sstal1r
     c                   goto      sstal1_les
     c                   endif
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Paramtre
      *
     c     *entry        plist
     c                   parm                    p_list
      *
     c                   eval      d_list = p_list
      *
      * Key for statistikkposter
      *
     c     sstal1_key    klist
     c                   kfld                    sstal1_firm
     c                   kfld                    sstal1_paar
     c                   kfld                    sstal1_binr
     c                   kfld                    sstal1_line
     c                   kfld                    sstal1_bida
      *
     c                   endsr
