     h option(*nodebugio) datedit(*dmy)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASSTAT                                              *
      * Program . . . . : sx834r                                              *
      * Beskrivelse . . : Legger ukenr på SSTATPF                             *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
4.61  * 241104 bø  Nytt program                                             - *
8.01  *PRG2   220622 BOF  Utvidet prisgruppe fra 1 til 2 posisjoner - COMP
      *                                                                     - *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     fsstala    uf   e           k disk    rename(sstapfr:sstalar)
      *
     d p_aarr          s              4  0
     d p_week          s              2  0
     d p_fdat          s               d
     d p_tdat          s               d
     d p_stat          s              1
     d w_firm          s                   like(sffirm)
     d sstala_paar     s                   like(sfpaar)
      *
     d w_dat           s               d
      *
     d                uds
     d l_firm                944    946  0
      *
     c                   eval      sstala_paar = 2002
     c     sstala_key    setll     sstala
      *
     c                   read      sstala
     c                   dow       not %eof
     c                   if        sfpuke = 0
     c                   if        sfldat <> *loval
     c                   eval      w_dat  = sfldat
     c                   else
     c                   eval      w_dat  = sfbida
     c                   endif
     c                   eval      p_fdat = w_dat
     c                   call      'AX711R  '
     c                   parm                    p_fdat
     c                   parm                    p_aarr
     c                   parm                    p_week
     c                   parm                    p_stat
      *
     c                   if        p_week = 53
     c                   eval      p_week = 52
     c                   endif
     c                   if        p_week <> 0
     c                   eval      sfpuke = p_week
      *
     c                   update    sstalar
     c                   endif
      *
     c                   endif
      *
     c                   read      sstala
     c                   enddo
      *
     c                   eval      *inlr = *on
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     sstala_key    klist
     c                   kfld                    w_firm
     c                   kfld                    sstala_paar
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
      *
