     h option(*nodebugio) datedit(*dmy)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASSTAT                                              *
      * Program . . . . : SX832R                                              *
      * Beskrivelse . . : Legger ukenr på SISTPF                              *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
4.61  * 241104 bø  Nytt program                                             - *
      *                                                                     - *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     fsistla    uf   e           k disk    rename(sistpfr:sistlar)
      *
     d p_aarr          s              4  0
     d p_week          s              2  0
     d p_fdat          s               d
     d p_tdat          s               d
     d p_stat          s              1
     d w_firm          s                   like(sifirm)
     d sistla_paar     s                   like(sipaar)
      *
     d w_dat           s               d
      *
     d                uds
     d l_firm                944    946  0
      *
     c                   eval      sistla_paar = 2002
     c     sistla_key    setll     sistla
      *
     c                   read      sistla
     c                   dow       not %eof
     c                   if        sipuke = 0
     c                   if        sildat <> *loval
     c                   eval      w_dat  = sildat
     c                   else
     c                   eval      w_dat  = sibida
     c                   endif
     c                   eval      p_fdat = w_dat
     c                   call      'AX711R  '
     c                   parm                    p_fdat
     c                   parm                    p_aarr
     c                   parm                    p_week
     c                   parm                    p_stat
      *
     c                   if        p_week = 53
     c                   eval      p_week = 52
     c                   endif
     c                   if        p_week <> 0
     c                   eval      sipuke = p_week
      *
     c                   update    sistlar
     c                   endif
      *
     c                   endif
      *
     c                   read      sistla
     c                   enddo
      *
     c                   eval      *inlr = *on
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
     c     sistla_key    klist
     c                   kfld                    w_firm
     c                   kfld                    sistla_paar
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
      *
