     h option(*nodebugio) datedit(*dmy)
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * System. . . . . : ASSTAT                                              *
      * Program . . . . : sx833r                                              *
      * Beskrivelse . . : Finner leveringsdato fra historisk faktura          *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *
4.61  * 241104 bø  Nytt program                                             - *
8.01  *PRG2   220622 BOF  Utvidet prisgruppe fra 1 til 2 posisjoner - COMP
      *                                                                     - *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     fsstal1    up   e           k disk    rename(sstapfr:sstal1r)
     fsohelr    if   e           k disk    rename(sohepfr:sohelrr)
      *
     d sohelr_firm     s                   like(sofirm)
     d sohelr_aarr     s                   like(soaarr)
     d sohelr_binr     s                   like(sobinr)
     d p_aarr          s              4  0
     d p_week          s              2  0
     d p_fdat          s               d
     d p_tdat          s               d
     d p_stat          s              1
      *
     d w_dat           s               d
      *
     c                   if        sfldat = *loval
      * prøver å finne pakkseddeldato fra hist.fakt hode
readec                   eval      sohelr_firm = sffirm
readec                   eval      sohelr_aarr = sfpaar
readec                   eval      sohelr_binr = sfbinr
readec     sohelr_key    setll     sohelr
readec                   if        %found(sohelr)
readec                   dou       %eof(sohelr)
readec     sohelr_key    reade     sohelr
readec                   if        not %eof(sohelr)
     c                   if        sforda = sobdat
readec                   eval      sfldat = soldat
readec                   endif
readec                   endif
     c                   enddo
     c                   endif
      *
     c                   update    sstal1r
     c                   endif
      *
      *
      /EJECT
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for posisjonering på abc parameter
      *
     c     sohelr_key    klist
     c                   kfld                    sohelr_firm
     c                   kfld                    sohelr_aarr
     c                   kfld                    sohelr_binr
      *
     c                   endsr
      *
