     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : lx700rla
      * Beskrivelse . . : Lagerinfo  , innlesing fra fil - parameter
      *
      * Spesialversjon. :
      * Tilpasset for . : Bergersen
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       221018 bof  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     fafpslr    if   e           k disk    rename(afpspfr:afpslrr)
     fts845d    cf   e             workstn
      *
      * Definering av variabler i nøkler
      *
     d afpslr_ufil     s                   like(l_filg)
     d afpslr_uide     s                   like(afuide)
      *
      * Definering av Local data area
      *
     d                uds
     d l_filg                931    933
     d l_firm                944    946  0
      *
      * Definering av variable
      *
     d b_feil          s              1    inz(*off)
      *
     d w_ldox          s              6
     d w_ldor          s              6  0
     d w_firm          s              3  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B1 Behandle åpningsbildet
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Behandler bildet
      *
     c     a1taga        tag
      *
     c                   exfmt     a1bld
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   endsl
      *
      * Sjekker input-felter
      *
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      a1taga
     c                   endif
      *
      * Kaller program for henting av data, avbryter dersom feil
      *
     c                   if        a1ldor = 0
     c                   eval      a1ldor = 900099
     c                   endif
      *
     c                   call      'LKONVFORP'
     c                   parm                    a1ldor
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekker input-felter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_input   begsr
      *
     c                   eval      b_feil = *off
      *
     c                   if        a1ldor = 0
     c                   eval      b_feil = *on
     c                   endif
      *
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for propertiesfil
      *
     c     afpslr_key    klist
     c                   kfld                    afpslr_ufil
     c                   kfld                    afpslr_uide
      *
     c                   eval      w_firm = l_firm
     c                   eval      w_ldox = *blank
     c                   eval      afpslr_ufil = l_filg
     c                   eval      afpslr_uide = 'LOGILEV   '
      *
      * Sjekk om byggdok eller cobuilder aktivering er på/av
      *
     c     afpslr_key    chain     afpslrr
     c                   if        %found(afpslr)
     c                   eval      w_ldox = afudss
     c                   endif
     c                   if        w_ldox = *blank
     c                   eval      w_ldox = '900099'
     c                   endif
     c                   move      w_ldox        a1ldor
      * Henter firma fra LDA
      *
     c                   eval      w_firm = l_firm
      *
      * Initierer skjermbildet
      *
     c                   endsr
