     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : VA556R
      * Beskrivelse . . : Ordretype, velg
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fva556d    cf   e             workstn
      *
     fvotyl1    if   e           k disk    rename(votypfr:votyl1r)
      *
      * Definering av parametre
      *
     d p_retu          s              1
     d p_firm          s                   like(vaofir)
     d p_otyp          s                   like(vaotyp)
      *
      * Definering av variable i nøkler
      *
     d votyl1_otyp     s                   like(vaotyp)
      *
      * Definering av variable
      *
     d w_test          s              1  0
      *
     d w_firm          s                   like(vaofir)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B1 Behandling av vare/lager informasjon
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Nullstiller/blanker felter som skal benyttes
      *
     c                   eval      b1otyp = *blank
      *
      * Send Alt
      *
     c     b1tagb        tag
      *
     c                   exfmt     b1bld
      *
      * F3=Avslutt
      *
     c                   if        *inkc or *inkl
     c                   eval      p_retu = '9'
     c                   goto      avslutt
     c                   endif
      *
      * F4=Spørring
      *
     c                   if        *inkd = *on
     c                   call      'VA550R'
     c                   parm                    w_firm
     c                   parm                    b1otyp
     c                   goto      b1tagb
     c                   endif
      *
      * Sjekk, finnes ordretype i kode-register
      *
     c                   if        b1otyp <> *blank
     c                   eval      votyl1_otyp = b1otyp
     c     votyl1_key    chain     votyl1r                            90
     c                   if        *in90 = *on
     c                   eval      *in32 = *on
     c                   goto      b1tagb
     c                   endif
      *
     c                   if        vaosys <> w_test
     c                   eval      *in33 = *on
     c                   goto      b1tagb
     c                   endif
      *
     c                   endif
      *
      * Legger inn riktig lager i returen
      *
     c                   eval      p_otyp = b1otyp
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_retu
     c                   parm                    p_firm
     c                   parm                    p_otyp
      *
      * Key for oppslag på ordretype
      *
     c     votyl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    votyl1_otyp
      *
      *
     c                   eval      w_firm = p_firm
      *
     c                   move      p_retu        w_test
      *
     c                   eval      p_retu = *blank
     c                   eval      p_otyp = *blank
      *
     c                   endsr
