     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : VD760R
      * Beskrivelse . . : Spesialpris, innlesing fra fil - parameter
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       111110 BOF  Nytt program
7.xx  * 7.00  290916 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fra10l1    if   e           k disk    rename(ra10pfr:ra10l1r)
     fvshel1    if   e           k disk    rename(vshepfr:vshel1r)
      *
     fVD760D    cf   e             workstn
      *
      * Definering av variabler i nøkler
      *
     d ra10l1_jkod     s                   like(rajkod)
      *
      * Definering av Local data area
      *
     d                uds
     d l_firm                944    946  0
      *
      * Definering av variable
      *
     d b_feil          s              1    inz(*off)
      *
     d w_firm          s                   like(vcfirm)
     d w_jtxt          s                   like(rajtxt)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B1 Behandle åpningsbildet
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Behandler bildet
      *
     c     b1taga        tag
      *
     c                   exfmt     b1bld
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      b1taga
     c                   endsl
      *
      * Sjekker input-felter
      *
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      b1taga
     c                   endif
      *
      * Kaller program for henting av data, avbryter dersom feil
      *
     c                   if        b1fldr = *blank
     c                   eval      b1fldr = 'PRIS_INN'
     c                   endif
      *
     c                   call      'VD760C'
     c                   parm                    b1file
     c                   parm                    b1fldr
     c                   parm                    b_feil
      *
     c                   if        b_feil = *on
     c                   exfmt     b1msg
     c                   goto      b1taga
     c                   endif
      *
      * Kaller styreprogram
      *
     c                   call      'VD761R'
     c                   parm                    w_firm
     c                   parm                    b1vsor
     c                   parm                    b1lage
     c                   parm                    b1type
     c                   parm                    b1slet
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av spørring
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     spØrring      begsr
      *
      *
      * Rabattkategori
      *
     c                   if        w_afld = 'B1LAGE'
     c                   call      'RA510R'
     c                   parm                    w_firm
     c                   parm                    b1lage
     c                   parm                    b1ltxt
     c                   leavesr
     c                   endif
      *
      * Kundeprosjekt
      *
     c                   if        w_afld = 'B1VSOR'
     c                   call      'VC500R'
     c                   parm                    w_firm
     c                   parm                    b1vsor
     c                   parm                    b1besk
     c                   leavesr
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekker input-felter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_input   begsr
      *
     c                   eval      b_feil = *off
      *
     c                   if        b1vsor = *blank
     c                   eval      *in31 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
      * Lager-
     c                   if        b1lage <> 0
     c                   eval      ra10l1_jkod = b1lage
     c     ra10l1_key    chain     ra10l1                             33
     c                   if        *in32 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   endif
     c                   eval      b1ltxt = rajtxt
      * Type -
     c                   if        b1type <> *blank and
     c                             b1type <> 'V' and
     c                             b1type <> 'P' and
     c                             b1type <> 'C'
     c                   eval      *in33 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
      *
      * Filnavn
      *
     c                   if        b1file = *blank
     c                   eval      *in34  = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
      *
      * Mappe
     c                   if        b1fldr = *blank
     c                   eval      *in35  = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppslag på rabattkategori
      *
     c     ra10l1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra10l1_jkod
      *
      *
      * Henter firma fra LDA
      *
     c                   eval      w_firm = l_firm
      *
      * Initierer skjermbildet
      *
     c                   eval      b1fldr = 'PRIS_INN'
      *
     c                   endsr
