     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : VP410R
      * Beskrivelse . . : Sletting av priser fra VVPRPF ut fra csv.
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       240222 bof    Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvp410d    cf   e             workstn
      *
      * Local data area
      *
     d                uds
     d l_firm                944    946  0
     d l_filg                931    933
     d l_user                911    920
     d l_avde                947    950  0
      *
     d w_stat          s             10
     d w_fldr          s             30
     d w_tlib          s             10
     d w_tfil          s             10
     d w_tmbr          s             10
     d w_mld1          s             50

      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B1 Behandle åpningsbildet
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Behandler bildet
      *
     c     b1taga        tag
      *
     c                   exfmt     b1bld
      *
      * Behandling av funksjonstaster
      *
     c                   if        *inkc or *inkl
     c                   goto      avslutt
     c                   endif
      *
      *
      * Kaller program for henting av data, avbryter dersom feil
      *
     c                   if        b1file = *blank
     c                   eval      *in31 = *on
     c                   goto      b1taga
     c                   endif
      *
     c                   eval      w_fldr = *Blank
     c                   eval      w_fldr = '/asp/' + %trim(l_filg) +
     c                                      '/pcfiler'
     c                   eval      w_tlib = 'ADB' + %trim(l_filg)
     c                   eval      w_tfil = 'lwexpf'
9.01 c                   eval      w_tmbr = 'MBRVP410'

      *
     c                   eval      w_stat = *blank
     c                   call      'ASPFRSTMF'
     c                   parm                    b1file
     c                   parm                    w_fldr
     c                   parm                    w_tlib
     c                   parm                    w_tfil
     c                   parm                    w_tmbr
     c                   parm                    w_stat
      *
      * hvis status forskjellig fra blank, så gi melding
      *
     c                   if        w_stat <> *blank
     c                   eval      w_mld1 = 'Feil i innlesing av fil'
     c                   call      'AA005R'
     c                   parm                    w_mld1
     c                   goto      avslutt
     c                   endif
9.01 c                   call      'VP410C'
9.01 c                   parm                    w_tmbr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      *
      * Initierer skjermbildet
      *
     c                   eval      b1file = *blanks
      *
      *
     c                   endsr
