     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System. . . . . : ASOFAK
      * Program . . . . : VR601R
      * Beskrivelse . . : Vare-plakat, utskrift av plakatinformasjon
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       240506 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvplal1    if   e           k disk    rename(vplapfr:vplal1r)
     fafirl1    if   e           k disk    rename(afirpfr:afirl1r)
      *
     fvr601p    o    e             printer infds(d_infds)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
      *
      * Definering av datastrukturer
      *
      *  Datastruktur for parameterliste -inn
      *
     d                 ds
     d d_list                        80
     d  d_firm                        3  0 overlay(d_list)
     d  d_vare                       15    overlay(d_list:4)
     d  d_nobb                        8  0 overlay(d_list:19)
     d  d_eann                       13  0 overlay(d_list:27)
     d  d_saim                        9  2 overlay(d_list:40)
      *
      *  Informasjon fra printer-file
      *
     d d_infds         ds
     d  d_pagnbr             369    372B 0
      *
      * Definering av parametre
      *
     d p_list          s             80
      *
      * Definering av variabler i nøkler
      *
     d vplal1_vare     s                   like(vrvare)
      *
      * Definering av variable
      *
     d w_tmst          s             12  0
      *
     d w_firm          s                   like(vrfirm)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Utskrift
      *
      * Legger inn dato i faste felter
      *
     c                   time                    w_tmst
     c                   move      w_tmst        a1date
     c                   movel     w_tmst        a1time
      *
     c                   eval      a1user = l_user
      *
      * Henter firmaopplysninger
      *
     c     afirl1_key    chain     afirl1
     c                   eval      a1fnav = aafnav
      *
      * Henter plakatinformasjon
      *
     c                   eval      vplal1_vare = d_vare
     c     vplal1_key    chain     vplal1
     c                   if        not %found
     c                   goto      avslutt
     c                   endif
     c
      * Skriver header med plakatinformasjon
      *
     c                   eval      a1fnav = aafnav
      *
     c                   eval      a1type = vrtype
     c                   eval      a1form = vrform
     c                   eval      a1vare = vrvare
     c                   eval      a1nobb = d_nobb
     c                   eval      a1eann = d_eann
     c                   eval      a1enhe = vrenhe
     c                   eval      a1pris = vrpris
     c                   eval      a1saim = d_saim
     c                   eval      a1pnav = vrpnav
     c                   eval      a1merk = vrmerk
     c                   eval      a1tek1 = vrtek1
     c                   eval      a1tek2 = vrtek2
     c                   eval      a1tek3 = vrtek3
     c                   eval      a1tek4 = vrtek4
     c                   eval      a1tek5 = vrtek5
     c                   eval      a1tek6 = vrtek6
     c                   eval      a1bes1 = vrbes1
     c                   eval      a1bes2 = vrbes2
     c                   eval      a1bes3 = vrbes3
      *
     c                   write     a1hdr                                30
      *
      * Avslutt
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_list
      *
      * Key for oppslag på firma
      *
     c     afirl1_key    klist
     c                   kfld                    w_firm
      *
      * Key for oppslag på vare-plakat
      *
     c     vplal1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vplal1_vare
      *
      *
      * Splitter datastruktur i variable
      *
     c                   eval      d_list = p_list
      *
     c                   eval      w_firm = d_firm
      *
     c                   endsr
