     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : VT120R
      * Beskrivelse . . : Tilbudspriser, vedlikehold, kundeklubb
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       160599 HKO  Nytt program
      *       260405 HKO  Lagt inn test på at enhet må finnes på varen
5.70  * PRGR  261108 bof  Utvidet med prisgruppe
      * 6.10  260609 BSA  Oppdatert med sporingsinformasjon
6.11  * 6.10  061211 BSA  Må ta med seg prisgruppe ved vedlikehold
6.20  * 6.20  180411 NHO  Fil utvidet med varegruppe, leverandør og
      *                   prosentsatser
6.21  * 6.21  180411 bof  Utvidet med innkjøpspris mm.
6.22  * 6.20  090112 bof  Justert på sletting
6.23  * 6.20  060312 bsa  Varsel om at priser ikke endres for andre enn
6.23  *                   angitt enhet.
6.22  * 6.20  080312 bof  Utvidet kall til VP715r
6.nu  * R6.30 030614 bsa  Programmet gjennomgått mtp nummerutvidelser.
7.xx  * 7.00  040216 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
      *
8.01  *PRG2   150622 bsa  Utvidet prisgruppe fra 1 til 2 posisjoner
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      *       LR = Avslutt program
      *       10 = Roll
      *       11 = Rolldown
      *       12 = Sfldsp
      *       13 = Sfldspctl
      *       14 = Sflclr
      *       15 = Sflend
      *       21 = Home-key
      *       22 = Plassering av cursor
      *       30 = Protect av felter ved vise
      *    31-79 = Varsle m/feilmeldinger/skjermindikatorer
      *    80-99 = Arbeidsindikatorer
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fvklulr    if   e           k disk    rename(vklupfr:vklulrr)
     fvklulu    uf a e           k disk    rename(vklupfr:vklulur)
     fvklul1    if   e           k disk    rename(vklupfr:vklul1r)
     fvklul2    if   e           k disk    rename(vklupfr:vklul2r)
     fvklul3    if   e           k disk    rename(vklupfr:vklul3r)
     fvklul4    if   e           k disk    rename(vklupfr:vklul4r)
     fvklul5    if   e           k disk    rename(vklupfr:vklul5r)
5.70 fvklul6    if   e           k disk    rename(vklupfr:vklul6r)
6.20 fvklul8    if   e           k disk    rename(vklupfr:vklul8r)
6.20 fvklul9    if   e           k disk    rename(vklupfr:vklul9r)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     fvltpl1    if   e           k disk    rename(vltppfr:vltpl1r)
5.70 fra30l1    if   e           k disk    rename(ra30pfr:ra30l1r)
     fvvenl1    if   e           k disk    rename(vvenpfr:vvenl1r)
6.20 frlevl1    if   e           k disk    rename(rlevpfr:rlevl1r)
6.20 fvogrl1    if   e           k disk    rename(vogrpfr:vogrl1r)
6.20 fvhgrl1    if   e           k disk    rename(vhgrpfr:vhgrl1r)
6.20 fvugrl1    if   e           k disk    rename(vugrpfr:vugrl1r)
      *
     fvt120d    cf   e             workstn sfile(b1sfl:w_srrn)
     f                                     infds(dspfbk)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_firm                944    946  0
     d l_fnav                951    980
6.22 d l_lagr               1001   1002  0
      *
      * Definering av Information Data Structure - display feedback
      *
     d dspfbk          ds
     d  d_fcrn               378    379I 0
      *
      * Definering av variable i nøkler
      *
6.20 d vogrl1_oogr     s                   like(vgoogr)
6.20 d vhgrl1_hogr     s                   like(vghogr)
6.20 d vhgrl1_hhgr     s                   like(vghhgr)
6.20 d vugrl1_uogr     s                   like(vguogr)
6.20 d vugrl1_uhgr     s                   like(vguhgr)
6.20 d vugrl1_uugr     s                   like(vguugr)
6.20 d rlevl1_levr     s                   like(rllevr)
6.20 d vklulr_ogrp     s                   like(vtkogr)
6.20 d vklulr_hgrp     s                   like(vtkhgr)
6.20 d vklulr_ugrp     s                   like(vtkugr)
6.20 d vklulr_ldor     s                   like(vtkldo)
6.20 d vklul1_ogrp     s                   like(vtkogr)
6.20 d vklul1_hgrp     s                   like(vtkhgr)
6.20 d vklul1_ugrp     s                   like(vtkugr)
6.20 d vklul1_ldor     s                   like(vtkldo)
6.20 d vklul8_ldor     s                   like(vtkldo)
6.20 d vklul9_prgr     s                   like(vtkprg)
6.20 d vklul9_vare     s                   like(vtkvar)
6.20 d vklul9_lety     s                   like(vtklet)
     d vklulr_vare     s                   like(vtkvar)
5.70 d vklulr_prgr     s                   like(vtkprg)
     d vklulr_lety     s                   like(vtklet)
     d vklulr_fdat     s                   like(vtkfda)
     d vklulr_ftim     s                   like(vtkfti)
     d vklulr_tdat     s                   like(vtktda)
     d vklulr_ttim     s                   like(vtktti)
6.20 d vklulu_ogrp     s                   like(vtkogr)
6.20 d vklulu_hgrp     s                   like(vtkhgr)
6.20 d vklulu_ugrp     s                   like(vtkugr)
6.20 d vklulu_ldor     s                   like(vtkldo)
     d vklulu_vare     s                   like(vtkvar)
5.70 d vklulu_prgr     s                   like(vtkprg)
     d vklulu_lety     s                   like(vtklet)
     d vklulu_fdat     s                   like(vtkfda)
     d vklulu_ftim     s                   like(vtkfti)
     d vklulu_tdat     s                   like(vtktda)
     d vklulu_ttim     s                   like(vtktti)
     d vklul1_vare     s                   like(vtkvar)
5.70 d vklul1_prgr     s                   like(vtkprg)
     d vklul1_lety     s                   like(vtklet)
     d vklul2_lety     s                   like(vtklet)
     d vklul3_fdat     s                   like(vtkfda)
     d vklul4_tdat     s                   like(vtktda)
     d vklul5_kamp     s                   like(vtkkam)
5.70 d vklul6_prgr     s                   like(vtkprg)
     d vvarl1_vare     s                   like(vvvare)
     d vltpl1_lety     s                   like(vylety)
5.70 d ra30l1_dkod     s                   like(redkod)
     d vvenl1_vare     s                   like(vevare)
     d vvenl1_enhe     s                   like(veenhe)
      *
      * Definering av variable
      *
     d w_fcrn          s              4  0
     d w_stel          s              4  0
     d w_spge          s              4  0
     d w_srrn          s              4  0
     d w_sfrn          s                   like(w_srrn)
     d w_ssrn          s                   like(w_srrn)
      *
6.20 d w_gtxt          s                   like(vgutxt)
6.20 d w_lnav          s                   like(rlnavn)
6.20 d w_ogrp          s                   like(vguogr)
6.20 d w_hgrp          s                   like(vguhgr)
6.20 d w_ugrp          s                   like(vguugr)
6.20 d w_ldor          s                   like(vtkldo)
6.22 d w_lagr          s              2  0
     d w_seqe          s              1
6.21 d w_mvak          s              1
6.21 d w_mvtx          s             30
6.21 d w_mvas          s              6  2
6.21 d w_mvat          s              5  4
6.21 d w_mvaf          s             10  9
6.21 d w_date          s               d   datfmt(*iso)
6.21 d w_bpro          s              5  2
6.21 d w_stat          s              1
      *
     d b_oppr          s              1    inz(*off)
     d b_forn          s              1    inz(*off)
     d b_anul          s              1    inz(*off)
     d b_feil          s              1    inz(*off)
6.21 d b_enh1          s              1    inz(*off)
6.21 d b_enh2          s              1    inz(*off)
6.21 d b_enh3          s              1    inz(*off)
6.21 d b_nytt          s              1    inz(*off)
      *
     d w_udat          s               d   datfmt(*iso)
     d w_fdat          s              6  0
     d w_ftim          s              6  0
     d w_tdat          s              6  0
     d w_ttim          s              6  0
     d w_etxt          s             35
5.70 d w_ptxt          s             35
      *
     d s_fdat          s              6  0
     d s_ftim          s              4  0
     d s_tdat          s              6  0
     d s_ttim          s              4  0
      *
     d w_firm          s                   like(vtkfir)
     d w_vare          s                   like(vtkvar)
     d w_lety          s                   like(vtklet)
     d w_tek1          s                   like(vvtek1)
     d w_ltxt          s                   like(vybesk)
     d w_bup1          s                   like(vtkti1)
     d w_bup2          s                   like(vtkti2)
     d w_bup3          s                   like(vtkti3)
5.70 d w_prgr          s                   like(vtkprg)
      *
     d w_fdat_w        s                   like(vtkfda)
     d w_ftim_w        s                   like(vtkfti)
     d w_tdat_w        s                   like(vtktda)
     d w_ttim_w        s                   like(vtktti)
      *
6.20 d s_ogrp          s                   like(vtkogr)
6.20 d s_hgrp          s                   like(vtkhgr)
6.20 d s_ugrp          s                   like(vtkugr)
6.20 d s_ldor          s                   like(vtkldo)
     d s_vare          s                   like(vtkvar)
     d s_lety          s                   like(vtklet)
5.70 d s_prgr          s                   like(vtkprg)
6.23 d s_tip1          s                   like(c2tip1)
6.23 d s_tip2          s                   like(c2tip2)
6.23 d s_tip3          s                   like(c2tip3)
      *
      * Definering av konstanter
      *
     d c_sfil          s              2  0 inz(14)
      *
      * Forklaring på spesielle felter
      * som benyttes ved sub-files.
      * - - - - - - - - - - - - - - - - -
      * w_fcrn - Første recordnummer på siden
      * w_stel - Subfile-teller
      * w_spge - Sidestørrelse i subfile (page)
      * w_srrn - Relativt recordnummer i subfile
      * w_sfrn - Første recordnummer på siste side
      * w_ssrn - Siste recordnummer på siste side
      * w_curn - Current recordnummer på siden
      * w_virn - Side og cursorplassering som skal vises
      * w_afld - Aktivt feltnavn
      * w_arow - Aktiv rad for cursor
      * w_acol - Aktiv kolonne for cursor
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      * B1SFL  - B1 Subfile - record
      * B2CTL  - B2 Subfile - control record
      * B2CMD  - B2 Eget skjermbilde for CMD-taster
      * C1BLD  - C1 Skjermbilde for innlegging av nøkkel ved oppretting
      * C1MSG  - C1 Meleingsbilde for C1BLD
6.23  * C2MSG  - C2 Meldingsbilde for avslutning
      * C2BLD  - C2 Skjermbilde for opprette/endre/vise
      * D1WIN  - D1 Vindu for slette (Delete)
      * K1WIN  - K1 Vindu for kopiere
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B2CTL Behandle åpningsbildet med subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Send Alt
      *
     c     b2taga        tag
      *
     c                   write     b2cmd
      *
      * Bare data
      *
     c     b2tagb        tag
      *
     c                   exsr      dsp_subfile                                  DSP SFL
      *
      * Behandling av funksjonstaster
      *
     c                   select
6.20 c                   when      *inkk
6.20 c                   call      'VT101R'
6.22 c                   exsr      forny
6.20 c                   goto      b2tagb
6.20 c                   when      *inkh
6.20 c                   call      'VT102R'
6.20 c                   goto      b2tagb
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      b2tagb
     c                   when      *inke
     c                   exsr      forny
     c                   goto      b2tagb
     c                   when      *inkf
     c                   exsr      xc1bld
     c                   goto      b2taga
     c                   when      *in10
     c                   exsr      crt_subfile
     c                   goto      b2tagb
     c                   when      *in11
     c                   exsr      bck_subfile
     c                   goto      b2tagb
     c                   when      *in21
     c                   eval      *in22 = *on
     c                   goto      b2taga
     c                   endsl
      *
      *
6.20  * Posisjonering
6.20  *
6.20 c                   if        b2vare <> *blank or
6.20 c                             b2prgr <> *blank or
6.20 c                             b2lety <> 0 or
6.20 c                             b2fdat <> 0 or
6.20 c                             b2tdat <> 0 or
6.20 c                             b2kamp <> *blank
6.20 c                   exsr      posisjoner
6.20 c                   goto      b2tagb
6.20 c                   endif
6.20  *
      *
6.20 c                   if        b2ogrp <> 0 or
6.20 c                             b2ldor <> 0 or
     c*                  if        b2vare <> *blank or
5.70 c                             b2prgr <> *blank or
     c                             b2lety <> 0 or
     c                             b2fdat <> 0 or
     c                             b2tdat <> 0 or
     c                             b2kamp <> *blank
     c                   exsr      posisjoner
     c                   goto      b2tagb
     c                   endif
      *
      * Behandling av subfile
      *
     c                   exsr      subfile
      *
     c                   goto      b2taga
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for fornying av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     forny         begsr
      *
     c                   if        w_fcrn <> 0
     c     w_fcrn        chain     b1sfl
     c                   endif
      *
     c                   select
     c                   when      w_seqe = 'L'
     c                   eval      vklul2_lety = b1lety
     c     vklul2_key    setll     vklul2
     c                   when      w_seqe = 'F'
     c     *dmy          move      b1fdat        vklul3_fdat
     c     vklul3_key    setll     vklul3
     c                   when      w_seqe = 'T'
     c     *dmy          move      b1tdat        vklul4_tdat
     c     vklul4_key    setll     vklul4
     c                   when      w_seqe = 'K'
     c                   eval      vklul5_kamp = b1kamp
     c     vklul5_key    setll     vklul5
5.70 c                   when      w_seqe = 'P'
5.70 c                   eval      vklul6_prgr = b1prgr
6.70 c     vklul6_key    setll     vklul6
6.20 c                   when      w_seqe = 'D'
6.20 c                   eval      vklul8_ldor = b1ldor
6.20 c     vklul8_key    setll     vklul8
     c                   other
6.20 c                   eval      vklul1_ogrp = b1ogrp
6.20 c                   eval      vklul1_hgrp = b1hgrp
6.20 c                   eval      vklul1_ugrp = b1ugrp
6.20 c                   eval      vklul1_ldor = b1ldor
     c                   eval      vklul1_vare = b1vare
5.70 c                   eval      vklul1_prgr = b1prgr
     c                   eval      vklul1_lety = b1lety
     c     vklul1_key    setll     vklul1
     c                   endsl
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c     end_forny     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for posisjonering i subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     c     posisjoner    begsr
      * Posisjoner startverdi på varenummer
      *
     c                   if        b2vare <> *blank
     c                   eval      w_seqe = 'X'
6.20 c*                  eval      vklul1_vare = b2vare
6.20 c*                  eval      vklul1_prgr = b2prgr
6.20 c*                  eval      vklul1_lety = b2lety
6.20 c*    vklul1_key    setll     vklul1
6.20 c                   eval      vklul9_vare = b2vare
6.20 c                   eval      vklul9_prgr = b2prgr
6.20 c                   eval      vklul9_lety = b2lety
6.20 c     vklul9_key    setll     vklul9
6.20 c                   goto      end_pos
6.20 c                   endif
      *
6.20  * Posisjoner startverdi på vargr
      *
6.20 c*                  if        b2vare <> *blank
6.20 c                   if        b2ogrp <> *zeros
     c                   eval      w_seqe = ' '
6.20 c                   eval      vklul1_ogrp = b2ogrp
6.20 c                   eval      vklul1_hgrp = b2hgrp
6.20 c                   eval      vklul1_ugrp = b2ugrp
6.20 c                   eval      vklul1_ldor = b2ldor
     c                   eval      vklul1_vare = b2vare
5.70 c                   eval      vklul1_prgr = b2prgr
     c                   eval      vklul1_lety = b2lety
     c     vklul1_key    setll     vklul1
     c                   goto      end_pos
     c                   endif
6.20  *
6.20  * Posisjoner startverdi på varegruppe
6.20  *
6.20 c                   if        b2ldor <> 0
6.20 c                   eval      w_seqe = 'D'
6.20 c                   eval      vklul8_ldor = b2ldor
6.20 c     vklul8_key    setll     vklul8
6.20 c                   goto      end_pos
6.20 c                   endif
      *
5.70  *
5.70  * Posisjoner startverdi på prisgruppe
5.70  *
5.70 c                   if        b2prgr <> *blank
5.70 c                   eval      w_seqe = 'P'
5.70 c                   eval      vklul6_prgr = b2prgr
5.70 c     vklul6_key    setll     vklul6
5.70 c                   goto      end_pos
5.70 c                   endif
      *
      * Posisjoner startverdi på leveringstype
      *
     c                   if        b2lety <> 0
     c                   eval      w_seqe = 'L'
     c                   eval      vklul2_lety = b2lety
     c     vklul2_key    setll     vklul2
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på fra-dato
      *
     c                   if        b2fdat <> 0
     c                   eval      w_seqe = 'F'
     c     *dmy          test(d)                 b2fdat                 80
     c                   if        *in80 = *on
     c                   eval      vklul3_fdat = *hival
     c                   else
     c     *dmy          move      b2fdat        vklul3_fdat
     c                   endif
     c     vklul3_key    setll     vklul3
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på til-dato
      *
     c                   if        b2tdat <> 0
     c                   eval      w_seqe = 'T'
     c     *dmy          test(d)                 b2tdat                 80
     c                   if        *in80 = *on
     c                   eval      vklul4_tdat = *hival
     c                   else
     c     *dmy          move      b2tdat        vklul4_tdat
     c                   endif
     c     vklul4_key    setll     vklul4
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på kampanje
      *
     c                   if        b2kamp <> *blank
     c                   eval      w_seqe = 'K'
     c                   eval      vklul5_kamp = b2kamp
     c     vklul5_key    setll     vklul5
     c                   goto      end_pos
     c                   endif
5.70  *
5.70  * Posisjoner startverdi på prisgruppe
5.70  *
5.70 c                   if        b2kamp <> *blank
5.70 c                   eval      w_seqe = 'P'
5.70 c                   eval      vklul6_prgr = b2prgr
5.70 c     vklul6_key    setll     vklul6
5.70 c                   goto      end_pos
5.70 c                   endif
      *
     c     end_pos       tag
      *
      * Blanker subfile, og fyller opp i.h.t. posisjonering
      *
     c                   eval      *in22 = *off
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
      * Blanker posisjoneringsfelter
      *
6.20 c                   eval      b2ogrp = 0
6.20 c                   eval      b2hgrp = 0
6.20 c                   eval      b2ugrp = 0
6.20 c                   eval      b2ldor = 0
     c                   eval      b2vare = *blank
5.70 c                   eval      b2prgr = *blank
     c                   eval      b2lety = 0
     c                   eval      b2fdat = 0
     c                   eval      b2tdat = 0
     c                   eval      b2kamp = *blank
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     subfile       begsr
      *
     c                   eval      b_forn = *off
      *
     c                   if        *in22 = *off
     c                   eval      *in22 = *on
     c                   else
     c                   eval      *in22 = *off
     c                   endif
      *
     c                   eval      w_virn = w_fcrn
      *
      * Leser og behandler subfile
      *
     c                   do        w_ssrn
     c                   readc     b1sfl
      *
     c                   if        %eof
     c                   leave
     c                   endif
      *
     c                   eval      *in22 = *off
     c                   eval      w_virn = w_srrn
      *
      * Endre
      *
     c                   if        b1valg = 2
6.20 c                   eval      c1ogrp = b1ogrp
6.20 c                   eval      c1hgrp = b1hgrp
6.20 c                   eval      c1ugrp = b1ugrp
6.20 c                   eval      c1ldor = b1ldor
     c                   eval      c1vare = b1vare
     c                   eval      c1lety = b1lety
     c                   eval      c1fdat = b1fdat
     c                   eval      c1ftim = b1ftim
     c                   eval      c1tdat = b1tdat
     c                   eval      c1ttim = b1ttim
6.11 c                   eval      c1prgr = b1prgr
     c                   exsr      xc2bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Kopier
      *
     c                   if        b1valg = 3
6.20 c                   eval      k1ogrp = b1ogrp
6.20 c                   eval      k1hgrp = b1hgrp
6.20 c                   eval      k1ugrp = b1ugrp
6.20 c                   eval      k1ldor = b1ldor
     c                   eval      k1vare = b1vare
     c                   eval      k1vare = b1vare
     c                   eval      k1prgr = b1prgr
     c                   eval      k1lety = b1lety
     c                   eval      k1fdat = b1fdat
     c                   eval      k1ftim = b1ftim
     c                   eval      k1tdat = b1tdat
     c                   eval      k1ttim = b1ttim
     c                   exsr      xk1win
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Slett
      *
     c                   if        b1valg = 4
6.20 c                   eval      d1ogrp = b1ogrp
6.20 c                   eval      d1hgrp = b1hgrp
6.20 c                   eval      d1ugrp = b1ugrp
6.20 c                   eval      d1ldor = b1ldor
     c                   eval      d1vare = b1vare
     c                   eval      d1prgr = b1prgr
     c                   eval      d1lety = b1lety
     c                   eval      d1fdat = b1fdat
     c                   eval      d1ftim = b1ftim
     c                   eval      d1tdat = b1tdat
     c                   eval      d1ttim = b1ttim
     c                   exsr      xd1win
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Vis
      *
     c                   if        b1valg = 5
6.20 c                   eval      c1ogrp = b1ogrp
6.20 c                   eval      c1hgrp = b1hgrp
6.20 c                   eval      c1ugrp = b1ugrp
6.20 c                   eval      c1ldor = b1ldor
     c                   eval      c1vare = b1vare
     c                   eval      c1prgr = b1prgr
     c                   eval      c1lety = b1lety
     c                   eval      c1fdat = b1fdat
     c                   eval      c1ftim = b1ftim
     c                   eval      c1tdat = b1tdat
     c                   eval      c1ttim = b1ttim
     c                   exsr      xc2bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
     c                   enddo
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c     end_subfile   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av skjermbilde for ny rad (C1BLD)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc1bld        begsr
      *
     c                   eval      b_oppr = *on
     c                   eval      b_forn = *off
      *
6.20 c                   eval      c1ogrp = b2ogrp
6.20 c                   eval      c1hgrp = b2hgrp
6.20 c                   eval      c1ugrp = b2ugrp
6.20 c                   eval      c1ldor = b2ldor
     c                   eval      c1vare = b2vare
5.70 c                   eval      c1prgr = b2prgr
     c                   eval      c1lety = b2lety
     c                   eval      c1fdat = b2fdat
     c                   eval      c1ftim = 0
     c                   eval      c1tdat = b2tdat
     c                   eval      c1ttim = 2400
      *
     c                   exsr      hent_info
      *
     c     c1taga        tag
      *
     c                   exfmt     c1bld
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      end_c1bld
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      c1taga
     c                   endsl
      *
6.20 c                   if        c1ogrp = 0 and
6.20 c                             c1ldor = 0 and
6.20 c*                  if        c1vare = *blank and
6.20 c                             c1vare = *blank and
     c                             c1lety = 0 and
     c                             c1fdat = 0 and
     c                             c1tdat = 0
     c                   goto      end_c1bld
     c                   endif
      *
      * Sjekker input
      *
     c                   if        c1ttim = 0
     c                   eval      c1ttim = 2400
     c                   endif
      *
6.20 c                   eval      w_ogrp = c1ogrp
6.20 c                   eval      w_hgrp = c1hgrp
6.20 c                   eval      w_ugrp = c1ugrp
6.20 c                   eval      w_ldor = c1ldor
     c                   eval      w_vare = c1vare
5.70 c                   eval      w_prgr = c1prgr
     c                   eval      w_lety = c1lety
     c                   eval      w_fdat = c1fdat
     c                   eval      w_ftim = c1ftim * 100
     c                   eval      w_tdat = c1tdat
     c                   eval      w_ttim = c1ttim * 100
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      c1taga
     c                   endif
      *
      * Sender opp informasjonsbildet dersom rad finnes fra før
      *
6.20 c                   eval      vklulr_ogrp = c1ogrp
6.20 c                   eval      vklulr_hgrp = c1hgrp
6.20 c                   eval      vklulr_ugrp = c1ugrp
6.20 c                   eval      vklulr_ldor = c1ldor
     c                   eval      vklulr_vare = c1vare
     c                   eval      vklulr_prgr = c1prgr
     c                   eval      vklulr_lety = c1lety
     c     *dmy          move      c1fdat        vklulr_fdat
     c     *dmy          move      c1tdat        vklulr_tdat
     c                   eval      w_ftim = c1ftim * 100
     c     *hms          move      w_ftim        vklulr_ftim
     c                   eval      w_ttim = c1ttim * 100
     c     *hms          move      w_ttim        vklulr_ttim
     c     vklulr_key    chain     vklulr                             90
     c                   if        *in90 = *off
     c                   exsr      xc1msg
     c                   if        b_anul = *on
     c                   goto      c1taga
     c                   endif
     c                   endif
      *
      * Kaller vedlikeholdsprogram
      *
     c                   exsr      xc2bld
      *
6.20 c                   eval      c1ogrp = 0
6.20 c                   eval      c1hgrp = 0
6.20 c                   eval      c1ugrp = 0
6.20 c                   eval      c1ldor = 0
6.20 c                   eval      c1gtxt = *blank
6.20 c                   eval      c1lnav = *blank
     c                   eval      c1vare = *blank
5.70 c                   eval      c1prgr = *blank
     c                   eval      c1tek1 = *blank
     c                   eval      c1lety = 0
     c                   eval      c1ltxt = *blank
     c                   eval      c1fdat = 0
     c                   eval      c1ftim = 0
     c                   eval      c1tdat = 0
     c                   eval      c1ttim = 2400
      *
     c                   goto      c1taga
      *
     c     end_c1bld     tag
      *
     c                   eval      b_oppr = *off
     c                   eval      b2vare = *blank
5.70 c                   eval      b2prgr = *blank
     c                   eval      b2lety = 0
     c                   eval      b2fdat = 0
     c                   eval      b2tdat = 0
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for utlegging av opprettelsesmelding
      * Meldingsbildet legges ut dersom det forsøkes å opprette en rad som
      * finnes fra før.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc1msg        begsr
      *
     c                   eval      b_anul = *off
      *
     c                   exfmt     c1msg
      *
      * Behandling av funksjonstaster
      *
     c                   if        *inkc or *inkl
     c                   eval      b_anul = *on
     c                   goto      end_c1msg
     c                   endif
      *
     c     end_c1msg     endsr
      *
6.23  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.23  * Subrutine for utlegging av melding for oppdatering
6.23  * Meldingsbildet legges ut pom pris er endret for kun en enhet
6.23  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.23  *
6.23 c     xc2msg        begsr
6.23  *
6.23 c                   eval      b_anul = *off
6.23  *
6.23 c                   exfmt     c2msg
6.23  *
6.23  * Behandling av funksjonstaster
6.23  *
6.23 c                   if        *inkc or *inkl
6.23 c                   eval      b_anul = *on
6.23 c                   goto      end_c2msg
6.23 c                   endif
6.23  *
6.23 c     end_c2msg     endsr
6.23  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * C2BLD Behandle bilde for ny - endring - vise
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc2bld        begsr
      *
     c                   eval      w_arow = 0
     c                   eval      w_acol = 0
      *
6.20 c                   eval      vklulr_ogrp = c1ogrp
6.20 c                   eval      vklulr_hgrp = c1hgrp
6.20 c                   eval      vklulr_ugrp = c1ugrp
6.20 c                   eval      vklulr_ldor = c1ldor
     c                   eval      vklulr_vare = c1vare
     c                   eval      vklulr_prgr = c1prgr
     c                   eval      vklulr_lety = c1lety
     c     *dmy          move      c1fdat        vklulr_fdat
     c     *dmy          move      c1tdat        vklulr_tdat
     c                   eval      w_ftim = c1ftim * 100
     c     *hms          move      w_ftim        vklulr_ftim
     c                   eval      w_ttim = c1ttim * 100
     c     *hms          move      w_ttim        vklulr_ttim
     c     vklulr_key    chain     vklulr                             90
      *
     c                   if        *in90 = *off
      *
     c                   eval      *in80  = *off
     c                   eval      c2kamp = vtkkam
     c                   eval      c2enh1 = vtken1
     c                   eval      c2tip1 = vtkti1
6.23 c                   eval      s_tip1 = vtkti1
6.20 c                   eval      c2pro1 = vtkpr1
     c                   eval      c2kop1 = vtkko1
6.21 c                   eval      c2inp1 = vtkin1
     c                   eval      c2enh2 = vtken2
     c                   eval      c2tip2 = vtkti2
6.23 c                   eval      s_tip2 = vtkti2
     c                   eval      c2kop2 = vtkko2
6.21 c                   eval      c2inp2 = vtkin2
     c                   eval      c2enh3 = vtken3
     c                   eval      c2tip3 = vtkti3
6.23 c                   eval      s_tip3 = vtkti3
     c                   eval      c2kop3 = vtkko3
6.21 c                   eval      c2inp3 = vtkin3
     c                   eval      c2eusr = vtkeus
      *
     c                   eval      c2sap1 = 0
     c                   eval      c2sap2 = 0
     c                   eval      c2omr2 = 0
     c                   eval      c2sap3 = 0
     c                   eval      c2omr3 = 0
6.21 c                   eval      c2va01 = 0
6.21 c                   eval      c2va02 = 0
6.21 c                   eval      c2va03 = 0
      *
     c     *dmy          move      vtkeda        c2edat
      *
     c                   else
      *
     c                   eval      *in80  = *on
     c                   eval      c2kamp = *blank
     c                   eval      c2tip1 = 0
     c                   eval      c2kop1 = 0
6.21 c                   eval      c2inp1 = 0
6.20 c                   eval      c2pro1 = 0
     c                   eval      c2tip2 = 0
     c                   eval      c2kop2 = 0
6.21 c                   eval      c2inp2 = 0
     c                   eval      c2tip3 = 0
     c                   eval      c2kop3 = 0
6.21 c                   eval      c2inp3 = 0
6.21 c                   eval      c2va01 = 0
6.21 c                   eval      c2va02 = 0
6.21 c                   eval      c2va03 = 0
     c                   eval      c2edat = 0
6.23 c                   eval      s_tip1 = 0
6.23 c                   eval      s_tip2 = 0
6.23 c                   eval      s_tip3 = 0
     c                   eval      c2eusr = *blank
      *
     c                   eval      w_vare = c1vare
     c                   call      'VP715R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    c1prgr
6.22 c                   parm                    w_lagr
     c                   parm                    c1lety
     c                   parm                    w_udat
     c                   parm                    c2enh1
     c                   parm                    c2sap1
     c                   parm                    w_bup1
     c                   parm                    c2enh2
     c                   parm                    c2sap2
     c                   parm                    w_bup2
     c                   parm                    c2omr2
     c                   parm                    c2enh3
     c                   parm                    c2sap3
     c                   parm                    w_bup3
     c                   parm                    c2omr3
      *
     c                   endif
      *
     c                   if        b1valg = 3
6.20 c                   eval      c1ogrp = k1ogrp
6.20 c                   eval      c1hgrp = k1hgrp
6.20 c                   eval      c1ugrp = k1ugrp
6.20 c                   eval      c1ldor = k1ldor
     c                   eval      c1vare = k1vare
     c                   eval      c1prgr = k1prgr
     c                   eval      c1lety = k1lety
     c                   eval      c1fdat = k1fdat
     c                   eval      c1ftim = k1ftim
     c                   eval      c1tdat = k1tdat
     c                   eval      c1ttim = k1ttim
     c                   endif
      *
     c                   if        b1valg = 5
     c                   eval      *in30 = *on
     c                   endif
      *
6.20  *
6.20  * Dersom vare er utfyllt settes PR på feltet prosent
6.20 c                   if        c1vare > *blanks
6.20 c                   eval      *in48 = *on
6.20 c                   endif
      *
      * Henter beskrivelse av nivå
      *
     c                   exsr      hent_info
      *
      * Behandler bildet
      *
     c     c2taga        tag
      *
     c                   exfmt     c2bld
      *
     c                   if        *inkc or *inkl or *in30
     c                   goto      end_c2bld
     c                   endif
      *
6.20 c                   eval      w_ogrp = c1ogrp
6.20 c                   eval      w_hgrp = c1hgrp
6.20 c                   eval      w_ugrp = c1ugrp
6.20 c                   eval      w_ldor = c1ldor
     c                   eval      w_vare = c1vare
      *
      * Spørring
      *
     c                   if        *inkd = *on
      *
     c                   if        w_afld = 'C2ENH1'
     c                   call      'VE550R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    c2enh1
     c                   parm                    w_etxt
     c                   goto      c2taga
     c                   endif
      *
     c                   if        w_afld = 'C2ENH2'
     c                   call      'VE550R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    c2enh2
     c                   parm                    w_etxt
     c                   goto      c2taga
     c                   endif
      *
     c                   if        w_afld = 'C2ENH3'
     c                   call      'VE550R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    c2enh3
     c                   parm                    w_etxt
     c                   goto      c2taga
     c                   endif
      *
     c                   endif
      *
      * Validering av input
6.20  *
6.20  * Der varenr er utfylt kan ikke prosent angit
6.20 c                   if        c1vare > *blank and
6.20 c                             c2pro1 > *zeros
6.20 c                   eval      *in47 = *on
6.20 c                   goto      c2taga
6.20 c                   endif
6.20  * Sjekk varegr,leverandør, dersom fyllt ut må prosentsats oppgis
6.20 c                   if        c1ogrp > *zero and
6.20 c                             c2pro1 = *zeros
6.20 c                   eval      *in45 = *on
6.20 c                   goto      c2taga
6.20 c                   endif
6.20  *
6.20 c                   if        c1ldor > *zero and
6.20 c                             c2pro1 = *zeros
6.20 c                   eval      *in45 = *on
6.20 c                   goto      c2taga
6.20 c                   endif
6.20  *
6.20  * Sjekk tilb/salgs kostpris mot prosentsats
6.20 c                   if        c2pro1 > *zero
6.20 c                   if        c2tip1 > *zeros or
6.20 c                             c2kop1 > *zeros or
6.20 c                             c2tip2 > *zeros or
6.20 c                             c2kop2 > *zeros or
6.20 c                             c2tip3 > *zeros or
6.20 c                             c2kop3 > *zeros
6.20 c                   eval      *in46 = *on
6.20 c                   goto      c2taga
6.20 c                   endif
6.20 c                   endif
6.20  *
      *
6.20 c                   if        c1ogrp > 0 or
6.20 c                             c1ldor > 0
6.20 c                   goto      c4taga
     c                   if        c2tip1 = 0 and
     c                             c2tip2 = 0 and
     c                             c2tip3 = 0
     c                   eval      *in31 = *on
     c                   goto      c2taga
     c                   endif
6.20 c                   endif
6.20  *
6.20 c     c4taga        tag
      *
     c                   if        c2enh1 <> *blank
     c                   eval      vvenl1_vare = w_vare
     c                   eval      vvenl1_enhe = c2enh1
     c     vvenl1_key    chain     vvenl1                             91
     c                   if        *in91 = *on
     c                   eval      *in32 = *on
     c                   goto      c2taga
     c                   endif
     c                   endif
      *
     c                   if        c2tip1 <> 0 and
     c                             c2enh1 = *blank
     c                   eval      *in33 = *on
     c                   goto      c2taga
     c                   endif
      *
     c                   if        c2enh2 <> *blank
     c                   eval      vvenl1_vare = w_vare
     c                   eval      vvenl1_enhe = c2enh2
     c     vvenl1_key    chain     vvenl1                             91
     c                   if        *in91 = *on
     c                   eval      *in34 = *on
     c                   goto      c2taga
     c                   endif
     c                   endif
      *
     c                   if        c2tip2 <> 0 and
     c                             c2enh2 = *blank
     c                   eval      *in35 = *on
     c                   goto      c2taga
     c                   endif
      *
     c                   if        c2enh3 <> *blank
     c                   eval      vvenl1_vare = w_vare
     c                   eval      vvenl1_enhe = c2enh3
     c     vvenl1_key    chain     vvenl1                             91
     c                   if        *in91 = *on
     c                   eval      *in36 = *on
     c                   goto      c2taga
     c                   endif
     c                   endif
      *
     c                   if        c2tip3 <> 0 and
     c                             c2enh3 = *blank
     c                   eval      *in37 = *on
     c                   goto      c2taga
     c                   endif
6.21  *
6.21  * sjekker om innkl. mva er utfylt beregner i så fall tilbudspris
6.21  *
6.21 c                   eval      b_nytt = *off
6.21 c                   if        c2va01 <> 0
6.21 c                   eval      c2tip1 = c2tip1 * w_mvaf
6.21 c                   eval      b_nytt = *on
6.21 c                   endif
6.21  *
6.21 c                   if        c2va02 <> 0
6.21 c                   eval      c2tip2 = c2tip2 * w_mvaf
6.21 c                   eval      b_nytt = *on
6.21 c                   endif
6.21 c
6.21  *
6.21 c                   if        c2va03 <> 0
6.21 c                   eval      c2tip3 = c2tip3 * w_mvaf
6.21 c                   eval      b_nytt = *on
6.21 c                   endif
6.21 c
6.21  *
6.21  * sjekker om noe skal automatberegnes
6.21  *
6.21 c                   eval      b_enh1 = *off
6.21 c                   eval      b_enh2 = *off
6.21 c                   eval      b_enh3 = *off
6.21 c                   if        c2enh1 <> *blank and
6.21 c                             c2tip1 <> 0 and
6.21 c                             c2enh2 <> *blank and
6.21 c                             c2tip2 = 0
6.21 c                   eval      b_enh1 = *on
6.21 c                   exsr      auto_beregn
6.23 c                   eval      s_tip1 = c2tip1
6.23 c                   eval      s_tip2 = c2tip2
6.23 c                   eval      s_tip3 = c2tip3
6.21 c                   endif
6.21  *
6.21 c                   if        c2enh1 <> *blank and
6.21 c                             c2tip1 <> 0 and
6.21 c                             c2enh3 <> *blank and
6.21 c                             c2tip3 = 0
6.21 c                   eval      b_enh1 = *on
6.21 c                   exsr      auto_beregn
6.23 c                   eval      s_tip1 = c2tip1
6.23 c                   eval      s_tip2 = c2tip2
6.23 c                   eval      s_tip3 = c2tip3
6.21 c                   endif
6.21  *
6.21 c                   if        c2enh2 <> *blank and
6.21 c                             c2tip2 <> 0 and
6.21 c                             c2enh1 <> *blank and
6.21 c                             c2tip1 = 0
6.21 c                   eval      b_enh2 = *on
6.21 c                   exsr      auto_beregn
6.23 c                   eval      s_tip1 = c2tip1
6.23 c                   eval      s_tip2 = c2tip2
6.23 c                   eval      s_tip3 = c2tip3
6.21 c                   endif
6.21  *
6.21 c                   if        c2enh2 <> *blank and
6.21 c                             c2tip2 <> 0 and
6.21 c                             c2enh3 <> *blank and
6.21 c                             c2tip3 = 0
6.21 c                   eval      b_enh2 = *on
6.21 c                   exsr      auto_beregn
6.23 c                   eval      s_tip1 = c2tip1
6.23 c                   eval      s_tip2 = c2tip2
6.23 c                   eval      s_tip3 = c2tip3
6.21 c                   endif
6.21  *
6.21 c                   if        c2enh3 <> *blank and
6.21 c                             c2tip3 <> 0 and
6.21 c                             c2enh1 <> *blank and
6.21 c                             c2tip1 = 0
6.21 c                   eval      b_enh3 = *on
6.21 c                   exsr      auto_beregn
6.23 c                   eval      s_tip1 = c2tip1
6.23 c                   eval      s_tip2 = c2tip2
6.23 c                   eval      s_tip3 = c2tip3
6.21 c                   endif
6.21  *
6.21 c                   if        c2enh3 <> *blank and
6.21 c                             c2tip3 <> 0 and
6.21 c                             c2enh1 <> *blank and
6.21 c                             c2tip1 = 0
6.21 c                   eval      b_enh3 = *on
6.21 c                   exsr      auto_beregn
6.23 c                   eval      s_tip1 = c2tip1
6.23 c                   eval      s_tip2 = c2tip2
6.23 c                   eval      s_tip3 = c2tip3
6.21 c                   endif
      *
      * Organiserer input
      *
     c                   if        c2tip1 = 0
     c                   eval      c2enh1 = *blank
     c                   eval      c2kop1 = 0
     c                   endif
      *
     c                   if        c2tip2 = 0
     c                   eval      c2enh2 = *blank
     c                   eval      c2kop2 = 0
     c                   endif
      *
     c                   if        c2tip3 = 0
     c                   eval      c2enh3 = *blank
     c                   eval      c2kop3 = 0
     c                   endif
      *
     c                   if        c2tip2 = 0 and
     c                             c2tip3 <> 0
     c                   eval      c2enh2 = c2enh3
     c                   eval      c2tip2 = c2tip3
     c                   eval      c2kop2 = c2kop3
     c                   eval      c2enh3 = *blank
     c                   eval      c2tip3 = 0
     c                   eval      c2kop3 = 0
     c                   endif
      *
     c                   if        c2tip1 = 0 and
     c                             c2tip2 <> 0
     c                   eval      c2enh1 = c2enh2
     c                   eval      c2tip1 = c2tip2
     c                   eval      c2kop1 = c2kop2
     c                   eval      c2enh2 = c2enh3
     c                   eval      c2tip2 = c2tip3
     c                   eval      c2kop2 = c2kop3
     c                   eval      c2enh3 = *blank
     c                   eval      c2tip3 = 0
     c                   eval      c2kop3 = 0
     c                   endif
      *
6.21 c                   if        b_nytt = *on
6.21 c                   eval      c2va01 = 0
6.21 c                   eval      c2va02 = 0
6.21 c                   eval      c2va03 = 0
6.21 c                   eval      b_nytt = *off
6.21 c                   goto      c2taga
6.21 c                   endif
      *
      * Oppdatering av rad
      *
     c                   clear                   vklulur
      *
6.20 c                   eval      vklulu_ogrp = c1ogrp
6.20 c                   eval      vklulu_hgrp = c1hgrp
6.20 c                   eval      vklulu_ugrp = c1ugrp
6.20 c                   eval      vklulu_ldor = c1ldor
     c                   eval      vklulu_vare = c1vare
     c                   eval      vklulu_prgr = c1prgr
     c                   eval      vklulu_lety = c1lety
     c     *dmy          move      c1fdat        vklulu_fdat
     c     *dmy          move      c1tdat        vklulu_tdat
     c                   eval      w_ftim = c1ftim * 100
     c     *hms          move      w_ftim        vklulu_ftim
     c                   eval      w_ttim = c1ttim * 100
     c     *hms          move      w_ttim        vklulu_ttim
     c     vklulu_key    chain     vklulur                            90
      *
     c                   eval      vtkkam = c2kamp
     c                   eval      vtken1 = c2enh1
     c                   eval      vtkti1 = c2tip1
6.20 c                   eval      vtkpr1 = c2pro1
     c                   eval      vtkko1 = c2kop1
6.21 c                   eval      vtkin1 = c2inp1
     c                   eval      vtken2 = c2enh2
     c                   eval      vtkti2 = c2tip2
     c                   eval      vtkko2 = c2kop2
6.21 c                   eval      vtkin2 = c2inp2
     c                   eval      vtken3 = c2enh3
     c                   eval      vtkti3 = c2tip3
     c                   eval      vtkko3 = c2kop3
6.21 c                   eval      vtkin3 = c2inp3
     c                   eval      vtkeus = l_user
      *
     c                   time                    vtketi
     c                   time                    vtkeda
      *
     c                   if        *in90 = *off
     c                   update    vklulur
     c                   else
     c                   eval      vtkfir = w_firm
6.20 c                   eval      vtkogr = c1ogrp
6.20 c                   eval      vtkhgr = c1hgrp
6.20 c                   eval      vtkugr = c1ugrp
6.20 c                   eval      vtkldo = c1ldor
     c                   eval      vtkvar = c1vare
     c                   eval      vtkprg = c1prgr
     c                   eval      vtklet = c1lety
     c     *dmy          move      c1fdat        vtkfda
     c     *dmy          move      c1tdat        vtktda
     c                   eval      w_ftim = c1ftim * 100
     c     *hms          move      w_ftim        vtkfti
     c                   eval      w_ttim = c1ttim * 100
     c     *hms          move      w_ttim        vtktti
6.10 c                   time                    vtkoda
6.10 c                   time                    vtkoti
6.10 c                   eval      vtkeus = l_user
     c                   write     vklulur
     c                   endif
      * Sjekkm om pris er endret for kun en enhet
6.23 c                   if        s_tip1 > 0 and
6.23 c                             s_tip1 <> c2tip1
6.23 c                   exsr      xc2msg
6.23 c                   elseif    s_tip2 > 0 and
6.23 c                             s_tip2 <> c2tip2
6.23 c                   exsr      xc2msg
6.23 c                   elseif    s_tip3 > 0 and
6.23 c                             s_tip3 <> c2tip3
6.23 c                   exsr      xc2msg
6.23 c                   endif
      *
      * Oppdater subfile
      *
     c                   if        b1valg = 2
     c                   eval      b1kamp = c2kamp
     c                   eval      b1enh1 = c2enh1
     c                   eval      b1tip1 = c2tip1
     c                   endif
      *
     c                   if        b_oppr = *on or
     c                             b1valg = 3
     c                   eval      b_forn = *on
     c                   endif
      *
     c     end_c2bld     tag
      *
     c                   eval      *in30  = *off
6.20 c                   eval      *in48  = *off
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av slette-bildet (D1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xd1win        begsr
      *
6.20 c                   eval      vklulr_ogrp = d1ogrp
6.20 c                   eval      vklulr_hgrp = d1hgrp
6.20 c                   eval      vklulr_ugrp = d1ugrp
6.20 c                   eval      vklulr_ldor = d1ldor
     c                   eval      vklulr_vare = d1vare
     c                   eval      vklulr_prgr = d1prgr
     c                   eval      vklulr_lety = d1lety
     c     *dmy          move      d1fdat        vklulr_fdat
     c     *dmy          move      d1tdat        vklulr_tdat
     c                   eval      w_ftim = d1ftim * 100
     c     *hms          move      w_ftim        vklulr_ftim
     c                   eval      w_ttim = d1ttim * 100
     c     *hms          move      w_ttim        vklulr_ttim
     c     vklulr_key    chain     vklulr                             90
      *
     c                   exfmt     d1win
      *
     c                   if        *inkc or *inkl
     c                   goto      end_d1win
     c                   endif
      *
     c                   eval      b_forn = *on
      *
      * Sletter rad
      *
6.20 c                   eval      vklulu_ogrp = d1ogrp
6.20 c                   eval      vklulu_hgrp = d1hgrp
6.20 c                   eval      vklulu_ugrp = d1ugrp
6.20 c                   eval      vklulu_ldor = d1ldor
     c                   eval      vklulu_vare = d1vare
     c                   eval      vklulu_prgr = d1prgr
     c                   eval      vklulu_lety = d1lety
     c     *dmy          move      d1fdat        vklulu_fdat
     c     *dmy          move      d1tdat        vklulu_tdat
     c                   eval      w_ftim = d1ftim * 100
     c     *hms          move      w_ftim        vklulu_ftim
     c                   eval      w_ttim = d1ttim * 100
     c     *hms          move      w_ttim        vklulu_ttim
     c     vklulu_key    chain     vklulur                            90
     c                   delete    vklulur
      *
     c     end_d1win     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å behandle kopierings-bildet (K1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xk1win        begsr
      *
      * Tar vare på nøkkel til rad det skal kopieres fra
      *
6.20 c                   eval      s_ogrp = k1ogrp
6.20 c                   eval      s_hgrp = k1hgrp
6.20 c                   eval      s_ugrp = k1ugrp
6.20 c                   eval      s_ldor = k1ldor
     c                   eval      s_vare = k1vare
5.70 c                   eval      s_prgr = k1prgr
     c                   eval      s_lety = k1lety
     c                   eval      s_fdat = k1fdat
     c                   eval      s_ftim = k1ftim
     c                   eval      s_tdat = k1tdat
     c                   eval      s_ttim = k1ttim
      *
      * Fyller kopierings-bildet
      *
6.20 c                   eval      vklulr_ogrp = k1ogrp
6.20 c                   eval      vklulr_hgrp = k1hgrp
6.20 c                   eval      vklulr_ugrp = k1ugrp
6.20 c                   eval      vklulr_ldor = k1ldor
     c                   eval      vklulr_vare = k1vare
5.70 c                   eval      vklulr_prgr = k1prgr
     c                   eval      vklulr_lety = k1lety
     c     *dmy          move      k1fdat        vklulr_fdat
     c     *dmy          move      k1tdat        vklulr_tdat
     c                   eval      w_ftim = k1ftim * 100
     c     *hms          move      w_ftim        vklulr_ftim
     c                   eval      w_ttim = k1ttim * 100
     c     *hms          move      w_ttim        vklulr_ttim
     c     vklulr_key    chain     vklulr                             90
      *
     c                   eval      k2fdat = k1fdat
     c                   eval      k2ftim = k1ftim
     c                   eval      k2tdat = k1tdat
     c                   eval      k2ttim = k1ttim
      *
     c     k1taga        tag
      *
     c                   exfmt     k1win
      *
     c                   if        *inkc or *inkl
     c                   goto      end_k1win
     c                   endif
      *
      * Spørring
      *
     c                   if        *inkd = *on
     c                   exsr      spØrring
     c                   goto      k1taga
     c                   endif
      *
      * Sjekker input
      *
     c                   if        k1ttim = 0
     c                   eval      k1ttim = 2400
     c                   endif
      *
6.20 c                   eval      w_ogrp = k1ogrp
6.20 c                   eval      w_hgrp = k1hgrp
6.20 c                   eval      w_ugrp = k1ugrp
6.20 c                   eval      w_ldor = k1ldor
     c                   eval      w_vare = k1vare
5.70 c                   eval      w_prgr = k1prgr
     c                   eval      w_lety = k1lety
     c                   eval      w_fdat = k1fdat
     c                   eval      w_ftim = k1ftim * 100
     c                   eval      w_tdat = k1tdat
     c                   eval      w_ttim = k1ttim * 100
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      k1taga
     c                   endif
      *
      * Sjekker om rad finnes fra før
      *
6.20 c                   eval      vklulr_ogrp = k1ogrp
6.20 c                   eval      vklulr_hgrp = k1hgrp
6.20 c                   eval      vklulr_ugrp = k1ugrp
6.20 c                   eval      vklulr_ldor = k1ldor
     c                   eval      vklulr_vare = k1vare
     c                   eval      vklulr_prgr = k1prgr
     c                   eval      vklulr_lety = k1lety
     c     *dmy          move      k1fdat        vklulr_fdat
     c     *dmy          move      k1tdat        vklulr_tdat
     c                   eval      w_ftim = k1ftim * 100
     c     *hms          move      w_ftim        vklulr_ftim
     c                   eval      w_ttim = k1ttim * 100
     c     *hms          move      w_ttim        vklulr_ttim
     c     vklulr_key    chain     vklulr                             90
     c                   if        *in90 = *off
     c                   eval      *in32 = *on
     c                   goto      k1taga
     c                   endif
      *
      * Kaller vedlikeholdsprogram
      *
6.20 c                   eval      c1ogrp = s_ogrp
6.20 c                   eval      c1hgrp = s_hgrp
6.20 c                   eval      c1ugrp = s_ugrp
6.20 c                   eval      c1ldor = s_ldor
     c                   eval      c1vare = s_vare
5.70 c                   eval      c1prgr = s_prgr
     c                   eval      c1lety = s_lety
     c                   eval      c1fdat = s_fdat
     c                   eval      c1ftim = s_ftim
     c                   eval      c1tdat = s_tdat
     c                   eval      c1ttim = s_ttim
      *
     c                   exsr      xc2bld
      *
     c     end_k1win     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for tømming av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     clr_subfile   begsr
      *
     c                   eval      *in14 = *on
     c                   write     b2ctl
     c                   eval      *in14 = *off
      *
     c                   eval      *in15 = *off
     c                   eval      w_srrn = 0
     c                   eval      w_sfrn = 0
     c                   eval      w_ssrn = 0
     c                   eval      w_spge = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Fyll opp subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     crt_subfile   begsr
      *
     c                   eval      w_spge = w_spge + c_sfil
     c                   eval      w_srrn = w_ssrn
      *
     c                   dou       w_srrn = w_spge
      *
     c                   select
     c                   when      w_seqe = 'L'
     c                   read      vklul2
     c                   when      w_seqe = 'F'
     c                   read      vklul3
     c                   when      w_seqe = 'T'
     c                   read      vklul4
     c                   when      w_seqe = 'K'
     c                   read      vklul5
5.70 c                   when      w_seqe = 'P'
5.70 c                   read      vklul6
6.20 c                   when      w_seqe = 'D'
6.20 c                   read      vklul8
6.20 c                   when      w_seqe = 'X'
6.20 c                   read      vklul9
     c                   other
6.20 c                   read      vklul1
     c                   endsl
      *
     c                   if        %eof or
     c                             vtkfir <> w_firm
     c                   eval      *in15 = *on
     c                   leave
     c                   endif
      *
     c                   eval      w_srrn = w_srrn + 1
      *
     c                   select
     c                   when      w_seqe = 'L'
     c                   eval      vklul2_lety = vtklet
     c                   when      w_seqe = 'F'
     c                   eval      vklul3_fdat = vtkfda
     c                   when      w_seqe = 'T'
     c                   eval      vklul4_tdat = vtktda
     c                   when      w_seqe = 'K'
     c                   eval      vklul5_kamp = vtkkam
5.70 c                   when      w_seqe = 'P'
5.70 c                   eval      vklul6_prgr = vtkprg
     c                   other
6.20 c                   eval      vklul1_ogrp = vtkogr
6.20 c                   eval      vklul1_hgrp = vtkhgr
6.20 c                   eval      vklul1_ugrp = vtkugr
     c                   eval      vklul1_vare = vtkvar
5.70 c                   eval      vklul1_prgr = vtkprg
     c                   eval      vklul1_lety = vtklet
     c                   endsl
      *
6.20 c                   eval      b1ogrp = vtkogr
6.20 c                   eval      b1hgrp = vtkhgr
6.20 c                   eval      b1ugrp = vtkugr
6.20 c                   eval      b1ldor = vtkldo
     c                   eval      b1vare = vtkvar
     c                   eval      b1prgr = vtkprg
     c                   eval      b1tek1 = *blank
     c                   eval      b1lety = vtklet
     c                   eval      b1kamp = vtkkam
     c                   eval      b1enh1 = vtken1
     c                   eval      b1tip1 = vtkti1
      *
     c     *dmy          move      vtkfda        b1fdat
     c     *dmy          move      vtktda        b1tdat
      *
     c     *hms          move      vtkfti        w_ftim
     c                   movel     w_ftim        b1ftim
     c     *hms          move      vtktti        w_ttim
     c                   movel     w_ttim        b1ttim
      *
     c                   eval      vvarl1_vare = vtkvar
     c     vvarl1_key    chain     vvarl1                             91
     c                   if        *in91 = *off
     c                   eval      b1tek1 = vvtek1
     c                   endif
      *
     c                   write     b1sfl
      *
     c                   enddo
      *
     c                   if        w_srrn > w_ssrn
     c                   eval      w_sfrn = w_ssrn + 1
     c                   endif
      *
     c                   eval      w_ssrn = w_srrn
     c                   eval      w_virn = w_sfrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å bla tilbake en side i subfilen
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bck_subfile   begsr
      *
     c                   if        *in15
     c                   select
     c                   when      w_seqe = 'L'
     c     vklul2_key    setgt     vklul2
     c                   readp     vklul2
     c                   when      w_seqe = 'F'
     c     vklul3_key    setgt     vklul3
     c                   readp     vklul3
     c                   when      w_seqe = 'T'
     c     vklul4_key    setgt     vklul4
     c                   readp     vklul4
     c                   when      w_seqe = 'K'
     c     vklul5_key    setgt     vklul5
     c                   readp     vklul5
5.70 c                   when      w_seqe = 'P'
5.70 c     vklul6_key    setgt     vklul6
5.70 c                   readp     vklul6
6.20 c                   when      w_seqe = 'D'
6.20 c     vklul8_key    setgt     vklul8
6.20 c                   readp     vklul8
     c                   other
     c     vklul1_key    setgt     vklul1
     c                   readp     vklul1
     c                   endsl
     c                   endif
      *
      * Leser tilbake en side
      *
     c                   eval      w_stel = 0
      *
     c                   dou       w_stel = w_ssrn + c_sfil
      *
     c                   select
     c                   when      w_seqe = 'L'
     c                   readp     vklul2
     c                   when      w_seqe = 'F'
     c                   readp     vklul3
     c                   when      w_seqe = 'T'
     c                   readp     vklul4
     c                   when      w_seqe = 'K'
     c                   readp     vklul5
5.70 c                   when      w_seqe = 'P'
5.70 c                   readp     vklul6
     c                   other
     c                   readp     vklul1
     c                   endsl
      *
     c                   if        %eof or
     c                             vtkfir <> w_firm
     c                   leave
     c                   endif
      *
     c                   eval      w_stel = w_stel + 1
      *
     c                   select
     c                   when      w_seqe = 'L'
     c                   eval      vklul2_lety = vtklet
     c                   when      w_seqe = 'F'
     c                   eval      vklul3_fdat = vtkfda
     c                   when      w_seqe = 'T'
     c                   eval      vklul4_tdat = vtktda
     c                   when      w_seqe = 'K'
     c                   eval      vklul5_kamp = vtkkam
5.70 c                   when      w_seqe = 'P'
5.70 c                   eval      vklul6_prgr = vtkprg
     c                   other
6.20 c                   eval      vklul1_ogrp = vtkogr
6.20 c                   eval      vklul1_hgrp = vtkhgr
6.20 c                   eval      vklul1_ugrp = vtkugr
6.20 c                   eval      vklul1_ldor = vtkldo
     c                   eval      vklul1_vare = vtkvar
5.70 c                   eval      vklul1_prgr = vtkprg
     c                   eval      vklul1_lety = vtklet
     c                   endsl
      *
     c                   enddo
      *
     c                   if        %eof
     c                   select
     c                   when      w_seqe = 'L'
     c     vklul2_key    setll     vklul2
     c                   when      w_seqe = 'F'
     c     vklul3_key    setll     vklul3
     c                   when      w_seqe = 'T'
     c     vklul4_key    setll     vklul4
     c                   when      w_seqe = 'K'
     c     vklul5_key    setll     vklul5
5.70 c                   when      w_seqe = 'P'
5.70 c     vklul6_key    setll     vklul6
6.20 c                   when      w_seqe = 'D'
6.20 c     vklul8_key    setll     vklul8
     c                   other
     c     vklul1_key    setll     vklul1
     c                   endsl
     c                   endif
      *
      * Blanker og fyller opp subfile
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for display av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     dsp_subfile   begsr
      *
     c                   if        w_srrn <> 0
     c                   eval      *in12 = *on
     c                   else
     c                   write     b2cmd
     c                   endif
      *
     c                   eval      *in13 = *on
     c                   exfmt     b2ctl
      *
     c                   eval      *in12 = *off
     c                   eval      *in13 = *off
      *
     c                   eval      w_fcrn = d_fcrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av spørring
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     spØrring      begsr
      *
6.20  * Overgruppe
6.20  *
6.20 c                   if        w_afld = 'B2OGRP'
6.20 c                   call      'VG510R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    b2ogrp
6.20 c                   parm                    w_gtxt
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20 c                   if        w_afld = 'C1OGRP'
6.20 c                   call      'VG510R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    c1ogrp
6.20 c                   parm                    c1gtxt
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20 c                   if        w_afld = 'K1OGRP'
6.20 c                   call      'VG510R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    k1ogrp
6.20 c                   parm                    w_gtxt
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20  * Hovedgruppe
6.20  *
6.20 c                   if        w_afld = 'B2HGRP'
6.20 c                   call      'VG511R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    b2ogrp
6.20 c                   parm                    b2hgrp
6.20 c                   parm                    w_gtxt
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20 c                   if        w_afld = 'C1HGRP'
6.20 c                   call      'VG511R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    c1ogrp
6.20 c                   parm                    c1hgrp
6.20 c                   parm                    c1gtxt
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20 c                   if        w_afld = 'K1HGRP'
6.20 c                   call      'VG511R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    k1ogrp
6.20 c                   parm                    k1hgrp
6.20 c                   parm                    w_gtxt
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20  * Undergruppe
6.20  *
6.20 c                   if        w_afld = 'B2UGRP'
6.20 c                   call      'VG512R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    b2ogrp
6.20 c                   parm                    b2hgrp
6.20 c                   parm                    b2ugrp
6.20 c                   parm                    w_gtxt
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20 c                   if        w_afld = 'C1UGRP'
6.20 c                   call      'VG512R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    c1ogrp
6.20 c                   parm                    c1hgrp
6.20 c                   parm                    c1ugrp
6.20 c                   parm                    c1gtxt
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20 c                   if        w_afld = 'K1UGRP'
6.20 c                   call      'VG512R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    k1ogrp
6.20 c                   parm                    k1hgrp
6.20 c                   parm                    k1ugrp
6.20 c                   parm                    w_gtxt
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20  * Leverandør
6.20  *
6.20 c                   if        w_afld = 'B2LDOR'
6.20 c                   call      'RL500R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    b2ldor
6.20 c                   parm                    w_lnav
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20 c                   if        w_afld = 'C1LDOR'
6.20 c                   call      'RL500R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    c1ldor
6.20 c                   parm                    c1lnav
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20 c                   if        w_afld = 'K1LDOR'
6.20 c                   call      'RL500R'
6.20 c                   parm                    w_firm
6.20 c                   parm                    k1ldor
6.20 c                   parm                    w_lnav
6.20 c                   leavesr
6.20 c                   endif
      *
      * Varenummer
      *
     c                   if        w_afld = 'B2VARE'
     c                   eval      w_vare = b2vare
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    w_tek1
     c                   eval      b2vare = w_vare
     c                   goto      end_spØrr
     c                   endif
      *
     c                   if        w_afld = 'C1VARE'
     c                   eval      w_vare = c1vare
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    c1tek1
     c                   eval      c1vare = w_vare
     c                   goto      end_spØrr
     c                   endif
      *
     c                   if        w_afld = 'K1VARE'
     c                   eval      w_vare = k1vare
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    w_tek1
     c                   eval      k1vare = w_vare
     c                   goto      end_spØrr
     c                   endif
5.70  *
5.70  * Prisgruppe
5.70  *
5.70 c                   if        w_afld = 'B2PRGR'
5.70 c                   call      'RA530R'
5.70 c                   parm                    w_firm
5.70 c                   parm                    b2prgr
5.70 c                   parm                    w_ptxt
5.70 c                   leavesr
5.70 c                   endif
      *
      * Leveringstype
      *
     c                   if        w_afld = 'B2LETY'
     c                   call      'VY500R'
     c                   parm                    w_firm
     c                   parm                    b2lety
     c                   parm                    w_ltxt
     c                   goto      end_spØrr
     c                   endif
5.70  *
5.70 c                   if        w_afld = 'C1PRGR'
5.70 c                   call      'RA530R'
5.70 c                   parm                    w_firm
5.70 c                   parm                    c1prgr
5.70 c                   parm                    c1ptxt
5.70 c                   leavesr
5.70 c                   endif
      *
     c                   if        w_afld = 'C1LETY'
     c                   call      'VY500R'
     c                   parm                    w_firm
     c                   parm                    c1lety
     c                   parm                    c1ltxt
     c                   goto      end_spØrr
     c                   endif
5.70  *
5.70 c                   if        w_afld = 'K1PRGR'
5.70 c                   call      'RA530R'
5.70 c                   parm                    w_firm
5.70 c                   parm                    k1prgr
5.70 c                   parm                    c1ptxt
5.70 c                   leavesr
5.70 c                   endif
      *
     c                   if        w_afld = 'K1LETY'
     c                   call      'VY500R'
     c                   parm                    w_firm
     c                   parm                    k1lety
     c                   parm                    w_ltxt
     c                   goto      end_spØrr
     c                   endif
      *
     c     end_spØrr     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekker inntastede verdier, og henter beskrivelser
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_input   begsr
      *
     c                   eval      b_feil = *off
      *
     c                   eval      w_tek1 = *blank
     c                   eval      w_ltxt = *blank
6.20 c                   eval      w_gtxt = *blank
6.20 c                   eval      w_lnav = *blank
      *
6.20  * Dersom varegr/levnr er utfyllt kan ikke varenr angis
6.20  *
6.20 c                   if        w_ogrp > *zeros and
6.20 c                             w_vare > *blanks
6.20 c                   eval      *in56 = *on
6.20 c                   eval      b_feil = *on
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20 c                   if        w_ldor > 0 and
6.20 c                             w_vare > *blank
6.20 c                   eval      *in56 = *on
6.20 c                   eval      b_feil = *on
6.20 c                   leavesr
6.20 c                   endif
6.20  *
6.20  * Dersom varenr er utfyllt kan ikke varegr/levnr angis
6.20  *
6.20 c*                  if        w_vare > *blanks and
6.20 c*                            w_ogrp > *zeros or
6.20 c*                            w_ldor > *zeros
6.20 c*                  eval      *in57 = *on
6.20 c*                  eval      b_feil = *on
6.20 c*                  leavesr
6.20 c*                  endif
6.20  *
6.20  * Overgruppe
6.20  *
6.20  *
6.20 c                   if        w_ogrp <> 0
6.20 c                   eval      vogrl1_oogr = w_ogrp
6.20 c     vogrl1_key    chain     vogrl1                             51
6.20 c                   if        *in51 = *on
6.20 c                   eval      b_feil = *on
6.20 c                   leavesr
6.20 c                   endif
6.20 c                   eval      w_gtxt = vgotxt
6.20 c                   endif
6.20  *
6.20  * Hovedgruppe
6.20  *
6.20 c                   if        w_hgrp <> 0 and
6.20 c                             w_ugrp = 0
6.20 c                   eval      vhgrl1_hogr = w_ogrp
6.20 c                   eval      vhgrl1_hhgr = w_hgrp
6.20 c     vhgrl1_key    chain     vhgrl1                             52
6.20 c                   if        *in52 = *on
6.20 c                   eval      b_feil = *on
6.20 c                   leavesr
6.20 c                   endif
6.20 c                   eval      w_gtxt = vghtxt
6.20 c                   endif
6.20  *
6.20  * Undergruppe
6.20  *
6.20 c                   if        w_ugrp <> 0
6.20 c                   eval      vugrl1_uogr = w_ogrp
6.20 c                   eval      vugrl1_uhgr = w_hgrp
6.20 c                   eval      vugrl1_uugr = w_ugrp
6.20 c     vugrl1_key    chain     vugrl1                             53
6.20 c                   if        *in53 = *on
6.20 c                   eval      b_feil = *on
6.20 c                   leavesr
6.20 c                   endif
6.20 c                   eval      w_gtxt = vgutxt
6.20 c                   endif
6.20  *
6.20  * Leverandør
6.20  *
6.20 c                   if        w_ldor <> 0
6.20 c                   eval      rlevl1_levr = w_ldor
6.20 c     rlevl1_key    chain     rlevl1                             54
6.20 c                   if        *in54 = *on
6.20 c                   eval      b_feil = *on
6.20 c                   leavesr
6.20 c                   endif
6.20 c                   eval      w_lnav = rlnavn
6.20 c                   endif
      * Sjekk om komplett tilbudspris-nivå
      *
6.20 c*                  if        w_vare = *blank or
6.20 c*                            w_fdat = 0 or
6.20 c*                            w_tdat = 0
6.20 c*                  eval      *in31  = *on
6.20 c*                  eval      b_feil = *on
6.20 c*                  goto      end_sjekk
6.20 c*                  endif
      *
      * Varenummer
      *
     c                   if        w_vare <> *blank
     c                   eval      vvarl1_vare = w_vare
     c     vvarl1_key    chain     vvarl1                             35
     c                   if        *in35 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
     c                   eval      w_tek1 = vvtek1
     c                   endif
5.70  *
5.70  * Prisgruppe
5.70  *
5.70 c                   if        w_prgr <> *blank
5.70 c                   eval      ra30l1_dkod = w_prgr
5.70 c     ra30l1_key    chain     ra30l1                             36
5.70 c                   if        *in43 = *on
5.70 c                   eval      b_feil = *on
5.70 c                   goto      end_sjekk
5.70 c                   endif
5.70 c                   eval      w_ptxt = redtxt
5.70 c                   endif
      *
      * Leveringstype
      *
     c                   if        w_lety <> 0
     c                   eval      vltpl1_lety = w_lety
     c     vltpl1_key    chain     vltpl1                             36
     c                   if        *in36 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
     c                   eval      w_ltxt = vybesk
     c                   endif
      *
      * Dato/tidspunkt
      *
     c     *dmy          test(d)                 w_fdat                 37
     c                   if        *in37 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
      *
     c     *hms          test(t)                 w_ftim                 38
     c                   if        *in38 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
      *
     c     *dmy          test(d)                 w_tdat                 39
     c                   if        *in39 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
      *
     c     *hms          test(t)                 w_ttim                 40
     c                   if        *in40 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
      *
     c     *dmy          move      w_fdat        w_fdat_w
     c     *dmy          move      w_tdat        w_tdat_w
      *
     c                   if        w_fdat_w > w_tdat_w
     c                   eval      *in41  = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
      *
     c                   if        w_fdat_w = w_tdat_w
     c     *hms          move      w_ftim        w_ftim_w
     c     *hms          move      w_ttim        w_ttim_w
     c                   if        w_ftim_w > w_ttim_w
     c                   eval      *in42  = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk
     c                   endif
     c                   endif
      *
     c     end_sjekk     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Henter beskrivelse
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     hent_info     begsr
      *
     c                   eval      c1tek1 = *blank
     c                   eval      c1ltxt = *blank
6.20 c                   eval      c1gtxt = *blank
6.20 c                   eval      c1lnav = *blank
      *
6.20  * Undergruppe-tekst
6.20  *
6.20 c                   if        c1ugrp <> 0
6.20 c                   eval      vugrl1_uogr = c1ogrp
6.20 c                   eval      vugrl1_uhgr = c1hgrp
6.20 c                   eval      vugrl1_uugr = c1ugrp
6.20 c     vugrl1_key    chain     vugrl1                             91
6.20 c                   if        *in91 = *off
6.20 c                   eval      c1gtxt = vgutxt
6.20 c                   goto      vgrtxt
6.20 c                   endif
6.20 c                   endif
6.20  *
6.20  * Hovedgruppe-tekst
6.20  *
6.20 c                   if        c1hgrp <> 0 and
6.20 c                             c1ogrp <> 0
6.20 c                   eval      vhgrl1_hogr = c1ogrp
6.20 c                   eval      vhgrl1_hhgr = c1hgrp
6.20 c     vhgrl1_key    chain     vhgrl1                             91
6.20 c                   if        *in91 = *off
6.20 c                   eval      c1gtxt = vghtxt
6.20 c                   goto      vgrtxt
6.20 c                   endif
6.20 c                   endif
6.20  *
6.20  * Overgruppe-tekst
6.20  *
6.20 c                   if        c1ogrp <> 0
6.20 c                   eval      vogrl1_oogr = c1ogrp
6.20 c     vogrl1_key    chain     vogrl1                             91
6.20 c                   if        *in91 = *off
6.20 c                   eval      c1gtxt = vgotxt
6.20 c                   eval      b_feil = *on
6.20 c                   endif
6.20 c                   endif
6.20  *
6.20 c     vgrtxt        tag
6.20  *
6.20  * Leverandør
6.20  *
6.20 c                   if        c1ldor <> 0
6.20 c                   eval      rlevl1_levr = c1ldor
6.20 c     rlevl1_key    chain     rlevl1                             91
6.20 c                   if        *in91 = *off
6.20 c                   eval      c1lnav = rlnavn
6.20 c                   endif
6.20 c                   endif
      *
      * Varenummer
      *
     c                   if        c1vare <> *blank
     c                   eval      vvarl1_vare = c1vare
     c     vvarl1_key    chain     vvarl1                             91
     c                   if        *in91 = *off
     c                   eval      c1tek1 = vvtek1
     c                   endif
     c                   endif
5.70  *
5.70  * Prisgruppe
5.70  *
5.70 c                   if        c1prgr <> *blank
5.70 c                   eval      ra30l1_dkod = c1prgr
5.70 c     ra30l1_key    chain     ra30l1                             91
5.70 c                   if        *in91 = *off
5.70 c                   eval      c1ptxt = redtxt
5.70 c                   endif
5.70 c                   endif
      *
      * Leveringstype
      *
     c                   if        c1lety <> 0
     c                   eval      vltpl1_lety = c1lety
     c     vltpl1_key    chain     vltpl1                             91
     c                   if        *in91 = *off
     c                   eval      c1ltxt = vybesk
     c                   endif
     c                   endif
      *
     c                   endsr
6.21  *
6.21  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.21  * Subrutine for initiering av program
6.21  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
6.21  *
6.21 c     auto_beregn   begsr
6.21  *
6.21 c                   eval      b_nytt = *on
6.21  *
6.21 c                   if        b_enh1 = *on
6.21  * hvis enhet1 er fylt ut.
6.21 c                   if        c2enh2 <>*blank and
6.21 c                             c2tip2 = 0
6.21 c                   eval      c2tip2 = c2tip1 * c2omr2
6.21 c                   eval      c2kop2 = c2kop1 * c2omr2
6.21 c                   eval      c2inp2 = c2inp1 * c2omr2
6.21 c                   endif
6.21 c                   if        c2enh3 <>*blank and
6.21 c                             c2tip3 = 0
6.21 c                   eval      c2tip3 = c2tip1 * c2omr3
6.21 c                   eval      c2kop3 = c2kop1 * c2omr3
6.21 c                   eval      c2inp3 = c2inp1 * c2omr3
6.21 c                   endif
6.21  *
6.21 c                   endif
6.21 c                   if        b_enh2 = *on
6.21  * hvis enhet2 er fylt ut.
6.21 c                   if        c2enh1 <>*blank and
6.21 c                             c2tip1 = 0
6.21 c                   eval      c2tip1 = c2tip2 / c2omr2
6.21 c                   eval      c2kop1 = c2kop2 / c2omr2
6.21 c                   eval      c2inp1 = c2inp2 / c2omr2
6.21 c                   endif
6.21 c                   if        c2enh3 <>*blank and
6.21 c                             c2tip3 = 0
6.21 c                   eval      c2tip3 = (c2tip2 / c2omr2) * c2omr3
6.21 c                   eval      c2kop3 = (c2kop2 / c2omr2) * c2omr3
6.21 c                   eval      c2inp3 = (c2inp2 / c2omr2) * c2omr3
6.21 c                   endif
6.21  *
6.21 c                   endif
6.21  *
6.21 c                   if        b_enh3 = *on
6.21  * hvis enhet2 er fylt ut.
6.21 c                   if        c2enh1 <>*blank and
6.21 c                             c2tip1 = 0
6.21 c                   eval      c2tip1 = c2tip3 / c2omr3
6.21 c                   eval      c2kop1 = c2kop3 / c2omr3
6.21 c                   eval      c2inp1 = c2inp3 / c2omr3
6.21 c                   endif
6.21 c                   if        c2enh2 <>*blank and
6.21 c                             c2tip2 = 0
6.21 c                   eval      c2tip2 = (c2tip3 / c2omr3) * c2omr2
6.21 c                   eval      c2kop2 = (c2kop3 / c2omr3) * c2omr2
6.21 c                   eval      c2inp2 = (c2inp3 / c2omr3) * c2omr2
6.21 c                   endif
6.21  *
6.21 c                   endif
6.21  *
6.21 c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
6.20  * Key for oppslag på leverandør
6.20  *
6.20 c     rlevl1_key    klist
6.20 c                   kfld                    w_firm
6.20 c                   kfld                    rlevl1_levr
6.20  *
6.20  * Key for oppslag på overgruppe
6.20  *
6.20 c     vogrl1_key    klist
6.20 c                   kfld                    w_firm
6.20 c                   kfld                    vogrl1_oogr
6.20  *
6.20  * Key for oppslag på hovedgruppe
6.20  *
6.20 c     vhgrl1_key    klist
6.20 c                   kfld                    w_firm
6.20 c                   kfld                    vhgrl1_hogr
6.20 c                   kfld                    vhgrl1_hhgr
6.20  *
6.20  * Key for oppslag på undergruppe
6.20  *
6.20 c     vugrl1_key    klist
6.20 c                   kfld                    w_firm
6.20 c                   kfld                    vugrl1_uogr
6.20 c                   kfld                    vugrl1_uhgr
6.20 c                   kfld                    vugrl1_uugr
      *
      *
6.20 c     vklul9_key    klist
6.20 c                   kfld                    w_firm
6.20 c                   kfld                    vklul9_vare
6.20 c                   kfld                    vklul9_prgr
6.20 c                   kfld                    vklul9_lety
      *
      *
      * Key for oppslag på tilbudspriser
      *
     c     vklulr_key    klist
     c                   kfld                    w_firm
6.20 c                   kfld                    vklulr_ogrp
6.20 c                   kfld                    vklulr_hgrp
6.20 c                   kfld                    vklulr_ugrp
6.20 c                   kfld                    vklulr_ldor
     c                   kfld                    vklulr_vare
5.70 c                   kfld                    vklulr_prgr
     c                   kfld                    vklulr_lety
     c                   kfld                    vklulr_fdat
     c                   kfld                    vklulr_ftim
     c                   kfld                    vklulr_tdat
     c                   kfld                    vklulr_ttim
      *
      * Key for oppdatering av tilbudspriser
      *
     c     vklulu_key    klist
     c                   kfld                    w_firm
6.20 c                   kfld                    vklulu_ogrp
6.20 c                   kfld                    vklulu_hgrp
6.20 c                   kfld                    vklulu_ugrp
6.20 c                   kfld                    vklulu_ldor
     c                   kfld                    vklulu_vare
5.70 c                   kfld                    vklulu_prgr
     c                   kfld                    vklulu_lety
     c                   kfld                    vklulu_fdat
     c                   kfld                    vklulu_ftim
     c                   kfld                    vklulu_tdat
     c                   kfld                    vklulu_ttim
      *
      * Key for posisjonering på vare
      *
     c     vklul1_key    klist
     c                   kfld                    w_firm
6.20 c                   kfld                    vklul1_ogrp
6.20 c                   kfld                    vklul1_hgrp
6.20 c                   kfld                    vklul1_ugrp
6.20 c                   kfld                    vklul1_ldor
     c                   kfld                    vklul1_vare
5.70 c                   kfld                    vklul1_prgr
     c                   kfld                    vklul1_lety
6.20  *
6.20  * Key for posisjonering på leverandør
6.20  *
6.20 c     vklul8_key    klist
6.20 c                   kfld                    w_firm
6.20 c                   kfld                    vklul8_ldor
      *
      * Key for posisjonering på leveringstype
      *
     c     vklul2_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vklul2_lety
      *
      * Key for posisjonering på fra-dato
      *
     c     vklul3_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vklul3_fdat
      *
      * Key for posisjonering på til-dato
      *
     c     vklul4_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vklul4_tdat
      *
      * Key for posisjonering på kampanje
      *
     c     vklul5_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vklul5_kamp
5.70  *
5.70  * Key for posisjonering på prisgruppe
5.70  *
5.70 c     vklul6_key    klist
5.70 c                   kfld                    w_firm
5.70 c                   kfld                    vklul6_prgr
      *
      * Key for oppslag på vare
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarl1_vare
      *
      * Key for oppslag på leveringstype
      *
     c     vltpl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vltpl1_lety
5.70  *
5.70  * Key for oppslag på prisgruppe
5.70  *
5.70 c     ra30l1_key    klist
5.70 c                   kfld                    w_firm
5.70 c                   kfld                    ra30l1_dkod
      *
      * Key for oppslag på vare-enhet
      *
     c     vvenl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvenl1_vare
     c                   kfld                    vvenl1_enhe
      *
      *
      * Henter firmanummer fra LDA
      *
     c                   eval      w_firm = l_firm
6.22 c                   eval      w_lagr = l_lagr
6.21  *
6.21  * Hent mva % for beregning av tilbudspris inkl. mva
6.21  *
6.21 c                   eval      w_stat = *blank
6.21 c                   eval      w_mvak = '3'
6.21 c                   time                    w_date
6.21  *
6.21 c                   call      'RS205R'
6.21 c                   parm                    w_stat
6.21 c                   parm                    w_mvak
6.21 c                   parm                    w_mvtx
6.21 c                   parm                    w_date
6.21 c                   parm                    w_mvas
6.21 c                   parm                    w_mvat
6.21 c                   parm                    w_mvaf
6.21 c                   parm                    w_bpro
      *
      *
      * Initierer skjermbilde
      *
     c                   eval      *in22 = *on
      *
      * Henter dages dato
      *
     c                   time                    w_udat
      *
      * Posisjonerer databasen, og fyller opp subfile
      *
     c     vklul1_key    setll     vklul1
      *
     c                   exsr      crt_subfile
      *
     c                   endsr
