     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : VT701R
      * Beskrivelse . . : Kampanjefil, nnlesing fra fil - parameter
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       040619 bof  Nytt program
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *
     fvt711d    cf   e             workstn
      *
      * Definering av variabler i nøkler
      *
      *
      * Definering av Local data area
      *
     d                uds
     d l_fgrp                931    933
     d l_filg                934    939
     d l_firm                944    946  0
      *
      * Definering av variable
      *
     d b_feil          s              1    inz(*off)
      *
     d w_firm          s              3  0
     d w_stat          s             10
     d w_fldr          s             30
     d w_tlib          s             10
     d w_tfil          s             10
     d w_tmbr          s             10
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B1 Behandle åpningsbildet
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Behandler bildet
      *
     c                   eval      b1fldr = l_fgrp + '/PRIS_INN'
      *
     c     b1taga        tag
      *
     c                   exfmt     b1bld
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   endsl
      *
      * Sjekker input-felter
      *
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      b1taga
     c                   endif
      *
      * Kaller program for henting av data, avbryter dersom feil
      *
     c                   if        b1fldr = *blank
     c                   eval      b1fldr = l_fgrp + '/PRIS_INN'
     c                   endif
      *
     c                   eval      w_fldr = *Blank
     c                   eval      w_fldr = '/asp/' + %trim(b1fldr)
     c                   eval      w_tlib = l_filg
     c                   eval      w_tfil = 'flvwpf'
     c                   eval      w_tmbr = 'flvwpf'
      *
     c                   eval      w_stat = *blank
     c                   call      'ASPFRSTMF'
     c                   parm                    b1file
     c                   parm                    w_fldr
     c                   parm                    w_tlib
     c                   parm                    w_tfil
     c                   parm                    w_tmbr
     c                   parm                    w_stat
      *
     c                   if        w_stat <> *blank
     c                   exfmt     b1msg
     c                   goto      b1taga
     c                   endif
      *
      * Kaller styreprogram
      *
     c                   call      'VT712R'
     c                   parm                    w_firm
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekker input-felter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_input   begsr
      *
     c                   eval      b_feil = *off
      *
     c                   if        b1file = *blank
     c                   eval      b_feil = *on
     c                   endif
      *
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      * Henter firma fra LDA
      *
     c                   eval      w_firm = l_firm
      *
      * Initierer skjermbildet
      *
     c                   eval      b1fldr = 'PRIS_INN'
      *
     c                   endsr
