     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : VV590R
      * Beskrivelse . . : Vare, pris/etikett - radioterminal - velge kunde
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       111000 HKO  Nytt program
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     frkunl1    if   e           k disk    rename(rkunpfr:rkunl1r)
      *
     fvv590d    cf   e             workstn
      *
      * Definering av LDA (Local Data Area)
      *
     d                uds
     d l_firm                944    946  0
      *
      * Definering av variabler i nøkler
      *
     d rkunl1_kund     s                   like(rkkund)
      *
      * Definering av variable
      *
     d b_feil          s              1    inz(*off)
      *
     d w_firm          s                   like(rkfirm)
     d w_navn          s                   like(rknavn)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B1BLD Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     b1taga        tag
      *
     c                   exfmt     b1bld
      *
      * Behandling av standard funksjonstaster
      *
     c                   select
     c                   when      *inkc
     c                   goto      avslutt
     c                   endsl
      *
      * F4=Spørring på kunde
      *
     c                   if        *inkd
     c                   call      'RK580R'
     c                   parm                    w_firm
     c                   parm                    b1kund
     c                   if        b1kund = 0
     c                   goto      b1taga
     c                   endif
     c                   endif
      *
      * F5=Forny
      *
     c                   if        *inke
     c                   eval      b1kund = 0
     c                   eval      b1kna1 = *blank
     c                   eval      b1kna2 = *blank
     c                   goto      b1taga
     c                   endif
      *
      * Validering av input
      *
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      b1taga
     c                   endif
      *
     c                   if        b1kna1 = *blank and
     c                             rknavn <> *blank
     c                   eval      rknavn = %trim(rknavn)
     c                   eval      b1kna1 = %subst(rknavn:1:19)
     c                   eval      b1kna2 = %subst(rknavn:20:11)
     c                   goto      b1taga
     c                   endif
      *
      * Kaller registeringsprogram
      *
     c                   call      'VV591R'
     c                   parm                    w_firm
     c                   parm                    b1kund
      *
     c                   eval      b1kund = 0
     c                   eval      b1kna1 = *blank
     c                   eval      b1kna2 = *blank
     c                   eval      rknavn = *blank
      *
     c                   goto      b1taga
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for sjekking av input-felter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_input   begsr
      *
     c                   eval      b_feil = *off
      *
     c                   if        b1kund <> 0                                           .....
     c                   eval      rkunl1_kund = b1kund
     c     rkunl1_key    chain     rkunl1                             31
     c                   if        *in31 = *on
     c                   eval      b_feil = *on
     c                   goto      end_sjekk                                                 .
     c                   endif
     c                   endif
      *
     c     end_sjekk     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppslag på kunde
      *
     c     rkunl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rkunl1_kund
      *
      * Henter firma fra LDA
      *
     c                   eval      w_firm = l_firm
      *
     c                   endsr
