     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : VV785R
      * Beskrivelse . . : Vare, kopiering til annen filgruppe - nattjobb
      *
      * Program for kopiering av alle varer fra filgruppe/firma til alle
      * tilknyttede filgrupper/firma.
      *
      * Filgruppe/firma det skal kopieres fra oppgis som parametre til
      * programmet.
      *
      * NB! d_dumm har som oppgave å forhindre "forsøpling" av datastruktur
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       191199 HKO  Nytt program
      *       100402 HKO  Lagt inn behandling av nye parametre
      *       240107 HKO  Lagt inn behandling av nye parametre
6.31  *       040718 bof  Utvidet med les varer fra csv-fil
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Datastruktur for parameterliste -ut
      *
     d                 ds
     d d_list                       260
     d  d_fgrp                        3    overlay(d_list:1)
     d  d_firm                        3  0 overlay(d_list:4)
     d  d_ldor                        6  0 overlay(d_list:7)
     d  d_ogrp                        2  0 overlay(d_list:13)
     d  d_hgrp                        2  0 overlay(d_list:15)
     d  d_ugrp                        3  0 overlay(d_list:17)
     d  d_var0                       15    overlay(d_list:20)
     d  d_var1                       15    overlay(d_list:35)
     d  d_var2                       15    overlay(d_list:50)
     d  d_var3                       15    overlay(d_list:65)
     d  d_var4                       15    overlay(d_list:80)
     d  d_var5                       15    overlay(d_list:95)
     d  d_var6                       15    overlay(d_list:110)
     d  d_var7                       15    overlay(d_list:125)
     d  d_var8                       15    overlay(d_list:140)
     d  d_var9                       15    overlay(d_list:155)
     d  d_odat                         d   overlay(d_list:170) datfmt(*iso)
     d  d_vtyp                        1    overlay(d_list:180)
     d  d_fgt0                        3    overlay(d_list:181)
     d  d_fit0                        3  0 overlay(d_list:184)
     d  d_fgt1                        3    overlay(d_list:187)
     d  d_fit1                        3  0 overlay(d_list:190)
     d  d_fgt2                        3    overlay(d_list:193)
     d  d_fit2                        3  0 overlay(d_list:196)
     d  d_fgt3                        3    overlay(d_list:199)
     d  d_fit3                        3  0 overlay(d_list:202)
     d  d_fgt4                        3    overlay(d_list:205)
     d  d_fit4                        3  0 overlay(d_list:208)
     d  d_fgt5                        3    overlay(d_list:211)
     d  d_fit5                        3  0 overlay(d_list:214)
     d  d_fgt6                        3    overlay(d_list:217)
     d  d_fit6                        3  0 overlay(d_list:220)
     d  d_fgt7                        3    overlay(d_list:223)
     d  d_fit7                        3  0 overlay(d_list:226)
     d  d_fgt8                        3    overlay(d_list:229)
     d  d_fit8                        3  0 overlay(d_list:232)
     d  d_fgt9                        3    overlay(d_list:235)
     d  d_fit9                        3  0 overlay(d_list:238)
6.31 d  d_file                        1    overlay(d_list:241)
     d  d_dumm                        1    overlay(d_list:260)
      *
      * Definering av parametre
      *
     d p_fgrp          s              3
     d p_firm_alf      s              3
      *
      * Definering av variable
      *
     d w_firm          s              3  0
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Initierer datastruktur -ut
      *
     c                   eval      d_fgrp = p_fgrp
     c                   eval      d_firm = w_firm
     c                   eval      d_ldor = 0
     c                   eval      d_ogrp = 0
     c                   eval      d_hgrp = 0
     c                   eval      d_ugrp = 0
     c                   eval      d_var0 = *blank
     c                   eval      d_var1 = *blank
     c                   eval      d_var2 = *blank
     c                   eval      d_var3 = *blank
     c                   eval      d_var4 = *blank
     c                   eval      d_var5 = *blank
     c                   eval      d_var6 = *blank
     c                   eval      d_var7 = *blank
     c                   eval      d_var8 = *blank
     c                   eval      d_var9 = *blank
     c                   eval      d_odat = *loval
     c                   eval      d_vtyp = *blank
     c                   eval      d_fgt0 = *blank
     c                   eval      d_fit0 = 0
     c                   eval      d_fgt1 = *blank
     c                   eval      d_fit1 = 0
     c                   eval      d_fgt2 = *blank
     c                   eval      d_fit2 = 0
     c                   eval      d_fgt3 = *blank
     c                   eval      d_fit3 = 0
     c                   eval      d_fgt4 = *blank
     c                   eval      d_fit4 = 0
     c                   eval      d_fgt5 = *blank
     c                   eval      d_fit5 = 0
     c                   eval      d_fgt6 = *blank
     c                   eval      d_fit6 = 0
     c                   eval      d_fgt7 = *blank
     c                   eval      d_fit7 = 0
     c                   eval      d_fgt8 = *blank
     c                   eval      d_fit8 = 0
     c                   eval      d_fgt9 = *blank
     c                   eval      d_fit9 = 0
6.31 c                   eval      d_file = *blank
     c                   eval      d_dumm = '*'
      *
      * Kaller overføringsprogram
      *
     c                   call      'VV785C'
     c                   parm                    d_list
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Avslutt program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     avslutt       tag
      *
     c                   move      *on           *inlr
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parametre
      *
     c     *entry        plist
     c                   parm                    p_fgrp
     c                   parm                    p_firm_alf
      *
     c                   move      p_firm_alf    w_firm
      *
     c                   endsr
