     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       051218 sst  Nytt program
      *
      * ----- ------ ---- -------------------------------------------------
     fwopdiu    uf   e           k disk    rename(wopdst:wopdiur)
      *
      *
     d                uds
     d l_user                911    920
     d l_fgr                 931    933
      *
      *
      * Definering av variabler i nøkler
      *
     d wopdiu_regi     s                   like(woregi)
     d wopdiu_fore     s                   like(wofore)
     d wopdiu_felt     s                   like(wofelt)
      *
     d svar            s              1
      *
     c     *entry        plist
     c                   parm                    svar
      *
     c                   eval      svar = *blank
     c                   eval      wopdiu_regi = 'OPPDATER'
     c                   eval      wopdiu_fore = *blank
     c                   eval      wopdiu_felt = *blank
     c     wopdiu_key    chain     wopdiu
     c                   if        not %found(wopdiu)
     c                   eval      wopdiu_regi = 'Oppdater'
     c     wopdiu_key    chain     wopdiu
     c                   endif
     c                   if        %found(wopdiu)
     c                   eval      svar = 'J'
     c                   endif
      *
     c     end           tag
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for posisjonering på endringsfil
      *
     c     wopdiu_key    klist
     c                   kfld                    wopdiu_regi
     c                   kfld                    wopdiu_fore
     c                   kfld                    wopdiu_felt
      *
     c                   endsr
      *
