     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Inputrecord:
      * Kundenr.  Felt      Ny verdi
      *
9.01  *   28.10.2019 sst Lagt til oppdatering av RKSPL4 og RKSPL5
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fwopdiu    up   e             disk    rename(wopdst:wopdiur)
     frkunlu    uf a e           k disk    rename(rkunpfr:rkunlur)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_filg                931    933
     d l_firm                944    946  0
     d l_fnav                951    980
      *
     d Lo              c                   'abcdefghijklmnopqrstuvwxyzæøå'
     d Up              c                   'ABCDEFGHIJKLMNOPQRSTUVWXYZÆØÅ'
      *
      * Definering av variabler i nøkler
      *
     d rkunlu_firm     s                   like(rkfirm)
     d rkunlu_kund     s                   like(rkkund)
      *
      * Definering av variable
      *
     d i               s              3  0
     d j               s              3  0
     d d_kund          s              6
     d d_felt          s             10
     d d_Innh          s             30
     d w_rec           s            512
     d w_feil          s             30
     d w_kund          s              6  0
     d w_grns          s              5  0
     d w_frie          s              5
     d w_kres          s              1
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *  NBNBNBNBNBNB!!!!!!!!!!
     c                   eval      wofeil = *blank
     c                   if        woregi = 'RKUNPF'
     c                   eval      w_kund = %int(%trim(wofore))
     c                   eval      rkunlu_firm = *zero
     c                   eval      rkunlu_kund = w_kund
     c     rkunlu_key    chain     rkunlu
     c                   if        %found(rkunlu)
     c                   select
     c                   when      wofelt = 'RKFRIE'
     c                   eval      rkfrie = woverd
     c                   when      wofelt = 'RKGRNS'
     c                   eval      rkgrns = %int(%trim(woverd))
     c                   when      wofelt = 'RKKRES'
     c                   if            %int(%trim(woverd)) < 10
     c                             and %int(%trim(woverd)) >= 0
     c                   eval      rkkres = %int(%trim(woverd))
     c                   else
     c                   eval      w_feil = 'Feil innehold'
     c                   goto      feil
     c                   endif
     c                   when      wofelt = 'RKPASS'
     c                   eval      rkpass = woverd
     c                   when      wofelt = 'RKSPRK'
     c                   eval      rksprk = woverd
     c                   when      wofelt = 'RKSPL4'
     c                   eval      rkspl4 = woverd
     c                   when      wofelt = 'RKSPL5'
     c                   eval      rkspl5 = woverd
     c                   other
     c                   eval      w_feil = 'Ukjent Felt'
     c                   goto      feil
     c                   endsl
      *
     c                   eval      rkedat = woedat
     c                   if        woedat = *loval
     c                   time                    rkedat
     c                   endif
     c                   eval      rketim = woetim
     c                   if        woetim = *loval
     c                   time                    rketim
     c                   endif
     c                   eval      rkesig = %trim(woeusr) + '_E'
     c                   if        woeusr = '_E'
     c                   eval      rkesig = 'MGX_RA'
     c                   endif
     c                   eval      rkepgm = 'WOPPDFR'
     c                   update    rkunlur
     c                   delete    wopdiur
     c                   goto      end
     c                   else
     c                   eval      w_feil = 'Ukjent kunde'
     c                   endif
     c                   else
     c                   if        woregi = 'OPPDATER'
     c                             or woregi = 'Oppdater'
     c                   delete    wopdiur
     c                   goto      end
     c                   endif
     c                   endif
      *
     c     feil          tag
      *                  Skyggetabell wopdst(iu) oppdateres med feilmelding
     c                   eval      wofeil = w_feil
     c                   update    wopdiur
      *
     c     end           tag
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for posisjonering på kunde
      *
     c     rkunlu_key    klist
     c                   kfld                    rkunlu_firm
     c                   kfld                    rkunlu_kund
      *
     c                   endsr
      *
