     h option(*nodebugio) datedit(*dmy) decedit(',')
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     fafirl1    if   e           k disk    rename(afirpfr:afirl1r)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Definering av variabler
      *
     d p_firm          s              3
     d p_firmn         s              3  0
     d p_firmx         s              3
     d p_sts           s              1
     d afirl1_firm     s                   like(aaffir)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Hovedprogram
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekk om fimra finnes
      *
     c                   if        p_firm = *blank
     c                   move      '000'         p_firm
     c                   endif
     c                   if        %subst(p_firm:1:1) < '0' or
     c                             %subst(p_firm:1:1) > '9' or
     c                             %subst(p_firm:2:1) < '0' or
     c                             %subst(p_firm:2:1) > '9' or
     c                             %subst(p_firm:3:1) < '0' or
     c                             %subst(p_firm:3:1) > '9'
     c                   eval      p_sts = 'F'
     c                   goto      avslutt
     c                   endif
     c                   eval      p_sts = ' '
     c                   move      p_firm        afirl1_firm
     c     afirl1_key    chain     afirl1
     c                   if        not %found(afirl1)
     c                   eval      p_sts = 'F'
     c                   endif
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Parameter
      *
     c     *entry        plist
     c                   parm                    p_firm
     c                   parm                    p_sts
      *
     c     afirl1_key    klist
     c                   kfld                    afirl1_firm
      *
     c                   endsr
