     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASCOMP
      * Program . . . . : XC060R
      * Beskrivelse . . : Compello Integrasjon, justering av feiltraner
      *
      * spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       211211 sst  Nytt program
6.20  *       061113 sst  Ta hensyn til både . og , som desimaltegn
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      *       LR = Avslutt program
      *       10 = Rollup
      *       11 = Rolldown
      *       12 = Sfldsp
      *       13 = Sfldspctl
      *       14 = Sflclr
      *       15 = Sflend
      *       21 = Home-key
      *       22 = Plassering av cursor
      *       30 = Protect av felter ved vise
      *    31-79 = Varsle m/feilmeldinger/skjermindikatorer
      *    80-99 = Arbeidsindikatorer
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     frcoml1    if   e           k disk    rename(rcompfr:rcoml1r)
     frcomlr    if   e           k disk    rename(rcompfr:rcomlrr)
     frcomlu    uf a e           k disk    rename(rcompfr:rcomlur)
      *
     fxc060d    cf   e             workstn sfile(b1sfl:w_srrn)
     f                                     infds(dspfbk)
      *
      * Definering av parametre
      *
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
     d l_asp                 911    913
     d l_fgrp                931    933
     d l_firm                944    946
     d l_fnav                951    980
      *
      * Definering av Information Data Structure - display feedback
      *
     d dspfbk          ds
     d  d_fcrn               378    379I 0
      *
      * Definering av variabler i nøkler
      *
     d rcoml1_huid     s                   like(rchuid)
     d*rcomlr_fgrp     s                   like(rcfgrp)
     d rcomlr_huid     s                   like(rchuid)
     d*rcomlu_fgrp     s                   like(rcfgrp)
     d rcomlu_huid     s                   like(rchuid)
      *
      *
      * Definering av variable
      *
     d w_stel          s              4  0
     d w_spge          s              4  0
     d w_srrn          s              4  0
     d w_sfrn          s                   like(w_srrn)
     d w_ssrn          s                   like(w_srrn)
      *
     d w_seqe          s              1
     d b_oppr          s              1    inz(*off)
     d b_forn          s              1    inz(*off)
     d b_anul          s              1    inz(*off)
     d b_feil          s              1    inz(*off)
      *
     d w_fgrp          s              3
     d w_firm          s              3
     d s_fgrp          s              3
     d w_f10           s             10
      *
      * Fetler fra XC100r vedr kontroll
      *
     d i               s              3  0
     d j               s              3  0
     d w_b             s             11
     d wdat            s              6  0
     d waar            s              2  0
     d w_dat5          s              5
     d w_dat6          s              6
     d w2x             s              2
     d w4x             s              4
     d w6x             s              6
     d w_dmy           s              6
     d w_dmyn          s              6  0
     d w_kr            s             13
     d w_or            s              2
     d w_krn           s             13  0
     d w_orn           s              2  0
     d w_bilk          s              2
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     d w_aaaa          s              4  0
     d w_aar           s              4
     d w_dag           s              2
     d w_mnd           s              2
     d w_raar          s              4  0
     d w_raarx         s              4
     d w_rper          s              2  0
     d w_rperx         s              2
     d wuaa            s              4  0
     d wuaax           s              4
     d wtst            s              3  0
     d w_feil          s             30
     d w_tell          s              6  0
     d w_sts           s              1
      *
      * Definering av konstanter
      *
     d c_sfil          s              2  0 inz(15)
      *
      * Forklaring på firmielle felter
      * som benyttes ved sub-files.
      * - - - - - - - - - - - - - - - - -
      * d_fcrn - Første recordnummer på siden
      * w_stel - Subfile-teller
      * w_spge - Sidestørrelse i subfile (page)
      * w_srrn - Relativt recordnummer i subfile
      * w_sfrn - Første recordnummer på siste side
      * w_ssrn - Siste recordnummer på siste side
      * w_curn - Current recordnummer på siden
      * w_virn - Side og cursorplassering som skal vises
      * w_afld - Aktivt feltnavn
      * w_arow - Aktiv rad for cursor
      * w_acol - Aktiv kolonne for cursor
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      * B1SFL  - B1 Subfile - record
      * B2CTL  - B2 Subfile - control record
      * B2CMD  - B2 Eget skjermbilde for CMD-taster
      * C1BLD  - C1 Skjermbilde for innlegging av nøkkel ved oppretting
      * C1MSG  - C1 Meldingsbilde for C1BLD
      * C2BLD  - C2 Skjermbilde for opprette/endre/vise
      * D1WIN  - D1 Vindu for slette (Delete)
      * K1WIN  - K1 Vindu for kopiere
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B2CTL Behandle åpningsbildet med subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Send Alt
      *
     c     b2taga        tag
      *
     c                   write     b2cmd
      *
      * Bare data
      *
     c     b2tagb        tag
      *
     c                   exsr      dsp_subfile
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   when      *inke
     c                   exsr      forny
     c                   goto      b2tagb
     c                   when      *in10
     c                   exsr      crt_subfile
     c                   goto      b2tagb
     c                   when      *in11
     c                   exsr      bck_subfile
     c                   goto      b2tagb
     c                   when      *in21
     c                   eval      *in22 = *on
     c                   goto      b2taga
     c                   endsl
      *
      * Posisjonering
      *
     c*                  if        b2fgrp <> *blank or
     c                   if        b2firm <> *blank
     c                   exsr      posisjoner
     c                   goto      b2tagb
     c                   endif
      *
      * Behandling av subfile
      *
     c                   exsr      subfile
      *
     c                   goto      b2taga
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for fornying av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     forny         begsr
      *
     c                   if        w_sfrn <> 0
     c     w_sfrn        chain     b1sfl
     c                   endif
      *
     c                   select
     c                   when      w_seqe = 'K'
     c*                  eval      rcoml1_fgrp = b1fgrp
     c                   eval      rcoml1_huid = b1huid
     c     rcoml1_key    setll     rcoml1
     c                   endsl
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c     end_forny     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for posisjonering i subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     posisjoner    begsr
      *
      * Posisjoner startverdi på filgruppe
      *
     c*                  if        b2fgrp <> *blank or
     c                   if        b2firm <> *blank
     c                   eval      w_seqe = 'K'
     c*                  eval      rcoml1_fgrp = b2fgrp
     c                   eval      rcoml1_huid = *blank
     c     rcoml1_key    setll     rcoml1
     c                   goto      end_pos
     c                   endif
      *
     c     end_pos       tag
      *
      * Blanker subfile, og fyller opp i.h.t. posisjonering
      *
     c                   eval      *in22 = *off
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
      * Blanker posisjoneringsfelter
      *
     c*                  eval      b2fgrp = *blank
     c                   eval      b2firm = *blank
     c                   eval      b2huid = *blank
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     subfile       begsr
      *
     c                   eval      b_forn = *off
      *
     c                   if        *in22 = *off
     c                   eval      *in22 = *on
     c                   else
     c                   eval      *in22 = *off
     c                   endif
      *
     c                   eval      w_virn = d_fcrn
      *
      * Leser og behandler subfile
      *
     c                   do        w_ssrn
     c                   readc     b1sfl
      *
     c                   if        %eof
     c                   leave
     c                   endif
      *
     c                   eval      *in22 = *off
     c                   eval      w_virn = w_srrn
      *
      * Endre
      *
     c                   if        b1valg = '2'
     c*                  eval      s_fgrp = b1fgrp
     c*                  eval      c2fgrp = b1fgrp
     c                   eval      c2firm = b1firm
     c                   eval      c2huid = b1huid
     c                   exsr      xc2bld
     c                   eval      b1valg = *blank
     c                   eval      b1feil = w_feil
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Slett
      *
     c                   if        b1valg = '4'
     c*                  eval      d1fgrp = b1fgrp
     c                   eval      d1firm = b1firm
     c                   eval      d1huid = b1huid
     c                   exsr      xd1win
     c                   eval      b1valg = *blank
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Vis
      *
     c                   if        b1valg = '5'
     c*                  eval      c2fgrp = b1fgrp
     c                   eval      c2firm = b1firm
     c                   eval      c2huid = b1huid
     c                   exsr      xc2bld
     c                   eval      b1valg = *blank
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
     c                   enddo
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c     end_subfile   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å behandle bilde for ny/endring/vise (C2BLD)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc2bld        begsr
      *
     c                   eval      w_arow = 0
     c                   eval      w_acol = 0
      *
     c*                  eval      rcomlr_fgrp = c2fgrp
     c                   eval      rcomlr_huid = c2huid
     c     rcomlr_key    chain     rcomlr
      *
     c                   if        %found
     c     '-':'0'       xlate     rcbelo        rcbelo
     c     '-':'0'       xlate     rcvalb        rcvalb
     c*                  eval      c2fgrp = rcfgrp
     c                   eval      c2firm = rcfirm
     c                   eval      c2biln = rcbiln
     c                   eval      c2bilk = rcbilk
     c*                  eval      c2raar = rcraar
     c                   eval      c2rper = rcrper
     c                   eval      c2bdat = rcbdat
     c                   eval      c2belo = rcbelo
     c                   eval      c2davd = rcdavd
     c                   eval      c2dkto = rcdkto
     c                   eval      c2dsps = rcdsps
     c                   eval      c2dmva = rcdmva
     c                   eval      c2cavd = rccavd
     c                   eval      c2ckto = rcckto
T5.30c                   eval      c2csps = rccsps
T5.30c                   eval      c2cmva = rccmva
T5.60c                   eval      c2fdat = rcfdat
T5.60c                   eval      c2valb = rcvalb
T5.60c                   eval      c2valk = rcvalk
T5.60c                   eval      c2text = rctext
T5.60c                   eval      c2lfak = rclfak
     c                   eval      c2kidi = rckidi
     c                   eval      c2pros = rcpros
     c                   eval      c2akti = rcakti
     c                   eval      c2huid = rchuid
     c                   eval      c2edat = rcedat
     c                   eval      c2etim = rcetim
     c                   eval      c2feil = rcfeil
     c                   eval      rcfeil = *blank
     c                   endif
      *
     c                   movel     c2feil        w_f10
     c                   setoff                                       414243
     c                   setoff                                       434445
     c                   setoff                                       464748
     c                   setoff                                       495051
     c                   setoff                                       525354
     c                   setoff                                       555657
     c                   setoff                                       585960
     c                   setoff                                       616263
     c                   setoff                                       646566
     c                   select
     c                   when      w_f10 = 'Filgruppe '
     c                   eval      *in41 = *on
     c                   when      w_f10 = 'Firma ukje'
     c                   eval      *in42 = *on
     c                   when      w_f10 = 'Bilagsnr f'
     c                   eval      *in43 = *on
     c                   when      w_f10 = 'Bilagskode'
     c                   eval      *in46 = *on
     c                   when      w_f10 = 'Bilagsår f'
     c                   eval      *in44 = *on
     c                   when      w_f10 = 'Bilagsperi'
     c                   eval      *in45 = *on
     c                   when      w_f10 = 'Bilagsdato'
     c                   eval      *in47 = *on
     c                   when      w_f10 = 'Beløp feil'
     c                   eval      *in48 = *on
     c                   when      w_f10 = 'Debet avde'
     c                   eval      *in49 = *on
     c                   when      w_f10 = 'Debet kont'
     c                   eval      *in50 = *on
     c                   when      w_f10 = 'Debet bære'
     c                   eval      *in51 = *on
     c                   when      w_f10 = 'Debet mva '
     c                   eval      *in52 = *on
     c                   when      w_f10 = 'Kredit avd'
     c                   eval      *in53 = *on
     c                   when      w_f10 = 'Kredit kon'
     c                   eval      *in54 = *on
     c                   when      w_f10 = 'Kredit bær'
     c                   eval      *in55 = *on
     c                   when      w_f10 = 'Kredit mva'
     c                   eval      *in56 = *on
     c                   when      w_f10 = 'Forfallsda'
     c                   eval      *in57 = *on
     c                   when      w_f10 = 'Valutabelø'
     c                   eval      *in58 = *on
     c                   when      w_f10 = 'Valutakode'
     c                   eval      *in59 = *on
     c                   when      w_f10 = 'Tekst     '
     c                   eval      *in60 = *on
     c                   when      w_f10 = 'LevFaktNr '
     c                   eval      *in61 = *on
     c                   when      w_f10 = 'Kid feil  '
     c                   eval      *in62 = *on
     c                   when      w_f10 = 'Prosjektnr'
     c                   eval      *in63 = *on
     c                   when      w_f10 = 'Aktivitet '
     c                   eval      *in64 = *on
     c                   endsl
      *
     c                   if        b1valg = '5'
     c                   eval      *in30 = *on
     c                   endif
      *
     c     c2taga        tag
      *
     c                   exfmt     c2bld
      *
S5.20c*                  if        *inkc or *inkl or *in30
T5.20c                   if        *inkc or *inkl
     c                   goto      end_c2bld
     c                   endif
      *
      * Kontroll
      *
     c                   eval      c2feil = *blank
     c                   exsr      kontroll
     c*                  if        w_feil <> *blank
     c*                  eval      rcomlu_huid = c2huid
     c*    rcomlu_key    chain     rcomlu
     c*                  eval      rchent = 'F'
     c*                  eval      rcfeil = w_feil
     c*                  update    rcomlur
     c*                  goto      c2_sub
     c*                  endif
      *
      * Oppdatering
      *
     c                   clear                   rcomlur
      *
     c*                  eval      rcomlu_fgrp = c2fgrp
     c                   eval      rcomlu_huid = c2huid
     c     rcomlu_key    chain     rcomlur
      *
     c*                  eval      rcfgrp = c2fgrp
     c                   eval      rcfirm = c2firm
     c                   eval      rcbiln = c2biln
     c                   eval      rcbilk = c2bilk
     c*                  eval      rcraar = c2raar
     c                   eval      rcrper = c2rper
     c                   eval      rcbdat = c2bdat
     c                   eval      rcbelo = c2belo
     c                   eval      rcdavd = c2davd
     c                   eval      rcdkto = c2dkto
     c                   eval      rcdsps = c2dsps
     c                   eval      rcdmva = c2dmva
     c                   eval      rccavd = c2cavd
     c                   eval      rcckto = c2ckto
     c                   eval      rccsps = c2csps
     c                   eval      rccmva = c2cmva
     c                   eval      rcfdat = c2fdat
     c                   eval      rcvalb = c2valb
     c                   eval      rcvalk = c2valk
     c                   eval      rctext = c2text
     c                   eval      rclfak = c2lfak
     c                   eval      rckidi = c2kidi
     c                   eval      rcpros = c2pros
     c                   eval      rcakti = c2akti
     c                   eval      rchuid = c2huid
     c                   eval      rcedat = c2edat
     c                   eval      rcetim = c2etim
     c                   if        w_feil <> *blank
     c                   eval      rchent = 'F'
     c                   eval      rcfeil = w_feil
     c                   else
     c                   eval      rchent = *blank
     c                   eval      rcfeil = *blank
     c                   endif
      *
     c                   if        %found
     c                   update    rcomlur
     c                   else
     c*                  eval      rcfgrp = c2fgrp
     c                   eval      rcfirm = c2firm
     c                   eval      rchuid = c2huid
     c                   write     rcomlur
     c                   endif
      *
      * Oppdater subfile
      *
     c     c2_sub        tag
     c                   if        b1valg = '2'
     c*                  eval      b1fgrp = rcfgrp
     c                   eval      b1firm = rcfirm
     c                   movel     rcbiln        b1biln
     c*                  movel     rcraar        b1raar
     c                   movel     rcrper        b1rper
     c                   eval      b_forn = *on
     c                   endif
      *
     c     end_c2bld     tag
      *
     c                   eval      *in30  = *off
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av slette-bildet (D1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xd1win        begsr
      *
     c*                  eval      rcomlr_fgrp = d1fgrp
     c                   eval      rcomlr_huid = d1huid
     c     rcomlr_key    chain     rcomlr
      *
     c     d1taga        tag
      *
     c                   exfmt     d1win
      *
     c                   if        *inkc or *inkl
     c                   goto      end_d1win
     c                   endif
      *
     c                   eval      b_forn = *on
      *
      * Sletter rad
      *
     c*                  eval      rcomlu_fgrp = d1fgrp
     c                   eval      rcomlu_huid = d1huid
     c     rcomlu_key    chain     rcomlur
      *
     c                   delete    rcomlur
      *
     c     end_d1win     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for tømming av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     clr_subfile   begsr
      *
     c                   eval      *in14 = *on
     c                   write     b2ctl
     c                   eval      *in14 = *off
      *
     c                   eval      *in15 = *off
     c                   eval      w_srrn = 0
     c                   eval      w_sfrn = 0
     c                   eval      w_ssrn = 0
     c                   eval      w_spge = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å fylle opp subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     crt_subfile   begsr
      *
     c                   eval      w_spge = w_spge + c_sfil
     c                   eval      w_srrn = w_ssrn
      *
     c                   dou       w_srrn = w_spge
      *
     c                   select
     c                   when      w_seqe = 'K'
     c                   read      rcoml1                                 15
     c                   endsl
      *
     c                   if        %eof
     c                   eval      *in15 = *on
     c                   leave
     c                   endif
      *   Dersom ikke ASP-bruker vises bare egen filgruppe
     c                   if        rcfirm <> w_firm and
     c                             l_asp  <> 'ASP'
     c                   iter
     c                   endif
      *
     c                   eval      w_srrn = w_srrn + 1
      *
     c                   select
     c                   when      w_seqe = 'K'
     c*                  eval      rcoml1_fgrp = rcfgrp
     c                   endsl
      *
     c                   eval      b1valg = *blank
     c*                  eval      b1fgrp = rcfgrp
     c                   eval      b1firm = rcfirm
     c                   eval      b1biln = rcbiln
     c                   eval      b1huid = rchuid
     c*                  eval      b1raar = rcraar
     c                   eval      b1rper = rcrper
     c                   eval      b1feil = rcfeil
      *
     c                   write     b1sfl
      *
     c                   enddo
      *
     c                   if        w_srrn > w_ssrn
     c                   eval      w_sfrn = w_ssrn + 1
     c                   endif
      *
     c                   eval      w_ssrn = w_srrn
     c                   eval      w_virn = w_sfrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å bla tilbake en side i subfilen
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bck_subfile   begsr
      *
     c                   if        *in15
     c                   select
     c                   when      w_seqe = 'K'
     c     rcoml1_key    setgt     rcoml1
     c                   readp     rcoml1
     c                   endsl
     c                   endif
      *
      * Leser tilbake en side
      *
     c                   eval      w_stel = 0
      *
     c                   dou       w_stel = w_ssrn + c_sfil
      *
     c                   select
     c                   when      w_seqe = 'K'
     c                   readp     rcoml1
     c                   endsl
      *
     c                   if        %eof             or
     c*                            rcfgrp <> w_fgrp or
     c                             rcfirm <> w_firm
     c                   leave
     c                   endif
      *
     c                   eval      w_stel = w_stel + 1
      *
     c                   select
     c                   when      w_seqe = 'K'
     c*                  eval      rcoml1_fgrp = rcfgrp
     c                   endsl
      *
     c                   enddo
      *
     c                   if        %eof
     c                   select
     c                   when      w_seqe = 'K'
     c     rcoml1_key    setll     rcoml1
     c                   endsl
     c                   endif
      *
      * Blanker og fyller opp subfile
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for display av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     dsp_subfile   begsr
      *
     c                   if        w_srrn <> 0
     c                   eval      *in12 = *on
     c                   else
     c                   write     b2cmd
     c                   endif
      *
     c                   eval      *in13 = *on
     c                   exfmt     b2ctl
      *
     c                   eval      *in12 = *off
     c                   eval      *in13 = *off
      *
     c                   endsr
      *
     c/eject
      *
      * Subrutine for kontroll av inputfelt
      *
     c     kontroll      begsr
      *
     c                   eval      rcfeil = *blank
     c                   eval      rchent = *blank
     c                   eval      c2feil = *blank
     c                   eval      w_feil = *blank
      *  Firma
     c                   if        c2firm = *blank
     c                   eval      c2firm = '000'
     c                   else
     c                   if        %subst(c2firm:2:2) = *blank
     c                   eval      %subst(c2firm:3:1) = %subst(c2firm:1:1)
     c                   eval      %subst(c2firm:1:2) = '00'
     c                   else
     c                   if        %subst(c2firm:3:1) = *blank
     c                   eval      %subst(c2firm:2:2) = %subst(c2firm:1:2)
     c                   eval      %subst(c2firm:1:1) = '0'
     c                   endif
     c                   endif
     c                   endif
     c                   movel     l_fgrp        w_fgrp
     c                   movel     c2firm        w_firm
     c                   call      'XC003C'
     c                   parm                    w_fgrp
     c                   parm                    w_firm
     c                   parm                    w_sts
      *
     c                   time                    w_tell
     c                   if        w_sts = 'F'
     c                   eval      w_feil = 'Firma ukjent'
     c                   goto      UpdFeil
     c                   endif
      *  Bilagsnr                   Hvis mer enn 6 siffer, feil
     c                   time                    w_tell
     c                   if        %scan(' ':c2biln:1) > 9 or
     c                             %check('0123456789 ':c2biln) > 0
     c                   eval      w_feil = 'Bilagsnr feil'
     c                   goto      UpdFeil
     c                   endif
     c                   eval      j   = 7
     c                   eval      i   = 7
     c                   eval      w6x = *blank
     c                   do        6
     c                   eval      i = i - 1
     c                   if        %subst(c2biln:i:1) <> *blank
     c                   eval      j = j - 1
     c                   eval      %subst(w6x:j:1) = %subst(c2biln:i:1)
     c                   endif
     c                   enddo
      *   Bilagskode
     c                   if        %scan(' ':c2bilk:1) > 2 or
     c                             %check('0123456789 ':c2bilk) > 0
     c                   eval      w_feil = 'Bilagskode feil'
     c                   goto      UpdFeil
     c                   endif
      *   Periode
     c                   if        c2rper <> *blank
     c                   if        %scan(' ':c2rper:1) > 6 or
     c                             %check('0123456789 ':c2rper) > 0
     c                   eval      w_feil = 'Bilagsperiode feil'
     c                   goto      UpdFeil
     c                   endif
      *    Sjekk år i periode
     c                   movel     c2rper        w_raar
     c                   if        w_raar  < wuaa  -1 or
     c                             w_raar  > wuaa  +1
     c                   eval      w_feil = 'Bilagsperiode(år) feil'
     c                   move      wuaa          wuaax
     c                   move      w_raar        w_raarx
     c                   eval      %subst(w_feil:22:4) = wuaax
     c                   eval      %subst(w_feil:27:4) = w_raarx
     c                   goto      UpdFeil
     c                   endif
      *    Sjekk mnd i periode
     c                   move      c2rper        w_rper
     c                   if        w_rper  < 1        or
     c                             w_rper  > 12
     c                   eval      w_feil = 'Bilagsperiode(mnd) feil'
     c                   move      w_rper        w_rperx
     c                   eval      %subst(w_feil:25:4) = w_rperx
     c                   goto      UpdFeil
     c                   endif
      *
     c                   endif
      *
      * Bilagsdato       Hvis mer enn 10 siffer, eller ikke numerisk
     c                   if        %scan(' ':c2bdat:1) > 11         or
     c                             %check('0123456789 .':c2bdat) > 0
     c                   eval      w_feil = 'Bilagsdato feil'
     c                   goto      UpdFeil
     c                   endif
      *       Format 1:  åååå-mm-dd
     c                   if        %scan(' ':c2bdat:1) > 10     and
     c                             (%subst(c2bdat:3:1) <> '.'   or
     c                              %subst(c2bdat:6:1) <> '.')
     c                   eval      w_feil = 'Bilagsdato feil'
     c                   goto      UpdFeil
     c                   endif
     c                   if        %subst(c2bdat:3:1) = '.' and
     c                             %subst(c2bdat:6:1) = '.'
     c                   eval      w_aar =  %subst(c2bdat:7:4)
     c                   eval      w_mnd =  %subst(c2bdat:4:2)
     c                   eval      w_dag =  %subst(c2bdat:1:2)
     c                   if        %check('1234567890':w_aar) > 0
     c                   eval      w_feil = 'Bilagsdato, år feil'
     c                   goto      UpdFeil
     c                   endif
     c                   if        %check('1234567890':w_mnd) > 0
     c                   eval      w_feil = 'Bilagsdato, måned feil'
     c                   goto      UpdFeil
     c                   endif
     c                   if        %check('1234567890':w_dag) > 0
     c                   eval      w_feil = 'Bilagsdato, dag feil'
     c                   goto      UpdFeil
     c                   endif
     c                   move      w_aar         w_aaaa
     c                   if        w_aaaa > wuaa + 1 or
     c                             w_aaaa < wuaa - 1
     c                   eval      w_feil = 'Bilagsdato, år feil'
     c                   goto      UpdFeil
     c                   endif
     c                   goto      f2ok
     c                   endif
      *       Format 2:  ååmmdd  eller ddmmåå
     c                   if        %subst(c2bdat:7:9) <> *blank
     c                   eval      w_feil = 'Bilagsdato, feil'
     c                   goto      UpdFeil
     c                   endif
      *
     c                   if        %scan(' ':c2bdat:1) > 5 and
     c                             %scan(' ':c2bdat:1) < 8
     c                   if        %subst(c2bdat:7:9) = *blank
     c                   eval      w_dat6 = %subst(c2bdat:1:6)
     c                   eval      w_dat5 = %subst(c2bdat:1:5)
     c                   eval      wdat = *zero
     c                   if        %subst(c2bdat:6:1) = *blank
     c                   move      w_dat5        wdat
     c                   else
     c                   move      w_dat6        wdat
     c                   endif
     c     *ymd          test(d e)               wdat
     c                   if        not %error
     c                   goto      f2ok
     c                   endif
     c     *dmy          test(d e)               wdat
     c                   if        not %error
     c                   goto      f2ok
     c                   endif
     c                   endif
     c                   eval      w_feil = 'Bilagsdato, feil'
     c                   goto      UpdFeil
     c                   endif
     c     f2ok          tag
     c                   select
     c                   when      %subst(c2bdat:3:1) = '.' and
     c                             %subst(c2bdat:6:1) = '.'
     c                   eval      %subst(w_dmy:1:2) = %subst(c2bdat:1:2)
     c                   eval      %subst(w_dmy:3:2) = %subst(c2bdat:4:2)
     c                   eval      %subst(w_dmy:5:2) = %subst(c2bdat:9:2)
     c                   move      w_dmy         w_dmyn
     c                   other
     c                   eval      w_dat6 = %subst(c2bdat:1:6)
     c                   eval      w_dat5 = %subst(c2bdat:1:5)
     c                   eval      wdat = *zero
     c                   if        %subst(c2bdat:6:1) = *blank
     c                   move      w_dat5        wdat
     c                   else
     c                   move      w_dat6        wdat
     c                   endif
     c     *ymd          test(d e)               wdat
     c                   movel     wdat          waar
     c                   if        not %error        and
     c                             waar < (uyear + 1) and
     c                             waar > (uyear - 1)
     c                   else
     c     *dmy          test(d e)               wdat
     c                   move      wdat          waar
     c                   if        not %error         and
     c                             waar < (uyear + 1) and
     c                             waar > (uyear - 1)
     c                   endif
     c                   endif
     c                   endsl
      *   Beløp
6.20 c                   eval      wtst = %check('0123456789,. ':c2belo)
     c                   if        %scan(' ':c2belo:1) > 12 or
     c                             c2belo = *blank          or
     c                             %check('0123456789, ':c2belo) > 0
     c                   eval      w_feil = 'Beløp feil'
     c                   goto      UpdFeil
     c                   endif
     c                   eval      w_kr = *blank
     c                   eval      w_or = *blank
     c     ' '           scan      c2belo        i
     c     ','           scan      c2belo        j
6.20 c                   if        j = 0
6.20 c     '.'           scan      c2belo        j
6.20 c                   endif
     c                   if        i > 1
     c                   eval      w_b  = *blank
     c                   if        j > 0
     c                   eval      %subst(w_kr:13-j+2:j-1) =
     c                             %subst(c2belo:1:j-1)
     c                   eval      w_or = %subst(c2belo:j+1:2)
     c                   move      w_kr          w_krn
     c                   move      w_or          w_orn
     c                   else
     c                   eval      %subst(w_kr:13-i:i-1) =
     c                             %subst(c2belo:1:i-1)
     c                   move      w_kr          w_krn
     c                   move      w_or          w_orn
     c                   endif
     c                   else
     c                   endif
      *  Debet avdeling
     c                   if        %scan(' ':c2davd:1) >  5 or
     c                             %check('0123456789 ':c2davd) > 0
     c                   eval      w_feil = 'Debet avdeling feil'
     c                   goto      UpdFeil
     c                   endif
     c                   eval      j   = 5
     c                   eval      i   = 5
     c                   eval      w4x = *blank
     c                   do        4
     c                   eval      i = i - 1
     c                   if        %subst(c2davd:i:1) <> *blank
     c                   eval      j = j - 1
     c                   eval      %subst(w4x:j:1) = %subst(c2davd:i:1)
     c                   endif
     c                   enddo
      *  Debet konto
     c                   if        %scan(' ':c2dkto:1) >  7 or
     c                             %check('0123456789 ':c2dkto) > 0
     c                   eval      w_feil = 'Debet konto feil'
     c                   goto      UpdFeil
     c                   endif
     c                   eval      j   = 7
     c                   eval      i   = 7
     c                   eval      w6x = *blank
     c                   do        6
     c                   eval      i = i - 1
     c                   if        %subst(c2dkto:i:1) <> *blank
     c                   eval      j = j - 1
     c                   eval      %subst(w6x:j:1) = %subst(c2dkto:i:1)
     c                   endif
     c                   enddo
      *  Debet bærer
     c                   if        %scan(' ':c2dsps:1) >  5 or
     c                             %check('0123456789 ':c2dsps) > 0
     c                   eval      w_feil = 'Debet bærer feil'
     c                   goto      UpdFeil
     c                   endif
     c                   eval      j   = 5
     c                   eval      i   = 5
     c                   eval      w4x = *blank
     c                   do        4
     c                   eval      i = i - 1
     c                   if        %subst(c2dsps:i:1) <> *blank
     c                   eval      j = j - 1
     c                   eval      %subst(w4x:j:1) = %subst(c2dsps:i:1)
     c                   endif
     c                   enddo
      *  Kreidt avdeling
     c                   if        %scan(' ':c2cavd:1) >  5 or
     c                             %check('0123456789 ':c2cavd) > 0
     c                   eval      w_feil = 'Kredit avdeling feil'
     c                   goto      UpdFeil
     c                   endif
     c                   eval      j   = 5
     c                   eval      i   = 5
     c                   eval      w4x = *blank
     c                   do        4
     c                   eval      i = i - 1
     c                   if        %subst(c2cavd:i:1) <> *blank
     c                   eval      j = j - 1
     c                   eval      %subst(w4x:j:1) = %subst(c2cavd:i:1)
     c                   endif
     c                   enddo
      *  Kredit konto
     c                   if        %scan(' ':c2ckto:1) >  7 or
     c                             %check('0123456789 ':c2ckto) > 0
     c                   eval      w_feil = 'Kredit konto feil'
     c                   goto      UpdFeil
     c                   endif
     c                   eval      j   = 7
     c                   eval      i   = 7
     c                   eval      w6x = *blank
     c                   do        6
     c                   eval      i = i - 1
     c                   if        %subst(c2ckto:i:1) <> *blank
     c                   eval      j = j - 1
     c                   eval      %subst(w6x:j:1) = %subst(c2ckto:i:1)
     c                   endif
     c                   enddo
      *  Kreidt bærer
     c                   if        %scan(' ':c2csps:1) >  5 or
     c                             %check('0123456789 ':c2csps) > 0
     c                   eval      w_feil = 'Kredit bærer feil'
     c                   goto      UpdFeil
     c                   endif
     c                   eval      j   = 5
     c                   eval      i   = 5
     c                   eval      w4x = *blank
     c                   do        4
     c                   eval      i = i - 1
     c                   if        %subst(c2csps:i:1) <> *blank
     c                   eval      j = j - 1
     c                   eval      %subst(w4x:j:1) = %subst(c2csps:i:1)
     c                   endif
     c                   enddo
      *  Kredit momskode
      * Forfallsdato     Hvis mer enn 10 siffer, eller ikke numerisk
     c                   if        %scan(' ':c2fdat:1) > 11          or
     c                             %check('0123456789 .':c2fdat) > 0
     c                   eval      w_feil = 'Forfallsdato feil'
     c                   goto      UpdFeil
     c                   endif
      *       Format 1:  åååå-mm-dd
     c                   if        %scan(' ':c2fdat:1) = 11     and
     c                             (%subst(c2fdat:3:1) <> '.'   or
     c                              %subst(c2fdat:6:1) <> '.')
     c                   eval      w_feil = 'Forfallsdato feil'
     c                   goto      UpdFeil
     c                   endif
     c                   if        %subst(c2fdat:3:1) = '.' and
     c                             %subst(c2fdat:6:1) = '.'
     c                   eval      w_aar =  %subst(c2fdat:7:4)
     c                   eval      w_mnd =  %subst(c2fdat:4:2)
     c                   eval      w_dag =  %subst(c2fdat:1:2)
     c                   if        %check('1234567890':w_aar) > 0
     c                   eval      w_feil = 'Forfallsdato, år feil'
     c                   goto      UpdFeil
     c                   endif
     c                   if        %check('1234567890':w_mnd) > 0
     c                   eval      w_feil = 'Forfallsdato, måned feil'
     c                   goto      UpdFeil
     c                   endif
     c                   if        %check('1234567890':w_dag) > 0
     c                   eval      w_feil = 'Forfallsdato, dag feil'
     c                   goto      UpdFeil
     c                   endif
     c                   move      w_aar         w_aaaa
     c                   if        w_aaaa > wuaa + 1 or
     c                             w_aaaa < wuaa - 1
     c                   eval      w_feil = 'Forfallsdato, år feil'
     c                   goto      UpdFeil
     c                   endif
     c                   goto      f2okf
     c                   endif
      *       Format 2:  ååmmdd  eller ddmmåå
     c                   if        %subst(c2fdat:7:9) <> *blank
     c                   eval      w_feil = 'Forfallsdato, feil'
     c                   goto      UpdFeil
     c                   endif
     c                   if        %subst(c2fdat:7:9) = *blank
     c                   movel     c2fdat        wdat
     c     *ymd          test(d e)               wdat
     c                   if        not %error
     c                   goto      f2okf
     c                   endif
     c     *dmy          test(d e)               wdat
     c                   if        not %error
     c                   goto      f2okf
     c                   endif
     c                   eval      w_feil = 'Forfallsdato, feil'
     c                   goto      UpdFeil
     c                   endif
     c     f2okf         tag
     c                   select
     c                   when      %subst(c2fdat:3:1) = '.' and
     c                             %subst(c2fdat:6:1) = '.'
     c                   eval      %subst(w_dmy:1:2) = %subst(c2fdat:1:2)
     c                   eval      %subst(w_dmy:3:2) = %subst(c2fdat:4:2)
     c                   eval      %subst(w_dmy:5:2) = %subst(c2fdat:9:2)
     c                   move      w_dmy         w_dmyn
     c                   other
     c                   eval      w_dat6 = %subst(c2fdat:1:6)
     c                   eval      w_dat5 = %subst(c2fdat:1:5)
     c                   eval      wdat = *zero
     c                   if        %subst(c2fdat:6:1) = *blank
     c                   move      w_dat5        wdat
     c                   else
     c                   move      w_dat6        wdat
     c                   endif
     c     *ymd          test(d e)               wdat
     c                   movel     wdat          waar
     c                   if        not %error        and
     c                             waar < (uyear + 1) and
     c                             waar > (uyear - 1)
     c                   else
     c     *dmy          test(d e)               wdat
     c                   move      wdat          waar
     c                   if        not %error        and
     c                             waar < (uyear + 1) and
     c                             waar > (uyear - 1)
     c                   endif
     c                   endif
     c                   endsl
      *   Valuta beløp
     c                   if        %scan(' ':c2valb:1) > 12 or
6.20 c                             %check('0123456789,.  ':c2valb) > 0
     c                   eval      w_feil = 'Valutabeløp feil'
     c                   goto      UpdFeil
     c                   endif
     c                   eval      w_b  = *blank
     c                   eval      w_kr = *blank
     c                   eval      w_or = *blank
     c     ' '           scan      c2valb        i
     c     ','           scan      c2valb        j
6.20 c                   if        j = 0
6.20 c     '.'           scan      c2belo        j
6.20 c                   endif
     c                   if        i > 1
     c                   if        j > 0
     c                   eval      %subst(w_kr:13-j+2:j-1) =
     c                             %subst(c2valb:1:j-1)
     c                   eval      w_or = %subst(c2valb:j+1:2)
     c                   move      w_kr          w_krn
     c                   move      w_or          w_orn
     c                   else
     c                   eval      %subst(w_kr:13-i:i-1) =
     c                             %subst(c2valb:1:i-1)
     c                   move      w_kr          w_krn
     c                   move      w_or          w_orn
     c                   endif
     c                   else
     c                   endif
      *   Kreidt Valutakode
      *   Bilagstekst
     c                   if        %scan(' ':c2text:1) > 21
     c                   eval      w_feil = 'Tekst mer enn 20 pos.'
     c                   goto      UpdFeil
     c                   endif
      *   Leverandørens Faktura nummer
     c                   if        %scan(' ':c2lfak:1) > 16 or
     c                             %subst(c2lfak:21:10) <> ' '
     c                   eval      w_feil = 'LevFaktNr > 20 pos.'
     c                   goto      UpdFeil
     c                   endif
      *   Kidd
     c                   if        %scan(' ':c2kidi:1) > 26  or
     c                             %check('0123456789 -':c2kidi) > 0
     c                   eval      w_feil = 'Kid feil'
     c                   goto      UpdFeil
     c                   endif
      *  Prosjekt foreløpig
     c                   if        %scan(' ':c2pros:1) > 7
     c*                            %check('0123456789 ':c2pros) > 0
     c                   eval      w_feil = 'Prosjektnr feil'
     c                   goto      UpdFeil
     c                   endif
     c                   eval      j   = 7
     c                   eval      i   = 7
     c                   eval      w6x = *blank
     c                   do        6
     c                   eval      i = i - 1
     c                   if        %subst(c2pros:i:1) <> *blank
     c                   eval      j = j - 1
     c                   eval      %subst(w6x:j:1) = %subst(c2pros:i:1)
     c                   endif
     c                   enddo
      *  Aktivitet
     c                   if        %scan(' ':c2akti:1) > 7
     c                   eval      w_feil = 'Aktivitet feil'
     c                   goto      UpdFeil
     c                   endif
      *  CompelloId
     c                   if        %scan(' ':c2huid:1) > 37 or
     c                             c2huid = *blank
     c                   eval      w_feil = 'CompelloId mangler/feil'
     c                   goto      UpdFeil
     c                   endif
      *
     c     UpdFeil       tag
      *
     c     kont_end      endsr
      *
      /eject
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for posisjonering på fgrpo
      *
     c     rcoml1_key    klist
     c*                  kfld                    rcoml1_fgrp
     c                   kfld                    rcoml1_huid
      *
      * Key for posisjonering på huidling
      *
     c     rcomlu_key    klist
     c*                  kfld                    rcomlu_fgrp
     c                   kfld                    rcomlu_huid
      *
      * Key for les på fgrpo
      *
     c     rcomlr_key    klist
     c*                  kfld                    rcomlr_fgrp
     c                   kfld                    rcomlr_huid
      *
      * Henter verdier fra LDA, og initierer skjermbildet
      *
     c                   eval      w_firm = l_firm
     c                   move      uyear         wuaa
     c                   eval      wuaa = wuaa + 2000
      *
     c                   eval      *in22 = *on
     c                   eval      *in31 = *on
      *
      * Posisjonerer databasen, og fyller opp subfile
      *
     c                   eval      w_seqe = 'K'
     c*                  eval      rcoml1_fgrp = l_fgrp
     c                   if        l_asp = 'ASP'
     c*                  eval      rcoml1_fgrp = *blank
     c                   eval      *in31 = *off
     c                   endif
     c                   eval      rcoml1_huid = *blank
     c     rcoml1_key    setll     rcoml1
      *
     c                   exsr      crt_subfile
      *
     c                   endsr
