     A*%%TS  SD  19950406  123416  AMD         REL-V2R3M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3 -
     A                                             27 132 *WIDE)
     A*                                     DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A          R M1WIN
     A*%%TS  SD  19950406  123416  AMD         REL-V2R3M0  5738-PW1
     A                                      CA12
     A                                      KEEP
     A                                      WINDOW(&W_ACLI &W_ACPO 14 54)
     A            W_ACLI         2S 0P
     A            W_ACPO         3S 0P
     A                                  2  2' Melding : '
     A                                      DSPATR(RI)
     A            M1MLD1    R        O  4  2REFFLD(AÅMELD)
     A**                                    DSPATR(UL)
     A                                      COLOR(WHT)
     A            M1MLD2    R        O  5  2REFFLD(AÅMELD)
     A**                                    DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  6  2'Svar ja for OK, nei for ikke OK. .-
     A                                       . .'
     A            M1SVAR    R        B  6 43REFFLD(AÅSVAR)
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  6 47'J=Ja'
     A                                  7 47'N=Nei'
     A            M2MLD1    R        O  9  2REFFLD(AÅMELD)
     A**                                    DSPATR(UL)
     A                                      COLOR(WHT)
     A            M2MLD2    R        O 10  2REFFLD(AÅMELD)
     A**                                    DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 12  2'F12=Annuller'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
