     A*%%TS  SD  20250328  125529  MTTASSKO    REL-V7R4M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : NXCLOUD
     A* Format. . . . . : ADMSUPP
     A* Beskrivelse . . : Administrasjonsmeny kundesupport
     A*
     A* Spesialversjon. : Mestergruppen/XLBYGG
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20250328  125529  MTTASSKO    REL-V7R4M0  5770-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 41'Mestergruppen/XLBYGG'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'MGR Supportmeny'
     A                                      COLOR(WHT)
     A*                                 2 29'(ADMSUPP)'
     A                                  2 41'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 49USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  4'Daglig drift'
     A                                      COLOR(WHT)
     A*                                 4 43'Støttefunksjoner'
     A*                                     COLOR(WHT)
     A                                  5  5'1. Arbeide med brukere'
     A                                  6  5'2. Tilgangskontroll'
     A                                  7  5'3. Printerstyring'
     A                                  8  5'4. Rutineregister'
     A                                  9  5'5. Endre varetype L/S'
     A                                 10  5'6. Endre statistikkenhet'
     A                                 11  5'7. Arbeide med varer/enheter'
     A                                 12  5'8. Arbeide med rabattmatriser'
     A                                 13  5'9. Endre NOBB utgårdato'
     A                                  4 41'Import'
     A                                      COLOR(WHT)
     A                                  5 41'21. Innlesing av kunder'
     A                                  6 41'22. Innlesing av kundeprosjekter'
     A                                 10 41'Eksport'
     A                                      COLOR(WHT)
     A                                 11 41'31. Eksport av kunder'
     A                                 12 41'32. Eksport av kundeprosjekter'
      *
     A                                 22 28'Valg:'
     A            VALG           2Y 0B 22 34EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 20  5'90. Gå ut av systemet    '
     A*                                23  2'F1=Velg firma'
     A*                                     COLOR(BLU)
     A*                                23 17'F3=Tilbake'
     A*                                     COLOR(BLU)
     A*                                23 30'F5=Driftsmeny'
     A*                                     COLOR(BLU)
     A*                                23 46'F6=Meldinger'
     A*                                     COLOR(BLU)
     A*                                23 61'F10=Kommando-linje'
     A*                                     COLOR(BLU)
