     A*%%TS  SD  20150414  090832  ASK620      REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A*
     A          R B1SFL                     SFL
     A*%%TS  SD  20010702  094226  ASK         REL-V4R4M0  5769-PW1
     A            B1VALG    R        B  8  2REFFLD(LÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(5 8 0)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            B1UID          9Y 0H
     A            B1DATO         6Y 0O  8  4EDTWRD('  .  .  ')
     A            B1TIME         6Y 0O  8 13EDTWRD('  .  .  ')
     A            B1FKOD         1A  O  8 22
     A            B1PROG        26A  O  8 24
     A            B1COMD         1A  O  8 51
     A            B1PARM        25A     8 53
     A*
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20150413  155518  ASK620      REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&WCURRN)
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WCURRN         5S 0H
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'ASNAVIOKO    '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Feillogg NAV transaksjoner'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2' 5=Vise detaljer  8=Vise parameter-
     A                                      streng'
     A                                      COLOR(BLU)
     A                                  6  2'V Dato     Tid        Transaksjon -
     A                                                       Parameter         -
     A                                            '
     A                                      COLOR(WHT)
     A                                  4  2'Fra dato:'
     A            B2DATO         6Y 0B  4 12COLOR(YLW)
     A                                      DSPATR(PC)
     A                                      OVRDTA
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A*
     A          R B2CMD
     A*%%TS  SD  20150410  142439  ASK620      REL-V7R1M0  5770-WDS
     A                                 23  2'F3=Gå tilbake                 F5=F-
     A                                      orny            '
     A                                      COLOR(BLU)
     A*
     A          R C1BLD
     A*%%TS  SD  20150414  090832  ASK620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      CLRL(*ALL)
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'ASNAVIOKO    '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Feillogg NAV transaksjoner'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Meldingsdetaljer:'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  6  1'Dato       :'
     A                                      COLOR(WHT)
     A            C1DATO         6Y 0O  6 14EDTWRD('  .  .  ')
     A                                  7  1'Tid        :'
     A                                      COLOR(WHT)
     A            C1TIME         6Y 0O  7 14EDTWRD('  .  .  ')
     A                                  9  1'Program    :'
     A                                      COLOR(WHT)
     A            C1PROG        40A  O  9 14
     A                                 10  1'Transaksjon:'
     A                                      COLOR(WHT)
     A            C1COMD        20A  O 10 14
     A                                 12  1'Parameter:'
     A                                      COLOR(WHT)
     A            C1PARM       720A  O 13  1
     A*         R C1BLD
     A          R D1BLD
     A*%%TS  SD  20150414  090832  ASK620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      CLRL(*ALL)
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'ASNAVIOKO    '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Feillogg NAV transaksjoner'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Parameterstreng:'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            D1PARM      1360A  O  5  1
     A                                 23  2'F3=Gå tilbake              '
     A                                      COLOR(BLU)
