     A*%%TS  SD  20210526  094403  ASP_J14     REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      CA03(03 'F3=Avbryt')
     A          R M1WIN
     A*%%TS  SD  20210526  094403  ASP_J14     REL-V7R3M0  5770-WDS
     A                                      WINDOW(03 03 15 70)
     A                                      KEEP
     A*           W_ACLI         2S 0P
     A*           W_ACPO         3S 0P
     A                                  2  2'       Oppdatering av kunder     '
     A                                      DSPATR(RI)
     A                                 14  4'F03=Avbryt'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 80' '
