     A*%%TS  SD  20120110  152814  BOF620      REL-V7R1M0  5770-WDS
     A*%%EC
     A*K00       220720 ask  Nytt skjermbilde
     A*8.04      030522 ask  Utvidet eksternt doknr i skjermbilde
     A*8.05      020822 bof  Utvidet antall fra 4 til 5 i bildet
8.12 A*800       031224 ask  Lagt in kontroll om bilagsnummer finnes
8.12 A*                      i overføringsfiler NXS-20521
     A*-----------------------------------------------------------------
     A                                      DSPSIZ(27 132 *WIDE)
     A                                      PRINT
     A*                                     HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20070328  124845  AMD550      REL-V5R4M0  5722-WDS
     A            B1TMST          Z  H
     A            B1TRTY         4A  H
     A            B1USER        10A  H
     A            B1VALG         1Y 0B  6  2CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      VALUES(0 4 5 8 9)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A            B1BILN         8Y 0O  6  4
     A  50                                  COLOR(RED)
     A            B1BSUM        12Y 2O  6 13EDTWRD('        0 ,  ')
     A  50                                  COLOR(RED)
     A            B1ANTA         5Y 0O  6 27EDTCDE(Z)
     A  50                                  COLOR(RED)
     A            B1DAT1         8A  O  6 33
     A  50                                  COLOR(RED)
     A            B1TIM1         6A  O  6 42
     A  50                                  COLOR(RED)
     A            B1DAT2         8A  O  6 49
     A  50                                  COLOR(RED)
     A            B1TIM2         6A  O  6 58
     A  50                                  COLOR(RED)
     A            B1DAT3         8A  O  6 66
     A  50                                  COLOR(RED)
     A            B1TIM3         6A  O  6 75
     A  50                                  COLOR(RED)
     A            B1DAT4         8A  O  6 83
     A  50                                  COLOR(RED)
     A            B1TIM4         6A  O  6 92
     A  50                                  COLOR(RED)
     A            B1DAT5         8A  O  6100
     A  50                                  COLOR(RED)
     A            B1TIM5         6A  O  6109
     A  50                                  COLOR(RED)
     A            B1DAT6         8A  O  6117
     A  50                                  COLOR(RED)
     A            B1TIM6         6A  O  6126
     A  50                                  COLOR(RED)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20070328  151100  AMD550      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0019)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'NEXSTEP'
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Transaksjonslogg økonomi - bilag  -
     A                                              '
     A                                      COLOR(WHT)
     A                                  2 38'RF501Z2'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      COLOR(WHT)
     A                                  4  2' 5=Vis detaljer 8=Vis linjer  9=Om-
     A                                      kjøring  4=Slett bilag'
     A                                      COLOR(BLU)
     A                                  5  2'V'
     A                                      COLOR(WHT)
     A                                  5  4'Bilagsnr'
     A                                      COLOR(WHT)
     A                                  5 14'Bilagssum'
     A                                      COLOR(WHT)
     A                                  5 28'Ant.'
     A                                      COLOR(WHT)
     A                                  5 34'Dannet'
     A                                      COLOR(WHT)
     A                                  5 43'Tid'
     A                                      COLOR(WHT)
     A                                  5 49'Overført'
     A                                      COLOR(WHT)
     A                                  5 59'Tid'
     A                                      COLOR(WHT)
     A                                  5 68'Kladd'
     A                                      COLOR(WHT)
     A                                  5 76'Tid'
     A                                      COLOR(WHT)
     A                                  5 84'Journal'
     A                                      COLOR(WHT)
     A                                  5 93'Tid'
     A                                      COLOR(WHT)
     A                                  5101'Omkjørt'
     A                                      COLOR(WHT)
     A                                  5110'Tid'
     A                                      COLOR(WHT)
     A                                  5118'Slettet'
     A                                      COLOR(WHT)
     A                                  5127'Tid'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20050621  150935  ASK530      REL-V5R2M0  5722-WDS
     A                                 26  2'F1=Filter '
     A                                      COLOR(BLU)
     A                                 26 23'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 26 38'F5=Forny'
     A                                      COLOR(BLU)
     A          R H1WIN
     A*%%TS  SD  20051027  101210  AMD550      REL-V5R3M0  5722-WDS
     A                                      WINDOW(02 02 12 55)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2'Filter'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  2 49'RF501H1'
     A                                      COLOR(WHT)
     A                                  4  2'Vise bare feil'
     A            H1FEIL         1A  B  4 22
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  4 23'(k)'
     A                                  5  2'Søk bilagsnr  '
     A            H1BILN         8Y 0B  5 22
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      EDTWRD('       0')
     A                                 11  1'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B3WIN
     A*%%TS  SD  20051020  151154  AMD550      REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 25 100)
     A                                      CA03
     A                                      CF04
     A                                      CF08
     A                                      CA12
     A                                      PUTOVR
     A                                  1  2'Bilagsstatus'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            B3TRTY         4A  O  1 16
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  1 69'RF501B3'
     A                                      COLOR(WHT)
     A            B3BILN         8Y 0O  2  2
     A            B3BITX        30A  O  2 11
     A                                  4 28'Dato'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 38'Tid'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 46'Bruker'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 58'Feil'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 67'Ant.'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 77'Sum debet'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 90'Sum kredit'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5  2'Transaksjoner dannet'
     A            B3DAT1         8A  O  5 26
     A            B3TIM1         8A  O  5 36
     A            B3ANT1         5Y 0O  5 66EDTCDE(Z)
     A            B3SUD1        12Y 2O  5 73EDTWRD('          , 0')
     A            B3SUK1        12Y 2O  5 87EDTWRD('          , 0')
     A            B3USR1        10A  O  5 46
     A                                  7  2'Transaksjoner overført'
     A            B3DAT2         8A  O  7 26
     A            B3TIM2         8A  O  7 36
     A            B3FKO2         2A  O  7 59
     A            B3ANT2         5Y 0O  7 66EDTCDE(Z)
     A            B3SUD2        12Y 2O  7 73EDTWRD('          , 0')
     A  54                                  COLOR(RED)
     A            B3SUK2        12Y 2O  7 87EDTWRD('          , 0')
     A  54                                  COLOR(RED)
     A            B3USR2        10A  O  7 46
     A                                  9  2'Kladd dannet'
     A            B3DAT3         8A  O  9 26
     A            B3TIM3         8A  O  9 36
     A            B3FKO3         2A  O  9 59
     A            B3ANT3         5Y 0O  9 66EDTCDE(Z)
     A            B3SUD3        12Y 2O  9 73EDTWRD('          , 0')
     A  55                                  COLOR(RED)
     A            B3SUK3        12Y 2O  9 87EDTWRD('          , 0')
     A  55                                  COLOR(RED)
     A            B3USR3        10A  O  9 46
     A                                 11  2'Journal kjørt'
     A            B3DAT4         8A  O 11 26
     A            B3TIM4         8A  O 11 36
     A            B3FKO4         2A  O 11 59
     A            B3ANT4         5Y 0O 11 66EDTCDE(Z)
     A            B3SUD4        12Y 2O 11 73EDTWRD('          , 0')
     A  55                                  COLOR(RED)
     A            B3SUK4        12Y 2O 11 87EDTWRD('          , 0')
     A  55                                  COLOR(RED)
     A            B3USR4        10A  O 11 46
     A                                 14  2'Bunt omkjørt'
     A            B3DAT5         8A  O 14 26
     A            B3TIM5         8A  O 14 36
     A            B3USR5        10A  O 14 46
     A                                 15  2'Bunt slettet'
     A            B3DAT6         8A  O 15 26
     A            B3TIM6         8A  O 15 36
     A            B3USR6        10A  O 15 46
     A                                 18  2'Ekst. doknr   '
8.04 A            B3DONR        50   O 18 19
     A                                 19  2'Ekst. dokid'
     A            B3DOID        25   O 19 19
     A                                 24  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 24 17'F8=Feilinfo'
     A                                      COLOR(BLU)
     A          R B4WIN
     A*%%TS  SD  20020312  190907  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(02 02 14 45)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette bunt  '
     A                                      COLOR(WHT)
     A                                      DSPATR(RI)
     A                                  2 25'RF501B4'
     A                                      COLOR(WHT)
     A                                  4  2'Bekrefte sletting av bilag!'
     A                                      COLOR(WHT)
     A                                  6  3'Bilagsnr'
     A            B4BILN         8Y 0O  6 14
     A                                  7  2' Tidspunkt'
     A            B4DATE         8A  O  7 14
     A            B4TIME         8A  O  7 23
     A                                  8  3'Bilagssum'
     A            B4BSUM        12Y 2O  8 14EDTWRD('        0 ,  ')
     A                                  9  2' Bruker'
     A            B4USER        10A  O  9 14
     A                                 11  2'For å slette, trykk ENTER / OK'
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B14MSG1
     A*%%TS  SD  20110510  140024  BOF620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 8 35)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  3  2'Bruker har ikke tilgang  '
     A                                      COLOR(WHT)
     A                                  4  2'til sletting av bilag!        '
     A                                      COLOR(WHT)
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B5WIN
     A*%%TS  SD  20020312  190907  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(02 02 14 70)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Feilstatuser bilag '
     A                                      COLOR(WHT)
     A                                      DSPATR(RI)
     A                                  2 25'RF501B5'
     A                                      COLOR(WHT)
     A                                  4  2'Feilstatus overføring '
     A                                      COLOR(WHT)
     A            B5FKOV         2A  O  4 25
     A            B5FTO1        60A  O  5  2
     A            B5FTO2        60A  O  6  2
     A                                  7  2'Feilstatus kladd      '
     A                                      COLOR(WHT)
     A            B5FKKL         2A  O  7 25
     A            B5FTK1        60A  O  8  2
     A            B5FTK2        60A  O  9  2
     A                                 10  2'Feilstatus journal    '
     A                                      COLOR(WHT)
     A            B5FKJO         2A  O 10 25
     A            B5FTJ1        60A  O 11  2
     A            B5FTJ2        60A  O 12  2
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B8WIN
     A*%%TS  SD  20020312  190907  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(02 02 15 45)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Omkjøring av bilag '
     A                                      COLOR(WHT)
     A                                      DSPATR(RI)
     A                                  2 25'RF501B8'
     A                                      COLOR(WHT)
     A                                  4  2'Bekrefte omkjøring av bilag!'
     A                                      COLOR(WHT)
     A                                  6  3'Bilagsnr'
     A            B8BILN         8Y 0O  6 14
     A                                  7  2' Tidspunkt'
     A            B8DATE         8A  O  7 14
     A            B8TIME         8A  O  7 23
     A                                  8  3'Bilagssum'
     A            B8BSUM        12Y 2O  8 14EDTWRD('        0 ,  ')
     A                                  9  2' Bruker'
     A            B8USER        10A  O  9 14
     A                                 11  2' Omkjøring til'
     A            B8OKON        20A  O 11 17
     A                                 13  2'For å omkjøre, trykk ENTER / OK'
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B18MSG1
     A*%%TS  SD  20080522  120025  AMD560      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 8 35)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  3  2'Bilag er slettet    '
     A                                      COLOR(WHT)
     A                                  4  2'og kan ikke omkjøres.   '
     A                                      COLOR(WHT)
     A                                  6  2' '
     A                                      COLOR(WHT)
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B18MSG2
     A*%%TS  SD  20110510  140024  BOF620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 8 35)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  3  2'Bilag er allerede omkjørt '
     A                                      COLOR(WHT)
     A                                  4  2'og kan ikke omkjøres på nytt.  '
     A                                      COLOR(WHT)
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B18MSG3
     A*%%TS  SD  20110510  140024  BOF620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 8 35)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  3  2'Bruker har ikke tilgang'
     A                                      COLOR(WHT)
     A                                  4  2'til omkjøring av bilag.  '
     A                                      COLOR(WHT)
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
8.12 A          R B18MSG4
8.12 A*%%TS  SD  20110510  140024  BOF620      REL-V7R1M0  5770-WDS
8.12 A                                      WINDOW(*DFT 8 35)
8.12 A                                      CA03
8.12 A                                      CA12
8.12 A                                      PUTOVR
8.12 A                                  3  2'Bilag finnes allerede'
8.12 A                                      COLOR(WHT)
8.12 A                                  4  2'i overføring - sjekk dette!    '
8.12 A                                      COLOR(WHT)
8.12 A                                  7  2'F3=Gå tilbake'
8.12 A                                      COLOR(BLU)
