     A*%%TS  SD  20091123  092026  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
     A*
     A*-----------------------------------------------------------------
     A                                      DSPSIZ(27 132 *WIDE)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20091123  090442  BOF610      REL-V5R4M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 6)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1VARE    R   -7   O  8  4REFFLD(VVVARE)
     A            B1TEK1    R        O  8 13REFFLD(VVTEK1)
     A            B1TEK2    R        O  8 50REFFLD(VVTEK1)
     A            B1NUDA         6Y 0O  8 88EDTWRD('  .  .  ')
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20091123  092026  BOF610      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A  31                                  SFLMSGID(VME0310 *LIBL/QMFOFAK 31)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering '
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Varer med passert NOBB utgår dato'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      COLOR(WHT)
     A                                  6  3'6=Endre utgårdato'
     A                                      COLOR(BLU)
     A                                  4  6'Varenr.'
     A                                      COLOR(WHT)
     A                                  5  4'+'
     A            B2PVAR    R   -7   B  5  6REFFLD(VEPVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'V'
     A                                      COLOR(WHT)
     A                                  7  4'Varenr.'
     A                                      COLOR(WHT)
     A                                  7 13'Varenavn          '
     A                                      COLOR(WHT)
     A                                  7 88'Utgårdato'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20091120  145108  BOF610      REL-V5R4M0  5722-WDS
     A                                 26  2'F3=Gå tilbake   F4=Spørring   F5=F-
     A                                      orny'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20091019  192728  BOF610      REL-V5R4M0  5722-WDS
     A                                      CA03
     A*                                     CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering '
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Varer med passert NOBB utgår dato'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenummer . . . . . . . . .'
     A            C2VARE    R   -7   O  5 31REFFLD(VEPVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2TEK1    R        O  5 40REFFLD(VVTEK1)
     A                                  7  2'NOBB utgår dato . . . . . .'
     A            C2NUDA         6Y 0B  7 31COLOR(YLW)
     A                                      CHECK(RB)
     A  31                                  ERRMSG('Ugyldig dato' 31)
     A                                      OVRDTA
     A            C2PODA         6Y 0O 25 48COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 25 57'/'
     A            C2PEDA         6Y 0O 25 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 25 68'/'
     A            C2PEUS    R        O 25 70REFFLD(VEEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 26  2'F3=Gå tilbake'
     A*                                26  2'F3=Gå tilbake  F4=Spørring'
     A                                      COLOR(BLU)
