             PGM
             DCLF       FILE(ADMSUPP)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&ONUM)     TYPE(*DEC)  LEN(8)
             DCL        VAR(&LPRO)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VARE)     TYPE(*CHAR) LEN(15) -
                        VALUE('               ')
             DCL        VAR(&LAGE)     TYPE(*DEC)  LEN(2)  -
                        VALUE(00)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sjekk at du har tilgang til denne menyen                          */
             CHGVAR     VAR(&LEVL)     VALUE('99')
             CHGVAR     VAR(&OKOK)     VALUE('  ')
             CALL       PGM(AX050C)    PARM(&LEVL &OKOK)
             IF         COND(&OKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Sette opp driftsmiljø                                             */

             CALL       PGM(FSETUP)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01)    THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05)    THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06)    THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* Valg 1 Arbeide med brukere                                        */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(AX022C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2 Tilgangskontroll                                           */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(AD001R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3 Printerstyring                                             */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CHGVAR     VAR(&ONUM)     VALUE(0)
             CHGVAR     VAR(&LPRO)     VALUE(' ')
             CALL       PGM(AX016C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4 Rutineregister                                             */
             IF         COND(&VALG *EQ 4) THEN(DO)
                CALL       PGM(AX014C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5 Endre varetype                                             */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(LX713R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6 Endre statistikkenhet                                      */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(VE590R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7 Arbeide med varer/enheter                                  */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(VV100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8 Arbeide med varer/enheter                                  */
             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(FR100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9 Endre NOBB utgårdato                                       */
             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(VE591R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 21 Innlesing av kunder                                       */
             IF         COND(&VALG *EQ 21) THEN(DO)
             CALL       PGM(AX051C)
             CALL       PGM(KUNDEXLC)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 22 Innlesing av kundeprosjekter                              */
             IF         COND(&VALG *EQ 22) THEN(DO)
             CALL       PGM(AX051C)
             CALL       PGM(KUNDPXLC)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 31 Eksport av kunder                                         */
             IF         COND(&VALG *EQ 31) THEN(DO)
             CALL       PGM(RX600R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 32 Eksport av kundeprosjekter                                */
             IF         COND(&VALG *EQ 32) THEN(DO)
             CALL       PGM(RX605R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
