             pgm        parm(&user &stat)
             DCL        VAR(&user)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&stat)     TYPE(*CHAR) LEN(10)

/* Må kjøres med spesielle rettigheter                               */

             dclprcopt  USRPRF(*OWNER)

/* Hent brukerens status                                             */

             RTVUSRPRF  USRPRF(&USER) STATUS(&STAT)
             monmsg     msgid(cpf2204) exec(do)
             chgvar     var(&stat) value('Slettet')
             enddo


 END:        ENDPGM
