             PGM        PARM(&fgr)

/*-------------------------------------------------------------------*/
/*8.01 250924 bsa Endret pålogging                                   */
/*8.02 181024 bsa Setter egen kode for batchkjøring.                 */
/*8.03 231024 bsa Setter egen kode for sluttstatus batchkjøring      */
/*                                                                   */
/*                                                                   */
/*-------------------------------------------------------------------*/

/*8.03*/     dcl        var(&sts)    type(*dec)  LEN(2 0)
             DCL        VAR(&fgr)    type(*char) LEN(3)
             dcl        var(&ip)     type(*char) LEN(10)
/*8.01*/     dcl        var(&dbib)   type(*char) LEN(6) value('ADBxxx')

/*8.01 Endre i parm til rette filgruppe                              */
/*8.01*/     CALL       PGM(AA720C) PARM(&fgr)

/*8.01       chgvar     var(&ip)  value('IPASP_' *cat &fgr)          */
/*8.01       call       pgm(&ip)                                     */

/*8.01 Endre her også, AA720C gir ikke alltid riktig filgruppe       */
/*8.01*/     chgvar     var(%sst(&dbib 4 3)) value(&fgr)
/*8.01*/     chgcurlib  curlib(&dbib)

/*8.01*/     dlyjob     dly(10)

             CHGDTAARA  DTAARA(*LDA (1 7)) VALUE('SCEDULE') /* Sier +
                          at Økonomi skal oppdateres direkte' */

/*8.02*/     chgdtaara  dtaara(*LDA (500 1)) VALUE('1') /* Setter +
                          eget flagg for batch' */
/*8.03*/     chgdtaara  dtaara(*LDA (501 2)) VALUE('00') /* Setter +
                          eget flagg for kjøring */

             call       pgm(BO123R)

             ENDPGM
