             PGM        PARM(&BPPARM)
/*                                                                   */
             DCL        VAR(&BPPARM)  TYPE(*CHAr) LEN(256)
             DCL        VAR(&BPTIME)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&w_job)   type(*char) LEN(10)
             DCL        VAR(&usr)     type(*char) LEN(10)
             DCL        VAR(&txt)     type(*char) LEN(40)
             DCL        VAR(&fgr)     type(*char) LEN(3)
             DCL        VAR(&scedule) type(*char) LEN(7)
             DCL        VAR(&kode)    type(*dec)  len(2 0)
             DCL        VAR(&onof)    type(*dec)  len(1 0)
/*                                                                   */
/*           Henter inn verdi i tidsvaribalen                        */
/*                                                                   */
             CHGVAR     VAR(&BPTIME) VALUE(%SST(&BPPARM 202 6))
             rtvdtaara  dtaara(*LDA (931 3)) rtnvar(&fgr)
/*                                                                   */
/*           Jobben skal hertter kjøres fra Jobbplan                 */
/*                                                                   */
             chgvar     var(&w_job) value(&fgr *cat '_DagOp')
             chgvar     var(&usr)   value('ASP_' *cat &fgr)
             chgvar     var(&txt)   value('Daglig dagsoppgjør for ' +
                                    *cat &fgr)
/*                                                                   */
             addjobscde job(&w_job) cmd(call pgm(AABATCH) +
                          parm((&fgr) ('BO123C') ('1'))) +
                          frq(*weekly) scddate(*none) scdday(*mon +
                          *tue *wed *thu *fri *sat) +
                          scdtime(&bptime) save(*no) user(&usr) +
                          Text(&txt)

/*                                                                   */
             ENDPGM
