
/*           Innlensing av kundeprosjekt fra excel                   */

             pgm

      dcl        var(&lib)  type(*char) len(10)
      dcl        var(&ban)  type(*char) len(60)
      dcl        var(&utf)  type(*char) len(60)

      rtvdtaara  dtaara(*lda (934 10)) rtnvar(&lib)

      call       pgm(hentifs) parm('XLKUPRO   ' &LIB +
                                          'XLKUPRO   ' &ban &utf)
      call       pgm(kuproxl)

end:         endpgm
