
/*           Innlensing av kunder fra excel                          */

             pgm

             dclf       file(kundexlc)
             dcl        var(&lib)  type(*char) len(10)
             dcl        var(&ban)  type(*char) len(60)
             dcl        var(&utf)  type(*char) len(60)
             dcl        var(&stat) type(*char) len(10)
             dcl        var(&w_acli) type(*dec) len(2 0)
             dcl        var(&w_acpo) type(*dec) len(2 0)
/*           dclf       file(M1WIN)                                 */

snd:         chgvar     var(&w_acli)   value(03)
             chgvar     var(&w_acpo)   value(03)
             sndrcvf    rcdfmt(M1WIN)
             if         cond(&In03) then(do)
               chgvar   var(&stat)  value('Avslutt')
               goto     cmdlbl(end)
             enddo

      rtvdtaara  dtaara(*lda (934 10)) rtnvar(&lib)

      call       pgm(hentifs) parm('XLKUNDE   ' &LIB +
                                          'XLKUNDE   ' &ban &utf)
      call       pgm(kundexlr)
/*  Bygge søkebegrep  */
/*    call       pgm(rk751r) */
end:         endpgm
