             PGM
/*8.01  01.11.22 mst Ny rutine/programnavn for danne poster til Øko  */
 /* 8.01*/   DCL        VAR(&nbr)      TYPE(*CHAR) LEN(6)
 /* 8.01*/   DCL        VAR(&usr)      TYPE(*CHAR) LEN(10)
 /* 8.01*/   DCL        VAR(&JOB)      TYPE(*CHAR) LEN(10)
 /* 8.01*/   DCL        VAR(&type)     TYPE(*CHAR) LEN(1)
             DCLF       FILE(*LIBL/ROM00PF) /*  8.01*/
/* -> 8.01  Finner hvilken rutine som kjøres                            */
             CALL       PGM(ROM00C) PARM(&TYPE)
/* -< 8.01  Finner hvilken rutine som kjøres                            */

/* Kaller program for danning av transaksjoner  - omkjøring          */

/*8.01*/     if         cond(&type *eq 'B')   then(do)
             OVRDBF     FILE(LOVFL1) TOFILE(*LIBL/LOMKL1)
/*8.01*/     enddo

             CALL       PGM(RN003R)

 END:        ENDPGM
