     A*%%TS  SD  20131031  080947  SST620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A          R M1WIN
     A*%%TS  SD  20131031  080947  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(&W_ACLI &W_ACPO 10 54)
     A                                      CA12
     A                                      KEEP
     A            W_ACLI         2S 0P
     A            W_ACPO         3S 0P
     A                                  2  2' Melding : '
     A                                      DSPATR(RI)
     A            M1MLD1    R        O  4  2REFFLD(AÅMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            M1MLD2    R        O  5  2REFFLD(AÅMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            M1SVAR        10A  B  7 14COLOR(YLW)
     A                                  7  2'Oppgi svar:'
     A            M1ALT1        27A  O  7 25
     A            M1ALT2        27A  O  8 25
     A                                  9  2'F12=Annuller'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
