     A*%%TS  SD  19950201  142709  AMD         REL-V2R3M0  5738-PW1
     A*
7.xx A*     bsa  310519    Tillater bredere skjerm
     A*
     A*-----------------------------------------------------------------
     A*%%EC
7.xx A                                      DSPSIZ(27 132 *WIDE -
7.xx A                                             24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A          R M1WIN
     A*%%TS  SD  19950201  142709  AMD         REL-V2R3M0  5738-PW1
     A                                      CA12
     A                                      KEEP
7.xx A*                                     WINDOW(&WACTLI &WACTPO 6 32)
7.xx A                                       WINDOW(2 2 9 32)
7.xx A*           WACTLI         2S 0P
7.xx A*           WACTPO         3S 0P
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
7.xx A*                                  2 20' AA006M1'
7.xx A*                                      COLOR(WHT)
     A            M1MLD1        30   O  4  2COLOR(WHT)
     A                                      TEXT('Meldingsfelt')
     A            M1MLD2        30   O  5  2COLOR(WHT)
     A                                      TEXT('Meldingsfelt')
7.xx A                                  7  7'Trykk på OK knappen'
7.xx A                                      COLOR(WHT)
     A          R ASUME                     ASSUME
     A                                 24 79' '
