     A*%%TS  SD  20040709  143758  AMD         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASPGPL
     A* Format. . . . . : AA003D
     A* Beskrivelse . . : Valg av Miljø
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       070704 AMD  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20040707  131458  AMD         REL-V5R2M0  5722-WDS
     A            B1VALG    R        B  5  3REFFLD(AÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            B1MILJ    R        O  5  7REFFLD(ARMILJ)
     A            B1BESK    R        O  5 12REFFLD(ARBESK)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20040709  143758  AMD         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      PUTOVR
     A                                      SFLCSRRRN(&W_CURN)
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  1 22'1=Velg'
     A                                      COLOR(BLU)
     A                                  3  1'Valg Miljø Beskrivelse'
     A                                      COLOR(WHT)
     A            B2MILJ    R        B  4  7REFFLD(ARMILJ)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  1  1'Valg av Miljø'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20040624  103206  AMD         REL-V5R2M0  5722-WDS
     A                                      WINDOW(&W_ACLI &W_ACPO 20 42)
     A                                 19  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A            W_ACLI         2S 0P
     A            W_ACPO         3S 0P
     A          R ASUME                     ASSUME
     A                                 20 30' '
