     A*%%TS  SD  20040913  090351  AMD         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASPGPL
     A* Format. . . . . : AA018D
     A* Beskrivelse . . : Parametre - avvik
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       280510 BSA  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20040913  090035  AMD         REL-V5R2M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(AÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            B1AFIR         3S 0O  8  5
     A            B1AAVD    R        O  8 11REFFLD(AFAAVD)
     A            B1ATXT        30A  O  8 17
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20040913  090351  AMD         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Driftssystem '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av PDF avvik      '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  4'Rutine:'
     A            B1RUTI    R        O  4 12REFFLD(AFPRUT)
     A                                  5  2'2=Endre  3=Kopier  4=Slett  5=Vis'
     A                                      COLOR(BLU)
     A                                  6  2'V  Firma Avd.  Beskrivelse'
     A                                      COLOR(WHT)
     A            B2AFIR    R        B  7  5REFFLD(AFAFIR)
     A                                      COLOR(YLW)
     A                                      DSPATR(PC)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20010919  105848  HKO         REL-V4R4M0  5769-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20040913  090035  AMD         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Driftssystem '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av avvik PDF parametre'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Rutine . . . . . . . . . . .'
     A            C1RUTI    R        O  5 31REFFLD(AFRUTI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Firma. . . . . . . . . . . .'
     A            C1AFIR         3S 0B  6 31
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1FTXT        20A  O  6 42
     A                                      OVRDTA
     A                                  7  2'Avdeling . . . . . . . . . .'
     A            C1AAVD    R        B  7 31REFFLD(AFAAVD)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1ATXT        20A  O  6 42
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20040913  082010  AMD         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Firma/avdeling finnes ikke '
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20040913  090351  AMD         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Driftssystem '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av avvik PDF parametre'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Rutine . . . . . . . . . . .'
     A            C2RUTI    R        O  5 31REFFLD(AFARUT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Firma. . . . . . . . . . . .'
     A            C2AFIR         3S 0O  6 31
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2FTXT        20A  O  6 42
     A                                      OVRDTA
     A                                  7  2'Avdeling . . . . . . . . . .'
     A            C2AAVD    R        O  7 31REFFLD(AFAAVD)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2ATXT        20A  O  7 42
     A                                      OVRDTA
     A                                  8  2'Aktiver informasjon. . . . .'
     A                                  8 33'0=Nei,1=Ja'
     A            C2UPDF         1N 0B  8 31COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9  2'Sendes på mail . . . . . . .'
     A                                  9 33'0=Nei,1=Ja'
     A            C2MAIL         1N 0B  9 31COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  9 46'Excel . . . . . .'
     A                                  9 66'0=Nei,1=Ja'
     A            C2EXLP         1N 0B  9 64COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 10  2'Arkiveres. . . . . . . . . .'
     A                                 10 33'0=Nei,1=Ja'
     A            C2ARKI         1N 0B 10 31COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 11  2'Forhåndsvisning. . . . . . .'
     A                                 11 33'0=Nei,1=Ja'
     A            C2SKJE         1N 0B 11 31COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 12  2'Liggende utskrift. . . . . .'
     A                                 12 33'0=Nei,1=Ja'
     A            C2LAND         1N 0B 12 31COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 15  2'OBS !- malene må finnes ved -
     A                                      bruk av Excel eller JASPER'
     A                                 16  2'XML mal. . . . . . . . . . .'
     A            C2XMLM        75A  B 17  2COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 18  2'JASPER mal . . . . . . . . .'
     A            C2JASM        75A  B 19  2COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 20  2'Logo/grafikk . . . . . . . .'
     A            C2LOGO        75A  B 21  2COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20040913  082010  AMD         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette avvik        '
     A                                      DSPATR(RI)
     A                                  4  2'Firma. . . . . . .'
     A            D1RUTI    R        O  4 21REFFLD(AFARUT)
     A                                  5  2'Firma. . . . . . .'
     A            D1AFIR    R        O  5 21REFFLD(AFAFIR)
     A                                  6  2'Avdeling . . . . .'
     A            D1AAVD    R        O  6 21REFFLD(AFAAVD)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20040913  090035  AMD         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Rutine . . . . . .'
     A            K1RUTI    R        O  4 21REFFLD(AFARUT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Firma. . . . . . .'
     A            K1AFIR    R        B  5 21REFFLD(AFAFIR)
     A  31                                  ERRMSGID(AMX0010 *LIBL/QMFAGPL 31)
     A  32                                  ERRMSGID(AMX0030 *LIBL/QMFAGPL 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Avdeling . . . . .'
     A            K1AAVD    R        B  6 21REFFLD(AFAAVD)
     A  31                                  ERRMSGID(AMX0010 *LIBL/QMFAGPL 31)
     A  32                                  ERRMSGID(AMX0030 *LIBL/QMFAGPL 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                 10  2'Rutine . . . . . .'
     A            K2RUTI    R        O 10 21REFFLD(AFARUT)
     A                                      OVRDTA
     A                                 11  2'Firma. . . . . . .'
     A            K2AFIR    R        O 11 21REFFLD(AFAFIR)
     A                                      OVRDTA
     A                                 12  2'Avdeling . . . . .'
     A            K2AAVD    R        O 12 21REFFLD(AFAAVD)
     A                                      OVRDTA
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
