     A*%%TS  SD  20050921  154919  AMD540      REL-V5R3M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASPGPL
     A* Format. . . . . : AA012D
     A* Beskrivelse . . : Filegrupper (Databibl.), Vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       070604 AMD  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20040607  152816  AMD         REL-V5R2M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(AÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5 8)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            B1FGRP    R        O  8  5REFFLD(AGFGRP)
     A            B1BIBL    R        O  8 11REFFLD(AGBIBL)
     A            B1BESK    R        O  8 24REFFLD(AGBESK)
     A            B1BACK    R        O  8 64REFFLD(AGBACK)
     A                                      TEXT('Droppe Backup')
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20040608  082233  AMD         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Driftssystem '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av file-grupper   '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'2=Endre  3=Kopier  4=Slett  5=Vis -
     A                                       8=Bygge databibliotek'
     A                                      COLOR(BLU)
     A                                  6  2'V  Fgrp  Databibl     Beskrivelse'
     A                                      COLOR(WHT)
     A                                  6 57'Droppe backup (1=ja)'
     A                                      COLOR(WHT)
     A            B2FGRP    R        B  7  5REFFLD(AGFGRP)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2BESK    R        B  7 24REFFLD(AGBESK)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20010919  105848  HKO         REL-V4R4M0  5769-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20040607  140636  AMD         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Driftssystem '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av File-grupper   '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'File-gruppe. . . . . . . . .'
     A            C1FGRP    R        B  5 31REFFLD(AGFGRP)
     A  31                                  ERRMSGID(AMG0010 *LIBL/QMFAGPL 31)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20040607  140636  AMD         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'File-gruppe finnes fra før '
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20050921  154919  AMD540      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Driftssystem '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av file-grupper   '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Filegruppe . . . . . . . . .'
     A            C1FGRP    R        O  5 31REFFLD(AGFGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Databibliotek. . . . . . . .'
     A            C2BIBL    R        O  7 31REFFLD(AGBIBL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Beskrivelse. . . . . . . . .'
     A            C2BESK    R        B  9 31REFFLD(AGBESK)
     A  31                                  ERRMSGID(AMG0100 *LIBL/QMFAGPL 31)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                 11  2'Utelates fra backup ?. . . .'
     A            C2BACK    R        B 11 31REFFLD(AGBACK)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 11 41'(1=Ja)'
     A*                                 9  2'Tilleggsfelt-1 . . . . . . .'
     A*           C2TFL1         5A  B  9 31COLOR(YLW)
     A* 30                                  DSPATR(PR)
     A*                                     OVRDTA
     A*                                10  2'Tilleggsfelt-2 . . . . . . .'
     A*           C2TFL2         5A  B 10 31COLOR(YLW)
     A* 30                                  DSPATR(PR)
     A*                                     OVRDTA
     A*                                18  2'Opprettet dato . . . . . . .'
     A*           C2ODAT         6Y 0O 18 31COLOR(YLW)
     A*                                     EDTWRD('  .  .  ')
     A*                                     OVRDTA
     A*                                19  2'Sist endret dato . . . . . .'
     A*           C2EDAT         6Y 0O 19 31COLOR(YLW)
     A*                                     EDTWRD('  .  .  ')
     A*                                     OVRDTA
     A*                                20  2'Endret av. . . . . . . . . .'
     A*           C2EUSR    R        O 20 31REFFLD(MREUSR)
     A*                                     COLOR(YLW)
     A*                                     OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20040607  154524  AMD         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette filegruppe   '
     A                                      DSPATR(RI)
     A                                  4  2'Filegruppe . . . .'
     A            D1FGRP    R        O  4 21REFFLD(AGFGRP)
     A                                  5  2'Databibliotek. . .'
     A            AGBIBL    R        O  5 21
     A                                  6  2'Beskrivelse. . . .'
     A            AGBESK    R        O  6 21
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20040607  152816  AMD         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'File-gruppe. . . .'
     A            K1FGRP    R        B  4 21REFFLD(AGFGRP)
     A  31                                  ERRMSGID(AMG0010 *LIBL/QMFAGPL 31)
     A  32                                  ERRMSGID(AMG0030 *LIBL/QMFAGPL 32)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  6  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  8  2'File-gruppe. . . .'
     A            AGFGRP    R        O  8 21OVRDTA
     A                                  9  2'Databibliotek. . .'
     A            AGBIBL    R        O  9 21OVRDTA
     A                                 10  2'Beskrivelse. . . .'
     A            AGBESK    R        O 10 21OVRDTA
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
