     A*%%TS  SD  19940131  095019  AMD         REL-V2R2M0  5738-PW1
     A*%%EC
7.xx A*     bkv  010719    Tillater brede5re skjerm
     A*
     A*-----------------------------------------------------------------
7.xx A                                      DSPSIZ(24 80 *DS3   -
7.xx A                                             27 132 *WIDE )
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A          R A1WIN
     A*%%TS  SD  19940131  095019  AMD         REL-V2R2M0  5738-PW1
     A                                      WINDOW(&W_ACLI &W_ACPO 8 54)
     A            W_ACLI         2S 0P
     A            W_ACPO         3S 0P
     A                                  1  2' Melding   '
     A                                      DSPATR(RI)
     A            P_MELD    R        O  3  2REFFLD(AÅMELD)
     A                                      COLOR(WHT)
     A            P_MEL1    R        O  4  2REFFLD(AÅMELD)
     A                                      COLOR(WHT)
     A            P_MEL2    R        O  5  2REFFLD(AÅMELD)
     A                                      COLOR(WHT)
     A                                  7  2'Trykk enter for å fortsette..'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
