     A*%%TS  SD  19940527  135449  AMD         REL-V2R3M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      CA12(12 'F12=Annuller')
     A          R A1WIN
     A*%%TS  SD  19940527  135449  AMD         REL-V2R3M0  5738-PW1
     A                                      WINDOW(&WACTLI &WACTPO 12 54)
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A                                  2  2' Installasjon av ny versjon ASPGPL-
     A                                       '
     A                                      DSPATR(RI)
     A                                      COLOR(GRN)
     A            A1MLD1    R        O  6  2REFFLD(AÅMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            A1MLD2    R        O  7  2REFFLD(AÅMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9  2'Svar ja for OK, nei for ikke OK. .-
     A                                       . .'
     A            A1VALG    R        B  9 43REFFLD(AÅVALA)
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  9 47'J=Ja'
     A                                 10 47'N=Nei'
     A                                 11  2'F12=Annuller'
     A                                      COLOR(BLU)
     A          R ASUME
     A*%%TS  SD  19940527  075832  AMD         REL-V2R3M0  5738-PW1
     A                                      ASSUME
     A                                 24 79' '
