     A*%%TS  SD  20130605  141056  SST620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20130527  133231  SST620      REL-V7R1M0  5770-WDS
     A            B1VALG         1A  B 10  2COLOR(YLW)
     A                                      VALUES(' ' '2' '3' '4' '5' '7')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            B1LINJ    R        O 10  5REFFLD(AYLINJ)
     A                                      EDTWRD('  0')
     A            B1SUBS    R        O 10 10REFFLD(AYSUBS)
     A            B1BIBL    R        O 10 22REFFLD(AYBIBL)
     A            B1TEXT    R        O 10 34REFFLD(AYTEXT)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20130527  133231  SST620      REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0011)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA01
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&WCURRN)
     A            WCURRN         5S 0H
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 25'Vedlikehold av subsystemer        '
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Velg og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  6  3'1=Opprett  2=Endre  3=Kopiere  4=S-
     A                                      lette  5=Vise                '
     A                                      COLOR(BLU)
     A                                  8  2'V Linje Subsystem   Bibliotek   Be-
     A                                      skrivelse                       '
     A                                      COLOR(WHT)
     A            B2VALG         1A  B  9  2COLOR(YLW)
     A                                      VALUES(' ' '1' '2' '3' '4' '5')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            B2LINJ    R        B  9  5REFFLD(AYLINJ)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B2SUBS    R        B  9 10REFFLD(AYSUBS)
     A                                      COLOR(YLW)
     A            B2BIBL    R        B  9 22REFFLD(AYBIBL)
     A                                      COLOR(YLW)
     A          R B2CMD
     A*%%TS  SD  19980225  150730  HKO         REL-V3R7M0  5716-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20130605  141056  SST620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      CLRL(*ALL)
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 28'Opprette en subsystem linje '
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Linje. . . . . . . . . . . .'
     A            C1LINJ    R        B  5 31REFFLD(AYLINJ)
     A  31                                  ERRMSGID(AMY0010 *LIBL/QMFAGPL 31)
     A  35                                  ERRMSGID(AMC1100 *LIBL/QMFAGPL 35)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20130527  133231  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Linjer finnes fra før     '
     A                                  6  2'F3=Gå tilbake   F12=Annuler'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20130605  141056  SST620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 25'Vedlikehold av subsystem linjer   '
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            C2NYEN    R        O  4 69REFFLD(AÅNYEN)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A                                  5  2'Linje  . . . . . . . . . . .'
     A            C1LINJ    R        O  5 31REFFLD(AYLINJ)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Subsystem  . . . . . . . . .'
     A            C2SUBS    R        B  8 31REFFLD(AYSUBS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A  41                                  ERRMSGID(AMY0040 *LIBL/QMFAGPL 41)
     A                                  9  2'Bibliotek  . . . . . . . . .'
     A            C2BIBL    R        B  9 31REFFLD(AYBIBL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A  42                                  ERRMSGID(AMY0050 *LIBL/QMFAGPL 42)
     A                                 11  2'Beskrivelse  . . . . . . . .'
     A            C2TEXT    R        B 11 31REFFLD(AYTEXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A  43                                  ERRMSGID(AMY0060 *LIBL/QMFAGPL 43)
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A                                 23 46'Sist endret'
     A            C2EDAT         6Y 0O 23 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 68'/'
     A            C2EUSR    R        O 23 70REFFLD(AYEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R D1WIN
     A*%%TS  SD  20130527  133231  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(S1WIN)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette linje     '
     A                                      DSPATR(RI)
     A                                  4  2'Linje  . . . . . .'
     A            D1SUBS    R        O  5 21REFFLD(AYSUBS)
     A                                      DSPATR(UL)
     A                                  5  2'Subsystem  . . . .'
     A                                 13  2'F3=Gå tilbake   F12=Annuler'
     A                                      COLOR(BLU)
     A            D1LINJ    R        O  4 21REFFLD(AYLINJ)
     A                                      DSPATR(UL)
     A                                      EDTWRD('0   ')
     A          R K1WIN
     A*%%TS  SD  20130527  133231  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(S1WIN)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Subsystem  . . . .'
     A            K1SUBS    R        B  4 21REFFLD(AYSUBS)
     A  31                                  ERRMSGID(AMY0010 *LIBL/QMFAGPL 31)
     A  33                                  ERRMSGID(AMY0030 *LIBL/QMFAGPL 33)
     A  35                                  ERRMSGID(AMC1100 *LIBL/QMFAGPL 35)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Linje  . . . . . .'
     A            K1LINJ    R        B  5 21REFFLD(AYLINJ)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTWRD('0   ')
     A                                      OVRDTA
     A                                  7  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  9  2'Subsystem  . . . .'
     A            AYSUBS    R        B  9 21REFFLD(AYSUBS)
     A                                      DSPATR(UL)
     A                                 10  2'Linje  . . . . . .'
     A            AYLINJ    R        O 10 21REFFLD(AYLINJ)
     A                                      DSPATR(UL)
     A                                      EDTWRD('0   ')
     A                                 13  2'F3=Gå tilbake   F12=Annuler'
     A                                      COLOR(BLU)
     A          R S1WIN
     A*%%TS  SD  19931028  171434  AMD         REL-V2R2M0  5738-PW1
     A                                      WINDOW(*DFT 14 40)
