     A*%%TS  SD  20130828  120759  SST620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A          R M1WIN
     A*%%TS  SD  19950201  142709  AMD         REL-V2R3M0  5738-PW1
     A                                      CA12
     A                                      KEEP
     A                                      WINDOW(4 42 12 18)
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A            M1MLD1        16   O  4  2COLOR(WHT)
     A                                      TEXT('Meldingsfelt')
     A            M1MLD2        16   O  5  2COLOR(WHT)
     A                                      TEXT('Meldingsfelt')
     A            M1MLD3        16   O  6  2COLOR(WHT)
     A                                      TEXT('Meldingsfelt')
     A            M1MLD4        16   O  7  2COLOR(WHT)
     A                                      TEXT('Meldingsfelt')
     A            M1MLD5        16   O  8  2COLOR(WHT)
     A                                      TEXT('Meldingsfelt')
     A*         R ASUME                     ASSUME
     A*                                24 79' '
