     A*%%TS  SD  20140508  102518  RTRST620    REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A          R A1WIN
     A*%%TS  SD  20140130  150225  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(&W_ACLI &W_ACPO +
     A                                                  12 18)
     A            W_ACLI         2S 0P
     A            W_ACPO         3S 0P
     A                                  2  2' MELDING : '
     A                                      DSPATR(RI)
     A            P_M1          16   O  4  2
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            P_M2          16   O  5  2
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            P_M3          16   O  6  2
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            P_M4          16   O  7  2
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            P_M5          16   O  8  2
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A          R ASUME                     ASSUME
     A                                 24 79' '
