     A*%%TS  SD  20000315  135110  AMD         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20000315  135110  AMD         REL-V4R4M0  5769-PW1
     A            B1VALG    R        B 10  2REFFLD(AÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            B1PRID    R        O 10  4REFFLD(AEPRID)
     A            B1BESK    R        O 10 15REFFLD(AEBESK)
     A            B1TILK    R        O 10 50REFFLD(AETILK)
     A            B1STRT    R        O 10 55REFFLD(AESTRT)
     A            B1QMSG    R        O 10 60REFFLD(AEQMSG)
     A            B1OCRK    R        O 10 65REFFLD(AEOCRK)
     A            B1FORM    R        O 10 70REFFLD(AEFORM)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20000315  135110  AMD         REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A                                      ROLLUP(10)
     A                                      CA01
     A                                      CA03
     A                                      CA05
     A                                      CA09
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&WCURRN)
     A            WCURRN         5S 0H
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 28'Restart av skriver'
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Velg og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  6  2'1=Restarte skriver'
     A                                      COLOR(BLU)
     A                                  8  2'V'
     A                                      COLOR(WHT)
     A                                  8  4'Utkø/enhet'
     A                                      COLOR(WHT)
     A                                  8 15'Beskrivelse'
     A                                      COLOR(WHT)
     A                                  8 48'Til-'
     A                                      COLOR(WHT)
     A                                  8 53'Start'
     A                                      COLOR(WHT)
     A                                  8 59'Meld'
     A                                      COLOR(WHT)
     A                                  8 64'Ocr-'
     A                                      COLOR(WHT)
     A                                  8 70'Formular'
     A                                      COLOR(WHT)
     A            B2VALG    R        B  9  2REFFLD(AÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2 3 4 5)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            B2PRID    R        B  9  4REFFLD(AEPRID)
     A  31                                  ERRMSGID(AME0010 *LIBL/QMFAGPL 31)
     A  32                                  ERRMSGID(AME0020 *LIBL/QMFAGPL 32)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2BESK    R        B  9 15REFFLD(AEBESK)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                  9 48'Kobl'
     A                                      COLOR(WHT)
     A                                  9 53'autom'
     A                                      COLOR(WHT)
     A                                  9 59'alt.'
     A                                      COLOR(WHT)
     A                                  9 64'Kode'
     A                                      COLOR(WHT)
     A                                  9 70'type'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20000310  093843  AMD         REL-V4R4M0  5769-PW1
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20000315  135110  AMD         REL-V4R4M0  5769-PW1
     A                                      CA03
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 31'Vedlikehold av utkø/enhet'
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Utkø/enhet . . . . . . . . .'
     A            C1PRID    R        O  4 31REFFLD(AEPRID)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2NYEN    R        O  4 69REFFLD(AÅNYEN)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A                                  5  2'Beskrivelse. . . . . . . . .'
     A            C2BESK    R        B  5 31REFFLD(AEBESK)
     A  31                                  ERRMSGID(AME0010 *LIBL/QMFAGPL 31)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  6  2'Plassering . . . . . . . . .'
     A            C2PLAS    R        B  6 31REFFLD(AEPLAS)
     A  31                                  ERRMSGID(AME0010 *LIBL/QMFAGPL 31)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  8  2'Tilkobling . . . . . . . . .'
     A            C2TILK    R        B  8 31REFFLD(AETILK)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  8 34'0=Txinax'
     A                                  8 45'1=PC/Axis nettboks'
     A                                  9 45'2=NC/Std. nettboks'
     A                                 10  2'Starte automatisk ?. . . . .'
     A            C2STRT    R        B 10 31REFFLD(AESTRT)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 10 34'0=Nei'
     A                                 10 45'1=Ja'
     A                                 11  2'Meldings-alternativ. . . . .'
     A            C2QMSG    R        B 11 31REFFLD(AEQMSG)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 11 34'0=*NOMSG'
     A                                 11 45'1=*INQMSG'
     A                                 13  2'Formulartype . . . . . . . .'
     A            C2FORM    R        B 13 31REFFLD(AFFORM)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 13 45'Blank/*ALL eller formular'
     A                                 15  2'Ocr-skrift . . . . . . . . .'
     A            C2OCRK    R        B 15 31REFFLD(AFOCRK)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 15 34'0=Uten'
     A                                 15 45'1=Med Ocr'
     A                                 15 58'2=Axis boks(¤)'
     A                                 16 34'3=5224'
     A                                 16 45'4=Andre'
     A                                 18  2'Styrestreng 1. . . . . . . .'
     A            C2HEX1    R        B 18 31REFFLD(AFHEX1)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 18 58'<-Benyttes ved'
     A                                 19  2'Styrestreng 2. . . . . . . .'
     A            C2HEX2    R        B 19 31REFFLD(AFHEX2)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 19 58'<-kode 2 og 4'
     A                                 21  2'Sist endret dato . . . . . .'
     A            C2EDAT         6Y 0O 21 31EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 21 45'Endret av. .'
     A            C2EUSR    R        O 21 58REFFLD(AEEUSR)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 31'NB! Ved kode 4 må blanke fylles me-
     A                                      d nuller'
     A                                      COLOR(RED)
