     A*%%TS  SD  20060214  142317  AMD550      REL-V5R3M0  5722-WDS
     A*%%EC
7.xx A                                      DSPSIZ(24 80 *DS3 -
7.xx A                                             27 132 *WIDE)
7.xx A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20060214  142317  AMD550      REL-V5R3M0  5722-WDS
     A            B1VALG    R        B  7  2REFFLD(AÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 0)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A            B1USER    R        O  7  5REFFLD(ABUSER)
     A            B1NAVN    R        O  7 17REFFLD(ABNAVN)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20060214  142317  AMD550      REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Velge Bruker '
     A                                      DSPATR(RI)
     A                                  4  2'1=Velg'
     A                                      COLOR(BLU)
     A                                  5  2'V  Bruker      Navn       '
     A                                      COLOR(WHT)
     A            B2USER    R        B  6  5REFFLD(ABUSER)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2NAVN    R        B  6 17REFFLD(ABNAVN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  19951103  132646  HK          REL-V3R1M0  5763-PW1
     A                                      WINDOW(*DFT 17 47)
     A                                 16  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
