     A*%%TS  SD  20070124  103143  AMD540      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20070124  103143  AMD540      REL-V5R4M0  5722-WDS
     A                                      CF03
     A                                      CF04
     A                                      KEEP
     A                                      OVERLAY
     A                                      WINDOW(*DFT 6 40)
     A                                  2  1'Oppgi navn på skriver/utkø'
     A                                  3  1'Navn / *ALL / PRT* . . . . .'
     A            A1PRID    R        B  3 31REFFLD(AEPRID)
     A  31                                  ERRMSGID(FM01060 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                  5  1'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME
     A*%%TS  SD  19960809  142606  AMD         REL-V3R6M0  5716-PW1
     A                                      ASSUME
     A                                 24 79' '
