     A*%%TS  SD  20040128  124151  MHA         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20040128  124114  MHA         REL-V5R2M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(AÅVALG)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      VALUES(4 7 0)
     A            B1USER    R        O  8  4REFFLD(ADHUSR)
     A            B1DATO         6Y 0O  8 15EDTWRD('  .  .  ')
     A            B1TIME         6Y 0O  8 24EDTWRD('  :  :  ')
     A            B1STAT    R        O  8 33REFFLD(ADHSTA)
     A            B1KOM1    R   40   O  8 35REFFLD(ADHKOM)
     A            B1UIDN    R        H      REFFLD(ADHUID)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20040128  124151  MHA         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A  60                                  SFLMSGID(FMO0400 *LIBL/QMFOFAK 60)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'FTP'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'FTP logger'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'4=Slett  7=Se logg'
     A                                      COLOR(BLU)
     A                                  6  2'V Bruker     Dato     Kl.slett S K-
     A                                      ommentar'
     A                                      COLOR(WHT)
     A                                  4 28'FTP jobb. . . .'
     A            B2NAVN    R        O  4 44REFFLD(ADHNAV)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20040127  151342  MHA         REL-V5R2M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20040127  152143  MHA         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette FTP logg '
     A                                      DSPATR(RI)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  5  3'Navn . . . . .'
     A                                  6  3'UID. . . . . .'
     A            D1NAVN    R        O  5 18REFFLD(ADHNAV)
     A            D1UIDN    R        O  6 18REFFLD(ADHUID)
     A                                  8  3'Kommentar. . .'
     A                                 10  3'Bruker . . . .'
     A            D1KOM1    R   35   O  8 18REFFLD(ADHKOM)
     A            AHUSER    R        O 10 18REFFLD(ADHUSR)
