     A*%%TS  SD  20021122  130528  MHA         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A1WIN
     A*%%TS  SD  20021122  130528  MHA         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 28)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Skriv inn bruker/passord'
     A                                      DSPATR(RI)
     A                                  4  2'Passord . . .'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            A1PASS    R        B  4 16REFFLD(AFPASS)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                      DSPATR(ND)
     A            A1USER    R        B  3 16REFFLD(AFUSER)
     A  30                                  DSPATR(PR)
     A                                  3  2'Bruker. . . .'
     A          R S1WIN
     A*%%TS  SD  19931028  171434  AMD         REL-V2R2M0  5738-PW1
     A                                      WINDOW(*DFT 16 50)
