     A*%%TS  SD  20110303  124719  TEW610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20110303  124719  TEW610      REL-V5R4M0  5722-WDS
     A                                      CA03(03)
     A                                      CA12(12)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Driftssystemet   '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Generering av database    '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            VA01           1A  B  5  2VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  5  4'FSYNSQ synkroniserings tbl '
     A            VA02           1A  B  6  2VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  6  4'XPSLSQ Endrede rader'
     A            VA03           1A  B  7  2VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  7  4'XPBOSQ Boservere'
     A            VA04           1A  B  8  2VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  8  4'XPRLSQ Repl log '
     A            VA05           1A  B  9  2VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  9  4'XPRRSQ Sist repl  '
     A            FGRP           3A  B 20 22CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      COLOR(YLW)
     A                                 20 46'Velg tabeller som skal generers'
     A                                      COLOR(BLU)
     A                                 21  2'Tøm tabell. . . . .'
     A            NULL           1A  B 21 22VALUES(' ' '0' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 21 25'1=Ja,0=Nei'
     A                                 21 46'ved å sette 1 foran tabellen'
     A                                      COLOR(BLU)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
