     A*%%TS  SD  20040910  153806  AMD         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20040910  153806  AMD         REL-V5R2M0  5722-WDS
     A                                      CA03(03)
     A                                      CA12(12)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'System administr.'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppretting av database Axx'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  3'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  7 33'V'
     A                                      COLOR(WHT)
     A                                  7 36'Filnavn'
     A                                      COLOR(WHT)
     A                                  7 44'Beskrivelse      '
     A                                      COLOR(WHT)
     A            A1VUSR         1A  B  8 33VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 36'AUSRPF'
     A                                  8 44'Bruker-register  '
     A            A1VLIB         1A  B  9 33VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  9 36'ALIBPF'
     A                                  9 44'Biblioteks-lister'
     A            A1VFIL         1A  B 10 33VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 10 36'AFILPF'
     A                                 10 44'Filegrupper      '
     A            A1VENH         1A  B 11 33VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 11 36'AENHPF'
     A                                 11 44'Enheter          '
     A            A1VMOD         1A  B 12 33VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 12 36'AMODPF'
     A                                 12 44'Moduler          '
     A                                 19 14'Oppgi Miljø (A01 A02 osv.)'
     A            A1MILJ         3A  B 19 44COLOR(YLW)
     A                                 21 14'Skal register(e) nullstilles:'
     A            A1NULL         1A  B 21 44VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 21 47'(S=Slette innhold i register)'
     A                                 23  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 21'F12=Annuller'
     A                                      COLOR(BLU)
