     A*%%TS  SD  20110112  143922  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20110112  143922  BOF610      REL-V5R4M0  5722-WDS
     A                                      CA03(03)
     A                                      CA12(12)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'System administr.'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppretting av database ADB'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  3'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  7  3'V'
     A                                      COLOR(WHT)
     A                                  7  6'Filnavn'
     A                                      COLOR(WHT)
     A                                  7 14'Beskrivelse      '
     A                                      COLOR(WHT)
     A                                  7 44'V'
     A                                      COLOR(WHT)
     A                                  7 47'Filnavn'
     A                                      COLOR(WHT)
     A                                  7 55'Beskrivelse'
     A                                      COLOR(WHT)
     A            A1VSYS         1A  B  8  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  8  6'ASYSPF'
     A                                  8 14'Systemer (brukerbiblioteker)'
     A            A1VCPH         1A  B  8 44VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 47'ACPHPF'
     A                                  8 55'Filkopierings-hode-reg.'
     A            A1VVER         1A  B  9  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  9  6'AVERPF'
     A                                  9 14'Verdier  (satt i nattrutine)'
     A            A1VCPL         1A  B  9 44VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 47'ACPLPF'
     A                                  9 55'Filkopierings-linje-reg.'
     A            A1VMIL         1A  B 10  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 10  6'AMILPF'
     A                                 10 14'Miljø    (A01 A02 osv.)'
     A            A1VPOS         1A  B 11  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 11  6'APOSPF'
     A                                 11 14'Poststeder       '
     A            A1VNBH         1A  B 11 44VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 47'ANBHPF'
     A                                 11 55'Nettbutikk eier         '
     A            A1VHST         1A  B 12  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 12  6'AHSTPF'
     A                                 12 14'Historikk fra nattjobben    '
     A            A1VNBL         1A  B 12 44VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12 47'ANBLPF'
     A                                 13 14'XML Overføring Kunder       '
     A            A1VXML         1A  B 13  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13  6'AXMLPF'
     A            A1VKTI         1A  B 13 44VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13 47'AKTIST'
     A                                 13 55'NX tilpassninger'
     A                                 14 14'NOBB XML Logg'
     A            A1VLXM         1A  B 14  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14  6'ALXLST'
     A            A1VLGN         1A  B 14 44VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14 47'SLGNST'
     A                                 14 55'Info for SLOGPF'
     A                                 12 55'Nettbutikk              '
     A                                 21 14'Skal register(e) nullstilles:'
     A            A1NULL         1A  B 21 44VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 21 47'(S=Slette innhold i register)'
     A                                 23  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 21'F12=Annuller'
     A                                      COLOR(BLU)
