     A*%%TS  SD  20230320  143858  SST_800     REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      CA03(03 'F3=Avbryt')
     A          R M1WIN
     A*%%TS  SD  20230320  143858  SST_800     REL-V7R3M0  5770-WDS
     A                                      WINDOW(&W_ACLI &W_ACPO 10 54)
     A                                      KEEP
     A            W_ACLI         2S 0P
     A            W_ACPO         3S 0P
     A                                  2  2'        Generere 1-10 filer i fra--
     A                                      til filgruppe   '
     A                                      DSPATR(RI)
     A                                  4  2'Fra filgruppe . . :'
     A            FRA            3A  B  4 23COLOR(YLW)
     A  31                                  DSPATR(PC)
     A                                  5  2'Til filgruppe . . :'
     A            TIL            3A  B  5 23COLOR(YLW)
     A  32                                  DSPATR(PC)
     A                                  7  2'Filnavn 1 - 10. . :'
     A            F1             6A  B  7 23COLOR(YLW)
     A  33                                  DSPATR(PC)
     A                                      CHECK(FE)
     A            M1MLD2    R        O  9  2REFFLD(AÅMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            F2             6A  B  7 30COLOR(YLW)
     A  34                                  DSPATR(PC)
     A                                      CHECK(FE)
     A            F3             6A  B  7 37COLOR(YLW)
     A  35                                  DSPATR(PC)
     A                                      CHECK(FE)
     A            F4             6A  B  7 44COLOR(YLW)
     A  36                                  DSPATR(PC)
     A                                      CHECK(FE)
     A            F5             6A  B  8  9COLOR(YLW)
     A  37                                  DSPATR(PC)
     A                                      CHECK(FE)
     A            F6             6A  B  8 16COLOR(YLW)
     A  38                                  DSPATR(PC)
     A                                      CHECK(FE)
     A            F7             6A  B  8 23COLOR(YLW)
     A  39                                  DSPATR(PC)
     A                                      CHECK(FE)
     A            F8             6A  B  8 30COLOR(YLW)
     A  40                                  DSPATR(PC)
     A                                      CHECK(FE)
     A            F9             6A  B  8 37COLOR(YLW)
     A  41                                  DSPATR(PC)
     A                                      CHECK(FE)
     A            F10            6A  B  8 44COLOR(YLW)
     A  42                                  DSPATR(PC)
     A                                      CHECK(FE)
     A                                  6  2'Versjon . . . . . :'
     A            V              3A  B  6 23COLOR(YLW)
     A  43                                  DSPATR(PC)
     A                                      CHECK(FE)
     A                                  4 28'Kaste ut aktive brukere'
     A                                  5 28'og jobber først:'
     A            AKT            1A  B  5 45COLOR(YLW)
     A  44                                  DSPATR(PC)
     A                                      CHECK(FE)
     A                                  5 48'(J)'
     A          R ASUME                     ASSUME
     A                                 24 79' '
