     A*%%TS  SD  20220829  145354  SST_800     REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20220829  145354  SST_800     REL-V7R3M0  5770-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'System - admin'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Rutine - styringer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5 18'Velg alternativ'
     A                                      COLOR(BLU)
     A                                  7 27'1. Vedlikehold av rutine-register -
     A                                          '
     A                                  8 27'2. Vedlikehold av printer-styring -
     A                                          '
     A                                  9 27'3. Vedlikehold av nummer-serier   -
     A                                          '
     A                                 10 27'4. Vedlikehold av enhets-register'
     A                                 12 27'5. Vedlikehold av file-kopierings--
     A                                      register'
     A                                 14 27'7. Vedlikehold av avtale-register -
     A                                              '
     A                                 15 27'8. Vedlikehold av Sikkerhets-grupp-
     A                                      e       '
     A                                 16 27'9. Vedlikehold av PROA oppsett '
     A                                 18 26'90. Gå ut av systemet           '
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 20'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 38'F6=Se på meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
     A                                 13 27'6. Vedlikehold av adgangskontroll'
