     A*%%TS  SD  20041110  105900  ASP         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA04(04 'F4=Forespørsel')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20041110  105900  ASP         REL-V5R2M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'System - admin'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Installasjons - jobb'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  2'Installasjons-jobben benyttes ved -
     A                                      installasjon av nye AS400'
     A                                      COLOR(BLU)
     A                                  6  8'- Setter opp standard systemverdie-
     A                                      r                  '
     A                                      COLOR(BLU)
     A                                  7  8'- Bygger opp nødvendige biblioteke-
     A                                      r                  '
     A                                      COLOR(BLU)
     A                                  8  8'- Bygger opp nødvendige source-fil-
     A                                      er                 '
     A                                      COLOR(BLU)
     A                                  9  8'- Bygger opp nødvendige database-f-
     A                                      iler               '
     A                                      COLOR(BLU)
     A                                 11  2'Trykk F10 for kommando-linje, skri-
     A                                      v inn kommando (AINSTALL) + F4'
     A                                      COLOR(BLU)
     A                                 16 17'Kommando for installasjons-jobb. .-
     A                                       AINSTALL'
     A                                 18 26'90. Gå ut av systemet'
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 20'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 38'F6=Se på meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
