     A*%%TS  SD  20041110  110003  ASP         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20041110  110003  ASP         REL-V5R2M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'System - admin'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Natt - rutiner'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5 18'Velg alternativ'
     A                                      COLOR(BLU)
     A                                  7 27'1. Sette opp verdier for nattrutin-
     A                                      en'
     A                                  8 27'2. Sette opp verdier for ny IPL av-
     A                                       maskinen'
     A                                  9 27'3. Klargjøre tape for backup'
     A                                 11 27'4. Spørre på natt-jobb-historikken'
     A                                 12 27'5. Vise nattjobber i jobbkø.'
     A                                 13 27'6. Fjerne eventuelle nattjobber fr-
     A                                      a jobbkø'
     A                                 15 27'7. Starte en manuell backup'
     A                                 16 27'8. Arbeide med jobb-plan       '
     A                                 17 27'9. Starte subsystem for nattjobben-
     A                                            '
     A                                 19 30'Valg:'
     A            VALG           2Y 0B 19 39EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 20'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 38'F6=Se på meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
