     A*%%TS  SD  20040128  084718  MHA         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASPGPL
     A* Format. . . . . : SNDMAIL
     A* Beskrivelse . . : SENDE E-POST
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       211003 MHA  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      CA03(03 'F3=GÅ TILBAKE')
     A          R C2BLD
     A*%%TS  SD  20031021  103958  MHA         REL-V5R2M0  5722-WDS
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      PUTOVR
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'ASPGPL'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Sende E-post'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                 12  2'Melding. . .:'
     A            C2MLD1        78A  B 13  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD2        78A  B 14  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD3        78A  B 15  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD4        78A  B 16  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD5        78A  B 17  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD6        78A  B 18  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD7        78A  B 19  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD8        78A  B 20  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD9        78A  B 21  2COLOR(YLW)
     A                                      CHECK(LC)
     A                                  4  2'Til. . . . .:'
     A            C2USR1        63A  B  4 17COLOR(YLW)
     A                                      CHECK(LC)
     A            C2USR2        63A  B  5 17COLOR(YLW)
     A                                      CHECK(LC)
     A            C2USR3        63A  B  6 17COLOR(YLW)
     A                                      CHECK(LC)
     A                                 23  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                  9  2'Emne . . . .:'
     A            C2SUBJ        63A  B  9 17COLOR(YLW)
     A                                      CHECK(LC)
     A          R C2MSG
     A*%%TS  SD  20040128  084718  MHA         REL-V5R2M0  5722-WDS
     A                                      WINDOW(&W_ALIN &W_ACOL 8 55)
     A                                      CF12
     A                                      PUTOVR
     A                                      HELP
     A            W_ALIN         2S 0P
     A            W_ACOL         3S 0P
     A            C2ERR1        50A  O  4  3
     A            C2ERR2        50A  O  5  3
     A                                  7  2'F3=Avbryt'
     A                                      COLOR(BLU)
     A                                  2  3' Melding '
     A                                      DSPATR(RI)
