     A*%%TS  SD  20031021  100248  MHA         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASPGPL
     A* Format. . . . . : SNDMSG2
     A* Beskrivelse . . : SENDE MELDING
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       211003 MHA  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      CA03(03 'F3=GÅ TILBAKE')
     A          R C2BLD
     A*%%TS  SD  20031021  100248  MHA         REL-V5R2M0  5722-WDS
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      PUTOVR
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'ASPGPL'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Sende melding'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Melding. . .:'
     A            C2MLD1        74A  B  6  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD2        72A  B  7  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD3        72A  B  8  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD4        72A  B  9  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD5        72A  B 10  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD6        72A  B 11  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD7        72A  B 12  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD8        72A  B 13  2COLOR(YLW)
     A                                      CHECK(LC)
     A            C2MLD9        72A  B 14  2COLOR(YLW)
     A                                      CHECK(LC)
     A                                 17  2'Til. . . . .:'
     A            C2USR1        10A  B 17 17COLOR(YLW)
     A            C2USR2        10A  B 18 17COLOR(YLW)
     A            C2USR3        10A  B 19 17COLOR(YLW)
     A            C2USR4        10A  B 20 17COLOR(YLW)
     A            C2USR5        10A  B 21 17COLOR(YLW)
     A                                 23  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                 17 29'*ALLACT'
