     A*%%TS  SD  20120216  140236  AMD620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20120216  140236  AMD620      REL-V7R1M0  5770-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'System - admin'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppretting av database   '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5 18'Velg alternativ'
     A                                      COLOR(BLU)
     A                                  7 27'1. Oppdatere tabeller i ADB '
     A                                  8 27'2. Oppdatere tabeller i ADBxxx '
     A                                  9 27'3. Oppdatere tabeller i Axx    '
     A                                 10 27'4. Oppdatere SQL-tabeller      '
     A                                 11 27'5. Oppdatere 2dPoint tabeller  '
     A                                 12 27'6. Oppdatere RA tabeller i Axx '
     A                                 18 26'90. Gå ut av systemet           '
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 20'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 38'F6=Se på meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
