     A*%%TS  SD  20121127  153319  AMD610      REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASPGPL
     A* Format. . . . . : AN017D
     A* Beskrivelse . . : Nattrutine, Innlegging av parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       xxxxxx AMD  Nytt program
6.11 A*  6.10 261112 AMD  Nytt valg for backup til savefile u/tape
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      CF03
     A                                      CF12
     A          R A1WIN
     A*%%TS  SD  19971027  122014  AMD         REL-V3R7M0  5716-PW1
     A                                      WINDOW(&WACTLI &WACTPO 11 53)
     A                                      PUTOVR
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A                                  2  2'Velg hvilken nattjobb som skal ved-
     A                                      likeholdes :'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4  7'1. Nattjobb for tirsdag til lørdag-
     A                                      .'
     A                                  5  7'2. Nattjobb for søndag.'
     A                                  6  7'3. Nattjobb for mandag.'
     A                                  6 37'                '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                  7 37' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                  7 39'Alle  jobber'
     A                                  7 52' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A            A1VALG    R     Y  B  8  7REFFLD(AÅVALA)
     A                                      VALUES(1 2 3)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHKMSGID(AM00030 *LIBL/QMFAGPL)
     A                                  8 10'Velg (1 2 eller 3)'
     A                                  8 37' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                  8 39'går natt til'
     A                                  8 52' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                  9 37' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                  9 39'oppgitt  dag'
     A                                  9 52' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 10 37'                '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A          R B1BLD
     A*%%TS  SD  20121127  153319  AMD610      REL-V7R1M0  5770-WDS
     A                                      CA04
     A                                      CA06
     A                                      KEEP
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 29'Opplegging av natt-rutine'
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  2'Klokkeslett for start. . . . . .'
     A            B1TTMM    R     Y  B  5 35REFFLD(AVTTMM)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      RANGE(1 2359)
     A                                      CHKMSGID(AM00020 *LIBL/QMFAGPL)
     A                                  5 40'ttmm'
     A                                  5 48'(Anbefalt: 0030)'
     A            B1NATT         6A  O  5 73TEXT('Nattjobb')
     A                                      DSPATR(RI)
     A                                  6  2'Reorganiser alle filer . . . . .'
     A            B1RORG    R     Y  B  6 35REFFLD(AVRORG)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHKMSGID(AM00030 *LIBL/QMFAGPL)
     A                                  6 40'1=Ja'
     A                                  8  2'Start standard backup  . . . . .'
     A            B1BACK    R     Y  B  8 35REFFLD(AVBACK)
     A                                      VALUES(0 1 2)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHKMSGID(AMV0100 *LIBL/QMFAGPL)
     A                                  8 40'1=Ja'
     A                                  8 49'2=Alle brukerbibliotek'
     A                                  9  2'Backup av alle mapper. . . . . .'
     A            B1SMAP    R     Y  B  9 35REFFLD(AVSMAP)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHKMSGID(AM00030 *LIBL/QMFAGPL)
     A                                  9 40'1=Ja'
     A                                 10  2'Backup via savefile. . . . . . .'
     A            B1SAVF    R     Y  B 10 35REFFLD(AVSAVF)
     A                                      VALUES(0 1 2)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHKMSGID(AM00090 *LIBL/QMFAGPL)
     A  31                                  ERRMSGID(AMV0110 *LIBL/QMFAGPL 31)
     A  34                                  ERRMSGID(AMV0140 *LIBL/QMFAGPL 34)
     A                                 10 40'1=Ja'
     A                                 11  2'Ved backup, oppgi tetthet'
     A                                 11 48'(Anbefalt: *CTGTYPE)'
     A                                 12  4'på magnetbåndet. . . . . . . .'
     A            B1DENS    R     A  B 12 35REFFLD(AVDENS)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(AM00040 *LIBL/QMFAGPL)
     A                                      VALUES('*DEVTYPE' '*CTGTYPE' '*QIC1-
     A                                      20 ' '*QIC525 ' '*QIC1000' '*QIC2GB-
     A                                       ' '*QIC3040' '*QIC5010' '*FMT3480'-
     A                                       '*FMT3570' '*FMT3590' '*FMT2GB ' '-
     A                                      *FMT5GB ' '10000   ' '16000   ' '38-
     A                                      000   ')
     A                                 12 49'F4=Vis gyldig tetthet'
     A                                 14 51'                            '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 15 51' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 15 78' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 16  2'Ta ned SUB-systemer. . . . . . .'
     A            B1SSBS    R     Y  B 16 35REFFLD(AVSSBS)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHKMSGID(AM00030 *LIBL/QMFAGPL)
     A                                 16 40'1=Ja'
     A                                 16 51' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 16 54'Dato for siste endring'
     A                                      COLOR(WHT)
     A                                 16 78' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 17  2'Kjøre ekstrajobber . . . . . . .'
     A            B1PRC1    R     Y  B 17 35REFFLD(AVPRC1)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHKMSGID(AM00030 *LIBL/QMFAGPL)
     A  32                                  ERRMSGID(AMV0120 *LIBL/QMFAGPL 32)
     A  33                                  ERRMSGID(AMV0130 *LIBL/QMFAGPL 33)
     A                                 17 40'1=Ja'
     A                                 17 45'(F4)'
     A                                 17 51' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 17 58'av nattrutinen'
     A                                      COLOR(WHT)
     A                                 17 78' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 18  2'Kjøre ekstrajobber              '
     A                                 18 51' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 18 78' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 19  4'fra andre programbibliotek . .'
     A            B1PRC2    R     Y  B 19 35REFFLD(AVPRC2)
     A                                      VALUES(0 1 2)
     A                                      EDTCDE(Z)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 19 40'1=Ja'
     A                                 19 45'(F4)'
     A                                 19 51' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A            B1DATO    R        O 19 61REFFLD(AVDATO)
     A                                      EDTCDE(Y)
     A                                 19 78' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 20  2'Kjøre egendefinert startjobb . .'
     A            B1STRT    R     Y  B 20 35REFFLD(AVSTRT)
     A                                      VALUES(0 1 2)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                 20 40'1=Ja'
     A                                 20 51' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 20 78' '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 21  2'Kjøre egendefinert sluttjobb . .'
     A            B1SLUT    R     Y  B 21 35REFFLD(AVSLUT)
     A                                      VALUES(0 1 2)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                 21 40'1=Ja'
     A                                 21 51'                            '
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 19'F4=Spørring/vise'
     A                                      COLOR(BLU)
     A                                 23 39'F6=Sub-systemer som startes ved IP-
     A                                      L'
     A                                      COLOR(BLU)
     A                                 10 49'2=Ja, men ikke ut på tape'
     A          R C1WIN
     A*%%TS  SD  19951228  210248  AMD         REL-V3R1M0  5763-PW1
     A                                      WINDOW(&WACTLI &WACTPO 8 53)
     A                                      PUTOVR
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A                                  2  2'Prosedyre'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  2 13'Bibliotek'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  2 26'36 eller AS'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  2 40'36 = System36'
     A                                      COLOR(WHT)
     A                                  3 40'AS = AS/400'
     A                                      COLOR(WHT)
     A            C1PRO1         8A  B  4  2COLOR(YLW)
     A            C1BIB1        10A  B  4 13COLOR(YLW)
     A            C1SYS1         2A  B  4 31COLOR(YLW)
     A            C1PRO2         8A  B  5  2COLOR(YLW)
     A            C1BIB2        10A  B  5 13COLOR(YLW)
     A            C1SYS2         2A  B  5 31COLOR(YLW)
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R E1WIN
     A*%%TS  SD  19960102  205104  AMD         REL-V3R1M0  5763-PW1
     A                                      WINDOW(&WACTLI &WACTPO 18 28)
     A                                      PUTOVR
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A                                  2  3'Oppgi hvilke subsystemer'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  3  3'som skal startes ved IPL'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  5  6'Subsystem '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 17'Bibliotek '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  6  3'1.'
     A            E1SBS1        10A  B  6  6COLOR(YLW)
     A            E1LIB1        10A  B  6 17COLOR(YLW)
     A                                  7  3'2.'
     A            E1SBS2        10A  B  7  6COLOR(YLW)
     A            E1LIB2        10A  B  7 17COLOR(YLW)
     A                                  8  3'3.'
     A            E1SBS3        10A  B  8  6COLOR(YLW)
     A            E1LIB3        10A  B  8 17COLOR(YLW)
     A                                  9  3'4.'
     A            E1SBS4        10A  B  9  6COLOR(YLW)
     A            E1LIB4        10A  B  9 17COLOR(YLW)
     A                                 10  3'5.'
     A            E1SBS5        10A  B 10  6COLOR(YLW)
     A            E1LIB5        10A  B 10 17COLOR(YLW)
     A                                 11  3'6.'
     A            E1SBS6        10A  B 11  6COLOR(YLW)
     A            E1LIB6        10A  B 11 17COLOR(YLW)
     A                                 12  3'7.'
     A            E1SBS7        10A  B 12  6COLOR(YLW)
     A            E1LIB7        10A  B 12 17COLOR(YLW)
     A                                 13  3'8.'
     A            E1SBS8        10A  B 13  6COLOR(YLW)
     A            E1LIB8        10A  B 13 17COLOR(YLW)
     A                                 14  3'9.'
     A            E1SBS9        10A  B 14  6COLOR(YLW)
     A            E1LIB9        10A  B 14 17COLOR(YLW)
     A                                 15  2'10.'
     A            E1SBS0        10A  B 15  6COLOR(YLW)
     A            E1LIB0        10A  B 15 17COLOR(YLW)
     A                                 17  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R F1WIN
     A*%%TS  SD  19960102  220825  AMD         REL-V3R1M0  5763-PW1
     A                                      WINDOW(&WACTLI &WACTPO 8 40)
     A                                      PUTOVR
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A                                  2  2' Avslutte vedlikehold av nattrutin-
     A                                      e '
     A                                      DSPATR(RI)
     A                                  4  2'Skal programmet for'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  5  2'nattjobb genereres nå ?'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            B1GENP    R     Y  B  5 30REFFLD(AVGENP)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHKMSGID(AM00030 *LIBL/QMFAGPL)
     A                                  5 34'1=ja'
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R G1WIN
     A*%%TS  SD  19971016  103344  AMD         REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      WINDOW(&WACTLI &WACTPO 16 28)
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A                                  2  3'Gyldige verdier'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  3  3'for magnetbånd-tetthet  '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  5  3'Verdi     '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 17'Verdi     '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  6  3'*DEVTYPE'
     A                                  6 17'*FMT3480'
     A                                  7  3'*CTGTYPE'
     A                                  7 17'*FMT3570'
     A                                  8  3'*QIC120'
     A                                  8 17'*FMT3590'
     A                                  9  3'*QIC525'
     A                                  9 17'*FMT2GB'
     A                                 10  3'*QIC1000'
     A                                 10 17'*FMT5GB'
     A                                 11  3'*QIC2GB'
     A                                 11 18'10000'
     A                                 12  3'*QIC3040'
     A                                 12 18'16000'
     A                                 13  3'*QIC5010'
     A                                 13 18'38000'
     A                                 15  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME
     A*%%TS  SD  19951228  173736  AMD         REL-V3R1M0  5763-PW1
     A                                      ASSUME
     A                                 24 79' '
