     A*%%TS  SD  19940906  142416  KR          REL-V2R3M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF12
     A          R B1BLD
     A*%%TS  SD  19940906  142416  KR          REL-V2R3M0  5738-PW1
     A                                      KEEP
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 26'Legger inn ny oppstart av maskinen'
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  8  2'Klokkeslett for start. . . . .'
     A            B1TTMM         4Y 0B  8 35EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(AM00050 *LIBL/QMFAGPL)
     A                                      RANGE(0200 0600)
     A                                  8 44'ttmm'
     A                                 10  2'Ukedag for oppstart  . . . . .'
     A            B1UDAG         4A  B 10 35COLOR(YLW)
     A                                      CHKMSGID(AM00060 *LIBL/QMFAGPL)
     A                                      VALUES('*MON' '*TUE' '*WED' '*THU' -
     A                                      '*FRI' '*SAT' '*SUN')
     A                                 10 44'*MON,*TUE,*WED,*THU,*FRI'
     A                                 11 44'*SAT,*SUN'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 19'F12=Annuler'
     A                                      COLOR(BLU)
     A                                  8 53'(02.00 - 06.00)'
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
