     A*%%TS  SD  20001011  165335  AMD         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A          R M1WIN
     A*%%TS  SD  20001011  165335  AMD         REL-V4R4M0  5769-PW1
     A                                      WINDOW(&WACTLI &WACTPO 12 54)
     A                                      CA03
     A                                      CA12
     A                                      KEEP
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A                                  2  2' Klargjøring av tape for nattjobb -
     A                                      eller systembackup '
     A                                      DSPATR(UL)
     A                                  5  3'Magnetbåndet kan nå klargjøres for-
     A                                       bruk i'
     A                                      COLOR(WHT)
     A                                  6  3'enten nattjobben, eller til full s-
     A                                      ystembackup.'
     A                                      COLOR(WHT)
     A                                  8  3'Oppgi valg :'
     A            M1SVAR    R        B  8 17REFFLD(AÅSVAR)
     A                                      VALUES('1' '2')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  8 21'1 = Nattjobb     (ASBACK)'
     A                                  9 21'2 = Systembackup (SAVSYS)'
     A                                 11  2'F12=Annuller'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
