     A*%%TS  SD  19990224  123843  AMD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1WIN
     A*%%TS  SD  19990224  123843  AMD         REL-V3R7M0  5716-PW1
     A                                      WINDOW(S1WIN)
     A                                      TEXT('Vinduversjon')
     A                                      CA03
     A                                      CA04
     A                                      CA05
     A                                      CF10
     A                                      CA12
     A                                      KEEP
     A                                  2  2'Valg ved utskrift'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  3  2'Rutinenavn . . . . . .:'
     A            A1RUTI    R        O  3 26REFFLD(AFRUTI AFRF)
     A                                      DSPATR(UL)
     A                                  4  2'Utkø/skriver . . . . .:'
     A            A1OUTQ    R     A  B  4 26REFFLD(AFOUTQ AFRF)
     A                                      COLOR(YLW)
     A  33                                  ERRMSGID(AM00100 *LIBL/QMFAGPL 33)
     A                                  5  2'Papirtype. . . . . . .:'
     A            A1FORM    R     A  B  5 26REFFLD(AFFORM AFRF)
     A                                      COLOR(YLW)
     A                                  6  2'Tegn pr. tomme (CPI) .:'
     A            A1ACPI    R        B  6 26REFFLD(AFACPI AFRF)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  7  2'Antall kopier. . . . .:'
     A            A1AKOP    R        B  7 26REFFLD(AFAKOP AFRF)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  8  2'Holde i kø . . . . . .:'
     A            A1STSQ    R        B  8 26REFFLD(AFHLDQ AFRF)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RML0440 *LIBL/QMFOKON)
     A                                  8 30'(1/0=Ja/Nei)'
     A                                  9  2'Prioritet. . . . . . .:'
     A            A1PRTY    R        B  9 26REFFLD(AFPRTY *LIBL/AFRF)
     A                                      TEXT('Prioritet')
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1' '2' '3' '4' '5' '6' -
     A                                      '7' '8' '9')
     A                                      CHKMSGID(RML0450 *LIBL/QMFOKON)
     A                                  9 30'(0 til 9)'
     A                                 10  2'Linjer pr. side. . . .:'
     A            A1ALIN    R        B 10 26REFFLD(AFALIN AFRF)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  ERRMSGID(AM00080 *LIBL/QMFAGPL 30)
     A  31                                  ERRMSGID(AM00070 *LIBL/QMFAGPL 31)
     A                                 10 30'(5 til 96)'
     A                                 11  2'Posisjoner pr. linje .:'
     A            A1APOS    R        B 11 26REFFLD(AFALIN AFRF)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  ERRMSGID(AM00080 *LIBL/QMFAGPL 30)
     A  31                                  ERRMSGID(AM00070 *LIBL/QMFAGPL 31)
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 13 26'F5=Forny'
     A                                      COLOR(BLU)
     A                                 14  2'F4=Spørre'
     A                                      COLOR(BLU)
     A                                 14 26'F10=Kjøre i batch'
     A                                      COLOR(BLU)
     A          R S1WIN
     A*%%TS  SD  19950112  083340  RH          REL-V2R3M0  5738-PW1
     A                                      TEXT('Ramme')
     A                                      KEEP
     A                                      WINDOW(&WACTLI &WACTPO 15 44)
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A          R ASUME
     A*%%TS  SD  19941222  135431  RH          REL-V2R3M0  5738-PW1
     A                                      KEEP
     A                                      ASSUME
     A                                 24 79' '
