     A*%%TS  SD  20100722  100558  BSA         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASPROA
     A* Format. . . . . : AP623D
     A* Beskrivelse . . : Hente fra arkiv
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       220710 BSA  Nytt program
     A* 7.xx  130418 BKV  Justeringer basert på ny GUI og regler
Q.01 A*       080219 bsa  Quick wins tilpasninger - breder skjerm
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
Q.01 A                                      DSPSIZ(24 80 *DS3 -
Q.01 A                                             27 132 *WIDE)
     A                                      PRINT
     A          R A1WIN
     A*%%TS  SD  20040827  125318  AMD         REL-V5R2M0  5722-WDS
7.xx A*                                     WINDOW(S1WIN)
     A                                      TEXT('Vinduversjon')
     A                                      CA03
     A                                      CA12
     A                                      KEEP
     A                                  2  2'Bekreft PDF for skjermvisning'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            A1PKEY        41A  O  4  2
     A                                      COLOR(YLW)
     A            A1PATH        50A  O  5  2
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R S1WIN
     A*%%TS  SD  19950112  083340  RH          REL-V2R3M0  5738-PW1
     A                                      TEXT('Ramme')
     A                                      KEEP
     A                                      WINDOW(&W_ALIN &W_APOS 8 52)
     A            W_ALIN         2S 0P
     A            W_APOS         3S 0P
     A          R ASUME
     A*%%TS  SD  19941222  135431  RH          REL-V2R3M0  5738-PW1
     A                                      KEEP
     A                                      ASSUME
     A                                 24 79' '
