     A*%%TS  SD  20100722  100558  BSA         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASPROA
     A* Format. . . . . : AP628D
     A* Beskrivelse . . : Vise link i et vindu - Jacada
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       020112 BSA  Nytt program
     A* 7.xx  130418 BKV   Justeringer basert på ny GUI og regler
Q.01 A*       080219 bsa  Quick wins tilpasninger - breder skjerm
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
Q.01 A                                      DSPSIZ(24 80 *DS3 -
Q.01 A                                             27 132 *WIDE)
     A                                      PRINT
     A          R A1WIN
     A*%%TS  SD  20040827  125318  AMD         REL-V5R2M0  5722-WDS
7.xx A*                                     WINDOW(S1WIN)
     A                                      TEXT('Vinduversjon')
     A                                      CA03
     A                                      CA12
     A                                      KEEP
     A                                  2  2'Bekreft link for skjermvisning'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            A1LNK1        50A  O  4  2
     A                                      COLOR(YLW)
     A            A1LNK2        50A  O  5  2
     A                                      COLOR(YLW)
     A            A1LNK3        50A  O  6  2
     A                                      COLOR(YLW)
     A                                  7  2'F3=Gå tilbake'
     A                                  7 18'Enter=OK'
     A                                      COLOR(BLU)
7.xx A*          R S1WIN
7.xx A**%%TS  SD  19950112  083340  RH          REL-V2R3M0  5738-PW1
7.xx A*                                      TEXT('Ramme')
7.xx A*                                      KEEP
7.xx A*                                      WINDOW(&W_ALIN &W_APOS 8 52)
7.xx A*            W_ALIN         2S 0P
7.xx A*            W_APOS         3S 0P
     A          R ASUME
     A*%%TS  SD  19941222  135431  RH          REL-V2R3M0  5738-PW1
     A                                      KEEP
     A                                      ASSUME
     A                                 24 79' '
