     A*%%TS  SD  20061009  141314  KRKRI       REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '        '))
     A*
     A          R B1WSF                     SFL
     A*%%TS  SD  20061009  141314  KRKRI       REL-V5R3M0  5722-WDS
     A            B1VALG    R        B  5  1REFFLD(AÅSVAR)
     A                                      COLOR(YLW)
     A                                      VALUES('1' '2' '3' ' ')
     A                                      CHKMSGID(FRK0003 *LIBL/QMFOFAK)
     A            B1USER    R        O  5  4REFFLD(ABUSER)
     A            B1NAVN    R        O  5 16REFFLD(ABNAVN)
     A*
     A          R B2WCT                     SFLCTL(B1WSF)
     A*%%TS  SD  20061009  141314  KRKRI       REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      CF03
     A                                      CF05
     A                                      KEEP
     A                                      OVERLAY
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            SVRN01         4S 0H      SFLRCDNBR(CURSOR)
     A                                  1  2'Velg post og trykk enter'
     A                                      COLOR(BLU)
     A                                  1 32'1=Hent inn'
     A                                      COLOR(BLU)
     A                                  3  1'V Bruker       Navn'
     A                                      COLOR(WHT)
     A            B2USER    R        B  4  4REFFLD(ABUSER)
     A                                      DLTCHK
     A  31                                  ERRMSGID(FRK0005 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FRK0002 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A            B2NAVN    R        B  4 16REFFLD(ABNAVN)
     A                                      COLOR(YLW)
     A*
     A          R B2CMD
     A*%%TS  SD  19970904  085112  KRKRI       REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                      WINDOW(*DFT 14 50)
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 13 17'F5=Forny'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 78' '
