     A*%%TS  SD  20111128  131856  SST         REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/IFRF IFRFR)
     A                                      HOME(21)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '        '))
     A*
     A          R C2BLD
     A*%%TS  SD  20111128  131856  SST         REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      PUTOVR
     A                                      OVERLAY
     A                                      HELP
     A          H                           HLPRCD(BILD4H01)
     A                                      HLPARA(01 001 18 040)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 65'Dato:'
     A                                      COLOR(WHT)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  2  2'Sende melding til flere brukere'
     A                                  2 45'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 53USER
     A                                      COLOR(WHT)
     A                                  2 65'KL..:'
     A                                      COLOR(WHT)
     A                                  2 72TIME
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            C2NYEN    R        O  5 69REFFLD(ZZNYEN)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A                                  6  2'Melding . . . :'
     A            C2M1          62A  B  6 18OVRDTA
     A  30                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A            C2M2          75A  B  7  5OVRDTA
     A  30                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A            C2M3          75A  B  8  5OVRDTA
     A  30                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A            C2M4          75A  B  9  5OVRDTA
     A  30                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A            C2M5          75A  B 10  5OVRDTA
     A  30                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A            C2M6          75A  B 11  5OVRDTA
     A  30                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A            C2M7          75A  B 12  5OVRDTA
     A  30                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A            C2SVAR         1A  B 14 25OVRDTA
     A  30                                  DSPATR(PR)
     A  32                                  ERRMSGID(KOL0001 *LIBL/QMFSERV)
     A                                      COLOR(YLW)
     A                                 23  2'F3 tilbake   '
     A                                      COLOR(BLU)
     A                                 14  2'Kreve svar. . :       '
     A                                 14 29'(J)'
     A                                 16  2'Bruker/gruppe :'
     A            U1            10A  B 16 19COLOR(WHT)
     A            U2            10A  B 16 31COLOR(WHT)
     A            U3            10A  B 16 43COLOR(WHT)
     A            U4            10A  B 16 55COLOR(WHT)
     A            U5            10A  B 16 67COLOR(WHT)
     A            U6            10A  B 17 67COLOR(WHT)
     A            U7            10A  B 17 55COLOR(WHT)
     A            U8            10A  B 17 43COLOR(WHT)
     A            U9            10A  B 17 31COLOR(WHT)
     A            U10           10A  B 17 19COLOR(WHT)
     A                                 18 19'(Sende til gruppe ved å skrive: xx-
     A                                      x* eks FA*)'
     A          R BILD4H01
     A*%%TS  SD  19981117  090247  BOF         REL-V3R7M0  5716-PW1
     A                                  1  2'Klientgrupp 3PL:'
     A                                  1 19'Sier hvilken klientgruppe som skal-
     A                                       brukes i 3P-LØNN.          '
     A                                  2  2'% Lærlingtimer.:'
     A                                  2 19'Prosent lærlingtimer vedr. etterka-
     A                                      lkyle. 1 desimal.           '
     A                                  3 19'Brukes for å omberegne lærlingtime-
     A                                      r før beregning av f.eks.   '
     A                                  4 19'dekning pr. time. Dvs. 1 lærlingti-
     A                                      me = 0,7 t.                 '
     A                                  6  2'Grunnlønn std..:'
     A                                  6 19'Grunnlønn pr.time.                -
     A                                                                  '
     A                                  8  2'Forv. timelønn :'
     A                                  8 19'Forventet timelønn.               -
     A                                                                  '
     A                                  9  2'M.spes. L/F....:'
     A                                  9 19'Dersom man ønsker, på lønnslipp el-
     A                                      ler eget ark, å liste ut    '
     A                                 10 19'hvilke ordre lønnstakere har jobbe-
     A                                      t på, kan dette gjøres ved å'
     A                                 11 19'oppgi de L/F-koder som skal listes-
     A                                       ut her. I tillegg settes   '
     A                                 12 19'Mont.sp lønn 1 eller 2.           -
     A                                                                  '
     A                                 14  2'Reg.lønn ordre.:'
     A                                 14 19'1=gir mulighet ti registrering av -
     A                                      lønn til lønnsutbetaling fra'
     A                                 16 19'Ordresystemet.                    -
     A                                                                  '
     A                                 18  2'Postering lønn :'
     A                                 18 19'A = Lønnstakers avdeling   O = ord-
     A                                      rens avdeling.              '
     A                                 19  2'Kontering lønn.:'
     A                                 19 19'??????????                        -
     A                                                                  '
     A                                 21  2'Oppd.l. lønn   :'
     A                                 21 19'J=gir liste over all lønn som blir-
     A                                      oppdatert til ordre.        '
     A                                 22  2'Mont.sp. lønn  :'
     A                                 22 19'1= lønn listes ut pr. ordre på ege-
     A                                      n liste                     '
     A                                 23 19'2= lønn listes ut pr. ordre på løn-
     A                                      nssllipp.                   '
