     A*%%TS  SD  20070504  135333  KRKRI       REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A1WIN
     A*%%TS  SD  20061006  113924  KRKRI       REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 7 20)
     A                                      CF03
     A                                      CF12
     A                                  2  2'Oppgi år        '
     A                                      DSPATR(RI)
     A                                  4  2'År. . . .:'
     A            A1AARR         4Y 0B  4 13CHECK(RB)
     A                                      CHECK(FE)
     A                                      EDTWRD('    ')
     A                                      COLOR(YLW)
     A                                  6  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A          R B1SFL                     SFL
     A*%%TS  SD  20061011  110126  KRKRI       REL-V5R3M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(AÅVALG)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      VALUES(0 2 3 4 5 6)
     A            B1NUMM    R        O  8  4REFFLD(ATNUMM)
     A            B1TEXT        20A  O  8 11
     A            B1TYPE         4A  O  8 32
     A            B1USER         8A  O  8 37
     A            B1AVDE         4Y 0O  8 47EDTWRD('    ')
     A            B1ADAT         6Y 0O  8 53EDTWRD('  .  .  ')
     A            B1NAVN        17A  O  8 63
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20061011  110126  KRKRI       REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF03
     A                                      CF05
     A                                      CF06
     A                                      CF12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Aspgpl'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Registrering av avtaler'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'2=Endre  3=Kopier  4=Slett  5=Vis -
     A                                       6=Etikett'
     A                                      COLOR(BLU)
7.xx A                                  6  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  6  4'Nummer'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 32'Type'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 37'Saksb.'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 47'Avd.'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 53'Avt.dato'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 63'Motpartsnavn'
7.xx A                                      COLOR(WHT)
     A            B2NUMM    R        B  7  4REFFLD(ATNUMM)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A            B2TEXT    R        B  7 11REFFLD(ATTEXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20020226  080848  HKO         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20061009  134221  KRKRI       REL-V5R3M0  5722-WDS
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Aspgpl'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Registrering av avtale'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Avtalenummer . . . . . . . .'
     A            C1NUMM    R        B  5 31REFFLD(ATNUMM)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20061006  085420  KRKRI       REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CF03
     A                                      CF12
     A                                  2  2'Avtale finnes fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20070504  135333  KRKRI       REL-V5R4M0  5722-WDS
     A                                      CF03
     A                                      CF04
     A                                      CF12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Aspgpl'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Registrering av avtale'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Avtalenummer :'
     A            C1AARR    R        O  4 17REFFLD(ATAARR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  4 22'/'
     A            C1NUMM    R        O  4 24REFFLD(ATNUMM)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  4 46'Sist endr:'
     A                                      COLOR(WHT)
     A            C2EUSR    R        O  4 57REFFLD(ATEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  4 69'/'
     A                                      COLOR(WHT)
     A            C2EDAT         6Y 0O  4 72COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                  6  2'Leverandør . :'
     A            C2LEVR    R        B  6 17REFFLD(ATLEVR)
     A  31                                  ERRMSGID(LMO0200 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A            C2LTXT        30A  O  6 28OVRDTA
     A                                  7  2'Kundenummer. :'
     A            C2KUND    R        B  7 17REFFLD(ATKUND)
     A  32                                  ERRMSGID(FMO0210 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A            C2KTXT        30A  O  7 28OVRDTA
     A                                  8  2'Prosjekt . . :'
     A            C2PROJ    R        B  8 17REFFLD(ATPROJ)
     A  33                                  ERRMSGID(FRH0220 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A            C2PTXT        30A  O  8 28OVRDTA
     A                                  9  2'Avdeling . . :'
     A            C2AVDE    R        B  9 17REFFLD(ATAVDE)
     A  34                                  ERRMSGID(FRH0100 *LIBL/QMFOFAK 34)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A            C2ATXT        20A  O  9 28OVRDTA
     A                                 10  2'Saksbehandler:'
     A            C2USER    R        B 10 17REFFLD(ATUSER)
     A  35                                  ERRMSGID(AMB0020 *LIBL/QMFAGPL 35)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            C2UTXT        30A  O 10 28OVRDTA
     A                                 11  2'Sikkerhet. . :'
     A            C2GRNR    R        B 11 17REFFLD(ATGRNR)
     A  46                                  ERRMSGID(AMB0020 *LIBL/QMFAGPL 46)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                 13  2'Avtaletype . :'
     A            C2TYPE    R        B 13 17REFFLD(ATTYPE)
     A  36                                  ERRMSGID(VMA1100 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                 14  2'Beskrivelse. :'
     A            C2TEXT    R        B 14 17REFFLD(ATTEXT)
     A  38                                  ERRMSGID(VMA1100 *LIBL/QMFOFAK 38)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                 15  2'Man.referanse:'
     A            C2REFR    R        B 15 17REFFLD(ATREFR)
     A  39                                  ERRMSGID(VMA1100 *LIBL/QMFOFAK 39)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                 17  2'Arkiv dato   :'
     A            C2ADAT         6Y 0B 17 17COLOR(YLW)
     A  41                                  ERRMSGID(LMO0240 *LIBL/QMFLAGR 41)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      EDTWRD('      ')
     A                                 17 25'Start dato :'
     A            C2SDAT         6Y 0B 17 38COLOR(YLW)
     A  42                                  ERRMSGID(LMO0240 *LIBL/QMFLAGR 42)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      EDTWRD('      ')
     A                                 17 46'OBS dato :'
     A            C2ODAT         6Y 0B 17 57COLOR(YLW)
     A  43                                  ERRMSGID(LMO0240 *LIBL/QMFLAGR 43)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      EDTWRD('      ')
     A                                 18  2'Endret dato  :'
     A            C2CDAT         6Y 0B 18 17COLOR(YLW)
     A  44                                  ERRMSGID(LMO0240 *LIBL/QMFLAGR 44)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      EDTWRD('      ')
     A                                 18 25'Stopp dato :'
     A            C2TDAT         6Y 0B 18 38COLOR(YLW)
     A  45                                  ERRMSGID(LMO0240 *LIBL/QMFLAGR 45)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      EDTWRD('      ')
     A                                 20  2'Forpliktelse'
     A                                 20 15':'
     A            C2KRRA    R        B 20 17REFFLD(ATKRRA)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ,  ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 21  2'Inntektsramme:'
     A            C2KRFO    R        B 21 17REFFLD(ATKRFO)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ,  ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20061009  134221  KRKRI       REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 15 60)
     A                                      CF03
     A                                      CF12
     A                                  2  2' Slette avtale'
     A                                      DSPATR(RI)
     A                                  4  2'Avtalenummer . . .'
     A            D1NUMM    R        O  4 21REFFLD(ATNUMM)
     A                                  6  2'Beskrivelse. . . .'
     A            ATTEXT    R        O  6 21
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R E1WIN
     A*%%TS  SD  20061012  102458  KRKRI       REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 15 60)
     A                                      CF03
     A                                      CF04
     A                                      CF12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2'Utskrift av avtale-etikett'
     A                                      DSPATR(RI)
     A                                  4  2'Avtalenummer . . .'
     A            E1NUMM    R        O  4 21REFFLD(ATNUMM)
     A                                  5  2'Beskrivelse. . . .'
     A            ATTEXT    R        O  5 21
     A                                  7  2'Avtalenivå . . . .'
     A            E1NIVA    R        B  7 21REFFLD(ATNIVA)
     A  31                                  ERRMSGID(VMA1100 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                  9  2'Endringsdato . . .'
     A            E1CDAT         6Y 0B  9 21COLOR(YLW)
     A  44                                  ERRMSGID(LMO0240 *LIBL/QMFLAGR 44)
     A                                      CHECK(RB)
     A                                      EDTWRD('      ')
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 14 17'F4=Spørring'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20061009  134221  KRKRI       REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 15 60)
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Avtalenummer . . .'
     A            K1NUMM    R        B  4 21REFFLD(ATNUMM)
     A  31                                  ERRMSGID(VMA1010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VMA1030 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                  6  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  8  2'Avtalenummer . . .'
     A            ATNUMM    R        O  8 21OVRDTA
     A                                  9  2'Tekst. . . . . . .'
     A            ATTEXT    R        O  9 21OVRDTA
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
