     A*%%TS  SD  20080225  210242  ASK560      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASPGPL
     A* Format. . . . . : AT121D
     A* Beskrivelse . . : Kundetilpass konfig
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A* 7.00  090819  bkv  Nytt prg
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*%%EC
     A                                      DSPSIZ(27 132 *WIDE)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A          R B1SFL                     SFL
     A*%%TS  SD  20041102  191648  HKO530      REL-V5R2M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(AÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A            B1UMNU    R        O  8  5REFFLD(AMUMNU)
     A            B1UUSR    R        O  8 16REFFLD(AMUUSR)
     A            B1UUID    R        H      REFFLD(AMUUID)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20041102  193557  HKO530      REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0019)
     A                                      SFLPAG(0018)
     A                                      ROLLUP(10)
     A*                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'ADB'
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'NX meny brukerstyring'
     A                                      COLOR(WHT)
     A                                  2 38'AT123B2'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      --------------------------'
     A                                      COLOR(WHT)
     A                                  4  4'Filgrupppe'
     A                                      COLOR(WHT)
     A                                  4 21'Frisøk'
     A                                      COLOR(WHT)
     A                                  6  2'2=Endre 3=Kopier  4=Slett 5=Vis'
     A                                      COLOR(BLU)
     A                                  7  2'V'
     A                                      COLOR(WHT)
     A                                  7  5'Startmeny'
     A                                      COLOR(WHT)
     A                                  7 16'Bruker'
     A                                      COLOR(WHT)
     A            B2FRIS        30A  B  5 21
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20041102  192054  HKO530      REL-V5R2M0  5722-WDS
     A                                 27  3'F3=Gå tilbake  F5=Forny  F6=Oppret-
     A                                      t'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20080225  210242  ASK560      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'ADB'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Ny'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A*                                  5  2'Filgrupppe'
     A*            C1TFGP    R        B  5 17REFFLD(AKTFGP)
     A*                                      COLOR(GRN)
     A*                                      OVRDTA
     A                                  6  2'Startmeny'
     A            C1UMNU    R        B  6 17REFFLD(AMUMNU)
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                  7  2'Bruker'
     A            C1UUSR    R        B  7 17REFFLD(AMUUSR)
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                  8 17'(*ALL eller BRUKERNAVN)'
     A          R C1MSG
     A*%%TS  SD  19990112  143848  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Finnes fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  19990112  150031  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 11 65)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette nokkel '
     A                                      DSPATR(RI)
     A*                                  5  2'Filgrupppe'
     A*            D1TFGP    R        O  5 13REFFLD(AKTFGP)
     A*                                      COLOR(GRN)
     A                                  6  2'Startmeny'
     A            D1UUSR    R        O  7 13REFFLD(AMUUSR)
     A                                      COLOR(GRN)
     A                                  7  2'Bruker'
     A            D1UMNU    R        O  6 13REFFLD(AMUMNU)
     A                                      COLOR(GRN)
     A            D1UUID    R        H      REFFLD(AMUUID)
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20080225  210242  ASK560      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'ADB'
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'NX meny brukerstyring'
     A                                      COLOR(WHT)
     A N30                              2 26'Vise'
     A  30                              2 26'Endre'
     A                                      COLOR(WHT)
     A                                  2 38'AT121C2'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      --------------------------'
     A                                      COLOR(WHT)
     A*                                  5  2'Filgrupppe'
     A*            C2TFGP    R        O  5 17REFFLD(AKTFGP)
     A* N30                                  DSPATR(PR)
     A* N30                                  COLOR(YLW)
     A*  30                                  COLOR(GRN)
     A*                                      COLOR(YLW)
     A*                                      OVRDTA
     A                                  6  2'Startmeny'
     A            C2UUSR    R        O  7 17REFFLD(AMUUSR)
     A* N30                                  DSPATR(PR)
     A* N30                                  COLOR(YLW)
     A*  30                                  COLOR(GRN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Bruker'
     A            C2UMNU    R        O  6 17REFFLD(AMUMNU)
     A* N30                                  DSPATR(PR)
     A* N30                                  COLOR(YLW)
     A*  30                                  COLOR(GRN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 26  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
