     A*%%TS  SD  20070430  141120  KRKRI       REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20070430  114204  KRKRI       REL-V5R4M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(AÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5 7)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1SGRN    R        O  8  5REFFLD(ATSGRN)
     A            B1SGRS    R        O  8 17REFFLD(ATSGRS)
     A            B1SGRU    R        O  8 29REFFLD(ATSGRU)
     A            B1NAVN    R        O  8 41REFFLD(ATSGRU)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20070430  140147  KRKRI       REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Drifts-system'
     A                                      COLOR(WHT)
     A                                  1 66'Kl..:'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av sikkerhets-register'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'2=Endre'
     A                                      COLOR(BLU)
     A                                  5 11'3=Kopiere'
     A                                      COLOR(BLU)
     A                                  5 22'4=Slette'
     A                                      COLOR(BLU)
     A                                  5 32'5=Vise'
     A                                      COLOR(BLU)
7.xx A                                  7  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  5'Gruppekode'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 17'Gruppe'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 29'Bruker'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 41'Info'
7.xx A                                      COLOR(WHT)
     A            B2SGRN    R        B  6  5REFFLD(ATSGRN)
     A                                      DLTCHK
     A  31                                  ERRMSGID(EM01000 *LIBL/QMFEDIS 31)
     A  32                                  ERRMSGID(EM01000 *LIBL/QMFEDIS 32)
     A  33                                  ERRMSGID(EM01000 *LIBL/QMFEDIS 33)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20020226  095009  HKO         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20070430  141120  KRKRI       REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Drifts-system'
     A                                      COLOR(WHT)
     A                                  1 66'Kl..:'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av sikkerhets-register'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Gruppe-kode  . . . . . . . .'
     A            C1SGRN    R        B  5 31REFFLD(ATSGRN)
     A                                      COLOR(YLW)
     A                                  6  2'Gruppe . . . . . . . . . . .'
     A            C1SGRS    R        B  6 31REFFLD(ATSGRN)
     A                                      COLOR(YLW)
     A                                  7  2'Bruker . . . . . . . . . . .'
     A            C1SGRU    R        B  7 31REFFLD(ATSGRN)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F12=Annuller'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20070430  114204  KRKRI       REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Brukergruppe finnes fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20070430  141120  KRKRI       REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Drifts-system'
     A                                      COLOR(WHT)
     A                                  1 66'Kl..:'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av sikkerhets-register'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Gruppe-kode. .'
     A            C1SGRN    R        O  4 18REFFLD(ATSGRN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2NYEN    R        O  4 66REFFLD(AÅNYEN)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A            C1SGRS    R        O  5 18REFFLD(ATSGRN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1SGRU    R        O  6 18REFFLD(ATSGRN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Tekst, Info. . . . . . . . . . .'
     A            C2SGRT    R        B  9 36REFFLD(ATSGRT)
     A  31                                  ERRMSGID(EM01000 *LIBL/QMFEDIS 31)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F4=Spørring'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20070430  131848  KRKRI       REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette bruker-gruppe '
     A                                      DSPATR(RI)
     A                                  4  2'Gruppe-kode. . . .'
     A            D1SGRN    R        O  4 21REFFLD(ATSGRN)
     A            D1SGRS    R        O  5 21REFFLD(ATSGRN)
     A            D1SGRU    R        O  6 21REFFLD(ATSGRN)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20070430  132005  KRKRI       REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  4'Gruppe-kode . .'
     A            K1SGRN    R        O  4 20REFFLD(ATSGRN)
     A                                      DSPATR(UL)
     A            K1SGRS    R        O  5 20REFFLD(ATSGRN)
     A                                      DSPATR(UL)
     A            K1SGRU    R        O  6 20REFFLD(ATSGRN)
     A                                      DSPATR(UL)
     A                                  8  4' Kopiere til: '
     A                                      DSPATR(RI)
     A                                 10  4'Gruppe-kode . .'
     A            K2SGRN    R        B 10 20REFFLD(ATSGRN)
     A                                      COLOR(YLW)
     A  31                                  ERRMSGID(EM01000 *LIBL/QMFEDIS 31)
     A                                      OVRDTA
     A                                      DSPATR(MDT)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A            K2SGRS    R        B 11 20REFFLD(ATSGRN)
     A                                      COLOR(YLW)
     A  31                                  ERRMSGID(EM01000 *LIBL/QMFEDIS 31)
     A                                      OVRDTA
     A                                      DSPATR(MDT)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A            K2SGRU    R        B 12 20REFFLD(ATSGRN)
     A                                      COLOR(YLW)
     A  31                                  ERRMSGID(EM01000 *LIBL/QMFEDIS 31)
     A                                      OVRDTA
     A                                      DSPATR(MDT)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
