     A*%%TS  SD  20080225  210242  ASK560      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASPGPL
     A* Format. . . . . : AT121D
     A* Beskrivelse . . : Kundetilpass konfig
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A* 7.00  090819  bkv  Nytt prg
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*%%EC
     A                                      DSPSIZ(27 132 *WIDE)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A          R B1SFL                     SFL
     A*%%TS  SD  20041102  191648  HKO530      REL-V5R2M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(AÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A            B1HMNU    R        O  8  5REFFLD(AMHMNU)
     A            B1HSEQ    R        O  8 16REFFLD(AMHSEQ)
     A            B1HTXT    R        O  8 32REFFLD(AMHTXT)
     A            B1HTYP    R        O  8 20REFFLD(AMHTYP)
     A            B1HOPT    R        O  8 84REFFLD(AMHOPT)
     A            B1HUID    R        H      REFFLD(AMHUID)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20041102  193557  HKO530      REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0019)
     A                                      SFLPAG(0018)
     A                                      ROLLUP(10)
     A*                                      ROLLDOWN(11)
     A                                      CA01
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CF06
     A                                      CF08
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'ADB'
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'NX menytilpasninger'
     A                                      COLOR(WHT)
     A                                  2 38'AT122B2'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      --------------------------'
     A                                      COLOR(WHT)
     A                                  4  4'Filgrupppe'
     A                                      COLOR(WHT)
     A                                  4 21'Frisøk'
     A                                      COLOR(WHT)
     A                                  6  2'2=Endre 3=Kopier  4=Slett 5=Vis'
     A                                      COLOR(BLU)
     A                                  7  2'V'
     A                                      COLOR(WHT)
     A                                  7  5'Startmeny'
     A                                      COLOR(WHT)
     A                                  7 16'Nr'
     A                                      COLOR(WHT)
     A                                  7 32'Menytekst'
     A                                      COLOR(WHT)
     A                                  7 20'Type'
     A                                      COLOR(WHT)
     A                                  7 84'Program'
     A                                      COLOR(WHT)
     A*            B2TFGR    R        B  5  4REFFLD(AKTFGP)
     A*                                      COLOR(YLW)
     A*                                      OVRDTA
     A            B2FRIS        30A  B  5 21
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20041102  192054  HKO530      REL-V5R2M0  5722-WDS
     A                                 27  3'F1=Info F3=Gå tilbake  F5=Forny  F-
     A                                      6=Opprett  F8=Brukerstyring'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20080225  210242  ASK560      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'ADB'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'NX menytilpasninger'
     A                                      COLOR(WHT)
     A                                  2 33'Ny'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A*                                  5  2'Filgrupppe'
     A*            C1TFGP    R        B  5 17REFFLD(AKTFGP)
     A*                                      COLOR(GRN)
     A*                                      OVRDTA
     A                                  6  2'Startmeny'
     A            C1HMNU    R        B  6 17REFFLD(AMHMNU)
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                  7  2'Nr'
     A            C1HSEQ    R        B  7 17REFFLD(AMHSEQ)
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                  8  2'Type'
     A            C1HTYP    R        B  8 17REFFLD(AMHTYP)
     A                                      VALUES('OWNMENU' 'OWNPRG' 'NEWPRG')
     A                                      COLOR(GRN)
     A                                      OVRDTA
     A                                  8 30'OWNMENU, OWNPRG, NEWPRG'
     A          R C1MSG
     A*%%TS  SD  19990112  143848  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Finnes fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  19990112  150031  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 11 65)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette nokkel '
     A                                      DSPATR(RI)
     A*                                  5  2'Filgrupppe'
     A*            D1TFGP    R        O  5 13REFFLD(AKTFGP)
     A*                                      COLOR(GRN)
     A                                  6  2'Startmeny'
     A            D1HMNU    R        O  6 13REFFLD(AMHMNU)
     A                                      COLOR(GRN)
     A                                  7  2'Nr'
     A            D1HSEQ    R        O  7 13REFFLD(AMHSEQ)
     A                                      COLOR(GRN)
     A                                  8  2'Type'
     A            D1HTYP    R        O  8 13REFFLD(AMHTYP)
     A                                      COLOR(GRN)
     A            D1HUID    R        H      REFFLD(AMHUID)
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20080225  210242  ASK560      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'ADB'
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'NX menytilpasninger'
     A                                      COLOR(WHT)
     A N30                              2 23'Vise'
     A  30                              2 23'Endre'
     A                                      COLOR(WHT)
     A                                  2 38'AT122C2'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      --------------------------'
     A                                      COLOR(WHT)
     A*                                  5  2'Filgrupppe'
     A*            C2TFGP    R        O  5 17REFFLD(AKTFGP)
     A* N30                                  DSPATR(PR)
     A* N30                                  COLOR(YLW)
     A*  30                                  COLOR(GRN)
     A*                                      COLOR(YLW)
     A*                                      OVRDTA
     A                                  6  2'Startmeny'
     A            C2HMNU    R        O  6 17REFFLD(AMHMNU)
     A* N30                                  DSPATR(PR)
     A* N30                                  COLOR(YLW)
     A*  30                                  COLOR(GRN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Nr'
     A            C2HSEQ    R        O  7 17REFFLD(AMHSEQ)
     A* N30                                  DSPATR(PR)
     A* N30                                  COLOR(YLW)
     A*  30                                  COLOR(GRN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Type'
     A            C2HTYP    R        O  8 17REFFLD(AMHTYP)
     A* N30                                  DSPATR(PR)
     A* N30                                  COLOR(YLW)
     A*  30                                  COLOR(GRN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Menytekst'
     A            C2HTXT    R        B  9 17REFFLD(AMHTXT)
     A N30                                  DSPATR(PR)
     A                                      OVRDTA
     A N30                                  COLOR(YLW)
     A  30                                  COLOR(GRN)
     A                                      CHECK(LC)
     A                                 10  2'Program'
     A            C2HOPT    R        B 10 17REFFLD(AMHOPT)
     A N30                                  DSPATR(PR)
     A                                      OVRDTA
     A N30                                  COLOR(YLW)
     A  30                                  COLOR(GRN)
     A                                 11  2'Sikkherhet'
     A            C2HSEL    R        B 11 17REFFLD(AMHSEL)
     A N30                                  DSPATR(PR)
     A                                      OVRDTA
     A N30                                  COLOR(YLW)
     A  30                                  COLOR(GRN)
     A            C2ODAT         6Y 0O 25 94COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 25105'/'
     A            C2EDAT         6Y 0O 25108COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 25120'/'
     A            C2EUSR    R        O 25122REFFLD(AMHEUS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 26  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R F1MSG
     A*%%TS  SD  19990112  143848  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 21 49)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Det kan lages 2 meny "typer"'
     A                                  3  2'  1: Egne menyer - kundeprg'
     A                                  4  2'  2: Nye menyer - gi hurtig tilgan-
     A                                      g nye prg'
     A                                  6  2'  Egne menyer:'
     A                                  7  2'    Lag en rad med type OWNMENU'
     A                                  8  2'    Lag x antall rader med OWNPRG'
     A                                 10  2'  Nye menyer:'
     A                                 11  2'   Lag x antall rader med NEWPRG'
     A                                 13  2'  Tilgang:'
     A                                 14  2'    Styres av startmeny og bruker'
     A                                 15  2'    eller *all (alle med meny)   '
     A                                 16  2'    Bruk F8 til å koble startmeny'
     A                                 17  2'    til *all eller angitt bruker'
     A                                 20  1'F3=Gå tilbake'
     A                                      COLOR(BLU)
