     A*%%TS  SD  20000321  122032  HKO         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A                                      PRINT
     A          R B1SFL                     SFL
     A*%%TS  SD  19990323  220154  HKO         REL-V4R2M0  5769-PW1
     A            B1NOTA    R        O  2  2REFFLD(AUNOTA)
     A                                      COLOR(YLW)
     A                                      DSPATR(RI)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  19990323  204240  HKO         REL-V4R2M0  5769-PW1
     A                                      SFLSIZ(00012)
     A                                      SFLPAG(00011)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      CA23
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&WCURRN)
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WCURRN         5S 0H
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A          R B2CMD
     A*%%TS  SD  20000321  122032  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 15 42)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A N80                             14 26'F23=Vis signatur'
     A                                      COLOR(BLU)
     A  80                             14 26'F23=Fjern sinatur'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
