     A*%%TS  SD  20200506  115343  B02SVSTR    REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1WIN
     A*%%TS  SD  20200506  115343  B02SVSTR    REL-V7R3M0  5770-WDS
     A                                      WINDOW(S1WIN)
     A                                      TEXT('Vinduversjon')
     A                                      CA03
     A                                      CA04
     A                                      CA05
     A                                      CF10
     A                                      CA12
     A                                      KEEP
     A                                  2  2'      Faste felter til SAF_T rappo-
     A                                      rt           '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  3  2'Software:'
     A                                  4  2' Navn. . . . . :'
     A            P_VENA        30A  B  4 19DSPATR(PR)
     A                                  5  2' Versjon . . . :'
     A            P_VENR         5A  B  5 19COLOR(YLW)
     A                                      CHECK(LC)
     A                                      DSPATR(PR)
     A                                  6  2'Alfa-konvert . :'
     A            P_ALFA         3A  B  6 19COLOR(YLW)
     A                                      DSPATR(PC)
     A                                  8  2'Firma:'
     A                                  9  2' Region. . . . :'
     A            P_REGI        30A  B  9 19COLOR(YLW)
     A                                      DSPATR(PC)
     A                                 11  2' Fornavn . . . :'
     A            P_FNAV        30A  B 11 19COLOR(YLW)
     A                                      CHECK(LC)
     A                                 12  2' Etternavn . . :'
     A            P_ENAV        30A  B 12 19COLOR(YLW)
     A                                      CHECK(LC)
     A                                 13  3'Telefon . . . :'
     A            P_TELE        15A  B 13 19COLOR(YLW)
     A                                 14  3'MobilTelefon. :'
     A            P_MOBI        15A  B 14 19COLOR(YLW)
     A                                 15  3'Email . . . . :'
     A            P_EMA1        30A  B 15 19COLOR(YLW)
     A                                      CHECK(LC)
     A            P_EMA2        30A  B 16 19COLOR(YLW)
     A                                      CHECK(LC)
     A                                 17  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  6 26'(1X1 / SPS)'
     A          R S1WIN
     A*%%TS  SD  19950112  083340  RH          REL-V2R3M0  5738-PW1
     A                                      TEXT('Ramme')
     A                                      KEEP
     A                                      WINDOW(&W_ALIN &W_APOS 18 50)
     A            W_ALIN         2S 0P
     A            W_APOS         3S 0P
     A          R ASUME
     A*%%TS  SD  19941222  135431  RH          REL-V2R3M0  5738-PW1
     A                                      KEEP
     A                                      ASSUME
     A                                 24 79' '
