     A*%%TS  SD  20161123  082714  SST630      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A          R M1WIN
     A*%%TS  SD  20161123  082714  SST630      REL-V7R1M0  5770-WDS
     A                                      WINDOW(&W_ACLI &W_ACPO 10 54)
     A                                      CA12
     A                                      KEEP
     A            W_ACLI         2S 0P
     A            W_ACPO         3S 0P
     A                                  2  2' Melding : '
     A                                      DSPATR(RI)
     A            M1MLD1    R        O  4  2REFFLD(AÅMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            M1MLD2    R        O  5  2REFFLD(AÅMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  2'Svar J for Avbryt, N for å gå vide-
     A                                      re .'
     A            M1SVAR    R        B  7 43REFFLD(AÅSVAR)
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  7 47'J=Ja'
     A                                  8 47'N=Nei'
     A                                  9  2'F12=Annuller'
     A                                      COLOR(BLU)
     A                                  8  2'Hvis N, sjekk/flytt denne koden et-
     A                                      terpå'
     A          R ASUME                     ASSUME
     A                                 24 79' '
