     A*%%TS  SD  20200412  094317  KRKRI       REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/OFRF OFRFR)
     A                                      PRINT
     A                                      CA03(03 'F03=Avslutt')
     A          R A1BLD
     A*%%TS  SD  20200412  094317  KRKRI       REL-V7R3M0  5770-WDS
     A                                 11 11'Filegruppe :'
     A                                      COLOR(WHT)
     A            FGRP           3A  B 11 24COLOR(YLW)
