     A*%%TS  SD  19990924  133321  ASK         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  19990924  133321  ASK         REL-V4R4M0  5769-PW1
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 26'Generere distribusjon til ASP'
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  8 14'Kommunikasjonstype........'
     A            A1CMN          3A  B  8 41COLOR(YLW)
     A                                      DSPATR(PC)
     A                                  8 45'(X25,OPR)'
     A            A1MLD         70A  O 22  1COLOR(RED)
     A                                 23  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 21'F12=Annuller'
     A                                      COLOR(BLU)
