     A*%%TS  SD  20000111  162219  ASK         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20000111  162219  ASK         REL-V4R4M0  5769-PW1
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA08(08 'F8=Jobbkø')
     A                                      CA12(12 'F12=Gå tilbake')
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 26' Definere kommunikasjon mot ASP'
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  8 14'Linjenavn...'
     A            A1LIN         10A  B  8 28COLOR(YLW)
     A                                      DSPATR(PR)
     A                                  9 14'Ressurs.....'
     A            A1RES         10A  B  9 28COLOR(YLW)
     A                                      DSPATR(PC)
     A                                 23  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 21'F8=Jobbkø'
     A                                      COLOR(BLU)
