     A*%%TS  SD  20080226  145515  MHA560      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BUSRST BUSRST)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1WIN
     A*%%TS  SD  20080226  145515  MHA560      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 22 74)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A                                  1  2' Vedlikehold av Butikk bruker-info-
     A                                      rmasjon '
     A                                      DSPATR(RI)
     A                                  2  2'Min referanse. . .'
     A            B1VREF    R        B  2 21REFFLD(BBVREF)
     A  31                                  ERRMSGID(BMB0100 *LIBL/QMFSHOP 31)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                  3  2'Selgernr . . . . .'
     A            B1SELG    R        B  3 21REFFLD(BBSELG)
     A  32                                  ERRMSGID(BMB0110 *LIBL/QMFSHOP 32)
     A  33                                  ERRMSGID(BMB0115 *LIBL/QMFSHOP 33)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                  4  2'Rettighetskode . .'
     A            B1KRET    R        B  4 21REFFLD(BBKRET)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2 9)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                  4 24'0=Ikke tilgang'
     A                                  5 24'1=Bruker'
     A                                  6 24'2=Bruker endre eget oppsett'
     A                                  7 24'9=Administrator'
     A                                  8  2'Kassaoppgjør . . .'
     A            B1KOPG    R        B  8 21REFFLD(BBKOPG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                  8 24'0=Ikke kassaoppgjør'
     A                                  9 24'1=Kassaoppgjør uten regnskapsoppda-
     A                                      tering'
     A                                 10 24'2=Kassaoppgjør med regnskapsoppdat-
     A                                      ering'
     A                                 11  2'Kostpris/DG. . . .'
     A            B1KKPR    R        B 11 21REFFLD(BBKKPR)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 11 24'0=Ikke se kostpris/DG'
     A                                 11 47'1=Se kostpris/DG'
     A                                 12 24'2=Endre kostpris/DG'
     A                                 14  2'Endre salgspris. .'
     A            B1KSPR    R        B 14 21REFFLD(BBKSPR)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 14 24'1=Ja,0=Nei'
     A                                 13 37'Eget oppsett:'
     A                                      COLOR(WHT)
     A                                 15  2'Endre rabatt . . .'
     A            B1KRAB    R        B 15 21REFFLD(BBKRAB)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 15 24'1=Ja,0=Nei'
     A                                 14 37'Vise kostpris . .'
     A            B1KKOP    R        B 14 55REFFLD(BBKKOP)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 14 58'0=Nei,1=Ja,2=Std'
     A                                 16  2'Endre varetekst. .'
     A            B1KVTX    R        B 16 21REFFLD(BBKVTX)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 16 24'1=Ja,0=Nei'
     A                                 15 37'Vise varedetaljer'
     A            B1KVAD    R        B 15 55REFFLD(BBKVAD)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 15 58'0=Nei,1=Ja,2=Std'
     A                                 17  2'Endre lager. . . .'
     A            B1KLAG    R        B 17 21REFFLD(BBKLAG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 17 24'1=Ja,0=Nei'
     A                                 16 37'Vise tastatur . .'
     A            B1KTAS    R        B 16 55REFFLD(BBKTAS)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 16 58'0=Nei,1=Ja,2=Std'
     A                                 18  2'Endre avdeling . .'
     A            B1KAVD    R        B 18 21REFFLD(BBKAVD)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 18 24'1=Ja,0=Nei'
     A                                 17 37'Cursor i antall .'
     A            B1KCAN    R        B 17 55REFFLD(BBKCAN)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 17 58'0=Nei,1=Ja,2=Std'
     A                                 19  2'Overst. kred.gense'
     A            B1KKGR    R        B 19 21REFFLD(BBKKGR)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 19 24'1=Ja,0=Nei'
     A                                 18 37'Beholde selger. .'
     A            B1KBSE    R        B 18 55REFFLD(BBKBSE)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 18 58'0=Nei,1=Ja,2=Std'
     A                                 20  2'Vise kundeposter .'
     A            B1KKUP    R        B 20 21REFFLD(BBKKUP)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 20 24'1=Ja,0=Nei'
     A                                 21  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            B1ODAT         6Y 0O 21 42COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 21 51'/'
     A            B1EDAT         6Y 0O 21 53COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 21 62'/'
     A            B1EUSR    R        O 21 64REFFLD(BBEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 19 37'Hente låste ordr.'
     A            B1HHOR    R        B 19 55REFFLD(BBHHOR)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 19 58'0=Nei,1=Ja,2=Std'
     A                                 20 37'Ekstra hjelp. . .'
     A            B1EKSH    R        B 20 55REFFLD(BBEKSH)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 20 58'0=Nei,1=Ja,2=Std'
     A          R ASUME                     ASSUME
     A                                 24 79' '
