     A*%%TS  SD  20041102  211743  HKO530      REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BFRF BFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20041102  211743  HKO530      REL-V5R2M0  5722-WDS
     A            B1KBON    R        O  7  2REFFLD(BGKBON)
     A            B1KBEL    R        O  7 16REFFLD(BGKBEL)
     A            B1KODA         6Y 0O  7 29EDTWRD('  .  .  ')
     A            B1KOTI    R        O  7 39REFFLD(BGKOTI)
     A            B1KOUS    R        O  7 50REFFLD(BGKOUS)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20041102  211743  HKO530      REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Butikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kjøp på gavekort'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4 56'Gavekortnr:'
     A                                      COLOR(BLU)
     A            B2KGAV    R        O  4 68REFFLD(BGKGAV)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  6  2'Bongnr          Beløp        Dato -
     A                                         Tidspunkt  Bruker-id'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20041102  205153  HKO530      REL-V5R2M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
