     A*%%TS  SD  20121105  105741  AMD620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A                                      CA22(22 'F12=Info')
     A          R A1MNU
     A*%%TS  SD  20121105  105741  AMD620      REL-V7R1M0  5770-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Butikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Hovedmeny'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A*                                 4 66'Versjon.: 6.20'
7.xx A*                                     COLOR(WHT)
     A                                  6 27'2. Spørring på kundeinformasjon'
     A                                  7 27'3. Spørring på vare /pris  '
     A                                  8 27'4. Spørring på statistikk'
     A                                  9 27'5. Spørring på fakturaregister'
     A                                 11 27'6. Meny for dagsoppgjør'
     A                                 12 27'7. Vedlikehold av registere'
     A                                 13 27'8. Diverse oppgaver'
     A                                 15 27'9. Ordreregistrering'
     A                                 17 26'90. Gå ut av systemet    '
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
6.21 A                                 23 17'F3=Gå tilbake'
6.21 A                                      COLOR(BLU)
6.21 A                                 23 32'F5=Driftsmeny'
     A                                      COLOR(BLU)
6.21 A                                 23 47'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
