     A*%%TS  SD  20041102  185427  HKO530      REL-V5R2M0  5722-WDS
     A*
     A* System. . . . . : ASSHOP
     A* Format. . . . . : BM60
     A* Beskrivelse . . : Overføring/Dagsoppgjør
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
6.30 A* 6.30  110914 BSA  Justert ledetekst
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A                                      CA22(22 'F12=Info')
     A          R A1MNU
     A*%%TS  SD  20041102  185427  HKO530      REL-V5R2M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Butikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Dagsoppgjør'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6 27'1. Utskrift av dagsoppgjør'
6.30 A**                                7 27'2. Utskrift av journalliste'
6.30 A                                  7 27'2. Overføring til økonomi'
     A                                  9 27'3. Slettede salg'
     A                                 10 27'4. Gavekort'
     A                                 12 27'5. Vedlikehold av håndterminal ord-
     A                                      re'
     A                                 14 27'7. Vedlikehold av registere'
     A                                 17 26'90. Gå ut av systemet    '
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
