     A*%%TS  SD  20041020  125515  HKO530      REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20041020  125515  HKO530      REL-V5R2M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Butikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold/utskrift'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  4'Vedlikehold av:'
     A                                      COLOR(WHT)
     A                                  5 41'Utskrift av:'
     A                                      COLOR(WHT)
     A                                  6  5'1. Faste opplysninger'
     A                                  6 41'30. Faste opplysninger'
     A                                  7  5'2. Budsjett-register'
     A                                  7 41'31. Budsjett-register'
     A                                  8  5'3. GTIN-nummer'
     A                                  8 41'32. Kasse-register'
     A                                 10  4'Vedlikehold av gammel løsning:'
     A                                      COLOR(WHT)
     A                                 10 41'Innstillinger nytt kasseoppgjør:'
     A                                      COLOR(WHT)
     A                                 11  4'10. Kasse'
     A                                 11 41'40. Innstillinger'
     A                                 12 41'41. Telling'
     A                                 13 41'42. Beholdning'
     A                                 13  4'Vedlikehold av ny løsning:'
     A                                      COLOR(WHT)
     A                                 14  4'20. Kasse'
     A                                 15  4'21. Bongtekster'
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
