     A*%%TS  SD  20000921  130611  AMD         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BFRF BFRFR)
     A                                      PRINT
     A          R D1BLD
     A*%%TS  SD  20000503  142705  AMD         REL-V4R4M0  5769-PW1
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF06
     A                                      CF08
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A                                      CF15
     A                                      CF21
     A                                      CF22
     A                                      CF24
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      KEEP
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Butikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Registrering av varelinjer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            D1WSID    R        O  4  2REFFLD(BNWSID)
     A                                  4 13'KUNDE'
     A                                      COLOR(WHT)
     A            D1KUND    R        O  4 19REFFLD(BNKUND)
     A                                  4 28'Tlf:'
     A            D1TLFN    R        O  4 33REFFLD(RKTLFN *LIBL/RFRF)
     A            D1LKUN    R        O  4 50REFFLD(BNLKUN)
     A                                  4 59'Mob:'
     A            D1MOBN    R        O  4 64REFFLD(RKMOBN *LIBL/RFRF)
     A                                  5  2'BONG-NR'
     A                                      COLOR(WHT)
     A            D1NAVN    R        O  5 19REFFLD(BNNAVN)
     A            D2NAVN    R        O  5 50REFFLD(BNNAVN)
     A            D1BONG    R        O  6  2REFFLD(BNNUMM)
     A            D1ADR1    R        O  6 19REFFLD(BNADR1)
     A            D2ADR1    R        O  6 50REFFLD(BNADR1)
     A            D1STED    R        O  7 19REFFLD(BNSTED)
     A            D2STED    R        O  7 50REFFLD(BNSTED)
     A                                  8  2'Valg : 2=Endre  4=Slette'
     A                                      COLOR(BLU)
     A                                  8 28'7=Vise prod.info.'
     A                                      COLOR(BLU)
     A                                  9  2'V L Varenr   Tekst                -
     A                                               Antall'
     A                                      COLOR(WHT)
     A                                  9 53'Enh   Pris    Rabatt      K'
     A                                      COLOR(WHT)
     A            D1K001         1A  B 10  2
     A  41                                  ERRMSGID(BM00010 *LIBL/QMFSHOP 41)
     A                                      VALUES(' ' '2' '4' '7')
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A            D1L001         1Y 0O 10  4EDTCDE(Z)
     A  71                                  DSPATR(RI)
     A            D1V001         8A  O 10  6
     A  71                                  DSPATR(RI)
     A            D1T001        28A  O 10 15
     A  71                                  DSPATR(RI)
     A  80        D10001         8Y 0O 10 44EDTWRD('        ')
     A  71                                  DSPATR(RI)
     A  81        D11001         7Y 1O 10 44EDTWRD('      , ')
     A  71                                  DSPATR(RI)
     A  82        D12001         7Y 2O 10 44EDTWRD('     ,  ')
     A  71                                  DSPATR(RI)
     A  83        D13001         7Y 3O 10 44EDTWRD('    ,   ')
     A  71                                  DSPATR(RI)
     A            D1E001         3A  O 10 53
     A  71                                  DSPATR(RI)
     A            D1S001         8Y 2O 10 57EDTWRD('      ,  ')
     A  71                                  DSPATR(RI)
     A            DR1001         4Y 2O 10 67
     A  71                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            DR2001         4Y 2O 10 73
     A  71                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            D1D001         2A  O 10 79
     A  71                                  DSPATR(RI)
     A            D1K002         1A  B 11  2
     A  42                                  ERRMSGID(BM00010 *LIBL/QMFSHOP 42)
     A                                      VALUES(' ' '2' '4' '7')
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A            D1L002         1Y 0O 11  4EDTCDE(Z)
     A  71                                  DSPATR(RI)
     A            D1V002         8A  O 11  6
     A  72                                  DSPATR(RI)
     A            D1T002        28A  O 11 15
     A  72                                  DSPATR(RI)
     A  80        D10002         8Y 0O 11 44EDTWRD('        ')
     A  72                                  DSPATR(RI)
     A  81        D11002         7Y 1O 11 44EDTWRD('      , ')
     A  72                                  DSPATR(RI)
     A  82        D12002         7Y 2O 11 44EDTWRD('     ,  ')
     A  72                                  DSPATR(RI)
     A  83        D13002         7Y 3O 11 44EDTWRD('    ,   ')
     A  72                                  DSPATR(RI)
     A            D1E002         3A  O 11 53
     A  72                                  DSPATR(RI)
     A            D1S002         8Y 2O 11 57EDTWRD('      ,  ')
     A  72                                  DSPATR(RI)
     A            DR1002         4Y 2O 11 67
     A  72                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            DR2002         4Y 2O 11 73
     A  72                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            D1D002         2A  O 11 79
     A  72                                  DSPATR(RI)
     A            D1K003         1A  B 12  2
     A  43                                  ERRMSGID(BM00010 *LIBL/QMFSHOP 43)
     A                                      VALUES(' ' '2' '4' '7')
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A            D1L003         1Y 0O 12  4EDTCDE(Z)
     A  71                                  DSPATR(RI)
     A            D1V003         8A  O 12  6
     A  73                                  DSPATR(RI)
     A            D1T003        28A  O 12 15
     A  73                                  DSPATR(RI)
     A  80        D10003         8Y 0O 12 44EDTWRD('        ')
     A  73                                  DSPATR(RI)
     A  81        D11003         7Y 1O 12 44EDTWRD('      , ')
     A  73                                  DSPATR(RI)
     A  82        D12003         7Y 2O 12 44EDTWRD('     ,  ')
     A  73                                  DSPATR(RI)
     A  83        D13003         7Y 3O 12 44EDTWRD('    ,   ')
     A  73                                  DSPATR(RI)
     A            D1E003         3A  O 12 53
     A  73                                  DSPATR(RI)
     A            D1S003         8Y 2O 12 57EDTWRD('      ,  ')
     A  73                                  DSPATR(RI)
     A            DR1003         4Y 2O 12 67
     A  73                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            DR2003         4Y 2O 12 73
     A  73                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            D1D003         2A  O 12 79
     A  73                                  DSPATR(RI)
     A            D1K004         1A  B 13  2
     A  44                                  ERRMSGID(BM00010 *LIBL/QMFSHOP 44)
     A                                      VALUES(' ' '2' '4' '7')
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A            D1L004         1Y 0O 13  4EDTCDE(Z)
     A  71                                  DSPATR(RI)
     A            D1V004         8A  O 13  6
     A  74                                  DSPATR(RI)
     A            D1T004        28A  O 13 15
     A  74                                  DSPATR(RI)
     A  80        D10004         8Y 0O 13 44EDTWRD('        ')
     A  74                                  DSPATR(RI)
     A  81        D11004         7Y 1O 13 44EDTWRD('      , ')
     A  74                                  DSPATR(RI)
     A  82        D12004         7Y 2O 13 44EDTWRD('     ,  ')
     A  74                                  DSPATR(RI)
     A  83        D13004         7Y 3O 13 44EDTWRD('    ,   ')
     A  74                                  DSPATR(RI)
     A            D1E004         3A  O 13 53
     A  74                                  DSPATR(RI)
     A            D1S004         8Y 2O 13 57EDTWRD('      ,  ')
     A  74                                  DSPATR(RI)
     A            DR1004         4Y 2O 13 67
     A  74                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            DR2004         4Y 2O 13 73
     A  74                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            D1D004         2A  O 13 79
     A  74                                  DSPATR(RI)
     A            D1K005         1A  B 14  2
     A  45                                  ERRMSGID(BM00010 *LIBL/QMFSHOP 45)
     A                                      VALUES(' ' '2' '4' '7')
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A            D1L005         1Y 0O 14  4EDTCDE(Z)
     A  71                                  DSPATR(RI)
     A            D1V005         8A  O 14  6
     A  75                                  DSPATR(RI)
     A            D1T005        28A  O 14 15
     A  75                                  DSPATR(RI)
     A  80        D10005         8Y 0O 14 44EDTWRD('        ')
     A  75                                  DSPATR(RI)
     A  81        D11005         7Y 1O 14 44EDTWRD('      , ')
     A  75                                  DSPATR(RI)
     A  82        D12005         7Y 2O 14 44EDTWRD('     ,  ')
     A  75                                  DSPATR(RI)
     A  83        D13005         7Y 3O 14 44EDTWRD('    ,   ')
     A  75                                  DSPATR(RI)
     A            D1E005         3A  O 14 53
     A  75                                  DSPATR(RI)
     A            D1S005         8Y 2O 14 57EDTWRD('      ,  ')
     A  75                                  DSPATR(RI)
     A            DR1005         4Y 2O 14 67
     A  75                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            DR2005         4Y 2O 14 73
     A  75                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            D1D005         2A  O 14 79
     A  75                                  DSPATR(RI)
     A            D1K006         1A  B 15  2
     A  46                                  ERRMSGID(BM00010 *LIBL/QMFSHOP 46)
     A                                      VALUES(' ' '2' '4' '7')
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A            D1L006         1Y 0O 15  4EDTCDE(Z)
     A  71                                  DSPATR(RI)
     A            D1V006         8A  O 15  6
     A  76                                  DSPATR(RI)
     A            D1T006        28A  O 15 15
     A  76                                  DSPATR(RI)
     A  80        D10006         8Y 0O 15 44EDTWRD('        ')
     A  76                                  DSPATR(RI)
     A  81        D11006         7Y 1O 15 44EDTWRD('      , ')
     A  76                                  DSPATR(RI)
     A  82        D12006         7Y 2O 15 44EDTWRD('     ,  ')
     A  76                                  DSPATR(RI)
     A  83        D13006         7Y 3O 15 44EDTWRD('    ,   ')
     A  76                                  DSPATR(RI)
     A            D1E006         3A  O 15 53
     A  76                                  DSPATR(RI)
     A            D1S006         8Y 2O 15 57EDTWRD('      ,  ')
     A  76                                  DSPATR(RI)
     A            DR1006         4Y 2O 15 67
     A  76                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            DR2006         4Y 2O 15 73
     A  76                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            D1D006         2A  O 15 79
     A  76                                  DSPATR(RI)
     A            D1K007         1A  B 16  2
     A  47                                  ERRMSGID(BM00010 *LIBL/QMFSHOP 47)
     A                                      VALUES(' ' '2' '4' '7')
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A            D1L007         1Y 0O 16  4EDTCDE(Z)
     A  71                                  DSPATR(RI)
     A            D1V007         8A  O 16  6
     A  77                                  DSPATR(RI)
     A            D1T007        28A  O 16 15
     A  77                                  DSPATR(RI)
     A  80        D10007         8Y 0O 16 44EDTWRD('        ')
     A  77                                  DSPATR(RI)
     A  81        D11007         7Y 1O 16 44EDTWRD('      , ')
     A  77                                  DSPATR(RI)
     A  82        D12007         7Y 2O 16 44EDTWRD('     ,  ')
     A  77                                  DSPATR(RI)
     A  83        D13007         7Y 3O 16 44EDTWRD('    ,   ')
     A  77                                  DSPATR(RI)
     A            D1E007         3A  O 16 53
     A  77                                  DSPATR(RI)
     A            D1S007         8Y 2O 16 57EDTWRD('      ,  ')
     A  77                                  DSPATR(RI)
     A            DR1007         4Y 2O 16 67
     A  77                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            DR2007         4Y 2O 16 73
     A  77                                  DSPATR(RI)
     A                                      EDTWRD('  ,  ')
     A            D1D007         2A  O 16 79
     A  77                                  DSPATR(RI)
     A                                 18  1' V L   Antall       Varenummer    -
     A                                                                         -
     A                                                '
     A                                      DSPATR(UL)
     A                                      COLOR(TRQ)
     A            D1VALG    R        B 19  2REFFLD(BÅVALG)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BM00020 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A            D1LETY    R        B 19  4REFFLD(BMLETY)
     A                                      EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            D1ANTA    R        B 19  6REFFLD(BMANTA)
     A  37                                  ERRMSGID(BMD0900 *LIBL/QMFSHOP 37)
     A  20                                  DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                      RANGE(,000 99999,000)
     A  87        D1VAR0         8A  B 19 21
     A  38                                  ERRMSGID(BMD0300 *LIBL/QMFSHOP 38)
     A  21                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      CHECK(ER)
     A                                      COLOR(YLW)
     A                                      CHECK(RZ)
     A  88        D1EANN        14A  B 19 21
     A  38                                  ERRMSGID(BMD0310 *LIBL/QMFSHOP 38)
     A  21                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      CHECK(ER)
     A                                      COLOR(YLW)
     A  89        D1E128        26A  B 19 21
     A  38                                  ERRMSGID(BMD0310 *LIBL/QMFSHOP 38)
     A  50                                  ERRMSGID(BM00620 *LIBL/QMFSHOP 50)
     A  21                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      CHECK(ER)
     A                                      COLOR(YLW)
     A  87        D1VAR1         7A  B 19 34DSPATR(ND)
     A  87                                  DSPATR(PR)
     A                                 19 48'Total'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A            D1TOTS    R        O 19 54REFFLD(BNTOTS)
     A                                      DSPATR(UL)
     A                                      DSPATR(RI)
     A                                 20  2'!'
     A                                      COLOR(BLU)
     A                                 21  2'!-- 1= Full registrering'
     A                                      COLOR(BLU)
     A            B1CMDT        78A  O 24  2COLOR(BLU)
     A          R E1BLD
     A*%%TS  SD  19990617  144248  AMD         REL-V4R2M0  5769-PW1
     A                                      CF02
     A                                      CF03
     A                                      CF09
     A                                      SLNO(18)
     A                                      CLRL(07)
     A                                  1  1'LT L Varenummer            Antall -
     A                                         Enh     Pris   N   Rab1   Rab2  -
     A                                       Selvkost '
     A                                      DSPATR(UL)
     A                                      COLOR(TRQ)
     A            E1LTYP    R        O  2  1REFFLD(BMLTYP)
     A            E1LETY    R        B  2  4REFFLD(BMLETY)
     A                                      EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            E1VARE    R        O  2  6REFFLD(BMVARE)
     A            E1ANTA    R        B  2 24REFFLD(BMANTA)
     A  34                                  ERRMSGID(BMD0900 *LIBL/QMFSHOP 34)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                      RANGE(,000 99999,000)
     A            E1ENH1    R        B  2 38REFFLD(BMENH1)
     A  35                                  ERRMSGID(BMD0400 *LIBL/QMFSHOP 35)
     A  21                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A            E1SAPR         9Y 2B  2 42EDTWRD('     0 ,  ')
     A  36                                  ERRMSGID(BMD1000 *LIBL/QMFSHOP 36)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            E1KPRI    R        B  2 53REFFLD(BMKPRI)
     A                                      COLOR(YLW)
     A            E1RAB1    R        B  2 55REFFLD(BMRAB1)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            E1RAB2    R        B  2 62REFFLD(BMRAB2)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            E1SELK    R        B  2 70REFFLD(BMSELK)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            E1TEK1    R        B  3  2REFFLD(BMTEK1)
     A  37                                  ERRMSGID(BMD0600 *LIBL/QMFSHOP 37)
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A            E1ENH4    R        O  3 38REFFLD(BMENH1)
     A            E1ENH5    R        O  4 38REFFLD(BMENH1)
     A                                  4 52'Lagerbeholdn.:'
     A  28                                  DSPATR(ND)
     A                                      COLOR(BLU)
     A            E1BEHL    R        O  4 67REFFLD(VLBEHL *LIBL/FFRF)
     A  28                                  DSPATR(ND)
     A            E1ENH6    R        O  5 38REFFLD(BMENH1)
     A                                  5 52'Ordre/Pakks .:'
     A  28                                  DSPATR(ND)
     A                                      COLOR(BLU)
     A            E1PAKK    R        O  5 67REFFLD(VLBEHL *LIBL/FFRF)
     A  28                                  DSPATR(ND)
     A                                  6 52'Disp.beholdn.:'
     A  28                                  DSPATR(ND)
     A                                      COLOR(BLU)
     A            E1DISP    R        O  6 67REFFLD(VLBEHL *LIBL/FFRF)
     A  28                                  DSPATR(ND)
     A                                  7  1'     F3=Gå tilbake    F9=Vare/Lage-
     A                                      r                                  -
     A                                               '
     A                                      COLOR(BLU)
     A          R E2BLD
     A*%%TS  SD  19990622  224238  AMD         REL-V4R2M0  5769-PW1
     A                                      CF03
     A                                      SLNO(18)
     A                                      CLRL(07)
     A                                  1  1' Tekstlinje                       -
     A                                                                  LT     -
     A                                                '
     A                                      DSPATR(UL)
     A                                      COLOR(TRQ)
     A            E2TEK1    R        B  3  2REFFLD(BDTEK1)
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A            E2LTYP    R    2A  B  3 63REFFLD(BMLTYP)
     A  31                                  ERRMSGID(BMD0200 *LIBL/QMFSHOP 31)
     A  32                                  ERRMSGID(BMD0210 *LIBL/QMFSHOP 32)
     A                                  7  1'     F3=Gå tilbake                -
     A                                                                         -
     A                                               '
     A                                      COLOR(BLU)
     A          R H1BLD
     A*%%TS  SD  20000921  130611  AMD         REL-V4R4M0  5769-PW1
     A                                      CF03
     A                                      CF05
     A                                      CF08
     A                                      CF10
     A                                      CF12
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Butikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Avslutt handel'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4 36'BELØP'
     A                                  4 63'! 1.Kontant     !'
     A                                      COLOR(WHT)
     A                                  5 63'! 2.Kreditt     !'
     A                                      COLOR(WHT)
     A                                  6  2'Sum linjer. . . . . . . . . .'
     A            H1TOTS    R        O  6 33REFFLD(BNTOTS)
     A                                  6 63'! 3.Faktura     !'
     A                                      COLOR(WHT)
     A                                  7  2'Merverdiavgift. . . . . . . .'
     A            H1MOMS    R        O  7 33REFFLD(BNTOTS)
     A                                  7 63'! 4.Betaling    !'
     A                                      COLOR(WHT)
     A                                  8  2'Avrunding . . . . . . . . . .'
     A            H1RUND    R        O  8 33REFFLD(BNTOTS)
     A                                  8 63'! 5.Hurtigordre !'
     A                                      COLOR(WHT)
     A                                  9 63'-----------------'
     A                                      COLOR(WHT)
     A                                 10  2'Sum å betale. . . . . . . . .'
     A            H1BTAL    R        B 10 33REFFLD(BNTOTS)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 12 33'VALG'
     A                                 12 55'Mottatt'
     A                                 12 72'Tilbake'
     A                                 13  2'Type handel . . . . . . . . .'
     A            H1TYPE    R        B 13 34REFFLD(BÅVALG)
     A  22                                  DSPATR(PC)
     A  32                                  ERRMSGID(BMO2150 *LIBL/QMFSHOP 32)
     A  33                                  ERRMSGID(BMO2150 *LIBL/QMFSHOP 33)
     A  34                                  ERRMSGID(BMO2111 *LIBL/QMFSHOP 34)
     A  35                                  ERRMSGID(BMO2120 *LIBL/QMFSHOP 35)
     A                                      VALUES(1 2 3 4 5)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A            H1MOTT    R        B 13 50REFFLD(BNTOTS)
     A  39                                  ERRMSGID(BM00240 *LIBL/QMFSHOP 39)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COMP(GE ,00)
     A                                      COLOR(YLW)
     A            H1TILB    R        O 13 67REFFLD(BNTOTS)
     A  41                                  DSPATR(RI)
     A                                      COLOR(RED)
     A                                 15  2'Fortegn . . . . . . . . . . .'
     A            H1FORT    R        B 15 34REFFLD(BÅVALG)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A                                 15 39'1=Retur'
     A                                 16 54'*******************'
     A  23                                  DSPATR(ND)
     A                                 17  2'Selger. . . . . . . . . . . .'
     A            H1SELG    R        B 17 34REFFLD(BNSELG)
     A  36                                  ERRMSGID(BMO1000 *LIBL/QMFSHOP 36)
     A                                      COLOR(YLW)
     A                                 17 54'*                 *'
     A  23                                  DSPATR(ND)
     A                                 18  2'Lager . . . . . . . . . . . .'
     A            H1LAGE    R        B 18 34REFFLD(BNLAGE)
     A  37                                  ERRMSGID(BMO0200 *LIBL/QMFSHOP 37)
     A                                      COLOR(YLW)
     A                                 18 54'*  F A K T U R A  *'
     A  23                                  DSPATR(ND)
     A                                 19 54'*                 *'
     A  23                                  DSPATR(ND)
     A                                 20  2'Avdeling  . . . . . . . . . .'
     A            H1AVDE    R        B 20 34REFFLD(BNAVDE)
     A  38                                  ERRMSGID(BMO2700 *LIBL/QMFSHOP 38)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 20 54'*******************'
     A  23                                  DSPATR(ND)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 20'F5=A4-Bong'
     A                                      COLOR(BLU)
     A                                 23 35'F8=Kunder'
     A                                      COLOR(BLU)
     A                                 23 49'F12=Slett Handel'
     A                                      COLOR(BLU)
     A*
     A          R I1BLD
     A*%%TS  SD  19950613  194206  ASP         REL-V2R3M0  5738-PW1
     A                                      WINDOW(7 17 9 41)
     A                                      CF03
     A                                      KEEP
     A                                      OVERLAY
     A                                  2  2'Hvordan skal differansen mellom he-
     A                                      ntet'
     A                                      COLOR(WHT)
     A                                  3  2'ordre og behandlet ordre legges ti-
     A                                      lbake'
     A                                      COLOR(WHT)
     A                                  5  2'Valg :'
     A            I1SVAR    R        B  5  9REFFLD(BÅVALG)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A                                      VALUES(1)
     A                                  5 14'1 =  Differansen slettes'
     A                                  6 14'2 =  Differansen ******'
     A                                  8  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R K1BLD
     A*%%TS  SD  19960925  153343  AMD         REL-V3R6M0  5716-PW1
     A                                      WINDOW(*DFT 13 39)
     A                                      CF03
     A                                      KEEP
     A                                      OVERLAY
     A                                  2  2'Faste opplysninger ved registrerin-
     A                                      g'
     A                                      COLOR(WHT)
     A                                  4  2'Linjetype, Varelinjer  . .'
     A            K1LTYP    R        B  4 29REFFLD(BAALTY)
     A  31                                  ERRMSGID(BMD0200 *LIBL/QMFSHOP 31)
     A  32                                  ERRMSGID(BMD0210 *LIBL/QMFSHOP 32)
     A                                      COLOR(YLW)
     A                                  5  2'Linjetype, Tekstlinjer . .'
     A            K1TTYP    R        B  5 29REFFLD(BAATTY)
     A  33                                  ERRMSGID(BMD0200 *LIBL/QMFSHOP 33)
     A  34                                  ERRMSGID(BMD0220 *LIBL/QMFSHOP 34)
     A                                      COLOR(YLW)
     A                                  7  2'Automatisk varebilde . . .'
     A            K1SVAR    R        B  7 29REFFLD(BÅVALG)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A                                  7 35'1=Ja'
     A                                  8  2'Varenummer/GTIN-nummer . .'
     A            K1VALG    R        B  8 29REFFLD(BÅVALA)
     A                                      VALUES('V' 'E')
     A                                      CHKMSGID(BM00020 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A                                  8 35'V/E'
     A                                 10  2'Standard antall  :'
     A            K1ANTA    R        B 10 22REFFLD(BMANTA)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 12  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
