     A*%%TS  SD  20051027  100621  AMD550      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BFRF BFRFR)
     A                                      PRINT
     A          R C1BLD
     A*%%TS  SD  20051027  100621  AMD550      REL-V5R3M0  5722-WDS
     A                                      CF01
     A                                      CF03
     A                                      CF04
     A                                      CF06
     A                                      CF10
     A                                      KEEP
     A            DSFNAV        20A  O  1  2COLOR(WHT)
     A                                  1 31'***  AS Butikk  ***'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 27'Arbeide med kundeopplysninger'
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  4 28'Tlf:'
     A            C1TLFN    R        O  4 33REFFLD(RKTLFN *LIBL/RFRF)
     A                                  4 59'Mob:'
     A            C1MOBN    R        O  4 64REFFLD(RKMOBN *LIBL/RFRF)
     A                                  5  2'Kundenummer  .'
     A            C1LKUN    R        B  5 18REFFLD(BOLKUN)
     A                                      DLTCHK
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A  39                                  ERRMSGID(BMO2000 *LIBL/QMFSHOP 39)
     A  40                                  ERRMSGID(BMO2100 *LIBL/QMFSHOP 40)
     A  41                                  ERRMSGID(BMO2110 *LIBL/QMFSHOP 41)
     A  42                                  ERRMSGID(BMO2120 *LIBL/QMFSHOP 42)
     A  43                                  ERRMSGID(BRK0300 *LIBL/QMFSHOP 43)
     A                                  5 28'Lev.adresse'
     A            C1KUND    R        B  5 50REFFLD(BOKUND)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A  43                                  ERRMSGID(BRK0300 *LIBL/QMFSHOP 43)
     A                                  5 59'Fakt.adresse'
     A                                  6  2'Navn.  .  .  .'
     A            C1NAVN    R        B  6 18REFFLD(BONAVN)
     A                                      CHECK(LC)
     A  27                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A            C2NAVN    R        O  6 50REFFLD(BONAVN)
     A                                  7  2'Gate.  .  .  .'
     A            C1ADR1    R        B  7 18REFFLD(BOADR1)
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A            C2GATE    R        O  7 50REFFLD(BOADR1)
     A                                  8  2'Adresse.  .  .'
     A            C1ADR2    R        B  8 18REFFLD(BOADR2)
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A            C2ADR2    R        O  8 50REFFLD(BOADR2)
     A                                  9  2'Postadresse  .'
     A            C1STED    R        B  9 18REFFLD(BOSTED)
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A            C2STED    R        O  9 50REFFLD(BOSTED)
     A            C1TEXT        36A  O 10 18
     A  29                                  DSPATR(RI)
     A                                      COLOR(RED)
     A                                 12  2'Vår referanse.'
     A            C1VREF    R        B 12 18REFFLD(BOVREF)
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A            C2SAT1    R        O 12 50REFFLD(BONAVN)
     A  28                                  DSPATR(RI)
     A                                      COLOR(RED)
     A                                 13  2'Kundens ref. .'
     A            C1DREF    R        B 13 18REFFLD(BODREF)
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A            C2SAT2    R        O 13 50REFFLD(BONAVN)
     A  28                                  DSPATR(RI)
     A                                      COLOR(RED)
     A                                 14  2'Rekv.nummer  .'
     A            C1REKV    R        B 14 18REFFLD(BOREKV)
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A  49                                  ERRMSGID(BMO0680 *LIBL/QMFSHOP 49)
     A            C2SAT3    R        O 14 50REFFLD(BONAVN)
     A  28                                  DSPATR(RI)
     A                                      COLOR(RED)
     A                                 16  2'Leveringsdato.'
     A            C1LDAT         6Y 0B 16 18COLOR(YLW)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A  33                                  ERRMSGID(BMO0510 *LIBL/QMFSHOP 33)
     A                                      EDTCDE(Z)
     A                                 16 44'Betalingsbetingelser :'
     A            C1BETB    R        O 16 67REFFLD(BNBETB)
     A                                 17  2'Forsend.-måte.'
     A            C1LMTX    R        B 17 18REFFLD(BNLMTX)
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A                                 17 44'Kundekategori  . . . :'
     A            C1KKAT         4Y 0O 17 67EDTWRD('    ')
     A                                 19  2'Fakturagebyr .'
     A            C1KGFA    R        B 19 18REFFLD(BNKGFA)
     A                                      COLOR(YLW)
     A                                 19 22'(1=Gir ikke fakturagebyr)'
     A                                 21  2'Skal rabatt oppdateres inn :'
     A            C1VALG    R        B 21 31REFFLD(BÅVALA)
     A                                      COLOR(YLW)
     A                                 21 34'(1=Nei)'
     A                                 21 44'Overstyrende rabatt. :'
     A            C1RABF    R        B 21 67REFFLD(BNRABP)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      EDTWRD('   ,  ')
     A                                      COLOR(YLW)
     A                                 23  2'F1=Lev.adr'
     A                                      COLOR(BLU)
     A                                 23 15'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 31'F4=Spørring'
     A                                      COLOR(BLU)
     A                                 23 45'F6=Opprett kunde'
     A                                      COLOR(BLU)
