     A*%%TS  SD  19980626  142742  HKO         REL-V4R2M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BFRF BFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19980626  142742  HKO         REL-V4R2M0  5769-PW1
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 65'Kl..:'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 28'Vise bonglinje/fakturalinje'
     A                                      COLOR(WHT)
     A                                  2 65'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Dato . . . . . . . . .'
     A            B1BDAT         6Y 0O  5 25EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                  5 65'Ordretype. .'
     A            B1OTYP    R        O  5 78REFFLD(BOOTYP)
     A                                      COLOR(YLW)
     A                                  6  2'Bongnummer . . . . . .'
     A            B1NUMM    R        O  6 25REFFLD(BDBONG)
     A                                      COLOR(YLW)
     A                                  7  2'Fakturanummer. . . . .'
     A            B1BINR    R        O  7 25REFFLD(BOBINR)
     A                                      COLOR(YLW)
     A                                  9  2'Varenummer . . . . . .'
     A            B1VARE    R        O  9 25REFFLD(BDVARE)
     A                                      COLOR(YLW)
     A                                 10  2'Varetekst-1. . . . . .'
     A            B1TEK1    R        O 10 25REFFLD(BDTEK1)
     A                                      COLOR(YLW)
     A                                 11  2'Varetekst-2. . . . . .'
     A            B1TEK2    R        O 11 25REFFLD(BDTEK2)
     A                                      COLOR(YLW)
     A                                 13  2'Antall bestillt. . . .'
     A            B1ANTA    R        O 13 25REFFLD(BDANTA)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 14  2'Enhet. . . . . . . . .'
     A            B1ENH1    R        O 14 25REFFLD(BDENH1)
     A                                      COLOR(YLW)
     A                                 15  2'Priskode . . . . . . .'
     A            B1KPRI    R        O 15 25REFFLD(BDKPRI)
     A                                      COLOR(YLW)
     A                                 16  2'Kostpris . . . . . . .'
     A            B1KOPR    R        O 16 25REFFLD(BDKOPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 17  2'Salgspris (brutto) . .'
     A            B1SAPR    R        O 17 25REFFLD(BDSAPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 18  2'Linjerabatt-1. . . . .'
     A            B1RAB1    R        O 18 25REFFLD(BDRAB1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 19  2'Linjerabatt-2. . . . .'
     A            B1RAB2    R        O 19 25REFFLD(BDRAB2)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 20  2'Ordrerabatt  . . . . .'
     A            B1ORAB    R        O 20 25REFFLD(BDORAB)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)

     A                                 21  2'Salgspris (netto). . .'
     A            B1SUMS    R        O 21 25REFFLD(BDSUMS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
