     A*%%TS  SD  19950612  165134  AMD         REL-V2R3M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BFRF BFRFR)
     A                                      PRINT
     A          R M1WIN
     A*%%TS  SD  19950612  165134  AMD         REL-V2R3M0  5738-PW1
     A                                      CA03
     A                                      KEEP
     A                                      WINDOW(&WACTLI &WACTPO 10 44)
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A                                  2  2'Utskrift av budsjett-register'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  6  2'Oppgi budsjett-år. . . . . . . . .-
     A                                       .'
     A            M1AARR    R        B  6 39REFFLD(BUAARR)
     A                                      COLOR(YLW)
     A                                  9  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME
     A*%%TS  SD  19950516  151804  AMD         REL-V2R3M0  5738-PW1
     A                                      ASSUME
     A                                 24 79' '
