     A*%%TS  SD  20010326  142538  AMD         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BFRF BFRFR)
     A                                      PRINT
     A*
     A          R B1SFL                     SFL
     A*%%TS  SD  20010326  142538  AMD         REL-V4R4M0  5769-PW1
     A            B1VALG    R        B  5  1REFFLD(BÅVALA)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      VALUES(' ' '1' '5')
     A            B1NUMM    R        O  5  3REFFLD(BOORNR)
6.NU A            B1SUFF    R        O  5 12REFFLD(BOORSU)
6.NU A            B1OTYP    R        O  5 16REFFLD(BOOTYP)
6.NU A            B1KUNA        23A  O  5 19TEXT('Kunde-alfa')
     A            B1NAVN    R        O  5 43REFFLD(BONAVN)
     A*
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20010326  142538  AMD         REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CF03
     A                                      CF05
     A                                      KEEP
     A                                      OVERLAY
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A                                  1  1'1=Hente'
     A                                      COLOR(BLU)
     A                                  1 11'5=Vise'
     A                                      COLOR(BLU)
6.30 A*                                 1 27'F1=Valg'
6.30 A*                                     COLOR(BLU)
6.30 A*                                 1 37'F3=Gå tilbake'
6.30 A*                                     COLOR(BLU)
     A                                  3  1'V'
     A                                      COLOR(WHT)
     A                                  3  4'Ordre'
     A                                      COLOR(WHT)
6.NU A                                  3 12'Su'
     A                                      COLOR(WHT)
6.NU A                                  3 16'OT'
     A                                      COLOR(WHT)
6.NU A                                  3 19'Kundenavn/Alfasøk'
     A                                      COLOR(WHT)
     A                                  3 43'Vareadresse'
     A                                      COLOR(WHT)
     A            B2NUMM    R        B  4  3REFFLD(BOORNR)
     A                                      DLTCHK
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
6.NU A            B2KUNA        20A  B  4 19COLOR(YLW)
     A            B2NAVN    R        B  4 43REFFLD(BONAVN)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A*
     A          R B2CMD
     A*%%TS  SD  19950613  130758  ASP         REL-V2R3M0  5738-PW1
     A                                      WINDOW(4 2 15 74)
     A                                      CF12
     A                                      OVERLAY
6.30 A                                 14  2'F1=Valg'
6.30 A                                      COLOR(BLU)
6.30 A                                 14 10'F3=Gå tilbake'
6.30 A                                      COLOR(BLU)
     A          R H1BLD
     A*%%TS  SD  19950613  090809  ASP         REL-V2R3M0  5738-PW1
     A                                      CF03
     A                                      PUTOVR
     A                                      WINDOW(*DFT 10 38)
     A                                  2  2'Bla alternativer'
     A                                      COLOR(BLU)
     A                                  4  2'Ordre-type'
     A            H1OTYP    R        B  4 14REFFLD(BOOTYP)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  4 24'Blank gir alle'
     A                                  5  2'Kunde-nr'
     A            H1KUND    R        B  5 14REFFLD(BOKUND)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  7  2'Bla bakfra'
     A            H1VALG    R        B  7 14REFFLD(BÅVALA)
     A                                      OVRDTA
     A                                      VALUES(' ' '1')
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A                                  7 24'Gjelder blaing'
     A                                  8 24'i ordrenummer'
     A                                  9  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
