     A*%%TS  SD  20041026  092014  AMD         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BFRF BFRFR)
     A                                      PRINT
     A*
     A          R B1SFL                     SFL
     A*%%TS  SD  20010323  151105  AMD         REL-V4R4M0  5769-PW1
     A            B1AARR    R        H      REFFLD(BOAARR)
     A            B1VALG    R        B  5  1REFFLD(BÅVALA)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1' '5' '6')
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A            B1WSID    R        O  5  3REFFLD(BNWSID)
     A            B1NUMM    R        O  5 14REFFLD(BOBONG)
     A            B1OTYP    R        O  5 27REFFLD(BNOTYP)
     A            B1KUNA    R   -5   O  5 30REFFLD(BNKUNA)
     A            B1NAVN    R  -11   O  5 56REFFLD(BNNAVN)
     A*
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20010323  152726  AMD         REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0010)
     A                                      SFLPAG(0009)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CF03
     A                                      CF05
     A                                      KEEP
     A                                      OVERLAY
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A                                  1  1'1=Hente'
     A                                      COLOR(BLU)
     A                                  1 11'5=Vise'
     A                                      COLOR(BLU)
     A                                  1 20'6=Skriv ut'
     A                                      COLOR(BLU)
     A                                  1 37'F1=Valg'
     A                                      COLOR(BLU)
     A                                  1 47'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            B2AARR    R        O  1 64REFFLD(BOAARR)
     A            B2WSID    R        O  2 64REFFLD(BOWSID)
     A                                  3  1'V'
     A                                      COLOR(WHT)
     A                                  3  3'Kasse'
     A                                      COLOR(WHT)
     A                                  3 14'Bongnr'
     A                                      COLOR(WHT)
     A                                  3 30'Navn'
     A                                      COLOR(WHT)
     A                                  3 56'Vareadresse'
     A                                      COLOR(WHT)
     A            B2WSI2    R        B  4  3REFFLD(BOWSID)
     A                                      COLOR(YLW)
     A            B2NUMM    R        B  4 14REFFLD(BOBONG)
     A                                      DLTCHK
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A            B2KUNA        20A  B  4 30COLOR(YLW)
     A            B2NAVN        14A  B  4 56COLOR(YLW)
     A                                      CHECK(LC)
     A*
     A          R B2CMD
     A*%%TS  SD  20010323  100706  AMD         REL-V4R4M0  5769-PW1
     A                                      WINDOW(4 2 15 74)
     A                                      CF12
     A                                      OVERLAY
     A          R H1BLD
     A*%%TS  SD  19950613  085923  ASP         REL-V2R3M0  5738-PW1
     A                                      WINDOW(*DFT 11 40)
     A                                      CF03
     A                                      PUTOVR
     A                                  2  2'Bla alternativer'
     A                                      COLOR(BLU)
     A                                  4  2'År . . . . .'
     A            H1AARR    R        B  4 16REFFLD(BNAARR)
     A                                      COLOR(YLW)
     A                                  5  2'Skjerm/kasse'
     A            H1WSID    R        B  5 16REFFLD(BOWSID)
     A                                      COLOR(YLW)
     A                                  7  2'Ordre-type .'
     A            H1OTYP    R        B  7 16REFFLD(BNOTYP)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 24'Blank gir alle'
     A                                  8  2'Bla bakfra'
     A            H1VALG    R        B  8 16REFFLD(BÅVALA)
     A                                      OVRDTA
     A                                      VALUES(' ' '1')
     A                                      CHKMSGID(BM00010 *LIBL/QMFSHOP)
     A                                      COLOR(YLW)
     A                                  8 24'Gjelder blaing'
     A                                  9 24'i bong-nummer'
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
     A          R M1WIN
     A*%%TS  SD  20041026  092014  AMD         REL-V5R2M0  5722-WDS
     A                                      WINDOW(&W_AROW &W_ACOL 10 54)
     A                                      CF03
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Melding : '
     A                                      DSPATR(RI)
     A            M1MLD1    R        O  4  2REFFLD(BÅMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            M1MLD2    R        O  5  2REFFLD(BÅMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  2'Svar ja for OK, nei for ikke OK. .-
     A                                       . .'
     A            M1SVAR    R        B  7 43REFFLD(BÅSVAR)
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      COLOR(YLW)
     A                                  7 47'J/N'
     A                                  9  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
