     A*%%TS  SD  19950613  092149  ASP         REL-V2R3M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BFRF BFRFR)
     A                                      PRINT
     A                                      HELP
     A          R C1BLD
     A*%%TS  SD  19950324  143817  ASP         REL-V2R3M0  5738-PW1
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 65'Dato:'
     A                                      COLOR(WHT)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 30'Informasjon til Bruker'
     A                                      COLOR(WHT)
     A                                  2 65'KL..:'
     A                                      COLOR(WHT)
     A                                  2 72TIME
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Firma. . . . . . . . . . . . .'
     A            C1AFIR    R        O  4 33REFFLD(BAAFIR)
     A            C1FNAV        30A  O  4 37
     A                                 10 10'Meldinger :'
     A            C1MLD1        50A  O 10 26COLOR(RED)
     A            C1MLD2        50A  O 11 26COLOR(RED)
     A            C1MLD3        50A  O 12 26COLOR(RED)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
