     A*%%TS  SD  20180223  120307  G0XEGASSKO  REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LM19
     A* Beskrivelse . . : Bestilling/Innkjøp
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20180223  120307  G0XEGASSKO  REL-V7R1M0  5770-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'SETUP for spesial løsninger'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  4'Filoverføringer Ehandel'
     A                                      COLOR(WHT)
     A                                  6  4'1. Overføre proffhandel filer'
     A                                 20 27'90. Gå ut av systemet'
     A                                 21 30'Valg:'
     A            VALG           2Y 0B 21 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23 18'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 31'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 47'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                  5 44'Leverandørprtal vedlikehold'
     A                                      COLOR(WHT)
     A                                  6 44'10. Overordnet kundeklasifisering'
     A                                  7 44'11. Nobbekategorisering leverandør-
     A                                      er'
     A                                 15 44'Generere tabeller'
     A                                      COLOR(WHT)
     A                                 16 44'20. SQL definerte tabeller'
     A                                 17 44'21. Øvrige tabeller'
     A                                 12  4'Tilbudslogging '
     A                                      COLOR(WHT)
     A                                 13  4'6. Vedlikehold Slettekoder'
     A                                 14  4'7. Vedlikehold Konk.koder'
     A  41                             15  4'8. Generere    Slettekoder'
     A  41                             16  4'9. Generere Konkurentkoder'
     A  41                             17  3'16. Generere Loggfil tilbud'
     A                                  8 44'12. Vedlikehold av tilgangskoder'
