     A*%%TS  SD  20110627  085646  SSTASP      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/IFRF IFRFR)
     A                                      HOME(21)
     A                                      CA03(03 'F3=GÅ TILBAKE')
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '        '))
     A          R K1WIN
     A*%%TS  SD  20110627  085646  SSTASP      REL-V7R1M0  5770-WDS
     A                                      WINDOW(3 7 17 40)
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                 16  2'F3=Avbryt kjøring'
     A                                      COLOR(BLU)
     A                                  2  2'Styre behandling Compello integras-
     A                                      jon'
     A                                      DSPATR(RI)
     A            T1            25A  O  4  3COLOR(YLW)
     A            P1             1A  B  4 30OVRDTA
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                      CHKMSGID(JAN0003 *LIBL/QMFSERV)
     A                                  4 33'(J/ )'
     A            T2            25A  O  5  3COLOR(YLW)
     A            P2             1A  B  5 30OVRDTA
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                      CHKMSGID(JAN0003 *LIBL/QMFSERV)
     A                                  5 33'(J/ )'
     A            T3            25A  O  6  3COLOR(YLW)
     A            P3             1A  B  6 30OVRDTA
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                      CHKMSGID(JAN0003 *LIBL/QMFSERV)
     A                                  6 33'(J/ )'
     A            T4            25A  O  7  3COLOR(YLW)
     A            P4             1A  B  7 30OVRDTA
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                      CHKMSGID(JAN0003 *LIBL/QMFSERV)
     A                                  7 33'(J/ )'
     A            T5            25A  O  8  3COLOR(YLW)
     A            P5             1A  B  8 30OVRDTA
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                      CHKMSGID(JAN0003 *LIBL/QMFSERV)
     A                                  8 33'(J/ )'
     A            T6            25A  O  9  3COLOR(YLW)
     A            P6             1A  B  9 30OVRDTA
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                      CHKMSGID(JAN0003 *LIBL/QMFSERV)
     A                                  9 33'(J/ )'
     A            T7            25A  O 10  3COLOR(YLW)
     A            P7             1A  B 10 30OVRDTA
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                      CHKMSGID(JAN0003 *LIBL/QMFSERV)
     A                                 10 33'(J/ )'
     A            T8            25A  O 11  3COLOR(YLW)
     A            P8             1A  B 11 30OVRDTA
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                      CHKMSGID(JAN0003 *LIBL/QMFSERV)
     A                                 11 33'(J/ )'
     A            MELD          20A  O 15  3OVRDTA
     A  43                                  DSPATR(ND)
     A  44                                  DSPATR(RI)
     A                                 12  3'IP-adr. Comp.server'
     A                                 13  3'Port på Comp.Server'
     A            IP            15A  B 12 23OVRDTA
     A                                      COLOR(YLW)
     A            PORT           4A  B 13 23OVRDTA
     A                                      COLOR(YLW)
     A                                 14  3'Bilkod fra-til * 4:'
     A            BILKOD        16A  B 14 23OVRDTA
     A                                      COLOR(YLW)
     A          R S2WIN
     A*%%TS  SD  19990322  213748  BOF         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 17 40)
     A          R ASUME
     A*%%TS  SD  19980123  101059  MWE         REL-V3R7M0  5716-PW1
     A                                      ASSUME
     A                                 24 79' '
