     A*%%TS  SD  20120111  160110  ASK610      REL-V7R1M0  5770-WDS
     A*
6.3x A*  6.30 100118 bsa  Innfører omkjøring av bestillinger
     A*
     A*
     A*
     A*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20120111  160110  ASK610      REL-V7R1M0  5770-WDS
     A                                      CA03(03)
     A                                      KEEP
     A                                      PUTOVR
     A                                  2  2'Omkjøring EDI    Filgruppe:'
     A                                      COLOR(WHT)
     A            A1FIGR         3A  O  2 30COLOR(WHT)
     A                                      OVRDTA
     A            A1FIRM        30A  O  2 34COLOR(WHT)
     A                                      OVRDTA
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  7  2'Meldingstype . . . . . . . .'
     A            A1MELD         4A  B  7 31COLOR(YLW)
     A                                      OVRDTA
6.3x A                                  7 43'(BEST/OBKR/FAKT)'
     A                                  9  2'Dato . . . . . . . . . . . .'
     A            A1DATE         6Y 0B  9 31COLOR(YLW)
     A                                      CHECK(RZ)
     A                                      OVRDTA
     A                                  9 43'(DDMMÅÅ)'
     A                                 11  2'Tid  . . . . . . . . . . . .'
     A            A1TIME         6Y 0B 11 31COLOR(YLW)
     A                                      OVRDTA
     A                                 11 43'(HHMMSS - Blank gir alle)'
6.3x A                                 13  2'Dokumentnummer . . . . . . .'
     A            A1DOKN        12A  B 13 31COLOR(YLW)
     A                                      OVRDTA
6.3x A                                 13 45'(bestnr/faknr/obkrnr)'
6.3x A                                 14  2'Ta med alle fom. dokument. .'
     A            A1REST         1Y 0B 14 31COLOR(YLW)
     A                                      OVRDTA
     A                                 14 43'Tar med alle fom. angitt dokumentn-
     A                                      r'
6.3x A                                 17  2'Skrive til kopifil (_ASP). .'
6.3x A            A1ARFI         1Y 0B 17 31COLOR(YLW)
     A                                      OVRDTA
6.3x A                                 17 36'(1=Ja)'
6.3x A                                 17 43'Bygger en arbeidsfil _ASP'
6.3x A                                 18  2'Starte oppdatering direkte .'
6.3x A            A1STJO         1Y 0B 18 31COLOR(YLW)
     A                                      OVRDTA
6.3x A                                 18 36'(1=Ja)'
6.3x A                                 18 43'Starter LI701R, LI703R eller LI704-
6.3x A                                      R'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
