     A*%%TS  SD  20100304  103548  ASP_A04     REL-V6R1M0  5761-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : EK110D
     A* Beskrivelse . . : Bonusgruppe , vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       030310 BOF  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20100304  103548  ASP_A04     REL-V6R1M0  5761-WDS
     A            B1VALG    R        B  8  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A                                      CHKMSGID(MM00010 *LIBL/QMFOFAK)
     A            B1MERK    R        O  8  5REFFLD(FÅPRAN)
     A            B1PROS         3  1O  8 48EDTCDE(M)
     A            B1BESK    R        O  8 11REFFLD(FÅBESK)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20100303  134524  ASP_A04     REL-V6R1M0  5761-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CF08
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av Bonusgruppe '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'År :'
     A                                      COLOR(WHT)
     A            B2AARR    R        O  4  7REFFLD(FNAARR)
     A                                      OVRDTA
     A                                      COLOR(WHT)
     A                                  5  2'2=Endre  3=Kopier  4=Slett  5=Vis'
     A                                      COLOR(BLU)
     A                                  6  2'V  B.grp    Beskrivelse'
     A                                      COLOR(WHT)
     A            B2MERK    R        B  7  5REFFLD(FÅPRAN)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B2BESK    R        B  7 11REFFLD(FÅBESK)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20010919  105848  HKO         REL-V4R4M0  5769-PW1
     A                                 23  2'F1=BlaAlt  F3=Gå tilbake  F5=Forny-
     A                                         F6=Opprett  F8=Oppdater kunde'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20020219  115427  HKO         REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av prosentsatser'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'År   . . . . . . . . . . . .'
     A            C1AARR    R        O  5 31REFFLD(FÅKKAT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Bonusgruppe  . . . . . . . .'
     A            C1MERK    R        B  6 31REFFLD(FÅPRAN)
     A  31                                  ERRMSGID(FMX0100 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  19990316  082956  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Bonusgruppe  finnes fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20100303  134524  ASP_A04     REL-V6R1M0  5761-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av Bonusgruppe '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'År . . . . . . . . . . . . .'
     A            C1AARR    R        O  5 31REFFLD(FÅKKAT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Bonusgruppe  . . . . . . . .'
     A            C1MERK    R        O  6 31REFFLD(FÅPRAN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Beskrivelse. . . . . . . . .'
     A            C2BESK    R        B  7 31REFFLD(FÅBESK)
     A  31                                  ERRMSGID(VMA6100 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  9  2'Prosentsats  . . . . . . . .'
     A            C2PROS         3Y 1B  9 31EDTCDE(L)
     A  30                                  DSPATR(PR)
     A  32                                  ERRMSGID(FMX0100 *LIBL/QMFOFAK 33)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 18  2'Opprettet dato . . . . . . .'
     A            C2ODAT         6Y 0O 18 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 19  2'Sist endret dato . . . . . .'
     A            C2EDAT         6Y 0O 19 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20  2'Endret av. . . . . . . . . .'
     A            C2EUSR    R        O 20 31REFFLD(FÅEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  19990316  082956  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette Bonusgruppe  '
     A                                      DSPATR(RI)
     A                                  4  2'År . . . . . . . .'
     A            D1AARR    R        O  4 21REFFLD(FÅKKAT)
     A                                  5  2'Bonusgruppe  . . .'
     A            D1MERK    R        O  5 21REFFLD(FÅPRAN)
     A                                  6  2'Beskrivelse. . . .'
     A            FÅBESK    R        O  6 21
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  19990316  082956  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'År . . . . . . . .'
     A            K1AARR    R        O  4 21REFFLD(FÅKKAT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Bonusgruppe  . . .'
     A            K1MERK    R        B  5 21REFFLD(FÅPRAN)
     A  31                                  ERRMSGID(FMX0100 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(MMR0030 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  6  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  8  2'År . . . . . . . .'
     A            EPAARR    R        O  8 21REFFLD(FÅKKAT)
     A                                      OVRDTA
     A                                  9  2'Bonusgruppe  . . .'
     A            EPMERK    R        O  9 21REFFLD(FÅPRAN)
     A                                      OVRDTA
     A                                 10  2'Beskrivelse. . . .'
     A            EPBESK    R        O 10 21REFFLD(FÅBESK)
     A                                      OVRDTA
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R H1WIN
     A*%%TS  SD  20100303  142229  ASP_A04     REL-V6R1M0  5761-WDS
     A                                      WINDOW(*DFT 14 50)
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A                                      PUTOVR
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  2  2'Bla alternativer'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4  2'Velg Års-tall .:'
     A            H1AARR    R        B  4 19REFFLD(FNAARR)
     A                                      DLTCHK
     A  31                                  ERRMSGID(FMO0300 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(EMK0300 *LIBL/QMFOFAK 32)
     A                                      OVRDTA
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R M1WIN
     A*%%TS  SD  20100304  101309  ASP_A04     REL-V6R1M0  5761-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A                                      PUTOVR
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  3  2'Oppdater kunder'
     A                                      COLOR(WHT)
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
