     A*%%TS  SD  20110907  144013  BSA620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R P1WIN
     A*%%TS  SD  20110907  144013  BSA620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      WINDOW(*DFT 18 73)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Generer bonusordre '
     A                                      DSPATR(RI)
     A                                  4  2'Bonustype. .:'
     A            P1KBOT         2A  B  4 17COLOR(YLW)
     A  31                                  ERRMSG('Ugyldig bonustype')
     A                                      OVRDTA
     A            P1KBTX        30A  O  4 26
     A                                      OVRDTA
     A                                  5  2'Periode. . .:'
     A            P1KFRA         4A  B  5 17COLOR(YLW)
     A  33                                  ERRMSG('Ugyldig periode')
     A  35                                  ERRMSG('Fra periode større enn til +
     A                                            periode')
     A                                  5 22'-'
     A            P1KTIL         4A  B  5 24COLOR(YLW)
     A  33                                  ERRMSG('Ugyldig periode')
     A                                  6  2'Ordretype. .:'
     A            P1KOTY         2A  B  6 17COLOR(YLW)
     A  32                                  ERRMSG('Feil i ordretype')
     A                                      OVRDTA
     A            P1KOTX        30A  O  6 26
     A                                      OVRDTA
     A                                  7  2'Varenummer .:'
     A            P1KVAR         8A  B  7 17COLOR(YLW)
     A  34                                  ERRMSG('Ugyldig varenummer')
     A                                      OVRDTA
     A            P1KVTX        35A  O  7 26
     A                                      OVRDTA
     A                                  9  2'Legg inn tekst'
     A                                      COLOR(WHT)
     A            P1KTX1        70A  B 10  2COLOR(YLW)
     A                                      CHECK(LC)
     A            P1KTX2        70A  B 11  2COLOR(YLW)
     A                                      CHECK(LC)
     A            P1KTX3        70A  B 12  2COLOR(YLW)
     A                                      CHECK(LC)
     A            P1KTX4        70A  B 13  2COLOR(YLW)
     A                                      CHECK(LC)
      *
     A                                 15 10'Jobben legges på jobbkø'
      *
     A                                 17  2'F3=Gå tilbake    F4=Spørre'
     A                                      COLOR(BLU)
