     A*%%TS  SD  20110907  144013  BSA620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R P1WIN
     A*%%TS  SD  20110907  144013  BSA620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      PUTOVR
     A                                      WINDOW(5 15 11 50)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Beregn betalingsbonus '
     A                                      DSPATR(RI)
     A                                  4  2'Bonusår:'
     A            P1PAAR         4A  B  4 11COLOR(YLW)
     A  31                                  ERRMSGID(EMK0300 *LIBL/QMFOFAK 31)
     A                                  4 18'Bonustype:'
     A                                  4 32'(Oppdateres)'
     A            P1TBOT         2A  B  4 29DSPATR(UL)
     A  34                                  ERRMSG('Bonustype kan ikke være bla-
     A                                      nk !')
     A  35                                  ERRMSG('Bonustype er ikke en betali-
     A                                      ngsbonus !')
     A                                      COLOR(YLW)
     A                                  6  2'Beregning '
     A            P1ALT1         1A  B  6 13COLOR(YLW)
     A  32                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 32)
     A                                  6 15'(0=Nei,1=Ja)'
     A                                  7  2'Kvit.liste'
     A            P1ALT2         1A  B  7 13COLOR(YLW)
     A  33                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 33)
     A                                  7 15'(0=Nei,1=Ja)'
     A                                 10  3'F3=Gå tilbake  F4=Spørring'
     A                                      COLOR(BLU)
