     A*%%TS  SD  20110907  144013  BSA620      REL-V7R1M0  5770-WDS
     A*%%EC
     A*
7.xx A* 7.xx  150316  bsa  Justeringer basert på ny GUI og regler
     A*---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R P1WIN
     A*%%TS  SD  20110907  144013  BSA620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      WINDOW(5 15 13 50)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Beregn bonus for alle '
     A                                      DSPATR(RI)
6.20 A                                  4  2'Bonusår.....:'
     A            P1PAAR         4A  B  4 16COLOR(YLW)
6.21 A  30                                  ERRMSGID(EMK0300 *LIBL/QMFOFAK 31)
6.21 A                                  4 21'Periode (fra-til):'
6.21 A            P0PERI         2A  B  4 40COLOR(YLW)
6.21 A                                      CHECK(RB)
6.21 A                                      OVRDTA
6.21 A                                  4 43'-'
6.21 A            P1PERI         2A  B  4 45COLOR(YLW)
6.20 A  30                                  ERRMSGID(EMK0300 *LIBL/QMFOFAK 31)
6.21 A  36                                  ERRMSG('Feil i periodene')
6.21 A                                      CHECK(RB)
6.21 A                                      OVRDTA
7.xx A                                  5  2'Bonustype...+'
6.20 A            P1TBOT         2A  B  5 16DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.20 A            P1TTXT        15A  O  5 35
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Beregning...:'
     A            P1ALT1         1A  B  6 16COLOR(YLW)
     A  32                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 32)
     A                                  6 19'0=Nei,1=Ja'
     A                                  7  2'Kontrolliste:'
     A            P1ALT2         1A  B  7 16COLOR(YLW)
     A  33                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 33)
     A                                  7 19'0=Nei,1=Ja'
     A*                                 8  2'Kundebrev...:'
     A*           P1ALT3         1A  B  8 16COLOR(YLW)
     A* 34                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 34)
     A*                                 8 19'0=Nei,1=Ja'
     A                                  8  2'Kundebrev...:'
     A                                  8 19'0=Nei,1=Ja'
     A            P1ALT3         1A  B  8 16COLOR(YLW)
     A  35                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 35)
     A**                                9  2'Ordretype...:'
     A**          P1OTYP         2A  B  9 16COLOR(YLW)
     A**                                9 19'Varenr:'
     A**          P1VARE         8A  B  9 27COLOR(YLW)
     A                                 10  2'Jobben startes som bakgrunnsjobb'
     A                                 12  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R P2WIN
     A*%%TS  SD  20110606  204019  ASK610      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 11 73)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Fast tekst til kreditnota'
     A                                      DSPATR(RI)
     A                                  4  2'Kjøredato:'
     A            P2PAAR         8A  B  4 13COLOR(YLW)
     A  31                                  ERRMSGID(EMK0300 *LIBL/QMFOFAK 31)
     A                                 10  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  4 22'(DDMMÅÅÅÅ)'
     A            P2TEK1        70A  B  6  2COLOR(YLW)
     A                                      CHECK(LC)
     A            P2TEK2        70A  B  7  2COLOR(YLW)
     A                                      CHECK(LC)
     A            P2TEK3        70A  B  8  2COLOR(YLW)
     A                                      CHECK(LC)
