     A*%%TS  SD  20170612  150705  SST630      REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : FA120D
     A* Beskrivelse . . : Jobbstatus
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
6.30 A* 6.30  150616 BSA  Status fore EDI lesing pågår.
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20170612  150705  SST630      REL-V7R1M0  5770-WDS
     A                                      CF01
     A                                      CA03
     A                                      CA12
     A                                      CLRL(*ALL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av jobb-register '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Sjekk-koder for igangsatte jobber -
     A                                      :'
     A                                      COLOR(BLU)
     A                                      DSPATR(UL)
     A                                  7  2'ASOFAK fakturering startet. . . . -
     A                                      .'
     A            A1JB01    R        B  7 38REFFLD(FAJB01)
     A                                      COLOR(YLW)
     A                                  7 46'1=Ja,0=Nei'
     A                                  8  2'ASOFAK overføring økonomi startet -
     A                                      .'
     A            A1JB02    R        B  8 38REFFLD(FAJB02)
     A                                      COLOR(YLW)
     A                                  8 46'1=Ja,0=Nei'
     A                                  9  2'ASSHOP avstemmingliste startet. . -
     A                                      .'
     A            A1JB03    R        B  9 38REFFLD(FAJB03)
     A                                      COLOR(YLW)
     A                                  9 46'1=Ja,0=Nei'
     A                                 10  2'ASSHOP overføring økonomi startet -
     A                                      .'
     A            A1JB04    R        B 10 38REFFLD(FAJB04)
     A                                      COLOR(YLW)
     A                                 10 46'1=Ja,0=Nei'
     A                                 11  2'ASLAGR inngående faktura startet  -
     A                                      .'
     A            A1JB05    R        B 11 38REFFLD(FAJB05)
     A                                      COLOR(YLW)
     A                                 11 46'1=Ja,0=Nei'
     A                                 12  2'ASLAGR overføring økonomi startet -
     A                                      .'
     A            A1JB06    R        B 12 38REFFLD(FAJB06)
     A                                      COLOR(YLW)
     A                                 12 46'1=Ja,0=Nei'
     A                                 13  2'ASLAGR hente EDI meldinger pågår  -
     A                                      .'
     A            A1JB07    R        B 13 38REFFLD(FAJB07)
     A                                      COLOR(YLW)
     A                                 13 46'1=Ja,0=Nei'
     A                                 14  2'ASOKON Posternger fra Compello Nav-
     A                                      .'
     A            A1JB08    R        B 14 38REFFLD(FAJB08)
     A                                      COLOR(YLW)
     A                                 14 46'1=Ja,0=Nei'
     A                                 15  2'Ledig . . . . . . . . . . . . . . -
     A                                      .'
     A            A1JB09    R        B 15 38REFFLD(FAJB09)
     A                                      COLOR(YLW)
     A                                 15 46'1=Ja,0=Nei'
     A                                 16  2'Ledig . . . . . . . . . . . . . . -
     A                                      .'
     A            A1JB10    R        B 16 38REFFLD(FAJB10)
     A                                      COLOR(YLW)
     A                                 16 46'1=Ja,0=Nei'
     A                                 23  2'F1=Vis tilleggsinformasjon   F3=Gå-
     A                                       tilbake'
     A                                      COLOR(BLU)
     A          R A2BLD
     A*%%TS  SD  20020312  151929  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(4 32 12 44)
     A                                      CA03
     A                                      KEEP
     A                                  2  2'Opplysning om hvem som har startet-
     A                                       jobben:'
     A                                      COLOR(WHT)
     A                                  4  2'Navn. . . :'
     A            A2BNAV        30A  O  4 14TEXT('Behandl. bruker')
     A                                  5  2'Bruker-id :'
     A            A2USER    R        O  5 14REFFLD(FAUS01)
     A                                  6  2'Skjerm-id :'
     A            A2WSID    R        O  6 14REFFLD(FAWS01)
     A                                  8  2'Dato. . . :'
     A            A2DATE         6Y 0O  8 14EDTWRD('  .  .  ')
     A                                  9  2'Klokken . :'
     A            A2TIME         6Y 0O  9 14EDTWRD('  :  :  ')
     A            A2DUMY         1A  B 10 26DSPATR(ND)
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
