     A*%%TS  SD  20020312  180244  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20020312  180244  HKO         REL-V5R1M0  5722-WDS
     A                                      CA03(03)
     A                                      CA12(12)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Danne nødvendige koder'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6  2'Skal koder erstattes . . . .'
     A            A1VALG         1A  B  6 31VALUES(' ' '1')
     A                                      COLOR(YLW)
     A                                  6 44'1=Ja,0=Nei'
     A                                  8  2'Tilbudskundenummer . . . . .'
     A            A1KUND         6Y 0B  8 31EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                  8 44'Oppgi kundenummer her som skal'
     A                                  9 44'legges inn i statuskode-register'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
