     A*%%TS  SD  20080313  100004  AMD550      REL-V5R4M0  5722-WDS
     A*
6.30 A*     BSA  20140806  Omskrevet for å redusere bilder og taste-
6.30 A*                    trykk.
6.31 A*     BSA  20140808  Innført sjekk mot origo via F-tast
6.32 A*     BSA  20140811  Utvider kontrollre mot kortkode og F-tast
7.xx A*     BSA  210116    Endringer relatert til ny GUI
     A*----------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
7.xx A*                                     HOME(21)
     A          R F1WIN
     A*%%TS  SD  20060310  102918  HKO550      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Avslutning av ordre TEST'
     A                                      DSPATR(RI)
     A  77                              4  2'Til bestilling. .'
     A  77        F1BEST         1Y 0B  4 20COLOR(YLW)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      VALUES(0 1)
     A N77                                  DSPATR(PR)
     A N77                                  DSPATR(ND)
     A                                      OVRDTA
     A  77                              4 23'1=Ja,0=Nei'
     A                                  6  2'Velg behandling .'
7.xx A            F1VALG         1A  B  6 20COLOR(YLW)
     A  31                                  ERRMSGID(FM00010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FMO0050 *LIBL/QMFOFAK 32)
     A                                      OVRDTA
7.xx A                                  6 23'0=Oppdatering,'
7.xx A                                  7 23'1=Utskrift,'
     A                                  8 23'2=Utplukk'
     A  78                             10  2'Klar til plukking'
     A  78        F1PLUK         1Y 0B 10 20COLOR(YLW)
     A  33                                  ERRMSGID(VMA8200 *LIBL/QMFOFAK 33)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      VALUES(0 1)
     A N78                                  DSPATR(PR)
     A N78                                  DSPATR(ND)
     A                                      OVRDTA
     A  78                             10 23'1=Ja,0=Nei'
     A                                 22  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*

