     A*%%TS  SD  20041027  144005  ASK530      REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20041026  141000  ASK530      REL-V5R2M0  5722-WDS
     A            B1VALG    R        B 10  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 4)
     A  22                                  DSPATR(PC)
     A            B1PAKK    R        O 10  5REFFLD(FSPAKK)
     A            B1LENG    R        O 10 16REFFLD(FSLENG)
     A                                      EDTWRD('   0 , ')
     A            B1DELT         1   O 10 30
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20041026  143812  ASK530      REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA09
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  1  2'Registrering av pakker'
     A                                      DSPATR(RI)
     A                                      COLOR(GRN)
     A                                  3  2'Varenr.'
     A                                      COLOR(WHT)
     A            B2VARE         8Y 0O  3 10EDTCDE(Z)
     A                                      COLOR(YLW)
     A            B2VTXT        25A  O  3 20COLOR(WHT)
     A                                  5  4'Pakkenr.   Løpemeter       Tot. lø-
     A                                      pemeter'
     A                                      COLOR(WHT)
     A            B2PAKK    R        B  6  4REFFLD(FSPAKK)
     A  35                                  ERRMSGID(MMT0080 *LIBL/QMFLAGR 35)
     A  36                                  ERRMSGID(MMT0090 *LIBL/QMFLAGR 36)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A  30                                  DSPATR(PC)
     A            B2LENG    R        B  6 16REFFLD(FSLENG)
     A                                      EDTWRD('   0 , ')
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A  31                                  DSPATR(PR)
     A  32                                  DSPATR(PC)
     A            B2TOTL    R        O  6 35REFFLD(FSLENG)
     A                                      EDTWRD('   0 , ')
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  8  2'2=Endre'
     A                                      COLOR(BLU)
     A                                  8 10'4=Slett'
     A                                      COLOR(BLU)
     A                                  9  2'V Pakkenr    Løpemeter    Delt'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20041027  144005  ASK530      REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 22 45)
     A                                 21  2'F3=Gå tilbake  F5=Forny  F9=Pakkei-
     A                                      nfo'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
     A          R D1WIN
     A*%%TS  SD  20041005  100407  GRO530      REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 10 51)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette ordre/pakketrelinje  '
     A                                      DSPATR(RI)
     A                                  4  2'Ordrenr   Pakkenr       Lengde'
     A            D1NUMM    R        O  6  3REFFLD(FSNUMM)
     A                                      EDTCDE(Z)
     A            D1PAKK    R        O  6 13REFFLD(FSPAKK)
     A                                      EDTCDE(Z)
     A            D1LENG    R        O  6 25REFFLD(FSLENG)
     A                                      EDTWRD('   0 , ')
     A                                  9  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
