     A*%%TS  SD  20080501  205219  KOB560      REL-V5R4M0  5722-WDS
8.01 A*PGR2   080622 BOF  Utvidet prisgruppe fra 1 til 2 posisjoner
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20080501  205219  KOB560      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 22 75)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slettet ordrelinje '
     A                                      DSPATR(RI)
     A                                  5  2'Ordretype. .'
     A            B1OTYP    R        O  5 15REFFLD(FSOTYP)
     A                                      COLOR(YLW)
     A                                  4  2'Ordrenr. . .'
     A            B1NUMM    R        O  4 15REFFLD(FSNUMM)
     A                                      COLOR(YLW)
     A            B1SLDA         6Y 0O  5 41EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                  7  2'Varenr . . .'
     A            B1VARE    R   -7   O  7 15REFFLD(FSVARE)
     A                                      COLOR(YLW)
     A            B1TEK1    R        O  7 25REFFLD(FSTEK1)
     A                                      COLOR(YLW)
     A            B1TEK2    R        O  8 25REFFLD(FSTEK2)
     A                                      COLOR(YLW)
     A                                  9  2'Varegruppe .'
     A            B1OGRP    R        O  9 15REFFLD(FSOGRP)
     A                                      COLOR(YLW)
     A            B1HGRP    R        O  9 18REFFLD(FSHGRP)
     A                                      COLOR(YLW)
     A            B1UGRP    R        O  9 21REFFLD(FSUGRP)
     A                                      COLOR(YLW)
     A            B1UTXT        35A  O  9 25COLOR(YLW)
     A                                 10  2'Leverandør .'
     A            B1LDOR    R        O 10 15REFFLD(FSLDOR)
     A                                      COLOR(YLW)
     A            B1LNAV        35A  O 10 25COLOR(YLW)
     A                                 11  2'Lev.varenr..'
     A            B1LVAR    R        O 11 15REFFLD(FSLVAR)
     A                                      COLOR(YLW)
     A                                 12  2'Nobbnr . . .'
     A            B1NOBB    R        O 12 15REFFLD(FSNOBB)
     A                                      COLOR(YLW)
     A                                 11 37'GTIN-nr. '
     A            B1EANN    R        O 11 47REFFLD(VXEANN)
     A                                      COLOR(YLW)
     A                                 12 32'Prisgruppe . .'
     A            B1PRGR    R        O 12 47REFFLD(FSPRGR)
     A                                      COLOR(YLW)
     A                                 13  2'Modulnr. . .'
     A            B1NMOD    R        O 13 15REFFLD(VVNMOD)
     A                                      COLOR(YLW)
     A                                 13 52'Pr.enhet'
     A                                      COLOR(WHT)
     A                                 13 67'Totalt'
     A                                      COLOR(WHT)
     A                                 14  2'Antall . . .'
     A            B1ANTA    R        O 14 15REFFLD(FSANTA)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 14 31'Kostpris . . . . .'
     A            B1KOPR    R        O 14 50REFFLD(FSKOPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            B1SUMK    R        O 14 62REFFLD(FSSUMK)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 15  2'Enhet. . . .'
     A            B1ENH1    R        O 15 15REFFLD(FSENH1)
     A                                      COLOR(YLW)
     A                                 15 31'Salgspris (brutto)'
     A            B1SAPR    R        O 15 50REFFLD(FSSAPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            B1SUMS    R        O 15 62REFFLD(FSSUMS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 16  2'Priskode . .'
     A            B1KPRI    R        O 16 15REFFLD(FSKPRI)
     A                                      COLOR(YLW)
     A                                 16 31'Rabatt-1 . . . . .'
     A            B1RKR1    R        O 16 50REFFLD(FSSAPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            B1SRK1    R        O 16 62REFFLD(FSSUMS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 17  2'Lev.type . .'
     A            B1LETY    R        O 17 15REFFLD(FSLETY)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                 17 31'Rabatt-2 . . . . .'
     A            B1RKR2    R        O 17 50REFFLD(FSSAPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            B1SRK2    R        O 17 62REFFLD(FSSUMS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 18  2'Rabatt . . .'
     A            B1RAB1    R        O 18 15REFFLD(FSRAB1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            B1RAB2    R        O 18 23REFFLD(FSRAB2)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 18 31'Bruksrett rabatt-1'
     A            B1BKR1    R        O 18 50REFFLD(FSSAPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            B1SBK1    R        O 18 62REFFLD(FSSUMS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 19  2'Bruksr. rab.'
     A            B1BRR1    R        O 19 15REFFLD(FSBRR1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            B1BRR2    R        O 19 23REFFLD(FSBRR2)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 19 31'Bruksrett rabatt-2'
     A            B1BKR2    R        O 19 50REFFLD(FSSAPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            B1SBK2    R        O 19 62REFFLD(FSSUMS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 20  2'DG . . . . .'
     A            B1DEKN    R        O 20 15REFFLD(FSPASL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 20 31'Salgspris (netto).'
     A            B1NETT    R        O 20 50REFFLD(FSSAPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            B1SUMN    R        O 20 62REFFLD(FSSUMS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 21  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  2 25'Slettet av :'
     A                                  5 25'Dato . . . .'
     A                                  5 53'Kl.. . . .'
     A            B1SLUS    R        O  3 41REFFLD(FFRFR/FSSLUS *LIBL/FFRF)
     A                                      COLOR(YLW)
     A            FSSLTI    R        O  5 64COLOR(YLW)
     A            B1SLWS    R        O  4 41REFFLD(FFRFR/FSSLWS *LIBL/FFRF)
     A                                      COLOR(YLW)
     A            B1SPGM    R        O  3 64REFFLD(FFRFR/FSSPGM *LIBL/FFRF)
     A                                      COLOR(YLW)
     A                                  4 25'Arbeidsstasjon'
     A                                  3 25'Bruker. .'
     A                                  3 53'Program. .'
     A                                  5 38'.'
     A          R ASUME                     ASSUME
     A                                 24 79' '
