     A*%%TS  SD  20150427  121929  BOF630      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20150427  121929  BOF630      REL-V7R1M0  5770-WDS
     A                                      CA03(03)
     A                                      CA12(12)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppretting av database'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  4  3'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  6  8'V'
     A                                      COLOR(WHT)
     A                                  6 10'Navn  '
     A                                      COLOR(WHT)
     A                                  6 18'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  6 45'V'
     A                                      COLOR(WHT)
     A                                  6 47'Navn  '
     A                                      COLOR(WHT)
     A                                  6 54'Beskrivelse av file'
     A                                      COLOR(WHT)
     A            VA01           1A  B  7  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 10'NOHEPF'
     A                                  7 18'Ekstern ordre hode'
     A            VA11           1A  B  7 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 47'FPRNPF'
     A                                  7 54'Spesialpris notat'
     A            VA02           1A  B  8  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 10'NODTPF'
     A                                  8 18'Ekstern ordre linje'
     A            VA12           1A  B  8 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 47'VWB1PF'
     A                                  8 54'Arbeidsregister abcxyz'
     A            VA03           1A  B 10  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 10'NETKUND'
     A                                 10 18'Nettbut kundefil'
     A            VA13           1A  B 10 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 47'FMKAPF'
     A                                 10 54'Kort/faktura-avtale'
     A            VA04           1A  B 11  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 10'NETORES'
     A                                 11 18'Nettbut ordre kvittering'
     A            VA14           1A  B 11 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 47'FNCPPF'
     A                                 11 54'ClearPark-faktura (wrk)'
     A            VA05           1A  B 12  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12 10'NETVARE'
     A                                 12 18'Nettbut varefil'
     A            VA15           1A  B 12 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12 47'FNTRPF'
     A                                 12 54'Kort/fakt-trans-register'
     A            VA18           1A  B 13 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A            VA20           1A  B 13  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13 10'NETLIST'
     A                                 13 18'Nettbut Handleliste'
     A                                 13 47'FNLGPF'
     A                                 13 54'Arbeidsfil for Logiq    '
     A            VA09           1A  B 14  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14 10'NETPRIS'
     A                                 14 18'Nettbut Eksport prisfil'
     A            VA19           1A  B 14 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14 47'FNUFPF'
     A                                 14 54'Fakturalogg utg faktura '
     A            VA06           1A  B 16  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 16 10'NKEOPF '
     A                                 16 18'Ekstern ordre, kodereg'
     A            VA16           1A  B 16 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 16 47'FSPSPF'
     A                                 16 54'Pakke-spes linje'
     A            VA07           1A  B 17  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 17 10'NWEBPF '
     A                                 17 18'Inngående EDI bestilling'
     A            VA17           1A  B 17 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 17 47'FVLSPF'
     A                                 17 54'Lengde-spes linje'
     A            VA21           1A  B 18 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 18 47'VLWWPF'
     A                                 18 54'Loggfile VL001R  '
     A            VA08           1A  B 18  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 18 10'NXMLPF '
     A                                 18 18'Arbeidsfil XML-meldinger'
     A            VA22           1A  B 19 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 19 47'FSMSPF'
     A                                 19 54'Kobling SMS/Fors.småte'
     A                                 20 10'Oppgi file-gruppe . . . . . . :'
     A            FGRP           3A  B 20 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      DFTVAL('XXX')
     A                                      COLOR(YLW)
     A                                 21 10'Skal register(e) nullstilles. :'
     A            NULL           1A  B 21 43VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 21 47'(S=Slette innhold i register)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
