     A*%%TS  SD  20130730  082050  BOF620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20130730  082050  BOF620      REL-V7R1M0  5770-WDS
     A                                      CA03(03)
     A                                      CA12(12)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppretting av database'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  4  3'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  6  8'V'
     A                                      COLOR(WHT)
     A                                  6 10'Navn  '
     A                                      COLOR(WHT)
     A                                  6 18'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  6 45'V'
     A                                      COLOR(WHT)
     A                                  6 47'Navn  '
     A                                      COLOR(WHT)
     A                                  6 55'Beskrivelse av file'
     A                                      COLOR(WHT)
     A            VA01           1A  B  7  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 10'FIPXPF'
     A                                  7 18'Vare/prisfil for eksport'
     A            VA11           1A  B  7 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 47'VBOTPF'
     A                                  7 55'Bonustype          '
     A            VA02           1A  B  8  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 10'FMFTPF'
     A                                  8 18'Fakturatype        '
     A            VA12           1A  B  8 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 47'VPLAPF'
     A                                  8 55'Vareplakat'
     A            VA03           1A  B 10  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 10'FNAUPF '
     A                                 10 18'Arbeidsfil Autofakt 1'
     A            VA13           1A  B 10 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 47'SDEPPF'
     A                                 10 55'Depositum-fil'
     A            VA04           1A  B 11  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 10'FNAXPF '
     A                                 11 18'Arbeidsfil Autofakt 2'
     A            VA14           1A  B 11 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 47'VSPRPF'
     A                                 11 55'Språktekster '
     A            VA05           1A  B 12  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12 10'FNECPF '
     A                                 12 18'Arbeidsfil eCards'
     A            VA15           1A  B 12 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12 47'FBDOPF'
     A                                 12 55'ByggDok Innsamling'
     A            VA09           1A  B 13  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13 10'FNEDPF '
     A                                 13 18'Arbeidsfil EDI'
     A            VA16           1A  B 13 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13 47'VOT1PF'
     A                                 13 55'Midl.Ordretype. Oppslag '
     A            VA06           1A  B 14  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14 10'FNEFPF '
     A                                 14 18'Arbeidsfil eFaktura'
     A            VA07           1A  B 15  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 15 10'FNEMPF '
     A                                 15 18'Arbeidsfil eMail'
     A            VA17           1A  B 15 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 15 47'EPPSPF'
     A                                 15 55'Prosentsatser pr. år    '
     A            VA10           1A  B 16  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 16 10'FNEPPF '
     A                                 16 18'Arbeidsfil ePrint'
     A            VA18           1A  B 16 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 16 47'FKPXPF'
     A                                 16 55'Kundeprosjekt %ytelse   '
     A            VA08           1A  B 17  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 17 10'FWFAPF '
     A                                 17 18'Arbeidsfil fakturaprod.'
     A            VA19           1A  B 17 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A            VA20           1A  B 18  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 18 10'VWEXPF '
     A                                 18 18'Arbeidsfil fra XLS.'
     A                                 17 47'FSMSPF'
     A                                 17 55'Sms register            '
     A                                 20 10'Oppgi file-gruppe . . . . . . :'
     A            FGRP           3A  B 20 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      DFTVAL('XXX')
     A                                      COLOR(YLW)
     A                                 21 10'Skal register(e) nullstilles. :'
     A            NULL           1A  B 21 43VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 21 47'(S=Slette innhold i register)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
