     A*%%TS  SD  20080616  142616  AMD560      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R C2BLD
     A*%%TS  SD  20080616  142616  AMD560      REL-V5R4M0  5722-WDS
     A                                      CA03
6.30 A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise kundeprosjekt'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Kunde. . . . .'
     A            C2KUND    R        O  4 17REFFLD(FLKUND)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KNAV        30A  O  4 24COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Prosjektnummer'
     A            C2KPRO    R        O  5 17REFFLD(FLKPRO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Periode. . . .'
     A            C2FDAT         6Y 0O  6 17COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                  6 26'-'
     A            C2TDAT         6Y 0O  6 28COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                  7  2'Selger . . . .'
     A            C2SELG    R        O  7 17REFFLD(FLSELG)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2SNAV        20A  O  7 22COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Navn . . . . .'
     A            C2NAVN    R        O  8 17REFFLD(FLNAVN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8 49'Ekst. prosjektnr'
     A            C2EPRO    R        O  8 66REFFLD(FLEPRO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Adresse 1. . .'
     A            C2ADR1    R        O  9 17REFFLD(FLADR1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9 49'ByggDok  . . . .'
     A            C2BDOK    R        O  9 66REFFLD(FLBDOK)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Adresse 2. . .'
     A            C2ADR2    R        O 10 17REFFLD(FLADR2)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 11  2'Postnummer . .'
     A            C2PONR    R        O 11 17REFFLD(FLPONR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2STED        25A  O 11 22COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Kontaktperson.'
     A            C2KPRS    R        O 12 17REFFLD(FLKPRS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12 49'Tlf. arbeid. . .'
     A            C2TLFA    R        O 12 66REFFLD(FLTLFA)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13  2'Mobiltelefon .'
     A            C2TLFM    R        O 13 17REFFLD(FLTLFM)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13 49'Tlf. privat. . .'
     A            C2TLFP    R        O 13 66REFFLD(FLTLFP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14  2'E-mail adresse'
     A            C2MAIL    R        O 14 17REFFLD(FLMAIL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 15  2'Prosjnr. regn.'
     A            C2PROJ    R        O 15 17REFFLD(FLPROJ)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2PTXT        30A  O 15 24COLOR(YLW)
     A                                      OVRDTA
     A                                 16  2'Bonuskunde . .'
     A            C2BOKU    R        O 16 17REFFLD(FLBOKU)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2BOKN        30A  O 16 24COLOR(YLW)
     A                                      OVRDTA
     A                                 17  2'Privatkjøp . .'
     A            C2PRIV    R        O 17 17REFFLD(FLPRIV)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 17 20'1=Ja,0=Nei'
     A                                 17 49'Fakturatype. . .'
     A            C2FATY    R        O 17 66REFFLD(FLFATY)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                 18  2'Overstyringer for prisberegning:'
     A                                      COLOR(WHT)
     A                                 18 49'Prisdato . . . .'
     A            C2OPDA         6Y 0O 18 66COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 19  2'Rabattkategori'
     A            C2ORKA    R        O 19 17REFFLD(FLORKA)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2ORTX        30A  O 19 24COLOR(YLW)
     A                                      OVRDTA
     A                                 20  2'Kunde. . . . .'
     A            C2OKUN    R        O 20 17REFFLD(FLOKUN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OKNA        30A  O 20 24COLOR(YLW)
     A                                      OVRDTA
     A                                 21  2'Prosjektnummer'
     A            C2OKPR    R        O 21 17REFFLD(FLOKPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OPNA    R        O 21 24REFFLD(FLNAVN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 22  2'Kjørerute  . .'
     A            C2KJOR    R        O 22 17REFFLD(FLKJOR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            C2KJNA    R        O 22 24REFFLD(FLNAVN)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                 22 56'Rekkefølge . .'
     A            C2KJNR    R        O 22 71REFFLD(FLKJNR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake  F6=Flere koder'
     A                                      COLOR(BLU)
     A            C2ODAT         6Y 0O 23 49COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 58'/'
     A            C2EDAT         6Y 0O 23 60COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 69'/'
     A            C2EUSR    R        O 23 71REFFLD(FLEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A          R F2WIN
     A*%%TS  SD  20080406  105115  KOB560      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 17 65)
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      PUTOVR
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2 19'Koder Nexstep handel'
     A                                      COLOR(WHT)
     A                                  8  2'Betal.bet:'
     A            F2BETB    R        O  8 24REFFLD(FLBETB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            F2CTXT        20A  O  8 27
     A                                      OVRDTA
     A                                  9  2'Avgiftsfri . . . . .:'
     A            F2MKOD    R        O  9 24REFFLD(FLMKOD)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Pris/Pakkseddel. . .:'
     A            F2PRPA    R        O  6 24REFFLD(FLPRPA)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6 38'Pris på faktura. . .:'
     A            F2NETO    R        O  6 60REFFLD(FLNETO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Ekspedisjonsgebyr . :'
     A            F2EKGB    R        O  5 24REFFLD(FLEKGB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Fakturasekvens . . .:'
     A            F2SEKV    R        O  7 24REFFLD(FLSEKV)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5 38'Samlefaktura . . . .:'
     A            F2SAMF    R        O  5 60REFFLD(FLSAMF)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 15  2'Opprettet av . . . .:'
     A            F2OUSR    R        O 15 24REFFLD(FLOUSR)
     A                                      OVRDTA
     A                                 15 38'Opprettet dato . .:'
     A            F2ODAT         6Y 0O 15 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 16  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
