     A*%%TS  SD  20090701  145456  AMD560      REL-V5R4M0  5722-WDS
     A*%%EC
7.00 A                                      DSPSIZ(24 80 *DS3 -
7.00 A                                             27 132 *WIDE)
7.00 A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '        '))
     A          R B1BLD
     A*%%TS  SD  20090701  145456  AMD560      REL-V5R4M0  5722-WDS
     A                                      CF02
     A                                      CA03
     A                                      CA12
     A                                      CF13
     A                                      CF14
     A                                      CF15
     A                                      OVERLAY
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise kunde/kundeprosjekt'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Kunde. . . . .'
     A            B1KNAV        30A  O  4 17COLOR(YLW)
     A                                      OVRDTA
     A                                  4 50'Selger . . . .'
     A            B1KSEL    R        O  4 65REFFLD(RFRFR/RKSLGR *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                  5  2'Adresse 1. . .'
     A            B1KAD1    R        O  5 17REFFLD(RFRFR/RKGATE *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                  5 50'Kundekategori.'
     A            B1KATG    R        O  5 65REFFLD(RFRFR/RKKATG *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                  6  2'Adresse 2. . .'
     A            B1KAD2    R        O  6 17REFFLD(RFRFR/RKADR2 *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                  6 50'Rabattkategori'
     A            B1KRKA    R        O  6 65REFFLD(RFRFR/RKRABK *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                  7  2'Postadresse. .'
     A            B1KSTE    R        O  7 17REFFLD(RFRFR/RKSTED *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                  7 50'Betalingsbet .'
     A            B1BETB    R        O  7 65REFFLD(RFRFR/RKBETB *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                  8  2'Kontaktperson.'
     A            B1KKPR    R        O  8 17REFFLD(RFRFR/RKPERS *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                  8 50'Ekst.prosj.nr.'
     A            B1EPRO    R        O  8 65REFFLD(FLEPRO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'E-mail adresse'
6.30 A            B1KEMA    R  -20   O  9 17REFFLD(RFRFR/RKEMAL *LIBL/RFRF)
     A                                      COLOR(YLW)
6.31 A                                 12 50'Saldo. . . . .'
6.31 A            B1SALD    R        O 12 65REFFLD(RFRFR/RKSALD *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                 10  2'Mobiltelefon .'
     A            B1KMOB    R        O 10 17REFFLD(RFRFR/RKMOBN *LIBL/RFRF)
     A                                      COLOR(YLW)
6.31 A                                  9 50'Kjøp i år. . .'
6.31 A            B1KJØP    R        O  9 65REFFLD(RFRFR/RKKJØP *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                 11  2'Telefon. . . .'
     A            B1KTLF    R        O 11 17REFFLD(RFRFR/RKTLFN *LIBL/RFRF)
     A                                      COLOR(YLW)
6.31 A                                 10 50'Kjøp i fjor. .'
6.31 A            B1KJØF    R        O 10 65REFFLD(RFRFR/RKKJØF *LIBL/RFRF)
     A                                      COLOR(YLW)
6.31 A                                 12  2'Saldo inkl.aktive ordrer'
6.31 A            B1MEMO    R        O 12 27REFFLD(RFRFR/RKMEMS *LIBL/RFRF)
6.31 A                                      COLOR(YLW)
6.31 A                                 11 50'Kredittgrense.'
6.31 A            B1GRNS        11  2O 11 65
6.31 A                                      COLOR(YLW)
6.31 A                                      EDTCDE(K)
     A                                 13  2'Kundeprosjekt.'
     A            B1NAVN    R        O 13 17REFFLD(FLNAVN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13 50'Periode. . . .'
     A            B1FDAT         6Y 0O 13 65COLOR(YLW)
     A                                      OVRDTA
     A                                 13 72'-'
     A            B1TDAT         6Y 0O 13 74COLOR(YLW)
     A                                      OVRDTA
     A                                 14  2'Adresse 1. . .'
     A            B1ADR1    R        O 14 17REFFLD(FLADR1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14 50'Selger . . . .'
     A            B1SELG    R        O 14 65REFFLD(FLSELG)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 15  2'Adresse 2. . .'
     A            B1ADR2    R        O 15 17REFFLD(FLADR2)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 15 50'Tlf. arbeid. .'
     A            B1TLFA    R        O 15 65REFFLD(FLTLFA)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 16  2'Postadresse. .'
     A            B1PONR    R        O 16 17REFFLD(FLPONR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B1STED        25A  O 16 22COLOR(YLW)
     A                                      OVRDTA
     A                                 16 50'Tlf. privat. .'
     A            B1TLFP    R        O 16 65REFFLD(FLTLFP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 17  2'Kontaktperson.'
     A            B1KPRS    R        O 17 17REFFLD(FLKPRS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 17 50'Mobiltelefon .'
     A            B1TLFM    R        O 17 65REFFLD(FLTLFM)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 18  2'E-mail adresse'
     A            B1MAIL    R        O 18 17REFFLD(FLMAIL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.31 A                                 19  2'Kort . . . . .'
6.31 A            B1KORT    R        O 19 17REFFLD(FLMAIL)
6.31 A                                      COLOR(YLW)
6.31 A                                      OVRDTA
     A                                 20  2'Overstyrt mot:'
     A                                      DSPATR(UL)
     A                                 21  2'Rabattkategori'
     A            B1ORKA    R        O 21 17REFFLD(FLORKA)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 21 22'Kunde. . .'
     A            B1OKUN    R        O 21 33REFFLD(FLOKUN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 21 41'Kundeprosjekt.'
     A            B1OKPR    R        O 21 56REFFLD(FLOKPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 21 64'Prisdato.'
     A            B1OPDA         6Y 0O 21 74COLOR(YLW)
     A                                      OVRDTA
     A                                 22  2'Privatkjøp . .'
     A            B1PRIV    R        O 22 17REFFLD(FLPRIV)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 22 22'1=Ja,0=Nei'
     A                                 23  2'F2=Notat  F3=Gå tilbake  F13=Rabat-
     A                                      tmatrise  F14=Spesialpriser  F15=Bo-
     A                                      nusavtale'
     A                                      COLOR(BLU)
