     A*%%TS  SD  20070419  093157  AMD550      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : FM00
     A* Beskrivelse . . : Hovedmeny
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A                                      CA22(22 'F22=Info')
     A          R A1MNU
     A*%%TS  SD  20070419  093157  AMD550      REL-V5R4M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Hovedmeny'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  3'Daglig drift'
     A                                      COLOR(WHT)
     A                                  5 39'Priser'
     A                                      COLOR(WHT)
     A                                  6  4'1. Ordrebehandling/tilbud'
     A                                  6 39'11. Prisoppdatering'
     A                                  7  4'2. Andre ordreoppgaver'
     A                                  7 39'12. Utsendelse prisinformasjon'
     A                                  8  4'3. Varemottak/etiketter'
     A                                  9  4'4. Kjørekontor/plukkstyring'
     A                                 10  4'6. Utskrifter'
     A                                 12  3'Vedlikehold/diverse'
     A                                      COLOR(WHT)
     A                                 12 39'Overgang delsystemer'
     A                                      COLOR(WHT)
     A                                 13  4'7. Vedlikehold av registre'
     A                                 13 39'21. Vareadministrasjon'
     A                                 14 39'22. Butikksystemet'
     A                                 14  4'9. Diverse oppgaver'
     A                                 15 39'23. Bestilling/Innkjøp/Lager'
     A                                 16 39'24. Statistikk'
     A                                 18  3'90. Gå ut av systemet'
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
