     A*%%TS  SD  20060216  003814  HKO550      REL-V5R3M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : FM10
     A* Beskrivelse . . : Registrering/vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
6.30 A* 6.30  080814 BSA  Eget menypunkt for kort håndtering
6.31 A* 6.30  110914 BSA  Justert ledetekst
6.32 A* 6.30  211114 BSA  Nytt menypunkt for oversikt over bonger trukket
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20060216  003814  HKO550      REL-V5R3M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Registrering/vedlikehold'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  3'Ordreoppgaver'
     A                                      COLOR(WHT)
     A                                  5 39'Spørring på'
     A                                      COLOR(WHT)
     A                                  6  4'1. Reg./vedlikehold tilbud/ordre'
     A                                  6 39'15. Fakturaregister'
     A                                  7  4'2. Utskrift av kontroll'
     A                                  7 39'16. Vare / pris'
     A                                  8  4'3. Eksterne ordre'
     A                                  8 39'17. Statistikk'
     A                                  9  4'4. Tilbudsoppfølging'
     A                                  9 39'18. Ikke-bekreftede bestillinger'
     A                                 10  4'5. Ordreoppfølging'
     A                                 10 39'19. Restede ordre til levering'
     A                                 12  3'Fakturaoppgaver'
     A                                      COLOR(WHT)
     A                                 12 39'Vedlikehold/overføring'
     A                                      COLOR(WHT)
     A                                 13  3'10. Omkjøring av faktura-bunt'
6.31 A                                 13 39'20. Overføring til økonomi'
     A                                 14  3'11. Utskrift av faktura-journal'
     A                                 15  3'12. Utskrift av faktura-kopi'
6.30 A                                 16  3'13. Behandle kort fakturaer'
6.32 A                                 17  3'14. Betalte kort bonger'
     A                                 18  3'90. Gå ut av systemet    '
     A                                 18 39'21. Vedlikehold av faste registre'
     A                                 20 31'Valg:'
     A            VALG           2Y 0B 20 37EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
