     A*%%TS  SD  20040909  144905  GRO         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20040709  123203  GRO         REL-V5R2M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(2 4 5)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1KUND    R        O  8  4REFFLD(FMKUND)
     A            B1KPRO    R        O  8 11REFFLD(FMKPRO)
     A            B1KFTP    R        H      REFFLD(FMKFTP)
     A            B1KTSQ    R        H      REFFLD(FMKTSQ)
     A            B1TYPE        20A  O  8 19
     A            B1NAVN        25A  O  8 41
     A            B1KORT         7A  O  8 68
     A            B1OBLI         1A  O  8 77
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20040709  123507  GRO         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av kort/fakturaavtale'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'5=Vis  2=Endre  4=Slett'
     A                                      COLOR(BLU)
     A                                  6  2'V  Kunde  Prosj  Kort/avt.type    -
     A                                           Navn på kort               Kor-
     A                                      tnr.  Obl'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20040831  092353  GRO         REL-V5R2M0  5722-WDS
     A                                 23  2'F3=Gå tilbake  F6=Opprett  F5=Forn-
     A                                      y'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20040706  155825  GRO         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            C2KTSQ    R        H      REFFLD(FMKTSQ)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av kort/fakturaavtale'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Kunde. . . . .'
     A            C2KUND    R        O  4 17REFFLD(FMKUND)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KNAV        30A  O  4 24COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Prosjektnummer'
     A            C2KPRO    R        B  5 17REFFLD(FMKPRO)
     A  32                                  ERRMSGID(FMM0020 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2KPNV        30A  O  5 24COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Kort/avt.type.'
     A            C2KFTP         2Y 0B  7 17COLOR(YLW)
     A  31                                  ERRMSGID(FMM0010 *LIBL/QMFOFAK 31)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A            C2KTPN        30A  O  7 24COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Obligatorisk .'
     A            C2OBLG         1Y 0B  8 17COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  8 24'1=Ja,0=Nei'
     A                                  9  2'Kortnummer . .'
     A            C2KRNR        16Y 0B  9 17COLOR(YLW)
     A  33                                  ERRMSGID(FMM0030 *LIBL/QMFOFAK 33)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  9 37'Utløpsdato (MMYY) .'
     A            C2EXPD         4Y 0B  9 57COLOR(YLW)
     A  34                                  ERRMSGID(FMM0040 *LIBL/QMFOFAK 34)
     A                                      OVRDTA
     A                                 10  2'Navn på kort .'
     A            C2HLDR        30A  B 10 17COLOR(YLW)
     A  35                                  ERRMSGID(FMM0050 *LIBL/QMFOFAK 35)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 12  2'Etternavn. . .'
     A            C2ENVN        30A  B 12 17COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 13  2'Fornavn. . . .'
     A            C2FNVN        30A  B 13 17COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 14  2'Adresse 1. . .'
     A            C2ADR1        30A  B 14 17COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 15  2'Adresse 2. . .'
     A            C2ADR2        30A  B 15 17COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 16  2'Postnummer . .'
     A            C2PONR         4Y 0B 16 17COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2STED        30A  B 16 22COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 18  2'Tlf. arbeid. .'
     A            C2TLFA        15A  B 18 17COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 18 37'Tlf. privat. .'
     A            C2TLFP        15A  B 18 52COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 19  2'Mobiltelefon .'
     A            C2TLFM        15A  B 19 17COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 20  2'E-mail adresse'
     A            C2MAIL        50A  B 20 17COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A                                 22 48'Sist endret'
     A            C2EDAT         6Y 0O 22 60COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 69'/'
     A            C2EUSR         3A  O 22 71COLOR(YLW)
     A                                      OVRDTA
     A          R D1WIN
     A*%%TS  SD  20040806  140048  GRO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 12 60)
     A                                      CA03
     A                                      CA12
     A            D1KFTP    R        H      REFFLD(FMKFTP)
     A            D1KTSQ    R        H      REFFLD(FMKTSQ)
     A                                  2  2' Slette kortnummer/avt.post'
     A                                      DSPATR(RI)
     A                                  4  2'Kunde. . . . . . .'
     A            D1KUND    R        O  4 21REFFLD(FMKUND)
     A            D1KNAV        30A  O  4 28
     A                                  5  2'Prosjekt . . . . .'
     A            D1KPRO    R        O  5 21REFFLD(FMKPRO)
     A            D1KPNV        30A  O  5 28
     A                                  7  2'Kort/avt.type. . .'
     A            D1TYPE        20A  O  7 21
     A                                  8  2'Navn på kort . . .'
     A            D1HLDR        30A  O  8 21
     A                                  9  2'Kortnummer . . . .'
     A            D1KRNR        16Y 0O  9 21
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R F1WIN
     A                                      WINDOW(*DFT 16 30)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2'Hent inn'
     A                                      DSPATR(RI)
     A            F1HEAD        13A  O  2 11DSPATR(RI)
     A                                  4  2'1=Valg'
     A                                      COLOR(BLU)
     A                                  5  2'V'
     A                                      COLOR(WHT)
     A            F1ALTH        13A  O  5  5COLOR(WHT)
     A            F1VAL1         1A  B  6  2COLOR(YLW)
     A            F1ALT1        25A  O  6  5
     A            F1VAL2         1A  B  7  2COLOR(YLW)
     A            F1ALT2        25A  O  7  5
     A            F1VAL3         1A  B  8  2COLOR(YLW)
     A            F1ALT3        25A  O  8  5
     A            F1VAL4         1A  B  9  2COLOR(YLW)
     A            F1ALT4        25A  O  9  5
     A            F1VAL5         1A  B 10  2COLOR(YLW)
     A            F1ALT5        25A  O 10  5
     A            F1VAL6         1A  B 11  2COLOR(YLW)
     A            F1ALT6        25A  O 11  5
     A            F1VAL7         1A  B 12  2COLOR(YLW)
     A            F1ALT7        25A  O 12  5
     A            F1VAL8         1A  B 13  2COLOR(YLW)
     A            F1ALT8        25A  O 13  5
     A                                 15  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R E1WIN
     A*%%TS  SD  20040909  144905  GRO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 5 40)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  3'   Tilleggsmodul må installeres   '
     A                                  3  3'   ---   Kontakt ASP a.s.   ---   '
     A          R ASUME                     ASSUME
     A                                 24 79' '
