     A*%%TS  SD  20030115  111820  GRO         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : FM41
     A* Beskrivelse . . : Mottak av varer/priser fra leverandør
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20030115  111820  GRO         REL-V5R1M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Prisoppdatering'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  3'Innlesing av'
     A                                      COLOR(WHT)
     A                                  5 39'Utskrift av'
     A                                      COLOR(WHT)
     A                                  6  4'1. Varer/priser fra leverandør'
     A                                  6 40'6. Varer fra leverandør'
     A                                  7  4'2. Spesialpriser fra fil'
     A  41                              8  4'12.Kampanjepriser fra fil'
     A                                 11  3'Oppdatering'
     A                                      COLOR(WHT)
     A                                 11 39'Diverse'
     A                                      COLOR(WHT)
     A                                 12  4'3. Prisjustering'
     A                                 12 40'8. Overgang til Jernia'
     A                                 13  4'4. Oppretting nye varer lev.'
     A                                 13 40'9. Arbeide med nettverksfiler'
     A                                 14  4'5. Varer/priser fra leverandør'
     A                                 14 39'10. Vedlikehold av enhets-konverte-
     A                                      ring'
     A                                 16 39'90. Gå ut av systemet'
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
     A  42                              9  4'13.Kundeklubb innlesing fra CSV'
