     A*%%TS  SD  20040818  075830  GRO         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20040706  085953  GRO         REL-V5R2M0  5722-WDS
     A            B1VALG    R        B  9  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1KUND    R        O  9  4REFFLD(FMKUND)
     A            B1KTSQ    R        H      REFFLD(FMKTSQ)
     A            B1KFTP    R        H      REFFLD(FMKFTP)
     A            B1TYPE        13A  O  9 11
     A            B1NAVN        25A  O  9 26
6.13 A**          B1KEXP         4S 0O  9 54
6.13 A            B1KORT        15A  O  9 53
6.13 A**          B1KORT         7A  O  9 61
     A            B1OBLI         1A  O  9 70
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20040706  091834  GRO         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0007)
     A                                      SFLPAG(0006)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A**                                    CA06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Velge kort/fakturaavtale '
     A                                      DSPATR(RI)
6.13 A                                  4  2'Alle ordre hvor kunde har fullmakt-
6.13 A                                       må belastes på web'
6.13 A                                  5  2'Dersom kunden har fullmakt og IKKE-
6.13 A                                       skal belastes på nett må du inn i'
6.13 A                                  6  2'ordrehodet med F10 og fjerne kortm-
6.13 A                                      erking !'
6.13 A*                                 5  2'Klikker du Gå tilbake vil ordren b-
6.13 A*                                     li fakurert på normal måte'
6.13 A                                  7  2'1=Velg'
     A                                      COLOR(BLU)
6.13 A                                  8  2'V  Kunde  Kort/avt.type Navn på ko-
     A                                      rt               Kortnr          Fu-
     A                                      l.'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20040818  075830  GRO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 18 72)
     A**                               17  2'F3=Gå tilbake  F6=Opprett'
     A                                 17  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
