     A*%%TS  SD  20090911  095039  AMD610      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : FM79
     A* Beskrivelse . . : Status-informasjon
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20090911  095039  AMD610      REL-V5R4M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Status-informasjon'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  7'Vedlikehold av:'
     A                                      COLOR(WHT)
     A                                  5 46'Vedlikehold av:'
     A                                      COLOR(WHT)
     A                                  6  8'1. Generelle systemverdier'
     A                                  6 46'11. Ordre-typer'
     A                                  7  8'2. Spesielle koder'
     A                                  7 46'12. Linje-typer'
     A                                  8  8'3. Faste ordretyper'
     A                                  9  8'4. Avrundingsregler'
     A                                  9 46'13. Enheter'
     A                                 10 46'14. Varetyper'
     A                                 11  8'6. Priskode-beskrivelse'
     A                                 11 46'15. Leveringstyper'
     A                                 12  8'7. Ordre-info-beskrivelse'
     A                                 12 46'16. Bonustyper'
     A                                 13  8'8. Bilde-kode-alternativer'
     A                                 14  8'9. Logge-koder            '
     A                                 14 46'17. Eksterne ordrekoder'
     A                                 15  7'10. Mva-koblings-tabell   '
     A                                 16 46'Kontroll av'
     A                                      COLOR(WHT)
     A                                 17  7'90. Gå ut av systemet'
     A                                 17 46'20. Jobb-status'
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
