     A*%%TS  SD  20080325  153918  AMD560      REL-V5R4M0  5722-WDS
     A*%%EC
7.00 A                                      DSPSIZ(24 80 *DS3 -
7.00 A                                             27 132 *WIDE)
7.00 A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20080325  153918  AMD560      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_AREC &W_AFLD)
9.01 A                                      WINDOW(*DFT 22 65)
     A            W_AREC        10A  H
     A            W_AFLD        10A  H
6.33 A                                  1  2' Sende utskrift som e-mail '
     A                                      DSPATR(RI)
9.01 A                                  2  2'Kunde/Lev.dør . .'
9.01 A            B1KUND    R        O  2 21REFFLD(RKKUND)
     A                                      COLOR(YLW)
9.01 A                                  3  2'Navn. . . . . . .'
9.01 A            B1NAVN    R        O  3 21REFFLD(RKNAVN)
     A                                      COLOR(YLW)
9.01 A                                  4  2'E-mail-adresser:'
9.01 A            B1EMAL        50A  B  5  2COLOR(YLW)
     A                                      CHECK(LC)
     A  31                                  ERRMSG('E-mail-adresse kan ikke vær-
     A                                      e blank' 31)
9.01 A            B1EMA2        50A  B  6  2COLOR(YLW)
6.32 A                                      CHECK(LC)
9.01 A            B1EMA3        50A  B  7  2COLOR(YLW)
6.32 A                                      CHECK(LC)
9.01 A                                  8  2'Emne i mailen :'
9.01 A            B1EMN1        60A  B  9  2COLOR(YLW)
     A                                      CHECK(LC)
     A                                      DSPATR(PC)
9.01 A            B1EMN2        60A  B 10  2COLOR(YLW)
9.01 A                                      CHECK(LC)
9.01 A                                      DSPATR(PC)
9.01 A            B1EMN3        60A  B 11  2COLOR(YLW)
9.01 A                                      CHECK(LC)
9.01 A                                      DSPATR(PC)
9.01 A                                 12  2'Melding til mottaker :'
9.01 A            B1TXT1        50A  B 13  2COLOR(YLW)
     A                                      CHECK(LC)
9.01 A            B1TXT2        50A  B 14  2COLOR(YLW)
     A                                      CHECK(LC)
9.01 A            B1TXT3        50A  B 15  2COLOR(YLW)
     A                                      CHECK(LC)
9.01 A            B1TXT4        50A  B 16  2COLOR(YLW)
     A                                      CHECK(LC)
9.01 A                                 17  2'Vår referanse :  '
9.01 A            B1PERS        50A  B 18  2COLOR(YLW)
     A                                      CHECK(LC)
9.01 A                                 19  2'Kopi sendes:'
9.01 A            B1KOPI        50A  B 20  2COLOR(YLW)
pdf  A                                      CHECK(LC)
9.01 A                                 21  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
9.01 A                                 21 17'Trykk enter for å bekrefte'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
