     A*%%TS  SD  20040513  135956  HKO         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : FM84
     A* Beskrivelse . . : Diverse oppgaver, sletting
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
8.01 A*       291122 bof  Utvidet med sletting av varer ut fra CSV fil
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20040513  135956  HKO         REL-V5R2M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Diverse oppgaver, sletting'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5 23'Sletting av'
     A                                      COLOR(WHT)
     A                                  6 24'1. Tilbud før en bestemt dato'
     A                                  7 24'2. Varer uten salg'
     A                                  8 24'3. Rabattavtale på lavere nivå'
     A                                  9 24'4. Priser for en leverandør'
8.01 A                                 10 24'8. Sletting av varer CSV'
8.01 A                                 11 23'Sletting av poster i'
     A                                      COLOR(WHT)
8.01 A                                 12 24'5. Historisk fakturaregister'
8.01 A                                 13 24'6. Salgsstatistikk'
8.01 A                                 14 24'7. Innkjøpsstatistikk'
     A                                 16 23'90. Gå ut av systemet'
     A                                 20 27'Valg:'
     A            VALG           2Y 0B 20 33EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)

