     A*%%TS  SD  20101214  154635  AMD610      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : FN10
     A* Beskrivelse . . : Ordre - behandler (rollemeny)
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
6.20 A* 6.20  280212 BSA  Fjernet F10 fra menyen
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20101214  154635  AMD610      REL-V5R4M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Ordre - behandler'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5 21'Daglig drift'
     A                                      COLOR(WHT)
     A                                  6 22'1. Registrering/vedlikehold av til-
     A                                      bud/ordre'
     A                                  7 22'2. Vedlikehold av leveransedata'
     A                                  8 22'3. Utskrift av kontroll'
     A                                  9 22'4. Vedlikehold av Kundeprosjekt   -
     A                                       '
     A                                 10 22'5. Ekstern ordre'
     A                                 12 21'Spørring på'
     A                                      COLOR(WHT)
     A                                 13 22'6. Kundeinformasjon'
     A                                 14 22'7. Vare / pris'
     A                                 15 22'8. Fakturaregister'
     A                                 16 22'9. Statistikk'
     A                                 20 21'90. Gå ut av systemet    '
     A                                 21 25'Valg:'
     A            VALG           2Y 0B 21 32EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
     A                                 17 21'10. Tilbudsoppfølging'
     A                                 18 21'11. Ordreoppfølging'
     A                                  2 32'(FN10)'
