     A*%%TS  SD  20101215  121822  AMD610      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : FN11
     A* Beskrivelse . . : Ordre - behandler (rollemeny)
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20101215  121822  AMD610      REL-V5R4M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Arbeidsmeny'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  4'Daglig drift'
     A                                      COLOR(WHT)
     A                                  5 43'Spørring på'
     A                                      COLOR(WHT)
     A                                  6  5'1. Tilbud-/Ordrebehandling'
     A                                  6 43'21. Kunderegister'
     A                                  7  5'2. Tilbudsoppfølging'
     A                                  7 43'22. Fakturaregister kunde'
     A                                  8  5'3. Ordreoppfølging'
     A                                 12 43'31. Leverandørregister'
     A                                  9  5'4. Bestillingsbehandling'
     A                                 10  5'5. Bestilling uten lev.dato'
     A                                 13  4'Overgang til'
     A                                      COLOR(WHT)
     A                                 14  4'11. Etiketter'
     A                                 20 43'90. Gå ut av systemet    '
     A                                 15  4'12. Varemottak'
     A                                 16  4'13. Lagerregister (max/min) '
     A                                 17  4'14. Varetelling'
     A                                 21 36'Valg:'
     A            VALG           2Y 0B 21 43EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
     A                                 13 43'32. Fakturaregister leverandør'
     A                                  8 43'23. Vare / Pris / Lagerbeholdning'
     A                                 18  4'15. Kjørekontor'
     A                                 11  5'6. Bestillingsforslag'
     A                                  9 43'24. Varestatistikk (kunde/varenr)'
     A                                 19  4'16. Kundeprosjekt'
     A                                 15 43'Vedlikehold'
     A                                      COLOR(WHT)
     A                                 16 43'41. Kunder       '
     A                                  2 32'(FN14)'
     A                                 20  4'17. Utskrifter        '
     A                                 21  4'18. EDI-Mottaksrutiner'
     A                                 10 43'25. Innkjøpsstatistikk'
     A                                 11 43'26. Innkjøpsplanlegging'
     A                                 17 43'42. Tilbudspriser'
     A                                 12  5'7. Ekstern ordre'
     A                                 18 43'43. Spesialpriser'
