     A*%%TS  SD  20080118  092034  BOF560      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : FN15
     A* Beskrivelse . . : Utskrift av strekkode-etiketter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
6.20 A* 6.20  280212 BSA  Ny rollemeny uten F10
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
6.20 A**                                    CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20080118  092034  BOF560      REL-V5R4M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av strekkode-etiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6 27'Utskrift av'
     A                                      COLOR(WHT)
     A                                  7 28'1. Etiketter'
     A                                  8 28'2. Etiketter, fast reklame'
     A                                  9 28'3. Etiketter, faste tall'
     A                                 10 28'4. Automatiske etiketter'
     A                                 11 28'5. Varer med reoletiketter'
     A                                 12 28'6. Elektroniske etiketter fil'
     A                                 13 27'Vedlikehold av'
     A                                      COLOR(WHT)
     A                                 14 28'7. Faste tekster, etiketter'
     A                                 15 28'8. Etikettkoder, varer'
     A                                 16 28'9. Etikettkoder, leverandører'
     A                                 18 27'90. Gå ut av systemet'
     A                                 20 31'Valg:'
     A            VALG           2Y 0B 20 37EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Vel firma '
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
6.20 A**                               23 61'F10=Kommando-linje'
6.20 A**                                    COLOR(BLU)
