     A*%%TS  SD  20051027  101028  AMD550      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R D1BLD
     A*%%TS  SD  20051027  101028  AMD550      REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 11 60)
     A                                      CF03
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      KEEP
     A                                      OVERLAY
     A                                      PUTOVR
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Ordreopplysninger '
     A                                      DSPATR(RI)
     A                                  4  2'Ordrenummer . . .'
     A            D1NUMM    R        O  4 20REFFLD(FONUMM)
6.NU A            D1SUFF    R        O  4 30REFFLD(FOSUFF)
     A                                  6  2'Selger'
     A                                      COLOR(WHT)
     A                                  6 20'Lager'
     A                                      COLOR(WHT)
     A                                  6 38'Forsendelsesmåte'
     A                                      COLOR(WHT)
     A            D1SELG    R        B  7  2REFFLD(FOSELG)
     A  33                                  ERRMSGID(FMA0150 *LIBL/QMFOFAK 33)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            D1LAGE    R        B  7 20REFFLD(FOLAGE)
     A  34                                  ERRMSGID(FMA0160 *LIBL/QMFOFAK 34)
     A  39                                  ERRMSGID(FMA0300 *LIBL/QMFOFAK 39)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            D1LMAT    R        B  7 38REFFLD(FOLMAT)
     A  38                                  ERRMSGID(FMA0200 *LIBL/QMFOFAK 38)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            D1SETX        15A  O  8  2OVRDTA
     A            D1LATX        15A  O  8 20OVRDTA
     A            D1LMTX    R        B  8 38REFFLD(FOLMTX)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
