     A*%%TS  SD  20131028  091528  SST620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R E1BLD
     A*%%TS  SD  20131028  091528  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 15 64)
     A                                      CF03
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      KEEP
     A                                      OVERLAY
     A                                      PUTOVR
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Ordreopplysninger '
     A                                      DSPATR(RI)
     A                                  4  2'Ordrenummer . . . . . .'
     A                                      COLOR(WHT)
     A            E1NUMM    R        O  4 26REFFLD(FONUMM)
6.NU A            E1SUFF    R        O  4 36REFFLD(FOSUFF)
     A                                  6  2'Avdeling. . . . . . . .'
     A            E1AVDE    R        B  6 26REFFLD(FOAVDE)
     A                                      OVRDTA
     A*                                     OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  32                                  ERRMSGID(FMA0140 *LIBL/QMFOFAK 32)
     A            E1AVTX        20A  O  6 34OVRDTA
     A*                                     OVRATR
     A                                  7  2'Selger. . . . . . . . .'
     A            E1SELG    R        B  7 26REFFLD(FOSELG)
     A  33                                  ERRMSGID(FMA0150 *LIBL/QMFOFAK 33)
     A                                      OVRDTA
     A*                                     OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            E1SETX        20A  O  7 34OVRDTA
     A*                                     OVRATR
     A                                  8  2'Lager . . . . . . . . .'
     A            E1LAGE    R        B  8 26REFFLD(FOLAGE)
     A  34                                  ERRMSGID(FMA0160 *LIBL/QMFOFAK 34)
     A  39                                  ERRMSGID(FMA0300 *LIBL/QMFOFAK 39)
     A                                      OVRDTA
     A*                                     OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            E1LATX        20A  O  8 34OVRDTA
     A*                                     OVRATR
     A                                 10  2'Prosjektnummer. . . . .'
     A            E1PROJ    R        B 10 26REFFLD(FOPROJ)
     A                                      OVRDTA
     A*                                     OVRATR
     A                                      COLOR(YLW)
     A  35                                  ERRMSGID(FRH0220 *LIBL/QMFOFAK 35)
     A  45                                  ERRMSGID(RS88002 *LIBL/QMFOFAK 38)
     A            E1PRTX        30A  O 10 34OVRDTA
     A*                                     OVRATR
6.25 A**                               11  2'Aktivitet . . . . . . .'
6.25 A                                 11  2'Underprosjekt . . . . .'
6.25 A**          E1AKTI    R        B 11 26REFFLD(FOAKTI)
6.25 A            E1UPRO    R        B 11 26REFFLD(FOUPRO)
     A  36                                  ERRMSGID(RS88001 *LIBL/QMFOFAK 35)
     A                                      OVRDTA
     A*                                     OVRATR
     A                                      COLOR(YLW)
     A            E1UPTX        30A  O 11 34OVRDTA
     A*                                     OVRATR
     A                                 12  2'Forsendelsesmåte. . . .'
     A            E1LMAT    R        B 12 26REFFLD(FOLMAT)
     A  37                                  ERRMSGID(FMA0200 *LIBL/QMFOFAK 37)
     A                                      OVRDTA
     A*                                     OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            E1LMTX    R        B 12 34REFFLD(FOLMTX)
     A                                      OVRDTA
     A*                                     OVRATR
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME
     A*%%TS  SD  19980318  092024  AMD         REL-V3R7M0  5716-PW1
     A                                      ASSUME
     A                                 24 79' '
