     A*%%TS  SD  20050210  115640  GRO530      REL-V5R2M0  5722-WDS
6.12 A*  290115  NHO Lagt inn melding om at F11 må tastes dersom tidlig
6.12 A*          ere år angis
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20050210  115640  GRO530      REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF06
     A                                      CF10
     A                                      CF11
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Generering - utgående fakturafiler'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4 63'Årstall :'
     A            A1AARR    R        B  4 73REFFLD(SOAARR)
6.12 A  33                                  ERRMSGID(FMD0720 *LIBL/QMFOFAK 47)
     A  31                                  ERRMSGID(FM01200 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                  5  2'Fakturatype'
     A                                      COLOR(WHT)
     A                                  5 19'Ant.fakt'
     A                                      COLOR(WHT)
     A                                  6 29'Kjør'
     A                                      COLOR(WHT)
6.NU A                                  5 37'Fra - til'
     A                                      COLOR(WHT)
6.NU A                                  6 54'Omkj.'
     A                                      COLOR(WHT)
6.NU A                                  6 60'Rapp.'
     A                                      COLOR(WHT)
     A                                  6 16'til kjøring'
     A                                      COLOR(WHT)
7.xx A                                  7 29'J=Ja'
     A                                      COLOR(WHT)
6.NU A                                  6 37'fakt.nummer'
     A                                      COLOR(WHT)
7.xx A                                  7 54'J=Ja'
     A                                      COLOR(WHT)
7.xx A                                  7 60'J=Ja'
     A                                      COLOR(WHT)
6.NU A                                  6 66'Status'
     A                                      COLOR(WHT)
     A                                  8  2'eFaktura. . . . . .'
     A            A1EFAA         4Y 0O  8 23EDTCDE(Z)
     A                                      OVRDTA
     A            A1EFAV         1A  B  8 29OVRDTA
     A                                      COLOR(YLW)
     A            A1EFAF    R        B  8 35REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A                                  8 44'-'
6.NU A            A1EFAT    R        B  8 46REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A            A1EFAO         1A  B  8 56OVRDTA
     A                                      COLOR(YLW)
6.NU A            A1EFAP         1A  B  8 60OVRDTA
     A                                      COLOR(YLW)
     A            A1EFAS        15A  O  8 64OVRDTA
     A                                  9  2'ePrint. . . . . . .'
     A            A1EPRA         4Y 0O  9 23EDTCDE(Z)
     A                                      OVRDTA
     A            A1EPRV         1A  B  9 29OVRDTA
     A                                      COLOR(YLW)
     A            A1EPRF    R        B  9 35REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A                                  9 44'-'
6.NU A            A1EPRT    R        B  9 46REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A            A1EPRO         1A  B  9 56OVRDTA
     A                                      COLOR(YLW)
6.NU A            A1EPRP         1A  B  9 60OVRDTA
     A                                      COLOR(YLW)
     A            A1EPRS        15A  O  9 64OVRDTA
     A                                 10  2'eMail . . . . . . .'
     A            A1EMAA         4Y 0O 10 23EDTCDE(Z)
     A                                      OVRDTA
     A            A1EMAV         1A  B 10 29OVRDTA
     A                                      COLOR(YLW)
     A            A1EMAF    R        B 10 35REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A                                 10 44'-'
6.NU A            A1EMAT    R        B 10 46REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A            A1EMAO         1A  B 10 56OVRDTA
     A                                      COLOR(YLW)
6.NU A            A1EMAP         1A  B 10 60OVRDTA
     A                                      COLOR(YLW)
     A            A1EMAS        15A  O 10 64OVRDTA
     A                                 11  2'eCards. . . . . . .'
     A            A1ECAA         4Y 0O 11 23EDTCDE(Z)
     A                                      OVRDTA
     A            A1ECAV         1A  B 11 29OVRDTA
     A                                      COLOR(YLW)
     A            A1ECAF    R        B 11 35REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A                                 11 44'-'
6.NU A            A1ECAT    R        B 11 46REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A            A1ECAO         1A  B 11 56OVRDTA
     A                                      COLOR(YLW)
6.NU A            A1ECAP         1A  B 11 60OVRDTA
     A                                      COLOR(YLW)
     A            A1ECAS        15A  O 11 64OVRDTA
     A                                 13  2'EDI . . . . . . . .'
     A            A1EDIA         4Y 0O 13 23EDTCDE(Z)
     A                                      OVRDTA
     A            A1EDIV         1A  B 13 29OVRDTA
     A                                      COLOR(YLW)
     A            A1EDIF    R        B 13 35REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A                                 13 44'-'
6.NU A            A1EDIT    R        B 13 46REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A            A1EDIO         1A  B 13 56OVRDTA
     A                                      COLOR(YLW)
6.NU A            A1EDIP         1A  B 13 60OVRDTA
     A                                      COLOR(YLW)
     A            A1EDIS        15A  O 13 64OVRDTA
     A                                 14  2'Autofakt. . . . . .'
     A            A1AUTA         4Y 0O 14 23EDTCDE(Z)
     A                                      OVRDTA
     A            A1AUTV         1A  B 14 29OVRDTA
     A                                      COLOR(YLW)
     A            A1AUTF    R        B 14 35REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A                                 14 44'-'
6.NU A            A1AUTT    R        B 14 46REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A            A1AUTO         1A  B 14 56OVRDTA
     A                                      COLOR(YLW)
6.NU A            A1AUTP         1A  B 14 60OVRDTA
     A                                      COLOR(YLW)
     A            A1AUTS        15A  O 14 64OVRDTA
     A                                 16  2'VISA/Europay Purch.'
     A            A1VEPA         4Y 0O 16 23EDTCDE(Z)
     A                                      OVRDTA
     A            A1VEPV         1A  B 16 29OVRDTA
     A                                      COLOR(YLW)
     A            A1VEPF    R        B 16 35REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A                                 16 44'-'
6.NU A            A1VEPT    R        B 16 46REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.NU A            A1VEPO         1A  B 16 56OVRDTA
     A                                      COLOR(YLW)
     A            A1VEPP         1A  B 16 60OVRDTA
     A                                      COLOR(YLW)
     A            A1VEPS        15A  O 16 64OVRDTA
      *
6.30 A                                 18  2'eFaktura XML. . . .'
6.30 A            A1EFXA         4Y 0O 18 23EDTCDE(Z)
6.30 A                                      OVRDTA
6.30 A            A1EFXV         1A  B 18 29OVRDTA
6.30 A                                      COLOR(YLW)
6.30 A            A1EFXF    R        B 18 35REFFLD(SOBINR)
6.30 A                                      OVRDTA
6.30 A                                      COLOR(YLW)
6.30 A                                      CHECK(RB)
6.30 A                                 18 44'-'
6.30 A            A1EFXT    R        B 18 46REFFLD(SOBINR)
6.30 A                                      OVRDTA
6.30 A                                      COLOR(YLW)
6.30 A                                      CHECK(RB)
6.30 A            A1EFXO         1A  B 18 56OVRDTA
6.30 A                                      COLOR(YLW)
6.30 A            A1EFXP         1A  B 18 60OVRDTA
6.30 A                                      COLOR(YLW)
6.30 A            A1EFXS        15A  O 18 64OVRDTA
6.30 A                                 19  2'eFaktura mail XML .'
6.30 A            A1EMXA         4Y 0O 19 23EDTCDE(Z)
6.30 A                                      OVRDTA
6.30 A            A1EMXV         1A  B 19 29OVRDTA
6.30 A                                      COLOR(YLW)
6.30 A            A1EMXF    R        B 19 35REFFLD(SOBINR)
6.30 A                                      OVRDTA
6.30 A                                      COLOR(YLW)
6.30 A                                      CHECK(RB)
6.30 A                                 19 44'-'
6.30 A            A1EMXT    R        B 19 46REFFLD(SOBINR)
6.30 A                                      OVRDTA
6.30 A                                      COLOR(YLW)
6.30 A                                      CHECK(RB)
6.30 A            A1EMXO         1A  B 19 56OVRDTA
6.30 A                                      COLOR(YLW)
6.30 A            A1EMXP         1A  B 19 60OVRDTA
6.30 A                                      COLOR(YLW)
6.30 A            A1EMXS        15A  O 19 64OVRDTA
      *
     A                                 23  2'F3=Gå tilbake  F6=Les ant.  F10=St-
     A                                      art generering  F11=Vis fakt.logg'
     A                                      COLOR(BLU)
