     A*%%TS  SD  20061125  092227  KOB         REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/BFRF BFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A*
     A          R B1SFL                     SFL
     A*%%TS  SD  20061125  092227  KOB         REL-V5R4M0  5722-WDS
     A            B1VALG    R        B 10  2REFFLD(BÅVALA)
     A                                      COLOR(YLW)
     A            B1WSID    R        H      REFFLD(BOWSID)
     A            B1AARR    R        H      REFFLD(BOAARR)
     A            B1DATE    R        H      REFFLD(BODATE)
     A            B1BONG    R        O 10  4REFFLD(BOBONG)
     A            B1OTYP    R        O 10 17REFFLD(BOOTYP)
     A            B1FDAT         6Y 0O 10 20EDTWRD('  .  .  ')
     A            B1ORNR    R        O 10 29REFFLD(BOORNR)
6.NU A            B1KUND    R        O 10 38REFFLD(BOKUND)
6.NU A            B1NAVN    R   22   O 10 45REFFLD(BONAVN)
     A            B1TOTS    R        O 10 68REFFLD(BOTOTS)
     A*
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20061125  091334  KOB         REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0011)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA01
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A                                      SFLCSRRRN(&WCURRN)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            WCURRN         5S 0H
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Shop'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Spørring på bongregister'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4 65'År . . .'
     A                                      COLOR(BLU)
     A                                  5  2'Velg og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  5 65'Dato . .'
     A                                      COLOR(BLU)
     A            B2BID1         6Y 0O  5 74COLOR(BLU)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                  6  3'5=Vise  6=Skriv kopi'
     A                                      COLOR(BLU)
     A                                  8  2'V Bongnr.      Ty Dato     Ordre  -
6.NU A                                        Kunde  Navn                      -
     A                                      Beløp'
     A                                      COLOR(WHT)
     A            B2BONG    R        B  9  4REFFLD(BOBONG)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2DATE         6Y 0B  9 20COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            B2ORNR    R        B  9 29REFFLD(BOORNR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
6.nu A            B2KUND    R        B  9 38REFFLD(BOKUND)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B2AARR    R        B  4 74REFFLD(BFRFR/BÅAARR *LIBL/BFRF)
     A*
     A          R B2CMD
     A*%%TS  SD  19980615  155607  HKO         REL-V4R2M0  5769-PW1
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
