     A*%%TS  SD  20031107  105251  AMD         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R D1SFL                     SFL
     A*%%TS  SD  20031107  105251  AMD         REL-V5R2M0  5722-WDS
     A            D1SUFF    R        H      REFFLD(FDSUFF)
     A            D1LINE    R        H      REFFLD(FDLINE)
     A            D1NUMM    R        O  7  4REFFLD(FDNUMM)
6.NU A            D1VARE    R   -7   O  7 13REFFLD(FDVARE)
6.NU A            D1TEK1    R  -12   O  7 22REFFLD(FDTEK1)
     A            D1DATO         6Y 0O  7 46EDTWRD('  .  .  ')
     A                                      COLOR(RED)
     A            D1ANTA    R   -2 03O  7 55REFFLD(FDANTA)
     A                                      EDTWRD('      ,   ')
     A            D1ENH1    R        O  7 66REFFLD(FDENH1)
     A            D1ANTC    R   -2 03O  7 70REFFLD(FDANTC)
     A                                      EDTWRD('      ,   ')
     A          R D2CTL                     SFLCTL(D1SFL)
     A*%%TS  SD  20031107  105251  AMD         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF05
     A                                      CF08
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            SVRN02         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise innkommet antall fra bestilli-
     A                                      ng'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  4  2'Kundenummer . . .'
     A                                      COLOR(BLU)
     A            D2KUND    R        O  4 20REFFLD(FOKUND)
     A                                      COLOR(BLU)
     A            D2KUNA    R        O  4 27REFFLD(FOKUNA)
     A                                      COLOR(BLU)
     A                                  5 70'Bestilling'
     A                                      COLOR(WHT)
     A                                  6  2'  Ordre    Varenr.  Varetekst     -
     A                                                Lev.dato    Antall  Enh K-
     A                                      ommet inn'
     A                                      COLOR(WHT)
     A          R D2CMD
     A*%%TS  SD  19970605  110322  AMD         REL-V3R7M0  5716-PW1
     A                                 23  2'F1=Valg'
     A                                      COLOR(BLU)
     A                                 23 12'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 28'F5=Forny'
     A                                      COLOR(BLU)
     A                                 23 39'F2=Vis kun bestilte'
     A                                      COLOR(BLU)
     A                                 23 61'F8=Vis kun leverte'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
