     A*%%TS  SD  20021205  214256  ASK         REL-V5R1M0  5722-WDS
     A*%%EC
7.xx A*          260116 bsa  Justeringer basert på ny GUI og regler
     A*-----------------------------------------------------------------
7.00 A                                      DSPSIZ(24 80 *DS3 -
7.00 A                                             27 132 *WIDE)
7.00 A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20020312  192944  HKO         REL-V5R1M0  5722-WDS
     A                                      CF01
     A                                      CF03
     A                                      CF04
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise opplysninger'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
7.xx A                                  4  2'Varenummer . . . +'
     A                                      COLOR(BLU)
     A            B1VAR0         8Y 0B  4 21
     A  31                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 31)
     A                                      DSPATR(UL)
     A                                      CHECK(ER)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A            B1VAR1         7A  B  4 30DSPATR(ND)
     A                                      DSPATR(PR)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F4=Spørring'
     A                                      COLOR(BLU)
     A          R B2BLD
     A*%%TS  SD  20021205  214256  ASK         REL-V5R1M0  5722-WDS
     A                                      CF01
     A                                      CF03
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise opplysninger'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  4  2'Varenummer . . . .'
     A                                      COLOR(BLU)
     A            B1VAR0         8Y 0O  4 21DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A            B1VAR1         7A  B  4 30DSPATR(ND)
     A                                      DSPATR(PR)
     A            B2TEK1    R        O  4 39REFFLD(VVTEK1)
     A                                  8  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  9  2'Velg oppgave . . .'
     A                                      COLOR(BLU)
     A            B2VALG    R        B  9 21REFFLD(FÅSVAR)
     A                                      COLOR(YLW)
     A  41                                  DSPATR(PC)
     A                                      VALUES(0 1 2 3 4 5 6 9)
     A                                  9 26'1=Vise ordre med bestilt kvantum'
     A                                 10 26'2=Vise bestillinger med bestilt kv-
     A                                      antum'
     A                                 11 26'3=Vise lagerbeholdning'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
