     A*%%TS  SD  20110824  141816  BOF620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20110824  141816  BOF620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF06
     A                                      CF10
     A                                      CF11
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A*           W_DATO        10Y 0H       EDTWRD('    .  .  ')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Mangler nummer   '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Følgende nummer mangler   '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Fra Årstall :'
     A                                      COLOR(WHT)
     A            A1AARR    R        B  5 21REFFLD(SOAARR)
     A                                      COLOR(YLW)
     A  31                                  ERRMSGID(EMK0301 *LIBL/QMFOFAK 31)
     A                                  5 35'Fra - til'
     A                                      COLOR(WHT)
     A                                  6 35'nummer'
     A                                      COLOR(WHT)
     A            A1EFAF    R        B  8 35REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  32                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 32)
6.NU A                                  8 44'-'
6.NU A            A1EFAT    R        B  8 46REFFLD(SOBINR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 22  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  8  2'Ordre nummerserie'
