     A*%%TS  SD  20051028  121437  GRO550      REL-V5R3M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : FO575D
     A* Beskrivelse . . : Vise ordre/restet
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  270916  bsa  Justeringer basert på ny GUI og regler
     A*
8.01 A*K0000  140122 bsa  Omrokkerer og legger ut varekunde
8.02 A*K0000  020523 bsa  Jsutert skjermbilde da det ikke fungerer i cloud
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*%%EC
8.01 A**                                    DSPSIZ(24 80 *DS3)
8.01 A                                      DSPSIZ(27 132 *WIDE)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
7.xx A*                                     HOME(21)
     A*
     A          R B1SFL                     SFL
     A*%%TS  SD  20051027  123927  GRO550      REL-V5R3M0  5722-WDS
     A            B1NUMM    R        H      REFFLD(FONUMM)
     A            B1SUFF    R        H      REFFLD(FOSUFF)
     A            B1LINE    R        H      REFFLD(FDLINE)
     A            B1LAGE    R        H      REFFLD(FDLAGE)
8.02 A*           B1TEK1        75A  H
8.02 A*           B1VARE    R        H       EFFLD(FDVARE)
     A*
     A            B1VALG    R        B 14  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 5 8 9)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
8.02 A            B1VARE         8A  O 14  4
8.02 A            B1TEK1        72A  O 14 13
8.02 A            B1ENH1         3A  O 14 86
8.02 A            B1ANTA        13A  O 14 90
8.02 A            B1BEHL         9A  O 14105
8.02 A            B1DISP         9A  O 14116
8.01 A**          B1TEXT        75A  O 14  4
8.02 A**          B1TEXT       119A  O 14  4
     A*
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20051028  120320  GRO550      REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0500)
8.01 A                                      SFLPAG(0011)
7.xx A*                                     ROLLUP(10)
7.xx A*                                     ROLLDOWN(11)
     A                                      CA03
     A                                      CF10
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
7.xx A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
8.01 A                                  1118'Kl. :'
     A                                      COLOR(WHT)
8.01 A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise ordre/restet'
     A                                      COLOR(WHT)
7.xx A                                  2 38'FO575B2'
7.xx A                                      COLOR(WHT)
7.xx A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
7.xx A                                  2 54USER
     A                                      COLOR(WHT)
8.01 A                                  2118'Dato:'
     A                                      COLOR(WHT)
8.01 A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
8.01 A                                      ------------------------------------
8.01 A                                      ---------------------------'
     A                                      COLOR(WHT)
8.01 A                                  4  2'Vare-   '
8.01 A            B3LKUN    R        O  4 11REFFLD(FOKUND)
8.01 A                                      COLOR(YLW)
8.01 A                                      OVRDTA
8.01 A            B3KUNA    R   -7   O  4 18REFFLD(FONAVN)
8.01 A                                      COLOR(YLW)
8.01 A                                      OVRDTA
8.01 A                                  4 44'Faktura-'
8.01 A**                                4  2'Kunde. .'
8.01 A            B2KUND    R        O  4 53REFFLD(FOKUND)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.01 A            B2KNAV    R   -7   O  4 60REFFLD(FONAVN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.01 A                                  4 86'Ordrenr. . .'
8.01 A            B2NUMM    R        O  4 99REFFLD(FONUMM)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.01 A            B2SUFF    R        O  4108REFFLD(FOSUFF)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.01 A                                  5  2'kunde   '
8.01 A            B3LGAT    R        O  5 11REFFLD(FOADR1)
8.01 A                                      COLOR(YLW)
8.01 A                                      OVRDTA
8.01 A                                  5 44'kunde   '
8.01 A            B2KGAT    R        O  5 53REFFLD(FOADR1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.01 A                                  5 86'Ordredato. .'
8.01 A            B2BDAT         6Y 0O  5 99EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.01 A            B3LSTE    R        O  6 11REFFLD(FOSTED)
8.01 A                                      COLOR(YLW)
8.01 A                                      OVRDTA
8.01 A            B2KSTE    R        O  6 53REFFLD(FOSTED)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.01 A                                  6 86'Oppf.dato. .'
8.01 A            B2DDAT         6Y 0O  6 99EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.01 A            B3MOTX         4A  O  7 11COLOR(YLW)
8.01 A                                      OVRDTA
8.01 A            B3MOBI    R        O  7 16REFFLD(FOMOBI)
8.01 A                                      COLOR(YLW)
8.01 A                                      OVRDTA
8.01 A            B2MOTX         4A  O  7 53COLOR(YLW)
     A                                      OVRDTA
8.01 A            B2MOBI    R        O  7 58REFFLD(FOMOBI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.01 A                                  7 86'Lev. dato. .'
8.01 A            B2LDAT         6Y 0O  7 99EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Kunde-  '
     A            B2NAVN    R        O  8 11REFFLD(FONAVN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.01 A                                  8 86'Vår ref. . .'
8.01 A            B2VREF        25A  O  8 99COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'prosjekt'
     A            B2ADR1    R        O  9 11REFFLD(FOADR1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.01 A                                  9 86'Kundens ref.'
8.01 A            B2DREF        25A  O  9 99COLOR(YLW)
     A                                      OVRDTA
     A            B2STED    R        O 10 11REFFLD(FOSTED)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.01 A                                 10 44'Ordretotal .'
     A                                      COLOR(WHT)
8.01 A            B2SALG    R        O 10 57REFFLD(FOTOTS)
     A                                      OVRDTA
     A                                      COLOR(WHT)
     A                                 11  2'Info.. .'
     A            B2INF1    R        O 11 11REFFLD(FOINF1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2INF2    R        O 11 24REFFLD(FOINF2)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'5=Vis  8=Disponibelt  9=Lagerinfo'
     A                                      COLOR(BLU)
7.xx A*                                13  2'V'
7.xx A*                                     COLOR(WHT)
8.02 A                                 13  2'V'
8.02 A                                      COLOR(WHT)
8.02 A                                 13  4'Varenr. '
8.02 A                                      COLOR(WHT)
8.02 A                                 13 13'Varetekst                         '
8.02 A                                      COLOR(WHT)
8.02 A                                 13 86'Enh'
8.02 A                                      COLOR(WHT)
8.02 A                                 13 95'Antall'
8.02 A                                      COLOR(WHT)
8.02 A                                 13105'Beholdn'
8.02 A                                      COLOR(WHT)
8.02 A                                 13120'Disp'
8.02 A*                                13  2'V Varenr.  Varetekst             -
8.02 A*                                                                       -
8.02 A*                                              -
8.02 A*                                             Enh      Antall    Beholdn-
8.02 A*                                          Disp'
7.xx A                                      COLOR(WHT)
7.xx A*                                 13  4'Varenr. '
7.xx A*                                      COLOR(WHT)
7.xx A*                                 13 13'Varetekst                   '
7.xx A*                                      COLOR(WHT)
7.xx A*                                 13 42'Enh      '
7.xx A*                                      COLOR(WHT)
7.xx A*                                 13 52'Antall  '
7.xx A*                                      COLOR(WHT)
7.xx A*                                 13 61'Beholdn     '
7.xx A*                                      COLOR(WHT)
7.xx A*                                 13 74'Disp '
7.xx A*                                      COLOR(WHT)
     A*
     A          R B2CMD
     A*%%TS  SD  20051028  121437  GRO550      REL-V5R3M0  5722-WDS
8.01 A                                 26  2'F3=Gå tilbake   F10=Endre ordre'
     A                                      COLOR(BLU)
