     A*%%TS  SD  20050705  124206  AMD530      REL-V5R2M0  5722-WDS
     A*
     A*K0000    240723  bsa  Legger inn fakturaperiode
     A*
     A*
     A*
     A*-------------------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3 -
     A                                             27 132 *WIDE)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R F2BLD
     A*%%TS  SD  20050705  124206  AMD530      REL-V5R2M0  5722-WDS
     A                                      CF03
     A                                      CF04
     A                                      CF18
     A                                      KEEP
     A                                  7 22'Periode og fakturadato'
     A                                      COLOR(WHT)
7.xx A                                  9 22'Periode. . . .'
7.xx A            F2PERI    R   -2   B  9 40REFFLD(FK1PER)
7.xx A**                                    OVRDTA
     A  31                                  ERRMSGID(FM01110 *LIBL/QMFOFAK 31)
     A  33                                  ERRMSGID(FM01120 *LIBL/QMFOFAK 33)
     A  34                                  ERRMSGID(FM01180 *LIBL/QMFOFAK 34)
     A  35                                  ERRMSGID(FM01190 *LIBL/QMFOFAK 35)
     A  36                                  ERRMSGID(FM01230 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Y)
     A                                 10 22'Faktura-dato .'
     A            F2DATO         6Y 0B 10 37COLOR(YLW)
     A  32                                  ERRMSGID(FM01130 *LIBL/QMFOFAK 32)
     A                                      EDTCDE(Y)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F4=Jobbkø'
     A                                      COLOR(BLU)
     A                                 23 30'F18=Overstyre'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
