     A*%%TS  SD  20070329  155615  ASK550      REL-V5R4M0  5722-WDS
     A*
     A*%%EC
7.00 A                                      DSPSIZ(24 80 *DS3 -
7.00 A                                             27 132 *WIDE)
7.00 A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20070313  143549  ASK550      REL-V5R4M0  5722-WDS
     A            B1LINE    R        H      REFFLD(FDLINE)
     A            B1SUFF    R        H      REFFLD(FDBSUF)
     A            B1VALG    R        B 11  2REFFLD(FÅVALG)
     A                                      VALUES(0 2 4 6 7 8)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      EDTCDE(Z)
     A            B1BEKO         1A  O 11  5
     A            B1LDOR         6Y 0O 11  8EDTCDE(Z)
     A            B1LNAV        30A  O 11 15
6.NU A            B1BEST         8Y 0O 11 46EDTCDE(Z)
6.NU A            B1DIST         6A  O 11 56
6.NU A            B1DUSE         8A  O 11 63
     A            B1DDAT         6Y 0O 11 72EDTWRD('  .  .  ')
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20070329  155615  ASK550      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0011)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF08
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A                                      CF13
     A                                      CF14
     A                                      CF20
     A                                      CF21
     A                                      CF23
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            B2ANTA    R        H      REFFLD(FDANTA)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Automatisk bestilling'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Ordre:'
     A                                      COLOR(WHT)
     A            B2ONUM    R        O  4  9REFFLD(FONUMM)
     A                                      OVRDTA
6.NU A            B2OTYP    R        O  4 18REFFLD(FOOTYP)
     A                                      OVRDTA
6.NU A            B2NAVN    R   -1   O  4 21REFFLD(FONAVN)
     A                                      OVRDTA
6.NU A            B3NAVN    R   -1   O  4 51REFFLD(FONAVN)
     A                                      OVRDTA
     A                                  5  2'Kunde:'
     A                                      COLOR(WHT)
     A            B2KUND    R        O  5  9REFFLD(FOKUND)
     A                                      OVRDTA
     A            B2ADR1    R        O  5 19REFFLD(FOADR1)
     A                                      OVRDTA
     A            B3ADR1    R        O  5 50REFFLD(FOADR1)
     A                                      OVRDTA
     A                                  6  2'L.kun:'
     A                                      COLOR(WHT)
     A            B2LKUN    R        O  6  9REFFLD(FOLKUN)
     A                                      OVRDTA
     A            B2STED    R        O  6 19REFFLD(FOSTED)
     A                                      OVRDTA
     A            B3STED    R        O  6 50REFFLD(FOSTED)
     A                                      OVRDTA
     A                                  7  2'Leveringstype:'
     A                                      COLOR(WHT)
     A            B3LETY    R        O  7 17REFFLD(FOLETY)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            B2BESK        30A  O  7 19OVRDTA
     A                                  7 60'Tlf:'
     A            B2TLFN        15A  O  7 65OVRDTA
     A  75                              8 43'Bonusavtale'
     A  75                                  COLOR(RED)
     A N75                                  DSPATR(ND)
     A                                  8 60'Mob:'
     A            B2MOBN        15A  O  8 65OVRDTA
     A                                  9  3'2=Bestill/Endre  6=Skriv ut  7=Arb-
     A                                      eide med bestilling  8=Send bestill-
     A                                      ing'
     A                                      COLOR(BLU)
     A                                 10  2'V Bes        Leverandør           -
6.NU A                                                Bestnr    Type   Bruker  -
     A                                        Dato'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20060203  152547  ASK550      REL-V5R3M0  5722-WDS
     A                                 23  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
