     A*%%TS  SD  20060214  202207  ASK550      REL-V5R3M0  5722-WDS
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20060205  180919  ASK550      REL-V5R3M0  5722-WDS
     A            B1VALG    R        B 10  2REFFLD(FÅVALG)
     A                                      VALUES(0 2 4)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      EDTCDE(Z)
     A            B1VARE         8A  O 10  4
     A            B1TEK1        34A  O 10 13
     A            B1VTYP         1A  O 10 48
     A            B1LTYP         1  0O 10 50EDTCDE(Z)
     A            B1LVAR         1  0O 10 52EDTCDE(Z)
     A            B1ANTO         9Y 3O 10 54EDTWRD('    0 ,   -')
     A            B1ENHE         3A  O 10 66
     A            B1ANTB         9Y 3O 10 70EDTWRD('    0 ,   -')
     A            B1OLIN         4Y 0H
     A*
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20060205  183744  ASK550      REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CF07
     A                                      CF09
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            B2ANTA    R        H      REFFLD(FDANTA)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bestillingslinjer til leverandør'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Ordre:'
     A                                      COLOR(WHT)
     A            B2ONUM    R        O  4  9REFFLD(FONUMM)
     A                                      OVRDTA
6.NU A            B2OTYP    R        O  4 18REFFLD(FOOTYP)
     A                                      OVRDTA
     A                                  4 40'Best.:'
     A                                      COLOR(WHT)
     A            B2BNUM    R        O  4 47REFFLD(FONUMM)
     A                                      OVRDTA
6.NU A            B2BTYP    R        O  4 56REFFLD(FOOTYP)
     A                                  5  2'Kunde:'
     A                                      COLOR(WHT)
     A            B2KUND    R        O  5  9REFFLD(FOKUND)
     A                                      OVRDTA
     A                                  5 40'Levr.:'
     A                                      COLOR(WHT)
     A            B2LEVR    R        O  5 47REFFLD(FOKUND)
     A                                      OVRDTA
     A            B2KNAV    R        O  6  9REFFLD(FONAVN)
     A                                      OVRDTA
     A            B2LNAV    R        O  6 47REFFLD(FONAVN)
     A                                      OVRDTA
     A                                  7 47'Tlf:'
     A                                      COLOR(WHT)
     A            B2LTLF        11A  O  7 52
     A                                  7 64'Fax:'
     A                                      COLOR(WHT)
     A            B2LFAX        11A  O  7 69
     A                                  8  2'2=Endre  4=Slett'
     A                                      COLOR(BLU)
     A                                  9  2'V Varenr   Varetekst              -
     A                                                  V L S   Ordreant  Enh  -
     A                                       Best.ant'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20060214  200804  ASK550      REL-V5R3M0  5722-WDS
     A                                 23  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                 23 14'F7=Vis/skjul alle varer'
     A                                      COLOR(BLU)
     A                                 23 39'F9=Bestill'
     A                                      COLOR(BLU)
     A*
     A          R B9WIN
     A*%%TS  SD  20060214  202207  ASK550      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      PUTOVR
     A                                      WINDOW(*DFT 8 32)
     A                                  1  2'Valg av leverandør'
     A                                      COLOR(WHT)
     A                                  3  3'Leverandør:'
     A            B9LEVR    R        B  3 15REFFLD(FOKUND)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B9LNAV    R        O  5  3REFFLD(FONAVN)
     A                                      OVRDTA
     A                                  7  2'F3=Gå tilbake  F4=Søk'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
