     A*%%TS  SD  19970620  141111  HKO         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19970620  141111  HKO         REL-V3R7M0  5716-PW1
     A*                                     WINDOW(*DFT 15 50)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Bytter rabattkategori på kunder o-
     A                                      g ordre '
     A                                      DSPATR(RI)
     A                                  4  2'Gammel rabattkategori .'
     A            B1RABG    R        B  4 26REFFLD(FPRKAT)
     A  31                                  ERRMSGID(FRK0200 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  6  2'Ny rabattkategori . . .'
     A            B1RABN    R        B  6 26REFFLD(FPRKAT)
     A  32                                  ERRMSGID(FRA0620 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
