     A*%%TS  SD  20080325  153918  AMD560      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3 -
     A                                             27 132 *WIDE)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20080325  153918  AMD560      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_AREC &W_AFLD)
7.00 A*                                      WINDOW(*DFT 21 54)
     A            W_AREC        10A  H
     A            W_AFLD        10A  H
7.00 A            L_FNAV        30A  O  1  2COLOR(WHT)
7.00 A                                  1 46'Ordre/Fakturering'
7.00 A                                      COLOR(WHT)
7.00 A                                  1 66'Kl. :'
7.00 A                                      COLOR(WHT)
7.00 A                                  1 72TIME
7.00 A                                      COLOR(WHT)
7.00 A                                  2  2'Sende utskrift som e-mail'
7.00 A                                      COLOR(WHT)
7.00 A                                  2 38'FO798B1'
7.00 A                                      COLOR(WHT)
7.00 A                                  2 46'Bruker:'
7.00 A                                      COLOR(WHT)
7.00 A                                  2 54USER
7.00 A                                      COLOR(WHT)
7.00 A                                  2 66'Dato:'
7.000A                                      COLOR(WHT)
7.00 A                                  2 72DATE
7.00 A                                      EDTCDE(Y)
7.00 A                                      COLOR(WHT)
7.00 A                                  3  2'-----------------------------------
7.00 A                                      ------------------------------------
7.00 A                                      ---------'
7.00 A                                      COLOR(WHT)
7.00 A                                  6 51'  '
     A                                      DSPATR(RI)
7.00 A                                  4  2'Kunde/Lev.dør . .'
7.00 A            B1KUND    R        O  4 21REFFLD(RKKUND)
     A                                      COLOR(YLW)
7.00 A                                  5  2'Navn. . . . . . .'
7.00 A            B1NAVN    R        O  5 21REFFLD(RKNAVN)
     A                                      COLOR(YLW)
7.00 A                                  6  2'E-mail-adresser:'
7.00 A            B1EMAL        50A  B  7  2COLOR(YLW)
     A                                      CHECK(LC)
     A  31                                  ERRMSG('E-mail-adresse kan ikke vær-
     A                                      e blank' 31)
7.00 A            B1EMA2        50A  B  8  2COLOR(YLW)
6.32 A                                      CHECK(LC)
7.00 A            B1EMA3        50A  B  9  2COLOR(YLW)
6.32 A                                      CHECK(LC)
7.00 A                                 10  2'Emne i mailen :'
7.00 A            B1EMNE        50A  B 11  2COLOR(YLW)
     A                                      CHECK(LC)
     A                                      DSPATR(PC)
7.00 A                                 12  2'Melding til mottaker :'
7.00 A            B1TXT1        50A  B 13  2COLOR(YLW)
     A                                      CHECK(LC)
7.00 A            B1TXT2        50A  B 14  2COLOR(YLW)
     A                                      CHECK(LC)
7.00 A            B1TXT3        50A  B 15  2COLOR(YLW)
     A                                      CHECK(LC)
7.00 A            B1TXT4        50A  B 16  2COLOR(YLW)
     A                                      CHECK(LC)
7.00 A                                 17  2'Vår referanse :  '
7.00 A            B1PERS        50A  B 18  2COLOR(YLW)
     A                                      CHECK(LC)
7.00 A                                 19  2'Kopi sendes:'
7.00 A            B1KOPI        50A  B 20  2COLOR(YLW)
pdf  A                                      CHECK(LC)
7.00 A                                 23  1'F3=Gå tilbake'
     A                                      COLOR(BLU)
7.00 A                                 23 16'Trykk enter for å bekrefte'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
