     A*%%TS  SD  20051027  133719  AMD550      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20051027  133719  AMD550      REL-V5R3M0  5722-WDS
7.xx A                                      WINDOW(05 05 11 50)
     A                                      CA03
     A                                      CA12
     A                                  2  1' Endring av leveringstype '
     A                                      DSPATR(RI)
7.xx A                                  2 43'FO796B1'
     A                                  4  1'Det er bedt om endring av levering-
     A                                      stype.'
     A                                  5  1'Velg hvilke ordrelinjer som skal o-
     A                                      ppdateres.'
     A                                  7  1'Svar :'
     A            B1VALG         1A  B  7  9COLOR(YLW)
     A  31                                  ERRMSGID(FM00010 *LIBL/QMFOFAK 31)
     A                                  7 12'0 = Bare linjer med samme fra/lev.-
     A                                      type'
     A                                  8 12'1 = Alle ordrelinjer skal endres'
     A                                 10  1'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 10 17'Trykk enter for å bekrefte'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
