     A*%%TS  SD  20040818  152249  KOB         REL-V5R2M0  5722-WDS
     A*%%EC
     A*
7.xx A* 7.xx  150316  bsa  Justeringer basert på ny GUI og regler
     A*---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      CA03(03)
     A          R A2BLD
     A*%%TS  SD  20040818  152249  KOB         REL-V5R2M0  5722-WDS
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av automatiske etiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Innlegging av utvalgskriterier:'
     A                                      COLOR(WHT)
     A                                  7  2'Velg lager . . . :'
     A            A2LAGE    R        B  7 21REFFLD(VLLAGE)
     A  30                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  ERRMSG('Ugyldig lager - lager må væ-
     A                                      re dfinert i kodereg.' 30)
7.xx A                                  8  2'Velg leverandør. +'
     A            A2LDOR    R        B  8 21REFFLD(VVLDOR)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            A2LTEK        30A  O  8 28
     A                                  9  2'Alle varer . . . :'
     A            A2ALLE         1A  B  9 21
     A  31                                  ERRMSG('Feil valg - gyldige verdier-
     A                                       er L, S eller blank' 31)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'J')
     A                                  9 23'(J=Ja, Behandler alle varer i vare-
     A                                      registeret)'
     A                                 10 23'(Blank, Behandler kun varer som fi-
     A                                      nnes i lagerregisteret)'
     A                                 11  2'Velg varetype. . :'
     A            A2VTYP         1A  B 11 21
     A  31                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      DFTVAL('L')
     A  31                                  ERRMSG('Feil valg - gyldige verdier-
     A                                       er L, S eller blank' 31)
     A                                 11 23'(L=Lagervare, S=Skaffevarer, Blank-
     A                                      =Begge)'
     A                                 12  2'Kampanjevarer. . :'
     A            A2KAMP         1A  B 12 21
     A  32                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      DFTVAL(' ')
     A  32                                  ERRMSG('Feil valg - gyldige verdier-
     A                                       er J eller blank' 32)
     A                                 12 23'(J=Ja)'
     A                                 13  2'Ny utskrift. . . :'
     A            A2OMKJ         1A  B 13 21
     A  33                                  ERRMSG('Feil valg - gyldige verdier-
     A                                       er J eller blank' 33)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A**                                    VALUES(' ' 'J')
     A                                 13 23'(Ny etikett uavhengig av ny pris.-
     A                                      J=Ja)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
