     A*%%TS  SD  20061105  110529  KOB         REL-V5R4M0  5722-WDS
     A*%%EC
7.xx A* 7.xx  090316  bsa  Justeringer basert på ny GUI og regler
     A*---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      CA03(03)
     A          R A1BLD
     A*%%TS  SD  20020312  212617  HKO         REL-V5R1M0  5722-WDS
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av etiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Innlegging av utvalgskriterier:'
     A                                      COLOR(WHT)
     A                                  7  2'Utvalgskriterier . . . . . .'
     A            A1VALG         1D 0B  7 31CHECK(RB)
     A  20                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 35'(0=Fra/til nummer)'
     A                                  8 35'(1=Enkeltvarenummer)'
     A                                  9 35'(2=Kampanje)'
     A                                 10 35'(3=Salgsdato)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            MELD          78A  O 24  2
     A  96                                  DSPATR(RI)
     A          R B1BLD
     A*%%TS  SD  20060501  203902  KOB         REL-V5R3M0  5722-WDS
     A                                      CF04
     A                                      CF05
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av etiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Seleksjon:'
     A                                      COLOR(WHT)
     A                                  6 32'Fra'
7.xx A                                  6 49'Til'
7.xx A                                  7  2'Leverandør . . . . . . . . +'
     A            B1LDOR    R        B  7 31REFFLD(FÅLDOR)
     A                                      DSPATR(UL)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
7.xx A                                  8  2'Varenummer . . . . . . . . +'
     A            B1FVNR         8Y 0B  8 31TEXT('Varenummer fra')
     A  30                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
7.xx A                                  8 46'+'
7.xx A            B1TVNR         8Y 0B  8 48TEXT('Varenummer til')
     A  31                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
7.xx A                                  9  2'Varegruppe . . . . . . . . +'
     A            B1FOGR    R        B  9 31REFFLD(FÅHGRP)
     A  32                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
7.xx A                                  9 34'+'
7.xx A            B1FHGR    R        B  9 36REFFLD(FÅHGRP)
     A  32                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
7.xx A                                  9 39'+'
7.xx A            B1FUGR    R        B  9 41REFFLD(FÅUGRP)
     A  34                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
7.xx A                                  9 46'+'
7.xx A            B1TOGR    R        B  9 48REFFLD(FÅHGRP)
     A  33                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
7.xx A                                  9 51'+'
7.xx A            B1THGR    R        B  9 53REFFLD(FÅHGRP)
     A  33                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
7.xx A                                  9 56'+'
7.xx A            B1TUGR    R        B  9 58REFFLD(FÅUGRP)
     A  35                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10  2'Lager. . . . . . . . . . . .'
     A            B1LAGE    R        B 10 31REFFLD(FÅLAGE)
     A                                      COLOR(YLW)
     A                                 11  2'Lagerplass . . . . . . . . .'
     A            B1FPLS    R        B 11 31REFFLD(VVPLAS)
     A  37                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
7.xx A            B1TPLS    R        B 11 48REFFLD(VVPLAS)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13  2'Antall etiketter . . . . . .'
     A            B1ANTA         6Y 0B 13 31TEXT('Antall etiketter')
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A            MELD          78A  O 24  2
     A  96                                  DSPATR(RI)
     A          R B2BLD
     A*%%TS  SD  20060509  120116  KOB         REL-V5R3M0  5722-WDS
     A                                      CF04
     A                                      CF05
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av etiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Inntasting av varenummer:'
     A                                      COLOR(WHT)
7.xx A                                  7  3'Varenr/GTIN-nr.'
     A                                  7 20'Antall'
     A                                  7 29'Varetekst'
7.xx A                                  8  1'+'
7.xx A            B2VARE        14Y 0B  8  3
     A  30                                  DSPATR(PC)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
6.31 A**                                    CHECK(ER)
     A            B2ANTA         6  0B  8 20CHECK(ER)
     A  31                                  DSPATR(PC)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            B2TEXT        30A  O  8 29
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A                                 23 32'F5=Starte utskrift'
     A                                      COLOR(BLU)
     A            MELD          78A  O 24  2
     A  96                                  DSPATR(RI)
     A          R B3BLD
     A*%%TS  SD  20060501  162402  KOB         REL-V5R3M0  5722-WDS
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av etiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  2'Seleksjon av kampanje:'
     A                                      COLOR(WHT)
     A                                  7  2'Kampanje . . . . . . . . . .'
     A            B3KAMP    R        B  7 31REFFLD(FFRFR/VTKAMP *LIBL/FFRF)
     A                                      COLOR(YLW)
     A                                  8  2'Lager. . . . . . . . . . . .'
     A            B3LAGE    R        B  8 31REFFLD(FÅLAGE)
     A                                      COLOR(YLW)
     A                                 10  2'Antall etiketter . . . . . .'
     A            B3ANTA         6Y 0B 10 31CHECK(RZ)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            MELD          78A  O 24  2
     A  96                                  DSPATR(RI)
     A          R B4BLD
     A*%%TS  SD  20061002  115348  KOB         REL-V5R3M0  5722-WDS
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av etiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Seleksjon av prisdato:'
     A                                      COLOR(WHT)
7.xx A                                  7  2'Leverandør . . . .+'
     A            B4LDOR    R        B  7 22REFFLD(FÅLDOR)
     A                                      DSPATR(UL)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                  8  2'Lager. . . . . . .:'
     A            B4LAGE    R        B  8 22REFFLD(FÅLAGE)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9  2'Salgsprisdato. fra:'
     A            B4FDAT         6Y 0B  9 22CHECK(RZ)
     A  20                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 30'til'
     A            B4TDAT         6Y 0B  9 35CHECK(RZ)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                 11  2'Antall etiketter .:'
     A            B4ANTA         6Y 0B 11 22CHECK(RZ)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake  F4=Spørring'
     A                                      COLOR(BLU)
     A            MELD          78A  O 24  2
     A  96                                  DSPATR(RI)
     A          R C1BLD
     A*%%TS  SD  20061104  003936  KOB         REL-V5R4M0  5722-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av etiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Etikett-type . . . . . . . .'
     A            C1ETYP         1D 0B  5 31CHECK(RB)
     A  20                                  DSPATR(PC)
     A                                      COLOR(YLW)
6.12 A                                  5 35'1=Vare, 2=Hylle-75x28'
     A                                  6 35'3=Hylle-100x28, 4=Reol-202x60'
     A                                  7 35'5=Hylle-76x39, 6=Hylle-48x38'
     A                                  8 35'7=Hylle-100x38, 8=Reol-210x60'
     A                                  9 35'9=Hylle-76x39 Laser/Interform'
     A                                 11  2'Pris på etiketten. . . . . .'
     A            C1ETPR         1D 0B 11 31
     A N98                                  DFTVAL('2')
     A                                      CHECK(RB)
     A  21                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 35'1=Uten pris'
     A                                 12 35'2=Med vanlig pris'
     A                                 13 35'3=Med tilbudspris'
7.xx A                                 14  2'Tilbudspris Dato:'
7.xx A            C1DATO         6Y 0B 14 20CHECK(RZ)
     A  21                                  DSPATR(PC)
     A                                      COLOR(YLW)
7.xx A                                 16  2'Sortering. . . . . . . . . .'
7.xx A            C1SORT         1D 0B 16 31
     A N98                                  DFTVAL('0')
     A                                      CHECK(RB)
     A  22                                  DSPATR(PC)
     A                                      COLOR(YLW)
7.xx A                                 16 35'0=Varenummer, 1=Lagerplass'
7.xx A                                 17 35'2=Leverandør, 3=Varegruppe'
7.xx A                                 19  2'Pris 1 hentes fra enhet. . .'
7.xx A            C1ENH1         1D 0B 19 31
     A N98                                  DFTVAL('1')
     A                                      CHECK(RB)
     A  23                                  DSPATR(PC)
     A                                      COLOR(YLW)
7.xx A                                 19 35'0=Ingen pris, 1=Enhet-1, 2=Enhet-2-
     A                                      , 3=Enhet-3'
7.xx A                                 20  2'Pris 2 hentes fra enhet. . .'
7.xx A            C1ENH2         1D 0B 20 31
     A N98                                  DFTVAL('2')
     A                                      CHECK(RB)
     A  25                                  DSPATR(PC)
     A                                      COLOR(YLW)
7.xx A                                 20 35'0=Ingen pris, 1=Enhet-1, 2=Enhet-2-
     A                                      , 3=Enhet-3'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            MELD          78A  O 24  2
     A  96                                  DSPATR(RI)
