     A*%%TS  SD  20020312  213923  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      CA03(03)
     A          R A1BLD
     A*%%TS  SD  20020312  213923  HKO         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av reklame-etiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Tekst på reklame-etikett . .'
     A            A1FAS1    R        B  5 31REFFLD(VNFAS1)
     A                                      COLOR(YLW)
     A            A1FAS2    R        B  6 31REFFLD(VNFAS2)
     A                                      COLOR(YLW)
     A            A1FAS3    R        B  7 31REFFLD(VNFAS3)
     A                                      COLOR(YLW)
     A            A1FAS4    R        B  8 31REFFLD(VNFAS4)
     A                                      COLOR(YLW)
     A                                 10  2'Antall etiketter . . . . . .'
     A            A1ANTA         4Y 0B 10 31COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHECK(RZ)
     A                                 12  2'Skrivertype. . . . . . . . .'
     A            A1SKTY    R        B 12 31REFFLD(VNSKTY)
     A                                      EDTCDE(1)
     A                                      COLOR(YLW)
     A                                 12 33'(0=Meto 8100 Twinax)'
     A                                 13 33'(1=Meto 8100 Standard)'
     A                                 14 33'(2=Meto Bandit)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            MELD          78A  O 24  2
     A  96                                  DSPATR(RI)
