     A*%%TS  SD  20100429  140048  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      MSGLOC(16)
     A          R B1BLD
     A*%%TS  SD  20100429  140048  BOF610      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  1  2' ETIKETTUTSKRIFT '
     A                                      DSPATR(RI)
     A                                  3  2'Etikettype:'
     A            B1ETYP         1D 0B  3 15CHECK(RB)
     A                                      COLOR(YLW)
     A                                  4  2'(1=Pris Etikett  )'
     A                                  5  2'(2=Hylle -  75x28)'
     A                                  6  2'(3=Hylle - 100x28)'
     A                                  7  2'(4=Reol  - 202x60)'
     A                                  9  2'(6=Hylle - 48x38)'
     A                                 10  2'(7=Hylle - 100x38)'
     A                                 11  2'(8=Reol  - 210x60)'
     A                                 12  2'Priskode . :'
     A            B1ETPR         1D 0B 12 15CHECK(RB)
     A                                      COLOR(YLW)
     A                                 13  2'(1=Uten 2=Vanlig)'
6.20 A                                 14  2'(3=Tilb.pris)'
     A                                 15  2'F3=Gå tilbake'
     A                                      COLOR(WHT)
     A                                  8  2'(5=Hylle -  75x39)'
