     A*%%TS  SD  20050922  093418  GRO540      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20050922  093418  GRO540      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CF06
     A                                      CF10
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      PUTOVR
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av kollietiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  5'Ordrenummer . . . . . .'
     A            A1NUMM    R        B  5 31REFFLD(SONUMM)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            A1SUFF    R        B  5 40REFFLD(SOSUFF)
     A                                      OVRDTA
     A                                      COLOR(YLW)
      *
     A                                  7  5'Kundenummer . . . . . .'
     A            A1KUND    R        O  7 31REFFLD(SOKUND)
     A                                      OVRDTA
     A**                                    COLOR(YLW)
     A            A1KTXT    R        O  7 38REFFLD(FONAVN)
     A                                      OVRDTA
     A                                  9  5'Kundeadresse          '
     A                                  9 38'Leveringsadresse      '
     A            A1NAVN    R        O 10  5REFFLD(FONAVN)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            A1LNAV    R        O 10 38REFFLD(FONAVN)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            A1ADR1    R        O 11  5REFFLD(FONAVN)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            A1LAD1    R        O 11 38REFFLD(FONAVN)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            A1ADR2    R        O 12  5REFFLD(FONAVN)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            A1LAD2    R        O 12 38REFFLD(FONAVN)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            A1STED    R        O 13  5REFFLD(FONAVN)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            A1LSTD    R        O 13 38REFFLD(FONAVN)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            A1ATRE         2S 0B 15  5
     A  31                                  ERRMSG('Antall må fylles ut')
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                 15 10'Trelast'
     A            A1TTXT        24   B 15 18
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            A1APAL         2S 0B 16  5
     A  32                                  ERRMSG('Antall må fylles ut')
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                 16 10'Pall   '
     A            A1PTXT        24   B 16 18
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            A1AAND         2S 0B 17  5
     A  33                                  ERRMSG('Antall må fylles ut')
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                 17 10'Andre  '
     A            A1ATXT        24   B 17 18
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake  F6=Skriv koll-
     A                                      ietiketter  F10=Ordre'
     A                                      COLOR(BLU)
