     A*%%TS  SD  20111020  145950  AMD620      REL-V7R1M0  5770-WDS
0000 A*0IGC 0DS4  V3R1M0                    910710
     A*%%EC
7.xx A* 7.xx  090316  bsa  Justeringer basert på ny GUI og regler
     A*---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20111020  145950  AMD620      REL-V7R1M0  5770-WDS
     A                                      KEEP
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CA07
6.15 A                                      CA08
     A                                      CA09
     A                                      CF12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Varemottak'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
7.xx A                                  6  3'Varenr/GTIN-nr'
7.xx A                                  6 20'Antall'
7.xx A                                  6 27'Pris'
7.xx A                                  6 33'Varenummer. .:'
7.xx A            A2VARE    R        O  6 48REFFLD(VVVARE)
     A                                      COLOR(WHT)
7.xx A                                  7  1'+'
7.xx A            A1EANN    R        B  7  3REFFLD(FÅEANN)
     A                                      COLOR(YLW)
     A                                      CHECK(ER)
7.xx A            A1ANTA         4Y 0B  7 20TEXT('Antall etiketter')
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      CHECK(ER)
7.xx A            A1VALG         1D 0B  7 28TEXT('Etikett med/uten pris')
     A                                      CHECK(RZ)
     A  34                                  DSPATR(PC)
     A                                      COLOR(YLW)
7.xx A                                  7 33'Varetekst . .:'
7.xx A            A2TEK1    R        O  7 48REFFLD(FÅTEK1)
     A                                      COLOR(WHT)
7.xx A                                  8 33'Enhet1. . . .:'
7.xx A            A2ENH1    R        O  8 48REFFLD(FÅENHE)
     A                                      COLOR(WHT)
7.xx A                                  9  3'Eget varenummer'
7.xx A                                  9 33'Pris eks.mva :'
7.xx A            A2SAPR    R        O  9 48REFFLD(VPSAPR)
     A                                      COLOR(WHT)
     A                                      TEXT('Ny salgspris eks.mva')
7.xx A                                 10  1'+'
7.xx A            A1EVNR         8Y 0B 10  3TEXT('Eget varenummer')
     A                                      CHECK(RZ)
     A                                      CHECK(ER)
     A  32                                  DSPATR(PC)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
7.xx A                                 10 33'Pris inkl.mva:'
7.xx A            A2SMVA    R        O 10 48REFFLD(VPSAPR)
     A                                      COLOR(WHT)
     A                                      TEXT('Ny salgspris inkl.mva')
7.xx A                                 11 33'GTIN-nr.  . .:'
7.xx A            A2EANN    R        O 11 48REFFLD(FÅEANN)
     A                                      COLOR(WHT)
7.xx A                                 12  3'Leverandørens varenummer'
7.xx A                                 12 33'Lev. varenr .:'
7.xx A            A2LVAR    R        O 12 48REFFLD(FÅLVAR)
     A                                      COLOR(WHT)
7.xx A            A1LVAR    R        B 13  3REFFLD(FÅLVAR)
     A                                      COLOR(YLW)
7.xx A                                 13 33'Melding . . .:'
7.xx A            A2MELD        16A  O 13 48COLOR(WHT)
     A                                 22  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 22 17'F4=Spørring'
     A                                      COLOR(BLU)
     A                                 22 30'F5=Forny'
     A                                      COLOR(BLU)
     A                                 22 40'F7=Skriv prisetikett'
     A                                      COLOR(BLU)
6.15 A                                 22 62'F8=Lag GTIN nr'
6.15 A                                      COLOR(BLU)
     A                                 23  2'F9=Skriv hylleetikett'
     A                                      COLOR(BLU)
     A            MELD          78A  O 24  2
     A  96                                  DSPATR(RI)
