     A*%%TS  SD  20020312  221037  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      CA03(03)
     A                                      CA04(04)
     A                                      CA05(05)
     A                                      CA12(12)
0014 A*                                                                ########
     A          R A1BLD
     A*%%TS  SD  20020312  221037  HKO         REL-V5R1M0  5722-WDS
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av etiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Kundenummer. . . . . . . . .'
     A            A1KUND    R        B  5 31REFFLD(RFRFR/RKKUND *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                      CHECK(RZ)
     A            A1NAVN    R        O  5 39REFFLD(RFRFR/RKNAVN *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                  7  2'Tekst på etikett . . . . . .'
     A            A1FAS1    R        B  7 31REFFLD(VNFAS1)
     A                                      COLOR(YLW)
     A            A1FAS2    R        B  8 31REFFLD(VNFAS2)
     A                                      COLOR(YLW)
     A            A1FAS3    R        B  9 31REFFLD(VNFAS3)
     A                                      COLOR(YLW)
     A            A1FAS4    R        B 10 31REFFLD(VNFAS4)
     A                                      COLOR(YLW)
     A                                 12  2'Fast tekst . . . . . . . . .'
     A            A1VTXT    R        B 12 31REFFLD(VNVTXT)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F4=Spørring'
     A                                      COLOR(BLU)
     A                                 23 32'F5=Skriv etikett'
     A                                      COLOR(BLU)
     A            MELD          78A  O 24  2
     A  96                                  DSPATR(RI)
