     A*%%TS  SD  20040917  152928  HKO         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R C2BLD
     A*%%TS  SD  20040917  152928  HKO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 11 22)
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Avtalenotat '
     A                                      DSPATR(RI)
     A            C2NNO1    R        O  4  2REFFLD(FPNNO1)
     A                                      COLOR(YLW)
     A            C2NNO2    R        O  5  2REFFLD(FPNNO2)
     A                                      COLOR(YLW)
     A            C2NNO3    R        O  6  2REFFLD(FPNNO3)
     A                                      COLOR(YLW)
     A            C2NNO4    R        O  7  2REFFLD(FPNNO4)
     A                                      COLOR(YLW)
     A            C2NNO5    R        O  8  2REFFLD(FPNNO5)
     A                                      COLOR(YLW)
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
