     A*%%TS  SD  20081022  120121  BOF570      REL-V5R4M0  5722-WDS
     A*%%EC
7.xx A*     BSA  240216    Endringer relatert til ny GUI
8.01 A*     BOF  100622    Utvidet prisgruppe fra 1 til 2 posisjoner
8.02 A*     bsa  080822    Søkefelt forsvinner etter utvidelse av feltet.
8.03 A*     bsa  080822    Skrevet om til bredt skjermbilde grunnet overstyring
8.03 A*     bsa            i newlook designer.
8.06 A*     bsa  020424    Blidt feil skjermbilde, umerkede endringer.
     A*
     A*
     A*----------------------------------------------------------------
8.03 A**                                    DSPSIZ(24 80 *DS3)
8.03 A                                      DSPSIZ(27 132 *WIDE)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20081022  102836  BOF570      REL-V5R4M0  5722-WDS
7.xx A            B1VALG    R        B 10  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
7.xx A            B1PRGR    R        O 10  4REFFLD(FRPRGR)
7.xx A            B1RKAT    R        O 10  7REFFLD(FRRKAT)
7.xx A            B1KKAT    R        O 10 11REFFLD(FRKKAT)
7.xx A            B1KUND    R        O 10 16REFFLD(FRKUND)
7.xx A            B1KPRO    R        O 10 23REFFLD(FRKPRO)
7.xx A            B1OGRP    R        O 10 30REFFLD(FROGRP)
7.xx A            B1HGRP    R        O 10 33REFFLD(FRHGRP)
7.xx A            B1UGRP    R        O 10 36REFFLD(FRUGRP)
7.xx A            B1LDOR    R        O 10 40REFFLD(FRLDOR)
7.xx A            B1MODN    R        O 10 47REFFLD(FRMODN)
7.xx A            B1VARE    R   -7   O 10 56REFFLD(FRVARE)
7.xx A            B1ENHE    R        O 10 65REFFLD(FRENHE)
7.xx A            B1LETY    R        O 10 69REFFLD(FRLETY)
7.xx A            B1RAB1         2Y 0O 10 71EDTCDE(4)
7.xx A            B1RABN         2Y 0O 10 74EDTCDE(4)
7.xx A            B1DEKN         3Y 0O 10 77EDTCDE(4)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20081022  105511  BOF570      REL-V5R4M0  5722-WDS
8.03 A                                      SFLSIZ(0016)
8.03 A                                      SFLPAG(0015)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CF06
8.06 A                                      CF08
     A                                      CA23
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
8.06 A                                  1118'Kl. :'
     A                                      COLOR(WHT)
8.06 A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av rabattmatrise'
     A                                      COLOR(WHT)
7.xx A**8.02                            2 38'FR100B2'
7.xx A**8.02                                COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
8.03 A                                  2118'Dato:'
     A                                      COLOR(WHT)
8.03 A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
8.03 A                                      ------------------------------------
8.03 A                                      ---------------------------'
     A                                      COLOR(WHT)
7.xx A                                  4  2'Kunde .'
     A                                      COLOR(BLU)
7.xx A            B2KUNF    R        O  4 10REFFLD(FRKUND)
     A                                      COLOR(BLU)
7.xx A                                  7  2'2=Endre  3=Kopier  4=Slett  5=Vis'
     A                                      COLOR(BLU)
7.xx A                                  4 20'Prosj..'
     A                                      COLOR(BLU)
7.xx A            B2KPRF    R        O  4 28REFFLD(FRKPRO)
     A                                      COLOR(BLU)
8.02 A                                  5  6'Pg'
7.xx A                                      COLOR(WHT)
8.03 A                                  5 11'Rka'
7.xx A                                      COLOR(WHT)
8.03 A                                  5 17'Kka'
7.xx A                                      COLOR(WHT)
8.03 A                                  5 24'Kunde'
7.xx A                                      COLOR(WHT)
8.03 A                                  5 33'Prosj.'
7.xx A                                      COLOR(WHT)
8.03 A                                  5 42'Og'
7.xx A                                      COLOR(WHT)
8.03 A                                  5 47'Hg'
7.xx A                                      COLOR(WHT)
8.03 A                                  5 52'Ugr'
7.xx A                                      COLOR(WHT)
8.03 A                                  5 58'Lev.nr'
7.xx A                                      COLOR(WHT)
8.03 A                                  5 67'Modulnr'
7.xx A                                      COLOR(WHT)
8.03 A                                  5 78'Varenr.'
7.xx A                                      COLOR(WHT)
8.03 A                                  5 89'Enh'
7.xx A                                      COLOR(WHT)
8.03 A                                  5 95'L'
7.xx A                                      COLOR(WHT)
7.xx A**                                6  2'V Pg Rab Kund Kunde  Prosj. Og Hg -
7.xx A**                                    Ugr Lev.   Modulnr. Varenr.  Enh L -
7.xx A**                                    R1 Rn DG'
7.xx A**                                    COLOR(WHT)
7.xx A**                                7  7'kat  kat'
7.xx A**                                    COLOR(WHT)
7.xx A                                  8  2'V'
7.xx A                                      COLOR(WHT)
8.03 A                                  8  4'Pg'
7.xx A                                      COLOR(WHT)
7.xx A                                  8  7'Rab'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 11'Kund'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 16'Kunde'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 23'Prosj.'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 30'Og'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 33'Hg'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 36'Ugr'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 40'Lev.nr'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 47'Modulnr.'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 56'Varenr.'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 65'Enh'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 69'L'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 71'R1'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 74'Rn'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 77'DG'
7.xx A                                      COLOR(WHT)
7.xx A                                  9  7'kat'
7.xx A                                      COLOR(WHT)
7.xx A                                  9 12'kat'
7.xx A                                      COLOR(WHT)
7.xx A  80                              9 71'ds'
7.xx A                                      COLOR(WHT)
7.xx A  80                              9 74'ds'
7.xx A                                      COLOR(WHT)
7.xx A  80                              9 77'ds'
7.xx A                                      COLOR(WHT)
8.02 A                                  6  4'+'
8.02 A            B2PRGR    R        B  6  6REFFLD(FRPRGR)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
8.03 A                                  6  9'+'
8.03 A            B2RKAT    R        B  6 11REFFLD(FRRKAT)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
8.03 A                                  6 15'+'
8.03 A            B2KKAT    R        B  6 17REFFLD(FRKKAT)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
8.03 A                                  6 22'+'
8.03 A            B2KUND    R        B  6 24REFFLD(FRKUND)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
8.03 A                                  6 31'+'
8.03 A            B2KPRO    R        B  6 33REFFLD(FRKPRO)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
8.03 A                                  6 40'+'
8.03 A            B2OGRP    R        B  6 42REFFLD(FROGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
8.03 A                                  6 45'+'
8.03 A            B2HGRP    R        B  6 47REFFLD(FRHGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
8.03 A                                  6 50'+'
8.03 A            B2UGRP    R        B  6 52REFFLD(FRUGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
8.03 A                                  6 56'+'
8.03 A            B2LDOR    R        B  6 58REFFLD(FRLDOR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
8.03 A                                  6 65'+'
8.03 A            B2MODN    R        B  6 67REFFLD(FRMODN)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
8.03 A                                  6 76'+'
8.03 A            B2VARE    R   -7   B  6 78REFFLD(FRVARE)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
8.03 A                                  6 87'+'
8.03 A            B2ENHE    R        B  6 89REFFLD(FRENHE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.03 A                                  6 93'+'
8.03 A            B2LETY    R        B  6 95REFFLD(FRLETY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20031116  134741  HKO         REL-V5R2M0  5722-WDS
8.03 A                                 26  2'F1=Filter  F3=Gå tilbake  F4=Spørr-
8.06 A                                      ing  F5=Forny  F6=Opprett  -
8.06 A                                      F8=Til/fra Excel'
     A                                      COLOR(BLU)
8.06 A N80                             26 81'F23=Datostyrte'
     A                                      COLOR(BLU)
8.06 A  80                             26 81'F23=Ordinære'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20031115  122523  HKO         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av rabattmatrise-nivå'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  5  2'Prisgruppe . . . . . . . . +'
     A            C1PRGR    R        B  5 31REFFLD(FRPRGR)
     A  49                                  ERRMSGID(FRA3020 *LIBL/QMFOFAK 49)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  6  2'Rabattkategori . . . . . . +'
     A            C1RKAT    R        B  6 31REFFLD(FRRKAT)
     A  31                                  ERRMSGID(FMR0050 *LIBL/QMFOFAK 31)
     A  33                                  ERRMSGID(FMR0060 *LIBL/QMFOFAK 33)
     A  36                                  ERRMSGID(FRA0620 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C1RTXT        30A  O  6 41COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  7  2'Kundekategori. . . . . . . +'
     A            C1KKAT    R        B  7 31REFFLD(FRKKAT)
     A  37                                  ERRMSGID(FRA1120 *LIBL/QMFOFAK 37)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C1KTXT        30A  O  7 41COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  8  2'Kunde. . . . . . . . . . . +'
     A            C1KUND    R        B  8 31REFFLD(FRKUND)
     A  38                                  ERRMSGID(FRK0020 *LIBL/QMFOFAK 38)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C1KNAV        30A  O  8 41COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  9  2'Kundeprosjekt. . . . . . . +'
     A            C1KPRO    R        B  9 31REFFLD(FRKPRO)
     A  39                                  ERRMSGID(FML0200 *LIBL/QMFOFAK 39)
     A  40                                  ERRMSGID(FML0020 *LIBL/QMFOFAK 40)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C1PNAV    R        O  9 41REFFLD(FLNAVN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 10  2'Varegruppe . . . . . . . . +'
     A            C1OGRP    R        B 10 31REFFLD(FROGRP)
     A  41                                  ERRMSGID(VMG1020 *LIBL/QMFOFAK 41)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1HGRP    R        B 10 36REFFLD(FRHGRP)
     A  42                                  ERRMSGID(VMG2020 *LIBL/QMFOFAK 42)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1UGRP    R        B 10 41REFFLD(FRUGRP)
     A  43                                  ERRMSGID(VMG0020 *LIBL/QMFOFAK 43)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C1GTXT    R        O 10 45REFFLD(VGUTXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 11  2'Leverandør . . . . . . . . +'
     A            C1LDOR    R        B 11 31REFFLD(FRLDOR)
     A  44                                  ERRMSGID(FRL0020 *LIBL/QMFOFAK 44)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C1LNAV        30A  O 11 41COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 12  2'Modulnr. . . . . . . . . . +'
     A            C1MODN    R        B 12 31REFFLD(FRMODN)
     A  34                                  ERRMSGID(FMR0070 *LIBL/QMFOFAK 34)
     A  45                                  ERRMSGID(VMV0800 *LIBL/QMFOFAK 45)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C1MTXT        35A  O 12 41COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 13  2'Varenr . . . . . . . . . . +'
     A            C1VARE    R   -7   B 13 31REFFLD(FRVARE)
     A  35                                  ERRMSGID(FMR0080 *LIBL/QMFOFAK 35)
     A  46                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 46)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1VTXT    R        O 13 41REFFLD(VVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 14  2'Enhet. . . . . . . . . . . +'
     A            C1ENHE    R        B 14 31REFFLD(FRENHE)
     A  47                                  ERRMSGID(VMA1020 *LIBL/QMFOFAK 47)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1ETXT    R        O 14 41REFFLD(VAETXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 15  2'Leveringstype. . . . . . . +'
     A            C1LETY    R        B 15 31REFFLD(FRLETY)
     A  48                                  ERRMSGID(VMY0020 *LIBL/QMFOFAK 48)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1LTXT    R        O 15 41REFFLD(VYBESK)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A                                 10 34'+'
     A                                 10 39'+'
     A          R C1MSG
     A*%%TS  SD  20011015  100400  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Rabattmatrise-nivå finnes'
     A                                  3  2'fra før.'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
8.04 A          R C1MSGEXCEL
8.04 A*%%TS  SD  20230327  104328  SST_800     REL-V7R3M0  5770-WDS
8.04 A                                      WINDOW(*DFT 7 50)
8.04 A                                      CA03
8.04 A                                      CF07
8.04 A                                      CF08
8.04 A                                      CF09
8.04 A                                      CA12
8.04 A                                  1  2'Utlegging / Innlesning av Rabattma-
8.04 A                                      trise'
8.04 A                                      DSPATR(RI)
8.04 A                                  4  2'F8 = Innlesning av rabattmatrise f-
8.04 A                                      ra Excel'
8.04 A                                  5  2'F9 = Utlegging  av rabattmatrise t-
8.04 A                                      il Excel'
8.04 A                                  3  2'F7 = Hente mal for rabattmatrise f-
8.04 A                                      or Excel'
8.04 A                                  6  2'F3 = Avbryt '
     A          R C2BLD
     A*%%TS  SD  20081022  105511  BOF570      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      CF20
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av rabattmatrise-nivå'
     A                                      COLOR(WHT)
7.xx A                                  2 38'FR100C2'
7.xx A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Prisgruppe . . . . . . . .'
     A            C1PRGR    R        O  4 29REFFLD(FRPRGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1PTXT        30A  O  4 39COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Rabattkategori . . . . . .'
     A            C1RKAT    R        O  5 29REFFLD(FRRKAT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1RTXT        30A  O  5 39COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Kundekategori. . . . . . .'
     A            C1KKAT    R        O  6 29REFFLD(FRKKAT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1KTXT        30A  O  6 39COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Kunde. . . . . . . . . . .'
     A            C1KUND    R        O  7 29REFFLD(FRKUND)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1KNAV        30A  O  7 39COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Kundeprosjekt. . . . . . .'
     A            C1KPRO    R        O  8 29REFFLD(FRKPRO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1PNAV    R        O  8 39REFFLD(FLNAVN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Varegruppe . . . . . . . .'
     A            C1OGRP    R        O  9 29REFFLD(FROGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1HGRP    R        O  9 32REFFLD(FRHGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1UGRP    R        O  9 35REFFLD(FRUGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1GTXT    R        O  9 39REFFLD(VGUTXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Leverandør . . . . . . . .'
     A            C1LDOR    R        O 10 29REFFLD(FRLDOR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1LNAV        30A  O 10 39COLOR(YLW)
     A                                      OVRDTA
     A                                 11  2'Modulnr. . . . . . . . . .'
     A            C1MODN    R        O 11 29REFFLD(FRMODN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1MTXT        35A  O 11 39COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Varenr . . . . . . . . . .'
     A            C1VARE    R   -7   O 12 29REFFLD(FRVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1VTXT    R        O 12 39REFFLD(VVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13  2'Enhet. . . . . . . . . . .'
     A            C1ENHE    R        O 13 29REFFLD(FRENHE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1ETXT    R        O 13 39REFFLD(VAETXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14  2'Leveringstype. . . . . . .'
     A            C1LETY    R        O 14 29REFFLD(FRLETY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1LTXT    R        O 14 39REFFLD(VYBESK)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 15  2'Priskode på vare . . . . .'
     A            C2KPRI    R        O 15 29REFFLD(VVKPRI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 15 39'Gjenomsnittlig DG. . . . .'
     A            C2DGGJ         5Y 2O 15 66COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A                                 16 38'Datostyrt'
     A                                      DSPATR(UL)
     A                                 16 50'Dato f.o.m'
     A                                      DSPATR(UL)
     A                                 16 62'Dato t.o.m'
     A                                      DSPATR(UL)
     A                                 17  2'Rabatt-1 . .(priskode '' '')'
     A            C2RAB1    R        B 17 29REFFLD(FRRAB1)
     A                                      RANGE(,00 99,99)
     A                                      CHKMSGID(FM00011 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2RA1D    R        B 17 40REFFLD(FRRA1D)
     A  34                                  ERRMSGID(FMR0110 *LIBL/QMFOFAK 34)
     A                                      RANGE(,00 99,99)
     A                                      CHKMSGID(FM00011 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2RA1F         6Y 0B 17 51COLOR(YLW)
     A  32                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 32)
     A  35                                  ERRMSGID(FM00055 *LIBL/QMFOFAK 35)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A            C2RA1T         6Y 0B 17 63COLOR(YLW)
     A  33                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 33)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 18  2'Rabatt-2 . .(priskode '' '')'
     A            C2RAB2    R        B 18 29REFFLD(FRRAB2)
     A                                      RANGE(,00 99,99)
     A                                      CHKMSGID(FM00011 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2RA2D    R        B 18 40REFFLD(FRRA2D)
     A  38                                  ERRMSGID(FMR0110 *LIBL/QMFOFAK 38)
     A                                      RANGE(,00 99,99)
     A                                      CHKMSGID(FM00011 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2RA2F         6Y 0B 18 51COLOR(YLW)
     A  36                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 36)
     A  39                                  ERRMSGID(FM00055 *LIBL/QMFOFAK 39)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A            C2RA2T         6Y 0B 18 63COLOR(YLW)
     A  37                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 37)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 19  2'Rabatt-N . .(priskode ''N'')'
     A            C2RABN    R        B 19 29REFFLD(FRRABN)
     A                                      RANGE(,00 99,99)
     A                                      CHKMSGID(FM00011 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2RAND    R        B 19 40REFFLD(FRRAND)
     A  42                                  ERRMSGID(FMR0110 *LIBL/QMFOFAK 42)
     A                                      RANGE(,00 99,99)
     A                                      CHKMSGID(FM00011 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2RANF         6Y 0B 19 51COLOR(YLW)
     A  40                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 40)
     A  43                                  ERRMSGID(FM00055 *LIBL/QMFOFAK 43)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A            C2RANT         6Y 0B 19 63COLOR(YLW)
     A  41                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 41)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20  2'Rabatt-B . .(priskode ''B'')'
     A            C2RABB    R        B 20 29REFFLD(FRRABN)
     A                                      RANGE(,00 99,99)
     A                                      CHKMSGID(FM00011 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2RABD    R        B 20 40REFFLD(FRRABD)
     A  46                                  ERRMSGID(FMR0110 *LIBL/QMFOFAK 46)
     A                                      RANGE(,00 99,99)
     A                                      CHKMSGID(FM00011 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2RBUF         6Y 0B 20 51COLOR(YLW)
     A  44                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 44)
     A  47                                  ERRMSGID(FM00055 *LIBL/QMFOFAK 47)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A            C2RBUT         6Y 0B 20 63COLOR(YLW)
     A  45                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 45)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 21  2'Rabatt-T . .(priskode ''T'')'
     A            C2RABT    R        B 21 29REFFLD(FRRABT)
     A                                      RANGE(,00 99,99)
     A                                      CHKMSGID(FM00011 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2RATD    R        B 21 40REFFLD(FRRATD)
     A  50                                  ERRMSGID(FMR0110 *LIBL/QMFOFAK 50)
     A                                      RANGE(,00 99,99)
     A                                      CHKMSGID(FM00011 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2RATF         6Y 0B 21 51COLOR(YLW)
     A  48                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 48)
     A  51                                  ERRMSGID(FM00055 *LIBL/QMFOFAK 51)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A            C2RATT         6Y 0B 21 63COLOR(YLW)
     A  49                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 49)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22  2'Dekningsgrad . . . . . . .'
     A            C2DEKN    R        B 22 29REFFLD(FRDEKN)
     A  55                                  ERRMSGID(FMR0150 *LIBL/QMFOFAK 55)
     A                                      RANGE(,00 100,00)
     A                                      CHKMSGID(FM00011 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2DEKD    R        B 22 40REFFLD(FRDEKD)
     A  58                                  ERRMSGID(FMR0110 *LIBL/QMFOFAK 58)
     A                                      RANGE(,00 100,00)
     A                                      CHKMSGID(FM00011 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2DEKF         6Y 0B 22 51COLOR(YLW)
     A  56                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 56)
     A  59                                  ERRMSGID(FM00055 *LIBL/QMFOFAK 59)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A            C2DEKT         6Y 0B 22 63COLOR(YLW)
     A  57                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 57)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F20=Kalkuler DG'
     A                                      COLOR(BLU)
     A            C2ODAT         6Y 0O 23 48COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 57'/'
     A            C2EDAT         6Y 0O 23 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 68'/'
     A            C2EUSR    R        O 23 70REFFLD(FREUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R D1WIN
     A*%%TS  SD  20031115  122812  HKO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 22 50)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette rabattmatrise-nivå '
     A                                      DSPATR(RI)
     A                                  3  2'Prisgruppe . . . .'
     A            D1PRGR    R        O  3 21REFFLD(FRPRGR)
     A                                  4  2'Rabattkategori . .'
     A            D1RKAT    R        O  4 21REFFLD(FRRKAT)
     A                                  5  2'Kundekategori. . .'
     A            D1KKAT    R        O  5 21REFFLD(FRKKAT)
     A                                  6  2'Kunde. . . . . . .'
     A            D1KUND    R        O  6 21REFFLD(FRKUND)
     A                                  7  2'Kundeprosjekt. . .'
     A            D1KPRO    R        O  7 21REFFLD(FRKPRO)
     A                                  8  2'Varegruppe . . . .'
     A            D1OGRP    R        O  8 21REFFLD(FROGRP)
     A            D1HGRP    R        O  8 24REFFLD(FRHGRP)
     A            D1UGRP    R        O  8 27REFFLD(FRUGRP)
     A                                  9  2'Leverandør . . . .'
     A            D1LDOR    R        O  9 21REFFLD(FRLDOR)
     A                                 10  2'Modulnr. . . . . .'
     A            D1MODN    R        O 10 21REFFLD(FRMODN)
     A                                 11  2'Varenummer . . . .'
     A            D1VARE    R        O 11 21REFFLD(FRVARE)
     A                                 12  2'Enhet. . . . . . .'
     A            D1ENHE    R        O 12 21REFFLD(FRENHE)
     A                                 13  2'Leveringstype. . .'
     A            D1LETY    R        O 13 21REFFLD(FRLETY)
     A                                 15  2'Rabatt-1 . . . . .'
     A            FRRAB1    R        O 15 21
     A                                 16  2'Rabatt-2 . . . . .'
     A            FRRAB2    R        O 16 21
     A                                 17  2'Rabatt-B . . . . .'
     A            FRRABB    R        O 17 21
     A                                 18  2'Rabatt-N . . . . .'
     A            FRRABN    R        O 18 21
     A                                 19  2'Rabatt-T . . . . .'
     A            FRRABT    R        O 19 21
     A                                 20  2'Dekningsgrad . . .'
     A            FRDEKN    R        O 20 21
     A                                 21  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20081022  120121  BOF570      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 22 50)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  1  2' Kopiere til: '
     A                                      DSPATR(RI)
7.xx A                                  2  2'Prisgruppe . . . . +'
     A            K1PRGR    R        B  2 23REFFLD(FRPRGR)
     A  49                                  ERRMSGID(FRA3020 *LIBL/QMFOFAK 49)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  3  2'Rabattkat/kundekat +'
     A            K1RKAT    R        B  3 23REFFLD(FRRKAT)
     A  31                                  ERRMSGID(FMR0050 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FMR0030 *LIBL/QMFOFAK 32)
     A  33                                  ERRMSGID(FMR0060 *LIBL/QMFOFAK 33)
     A  36                                  ERRMSGID(FRA0620 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            K1KKAT    R        B  3 29REFFLD(FRKKAT)
     A  37                                  ERRMSGID(FRA1120 *LIBL/QMFOFAK 37)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  4  2'Kunde. . . . . . . +'
     A            K1KUND    R        B  4 23REFFLD(FRKUND)
     A  38                                  ERRMSGID(FRK0020 *LIBL/QMFOFAK 38)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  5  2'Kundeprosjekt. . . +'
     A            K1KPRO    R        B  5 23REFFLD(FRKPRO)
     A  39                                  ERRMSGID(FML0200 *LIBL/QMFOFAK 39)
     A  40                                  ERRMSGID(FML0020 *LIBL/QMFOFAK 40)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  6  2'Varegruppe . . . . +'
     A            K1OGRP    R        B  6 23REFFLD(FROGRP)
     A  41                                  ERRMSGID(VMG1020 *LIBL/QMFOFAK 41)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            K1HGRP    R        B  6 28REFFLD(FRHGRP)
     A  42                                  ERRMSGID(VMG2020 *LIBL/QMFOFAK 42)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6 26'+'
     A            K1UGRP    R        B  6 33REFFLD(FRUGRP)
     A  43                                  ERRMSGID(VMG0020 *LIBL/QMFOFAK 43)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  6 31'+'
7.xx A                                  7  2'Leverandør . . . . +'
     A            K1LDOR    R        B  7 23REFFLD(FRLDOR)
     A  44                                  ERRMSGID(FRL0020 *LIBL/QMFOFAK 44)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  8  2'Modulnr. . . . . . +'
     A            K1MODN    R        B  8 23REFFLD(FRMODN)
     A  34                                  ERRMSGID(FMR0070 *LIBL/QMFOFAK 34)
     A  45                                  ERRMSGID(VMV0800 *LIBL/QMFOFAK 45)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  9  2'Varenummer . . . . +'
     A            K1VARE    R   -7   B  9 23REFFLD(FRVARE)
     A  35                                  ERRMSGID(FMR0080 *LIBL/QMFOFAK 35)
     A  46                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 46)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 10  2'Enhet. . . . . . . +'
     A            K1ENHE    R        B 10 23REFFLD(FRENHE)
     A  47                                  ERRMSGID(VMA1020 *LIBL/QMFOFAK 47)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                 11  2'Leveringstype. . . +'
     A            K1LETY    R        B 11 23REFFLD(FRLETY)
     A  48                                  ERRMSGID(VMY0020 *LIBL/QMFOFAK 48)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 12  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                 13  2'Prisgruppe'
     A            FRPRGR    R        O 13 23OVRDTA
     A                                 14  2'Rabattkat/kundekat'
     A            FRRKAT    R        O 14 23OVRDTA
     A                                 14 27'/'
     A            FRKKAT    R        O 14 29
     A                                 15  2'Kunde/kundeprosj..'
     A            FRKUND    R        O 15 23OVRDTA
     A                                 15 30'/'
     A            FRKPRO    R        O 15 32OVRDTA
     A                                 16  2'Varegruppe . . . .'
     A            FROGRP    R        O 16 23OVRDTA
     A            FRHGRP    R        O 16 26OVRDTA
     A            FRUGRP    R        O 16 29OVRDTA
     A                                 17  2'Leverandør . . . .'
     A            FRLDOR    R        O 17 23OVRDTA
     A                                 18  2'Modulnr. . . . . .'
     A            FRMODN    R        O 18 23OVRDTA
     A                                 19  2'Varenummer . . . .'
     A            FRVARE    R        O 19 23OVRDTA
     A                                 20  2'Enhet /Lev.type. .'
     A            FRENHE    R        O 20 23OVRDTA
     A            FRLETY    R        O 20 29OVRDTA
     A                                 21  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A                                  3 27'/'
     A                                 20 27'/'
     A          R F1WIN
     A*%%TS  SD  20031116  140826  HKO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 13 58)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            F1RKAT    R        H      REFFLD(FRRKAT)
     A            F1KKAT    R        H      REFFLD(FRKKAT)
     A                                  2  2' Filter '
     A                                      DSPATR(RI)
7.xx A                                  4  2'Kunde. . . . . . +'
     A            F1KUND    R        B  4 21REFFLD(FRKUND)
     A  31                                  ERRMSGID(FRK0020 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            F1KNAV        30A  O  4 28COLOR(YLW)
7.xx A                                  5  2'Kundeprosjekt. . +'
     A            F1KPRO    R        B  5 21REFFLD(FRKPRO)
     A  32                                  ERRMSGID(FML0200 *LIBL/QMFOFAK 32)
     A  33                                  ERRMSGID(FML0020 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            F1PNAV    R        O  5 28REFFLD(FLNAVN)
     A                                      COLOR(YLW)
     A                                 12  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
