     A*%%TS  SD  20040513  134756  HKO         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20040513  134756  HKO         REL-V5R2M0  5722-WDS
     A*                                     WINDOW(*DFT 10 48)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Fjerning av rabattavtale på laver-
     A                                      e nivå '
     A                                      DSPATR(RI)
     A                                  4  2'Rutninen leser gjennom rabattmatri-
     A                                      sen, og'
     A                                  5  2'fjerner rabattavtaler på nivåer hv-
     A                                      or samme'
     A                                  6  2'avtale finnes knyttet mot samme kj-
     A                                      øper,'
     A                                  7  2'varegruppe og leverandør på et høy-
     A                                      ere nivå.'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
