     A*%%TS  SD  19990507  132724  HKO         REL-V4R2M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19990507  132724  HKO         REL-V4R2M0  5769-PW1
     A*                                     WINDOW(*DFT 15 50)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Utskrift av rabattmatrise '
     A                                      DSPATR(RI)
     A                                  4  2'Rapporttype . .'
     A            B1VALG    R        B  4 18REFFLD(FÅVALG)
     A  31                                  ERRMSGID(FM00010 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                  4 23'1=Matrise'
     A                                  5 23'2=Kryssreferanse'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
