     A*%%TS  SD  20081021  152343  BOF570      REL-V5R4M0  5722-WDS
     A*%%EC
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : FR601D
     A* Beskrivelse . . : Utskrift av rabattmatrise
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  010416  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20081021  152343  BOF570      REL-V5R4M0  5722-WDS
7.xx A                                      WINDOW(*DFT 16 55)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Utskrift av rabattmatrise - matri-
     A                                      se '
     A                                      DSPATR(RI)
7.xx A                                  4  2'Prisgruppe  . . +'
     A            B1PRGR    R        B  4 20REFFLD(FRPRGR)
     A                                      COLOR(YLW)
7.xx A                                  5  2'Rabattkategori. +'
     A            B1RKAF    R        B  5 20REFFLD(FRRKAT)
     A  31                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  5 34'-'
7.xx A                                  5 36'+'
7.xx A            B1RKAT    R        B  5 38REFFLD(FRRKAT)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A                                  6  2'Kundekategori . +'
     A            B1KKAF    R        B  6 20REFFLD(FRKKAT)
     A  32                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  6 34'-'
7.xx A                                  6 36'+'
7.xx A            B1KKAT    R        B  6 38REFFLD(FRKKAT)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A                                  7  2'Kunde . . . . . +'
     A            B1KUNF    R        B  7 20REFFLD(FRKUND)
     A  33                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  7 34'-'
7.xx A                                  7 36'+'
7.xx A            B1KUNT    R        B  7 38REFFLD(FRKUND)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  8  2'Kundeprosjekt . +'
     A            B1KPRF    R        B  8 20REFFLD(FRKPRO)
     A  34                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 34)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  8 34'-'
7.xx A                                  8 36'+'
7.xx A            B1KPRT    R        B  8 38REFFLD(FRKPRO)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A                                 10  2'Varegruppe. . . +'
     A            B1OGRF    R        B 10 20REFFLD(FROGRP)
     A  35                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 35)
     A                                      COLOR(YLW)
7.xx A                                 10 23'+'
7.xx A            B1HGRF    R        B 10 25REFFLD(FRHGRP)
     A                                      COLOR(YLW)
7.xx A                                 10 28'+'
7.xx A            B1UGRF    R        B 10 30REFFLD(FRUGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 10 34'-'
7.xx A                                 10 36'+'
7.xx A            B1OGRT    R        B 10 38REFFLD(FROGRP)
     A                                      COLOR(YLW)
7.xx A                                 10 41'+'
7.xx A            B1HGRT    R        B 10 43REFFLD(FRHGRP)
     A                                      COLOR(YLW)
7.xx A                                 10 46'+'
7.xx A            B1UGRT    R        B 10 48REFFLD(FRUGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A                                 11  2'Leverandør. . . +'
     A            B1LDOF    R        B 11 20REFFLD(FRLDOR)
     A  36                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A                                 11 34'-'
7.xx A                                 11 36'+'
7.xx A            B1LDOT    R        B 11 38REFFLD(FRLDOR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A                                 12  2'Modulnummer . . +'
     A            B1MODF    R        B 12 20REFFLD(FRMODN)
     A  37                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 37)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A                                 12 34'-'
7.xx A                                 12 36'+'
7.xx A            B1MODT    R        B 12 38REFFLD(FRMODN)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A                                 13  2'Varenummer. . . +'
     A            B1VARF         8Y 0B 13 20COLOR(YLW)
     A  38                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 38)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
7.xx A                                 13 34'-'
7.xx A                                 13 36'+'
     A            B1VART         8Y 0B 13 38COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                 15  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
