     A*%%TS  SD  20051129  173540  HKO550      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      CF03
     A                                      CF12
     A          R B1BLD
     A*%%TS  SD  20051129  173540  HKO550      REL-V5R3M0  5722-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Sletting av tilbud'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Seleksjonskriterier :'
     A                                      COLOR(WHT)
     A                                  7  2'Ordre-type . . . . . . . . .'
     A            B1OTYP    R        B  7 31REFFLD(FOOTYP)
     A  31                                  ERRMSGID(FMA0260 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                  9  2'Utgått-dato t.o.m. . . . . .'
     A            B1DATO         6Y 0B  9 31COLOR(YLW)
7.xx A  32                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 32)
     A                                      CHECK(RB)
7.xx A                                      EDTWRD('  .  .  ')
     A                                 12  2'MERK:'
     A                                      COLOR(WHT)
     A                                 14  3'- Utgått-dato må være utfylt på ti-
     A                                      lbudet'
     A                                 15  3'- Utgått-dato må være eldre enn va-
     A                                      lgt dato'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
