     A*%%TS  SD  20190828  143150  G0TEGSVSTR  REL-V7R3M0  5770-WDS
     A*%%EC
7.00 A                                      DSPSIZ(24 80 *DS3 -
7.00 A                                             27 132 *WIDE)
7.00 A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20070328  155621  AMD550      REL-V5R4M0  5722-WDS
7.xx A            B1VALG    R        B  8  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(5)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
7.xx A            B1KODE    R        O  8 32REFFLD(FUKODE)
7.xx A            B1DATE         6Y 0O  8  6EDTWRD('  .  .  ')
7.xx A            B1TIME         6Y 0O  8 16EDTWRD('  .  .  ')
7.xx A            B1JTXT    R        O  8 35REFFLD(VAJTXT)
7.xx A            B1SUFF    R        O  8 26REFFLD(FUSUFF)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20070328  155621  AMD550      REL-V5R4M0  5722-WDS
7.xx A                                      SFLSIZ(0008)
7.xx A                                      SFLPAG(0007)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      CA24
     A                                      PUTOVR
     A                                      SFLCSRRRN(&W_CURN)
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Ordre - logg '
     A                                      DSPATR(RI)
7.xx A                                  2 35'FU500B2'
7.xx A                                      COLOR(WHT)
7.xx A                                  3  2'Ordre :'
7.xx A            B2NUMM    R        O  3 11REFFLD(FUNUMM)
     A                                  3 26'År    :'
     A            B2AARR    R        O  3 35REFFLD(FUAARR)
7.xx A                                  4  8'Dato'
7.xx A                                      COLOR(WHT)
7.xx A                                  6  2'5=Vise'
     A                                      COLOR(BLU)
7.xx A                                  7  2'V'
     A                                      COLOR(WHT)
7.xx A                                  7  8'Dato'
     A                                      COLOR(WHT)
7.xx A                                  7 16'Klokken'
     A                                      COLOR(WHT)
7.xx A                                  7 25'Suff'
     A                                      COLOR(WHT)
7.xx A                                  7 30'Kode'
     A                                      COLOR(WHT)
7.xx A                                  7 35'Beskrivelse'
     A                                      COLOR(WHT)
7.xx A            B2DATE         6Y 0B  5  7COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A          R B2CMD
     A*%%TS  SD  20190828  143150  G0TEGSVSTR  REL-V7R3M0  5770-WDS
     A                                      WINDOW(*DFT 17 54)
     A                                 16  2'F3=Gå tilbake   F5=Forny  F24=Logg'
     A                                      COLOR(BLU)
     A          R C2WIN
     A*%%TS  SD  20070319  131435  AMD550      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 13 40)
     A                                  2  1' Spørring på ordrelogg '
     A                                      DSPATR(RI)
     A            C2VALG    R        B  3  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
     A                                  4  2'År . . . . . . .'
     A            C2AARR    R        O  4 19REFFLD(FUAARR)
     A                                  5  2'Ordrenummer. . .'
     A            C2NUMM    R        O  5 19REFFLD(FUNUMM)
     A                                  6  2'Suffix . . . . .'
     A            C2SUFF    R        O  6 19REFFLD(FUSUFF)
     A                                  7  2'Dato . . . . . .'
     A            C2DATE         6Y 0O  7 19EDTWRD('  .  .  ')
     A                                  8  2'Klokken. . . . .'
     A            C2TIME         6Y 0O  8 19EDTWRD('  .  .  ')
     A                                  9  2'Kode . . . . . .'
     A            C2KODE    R        O  9 19REFFLD(FUKODE)
     A                                 10  2'Beskrivelse. . .'
     A            C2JTXT    R        O 10 19REFFLD(VAJTXT)
     A                                 11  2'Brukerid . . . .'
     A            C2USER    R        O 11 19REFFLD(FUUSER)
     A                                 12  2'Skjermid . . . .'
     A            C2WSID    R        O 12 19REFFLD(FUWSID)
     A          R ASUME                     ASSUME
     A                                 24 79' '
