     A*%%TS  SD  20020312  222734  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      CA03(03)
     A          R A1BLD
     A*%%TS  SD  19980128  124042  HKO         REL-V3R7M0  5716-PW1
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Avrundingsregler'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  6  5'Beløp opp til . . . . .'
     A            A1AGR0    R        B  6 31REFFLD(FAAGR0)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  6 43'ingen avrunding'
     A                                  8  2'1) Beløp opp til . . . . . .'
     A            A1AGR1    R        B  8 31REFFLD(FAAGR1)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  31                                  ERRMSGID(FMA0090 *LIBL/QMFOFAK 31)
     A                                  8 43'avrundes til . .'
     A            A1ABL1    R        O  8 60REFFLD(FAABL1)
     A                                      COLOR(YLW)
     A                                  9  2'2) Beløp opp til . . . . . .'
     A            A1AGR2    R        B  9 31REFFLD(FAAGR2)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  32                                  ERRMSGID(FMA0090 *LIBL/QMFOFAK 32)
     A                                  9 43'avrundes til . .'
     A            A1ABL2    R        O  9 60REFFLD(FAABL2)
     A                                      COLOR(YLW)
     A                                 10  2'3) Beløp opp til . . . . . .'
     A            A1AGR3    R        B 10 31REFFLD(FAAGR3)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  33                                  ERRMSGID(FMA0090 *LIBL/QMFOFAK 33)
     A                                 10 43'avrundes til . .'
     A            A1ABL3    R        O 10 60REFFLD(FAABL3)
     A                                      COLOR(YLW)
     A                                 11  2'4) Beløp opp til . . . . . .'
     A            A1AGR4    R        B 11 31REFFLD(FAAGR4)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  34                                  ERRMSGID(FMA0090 *LIBL/QMFOFAK 34)
     A                                 11 43'avrundes til . .'
     A            A1ABL4    R        O 11 60REFFLD(FAABL4)
     A                                      COLOR(YLW)
     A                                 12  2'5) Beløp høyere enn 4) . . .'
     A                                 12 43'avrundes til . .'
     A            A1ABL5    R        O 12 60REFFLD(FAABL5)
     A                                      COLOR(YLW)
     A                                 15  2'Benyttes for avrunding av:'
     A                                      COLOR(WHT)
     A                                 17  2'Salgspris inkl mva . . . . .'
     A            A1AIMV    R        B 17 31REFFLD(FAAIMV)
     A                                      COLOR(YLW)
     A                                 17 43'0=Ingen avrunding'
     A                                 18 43'1=Avrund til nærmeste'
     A                                 19 43'2=Avrund oppover'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
