     A*%%TS  SD  20060201  094026  AMD550      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      CA03(03)
     A          R A1BLD
     A*%%TS  SD  20060201  094026  AMD550      REL-V5R3M0  5722-WDS
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Generelle systemverdier'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  4  2'Identifikasjon for ordre-register'
     A            A1AORK    R        B  4 36REFFLD(FAAORK)
     A                                      COLOR(YLW)
     A                                  4 46'Nobb deltakernummer .'
     A            A1ANOD    R        B  4 68REFFLD(FAANOD)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  5  2'Identifikasjon for bilagsnummer .'
     A            A1AFAK    R        B  5 36REFFLD(FAAFAK)
     A                                      COLOR(YLW)
     A                                  6  2'Identifikasjon for slette-liste .'
     A            A1ADEL    R        B  6 36REFFLD(FAADEL)
     A                                      COLOR(YLW)
     A                                  6 46'Kjørekontor-løsning?.'
     A            A1AKJK    R        B  6 68REFFLD(FAAKJK)
     A                                      COLOR(YLW)
     A                                  6 70'1=Ja'
     A                                  7  2'Identifikasjon for felles-lister.'
     A            A1ALSM    R        B  7 36REFFLD(FAALSM)
     A                                      COLOR(YLW)
     A                                  7 46'Splitt ordre lager ?.'
     A            A1AK02    R        B  7 68REFFLD(FAAK02)
     A                                      COLOR(YLW)
     A                                  7 70'1=Ja'
     A                                  8  2'Infokode som kan slås av/på . . .'
     A            A1AK98    R        B  8 36REFFLD(FAAK98)
     A  31                                  ERRMSGID(VMA8020 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                  9  2'Droppe firmaopplysn?. . . . . . .'
     A            A1APRT    R        B  9 36REFFLD(FAAPRT)
     A                                      COLOR(YLW)
     A                                  9 46'1=Fra fakturahode'
     A                                 10 46'2=Fra bankgiro'
     A                                 11  2'Kontohenvisningskode. . . . . . .'
     A            A1AKHV    R        B 11 36REFFLD(FAAKHV)
     A                                      COLOR(YLW)
     A                                 12  2'Standard Ordre-type . . . . . . .'
     A            A1AOTY    R        B 12 36REFFLD(FAAOTY)
     A                                      COLOR(YLW)
     A                                 13  2'Standard Linje-type, varelinjer .'
     A            A1ALTY    R        B 13 36REFFLD(FAALTY)
     A                                      COLOR(YLW)
     A                                 14  2'Standard Linjetype, tekstlinjer .'
     A            A1ATTY    R        B 14 36REFFLD(FAATTY)
     A                                      COLOR(YLW)
     A                                 15  2'Standard kundenummer  . . . . . .'
     A            A1AKUN    R        B 15 36REFFLD(FAAKUN)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 16  2'Kundenummer for oppretting av nye'
     A            A1AKNR    R        B 16 36REFFLD(FAAKNR)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 17  2'Ørevarunding, Varenummer. . . . .'
     A            A1AVNR    R        B 17 36REFFLD(FAAVNR)
     A                                      COLOR(YLW)
     A                                 18  2'Øreavrunding, Bilagskode. . . . .'
     A            A1ABIL    R        B 18 36REFFLD(FAABIL)
     A                                      COLOR(YLW)
     A                                 20  2'Nedre grense for rabatt . . . . .'
     A            A1AGRN    R        B 20 36REFFLD(FAAGRN)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 20 46'I hele kroner'
     A                                 21  2'Ant. dager før oppfølging av tilb'
     A            A1AOPF    R        B 21 36REFFLD(FAAOPF)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 21 41'Ikke vise tilbud for varen'
     A            A1AK05    R        B 21 68REFFLD(FAAK05)
     A                                      COLOR(YLW)
     A                                 21 70'1=Ja'
     A                                 22  2'Ant. dager før tilbud utgår . . .'
     A            A1AUTG    R        B 22 36REFFLD(FAAUTG)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
