     A*%%TS  SD  20070403  084441  AMD550      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      CA03(03)
     A          R A1BLD
     A*%%TS  SD  20070403  084441  AMD550      REL-V5R4M0  5722-WDS
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Ordre-typer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  2'Ordre-type for tilbud . . . . . . -
     A                                      .'
     A            A1OT01    R        B  5 38REFFLD(FAAOT1)
     A                                      COLOR(YLW)
     A                                  6  2'Ordre-type for ordre. . . . . . . -
     A                                      .'
     A            A1OT02    R        B  6 38REFFLD(FAAOT2)
     A                                      COLOR(YLW)
     A                                  7  2'Ordre-type for pakkseddel . . . . -
     A                                      .'
     A            A1OT03    R        B  7 38REFFLD(FAAOT3)
     A                                      COLOR(YLW)
     A                                  8  2'Ordre-type for faktura. . . . . . -
     A                                      .'
     A            A1OT04    R        B  8 38REFFLD(FAAOT4)
     A                                      COLOR(YLW)
     A                                  9  2'Ordre-type for kreditnota . . . . -
     A                                      .'
     A            A1OT05    R        B  9 38REFFLD(FAAOT5)
     A                                      COLOR(YLW)
     A                                 11  2'Ordre-type for intern ordre . . . -
     A                                      .'
     A            A1OT06    R        B 11 38REFFLD(FAAOT6)
     A                                      COLOR(YLW)
     A                                 12  2'Ordre-type for bestilling . . . . -
     A                                      .'
     A            A1OT07    R        B 12 38REFFLD(FAAOT7)
     A                                      COLOR(YLW)
     A                                 13  2'Ordre-type for internett-ordre. . -
     A                                      .'
     A            A1OT08    R        B 13 38REFFLD(FAAOT8)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
