     A*%%TS  SD  19990205  152649  HKO         REL-V4R2M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19990205  152649  HKO         REL-V4R2M0  5769-PW1
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Innlesing av varer/priser'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Leverandør/format. . . . . .'
     A            B1VALG         2Y 0O  5 31COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Filnavn. . . . . . . . . . .'
     A            B1FILE        12A  B  7 31COLOR(YLW)
     A  31                                  ERRMSGID(FM00600 *LIBL/QMFOFAK 31)
     A  35                                  ERRMSGID(FM00610 *LIBL/QMFOFAK 35)
     A                                      OVRDTA
     A                                  8  2'Mappenavn PC (QDLS). . . . .'
     A            B1FLDR        20A  B  8 31COLOR(YLW)
     A                                      OVRDTA
     A                                  8 54'Blank = Fil på disk'
     A                                 10  2'Leverandør-nummer. . . . . .'
     A            B1LDOR    R        B 10 31REFFLD(VVLDOR)
     A  32                                  ERRMSGID(FRL0010 *LIBL/QMFOFAK 32)
     A  33                                  ERRMSGID(FRL0020 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DSPATR(PC)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
