     A*%%TS  SD  20050804  102748  HKO530      REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R C2BLD
     A*%%TS  SD  20050804  102748  HKO530      REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      CF13
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av vare fra leverandør'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Leverandør . .'
     A            C2LDOR    R        O  4 17REFFLD(FWLDOR)
     A                                      COLOR(YLW)
     A            C2LNAV        30A  O  4 24COLOR(YLW)
     A                                  4 65'Endringskode.'
     A            C2EKOD    R        O  4 79REFFLD(FWEKOD)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Lev. varenr. .'
     A            C2LVAR    R        B  5 17REFFLD(FWLVAR)
     A  31                                  ERRMSGID(FMW0200 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FMW0210 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  5 65'Status. . . .'
     A            C2STAT         1Y 0O  5 79COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Varetekst-1. .'
     A            C2TEK1    R        B  6 17REFFLD(FWTEK1)
     A  33                                  ERRMSGID(VMV0100 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  7  2'Varetekst-2. .'
     A            C2TEK2    R        B  7 17REFFLD(FWTEK2)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  8  2'Varegruppe . .'
     A            C2VGRP    R        B  8 17REFFLD(FWVGRP)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  9  2'GTIN-nr. . . .'
     A            C2EANN    R        B  9 17REFFLD(FWEANN)
     A  34                                  ERRMSGID(FMW0220 *LIBL/QMFOFAK 34)
     A  35                                  ERRMSGID(FMW0230 *LIBL/QMFOFAK 35)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 10  2'NOBB-nr. . . .'
     A            C2NOBB    R        B 10 17REFFLD(FWNOBB)
     A  36                                  ERRMSGID(VMV0170 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 11  2'Prisdato . . .'
     A            C2DATO         6Y 0B 11 17COLOR(YLW)
     A  50                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 50)
     A                                      CHECK(RB)
     A                                      EDTWRD('  .  .  ')
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 13  2'Enhet. . . . .'
     A            C2ENHE    R        B 13 17REFFLD(FWENHE)
     A  37                                  ERRMSGID(FMW0250 *LIBL/QMFOFAK 37)
     A  38                                  ERRMSGID(VMA1020 *LIBL/QMFOFAK 38)
     A  39                                  ERRMSGID(FMW0280 *LIBL/QMFOFAK 39)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 13 32'inkl. mva'
     A                                 13 48'Gammel'
     A                                 13 61'%-endr.'
     A                                 13 75'DG'
     A                                 14  2'Innkjøpspris .'
     A            C2INPR    R        B 14 17REFFLD(FWINPR)
     A  40                                  ERRMSGID(FMW0260 *LIBL/QMFOFAK 40)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C2INGM    R        O 14 45REFFLD(FWINPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2INEN         9Y 2O 14 59COLOR(YLW)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A                                 15  2'Salgspris. . .'
     A            C2SAPR    R        B 15 17REFFLD(FWSAPR)
     A  41                                  ERRMSGID(FMW0270 *LIBL/QMFOFAK 41)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C2SAIM    R        O 15 31REFFLD(FWSAPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2SAGM    R        O 15 45REFFLD(FWSAPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2SAEN         9Y 2O 15 59COLOR(YLW)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A            C2DEKN         5Y 2O 15 73COLOR(YLW)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A                                 17  2'Høyde i mm . .'
     A            C2HOYD    R        B 17 17REFFLD(FWHOYD)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 17 31'Bredde i mm. .'
     A            C2BRED    R        B 17 46REFFLD(FWBRED)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 17 59'Lengde i mm.'
     A            C2LENG    R        B 17 72REFFLD(FWLENG)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 18  2'Volum i m3 . .'
     A            C2VOLU    R        B 18 17REFFLD(FWVOLU)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 18 31'Vekt i kg. . .'
     A            C2VEKT    R        B 18 46REFFLD(FWVEKT)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 19  2'Antall . . . .'
     A            C2ANTA    R        B 19 17REFFLD(FWANTA)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 20  2'Best.mengde. .'
     A            C2BMEN    R        B 20 17REFFLD(FWBMEN)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 21  2'Utgått dato. .'
     A            C2UDAT         6Y 0B 21 17COLOR(YLW)
     A  51                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 51)
     A                                      CHECK(RB)
     A                                      EDTWRD('  .  .  ')
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 21 31'Erstatningsnr.'
     A            C2LVAE    R        B 21 46REFFLD(FWLVAE)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring   F13=-
     A                                      Statuskoder'
     A                                      COLOR(BLU)
