     A*%%TS  SD  19981007  174901  HKO         REL-V4R2M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19981007  174901  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 15 50)
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Start overføring '
     A                                      DSPATR(RI)
     A                                  4  2'Overføring . . . .'
     A            B1VALG         1Y 0B  4 21COLOR(YLW)
     A                                  4 30'1=Kontrolliste'
     A                                  5 30'2=Journalliste med'
     A                                  6 32'oppdatering'
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
      *
     A          R ASUME                     ASSUME
     A                                 24 79' '
