     A*%%TS  SD  20031116  163340  HKO         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HELP
     A          R B1BLD
     A*%%TS  SD  20031116  163340  HKO         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Standardverdier - nye varer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Leverandør. . . . . . . . .'
     A            B1LDOR    R        O  5 30REFFLD(VVLDOR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B1NAVN        30A  O  5 40COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Varegruppe. . . . . . . . .'
     A            B1OGRP    R        B  7 30REFFLD(VVOGRP)
     A  32                                  ERRMSGID(VMG0020 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B1HGRP    R        B  7 33REFFLD(VVHGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B1UGRP    R        B  7 36REFFLD(VVUGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1UTXT        35A  O  7 40COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Varetype. . . . . . . . . .'
     A            B1VTYP    R        B  9 30REFFLD(VVVTYP)
     A  35                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 35)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9 40'L=Lagervare, S=Skaffevare'
     A                                 11  2'Priskode. . . . . . . . . .'
     A            B1KPRI    R        B 11 30REFFLD(VVKPRI)
     A  36                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 11 40'Blank=Ordinært priset, N=Nettopris-
     A                                      et'
     A                                 12 40'B=Bunnpriset'
     A                                 14  2'Tildeling av varenr:'
     A                                      DSPATR(UL)
     A                                 16  2'Opprett varenummer fra. . .'
     A            B1VARF         8Y 0B 16 30COLOR(YLW)
     A  37                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 37)
     A  38                                  ERRMSGID(VMV0050 *LIBL/QMFOFAK 38)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                 17  2'Lev. varenr som eget varenr'
     A            B1KVAR         1Y 0B 17 30COLOR(YLW)
     A  39                                  ERRMSGID(FM00010 *LIBL/QMFOFAK 39)
     A  40                                  ERRMSGID(FMW0120 *LIBL/QMFOFAK 40)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 17 40'1=Ja,0=Nei (gjelder Jernia)'
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
