     A*%%TS  SD  20020314  115639  MHA         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20020314  115639  MHA         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 55)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Gruppebehandling '
     A                                      DSPATR(RI)
     A                                  4  2'Leverandør. . .'
     A            B1LDOR    R        O  4 18REFFLD(FWLDOR)
     A                                      COLOR(YLW)
     A            B1NAVN        30A  O  4 25COLOR(YLW)
     A                                  6  2'Lev. varenummer'
     A            B1LVAF    R        O  6 18REFFLD(FWLVAR)
     A                                      COLOR(YLW)
     A                                  6 39'-'
     A            B1LVAT    R        O  7 18REFFLD(FWLVAR)
     A                                      COLOR(YLW)
     A                                  9  2'Holde tilbake ?'
     A            B1VALH    R        B  9 18REFFLD(FÅVALG)
     A  31                                  ERRMSGID(FMW0100 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                  9 25'1=Ja,0=Nei'
     A                                 10  2'Frigi?. . . . .'
     A            B1VALF    R        B 10 18REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                 10 25'1=Ja,0=Nei'
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
      *
     A          R ASUME                     ASSUME
     A                                 24 79' '
