     A*%%TS  SD  19981121  142033  HKO         REL-V4R2M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19981121  142033  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 15 60)
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Arbeide med nettverksfiler '
     A                                      DSPATR(RI)
     A                                  5  2'Vær klar over at filen ASPKOMP fra-
     A                                       Jernia tømmes.'
     A                                  7  2'Dersom du trenger filen må du fors-
     A                                      ikre deg om at denne er'
     A                                  8  2'lest over i arbeidsregister for be-
     A                                      handling av leverandørs'
     A                                  9  2'vareregister (menypunk 1) før du g-
     A                                      år videre.'
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
