     A*%%TS  SD  19990909  125926  AMD         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A1WIN
     A*%%TS  SD  19990909  125926  AMD         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 8 32)
     A                                      CF03
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      PUTOVR
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2'Oppgi det leverandørnummer som'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  3  2'benyttes for Jernia'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5  2'Leverandørnummer. . . :'
     A            A1LDOR    R        B  5 26REFFLD(FOLDOR)
     A                                      DLTCHK
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A  31                                  ERRMSGID(FRL0010 *LIBL/QMFOFAK 31)
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  7 19'F4=Spørre'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
