     A*%%TS  SD  20070319  111143  AMD550      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A          R A1WIN
     A*%%TS  SD  20070319  111143  AMD550      REL-V5R4M0  5722-WDS
     A                                      WINDOW(&W_ACLI &W_ACPO 10 38)
     A                                      CA03
     A                                      KEEP
     A            W_ACLI         2S 0P
     A            W_ACPO         3S 0P
     A                                  2  2'Spørring '' '' Oppdater ''O'' .'
     A            A1SPOP    R        B  2 31REFFLD(FÅVALA)
     A                                      COLOR(YLW)
     A                                  4  2'Oppgi år  . . . . . . . . .'
     A            A1AARR    R        B  4 31REFFLD(FUAARR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  5  2'Oppgi ordrenummer . . . . .'
     A            A1NUMM    R        B  5 31REFFLD(FÅNUMM)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  6  2'Oppgi suffix. . . . . . . .'
     A            A1SUFF    R        B  6 31REFFLD(FÅSUFF)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  7  2'Oppgi kode. . . . . . . . .'
     A            A1KODE    R        B  7 31REFFLD(FÅVALA)
     A                                      COLOR(YLW)
     A                                  9  2'F03=Avslutt'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
