     A*%%TS  SD  20031023  121901  AMD         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R C1BLD
     A*%%TS  SD  20031023  121901  AMD         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kontroll av kontohenvisning   '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenummer . . . . . . . . .'
     A            C1VARE         8Y 0B  5 31COLOR(YLW)
     A                                      OVRDTA
     A  31                                  ERRMSGID(KMD0020 *LIBL/QMFOFAK 31)
     A                                      TEXT('Varenummer')
     A                                      EDTCDE(Z)
     A                                  6  2'Leveringstype. . . . . . . .'
     A            C1KLTY    R        B  6 31REFFLD(VAKLTY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Ordretype. . . . . . . . . .'
     A            C1KOTY    R        B  7 31REFFLD(VAKOTY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20031023  120928  AMD         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kontroll av kontohenvisning   '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenummer . . . . . . . . .'
     A            C1VARE         8Y 0O  5 31COLOR(YLW)
     A                                      OVRDTA
     A                                  5 46'Hentet fra nivå:'
     A                                  6  2'Leveringstype. . . . . . . .'
     A            C1KLTY    R        O  6 31REFFLD(VAKLTY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2NIVO        20A  O  6 46OVRDTA
     A                                      TEXT('Nivåbeskrivelse')
     A                                      COLOR(YLW)
     A                                  7  2'Ordretype. . . . . . . . . .'
     A            C1KOTY    R        O  7 31REFFLD(VAKOTY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Kontohenvisning. . . . . . .'
     A            C2KHNV    R        O  8 31REFFLD(VAKKOD)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10 31'Konto'
     A                                      COLOR(WHT)
     A                                 10 40'Spes'
     A                                      COLOR(WHT)
     A                                 10 46'Avdeling'
     A                                      COLOR(WHT)
     A                                 11  2'Salg, inkl. mva. . . . . . .'
     A            C2KKO1    R        O 11 31REFFLD(VAKKO1)
     A                                      COLOR(YLW)
     A  31 41                               ERRMSGID(FRH0020 *LIBL/QMFOFAK 31)
     A  31 42                               ERRMSGID(FRH0100 *LIBL/QMFOFAK 31)
     A  31 43                               ERRMSGID(FRH0110 *LIBL/QMFOFAK 31)
     A  31 44                               ERRMSGID(FRH0120 *LIBL/QMFOFAK 31)
     A  31 45                               ERRMSGID(FRH0130 *LIBL/QMFOFAK 31)
     A                                      OVRDTA
     A            C2KSP1    R        O 11 40REFFLD(VAKSP1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KAV1    R        O 11 48REFFLD(VAKAV1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Salg, eksl. mva. . . . . . .'
     A            C2KKO2    R        O 12 31REFFLD(VAKKO2)
     A  32 41                               ERRMSGID(FRH0020 *LIBL/QMFOFAK 32)
     A  32 42                               ERRMSGID(FRH0100 *LIBL/QMFOFAK 32)
     A  32 43                               ERRMSGID(FRH0110 *LIBL/QMFOFAK 32)
     A  32 44                               ERRMSGID(FRH0120 *LIBL/QMFOFAK 32)
     A  32 45                               ERRMSGID(FRH0130 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KSP2    R        O 12 40REFFLD(VAKSP2)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KAV2    R        O 12 48REFFLD(VAKAV2)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14  2'Kost . . . . . . . . . . . .'
     A            C2KKO3    R        O 14 31REFFLD(VAKKO3)
     A  33 41                               ERRMSGID(FRH0020 *LIBL/QMFOFAK 33)
     A  33 42                               ERRMSGID(FRH0100 *LIBL/QMFOFAK 33)
     A  33 43                               ERRMSGID(FRH0110 *LIBL/QMFOFAK 33)
     A  33 44                               ERRMSGID(FRH0120 *LIBL/QMFOFAK 33)
     A  33 45                               ERRMSGID(FRH0130 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KSP3    R        O 14 40REFFLD(VAKSP3)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KAV3    R        O 14 48REFFLD(VAKAV3)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 15  2'Innkjøp. . . . . . . . . . .'
     A            C2KKO4    R        O 15 31REFFLD(VAKKO4)
     A  34 41                               ERRMSGID(FRH0020 *LIBL/QMFOFAK 34)
     A  34 42                               ERRMSGID(FRH0100 *LIBL/QMFOFAK 34)
     A  34 43                               ERRMSGID(FRH0110 *LIBL/QMFOFAK 34)
     A  34 44                               ERRMSGID(FRH0120 *LIBL/QMFOFAK 34)
     A  34 45                               ERRMSGID(FRH0130 *LIBL/QMFOFAK 34)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KSP4    R        O 15 40REFFLD(VAKSP4)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KAV4    R        O 15 48REFFLD(VAKAV4)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 17  2'Kost, motpost. . . . . . . .'
     A            C2KKO5    R        O 17 31REFFLD(VAKKO5)
     A  35 41                               ERRMSGID(FRH0020 *LIBL/QMFOFAK 35)
     A  35 42                               ERRMSGID(FRH0100 *LIBL/QMFOFAK 35)
     A  35 43                               ERRMSGID(FRH0110 *LIBL/QMFOFAK 35)
     A  35 44                               ERRMSGID(FRH0120 *LIBL/QMFOFAK 35)
     A  35 45                               ERRMSGID(FRH0130 *LIBL/QMFOFAK 35)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KSP5    R        O 17 40REFFLD(VAKSP5)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KAV5    R        O 17 48REFFLD(VAKAV5)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 18  2'Rabatter . . . . . . . . . .'
     A            C2KKO6    R        O 18 31REFFLD(VAKKO6)
     A  36 41                               ERRMSGID(FRH0020 *LIBL/QMFOFAK 36)
     A  36 42                               ERRMSGID(FRH0100 *LIBL/QMFOFAK 36)
     A  36 43                               ERRMSGID(FRH0110 *LIBL/QMFOFAK 36)
     A  36 44                               ERRMSGID(FRH0120 *LIBL/QMFOFAK 36)
     A  36 45                               ERRMSGID(FRH0130 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KSP6    R        O 18 40REFFLD(VAKSP6)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KAV6    R        O 18 48REFFLD(VAKAV6)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 19  2'Prosjekt uttak . . . . . . .'
     A            C2KKO7    R        O 19 31REFFLD(VAKKO7)
     A  37 41                               ERRMSGID(FRH0020 *LIBL/QMFOFAK 37)
     A  37 42                               ERRMSGID(FRH0100 *LIBL/QMFOFAK 37)
     A  37 43                               ERRMSGID(FRH0110 *LIBL/QMFOFAK 37)
     A  37 44                               ERRMSGID(FRH0120 *LIBL/QMFOFAK 37)
     A  37 45                               ERRMSGID(FRH0130 *LIBL/QMFOFAK 37)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KSP7    R        O 19 40REFFLD(VAKSP7)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KAV7    R        O 19 48REFFLD(VAKAV7)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
