     A*%%TS  SD  20130113  114025  BOF620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20130113  114025  BOF620      REL-V7R1M0  5770-WDS
     A*                                     WINDOW(*DFT 15 68)
     A                                      CA03
     A                                      CA12
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Slette priser for leverandør  '
     A                                      DSPATR(RI)
     A                                  5  2'Leverandørnummer  . .'
     A            B1LDOR         6Y 0B  5 24COLOR(YLW)
     A  31                                  ERRMSGID(FRL0020 *LIBL/QMFOFAK 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B1TEK1    R        O  5 33REFFLD(FÅBESK)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
