     A*%%TS  SD  20090827  130508  BSA610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20090827  130508  BSA610      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 20 70)
     A                                      CF03
     A                                      KEEP
     A                                  2  1' Slettet ordre '
     A                                      DSPATR(RI)
     A            A1DUMY         1A  B  3  2DSPATR(ND)
     A                                  4  1'Kunde :'
     A            A1KUND    R        O  4 10REFFLD(FYKUND)
     A                                      COLOR(YLW)
     A                                  4 33'Firma:'
     A            FYFIRM    R        O  4 43REFFLD(FYFIRM)
     A                                      COLOR(YLW)
     A                                  4 49'Skjerm-id :'
     A            FYWSID    R        O  4 61REFFLD(FYWSID)
     A                                      COLOR(YLW)
     A            A1NAVN    R        O  5  1REFFLD(FYNAVN)
     A                                      COLOR(YLW)
     A                                  5 33'År. .:'
     A            FYAARR    R        O  5 42REFFLD(FYAARR)
     A                                      COLOR(YLW)
     A                                  5 49'Bruker-id :'
     A            FYUSER    R        O  5 61REFFLD(FYUSER)
     A                                      COLOR(YLW)
     A            A1ADR1    R        O  6  1REFFLD(FYADR1)
     A                                      COLOR(YLW)
     A                                  6 33'Ordre:'
     A            FYNUMM    R        O  6 40REFFLD(FYNUMM)
     A                                      COLOR(YLW)
     A                                  6 49'Dato. . . :'
     A            A1DATE         6Y 0O  6 61EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A            A1ADR2    R        O  7  1REFFLD(FYADR2)
     A                                      COLOR(YLW)
     A                                  7 33'Suff.:'
     A            FYSUFF    R        O  7 44REFFLD(FYSUFF)
     A                                      COLOR(YLW)
     A                                  7 49'Klokken . :'
     A            A1TIME         6Y 0O  7 61EDTWRD('  :  :  ')
     A                                      COLOR(YLW)
     A            A1STED    R        O  8  1REFFLD(FYSTED)
     A                                      COLOR(YLW)
     A                                  8 33'Otype:'
     A            FYOTYP    R        O  8 44REFFLD(FYOTYP)
     A                                      COLOR(YLW)
     A                                 10  1'Lev.adr:'
     A            FYLKUN    R        O 10 10REFFLD(FYLKUN)
     A                                      COLOR(YLW)
     A            FYNAVN    R        O 11  1REFFLD(FYNAVN)
     A                                      COLOR(YLW)
     A                                 10 33'Bilagsdato. . :'
     A            A1BDAT         6Y 0O 10 53EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A            FYADR1    R        O 12  1REFFLD(FYADR1)
     A                                      COLOR(YLW)
     A                                 11 33'Selger. . . . :'
     A            FYSELG    R        O 11 57REFFLD(FYSELG)
     A                                      COLOR(YLW)
     A            FYADR2    R        O 13  1REFFLD(FYADR2)
     A                                      COLOR(YLW)
     A                                 12 33'Salgsbeløp.'
     A                                 12 45'.'
     A                                 12 47':'
     A            A1SALG    R        O 12 49REFFLD(FYTOTS)
     A                                      COLOR(YLW)
     A            FYSTED    R        O 14  1REFFLD(FYSTED)
     A                                      COLOR(YLW)
     A                                 16  1'Kommentar:'
     A            FYTYPE    R        O 16 12REFFLD(FYTYPE)
     A                                      COLOR(YLW)
     A                                 15 33'Vår ref . . . :'
     A            FYVREF    R          16 33REFFLD(FYVREF)
     A                                      COLOR(YLW)
     A**          FYVREF        20A  O 16 33COLOR(YLW)
     A            FYKOM1    R        O 17  1REFFLD(FYKOM1)
     A                                      COLOR(YLW)
     A                                 17 33'Deres ref . . :'
6.NU A            A1DREF    R  -10   O 17 49REFFLD(FYDREF)
     A                                      COLOR(YLW)
     A**          FYDREF        20A  O 18 33COLOR(YLW)
     A            FYKOM2    R        O 18  1REFFLD(FYKOM2)
     A                                      COLOR(YLW)
     A                                 13 33'Rekvisisjon . :'
     A            FYREKV    R        O 13 49REFFLD(FYREKV)
     A                                      COLOR(YLW)
     A                                 19  1'F3=Gå tilbake'
     A                                      COLOR(BLU)
      *
     A          R ASUME
     A*%%TS  SD  19980318  092024  AMD         REL-V3R7M0  5716-PW1
     A                                      ASSUME
     A                                 24 79' '
