     A*%%TS  SD  19980701  154932  AMD         REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      CF03
     A                                      CF12
     A          R C1BLD
     A*%%TS  SD  19980701  154932  AMD         REL-V3R7M0  5716-PW1
     A                                      CF04
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av ordre-slettet-liste'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  2'Oppdater registre  . . . . . . .'
     A                                      COLOR(BLU)
     A            C1VAL1         1Y 0B  5 35VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                  5 43'0 = Kun prøveutskrift'
     A                                  6 43'1 = Oppdater listenummer og regist-
     A                                      er'
     A                                  9  2'Ordretyper som skal tas med  . .'
     A                                      COLOR(BLU)
     A            C1OTY1    R        B  9 35REFFLD(FOOTYP)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 43'Det kan oppgis inntil 6 ordretyper'
     A            C1OTY2    R        B 10 35REFFLD(FOOTYP)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10 43'Dersom ingen ting registreres,'
     A            C1OTY3    R        B 11 35REFFLD(FOOTYP)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 43'kommer alt med som ikke er kjørt'
     A            C1OTY4    R        B 12 35REFFLD(FOOTYP)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12 43'tidligere med kode 1.'
     A            C1OTY5    R        B 13 35REFFLD(FOOTYP)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            C1OTY6    R        B 14 35REFFLD(FOOTYP)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F4=Jobbkø'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
