     A*%%TS  SD  20070314  214028  RHO540      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20070314  214028  RHO540      REL-V5R4M0  5722-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppretting av database * I EN FILG-
     A                                      RUPPE * '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  3'1=Valg'
     A                                      COLOR(BLU)
     A                                  6  3'V Navn   Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  6 43'V Navn   Beskrivelse av file'
     A                                      COLOR(WHT)
     A            A1VA01         1A  B  7  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7  5'GFASPF Faste data'
     A            A1VA12         1A  B  7 43VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 45'GTGIPF Retur utbetaling e/splitt'
     A            A1VA02         1A  B  8  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8  5'GAVTPF Avtaleregister'
     A            A1VA13         1A  B  8 43VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 45'GTRTPF Utbetaling til oppdatering'
     A            A1VA03         1A  B  9  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9  5'GUDKPF Deklarasjonskoder'
     A            A1VA14         1A  B  9 43VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 45'GOCRPF Returer OCR e/splitt'
     A            A1VA04         1A  B 10  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10  5'GUBFPF Utbetalingsforsla'
     A            A1VA15         1A  B 10 43VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 45'GORTPF OCR til oppdatering'
     A            A1VA05         1A  B 11  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11  5'GKBFPF Utbetalingsforslag kopi'
     A            A1VA16         1A  B 11 43VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 45'GATRPF Retur eksterne trans.'
     A            A1VA06         1A  B 12  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12  5'GLONPF Utbetaling lønn'
     A            A1VA17         1A  B 12 43VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12 45'GINKPF Retur inkasso'
     A            A1VA07         1A  B 13  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13  5'GRETPF&GSTRPF Returfiler'
     A            A1VA18         1A  B 13 43VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13 45'GUSTPF Felles sekvensteller'
     A            A1VA08         1A  B 14  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14  5'GBTRPF Retur fra banken kopi'
     A            A1VA19         1A  B 14 43VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14 45'GAKTPF Kontrollfil'
     A            A1VA09         1A  B 15  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 15  5'GULXPF Retur lønn'
     A            A1VA20         1A  B 15 43VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 15 45'DIRREM Remittering til bank'
     A            A1VA10         1A  B 16  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 16  5'GURXPF Retur utbetalinger     '
     A            A1VA21         1A  B 16 43VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 16 45'GUnnPF BETFOR-Transaksjoner'
     A            A1VA11         1A  B 17  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 17  5'GKTXPF Retur kontoavstemming'
     A            A1VA22         1A  B 17 43VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 17 45'GXnnPF BETFOR-Overstyring'
     A                                 20 10'Oppgi file-gruppe . . . . . . :'
     A            A1FGRP         3A  B 20 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      DFTVAL('XXX')
     A                                      COLOR(YLW)
     A                                 21 10'Skal register(e) nullstilles. :'
     A            A1NULL         1A  B 21 43VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 21 47'(S=Slette innhold i register)'
     A                                 23  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            A1VA23         1A  B 18  3VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 18  5'GURMPF Kvittering mottaksretur'
     A            A1VA24         1A  B 18 43VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 18 45'GPCFPF Navnsetting PC-filer '
