     A*%%TS  SD  20081105  133249  KOB560      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1BLD
     A*%%TS  SD  20081103  004703  KOB560      REL-V5R4M0  5722-WDS
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppretting av database * AUTOBANK -
     A                                      *       '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  3'Velg alternativ'
     A                                      COLOR(BLU)
     A                                  7  4'REMITTERING:'
     A                                      DSPATR(UL)
6.NU A**                               23  3'F3=Gå tilbake'
6.NU A**                                    COLOR(BLU)
     A                                  8  4'1. Oppretting av filer i FILGRUPPE-
     A                                      .         '
     A                                  9  4'2. Oppretting av filer i ADB.     -
     A                                                '
     A                                 10  4'eller'
     A                                      COLOR(RED)
     A                                 11  4'3. Oppretting av ALLE filer i FILG-
     A                                      RUPPE. (ADB blir ikke brukt).'
     A                                 13  4'ADRA: AccountMatch'
     A                                      DSPATR(UL)
     A                                 14  4'4. Oppretting av filer i FILGRUPPE-
     A                                      .         '
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                 23  2'F3=Gå Tilbake'
     A                                      COLOR(BLU)
     A                                 23 20'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 38'F6=Se på meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
