     A*%%TS  SD  20030120  112301  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASTELE
     A* Format. . . . . : GL109D
     A* Beskrivelse . . : Henter returdata
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200103 KOB  Nytt program
7.01 A* K00   240420 bsa  Tillater bredere skjermbilde
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
7.01 A                                      DSPSIZ(24 80 *DS3 -
7.01 A                                             27 132 *WIDE)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
     A                                          '))
     A          R A1WIN
     A*%%TS  SD  19950303  114749  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Behandler Telegiro')
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 5 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  4  2'Telegiro-returer behandles...'
     A                                      COLOR(WHT)
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A          R A3WIN
     A*%%TS  SD  19950303  114749  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Behandler OCR')
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 5 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  4  2'OCR-returer behandles...'
     A                                      COLOR(WHT)
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A          R A4WIN
     A*%%TS  SD  19980922  152823  RHO         REL-V4R2M0  5769-PW1
     A                                      TEXT('Behandler inkassoreturer')
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 5 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  4  2'Inkassoreturer behandles...'
     A                                      COLOR(WHT)
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A          R X2WIN
     A*%%TS  SD  19950303  104646  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Avtaler må opprettes!')
     A                                      KEEP
     A                                  4  2'Det mangler en eller flere avtaler'
     A                                      COLOR(WHT)
     A                                  7  2'Trykk Enter for å fortsette.'
     A                                      COLOR(WHT)
     A                                  5  2'på avtaleregisteret.  Se utskrift!'
     A                                      COLOR(WHT)
     A                                  2  2' Feil i retur ! '
     A                                      DSPATR(RI)
     A          R X3WIN
     A*%%TS  SD  19950313  104831  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Oppdrag finnes fra før')
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 8 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A                                  4  2'Det er forsøkt dobbel innlesing av'
     A                                      COLOR(WHT)
     A                                  5  2'OCR-retur.  Se utskrift!          '
     A                                      COLOR(WHT)
     A                                  7  2'Trykk Enter for å fortsette.'
     A                                      COLOR(WHT)
     A          R X1WIN
     A*%%TS  SD  19950202  101839  RH          REL-V2R3M0  5738-PW1
     A                                      TEXT('Ferdig!')
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 5 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2'Hente returdata er ferdig.'
     A                                  4  2'Trykk Enter for å avslutte.'
     A          R ASUME
     A*%%TS  SD  19941223  114838  RH          REL-V2R3M0  5738-PW1
     A                                      KEEP
     A                                      ASSUME
     A                                 24 79' '
