     A*%%TS  SD  20070315  135416  RHO540      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASTELE
     A* Format. . . . . : GL104D
     A* Beskrivelse . . : Vedlikehold utbetalingsforslag
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200103 KOB  Nytt program
     A* 5.51  260106 RHO  Lagt inn leverandørnavn pr.linje.
6.30 A* 6.30  171014 BSA  Endret pga problemer i jacada
7.xx A* 7.xx  251116 bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A          R B1SFL                     SFL
     A*%%TS  SD  20060126  145419  RHO540      REL-V5R3M0  5722-WDS
     A                                      TEXT('Subfile')
     A            B1STAT    R        H      REFFLD(RTSTAT)
     A            B1BDAT    R        H      REFFLD(ROBDAT)
     A            B1TIST    R        H      REFFLD(ROTIST)
5.51 A***         B1NAVN        13A  H      TEXT('Leverandørnavn')
     A            B1AVTK         8S 4H      TEXT('Avtalt kurs')
     A            B1AVTM         6A  H      TEXT('Avtalt med')
     A            B1TENR         6A  H      TEXT('Terminkontraktsnummer')
     A            B1TEKU         8S 4H      TEXT('Terminkontraktskurs')
5.51 A****        B1LEVR    R        H      REFFLD(ROLEVR)
7.xx A            B1VALG    R        B 11  2REFFLD(AAVALG)
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A                                      COLOR(YLW)
     A                                      VALUES('2' '4' '5' 'L' 'F' 'A' 'T' -
     A                                      'V' 'X' ' ')
7.xx A            B1BFLI    R        O 11  4REFFLD(ROBFLI)
     A                                      TEXT('Bet.forslagslinjenummer')
7.xx A            B1FDAT         6Y 0O 11 10EDTWRD('  .  .  ')
     A                                      TEXT('Betalingsdato')
7.xx A            B1BELØ    R        O 11 19REFFLD(ROBELØ)
     A                                      TEXT('Beløp')
7.xx A            B1RABB    R        O 11 35REFFLD(RTSTAT)
     A                                      TEXT('R=Trukket rabatt')
7.xx A            B1VALK    R        O 11 37REFFLD(ROVALK)
     A                                      TEXT('Valutakode')
7.xx A            B1AVTE    R        O 11 41REFFLD(RTSTAT)
     A                                      TEXT('A=Avtalt kurs / T=Terminkontr-
     A                                      akt')
     A                                      COLOR(RED)
7.xx A            B1REKO         1A  O 11 43TEXT('1-mottatt 1.g.retur  F-mottat-
     A                                      t feilretur')
     A                                      COLOR(RED)
5.51 A**          B1TEXT        15A  O 10 49TEXT('Bilagstekst')
7.xx A            B1TEXT         9A  O 11 45TEXT('Bilagstekst')
7.xx A            B1BILN    R        O 11 55REFFLD(ROBILN)
     A                                      TEXT('Bilagsnummer')
7.xx A            B1LEVR    R        O 11 64REFFLD(ROLEVR)
5.52 A                                      TEXT('Leverandørnummer')
7.xx A            B1NAVN         7A  O 11 71TEXT('Leverandørnavn')
7.xx A            B1KIDI         1A  O 11 79TEXT('KID-status')
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20061102  112830  RHO540      REL-V5R4M0  5722-WDS
7.xx A                                      SFLSIZ(0011)
7.xx A                                      SFLPAG(0010)
     A                                      TEXT('Hovedbilde')
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA02
     A                                      CA03
     A                                      CA05
     A                                      CA06
     A                                      CF07
     A                                      CA08
     A                                      CF10
     A                                      CF11
     A                                      CF14
     A                                      KEEP
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      PRINT
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A  39                                  SFLMSGID(RML0370 *LIBL/QMFOKON 39)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A            B2HEAD        33A  O  2  2COLOR(WHT)
7.xx A                                  2 38'GL104B2'
7.xx A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4 29'(Forslaget er overført)'
     A  38                                  DSPATR(RI)
     A N38                                  DSPATR(ND)
     A  38                                  COLOR(WHT)
     A                                  4 64'Forslagsnr.:'
     A            B2BFNR    R        O  4 77REFFLD(ROBFNR)
     A                                      DSPATR(UL)
7.xx A                                  5  5'Linje'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  2'Velg og trykk Enter.'
     A                                      COLOR(BLU)
7.xx A                                  7 43'F'
     A  77                                  DSPATR(BL)
     A N77                                  DSPATR(ND)
     A                                      COLOR(RED)
7.xx A            B2ANFE         5Y 0O  7 45TEXT('Antall feillinjer i forslaget-
     A                                      ')
     A N77                                  DSPATR(ND)
     A                                      COLOR(RED)
     A                                      EDTCDE(Z)
7.xx A            B2SUBV        78A  O  8  2TEXT('Subfilevalg')
     A                                      COLOR(BLU)
7.xx A**                                7 39'A/T'
7.xx A**                                    COLOR(WHT)
7.xx A**                                7 43'1,'
7.xx A**                                    COLOR(WHT)
7.xx A            B2VKTO        15A  O  9 65TEXT('Valutakonto')
     A                                      COLOR(BLU)
7.xx A**          B2SUBH        78A  O 10  2TEXT('Subfileheader')
7.xx A                                 10  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                 10  4'Linje'
7.xx A                                      COLOR(WHT)
7.xx A                                 10 10'BetDato'
7.xx A                                      COLOR(WHT)
7.xx A                                 10 19'Beløp'
7.xx A                                      COLOR(WHT)
7.xx A                                 10 35'R'
7.xx A                                      COLOR(WHT)
7.xx A            B2SUBH        44A  O 10 37TEXT('Subfileheader')
7.xx A**                                    DSPATR(UL)
     A                                      COLOR(WHT)
7.xx A            B2VALG    R        B  6  2REFFLD(AAVALG)
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A  42                                  ERRMSGID(RML0420 *LIBL/QMFOKON 42)
     A  43                                  ERRMSGID(RMA0010 *LIBL/QMFOKON 43)
     A  45                                  ERRMSGID(RML0600 *LIBL/QMFOKON 45)
     A  46                                  ERRMSGID(RML0640 *LIBL/QMFOKON 46)
     A  47                                  ERRMSGID(RML0650 *LIBL/QMFOKON 47)
     A  48                                  ERRMSGID(RML0660 *LIBL/QMFOKON 48)
     A  49                                  ERRMSGID(RML0670 *LIBL/QMFOKON 49)
     A  52                                  ERRMSGID(RML0690 *LIBL/QMFOKON 52)
     A  53                                  ERRMSGID(RML0710 *LIBL/QMFOKON 53)
     A  54                                  ERRMSGID(RML0730 *LIBL/QMFOKON 54)
     A  55                                  ERRMSGID(RML0720 *LIBL/QMFOKON 55)
     A  56                                  ERRMSGID(RML0700 *LIBL/QMFOKON 56)
     A  66                                  ERRMSGID(RML0770 *LIBL/QMFOKON 66)
     A  67                                  ERRMSGID(RML0380 *LIBL/QMFOKON 67)
     A                                      VALUES('2' '4' '5' 'L' 'F' 'A' 'T' -
     A                                      'V' 'X' ' ')
7.xx A            B2BFLI    R        B  6  4REFFLD(ROBFLI)
     A                                      DLTCHK
     A  31                                  ERRMSGID(RM00020 *LIBL/QMFOKON 31)
     A  32                                  ERRMSGID(RM00030 *LIBL/QMFOKON 32)
     A  41                                  ERRMSGID(RML0410 *LIBL/QMFOKON 41)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      TEXT('Bet.forslagslinjenummer')
     A                                      COLOR(YLW)
     A          R B2CMD
     A*%%TS  SD  20040520  222732  RHO         REL-V5R2M0  5722-WDS
     A                                      TEXT('Kommando taster')
     A                                      PRINT
6.30 A                                 22  2'F2=Nytt forslag'
     A                                      TEXT('Betalingsforslagnr.')
     A                                      COLOR(BLU)
6.30 A                                 22 19'F3=Gå tilbake'
     A                                      COLOR(BLU)
6.30 A                                 22 34'F5=Forny'
     A                                      COLOR(BLU)
6.30 A                                 22 44'F6=Slett forslag'
     A                                      COLOR(BLU)
6.30 A                                 22 62'F7=Vis feilretur'
     A N77                                  DSPATR(ND)
     A                                      COLOR(RED)
6.30 A                                 23 18'F10=Utskrift'
     A                                      COLOR(BLU)
6.30 A                                 23 32'F11=Overfør til samlefil/bank'
     A                                      TEXT('Betalingsforslagnr.')
     A                                      COLOR(BLU)
6.30 A                                 23 64'F14=Åpne forslag'
     A                                      COLOR(BLU)
6.30 A                                 23  2'F8=Endre dato'
     A                                      COLOR(BLU)
     A*
     A          R C1SFL                     SFL
     A*%%TS  SD  20030907  095456  KOB         REL-V5R2M0  5722-WDS
     A                                      TEXT('Subfile - Betalingsforslag')
     A            Y1VALG    R        B  8  2REFFLD(AAVALG)
     A                                      TEXT('Valg')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      VALUES('1' ' ')
     A            Y1OPDA         6Y 0O  8 10EDTWRD('  .  .  ')
     A                                      TEXT('Dato')
     A            Y1BFNR         3S 0O  8  5TEXT('Forslagsnummer')
     A            Y1OPAV        10A  O  8 22TEXT('Opprettet av')
     A          R C1CTL                     SFLCTL(C1SFL)
     A*%%TS  SD  20030903  235016  KOB         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0007)
     A                                      SFLPAG(0006)
     A                                      WINDOW(C1CMD)
     A                                      TEXT('Hovedbilde - Betalingsforslag-
     A                                      ')
     A                                      ROLLUP(20)
     A                                      ROLLDOWN(21)
     A                                      CA03
     A                                      OVERLAY
     A                                      PUTOVR
     A  22                                  SFLDSP
     A  23                                  SFLDSPCTL
     A  24                                  SFLCLR
     A  25                                  SFLEND(*MORE)
     A            SVRN02         4S 0H      SFLRCDNBR(CURSOR)
     A                                  2  9'BETALINGSFORSLAG'
     A                                      COLOR(WHT)
     A                                  4  2'Velg og trykk Enter.'
     A                                  5  2'1=Velg'
7.xx A*                                  6 10'------ Opprettet -----'
7.xx A*                                      COLOR(WHT)
7.xx A                                  7  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  5'Fnr'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 12'Dato'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 22'Av'
7.xx A**                                7  2'V  Fnr    Dato      Av        '
7.xx A**                                    DSPATR(UL)
     A                                      COLOR(WHT)
     A          R C1CMD
     A*%%TS  SD  19950907  144614  RH1         REL-V3R1M0  5763-PW1
     A                                      TEXT('Kommandotaster - Betalingsfor-
     A                                      slag')
     A                                      CA03
     A                                      OVERLAY
     A                                      WINDOW(&W_AROW &W_ACOL 16 32)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                 15  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R C1BLD
     A*%%TS  SD  20060126  135700  RHO540      REL-V5R3M0  5722-WDS
     A                                      TEXT('Betalingsforslagsnr.')
     A                                      CA03
     A                                      CA04
     A                                      CLRL(*ALL)
     A                                      PRINT
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av betalingsforslag'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  5  2'Betalingsforslagsnr. . . . +'
     A            C1BFNR    R        B  5 31REFFLD(ROBFNR)
     A                                      COLOR(YLW)
     A                                      TEXT('Bet.forslagsnr.')
     A  60                                  ERRMSGID(RML0360 *LIBL/QMFOKON 60)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  1 37'TELEGIRO'
     A                                      COLOR(WHT)
7.xx A                                 23 17'F4=Spørring'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20070315  135416  RHO540      REL-V5R4M0  5722-WDS
     A                                      TEXT('Vise-/Endre post')
     A                                      CA03
     A                                      CA08
     A                                      CA09
     A                                      INZRCD
     A                                      PRINT
     A            C2STAT    R        H      REFFLD(RTSTAT)
     A            C2TIST    R        H      REFFLD(ROTIST)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av betalingsforslag'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            C2NYEN    R        O  4 69REFFLD(AANYEN)
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  6  2'Leverandørnummer .'
     A            C2LEVR    R        O  6 21REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                  6 44'Valutakode - faktura.'
     A            C2FVAL    R        O  6 66REFFLD(ROVALK)
     A                                      TEXT('Valuta-kode - faktura')
     A                                  7  2'Bilagsdato . . . .'
     A            C2BDAT         6Y 0O  7 21EDTWRD('  .  .  ')
     A                                      DSPATR(UL)
     A                                  7 44'Valutakode - betaling'
     A            C2VALK    R        B  7 66REFFLD(ROVALK)
     A                                      TEXT('Valuta-kode - betaling')
     A                                      DSPATR(UL)
     A  30                                  DSPATR(PR)
     A N30                                  COLOR(YLW)
     A  57 58 59
     A  63                                  DSPATR(PC)
     A  57                                  ERRMSGID(RML0750 *LIBL/QMFOKON 57)
     A  58                                  ERRMSGID(RML0720 *LIBL/QMFOKON 58)
     A  59                                  ERRMSGID(RML0710 *LIBL/QMFOKON 59)
     A  63                                  ERRMSGID(RML0740 *LIBL/QMFOKON 63)
     A                                  8  2'Betalingsdato. . .'
     A            C2FDAT         6Y 0B  8 21EDTWRD('  .  .  ')
     A  33
     AO 34                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      CHECK(RB)
     A N30                                  COLOR(YLW)
     A  33                                  ERRMSGID(RM02050 *LIBL/QMFOKON 33)
     A  34                                  ERRMSGID(RML0310 *LIBL/QMFOKON 34)
     A                                  8 44'Opprinnelig bet.dato '
     A            C3OPFO         6Y 0O  8 66TEXT('Opprinnelig forfallsdato')
     A                                      EDTWRD('  .  .  ')
     A                                      DSPATR(UL)
     A                                  9  2'Beløp. . . . . . .'
     A            C2BELØ    R        B  9 21REFFLD(ROBELØ)
     A  36
     AO 37                                  DSPATR(PC)
     A  36                                  ERRMSGID(RML0320 *LIBL/QMFOKON 36)
     A  37                                  ERRMSGID(RML0330 *LIBL/QMFOKON 37)
     A  30                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A N30                                  COLOR(YLW)
     A                                      CHECK(RB)
     A                                  9 44'Beløp før rabatt NOK.'
     A            C3OPBN    R     Y  O  9 66REFFLD(ROBELØ)
     A                                      TEXT('Trukket rabatt NOK')
     A                                      EDTCDE(K)
     A                                      DSPATR(UL)
     A                                 10  2'Valutabeløp. . . .'
     A            C2VALB    R        B 10 21REFFLD(ROVALB)
     A  30                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A N30                                  COLOR(YLW)
     A                                      CHECK(RB)
     A                                 10 44'Beløp før rabatt Val.'
     A            C3OPBV    R        O 10 66REFFLD(ROBELØ)
     A                                      DSPATR(UL)
     A                                      TEXT('Trukket rabatt NOK')
     A                                 12  2'Restbeløp NOK. . .'
     A            C2REST    R        O 12 21REFFLD(ROREST)
     A                                      DSPATR(UL)
     A                                 12 47'Rabattdato-1 . . .'
     A            C3RDA1         6Y 0O 12 66TEXT('Rabattdato-1')
     A                                      EDTWRD('  .  .  ')
     A                                      DSPATR(UL)
     A                                 13  2'Restbeløp Val. . .'
     A            C2VALR    R        O 13 21REFFLD(ROVALR)
     A                                      DSPATR(UL)
     A                                 13 47'Rabattbeløp-1 NOK.'
     A            C3RUN1    R        O 13 66REFFLD(ROBELØ)
     A                                      DSPATR(UL)
     A                                      TEXT('Rabattbeløp-1 NOK')
     A                                 14  2'Delbetalt. . . . .'
     A            C2DELB    R        O 14 21REFFLD(RODELB)
     A                                      DSPATR(UL)
     A                                 14 47'Rabattbeløp-1 Val.'
     A            C3RUV1    R        O 14 66REFFLD(ROBELØ)
     A                                      DSPATR(UL)
     A                                      TEXT('Rabattbeløp-1 valuta')
     A                                 16  2'Rabattdato-2 . . .'
     A            C3RDA2         6Y 0O 16 21TEXT('Rabattdato-2')
     A                                      EDTWRD('  .  .  ')
     A                                      DSPATR(UL)
     A                                 16 47'Rabattdato-3 . . .'
     A            C3RDA3         6Y 0O 16 66TEXT('Rabattdato-3')
     A                                      EDTWRD('  .  .  ')
     A                                      DSPATR(UL)
     A                                 17  2'Rabattbeløp-2 NOK.'
     A            C3RUN2    R        O 17 21REFFLD(ROBELØ)
     A                                      DSPATR(UL)
     A                                      TEXT('Rabattbeløp-2 NOK')
     A                                 17 47'Rabattbeløp-3 NOK.'
     A            C3RUN3    R        O 17 66REFFLD(ROBELØ)
     A                                      DSPATR(UL)
     A                                      TEXT('Rabattbeløp-3 NOK')
     A                                 18  2'Rabattbeløp-2 Val.'
     A            C3RUV2    R        O 18 21REFFLD(ROBELØ)
     A                                      DSPATR(UL)
     A                                      TEXT('Rabattbeløp-2 valuta')
     A                                 18 47'Rabattbeløp-3 Val.'
     A            C3RUV3    R        O 18 66REFFLD(ROBELØ)
     A                                      DSPATR(UL)
     A                                      TEXT('Rabattbeløp-3 valuta')
     A                                 20  2'Bilagstekst. . . .'
     A            C2TEXT    R        B 20 21REFFLD(ROTEXT)
     A                                      DSPATR(UL)
     A  30                                  DSPATR(PR)
     A N30                                  COLOR(YLW)
     A                                 19  2'KID (*). . . . . .'
     A            C2KIDI    R        B 19 21REFFLD(ROKIDI)
     A  30                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  35
     AO 40                                  DSPATR(PC)
     A  35                                  ERRMSGID(RML0340 *LIBL/QMFOKON 35)
     A  40                                  ERRMSGID(RML0400 *LIBL/QMFOKON 40)
     A N30                                  COLOR(YLW)
     A                                 21  2'Deklarasjonskode .'
     A            C2DECK    R        B 21 21REFFLD(GDRDEC)
     A                                      TEXT('Deklarasjonskodee')
     A  30                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A N30                                  COLOR(YLW)
     A            C1RTX1    R        O 21 28REFFLD(GDRTX1)
     A                                      DSPATR(UL)
     A            C1RTX2    R        O 22 28REFFLD(GDRTX2)
     A                                      DSPATR(UL)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F8=Valutakoder'
     A                                      COLOR(BLU)
     A                                 23 35'F9=Rabatter'
     A                                      COLOR(BLU)
     A  30                                  DSPATR(ND)
     A                                 19 47'Lev.fakturanr. (S)'
     A            C3LFAK    R        B 19 66REFFLD(ROLFAK)
     A                                      TEXT('Leverandørens fakturanummer')
     A  30                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A N30                                  COLOR(YLW)
     A          R C3BLD
     A*%%TS  SD  20030903  235016  KOB         REL-V5R2M0  5722-WDS
     A                                      PRINT
     A                                      TEXT('Vise-/Endre post')
     A                                      CA03
     A            C2STAT    R        H      REFFLD(RTSTAT)
     A            C2TIST    R        H      REFFLD(ROTIST)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av betalingsforslag'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            C2NYEN    R        O  4 69REFFLD(AANYEN)
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  6  2'Leverandørnr . . . . . . .'
     A            C2LEVR    R        O  6 29REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                  6 47'Valutakode - faktura . . .'
     A            C2FVAL    R        O  6 74REFFLD(ROVALK)
     A                                      DSPATR(UL)
     A                                  7  2'Referansenummer. . . . . .'
     A            C2REFN    R        O  7 29REFFLD(ROREFN)
     A                                      DSPATR(UL)
     A                                  7 47'Valutakode - betaling. . .'
     A            C2VALK    R        O  7 74REFFLD(ROVALK)
     A                                      DSPATR(UL)
     A                                  8  2'Att.kode . . . . . . . . .'
     A            C2ATTS    R        O  8 29REFFLD(ROATTS)
     A                                      DSPATR(UL)
     A                                  8 47'Journallistenr . . . . . .'
     A            C2JOUR    R        O  8 74REFFLD(ROJOUR)
     A                                      DSPATR(UL)
     A                                 10  2'Bilagskode . . . . . . . .'
     A            C2BILK    R        O 10 29REFFLD(ROBILK)
     A                                      DSPATR(UL)
     A                                 10 47'Virksomhetskode. . . . . .'
     A            C2VIRK    R        O 10 74REFFLD(ROVIRK)
     A                                      DSPATR(UL)
     A                                 11  2'Bilagsnr . . . . . . . . .'
     A            C2BILN    R        O 11 29REFFLD(ROBILN)
     A                                      DSPATR(UL)
     A                                 11 47'Betalingskode. . . . . . .'
     A            C2BETK    R        O 11 74REFFLD(ROBETK)
     A                                      DSPATR(UL)
     A                                 12  2'Betalingsreferanse-1 . . .'
     A            C2RRF1    R        O 12 29REFFLD(RORRF1)
     A                                      DSPATR(UL)
     A                                 12 47'Betalingsreferanse-2 . . .'
     A            C2RRF2    R        O 12 74REFFLD(RORRF2)
     A                                      DSPATR(UL)
     A                                 14  2'Remitteringskode . . . . .'
     A            C2REMK    R        O 14 29REFFLD(RLREMK)
     A                                      TEXT('Betalingskode')
     A                                 14 47'Betalingsforslagsnr. . . .'
     A            C2BFNR    R        O 14 74REFFLD(ROBFNR)
     A                                      DSPATR(UL)
     A                                 15  2'Reklamasjonskode . . . . .'
     A            C2REKL    R        O 15 29REFFLD(ROREKL)
     A                                      DSPATR(UL)
     A                                 15 47'Betalingsforslagslinje . .'
     A            C2BFLI    R        O 15 74REFFLD(ROBFLI)
     A                                      DSPATR(UL)
     A                                 16  2'Regnskapsår. . . . . . . .'
     A            C2RAAR    R        O 16 29REFFLD(RORAAR)
     A                                      DSPATR(UL)
     A                                 16 47'Periode. . . . . . . . . .'
     A            C2RPER    R        O 16 74REFFLD(RORPER)
     A                                      DSPATR(UL)
     A                                 18  2'Samlebilagnr . . . . . . .'
     A            C2SAMB    R        O 18 29REFFLD(ROSAMB)
     A                                      DSPATR(UL)
     A                                 18 47'Avdeling . . . . . . . . .'
     A            C2AVDE    R        O 18 74REFFLD(ROAVDE)
     A                                      DSPATR(UL)
     A                                 19  2'Betalingsbetingelse. . . .'
     A            C2BETB    R        O 19 29REFFLD(ROBETB)
     A                                      DSPATR(UL)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20030907  095456  KOB         REL-V5R2M0  5722-WDS
     A                                      WINDOW(&W_AROW &W_ACOL 14 37)
     A                                      TEXT('Slette enkeltposter')
     A                                      CA03
     A                                      PRINT
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Sletting av linje '
     A                                      DSPATR(RI)
     A                                  4  2'Linjenummer :'
     A                                      COLOR(WHT)
     A            D1BFLI    R        O  4 16REFFLD(ROBFLI)
     A                                      DSPATR(UL)
     A                                      TEXT('Linjenummer')
     A                                      COLOR(WHT)
     A                                  5  2'Beløp . . . :'
     A                                      COLOR(WHT)
     A            D1BELØ    R        O  5 16REFFLD(ROBELØ)
     A                                      DSPATR(UL)
     A                                      TEXT('Beløp')
     A                                      COLOR(WHT)
     A                                  6  2'Bilagstekst :'
     A                                      COLOR(WHT)
     A            D1TEXT    R        O  6 16REFFLD(ROTEXT)
     A                                      DSPATR(UL)
     A                                      TEXT('Bilagstekst')
     A                                      COLOR(WHT)
     A                                  7  2'Forfallsdato:'
     A                                      COLOR(WHT)
     A            D1FDAT         6Y 0O  7 16DSPATR(UL)
     A                                      TEXT('Forfallsdato')
     A                                      EDTWRD('  .  .  ')
     A                                      COLOR(WHT)
     A                                  8  2'Bilagsnummer:'
     A                                      COLOR(WHT)
     A            D1BILN    R        O  8 16REFFLD(ROBILN)
     A                                      DSPATR(UL)
     A                                      TEXT('Bilagsnummer')
     A                                      COLOR(WHT)
     A                                  9  2'Leverandørnr:'
     A                                      COLOR(WHT)
     A            D1LEVR    R        O  9 16REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      TEXT('Leverandørnr.')
     A                                      COLOR(WHT)
     A                                 11  2'Trykk Enter for å slette.'
     A                                      COLOR(WHT)
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R E1WIN
     A*%%TS  SD  19980323  115513  RHO         REL-V3R7M0  5716-PW1
     A                                      TEXT('Slette forslaget')
     A                                      CA03
     A                                  2  2' Sletting av betalingsforslaget '
     A                                      DSPATR(RI)
     A                                  4  2'Trykk Enter for å slette.'
     A                                      COLOR(WHT)
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R F1WIN
     A*%%TS  SD  20030907  095456  KOB         REL-V5R2M0  5722-WDS
     A                                      WINDOW(&W_AROW &W_ACOL 7 37)
     A                                      TEXT('Endre dato for lønnsutbetalin-
     A                                      g')
     A                                      CA03
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  4'ENDRING AV DATO FOR BELASTNING'
     A                                      COLOR(WHT)
     A                                  4  3'Ny dato for belastning:'
     A            F1DATO         6Y 0B  4 27EDTWRD('  .  .  ')
     A                                      TEXT('Dato for lønnsutbetaling')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A  44                                  ERRMSGID(RML0590 *LIBL/QMFOKON 44)
     A                                  6  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R G1WIN
     A*%%TS  SD  20030121  011835  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(&W_AROW &W_ACOL 10 37)
     A                                      TEXT('Registrering av avtalt kurs')
     A                                      CA03
     A                                      CF10
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  5'REGISTRERING AV AVTALT KURS'
     A                                      COLOR(WHT)
     A                                  4  5'Valutakode :'
     A            G1FVAL    R        O  4 18REFFLD(ROVALK)
     A                                      TEXT('Valutakode ved avtalt kurs')
     A                                      COLOR(WHT)
     A                                  4 23'(Faktura)'
     A                                  5  5'Valutakode :'
     A            G1VALK    R        O  5 18REFFLD(ROVALK)
     A                                      TEXT('Valutakode ved avtalt kurs')
     A                                      COLOR(WHT)
     A                                  5 23'(Betaling)'
     A                                  6  5'Avtalt kurs:'
     A            G1AVTK         8Y 4B  6 18TEXT('Avtalt kurs')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A  51                                  ERRMSGID(RML0690 *LIBL/QMFOKON 51)
     A                                      CHECK(RB)
     A                                      EDTWRD('    .    ')
     A                                  7  5'Avtalt med :'
     A            G1AVTM         6A  B  7 18TEXT('Avtalt med')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  9  4'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  9 19'F10=Endre alle'
     A                                      COLOR(BLU)
     A          R H1WIN
     A*%%TS  SD  20030121  011835  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(&W_AROW &W_ACOL 10 37)
     A                                      TEXT('Registrering av terminkontrak-
     A                                      t')
     A                                      CA03
     A                                      CF10
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  4'REGISTRERING AV TERMINKONTRAKT'
     A                                      COLOR(WHT)
     A                                  4  4'Valutakode . :'
     A            H1FVAL    R        O  4 19REFFLD(ROVALK)
     A                                      TEXT('Valutakode ved terminforretni-
     A                                      ng')
     A                                      COLOR(WHT)
     A                                  4 24'(Faktura)'
     A                                  5  4'Valutakode . :'
     A            H1VALK    R        O  5 19REFFLD(ROVALK)
     A                                      TEXT('Valutakode ved terminforretni-
     A                                      ng')
     A                                      COLOR(WHT)
     A                                  5 24'(Betaling)'
     A                                  6  4'Kontraktsnr. :'
     A            H1TENR         6A  B  6 19TEXT('Terminkontrakstnummer')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A  50                                  ERRMSGID(RML0680 *LIBL/QMFOKON 50)
     A                                      CHECK(RB)
     A                                  7  4'Kontraktskurs:'
     A            H1TEKU         8Y 0B  7 19TEXT('Terminkontraktskurs')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTWRD('    .    ')
     A                                  9  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  9 18'F10=Endre alle'
     A                                      COLOR(BLU)
     A          R I1WIN
     A*%%TS  SD  20010725  104925  RHO         REL-V4R4M0  5769-PW1
     A                                      TEXT('Varsel ved åpning av et lukke-
     A                                      t forslag')
     A                                      CA03
     A                                      CA06
     A                                      WINDOW(&W_AROW &W_ACOL 9 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2 10'A D V A R S E L  !'
     A                                      COLOR(WHT)
     A                                  4  2'Utbetalingsforslaget er sperret!  -
     A                                       '
     A                                  5  2'Er du sikker på at forslaget skal -
     A                                        '
     A                                  6  2'åpnes?                            -
     A                                        '
     A                                  8  2'F3=Gå tilbake  F6=Åpne forslag    '
     A                                      COLOR(BLU)
     A          R V1WIN
     A*%%TS  SD  19950828  134726  RH1         REL-V3R1M0  5763-PW1
     A                                      TEXT('Registrering av kode for valu-
     A                                      takonto')
     A                                      CA03
     A                                      WINDOW(&W_AROW &W_ACOL 11 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A            V1FDAT    R        H      REFFLD(ROFDAT)
     A                                      TEXT('Forfallsdato')
     A                                  2  7'BETALING FRA VALUTAKONTO'
     A                                      COLOR(WHT)
     A            V1LEVR    R     Y  O  3 20REFFLD(ROLEVR)
     A                                      TEXT('Leverandørnummer')
     A                                      DSPATR(ND)
     A                                      EDTCDE(Z)
     A                                  4  2'Valutakode.:'
     A            V1FVAL    R        O  4 15REFFLD(ROVALK)
     A                                      TEXT('Valutakode ved avtalt kurs')
     A                                      COLOR(WHT)
     A                                  4 20'(Faktura)'
     A                                  5  2'Valutakode.:'
     A            V1VALK    R        O  5 15REFFLD(ROVALK)
     A                                      TEXT('Valutakode ved avtalt kurs')
     A                                      COLOR(WHT)
     A                                  5 20'(Betaling)'
     A                                  6  2'Leverandør.:'
     A            V1NAVN        22A  O  6 15TEXT('Leverandør')
     A                                      COLOR(WHT)
     A                                  7  2'Valutakonto:'
     A            V1VKTO        11Y 0O  7 15TEXT('Valutakonto')
     A                                      COLOR(WHT)
     A                                      EDTWRD('    .  .     ')
     A                                  8  2'Valg. . . .:'
     A            V1VALG         1A  B  8 15TEXT('Valg')
     A                                      COLOR(WHT)
     A                                      VALUES(' ' 'V')
     A  64                                  DSPATR(PC)
     A  64                                  ERRMSGID(RML0760 *LIBL/QMFOKON 64)
     A                                  8 18'(V=Valutakonto)'
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 10 17'Enter=Endre alle'
     A                                      COLOR(BLU)
     A          R W1WIN
     A*%%TS  SD  19950815  074900  RH1         REL-V3R1M0  5763-PW1
     A                                      TEXT('Varsel ved "mulig" feil i val-
     A                                      utabeløp')
     A                                      CA03
     A                                      WINDOW(&W_AROW &W_ACOL 12 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2 10'A D V A R S E L  !'
     A                                      COLOR(WHT)
     A                                  4  2'Beløp til utbet. omregnet til NOK'
     A                                  5  2'med dagens kurs, avviker med mer e-
     A                                      nn'
     A                                  6  2'2% sammenlignet med fakturabeløp.'
     A                                  8  2'Fakturabeløp:'
     A            W1BELØ    R        O  8 16REFFLD(ROBELØ)
     A                                      TEXT('Fakturabeløp i NOK')
     A                                      EDTCDE(K)
     A                                  8 32'NOK'
     A                                  9  2'Til utbet. .:'
     A            W1N112    R        O  9 16REFFLD(ROBELØ)
     A                                      TEXT('Omregnet NOK på utbetaling')
     A                                      EDTCDE(K)
     A                                  9 32'NOK'
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 11 17'Enter=Bekrefte beløp'
     A                                      COLOR(BLU)
     A          R X1WIN
     A*%%TS  SD  20030907  095456  KOB         REL-V5R2M0  5722-WDS
     A                                      WINDOW(&W_AROW &W_ACOL 13 46)
     A                                      TEXT('Velge rabatt')
     A                                      CA03
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2 13'R A B A T T B E L Ø P'
     A                                      COLOR(WHT)
     A                                  4  2'Velg og trykk Enter'
     A                                      COLOR(BLU)
     A                                  5  2'1=Velg rabatt'
     A                                      COLOR(BLU)
     A                                  7  2'V Rabattdato             NOK      -
     A                                          Valuta'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            X1VALG    R        B  8  2REFFLD(AAVALG)
     A                                      TEXT('rabattvalg')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1')
     A            C3RDA1         6Y 0O  8  4TEXT('Rabattdato-1')
     A                                      EDTWRD('  .  .  ')
     A            C3RUN1    R        O  8 15REFFLD(ROBELØ)
     A                                      TEXT('Rabattbeløp-1 NOK')
     A                                      EDTCDE(K)
     A            C3RUV1    R        O  8 31REFFLD(ROBELØ)
     A                                      TEXT('Rabattbeløp-1 NOK')
     A                                      EDTCDE(K)
     A            X2VALG    R        B  9  2REFFLD(AAVALG)
     A                                      TEXT('rabattvalg')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1')
     A            C3RDA2         6Y 0O  9  4TEXT('Rabattdato-1')
     A                                      EDTWRD('  .  .  ')
     A            C3RUN2    R        O  9 15REFFLD(ROBELØ)
     A                                      TEXT('Rabattbeløp-1 NOK')
     A                                      EDTCDE(K)
     A            C3RUV2    R        O  9 31REFFLD(ROBELØ)
     A                                      TEXT('Rabattbeløp-1 NOK')
     A                                      EDTCDE(K)
     A            X3VALG    R        B 10  2REFFLD(AAVALG)
     A                                      TEXT('rabattvalg')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1')
     A            C3RDA3         6Y 0O 10  4TEXT('Rabattdato-1')
     A                                      EDTWRD('  .  .  ')
     A            C3RUN3    R        O 10 15REFFLD(ROBELØ)
     A                                      TEXT('Rabattbeløp-1 NOK')
     A                                      EDTCDE(K)
     A            C3RUV3    R        O 10 31REFFLD(ROBELØ)
     A                                      TEXT('Rabattbeløp-1 NOK')
     A                                      EDTCDE(K)
     A                                 12  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R Y1WIN
     A*%%TS  SD  19980323  122426  RHO         REL-V3R7M0  5716-PW1
     A                                      TEXT('Slette forslaget')
     A                                      CA03
     A                                      CA06
     A                                      CF07
     A                                      WINDOW(&W_AROW &W_ACOL 17 46)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2 15' A D V A R S E L '
     A                                      DSPATR(RI)
     A                                  4  3'KODEN PÅ FORSLAGET INDIKERER AT DE-
     A                                      T ER '
     A                                      COLOR(RED)
     A                                  5  3'OVERFØRT BANKEN.  FEIL BRUK AV DEN-
     A                                      NE  '
     A                                      COLOR(RED)
     A                                  6  3'RUTINEN KAN MEDFØRE DOBBEL UTBETAL-
     A                                      ING.'
     A                                      COLOR(RED)
     A                                  8  2'F6=Slette forslag.  Postene vil bl-
     A                                      i tatt'
     A                                      COLOR(WHT)
     A                                  9  2'   med på nytt ved neste kjøring a-
     A                                      v et '
     A                                      COLOR(WHT)
     A                                 10  2'   utbetalingsforslag.            -
     A                                            '
     A                                      COLOR(WHT)
     A                                 12  2'F7=Slette forslag.  Postene vil IK-
     A                                      KE bli'
     A                                      COLOR(WHT)
     A                                 13  2'   tatt med ved kjøring av nytt ut-
     A                                      betalings-'
     A                                      COLOR(WHT)
     A                                 14  2'   forslag.                       -
     A                                                '
     A                                      COLOR(WHT)
     A                                 16  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME
     A*%%TS  SD  19941222  135431  RH          REL-V2R3M0  5738-PW1
     A                                      KEEP
     A                                      ASSUME
     A                                 24 79' '
