     A*%%TS  SD  20031106  230206  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASTELE
     A* Format. . . . . : GL100D
     A* Beskrivelse . . : Utplukk til utbetalingsforslag
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200103 KOB  Nytt program
     A*       110803 KOB  Endret pos. av cursor slik at den ligger på
     A*                   leverandørnummer fra
     A*       110803 KOB  Fjernet kode 'P' som valg på betalingskode
6.30 A*       040615 NHO  Gir varsel når antall linjer overstiges
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
7.xx A                                      DSPSIZ(24 80 *DS3 -
7.xx A                                             27 132 *WIDE)
7.xx A*                                     DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A          R A1BLD
     A*%%TS  SD  20031106  230206  KOB         REL-V5R2M0  5722-WDS
     A                                      TEXT('Parameterbilde')
     A                                      CA03
     A                                      CA05
     A                                      CA09
     A                                      PRINT
     A            C2STAT    R        H      REFFLD(RTSTAT)
     A            C2TELL    R        H      REFFLD(ROTIST)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utplukk til utbetalingsforslag'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6  2'Kjøredato. . . . . . . . . . . .'
     A            A1KJØR         6Y 0B  6 35TEXT('Kjøredato')
     A                                      DSPATR(UL)
     A  39                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A  39                                  ERRMSGID(RM02060 *LIBL/QMFOKON 39)
     A                                      EDTCDE(Y)
     A                                  8  2'Velg poster t.o.m. forfallsdato.'
     A            A1FORF         6Y 0B  8 35TEXT('Forfallsdato')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A  30                                  ERRMSGID(RM02050 *LIBL/QMFOKON 30)
     A                                      EDTCDE(Y)
     A  39                                  DSPATR(PC)
     A                                  8 45'(Blank=Alle poster)'
     A                                 10  2'Kun attesterte bilag skal med. .'
     A            A1ATTS         1Y 0B 10 35TEXT('Attesterte bilag')
     A                                      DSPATR(UL)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                 10 38'(1=Ja)'
     A                                 12  2'DIREM innmeldt bilag skal med. .'
     A            A1BETK         1Y 0B 12 35TEXT('Remiterte bilag')
     A                                      DSPATR(UL)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                 12 38'(1=Ja)'
     A                                 14  2'Spesiell rabattbehandling. . . .'
     A            A1RABA         1Y 0B 14 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                 14 38'(1=Ja)'
     A                                 16  2'Avregne kreditnotaer mot faktura'
     A            A1AVRE         1Y 0B 16 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2)
     A                                 16 38'(1=Mot enkeltfaktura, 2=Totalt)'
     A                                 18  2'Leverandørnummer . . . . . . . .'
     A  32                                  DSPATR(ND)
     A            A1LEVF    R     Y  B 18 35REFFLD(ROLEVR)
     A  33
     AO 34
     AO 36
     AO 38
     AO 31                                  DSPATR(PC)
     A                                      TEXT('Fra leverandørnummer')
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A  33                                  ERRMSGID(RML0240 *LIBL/QMFOKON 33)
     A  34                                  ERRMSGID(RML0260 *LIBL/QMFOKON 34)
     A  36                                  ERRMSGID(RML0280 *LIBL/QMFOKON 36)
     A  38                                  ERRMSGID(RML0300 *LIBL/QMFOKON 38)
     A                                      CHECK(RB)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                 18 42'-'
     A  32                                  DSPATR(ND)
     A            A1LEVT    R     Y  B 18 44REFFLD(ROLEVR)
     A                                      TEXT('Til leverandørnummer')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                 19  2'eller'
     A  31
     AO 32                                  DSPATR(ND)
     A                                 20  2'Leverandørkategori . . . . . . .'
     A  31                                  DSPATR(ND)
     A            A1KATF    R     Y  B 20 35REFFLD(RLKATG)
     A  35
     AO 37
     AO 32                                  DSPATR(PC)
     A  35                                  ERRMSGID(RML0270 *LIBL/QMFOKON 35)
     A  37                                  ERRMSGID(RML0290 *LIBL/QMFOKON 37)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  31                                  DSPATR(ND)
     A  31                                  DSPATR(PR)
     A                                 20 40'-'
     A  31                                  DSPATR(ND)
     A            A1KATT    R     Y  B 20 42REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  31                                  DSPATR(ND)
     A  31                                  DSPATR(PR)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F5=Forny'
     A                                      COLOR(BLU)
     A                                 23 27'F9=Vise intervaller'
     A                                      COLOR(BLU)
     A          R C1WIN
     A*%%TS  SD  19950815  141045  RH1         REL-V3R1M0  5763-PW1
     A                                      TEXT('Statuspost - Leverandørtransa-
     A                                      ksjoner')
     A                                      WINDOW(&W_AROW &W_ACOL 10 37 *NOMSG-
     A                                      LIN)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A                                  4  2'Utplukk til forslag'
     A                                      COLOR(WHT)
     A            WPBFNR    R        O  4 22REFFLD(ROBFNR)
     A                                      COLOR(WHT)
     A                                      DSPATR(HI)
     A                                      EDTCDE(3)
     A                                      DSPATR(UL)
     A                                  4 26'pågår...'
     A                                      COLOR(WHT)
     A                                  6  2'* Antall poster. .:'
     A                                      COLOR(WHT)
     A            C1ANTA         4S 0O  6 22TEXT('Antall genererte poster')
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            C1TXT1        33A  O  7  2COLOR(WHT)
     A            C1TXT2        33A  O  8  2COLOR(WHT)
     A            C1TXT3        33A  O  9  2COLOR(WHT)
     A          R C2WIN
     A*%%TS  SD  19950330  102657  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Statuspost - Ferdig')
     A                                      WINDOW(&W_AROW &W_ACOL 8 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
6.30 A*                                 2  2' Informasjon '
6.30 A*                                     DSPATR(RI)
     A                                  4  2'Utplukk til utbetalingsforslag er'
     A                                      COLOR(WHT)
     A                                  5  2'ferdig.  Antall poster:'
     A                                      COLOR(WHT)
     A            C1ANTA         4  0O  5 26TEXT('Antall genererte poster')
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
6.30 A  55                              2  2'NB! Antall linjer er oversteget.'
6.30 A                                      COLOR(RED)
6.30 A                                      DSPATR(BL)
     A                                  7  2'Trykk Enter for å avslutte.'
     A                                      COLOR(WHT)
     A          R C3WIN
     A*%%TS  SD  19950809  080910  RH1         REL-V3R1M0  5763-PW1
     A                                      TEXT('Advarsel')
     A                                      CA03
     A                                      WINDOW(&W_AROW &W_ACOL 10 37 *NOMSG-
     A                                      LIN)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Advarsel '
     A                                      DSPATR(RI)
     A                                  4  2'Det er i utplukket valgt å ta med'
     A                                      COLOR(WHT)
     A                                  5  2'poster som er overført tidligere.'
     A                                      COLOR(WHT)
     A                                  7  2'Trykk Enter for videre behandling.'
     A                                      COLOR(WHT)
     A                                  9  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C4WIN
     A*%%TS  SD  19950330  095729  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Statuspost - Lønn')
     A                                      WINDOW(&W_AROW &W_ACOL 8 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Lønnstransaksjoner '
     A                                      DSPATR(RI)
     A                                  4  2'Det er overført'
     A                                      COLOR(WHT)
     A            C4ANTA         3S 0O  4 18TEXT('Antall genererte poster')
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4 22'transaksjoner'
     A                                      COLOR(WHT)
     A                                  5  2'til utbetalingsforslag'
     A                                      COLOR(WHT)
     A            WPBFNR    R        O  5 25REFFLD(ROBFNR)
     A                                      COLOR(WHT)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      EDTWRD('   .')
     A                                  7  2'Trykk Enter for å avslutte.'
     A                                      COLOR(WHT)
     A          R C5WIN
     A*%%TS  SD  19950327  084843  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Informasjon - S/36 file finne-
     A                                      s ikke')
     A                                      CA03
     A                                      WINDOW(&W_AROW &W_ACOL 8 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A                                  4  2'Det finnes ikke lønnstransaksjoner'
     A                                      COLOR(WHT)
     A                                  5  2'for overføring.'
     A                                      COLOR(WHT)
     A                                  7  2'Trykk Enter for å avslutte.'
     A                                      COLOR(WHT)
     A          R A2WIN
     A*%%TS  SD  20030120  094853  KOB         REL-V5R1M0  5722-WDS
     A                                      TEXT('Windowversjon - leverandører')
     A                                      CA03
     A                                      PRINT
     A                                      WINDOW(&W_AROW &W_ACOL 20 68)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2'Valgte leverandører:'
     A                                      COLOR(WHT)
     A                                  4  2'   Fra -    Til     Fra -    Til  -
     A                                         Fra -    Til     Fra -    Til'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            B1LF01    R        O  5  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  5  9'-'
     A            B1LT01    R        O  5 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF14    R        O  5 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  5 26'-'
     A            B1LT14    R        O  5 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF27    R        O  5 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  5 43'-'
     A            B1LT27    R        O  5 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF40    R        O  5 53REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  5 60'-'
     A            B1LT40    R        O  5 62REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF02    R        O  6  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  6  9'-'
     A            B1LT02    R        O  6 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF15    R        O  6 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  6 26'-'
     A            B1LT15    R        O  6 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF28    R        O  6 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  6 43'-'
     A            B1LT28    R        O  6 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF41    R        O  6 53REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  6 60'-'
     A            B1LT41    R        O  6 62REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF03    R        O  7  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  7  9'-'
     A            B1LT03    R        O  7 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF16    R        O  7 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  7 26'-'
     A            B1LT16    R        O  7 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF29    R        O  7 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  7 43'-'
     A            B1LT29    R        O  7 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF42    R        O  7 53REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  7 60'-'
     A            B1LT42    R        O  7 62REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF04    R        O  8  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  8  9'-'
     A            B1LT04    R        O  8 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF17    R        O  8 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  8 26'-'
     A            B1LT17    R        O  8 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF30    R        O  8 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  8 43'-'
     A            B1LT30    R        O  8 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF43    R        O  8 53REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  8 60'-'
     A            B1LT43    R        O  8 62REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF05    R        O  9  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  9  9'-'
     A            B1LT05    R        O  9 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF18    R        O  9 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  9 26'-'
     A            B1LT18    R        O  9 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF31    R        O  9 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  9 43'-'
     A            B1LT31    R        O  9 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF44    R        O  9 53REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                  9 60'-'
     A            B1LT44    R        O  9 62REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF06    R        O 10  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 10  9'-'
     A            B1LT06    R        O 10 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF19    R        O 10 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 10 26'-'
     A            B1LT19    R        O 10 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF32    R        O 10 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 10 43'-'
     A            B1LT32    R        O 10 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF45    R        O 10 53REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 10 60'-'
     A            B1LT45    R        O 10 62REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF07    R        O 11  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 11  9'-'
     A            B1LT07    R        O 11 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF20    R        O 11 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 11 26'-'
     A            B1LT20    R        O 11 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF33    R        O 11 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 11 43'-'
     A            B1LT33    R        O 11 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF46    R        O 11 53REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 11 60'-'
     A            B1LT46    R        O 11 62REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF08    R        O 12  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 12  9'-'
     A            B1LT08    R        O 12 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF21    R        O 12 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 12 26'-'
     A            B1LT21    R        O 12 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF34    R        O 12 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 12 43'-'
     A            B1LT34    R        O 12 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF47    R        O 12 53REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 12 60'-'
     A            B1LT47    R        O 12 62REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF09    R        O 13  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 13  9'-'
     A            B1LT09    R        O 13 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF22    R        O 13 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 13 26'-'
     A            B1LT22    R        O 13 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF35    R        O 13 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 13 43'-'
     A            B1LT35    R        O 13 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF48    R        O 13 53REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 13 60'-'
     A            B1LT48    R        O 13 62REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF10    R        O 14  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 14  9'-'
     A            B1LT10    R        O 14 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF23    R        O 14 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 14 26'-'
     A            B1LT23    R        O 14 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF36    R        O 14 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 14 43'-'
     A            B1LT36    R        O 14 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF49    R        O 14 53REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 14 60'-'
     A            B1LT49    R        O 14 62REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF11    R        O 15  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 15  9'-'
     A            B1LT11    R        O 15 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF24    R        O 15 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 15 26'-'
     A            B1LT24    R        O 15 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF37    R        O 15 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 15 43'-'
     A            B1LT37    R        O 15 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF50    R        O 15 53REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 15 60'-'
     A            B1LT50    R        O 15 62REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF12    R        O 16  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 16  9'-'
     A            B1LT12    R        O 16 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF25    R        O 16 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 16 26'-'
     A            B1LT25    R        O 16 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF38    R        O 16 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 16 43'-'
     A            B1LT38    R        O 16 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF13    R        O 17  2REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 17  9'-'
     A            B1LT13    R        O 17 11REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF26    R        O 17 19REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 17 26'-'
     A            B1LT26    R        O 17 28REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A            B1LF39    R        O 17 36REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                 17 43'-'
     A            B1LT39    R        O 17 45REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Leverandørnummer')
     A                                      COLOR(YLW)
     A                                 19  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R A3WIN
     A*%%TS  SD  20030120  094853  KOB         REL-V5R1M0  5722-WDS
     A                                      TEXT('Windowversjon - kategorier')
     A                                      CA03
     A                                      PRINT
     A                                      WINDOW(&W_AROW &W_ACOL 20 41 *NOMSG-
     A                                      LIN)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2'Valgte leverandørkategorier:'
     A                                      COLOR(WHT)
     A                                  4  2'Fra - Til Fra - Til Fra - Til Fra -
     A                                      - Til'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            B2KF01    R        O  5  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 5  6'-'
     A            B2KT01    R        O  5  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF14    R        O  5 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 5 16'-'
     A            B2KT14    R        O  5 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF27    R        O  5 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 5 26'-'
     A            B2KT27    R        O  5 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF40    R        O  5 33REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*
     A            B2KT40    R        O  5 38REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF02    R        O  6  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 6  6'-'
     A            B2KT02    R        O  6  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF15    R        O  6 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 6 16'-'
     A            B2KT15    R        O  6 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF28    R        O  6 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 6 26'-'
     A            B2KT28    R        O  6 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF41    R        O  6 33REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 6 36'-'
     A            B2KT41    R        O  6 38REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF03    R        O  7  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 7  6'-'
     A            B2KT03    R        O  7  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF16    R        O  7 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 7 16'-'
     A            B2KT16    R        O  7 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF29    R        O  7 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 7 26'-'
     A            B2KT29    R        O  7 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF42    R        O  7 33REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 7 36'-'
     A            B2KT42    R        O  7 38REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF04    R        O  8  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 8  6'-'
     A            B2KT04    R        O  8  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF17    R        O  8 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 8 16'-'
     A            B2KT17    R        O  8 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF30    R        O  8 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 8 26'-'
     A            B2KT30    R        O  8 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF43    R        O  8 33REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 8 36'-'
     A            B2KT43    R        O  8 38REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF05    R        O  9  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 9  6'-'
     A            B2KT05    R        O  9  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF18    R        O  9 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 9 16'-'
     A            B2KT18    R        O  9 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF31    R        O  9 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 9 26'-'
     A            B2KT31    R        O  9 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF44    R        O  9 33REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                 9 36'-'
     A            B2KT44    R        O  9 38REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF06    R        O 10  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                10  6'-'
     A            B2KT06    R        O 10  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF19    R        O 10 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                10 16'-'
     A            B2KT19    R        O 10 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF32    R        O 10 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                10 26'-'
     A            B2KT32    R        O 10 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF45    R        O 10 33REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                10 36'-'
     A            B2KT45    R        O 10 38REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF07    R        O 11  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                11  6'-'
     A            B2KT07    R        O 11  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF20    R        O 11 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                11 16'-'
     A            B2KT20    R        O 11 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF33    R        O 11 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                11 26'-'
     A            B2KT33    R        O 11 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF46    R        O 11 33REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*
     A            B2KT46    R        O 11 38REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF08    R        O 12  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                12  6'-'
     A            B2KT08    R        O 12  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF21    R        O 12 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                12 16'-'
     A            B2KT21    R        O 12 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF34    R        O 12 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                12 26'-'
     A            B2KT34    R        O 12 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF47    R        O 12 33REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                12 36'-'
     A            B2KT47    R        O 12 38REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF09    R        O 13  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                13  6'-'
     A            B2KT09    R        O 13  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF22    R        O 13 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                13 16'-'
     A            B2KT22    R        O 13 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF35    R        O 13 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                13 26'-'
     A            B2KT35    R        O 13 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF48    R        O 13 33REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                13 36'-'
     A            B2KT48    R        O 13 38REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF10    R        O 14  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A*                                     TEXT('Kategorinummer..')
     A*                                14  6'-'
     A            B2KT10    R        O 14  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF23    R        O 14 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                14 16'-'
     A            B2KT23    R        O 14 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF36    R        O 14 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                14 26'-'
     A            B2KT36    R        O 14 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF49    R        O 14 33REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                14 36'-'
     A            B2KT49    R        O 14 38REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF11    R        O 15  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                15  6'-'
     A            B2KT11    R        O 15  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF24    R        O 15 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                15 16'-'
     A            B2KT24    R        O 15 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF37    R        O 15 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                15 26'-'
     A            B2KT37    R        O 15 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF50    R        O 15 33REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                15 36'-'
     A            B2KT50    R        O 15 38REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF12    R        O 16  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                16  6'-'
     A            B2KT12    R        O 16  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF25    R        O 16 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                16 16'-'
     A            B2KT25    R        O 16 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF38    R        O 16 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                16 26'-'
     A            B2KT38    R        O 16 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF13    R        O 17  3REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                17  6'-'
     A            B2KT13    R        O 17  8REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF26    R        O 17 13REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                17 16'-'
     A            B2KT26    R        O 17 18REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A            B2KF39    R        O 17 23REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A*                                17 26'-'
     A            B2KT39    R        O 17 28REFFLD(RLKATG)
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A                                      TEXT('Kategorinummer..')
     A                                      COLOR(YLW)
     A                                 19  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
