     A*%%TS  SD  20030120  122815  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASTELE
     A* Format. . . . . : GL119D
     A* Beskrivelse . . : Overføring fra samlefil
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200103 KOB  Nytt program
Q.01 A*     MST  230821    Utvidet skjerm
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
Q.01 A                                      DSPSIZ(24 80 *DS3 -
Q.01 A                                             27 132 *WIDE)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
     A                                          '))
     A          R A1WIN
     A*%%TS  SD  19950809  091455  RH1         REL-V3R1M0  5763-PW1
     A                                      TEXT('Trykk Enter for å starte')
     A                                      CA03
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 5 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2'Trykk Enter for å starte rutinen.'
     A                                  4  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1WIN
     A*%%TS  SD  19950209  155759  RH          REL-V2R3M0  5738-PW1
     A                                      TEXT('ICF-kommunikasjon starter opp-
     A                                      .')
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 5 37)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  3'Oppkobling via ICF-kommunikasjon'
     A                                  3  3'pågår...'
     A          R ASUME
     A*%%TS  SD  19941223  114838  RH          REL-V2R3M0  5738-PW1
     A                                      KEEP
     A                                      ASSUME
     A                                 24 79' '
