     A*%%TS  SD  20030120  114128  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASTELE
     A* Format. . . . . : GL115D
     A* Beskrivelse . . : Kvittering ved returer
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200103 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
     A                                          '))
     A          R C1WIN
     A*%%TS  SD  19950207  110508  RH          REL-V2R3M0  5738-PW1
     A                                      WINDOW(S1WIN)
     A                                      TEXT('1.gangs retur - innland')
     A                                      KEEP
     A                                  2  7'1. GANGS RETUR - INNLAND.'
     A                                      COLOR(WHT)
     A                                  4  4'Kvitteringsliste skrives ut...'
     A          R C2WIN
     A*%%TS  SD  19950207  110508  RH          REL-V2R3M0  5738-PW1
     A                                      WINDOW(S1WIN)
     A                                      TEXT('1.gangs retur - utland')
     A                                      KEEP
     A                                  2  8'1. GANGS RETUR - UTLAND'
     A                                      COLOR(WHT)
     A                                  4  4'Kvitteringsliste skrives ut...'
     A          R C3WIN
     A*%%TS  SD  19950207  110508  RH          REL-V2R3M0  5738-PW1
     A                                      WINDOW(S1WIN)
     A                                      TEXT('2.gangs retur - innland')
     A                                      KEEP
     A                                  2  7'2. GANGS RETUR - INNLAND'
     A                                      COLOR(WHT)
     A                                  4  4'Kvitteringsliste skrives ut...'
     A          R C4WIN
     A*%%TS  SD  19950207  110508  RH          REL-V2R3M0  5738-PW1
     A                                      WINDOW(S1WIN)
     A                                      TEXT('2.gangs retur - utland')
     A                                      KEEP
     A                                  2  7'2. GANGS RETUR - UTLAND'
     A                                      COLOR(WHT)
     A                                  4  4'Kvitteringsliste skrives ut...'
     A          R C5WIN
     A*%%TS  SD  19950207  110508  RH          REL-V2R3M0  5738-PW1
     A                                      WINDOW(S1WIN)
     A                                      TEXT('Feilretur')
     A                                      KEEP
     A                                  2 14'FEILRETUR.'
     A                                      COLOR(WHT)
     A                                  4  4'Utskrift av feilretur pågår...'
     A          R C6WIN
     A*%%TS  SD  19950301  131329  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Rutinen avsluttes..')
     A                                      KEEP
     A                                      WINDOW(S1WIN)
     A                                  2  2'KVITTERINGSLISTER ER NÅ SKREVET UT-
     A                                      .'
     A                                      COLOR(WHT)
     A                                  4  2'Rutinen avsluttes...'
     A          R C7WIN
     A*%%TS  SD  19950207  110508  RH          REL-V2R3M0  5738-PW1
     A                                      WINDOW(S1WIN)
     A                                      TEXT('Ferdig!')
     A                                      KEEP
     A                                  2  2'RETURBEHANDLING TELEGIRO ER FERDIG-
     A                                      .'
     A                                      COLOR(WHT)
     A                                  4  2'Trykk Enter for å avslutte.'
     A          R C8WIN
     A*%%TS  SD  19950310  132153  RH1         REL-V2R3M0  5738-PW1
     A                                      WINDOW(S1WIN)
     A                                      TEXT('Oppdatering av regnskap')
     A                                      KEEP
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A                                  4  2'Kvitteringslister er skrevet ut.'
     A                                      COLOR(WHT)
     A          R S1WIN
     A*%%TS  SD  19950207  110508  RH          REL-V2R3M0  5738-PW1
     A                                      TEXT('Ramme')
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 6 37 *NOMSGL-
     A                                      IN)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A          R ASUME
     A*%%TS  SD  19941223  114838  RH          REL-V2R3M0  5738-PW1
     A                                      KEEP
     A                                      ASSUME
     A                                 24 79' '
