     A*%%TS  SD  20030120  124742  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASTELE
     A* Format. . . . . : GL124D
     A* Beskrivelse . . : Melding/kontrollprogram
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200103 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
     A                                          '))
     A          R A1WIN
     A*%%TS  SD  19950825  101812  RH1         REL-V3R1M0  5763-PW1
     A                                      TEXT('Trykk Enter for å starte')
     A                                      CA03
     A                                      CA09
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 12 39)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Innlesing av OCR-diskett '
     A                                      DSPATR(RI)
     A                                  4  2'Sett inn diskett i diskettstasjone-
     A                                      n,'
     A                                      COLOR(WHT)
     A                                  5  2'og trykk Enter.'
     A                                      COLOR(WHT)
     A                                  7  2'F9 velges for å overføre avtaler s-
     A                                      om'
     A                                      COLOR(WHT)
     A                                  8  2'tidligere er avvist p.g.a. feil i -
     A                                        '
     A                                      COLOR(WHT)
     A                                  9  2'avtaleregisteret.                 -
     A                                        '
     A                                      COLOR(WHT)
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 11 17'F9=Overføring u/diskett'
     A                                      COLOR(BLU)
     A          R A2WIN
     A*%%TS  SD  19950331  091832  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Flere disketter?')
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 6 39)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2'Skal det leses inn flere disketter-
     A                                       ?'
     A            A2VALG         1Y 0B  4 11TEXT('Valg')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4 14'(1=Ja, 0=Nei)'
     A          R A3WIN
     A*%%TS  SD  19950331  091832  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Innlesing pågår')
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 6 39)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A                                  4  2'Innlesing av OCR-returer fra'
     A                                      COLOR(WHT)
     A                                  5  2'diskett pågår...'
     A                                      COLOR(WHT)
     A          R A4WIN
     A*%%TS  SD  19950809  092304  RH1         REL-V3R1M0  5763-PW1
     A                                      TEXT('Feil diskett!')
     A                                      CA03
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 8 39)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Feil diskett ! '
     A                                      DSPATR(RI)
     A                                  4  2'Diskett inneholder ikke OCR-reture-
     A                                      r.'
     A                                      COLOR(WHT)
     A                                  5  2'Skift diskett, og trykk Enter.'
     A                                      COLOR(WHT)
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R A5WIN
     A*%%TS  SD  19950331  091832  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Rutinen er allerede aktiv - g-
     A                                      enerell')
     A                                      CA03
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 8 39)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A                                  4  2'Rutinen er allerede i bruk fra en'
     A                                      COLOR(WHT)
     A                                  5  2'annen jobb, og kan bare brukes av'
     A                                      COLOR(WHT)
     A                                  6  2'en jobb om gangen.  Trykk Enter.'
     A                                      COLOR(WHT)
     A          R A6WIN
     A*%%TS  SD  20000623  102220  RHO         REL-V4R4M0  5769-PW1
     A                                      TEXT('Rutinen er allerede aktiv - o-
     A                                      verføring til DIRREM')
     A                                      CA03
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 8 39)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A                                  4  2'Rutinen for oppkobling mot banken -
     A                                       '
     A                                      COLOR(WHT)
     A                                  5  2'er allerede aktiv.   Trykk Enter  -
     A                                        '
     A                                      COLOR(WHT)
     A          R A7WIN
     A*%%TS  SD  19950331  091832  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Rutinen for å hente er aktiv.-
     A                                      ..')
     A                                      CA03
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 8 39)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A                                  4  2'Rutinen for å hente returdata kan'
     A                                      COLOR(WHT)
     A                                  5  2'ikke være aktiv når denne jobben'
     A                                      COLOR(WHT)
     A                                  6  2'kjøres.  Trykk Enter.           '
     A                                      COLOR(WHT)
     A          R A8WIN
     A*%%TS  SD  19950331  091832  RH1         REL-V2R3M0  5738-PW1
     A                                      TEXT('Rutinen for innlesing av disk-
     A                                      ett er aktiv')
     A                                      CA03
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 8 39)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A                                  4  2'Rutinen for å lese inn OCR-diskett'
     A                                      COLOR(WHT)
     A                                  5  2'ikke være aktiv når denne jobben'
     A                                      COLOR(WHT)
     A                                  6  2'kjøres.  Trykk Enter.           '
     A                                      COLOR(WHT)
     A          R ASUME
     A*%%TS  SD  19941223  114838  RH          REL-V2R3M0  5738-PW1
     A                                      KEEP
     A                                      ASSUME
     A                                 24 79' '
