     A*%%TS  SD  19950210  122707  AS          REL-V2R3M0  5738-PW1
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASTELE
     A* Format. . . . . : GL204D
     A* Beskrivelse . . : Melding om splitting av returer
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200103 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R A1WIN
     A*%%TS  SD  19950210  122707  AS          REL-V2R3M0  5738-PW1
     A                                      PUTOVR
     A                                      WINDOW(8 31 8 40 *NOMSGLIN)
     A                                  1  1'Mottak av returer:'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  3  1'Antall poster OCR             :'
     A                                  5  1'Antall poster telebank        :'
     A                                  7  1'Antall poster kontoinformasjon:'
     A            A1TELL1        5  0O  3 33DSPATR(HI)
     A            A1TELL2        5  0O  5 33DSPATR(HI)
     A            A1TELL3        5  0O  7 33DSPATR(HI)
     A          R ASUME                     ASSUME
     A                                 24 79' '
