     A*%%TS  SD  20051013  141137  RHO540      REL-V5R3M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASTELE
     A* Format. . . . . : GL118D
     A* Beskrivelse . . : Oppdatering av returdata
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R E1WIN
     A*%%TS  SD  20051013  141137  RHO540      REL-V5R3M0  5722-WDS
     A                                      TEXT('Advarselsbilde')
     A                                      CA03
     A                                      WINDOW(&W_AROW &W_ACOL 17 41)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2'ADVARSEL OM DOBBEL RETUR:'
     A                                      COLOR(RED)
     A                                      DSPATR(UL)
     A                                  4  2'Flg. retur er mottatt tidligere:'
     A                                      COLOR(WHT)
     A                                  6  2'Løpenummer-TF2:'
     A            E1LØPN    R        O  6 18REFFLD(GBLØPN)
     A                                      DSPATR(UL)
     A                                      TEXT('Løpenummer')
     A                                      EDTCDE(Z)
     A                                  7  2'Forslagsnr    :'
     A            E1FORS    R        O  7 18REFFLD(ROBFNR)
     A                                      DSPATR(UL)
     A                                      TEXT('Forslagsnummer')
     A                                  8  2'Linjenr       :'
     A            E1LINJ    R        O  8 18REFFLD(ROBFLI)
     A                                      DSPATR(UL)
     A                                      TEXT('Linjenummer')
     A                                  9  2'Leverandørnr  :'
     A            E1LEVR    R        O  9 18REFFLD(ROLEVR)
     A                                      DSPATR(UL)
     A                                      TEXT('Leverandørnummer')
     A                                 10  2'Leverandørnavn:'
     A            E1LEVA        15A  O 10 18DSPATR(UL)
     A                                      TEXT('Leverandørnavn')
     A                                 11  2'Beløp         :'
     A            E1BELP    R        O 11 18REFFLD(ROBELØ)
     A                                      DSPATR(UL)
     A                                      TEXT('Leverandørnummer')
     A                                      EDTCDE(J)
     A                                 13  1'Skriv ut skjermbildet!'
     A                                      COLOR(GRN)
     A                                      DSPATR(UL)
     A                                 13 25'Etter at rutinen'
     A                                      COLOR(GRN)
     A                                 14  1'er ferdig må du velge JUSTERING fo-
     A                                      r å   '
     A                                      COLOR(GRN)
     A                                 15  1'kontrollere at post ikke blir tatt-
     A                                       med. '
     A                                      COLOR(GRN)
     A                                 16  1'Trykk Enter/OK'
     A                                      COLOR(GRN)
     A          R ASUME                     ASSUME
     A                                 24 79' '
