     A*%%TS  SD  20030120  130717  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASTELE
     A* Format. . . . . : GL230D
     A* Beskrivelse . . : Konvertering GATRPF/GBTRPF til sonekontonr.
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200103 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
     A                                          '))
     A          R A1WIN
     A*%%TS  SD  20010131  115854  ASP         REL-V4R4M0  5769-PW1
     A                                      TEXT('Innlesing pågår')
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 7 39)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A                                  4  2'Konvertering av returfil (GATRPF)'
     A                                      COLOR(WHT)
     A                                  5  2'pågår...'
     A                                      COLOR(WHT)
     A                                  5 13'Antall lest:'
     A            A1ATRL         9  0O  5 26DSPATR(HI)
     A                                      COLOR(RED)
     A                                  6 13'Antall oppd:'
     A            A1ATRO         9  0O  6 26DSPATR(HI)
     A                                      COLOR(RED)
     A          R A2WIN
     A*%%TS  SD  20010131  115854  ASP         REL-V4R4M0  5769-PW1
     A                                      TEXT('Innlesing pågår')
     A                                      KEEP
     A                                      WINDOW(&W_AROW &W_ACOL 7 39)
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A                                  4  2'Konvertering av backupfilen (GBTRP-
     A                                      F)'
     A                                      COLOR(WHT)
     A                                  5  2'pågår...'
     A                                      COLOR(WHT)
     A                                  5 13'Antall lest:'
     A            A2ATRL         9  0O  5 26DSPATR(HI)
     A                                      COLOR(RED)
     A                                  6 13'Antall oppd:'
     A            A2ATRO         9  0O  6 26DSPATR(HI)
     A                                      COLOR(RED)
     A          R ASUME
     A*%%TS  SD  19941223  114838  RH          REL-V2R3M0  5738-PW1
     A                                      KEEP
     A                                      ASSUME
     A                                 24 79' '
