     A*%%TS  SD  20050609  154809  RHO530      REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASTELE
     A* Format. . . . . : GL321D
     A* Beskrivelse . . : Utplukk til utbetalingsforslag
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200103 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '        '))
     A          R A1WIN
     A*%%TS  SD  20050609  154809  RHO530      REL-V5R2M0  5722-WDS
     A                                      WINDOW(&W_AROW &W_ACOL 17 60)
     A                                      TEXT('Windowsversjon')
     A                                      CA03
     A                                      CA11
     A                                      PRINT
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2 14' NAVN PÅ BANKFILER '
     A                                      COLOR(WHT)
     A                                      DSPATR(RI)
     A                                  5  2'Forsendelse:'
     A                                      DSPATR(UL)
     A                                  6  2'Remitteringsfil . . .:'
     A            A1FREM        20A  B  6 25TEXT('Remitteringsfil')
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A  30                                  ERRMSGID(DM00180 *LIBL/QMFBANK 30)
     A                                  8  2'Retur:'
     A                                      DSPATR(UL)
     A                                 10  2'Mottaksretur. . . . .:'
     A            A1FMOT        20A  B 10 25TEXT('Mottaksretur')
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A  30                                  ERRMSGID(DM00180 *LIBL/QMFBANK 30)
     A                                 11  2'Avregningsretur . . .:'
     A            A1FAVR        20A  B 11 25TEXT('Avregningsretur')
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A  30                                  ERRMSGID(DM00180 *LIBL/QMFBANK 30)
     A                                 12  2'OCR-retur . . . . . .:'
     A            A1FOCR        20A  B 12 25TEXT('OCR-retur')
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A  30                                  ERRMSGID(DM00180 *LIBL/QMFBANK 30)
     A                                 13  2'Kontoinformasjon. . .:'
     A            A1FKTO        20A  B 13 25TEXT('Kontoinformasjon')
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A  30                                  ERRMSGID(DM00180 *LIBL/QMFBANK 30)
     A                                 14  2'Inkassoretur. . . . .:'
     A            A1FINK        20A  B 14 25TEXT('Inkassoretur')
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A  30                                  ERRMSGID(DM00180 *LIBL/QMFBANK 30)
     A                                 16  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  9  2'Feilretur . . . . . .:'
     A            A1FTFF        20A  B  9 25TEXT('Inkassoretur')
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A  30                                  ERRMSGID(DM00180 *LIBL/QMFBANK 30)
     A          R ASUME                     ASSUME
     A                                 24 79' '
