     A*%%TS  SD  20030120  092738  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASTELE
     A* Format. . . . . : GL700D
     A* Beskrivelse . . : Overføring av banktranser ICF
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200103 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R A1BLD
     A*%%TS  SD  20030120  092738  KOB         REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CA05
     A                                      CA06
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Overføring av transaksjoner til ba-
     A                                      nk'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  6'Konto    :'
     A            A1SACC         8A  B  5 18COLOR(YLW)
     A  31                                  ERRMSGID(BIE0001 *LIBL/QMFRREM 31)
     A  34                                  ERRMSGID(BIE0004 *LIBL/QMFRREM 34)
     A                                      DSPATR(PC)
     A                                  7  6'Brukerid :'
     A            A1SUID         8A  B  7 18COLOR(YLW)
     A  32                                  ERRMSGID(BIE0002 *LIBL/QMFRREM 32)
     A                                  9  6'Passord  :'
     A            A1SPWD         8A  B  9 18DSPATR(ND)
     A                                      DSPATR(PC)
     A  33                                  ERRMSGID(BIE0003 *LIBL/QMFRREM 33)
     A                                 12  6'Melding  :'
     A            A1SMSG         8A  B 12 18COLOR(YLW)
     A  35                                  ERRMSGID(BIE0005 *LIBL/QMFRREM 35)
     A                                 14  6'Partner'
     A                                 14 15':'
     A            A1PART         3A  B 14 18COLOR(YLW)
     A  36                                  ERRMSGID(BIE0006 *LIBL/QMFRREM 36)
     A                                 23  6'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                 23 18'F5=Datamottaker'
     A                                      COLOR(BLU)
     A                                 23 35'F6=FMS-record (NIT)'
     A                                      COLOR(BLU)
     A          R A2WIN
     A*%%TS  SD  20030120  092738  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(6 35 10 30 *NOMSGLIN)
     A                                      CA12
     A                                      PUTOVR
     A                                  9  3'F12=Annuller'
     A                                      COLOR(BLU)
     A                                  2  4'Datamottaker'
     A                                      DSPATR(RI)
     A                                  5  3'Konto   :'
     A                                  7  3'Brukerid:'
     A            A2MACC         8A  B  5 14COLOR(YLW)
     A            A2MUID         8A  B  7 14COLOR(YLW)
     A          R A3WIN
     A*%%TS  SD  20030120  092738  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(6 30 9 45 *NOMSGLIN)
     A                                      CA12
     A                                  8  3'F12=Annuller'
     A                                      COLOR(BLU)
     A                                  2  4'FMS-record brukes mot NIT'
     A                                      DSPATR(RI)
     A            A3NIT1        40A  B  5  3
     A            A3NIT2        40A  B  6  3
     A          R A4WIN
     A*%%TS  SD  19941027  094957  AS          REL-V2R3M0  5738-PW1
     A                                      WINDOW(6 35 5 28 *NOMSGLIN)
     A                                  2  3'Klargjør for oppkobling'
     A                                      COLOR(RED)
     A                                  4  9'mot bank.'
     A                                      COLOR(RED)
