     A*%%TS  SD  20030120  094237  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASTELE
     A* Format. . . . . : GL703D
     A* Beskrivelse . . : Melding om henting av banktranser ICF
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200103 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R A1WIN
     A*%%TS  SD  19950222  135224  RH1         REL-V2R3M0  5738-PW1
     A                                      KEEP
     A                                      PUTOVR
     A                                      WINDOW(6 35 8 40 *NOMSGLIN)
     A            A1MSG1        38A  O  2  1OVRDTA
     A            A1MSG2        38A  O  3  1OVRDTA
     A            A1MSG3        21A  O  4  1OVRDTA
     A            A1MSG4        38A  O  5  1OVRDTA
     A            A1TELL         6Y 0O  4 23COLOR(WHT)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                  1  1'Overføringsstatus:'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            A1FEIT         5A  O  6  1COLOR(RED)
     A                                      OVRDTA
     A            A1FEIM        38A  O  7  1COLOR(RED)
     A                                      OVRDTA
     A          R ASUME                     ASSUME
     A                                 24 79' '
     A          R A2WIN
     A*%%TS  SD  19950221  112558  AS          REL-V2R3M0  5738-PW1
     A                                      WINDOW(7 30 8 40)
     A                                  2  2'P A S S O R D  -  F E I L !'
     A                                      COLOR(RED)
     A                                  4  2'Angi passord:'
     A            A2NYPW         8A  B  4 16DSPATR(ND)
     A            A2MSG1        38A  B  6  2DSPATR(PR)
     A            A2MSG2        38A  B  7  2DSPATR(PR)
