     A*%%TS  SD  20031020  230354  ASK         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(16)
     A*         R A1ERR
     A          R A1INF
     A*%%TS  SD  20001110  091937  HKO         REL-V4R4M0  5769-PW1
     A                                  1  2'ASP RADIOTERMINAL'
     A                                  4  1'Velkommen til ASP'
     A                                  5  1'radioterminal-'
     A                                  6  1'løsning'
     A          R A1MNU
     A*%%TS  SD  20031020  230354  ASK         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA05
     A                                  1  2'ASP RADIOTERMINAL'
     A            A1FNAV        20A  O  3  1DSPATR(UL)
     A                                  5  3'1.Ekspedisjon'
     A                                  6  3'2.Pris/etikett'
     A                                  7  3'3.Bestilling'
     A                                  8  3'4.Plukkliste'
     A                                  9  3'5.Lagertelling'
     A                                 10  3'6.Varemottak'
     A                                 11  3'7.Lokasjonsreg.'
     A                                 13  2'90.Avslutt'
     A                                 15  5'Valg:'
     A            VALG           2Y 0B 15 11EDTCDE(Z)
     A                                      DSPATR(UL)
     A****                                  CHECK(ER)
     A          R A1ERR
     A*%%TS  SD  20001110  091937  HKO         REL-V4R4M0  5769-PW1
     A                                  3  2'********************'
     A                                  4  2'*  Funksjon ikke   *'
     A                                  5  2'*    fullført!     *'
     A                                  6  2'*.Kontakt ASP a.s  *'
     A                                  7  2'********************'
