     A*%%TS  SD  20080828  123608  ASP         REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      MSGLOC(16)
     A          R B1BLD
     A*%%TS  SD  20080828  123608  ASP         REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  1  2' EKSPEDISJON '
     A                                      DSPATR(RI)
     A                                  3  2'Kunde:'
     A            B1KUND         6Y 0B  3  9COLOR(YLW)
     A  31                                  ERRMSGID(HMR0100 *LIBL/QMFLAGR 31)
     A  32                                  ERRMSGID(HMR0110 *LIBL/QMFLAGR 32)
6.11 A  34                                  ERRMSGID(HMR0330 *LIBL/QMFLAGR 34)
     A                                      EDTCDE(Z)
     A                                  4  2'Prosj:'
     A            B1KPRO         6Y 0B  4  9COLOR(YLW)
     A  33                                  ERRMSGID(HMR0115 *LIBL/QMFLAGR 33)
     A                                      EDTCDE(Z)
     A            B1KNA1        19A  O  6  2COLOR(YLW)
     A            B1KNA2        11A  O  7  2COLOR(YLW)
     A            B1PNA1        19A  O  8  2COLOR(YLW)
     A            B1PNA2        11A  O  9  2COLOR(YLW)
     A            B1KRSP        19A  O 10  2COLOR(RED)
     A  70                                  DSPATR(RI)
     A            B1SAV1        19A  O 11  2COLOR(RED)
     A  71                                  DSPATR(RI)
     A            B1SAV2        19A  O 12  2COLOR(RED)
     A  71                                  DSPATR(RI)
     A            B1SAV3        19A  O 13  2COLOR(RED)
     A  71                                  DSPATR(RI)
     A                                 15  2'F4=Søk'
     A                                      COLOR(WHT)
     A          R B2BLD
     A*%%TS  SD  20080828  123608  ASP         REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                  1  2' EKSPEDISJON '
     A                                      DSPATR(RI)
     A                                  3  2'Kunde:'
     A            B2KUND         6Y 0B  3  9COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  4  2'Prosj:'
     A            B2KPRO         6Y 0B  4  9COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  6  2'Grense for alm.rab. '
     A                                      COLOR(RED)
     A                                  7  2'er overskredet. . . '
     A                                      COLOR(RED)
     A                                  8  2'Fortsette ? '
     A                                      COLOR(RED)
     A            B2FORT         1Y 0B  8 16COLOR(YLW)
     A                                      DSPATR(PC)
     A                                  9 16'1, Ja'
     A                                 10 16'0, Nei'
     A                                 15  2'F4=Søk'
     A                                      COLOR(WHT)
