     A*%%TS  SD  20080323  134907  KOB560      REL-V5R4M0  5722-WDS
     A*
     A* 280814 BOF : Ny melding for sperret og passivisert
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      MSGLOC(16)
     A          R B1BLD
     A*%%TS  SD  20080323  134907  KOB560      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  1  2' BESTILLING '
     A                                      DSPATR(RI)
     A                                  3  2'Ordre-type:'
     A            B1OTYP    R        B  3 14REFFLD(LOOTYP)
     A  31                                  ERRMSGID(LSO0010 *LIBL/QMFLAGR 31)
     A  37                                  ERRMSGID(LM00300 *LIBL/QMFLAGR 37)
     A                                      COLOR(YLW)
     A                                  4  2'Leverandør:'
     A            B1LDOR    R        B  4 14REFFLD(LOLDOR)
     A  32                                  ERRMSGID(LSO0080 *LIBL/QMFLAGR 32)
     A  40                                  ERRMSGID(HMR0370 *LIBL/QMFLAGR 40)
     A                                      COLOR(YLW)
     A                                      DSPATR(PC)
     A            B1LNAV        19A  O  5  2
     A                                  6  2'Lager:'
     A            B1LAGE    R        B  6  9REFFLD(LOLAGE)
     A  33                                  ERRMSGID(HMR0250 *LIBL/QMFLAGR 33)
     A                                      COLOR(YLW)
     A            B1LTXT        19A  O  7  2
     A                                  8  2'Avd .:'
     A            B1AVDE    R        B  8  9REFFLD(LOAVDE)
     A  38                                  ERRMSGID(HMR0230 *LIBL/QMFLAGR 38)
     A                                      COLOR(YLW)
     A            B1ATXT        19A  O  9  2
     A                                 10  2'Selger:'
     A            B1SELG    R        B 10 10REFFLD(LOINNK)
     A                                      COLOR(YLW)
     A            B1STXT        19A  O 11  2
     A                                 12  2'Best.dato:'
     A            B1BDAT         6Y 0B 12 13COLOR(YLW)
     A                                      EDTWRD('      ')
     A  34                                  ERRMSGID(LSO0020 *LIBL/QMFLAGR 34)
     A  35                                  ERRMSGID(LSO0030 *LIBL/QMFLAGR 35)
     A                                 13  2'Lev.dato:'
     A            B1LDAT         6Y 0B 13 13COLOR(YLW)
     A  36                                  ERRMSGID(LSO0020 *LIBL/QMFLAGR 36)
     A                                      EDTWRD('      ')
     A                                 15  2'F4=Spørring'
     A                                      COLOR(WHT)
