     A*%%TS  SD  20020922  234144  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      MSGLOC(16)
     A          R B1SFL                     SFL
     A*%%TS  SD  20001212  094232  ASK         REL-V4R4M0  5769-PW1
     A            B1VALG    R        B  6  2REFFLD(LÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            B1BATC    R        O  6  4REFFLD(LCBATC)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020922  234144  HKO         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A                                      SFLCSRRRN(&WCURRN)
     A            WCURRN         5S 0H
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A                                  1  2' VALG AV BATCH '
     A                                      DSPATR(RI)
     A                                  3  2'1=Hent inn batch'
     A                                      COLOR(WHT)
     A            B2BATC    R        B  5  4REFFLD(LCBATC)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20001214  105719  HKO         REL-V4R4M0  5769-PW1
     A                                 15  2'F5=Forny'
     A                                      COLOR(WHT)
     A          R ASUME                     ASSUME
     A                                 24 79' '
