     A*%%TS  SD  20030102  133534  ASK         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      MSGLOC(16)
     A          R B1BLD
     A*%%TS  SD  20030102  133534  ASK         REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  1  2' LAGERTELLING '
     A                                      DSPATR(RI)
     A                                  3  2'Batch:'
     A            B1BATC    R        B  3  9REFFLD(LCBATC)
     A  31                                  ERRMSGID(HMT0010 *LIBL/QMFLAGR 31)
     A  34                                  ERRMSGID(HMT0060 *LIBL/QMFLAGR 34)
     A                                      COLOR(YLW)
     A                                  4  2'Lager:'
     A            B1LAGE    R        B  4  9REFFLD(LELAGE)
     A  32                                  ERRMSGID(HMT0020 *LIBL/QMFLAGR 32)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            B1LTXT        19A  O  5  2COLOR(YLW)
     A                                  7  2'Bunt :'
     A            B1NUMM         6Y 0B  7  9COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                  8  2'(Blank gir neste)'
     A                                 10  2'Beskrivelse:'
     A            B1BES1        15A  B 11  2COLOR(YLW)
     A  33                                  DSPATR(PC)
     A            B1BES2        15A  B 12  2COLOR(YLW)
     A                                 15  2'F4=Spørring'
     A                                      COLOR(WHT)
