     A*%%TS  SD  20120509  143833  AMD610      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      MSGLOC(16)
     A          R B1SFL                     SFL
     A*%%TS  SD  20051011  151602  ASK540      REL-V5R3M0  5722-WDS
     A            B1VARE    R        H      REFFLD(HRVARE)
     A            B1VALG    R        B  8  2REFFLD(LÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 4)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            B1TEK1        17A  O  8  4
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20051011  152851  ASK540      REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0007)
     A                                      SFLPAG(0006)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A                                      SFLCSRRRN(&WCURRN)
     A            WCURRN         5S 0H
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A                                  1  2' LAGERLOKASJONER '
     A                                      DSPATR(RI)
     A                                  3  2'Vare:'
     A            B2SCA1        19A  B  4  2COLOR(YLW)
     A  31                                  ERRMSGID(HMR0120 *LIBL/QMFLAGR 31)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2SCA2         8A  B  5  2COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'4=Slett'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20000927  084512  HKO         REL-V4R4M0  5769-PW1
     A                                 15  2'F4=Søk  F5=Forny'
     A                                      COLOR(WHT)
     A          R D1BLD
     A*%%TS  SD  20051011  152851  ASK540      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                  1  2' LAGERLOKASJONER '
     A                                      DSPATR(RI)
     A                                  3  2'Bekrefte sletting'
     A                                  4  2'av lokasjonslinje'
     A                                  6  2'Vare:'
     A            D1VARE    R        O  6  8REFFLD(HRVARE)
     A                                      COLOR(YLW)
     A            D1TEK1        19A  O  7  2COLOR(YLW)
     A            D1TEK2        16A  O  8  2COLOR(YLW)
     A          R E1BLD
     A*%%TS  SD  20051011  152851  ASK540      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CA05
     A                                  1  2' LAGERLOKASJONER '
     A                                      DSPATR(RI)
     A                                  5  2'Trykk <Enter> for å'
     A                                  6  2'bekrefte reg. bunt'
     A                                  8  2'<F3> returnerer til'
     A                                  9  2'registreringsbildet'
     A          R F1BLD
     A*%%TS  SD  20120509  143833  AMD610      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                  1  2' LAGERLOKASJONER '
     A                                      DSPATR(RI)
     A                                  3  2'Det er allerede'
     A                                  4  2'lagt inn lokasjon'
     A                                  5  2'på denne varen!'
     A                                  6  2'Overskriv?'
     A            F1VALG         1A  B  6 13COLOR(YLW)
     A  31                                  ERRMSGID(HMR0300 *LIBL/QMFLAGR 31)
     A                                  6 15'(J/N)'
     A                                  8  2'Vare:'
     A            F1VARE    R        O  8  8REFFLD(HRVARE)
     A                                      COLOR(YLW)
     A            F1TEK1        19A  O  9  2COLOR(YLW)
     A            F1TEK2        16A  O 10  2COLOR(YLW)
     A                                 11  2'Lokasjon:'
     A            F1LOKA         8A  O 11 12COLOR(YLW)
     A                                 12  2'Lok alt1:'
     A            F1PLA1         8A  O 12 12COLOR(YLW)
     A                                 13  2'Lok alt2:'
     A            F1PLA2         8A  O 13 12COLOR(YLW)
     A          R G1BLD
     A*%%TS  SD  20120509  143030  AMD610      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                  1  2' LAGERLOKASJONER '
     A                                      DSPATR(RI)
     A                                  3  2'Denne varen      '
     A                                  4  2'finnes ikke på   '
     A                                  5  2'valgt lager !  '
     A                                  6  2'          '
     A                                  8  2'Vare:'
     A            G1VARE    R        O  8  8REFFLD(HRVARE)
     A                                      COLOR(YLW)
     A            G1TEK1        19A  O  9  2COLOR(YLW)
     A            G1TEK2        16A  O 10  2COLOR(YLW)
     A                                 11  2'Lokasjon:'
     A            G1LOKA         8A  O 11 12COLOR(YLW)
     A                                 12  2'Lok Alt1:'
     A            G1PLA1         8A  O 12 12COLOR(YLW)
     A                                 13  2'Lok Alt2:'
     A            G1PLA2         8A  O 13 12COLOR(YLW)
