     A*%%TS  SD  20140523  151439  BOF630      REL-V7R1M0  5770-WDS
     A*%%EC
6.NU A*%%EC Justering vedr utvidelse av nummerserie
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      MSGLOC(16)
     A          R B1SFL                     SFL
     A*%%TS  SD  20140523  151219  BOF630      REL-V7R1M0  5770-WDS
     A            B1VALG    R        B  7  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 5)
     A                                      CHKMSGID(FM00010 *LIBL/QMFLAGR)
     A            B1NUMM    R        O  7  4REFFLD(FONUMM)
     A            B1STAT         2   O  7 16
     A            B1REST         2   O  7 19
     A            B1KNAV        17A  O  8  4
     A            B1KODE         1A  H
     A            B1SUFF    R        O  7 13REFFLD(FOSUFF)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20060823  120720  BOF550      REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0004)
     A                                      SFLPAG(0003)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A                                      SFLCSRRRN(&WCURRN)
     A            WCURRN         5S 0H
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A                                  1  2'  PLUKKING  '
     A                                      DSPATR(RI)
     A                                  3  2'Ordrenr:'
6.NU A            B2NUMM         8S 0B  4  2
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A*                                     OVRDTA
     A                                  6  2'1=Velg  5=Info  '
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20000927  084512  HKO         REL-V4R4M0  5769-PW1
     A                                 15  2'F4=Søk  F5=Forny'
     A                                      COLOR(WHT)
     A          R C2BLD
     A*%%TS  SD  20140523  151439  BOF630      REL-V7R1M0  5770-WDS
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CA05
     A                                      PUTOVR
     A                                  1  2'  PLUKKING  '
     A                                      DSPATR(RI)
     A                                  3  2'Ordre:'
     A            C2NUMM    R        O  3  9REFFLD(FONUMM)
     A                                      COLOR(YLW)
     A            C2SUFF    R        O  3 19REFFLD(FOSUFF)
     A                                      COLOR(YLW)
     A                                  4  2'Kunde:'
     A            C2KNAV        19A  O  5  2COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Kundeprosjekt:'
     A            C2KPRO        19A  O  7  2COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Kontaktperson:'
     A            C2KPER        19A  O  9  2COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'K.tlf:'
     A            C2KTLF        11A  O 10  9COLOR(YLW)
     A                                      OVRDTA
     A                                 11  2'K.mob:'
     A            C2KMOB        11A  O 11  9COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Info.type:'
     A            C2ITYP    R        O 12 13REFFLD(FOITYP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13  2'Lev.dato:'
     A            C2LDAT         6Y 0O 13 12COLOR(YLW)
     A                                      OVRDTA
     A                                 14  2'Info:'
     A*           C2INF1    R        O 14  8REFFLD(FOINF1)
     A*                                     COLOR(YLW)
     A*                                     OVRDTA
     A                                 15  2'F3=Tilbake'
     A                                      COLOR(WHT)
     A          R E1BLD
     A*%%TS  SD  20040604  155323  ASK         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA05
     A                                  1  2'  PLUKKING  '
     A                                      DSPATR(RI)
     A                                  3  2'Sluttbehandling'
     A                                  4  2'av plukking  '
     A                                  6  3'Valg:'
     A            E1VALG         1Y 0B  6  9COLOR(YLW)
     A                                      DSPATR(UL)
     A                                  8  3'0=Lagre'
     A                                  9  3'1=Oppdater'
     A                                 15  3'F3=Tilbake'
     A                                      COLOR(WHT)
     A          R F1BLD
     A*%%TS  SD  20060811  092855  BOF550      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                  1  2'  PLUKKING  '
     A                                      DSPATR(RI)
     A  31                              3  2'Ordrenummer ikke'
     A  31                              4  2'funnet!'
     A  32                              3  2'Ordrenummer ikke'
     A  32                              4  2'klar til plukk! '
     A                                 12  3'F4=Søk'
     A                                      COLOR(WHT)
     A          R G1BLD
     A*%%TS  SD  20060811  092855  BOF550      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                  1  2'  PLUKKING  '
     A                                      DSPATR(RI)
     A                                  3  2'Ordrenummer er  '
     A                                  4  2'under plukking. '
     A                                  5  2'Kan ikke        '
     A                                  6  2'behandles av    '
     A                                  7  2'radioterminal   '
     A                                 12  3'F4=Søk'
     A                                      COLOR(WHT)
