     A*%%TS  SD  20001006  091441  HKO         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      MSGLOC(16)
     A          R B1BLD
     A*%%TS  SD  20001006  091441  HKO         REL-V4R4M0  5769-PW1
     A                                      CF01
     A                                      CA03
     A                                      CA05
     A                                      PUTOVR
     A                                  1  2' KALKULATOR '
     A                                      DSPATR(RI)
     A                                  3  2'Vare:'
     A            B1VARE    R        O  3  8REFFLD(HRVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B1TEK1        19A  O  4  2COLOR(YLW)
     A                                      OVRDTA
     A            B1TEK2        16A  O  5  2COLOR(YLW)
     A                                      OVRDTA
     A            B1LNAV        19A  O  7  2COLOR(YLW)
     A                                      OVRDTA
     A            B1ENH1    R        O 10  2REFFLD(HRENHE)
     A                                      COLOR(YLW)
     A  80                                  DSPATR(RI)
     A                                      OVRDTA
     A            B1ENH2    R        O 10  6REFFLD(HRENHE)
     A                                      COLOR(YLW)
     A  81                                  DSPATR(RI)
     A                                      OVRDTA
     A            B1ENH3    R        O 10 10REFFLD(HRENHE)
     A                                      COLOR(YLW)
     A  82                                  DSPATR(RI)
     A                                      OVRDTA
     A                                 12  2'Antall:'
     A            B1ANTA        10  3B 12 10COLOR(YLW)
     A  31                                  ERRMSGID(HMR0999 *LIBL/QMFLAGR 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                 15  2'F1=Bytt enhet'
     A                                      COLOR(WHT)
