     A*%%TS  SD  20141104  150529  ASK620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20141104  150529  ASK620      REL-V7R1M0  5770-WDS
     A                                      CA03(03)
     A                                      CA12(12)
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Nexstep/Navision '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Navision setup'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  3'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  6  8'V Overføringsfil'
     A                                      COLOR(WHT)
     A            VA01           1A  B  7  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 10'Overføringer til NAV'
     A            VA02           1A  B  8  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 10'Overføringer fra NAV'
     A            VA03           1A  B  9  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 10'Feil transaksjoner fra NAV'
     A            VA04           1A  B 10  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 10'Oppdaterte transaksjoner fra NAV'
     A            VA05           1A  B 11  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 10'Oppsett Web-service funksjoner'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
