     A*%%TS  SD  20150303  155907  ASK620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20150303  155907  ASK620      REL-V7R1M0  5770-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Nexstep/Navision '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Navision setup'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A  40                              5  7'Navision er valgt som økonomisyste-
     A                                      m.'
     A                                      COLOR(WHT)
     A N40                              5  7'Navision IKKE valgt som økonomisys-
     A                                      tem.  '
     A                                      COLOR(RED)
     A  41                              6  7'Nexstep økonomi blir ikke oppdater-
     A                                      t.'
     A                                      COLOR(RED)
     A N41                              6  7'Nexstep økonomi blir oppdatert.'
     A                                      COLOR(GRN)
     A                                  8 14'Replikeringsrutiner   '
     A                                      COLOR(WHT)
     A                                  9 15'1. Totalreplikering av faste koded-
     A                                      ata'
     A                                 11 15'2. Totalreplikering av kunder'
     A                                 13 15'3. Totalreplikering av leverandøre-
     A                                      r'
     A                                 15 15'4. Totalreplikering av kontaktpers-
     A                                      oner'
     A                                 17 15'5. Totalreplikering av kontoplan'
     A                                 19 15'6. Overføre KID på åpne poster'
     A                                 21 24'90. Gå ut av systemet'
     A                                 22 28'Valg:'
     A            VALG           2Y 0B 22 34EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23 71'F3=Tilbake'
     A                                      COLOR(BLU)
