     A*%%TS  SD  20150730  121558  ASK620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20150730  121558  ASK620      REL-V7R1M0  5770-WDS
     A                                      CA03(03)
     A                                      CA12(12)
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Nexstep/Navision '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Navision setup'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  1'Brukerid web-service   :'
     A            A1WUSR        20A  B  5 26COLOR(YLW)
     A                                      CHECK(LC)
     A                                  6  1'Passord web-service    :'
     A            A1WPAS        50A  B  6 26COLOR(YLW)
     A                                      CHECK(LC)
     A                                  8  1'Lenke til request maler:'
     A            A1LMAL       100A  B  8 26COLOR(YLW)
     A                                      CHECK(LC)
     A                                 11  1'Lenke til request filer:'
     A            A1LREQ       100A  B 11 26COLOR(YLW)
     A                                      CHECK(LC)
     A                                 14  1'Lenke til resp. filer  :'
     A            A1LRES       100A  B 14 26COLOR(YLW)
     A                                      CHECK(LC)
     A                                 17  1'URL til web service    :'
     A            A1LSRV       200A  B 17 26COLOR(YLW)
     A                                      CHECK(LC)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
