     A*%%TS  SD  20050217  074842  TSSERV      REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASSERV
     A* Format. . . . . : IL110D
     A* Beskrivelse . . : LØNNS-PERIODE KALENDER, VEDLIKEHOLD
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       020804 SS   Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  19990316  082956  HKO         REL-V4R2M0  5769-PW1
     A            B1VALG    R        B  8  2REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5 9)
     A                                      CHKMSGID(IM00010 *LIBL/QMFSERV)
     A            B1LPER    R        O  8  5REFFLD(ILKPER)
     A            B1FDAT         6S 0O  8 14
     A            B1TDAT         6S 0O  8 26
     A            B1OPER    R        O  8 38REFFLD(ILKOKP)
     A            B1SPER    R        O  8 52REFFLD(ILKPSP)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20050217  074842  TSSERV      REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av Lønnskalender'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'2=Endre  3=Kopier  4=Slett  5=Vis +
     A                                          9=Året ut'
     A                                      COLOR(BLU)
     A                                  6  2'V  Periode  Fra Dato    Til Dato  +
                                                     Øk-Periode  Sperret'
     A                                      COLOR(WHT)
     A            B2LPER    R        B  7  5REFFLD(ILKPER)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            B2FDAT         6S 0B  7 14
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A**                                    EDTCDE(Z)
     A          R B2CMD
     A*%%TS  SD  20010919  105848  HKO         REL-V4R4M0  5769-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20050217  074842  TSSERV      REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av lønns-kalender'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Periode  . . . . . . . . . .'
     A            C1LPER    R        B  5 31REFFLD(ILKPER)
     A  31                                  ERRMSGID(PER0001 *LIBL/QMFSERV 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  5 39'ÅÅÅÅMM'
     A          R C1MSG
     A*%%TS  SD  19990316  082956  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Lønnsperiode finnes fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20050217  074842  TSSERV      REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av Lønnskalender'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Lønns Periode. . . . . . . .'
     A            C1LPER    R        O  5 31REFFLD(ILKPER)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Fra dato . . . . . . . . . .'
     A            C2FDAT         6S 0B  7 31
     A  31                                  ERRMSGID(DAT0002 *LIBL/QMFSERV 31)
     A  32                                  ERRMSGID(DAT0001 *LIBL/QMFSERV 32)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A**                                    EDTCDE(Z)
     A                                  9  2'Til dato . . . . . . . . . .'
     A            C2TDAT         6S 0B  9 31
     A  33                                  ERRMSGID(DAT0002 *LIBL/QMFSERV 33)
     A  34                                  ERRMSGID(DAT0001 *LIBL/QMFSERV 34)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A**                                    EDTCDE(Z)
     A                                 11  2'Økonomi Periode  . . . . . .'
     A            C1OPER    R        B 11 31REFFLD(ILKOKP)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                 13  2'Sperret Periode  (J) . . . .'
     A            C1SPER    R        B 13 31REFFLD(ILKPSP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 18  2'Opprettet dato . . . . . . .'
     A            C2ODAT         6Y 0O 18 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 19  2'Sist endret dato . . . . . .'
     A            C2EDAT         6Y 0O 19 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20  2'Endret av. . . . . . . . . .'
     A            C2EUSR    R        O 20 31REFFLD(RÅEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  19990316  082956  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette Lønnsperiode '
     A                                      DSPATR(RI)
     A                                  4  2'Lønnsperiode . . .'
     A            D1LPER    R        O  4 21REFFLD(ILKPER)
     A                                  6  2'Fra Dato . . . . .'
     A            ILKFDA    R        O  6 21
     A                                  8  2'Til Dato . . . . .'
     A            ILKTDA    R        O  8 21
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20050217  074842  TSSERV      REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Lønnsperiode . . .'
     A            K1LPER    R        B  4 21REFFLD(ILKPER)
     A  31                                  ERRMSGID(PER0001 *LIBL/QMFSERV 31)
     A  32                                  ERRMSGID(PER0001 *LIBL/QMFSERV 32)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                  6  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  8  2'Lønnsperiode . . .'
     A            ILKPER    R        O  8 21OVRDTA
     A                                  9  2'Fra dato . . . . .'
     A            ILKFDA    R        O  9 21OVRDTA
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
