     A*%%TS  SD  20180219  144641  G0XEGSVSTR  REL-V7R1M0  5770-WDS
     A*%%EC
7.xx A                                      DSPSIZ(24 80 *DS3 -
7.xx A                                             27 132 *WIDE)
7.XX A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/IFRF IFRFR)
     A                                      HOME(21)
     A                                      CA03(03 'F3=GÅ TILBAKE')
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '        '))
     A          R K1WIN
     A*%%TS  SD  20180219  144432  G0XEGSVSTR  REL-V7R1M0  5770-WDS
     A                                      WINDOW(3 7 08 40)
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  7  3'F3=Avbryt kjøring'
     A                                      COLOR(BLU)
     A                                  2  2'       Valg av inkasso firma      -
     A                                         '
     A                                      DSPATR(RI)
     A            T1            25A  O  4  3COLOR(YLW)
     A            P1             1A  B  4 30OVRDTA
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                      CHKMSGID(JAN0003 *LIBL/QMFSERV)
     A                                  4 33'(J/ )'
     A            T2            25A  O  5  3COLOR(YLW)
     A            P2             1A  B  5 30OVRDTA
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                      CHKMSGID(JAN0003 *LIBL/QMFSERV)
     A                                  5 33'(J/ )'
     A            MELD          30A  O 06  3OVRDTA
     A  43                                  DSPATR(ND)
     A  44                                  DSPATR(RI)
     A          R S2WIN
     A*%%TS  SD  19990322  213748  BOF         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 08 40)
     A          R ASUME
     A*%%TS  SD  19980123  101059  MWE         REL-V3R7M0  5716-PW1
     A                                      ASSUME
     A                                 24 79' '
