     A*%%TS  SD  20140731  132223  ASK620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20140731  132223  ASK620      REL-V7R1M0  5770-WDS
     A                                      CA03(03)
     A                                      CA12(12)
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Nexstep/Navision '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Navision setup'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  7  4'Førstegangsinstallasjon'
     A            A1VLG1         1A  B  8 29VALUES('F' 'O')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  8 33'(F=første/O=oppdatering)'
     A                                  8  4'eller oppdatering:'
