     A*%%TS  SD  20110504  125818  BOF620      REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASVADM
     A* Format. . . . . : JA100D
     A* Beskrivelse . . : Statusregister, vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       040511 bof  Utvidet med Bruk nobb enhetsrekkefølge mm.
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HELP
     A          R C2BLD
     A*%%TS  SD  20110504  125818  BOF620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av statusinformasjon'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Sist brukte varenummer . . .'
     A            C2AVSI    R        B  5 31REFFLD(JAAVSI)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A  31                                  ERRMSGID(JMA0010 *LIBL/QMFVADM 31)
     A                                  8  2'Ikke oppdater innkjøpspris'
     A                                  9  2'ved prisoppdatering. . . . .'
     A            C2AINI    R        B  9 31REFFLD(JAAINI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      VALUES(0 1)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A                                  9 40'1=Ja,0=Nei'
     A                                 11  2'Bruk Nobb pakningsrekkefølge'
     A            C2AERF    R        B 11 31REFFLD(JAAERF)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      VALUES(0 1)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A                                 11 40'1=Ja,0=Nei'
     A                                 13  2'NOBB-nr som eget varenr. . .'
     A            C2ANOB    R        O 13 31REFFLD(JAANOB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13 40'1=Ja,0=Nei'
     A                                 16  2'Sist oppdatert . . . . . . .'
     A            C2AOPD         6Y 0O 16 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A            C2AODA         6Y 0O 23 48COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 57'/'
     A            C2AEDA         6Y 0O 23 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 68'/'
     A            C2AEUS    R        O 23 70REFFLD(JAAEUS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
