     A*%%TS  SD  20150324  120050  BOFBMP      REL-V7R1M0  5770-WDS
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A*       010816 bsa  Endringer relatert til ny GUI
     A*
     A*---------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20150324  120050  BOFBMP      REL-V7R1M0  5770-WDS
     A            B1VALG    R        B  9  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1OGRP    R        O  9  5REFFLD(JA1OGR)
     A            B1HGRP    R        O  9  8REFFLD(JA1HGR)
     A            B1UGRP    R        O  9 11REFFLD(JA1UGR)
     A            B1LDOR    R        O  9 15REFFLD(JA1LEV)
     A            B1MODN    R        O  9 22REFFLD(JA1MOD)
     A            B1VARE    R   -7   O  9 31REFFLD(JA1VNR)
     A            B11NOB         1A  O  9 42
     A            B11ENH    R        O  9 46REFFLD(JA1ENH)
     A            B1REGL         5Y 0O  9 50EDTCDE(4)
     A            B1TEXT        25A  O  9 56
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20150324  120050  BOFBMP      REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CF06
     A                                      CA23
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av Avrundingsnøkkel'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  5  4'Og'
7.xx A                                      COLOR(WHT)
7.xx A                                  5  9'Hg'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 14'Ugr'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 20'Lev.nr'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 29'Modul'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 40'Varenr.'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  2'2=Endre  3=Kopier  4=Slett  5=Vis'
     A                                      COLOR(BLU)
7.xx A                                  8  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  8  5'Og'
7.xx A                                      COLOR(WHT)
7.xx A                                  8  8'Hg'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 11'Ugr'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 15'Lev.nr'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 22'Modul'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 31'Varenr.'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 39'Av.nob'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 46'Enh'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 50'Regel'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 56'Regel beskrivelse'
7.xx A                                      COLOR(WHT)
7.xx A**                                7  2'V  Og Hg Ugr   Lev.    Modul Varen-
7.xx A**                                    r. Av.nob Enh Regel  Regel beskrive-
7.xx A**                                    lse     '
7.xx A**                                    COLOR(WHT)
7.xx A                                  6  2'+'
7.xx A            B2OGRP    R        B  6  4REFFLD(JA1OGR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  6  7'+'
7.xx A            B2HGRP    R        B  6  9REFFLD(JA1HGR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  6 12'+'
7.xx A            B2UGRP    R        B  6 14REFFLD(JA1UGR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  6 18'+'
7.xx A            B2LDOR    R        B  6 20REFFLD(JA1LEV)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  6 27'+'
7.xx A            B2MODN    R        B  6 29REFFLD(JA1MOD)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  6 38'+'
7.xx A            B2VARE         8A  B  6 40COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  4 54'Filter: Regel:'
     A                                  5 62'Leverandør:'
     A            B2FLEV    R        O  5 74REFFLD(JA1LEV)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2FRGL    R        O  4 75REFFLD(JA1RGL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20140121  122422  SST620      REL-V7R1M0  5770-WDS
     A                                 23  2'F1=Filter  F3=Gå tilbake  F4=Spørr-
     A                                      ing  F5=Forny  F6=Opprett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20140121  152453  SST620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av Avrundingsnøkkel  '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            C1OTXT        30A  O  5 41COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  5  2'Overgruppe . . . . . . . . +'
     A            C1HTXT        30A  O  6 41COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  6  2'Hovedgruppe . . . . . . . +'
     A            C1UTXT        30A  O  7 41COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  7  2'Undergruppe . . . . . . . +'
     A            C1LNAV        30A  O  8 41COLOR(YLW)
     A                                      OVRDTA
     A            C1OGRP    R        B  5 31REFFLD(JA1OGR)
     A  41                                  ERRMSGID(VMG1020 *LIBL/QMFOFAK 41)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1HGRP    R        B  6 31REFFLD(JA1HGR)
     A  42                                  ERRMSGID(VMG2020 *LIBL/QMFOFAK 42)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1UGRP    R        B  7 31REFFLD(JA1UGR)
     A  43                                  ERRMSGID(VMG0020 *LIBL/QMFOFAK 43)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  8  2'Leverandør. . . . . . . . +'
     A            C1LDOR    R        B  8 31REFFLD(JA1LEV)
     A  44                                  ERRMSGID(FRL0020 *LIBL/QMFOFAK 44)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C1MTXT        30A  O  9 41COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  9  2'Modulnr . . . . . . . . . +'
     A            C1MODN    R        B  9 31REFFLD(JA1MOD)
     A  34                                  ERRMSGID(FMR0070 *LIBL/QMFOFAK 34)
     A  45                                  ERRMSGID(VMV0800 *LIBL/QMFOFAK 45)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                 10  2'Varen . . . . . . . . . . +'
     A            C1VARE    R   -7   B 10 31REFFLD(JA1VNR)
     A  35                                  ERRMSGID(FMR0080 *LIBL/QMFOFAK 35)
     A  46                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 46)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1VTXT        35A  O 10 41COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spøring '
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20140121  122422  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Avrundings-nøkkel finnes '
     A                                  3  2'fra før.'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20140212  104259  BOF620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av Avrundingsnøkkel  '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            C1OTXT        30A  O  5 41COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Overgruppe . . . . . . . . .'
     A            C1HTXT        30A  O  6 41COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Hovedgruppe. . . . . . . . .'
     A            C1UTXT        30A  O  7 41COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Undergruppe . . . . . . . . '
     A            C1LNAV        30A  O  8 41COLOR(YLW)
     A                                      OVRDTA
     A            C1OGRP    R        B  5 31REFFLD(JA1OGR)
     A  41                                  ERRMSGID(VMG1020 *LIBL/QMFOFAK 41)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1HGRP    R        B  6 31REFFLD(JA1HGR)
     A  42                                  ERRMSGID(VMG2020 *LIBL/QMFOFAK 42)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1UGRP    R        B  7 31REFFLD(JA1UGR)
     A  43                                  ERRMSGID(VMG0020 *LIBL/QMFOFAK 43)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  8  2'Leverandør  . . . . . . . . '
     A            C1LDOR    R        B  8 31REFFLD(JA1LEV)
     A  44                                  ERRMSGID(FRL0020 *LIBL/QMFOFAK 44)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C1MTXT        30A  O  9 41COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Modulnr . . . . . . . . . . '
     A            C1MODN    R        B  9 31REFFLD(JA1MOD)
     A  34                                  ERRMSGID(FMR0070 *LIBL/QMFOFAK 34)
     A  45                                  ERRMSGID(VMV0800 *LIBL/QMFOFAK 45)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 10  2'Varenr. . . . . . . . . . . '
     A            C1VARE    R   -7   B 10 31REFFLD(JA1VNR)
     A  35                                  ERRMSGID(FMR0080 *LIBL/QMFOFAK 35)
     A  46                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 46)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1VTXT        35A  O 10 41COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Regel nummer  . . . . . . . '
     A            C2REGL    R        B 12 31REFFLD(JA1RGL)
     A  35                                  ERRMSGID(FMR0080 *LIBL/QMFOFAK 35)
     A  46                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 46)
     A  48                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 48)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      EDTCDE(Z)
     A                                      DSPATR(PC)
     A                                      CHECK(RB)
     A                                 13  2'Avrund på enhet . . . . . . '
     A            C21ENH    R        B 13 31REFFLD(JA1ENH)
     A  49                                  ERRMSGID(VMA1030 *LIBL/QMFOFAK 49)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                 14  2'Avrund nobbpris . . . . . . '
     A            C21NOB    R        B 14 31REFFLD(JA1NOB)
     A  50                                  ERRMSGID(VMA1030 *LIBL/QMFOFAK 50)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      EDTCDE(Z)
     A                                 14 34'1=Ja,0=Nei'
     A            C2RTXT        30A  O 12 41COLOR(YLW)
     A                                      OVRDTA
     A            C2ODAT         6Y 0O 22 49COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 58'/'
     A            C2EDAT         6Y 0O 22 60COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 69'/'
     A            C2EUSR    R        O 22 71REFFLD(JCEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spøring '
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20140121  122422  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 22 50)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette avrundings nøkkel  '
     A                                      DSPATR(RI)
     A                                  4  2'Overgruppe . . . .'
     A                                  5  2'Hovedgruppe  . . .'
     A                                  6  2'Undergruppe  . . .'
     A            D1OGRP    R        O  4 21REFFLD(JA1OGR)
     A            D1HGRP    R        O  5 21REFFLD(JA1HGR)
     A            D1UGRP    R        O  6 21REFFLD(JA1UGR)
     A                                  7  2'Leverandør . . . .'
     A            D1LDOR    R        O  7 21REFFLD(JA1LEV)
     A                                  8  2'Modulnr. . . . . .'
     A            D1MODN    R        O  8 21REFFLD(JA1MOD)
     A                                  9  2'Varenummer . . . .'
     A            D1VARE    R        O  9 21REFFLD(JA1VNR)
     A                                 11  2'Regel. . . . . . .'
     A            D1REGL    R        O 11 21REFFLD(JA1RGL)
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20140121  122422  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 22 50)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  1  2' Kopiere til: '
     A                                      DSPATR(RI)
7.xx A                                  3  2'Overgruppe . . . +'
7.xx A                                  4  2'Hovedgruppe  . . +'
7.xx A                                  5  2'Undergruppe  . . +'
     A            K1OGRP    R        B  3 21REFFLD(JA1OGR)
     A  41                                  ERRMSGID(VMG1020 *LIBL/QMFOFAK 41)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            K1HGRP    R        B  4 21REFFLD(JA1HGR)
     A  42                                  ERRMSGID(VMG2020 *LIBL/QMFOFAK 42)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            K1UGRP    R        B  5 21REFFLD(JA1UGR)
     A  43                                  ERRMSGID(VMG0020 *LIBL/QMFOFAK 43)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  6  2'Leverandør . . . +'
     A            K1LDOR    R        B  6 21REFFLD(JA1LEV)
     A  44                                  ERRMSGID(FRL0020 *LIBL/QMFOFAK 44)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A                                  7  2'Modulnr. . . . . +'
     A            K1MODN    R        B  7 21REFFLD(JA1MOD)
     A  34                                  ERRMSGID(FMR0070 *LIBL/QMFOFAK 34)
     A  45                                  ERRMSGID(VMV0800 *LIBL/QMFOFAK 45)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  8  2'Varenummer . . . +'
     A            K1VARE    R   -7   B  8 21REFFLD(JA1VNR)
     A  35                                  ERRMSGID(FMR0080 *LIBL/QMFOFAK 35)
     A  46                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 46)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Regel  . . . . . .'
     A            K1REGL    R        B 10 21REFFLD(JA1RGL)
     A  47                                  ERRMSGID(VMA1020 *LIBL/QMFOFAK 47)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 12  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                 14  2'Overgruppe . . . .'
     A                                 15  2'Hovedgruppe  . . .'
     A                                 16  2'Undergruppe  . . .'
     A            JA1OGR    R        O 14 21REFFLD(JA1OGR)
     A                                      OVRDTA
     A            JA1HGR    R        O 15 21REFFLD(JA1HGR)
     A                                      OVRDTA
     A            JA1UGR    R        O 16 21REFFLD(JA1UGR)
     A                                      OVRDTA
     A                                 17  2'Leverandør . . . .'
     A            JA1LEV    R        O 17 21REFFLD(JA1LEV)
     A                                      OVRDTA
     A                                 18  2'Modulnr. . . . . .'
     A            JA1MOD    R        O 18 21REFFLD(JA1MOD)
     A                                      OVRDTA
     A                                 19  2'Varenummer . . . .'
     A            JA1VNR    R        O 19 21REFFLD(JA1VNR)
     A                                      OVRDTA
     A                                 21  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R F1WIN
     A*%%TS  SD  20140217  120016  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 13 58)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            F1REG     R        H      REFFLD(JA1RGL)
     A            F1LEV     R        H      REFFLD(JA1LEV)
     A                                  2  2' Filter '
     A                                      DSPATR(RI)
7.xx A                                  4  2'Regel. . . . . . +'
     A            F1REGL    R        B  4 21REFFLD(JA1RGL)
     A  31                                  ERRMSGID(FRK0020 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            F1RTXT        30A  O  4 28COLOR(YLW)
7.xx A                                  5  2'Leverandør . . . +'
     A            F1LEVR    R        B  5 21REFFLD(JA1LEV)
     A  32                                  ERRMSGID(FML0200 *LIBL/QMFOFAK 32)
     A  33                                  ERRMSGID(FML0020 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            F1LNAV        30A  O  5 28COLOR(YLW)
     A                                 12  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R C2MSG
     A*%%TS  SD  20140121  152148  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Avrundings-nøkkel finnes '
     A                                  3  2'fra før.'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R NYREGEL
     A*%%TS  SD  20140121  152148  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  2  2'Avrundings-regel finnes ikke'
     A                                  3  2'Denne må opprettes          '
     A                                  4 17'Tryk ENTER'
