     A*%%TS  SD  20140212  123352  BOF620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A          R M1WIN
     A*%%TS  SD  20140212  123352  BOF620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(&W_ACLI &W_ACPO 11 54)
     A                                      CA12(12 'F12=ANNULLER')
     A                                      CA13(13 'F13=HENTMILJØ')
     A                                      KEEP
     A            W_ACLI         2S 0P
     A            W_ACPO         3S 0P
     A                                  2  2'Sette type avrunding som skal bruk-
     A                                      es til priser'
     A                                      DSPATR(UL)
     A                                  4  2'Bruk av standard avrunding .....:'
     A                                  5  2'Bruk av Psykologiske priser ....:'
     A            STD            1A  B  4 37COLOR(YLW)
     A            BMP            1A  B  5 37COLOR(YLW)
     A                                  4 40'(J/N)'
     A                                  5 40'(J/N)'
     A          R ASUME                     ASSUME
     A                                 24 79' '
