     A*%%TS  SD  20090825  120131  BOF610      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASVADM
     A* Format. . . . . : JL111D
     A* Beskrivelse . . : Leverandører - GLN Lokasjoner  vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       250809 bof  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20090825  120131  BOF610      REL-V5R4M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1GADR    R   -5   O  8 19REFFLD(JLGADR)
     A            B1GBES    R   -5   O  8 50REFFLD(JLGBES)
     A            B1GGS1    R        O  8  4REFFLD(JLGGS1)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20090825  120131  BOF610      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av GLN Lokasjoner'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Leverandør : '
     A                                      COLOR(BLU)
     A            B2LDOR    R        O  4 18REFFLD(JLLDOR)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2LNAV    R        O  4 26REFFLD(JLNAVN)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  5  2'2=Endre  3=Kopier  4=Slett  5=Vis'
     A                                      COLOR(BLU)
     A                                  6  2'V GLN Lokasjon     Adresse        -
     A                                                       Beskrivelse       -
     A                                                '
     A                                      COLOR(WHT)
     A            B2GGS1    R        B  7  4REFFLD(JLGGS1)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A          R B2CMD
     A*%%TS  SD  20010919  105848  HKO         REL-V4R4M0  5769-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20090825  120131  BOF610      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av GLN Lokasjoner'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Leverandør : '
     A                                      COLOR(BLU)
     A            C1LDOR    R        O  4 18REFFLD(JLLDOR)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            C1LNAV    R        O  4 26REFFLD(JLNAVN)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  6  2'GLN Lokasjon . . . . . . . .'
     A            C1GGS1    R        B  6 31REFFLD(JLGGS1)
     A  31                                  ERRMSGID(JM00110 *LIBL/QMFVADM 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  19990316  082956  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'GLN Lokasjon  finnes fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20090825  120131  BOF610      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av GLN Lokasjon'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Leverandør : '
     A                                      COLOR(BLU)
     A            C1LDOR    R        O  4 18REFFLD(JLLDOR)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            C1LNAV    R        O  4 26REFFLD(JLNAVN)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  6  2'GLN Lokasjon . . . . . . . .'
     A            C1GGS1    R        O  6 31REFFLD(JLGGS1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Adresse  . . . . . . . . . .'
     A            C2GADR    R        B  8 31REFFLD(JLGADR)
     A  31                                  ERRMSGID(JMV0040 *LIBL/QMFVADM 31)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  9  2'Beskrivelse  . . . . . . . .'
     A            C2GBES    R        B  9 31REFFLD(JLGBES)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 18  2'Opprettet dato . . . . . . .'
     A            C2GODA         6Y 0O 18 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 19  2'Sist endret dato . . . . . .'
     A            C2GEDA         6Y 0O 19 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20  2'Endret av. . . . . . . . . .'
     A            C2GUSR    R        O 20 31REFFLD(JLGUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   '
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20090821  134749  BOF610      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette GLN Lokasjon'
     A                                      DSPATR(RI)
     A                                  4  2'GLN Lokasjon . . .'
     A            D1GGS1    R        O  4 21REFFLD(JLGGS1)
     A                                  5  2'Adresse  . . . . .'
     A            D1GADR    R  -10   O  5 21REFFLD(JLGADR)
     A                                  7  2'Beskrivelse. . . .'
     A            D1GBES    R  -10   O  7 21REFFLD(JLGBES)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20090821  134749  BOF610      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'GLN Lokasjon . . .'
     A            K1GGS1    R        B  4 21REFFLD(JLGGS1)
     A                                      COLOR(YLW)
     A  31                                  ERRMSGID(JM00110 *LIBL/QMFVADM 31)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                  7  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  9  2'GLN Lokasjon . . .'
     A            JLGGS1    R        O  9 21OVRDTA
     A                                 11  2'Adresse  . . . . .'
     A            K2GADR    R        O 11 21REFFLD(JLGADR)
     A                                      OVRDTA
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
