     A*%%TS  SD  20050915  160029  HKO530      REL-V5R3M0  5722-WDS
     A*%%EC
7.xx A* 030316 bsa Endringer relatert til ny GUI
8.01 A* 120121 bof Takle spørring fra 132 bilder
     A*---------------------------------------------------------------
8.01 A                                      DSPSIZ(24 80 *DS3 -
8.01 A                                             27 132 *WIDE)
8.01 A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  19961021  102447  HKO         REL-V3R6M0  5716-PW1
     A            B1VALG    R        B  8  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1NAVN    R        O  8  5REFFLD(JLNAVN)
     A            B1LDOR    R        O  8 42REFFLD(JLLDOR)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20050915  155821  HKO530      REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA09
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Velge leverandør '
     A                                      DSPATR(RI)
7.xx A                                  3  2'Frisøk . .'
     A                                      COLOR(BLU)
7.xx A            B2STEK        35A  B  3 13COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
7.xx A                                  4  5'Navn'
7.xx A                                      COLOR(WHT)
7.xx A                                  4 42'Nummer'
     A                                      COLOR(WHT)
7.xx A                                  6  2'1=Velg'
     A                                      COLOR(BLU)
7.xx A                                  7  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  5'Navn'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 42'Nummer'
     A                                      COLOR(WHT)
7.xx A            B2NAVN    R        B  5  5REFFLD(JLNAVN)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(LC)
     A                                      OVRDTA
7.xx A            B2LDOR    R        B  5 42REFFLD(JLLDOR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20050915  160029  HKO530      REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 18 48)
     A                                 17  2'F3=Gå tilbake   F5=Forny   F9=Gjen-
     A                                      ta søk'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 78' '
