     A*%%TS  SD  20050919  110338  HKO530      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20050919  110338  HKO530      REL-V5R3M0  5722-WDS
     A*                                     WINDOW(*DFT 17 54)
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Vis leverandører med nye varer og-
     A                                       prisoppdatering '
     A                                      DSPATR(RI)
     A                                  5  2'Endringsdato . . . . . . . . . .'
     A            B1DATO         6Y 0B  5 35COLOR(YLW)
     A  31                                  ERRMSGID(JM00290 *LIBL/QMFVADM 31)
     A  32                                  ERRMSGID(JM00250 *LIBL/QMFVADM 32)
     A                                      CHECK(RB)
     A                                      EDTWRD('  .  .  ')
     A                                  7  2'Angi dato du ønsker å se informasj-
     A                                      onen fra.'
     A                                  9  2'Begrense visning av leverandører:'
     A                                      COLOR(WHT)
     A                                 10  2'Kun leverandører med varer i EVR'
     A            B1KEVR         1Y 0B 10 35COLOR(YLW)
     A                                      VALUES(1 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A                                 10 38'1=Ja,0=Nei'
     A                                 11  2'Kun leverandører med nye priser.'
     A            B1KPRI         1Y 0B 11 35COLOR(YLW)
     A                                      VALUES(1 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A                                 11 38'1=Ja,0=Nei'
     A                                 14  2'Sist oppdatert . . . . . . . . .'
     A            B1AOPD         6Y 0O 14 35COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
