     A*%%TS  SD  20040130  103404  HKO         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASVADM
     A* Format. . . . . : JM06
     A* Beskrivelse . . : Matching av vareregister
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A                                      CA22(22 'F22=Info')
     A          R A1MNU
     A*%%TS  SD  20040130  103404  HKO         REL-V5R2M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Matching av vareregister'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  4'Vedlikehold:'
     A                                      COLOR(WHT)
     A                                  5 41'Maskinell matching:'
     A                                      COLOR(WHT)
     A                                  6  4'1. Vareinformasjon'
     A                                  6 41'11. Nobb-nummer'
     A                                  7  4'2. Leverandør'
     A                                  7 41'12. GTIN-nummer'
     A                                  8 41'13. Leverandør / leverandørs varen-
     A                                      r.'
     A                                  9  4'4. Manuell matching av varer'
     A                                 10 41'15. Eget varenr fra/til og lev. va-
     A                                      renr'
     A                                 11  4'Utskrift:'
     A                                      COLOR(WHT)
     A                                 11 41'16. Egen varetekst og lev. varenr'
     A                                 12  4'6. Matchede varer'
     A                                 13  4'7. Ikke matchede varer'
     A                                 13 41'Oppdatering:'
     A                                      COLOR(WHT)
     A                                 14 41'19. Oppdatering/overføring av matc-
     A                                      hing'
     A                                 15  4'9. Overføring av nye og endrede'
     A                                 15 41'20. Reverser oppdatering'
     A                                 16  7'varer fra EVR til matche-'
     A                                 17  7'register'
     A                                 17 41'21. Vedlikehold av faste registre'
     A                                 18 41'90. Gå ut av systemet'
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 20'F6=Se på meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
     A                                 23 43'F3=Gå tilbake'
     A                                      COLOR(BLU)
