     A*%%TS  SD  20050919  185014  HKO530      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20050919  185014  HKO530      REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 12 40)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Statuskoder '
     A                                      DSPATR(RI)
     A                                  4  2'1 = Vare ble ikke funnet i EVR'
     A                                  5  2'2 = Uoverenstemmelse mot enheter i-
     A                                       EVR'
     A                                  6  2'3 = Mangler kampanjepris'
     A                                  7  2'4 = Kampanjepris er høyere enn'
     A                                  8  6'veiledende salgspris'
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
