     A*%%TS  SD  20050919  183505  HKO530      REL-V5R3M0  5722-WDS
8.01 A*PRG2 130622 bof : utvidet prisgruppe 1 til 2 posisjoner
     A*%%EC
7.xx A                                      DSPSIZ(24 80 *DS3 -
7.xx A                                             27 132 *WIDE)
7.XX A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20050919  183505  HKO530      REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 12 43)
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Overføring av kampanjepriser til -
     A                                      EVR '
     A                                      DSPATR(RI)
     A                                  4  2'Kontrolliste . . .'
     A            B1VALG    R        B  4 21REFFLD(JÅVALG)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A                                      COLOR(YLW)
     A                                  4 26'1=Ja,0=Nei'
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B2BLD
     A*%%TS  SD  20160510  135115  ASP_G0X     REL-V7R1M0  5770-WDS
8.01 A                                      WINDOW(*DFT 16 53)
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Overføring av kampanjepriser til -
     A                                      EVR '
     A                                      DSPATR(RI)
     A                                  4  2'Kontrolliste . . .'
     A            B2VALG    R        B  4 21REFFLD(JÅVALG)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A                                      COLOR(YLW)
     A                                  4 26'1=Ja,0=Nei'
     A                                  6  2'Prisgruppe alle. .'
     A            B2PGVA    R        B  6 21REFFLD(JÅVALG)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A                                      COLOR(YLW)
     A                                  6 26'1=Ja,0=Nei'
     A                                  8  2'Overfør på disse prisgrupper'
     A                                      COLOR(WHT)
     A            B2PR01    R        B  9  2REFFLD(JÅPRGR)
     A  41                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 41)
     A                                      COLOR(YLW)
8.01 A                                  9  5'(k)'
8.01 A            B2PR02    R        B  9  9REFFLD(JÅPRGR)
     A  42                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 42)
     A                                      COLOR(YLW)
8.01 A                                  9 12'(k)'
8.01 A            B2PR03    R        B  9 16REFFLD(JÅPRGR)
     A  43                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 43)
     A                                      COLOR(YLW)
8.01 A                                  9 19'(k)'
8.01 A            B2PR04    R        B  9 23REFFLD(JÅPRGR)
     A  44                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 44)
     A                                      COLOR(YLW)
8.01 A                                  9 27'(k)'
8.01 A            B2PR05    R        B  9 31REFFLD(JÅPRGR)
     A  45                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 45)
     A                                      COLOR(YLW)
8.01 A                                  9 35'(k)'
8.01 A            B2PR06    R        B  9 40REFFLD(JÅPRGR)
     A  46                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 46)
     A                                      COLOR(YLW)
8.01 A                                  9 43'(k)'
8.01 A            B2PR07    R        B  9 47REFFLD(JÅPRGR)
     A  47                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 47)
     A                                      COLOR(YLW)
8.01 A                                  9 50'(k)'
7.03 A            B2PR08    R        B 10  2REFFLD(JÅPRGR)
     A  48                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 48)
     A                                      COLOR(YLW)
8.01 A                                 10  5'(k)'
8.01 A            B2PR09    R        B 10  9REFFLD(JÅPRGR)
     A  49                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 49)
     A                                      COLOR(YLW)
8.01 A                                 10 12'(k)'
8.01 A            B2PR10    R        B 10 16REFFLD(JÅPRGR)
     A  50                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 50)
     A                                      COLOR(YLW)
8.01 A                                 10 19'(k)'
8.01 A            B2PR11    R        B 10 23REFFLD(JÅPRGR)
     A  51                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 51)
     A                                      COLOR(YLW)
8.01 A                                 10 27'(k)'
8.01 A            B2PR12    R        B 10 31REFFLD(JÅPRGR)
     A  52                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 52)
     A                                      COLOR(YLW)
8.01 A                                 10 35'(k)'
8.01 A            B2PR13    R        B 10 40REFFLD(JÅPRGR)
     A  53                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 53)
     A                                      COLOR(YLW)
8.01 A                                 10 43'(k)'
8.01 A            B2PR14    R        B 10 47REFFLD(JÅPRGR)
     A  54                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 54)
     A                                      COLOR(YLW)
8.01 A                                 10 50'(k)'
7.03 A            B2PR15    R        B 11  2REFFLD(JÅPRGR)
     A  55                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 55)
     A                                      COLOR(YLW)
8.01 A                                 11  5'(k)'
7.03 A            B2PR16    R        B 11  9REFFLD(JÅPRGR)
     A  56                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 56)
     A                                      COLOR(YLW)
8.01 A                                 11 12'(k)'
8.01 A            B2PR17    R        B 11 16REFFLD(JÅPRGR)
     A  57                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 57)
     A                                      COLOR(YLW)
8.01 A                                 11 19'(k)'
8.01 A            B2PR18    R        B 11 23REFFLD(JÅPRGR)
     A  58                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 58)
     A                                      COLOR(YLW)
8.01 A                                 11 27'(k)'
8.01 A            B2PR19    R        B 11 31REFFLD(JÅPRGR)
     A  59                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 59)
     A                                      COLOR(YLW)
8.01 A                                 11 35'(k)'
8.01 A            B2PR20    R        B 11 40REFFLD(JÅPRGR)
     A  60                                  ERRMSGID(JMC0120 *LIBL/QMFVADM 60)
     A                                      COLOR(YLW)
8.01 A                                 11 43'(k)'
7.03 A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
