     A*%%TS  SD  20140211  112843  SST620      REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASVADM
     A* Format. . . . . : JM21
     A* Beskrivelse . . : Vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A                                      CA22(22 'F22=Info')
     A          R A1MNU
     A*%%TS  SD  20140211  112843  SST620      REL-V7R1M0  5770-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av faste registre'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  4'Vedlikehold av:'
     A                                      COLOR(WHT)
     A                                  5 41'Vedlikehold av:'
     A                                      COLOR(WHT)
     A                                  6  4'1. Vare'
     A                                  6 41'11. Varegruppe'
     A                                  7  4'2. Rapportør'
     A                                  7 41'12. Varegruppe (alternativ)'
     A                                  8  4'3. Produsent'
     A                                  8 41'13. Varegruppe-knytning'
     A                                  9  4'4. Leverandør'
     A                                  9 41'14. Logistikkvare'
     A                                 10 41'15. Enhet'
     A                                 11  4'Kalkyle, vedlikehold av:'
     A                                      COLOR(WHT)
     A                                 12  4'5. Betingelser'
     A                                 13  4'6. Påslag'
     A                                 14  4'7. Forpakninger'
     A                                 14 41'19. Recordformat'
     A                                 15 41'20. Statusinformasjon'
     A                                 17 41'22. Utskrifter'
     A                                 18 41'90. Gå ut av systemet'
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 20'F6=Se på meldinger'
     A                                      COLOR(BLU)
     A                                 23 43'F10=Kommando-linje'
     A                                      COLOR(BLU)
     A                                 23 66'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 16  4'8. Avrundings nøkkel'
     A                                 17  4'9. Avrundings regler'
     A                                 18  3'10. Sette avrundings metode'
