     A*%%TS  SD  20020823  145723  HKO         REL-V5R1M0  5722-WDS
     A*------------------------------------------------------------------
8.02 A*PRG2   080124 bsa  Overlapp av felter
     A*
     A*
     A*------------------------------------------------------------------
     A*
     A*%%EC
7.xx A                                      DSPSIZ(24 80 *DS3 -
7.xx A                                             27 132 *WIDE)
7.XX A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1SFL                     SFL
     A*%%TS  SD  19971014  131114  HKO         REL-V3R7M0  5716-PW1
     A            B1VKAM    R        O  8  2REFFLD(JMVKAM)
     A            B1VPRG    R        O  8  8REFFLD(JMVPRG)
8.02 A            B1BESK    R  -12   O  8 11REFFLD(JMBESK)
     A            B1FDAT         6Y 0O  8 30EDTWRD('  .  .  ')
     A            B1TDAT         6Y 0O  8 39EDTWRD('  .  .  ')
     A            B1VKPR    R        O  8 48REFFLD(JMVKPR)
     A            B1VKAA    R        O  8 59REFFLD(JMVKAA)
     A            B1VKAU    R        O  8 70REFFLD(JMVKAU)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020823  145723  HKO         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_CURN         5S 0H
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise kampanjepriser for vare'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenummer . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2VARE    R   -7   O  5 31REFFLD(JXVARE)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2TEK1    R        O  5 41REFFLD(JVTEK1)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  7  2'Kamp PG Beskrivelse         Fra-da-
     A                                      to Til-dato   Kostpris     KAA     -
     A                                         KAU'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  19971013  151618  HKO         REL-V3R7M0  5716-PW1
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
