     A*%%TS  SD  20020820  090748  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  19991207  203804  HKO         REL-V4R4M0  5769-PW1
     A            B1LVAR    R        H      REFFLD(JOLVAR)
     A            B1NOBB    R        H      REFFLD(JONOBB)
     A            B1TEK2    R        H      REFFLD(JOTEK2)
     A            B1VAR2    R        H      REFFLD(JOVAR2)
     A            B1VALG    R        B  7  2REFFLD(JÅVALG)
     A                                      VALUES(1 4 5 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1TEK1    R        O  7  4REFFLD(JOTEK1)
     A            B1VAR1    R   -7   O  7 40REFFLD(JOVAR1)
     A            B1LDOR    R        O  7 49REFFLD(JOLDOR)
     A            B1LVAR_10     10A  O  7 56
     A            B1EANN    R        O  7 67REFFLD(JOEANN)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020820  090748  HKO         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_CURN         5S 0H
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Matching av varer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            B2KODE        25A  O  4 55DSPATR(RI)
     A                                      OVRDTA
     A                                  5  2'1=Match  4=Fjern match  5=Vis matc-
     A                                      het vare'
     A                                      COLOR(BLU)
     A                                  6  2'V Egen varetekst                  -
     A                                          Varenr.   Lev.  Lev.varenr    E-
     A                                      AN-nr'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  19991206  122010  HKO         REL-V4R4M0  5769-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
