     A*%%TS  SD  20020820  092234  HKO         REL-V5R1M0  5722-WDS
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A*       020816 bsa  Endringer relatert til ny GUI
     A*
     A*---------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20020820  092234  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 50)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Matching på leverandørens varenum-
     A                                      mer '
     A                                      DSPATR(RI)
     A                                  4  2'Egen varetekst . .'
     A            B1TEK1    R  -15   B  4 21REFFLD(JOTEK1)
     A  31                                  ERRMSGID(JMV0040 *LIBL/QMFVADM 31)
     A                                      COLOR(YLW)
     A                                  7  2'Skal matches mot:'
7.xx A                                  9  2'Leverandør . . . +'
     A            B1LDO2    R        B  9 21REFFLD(JOLDO2)
     A  32                                  ERRMSGID(JML0010 *LIBL/QMFVADM 32)
     A  33                                  ERRMSGID(JML0020 *LIBL/QMFVADM 33)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 14  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
