     A*%%TS  SD  19961110  185020  HKO         REL-V3R6M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19961110  185020  HKO         REL-V3R6M0  5716-PW1
     A*                                     WINDOW(*DFT 15 50)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Maskinell matching av varer '
     A                                      DSPATR(RI)
     A                                  4  2'Maskinell matching på like GTIN-nu-
     A                                      mmer'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
