     A*%%TS  SD  20020820  092257  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20020820  092257  HKO         REL-V5R1M0  5722-WDS
     A*                                     WINDOW(*DFT 17 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Reversering av oppdatering i EVR '
     A                                      DSPATR(RI)
     A                                  4  2'Varenummer (vareadm.) .'
     A            B1VAR2    R   -7   B  4 26REFFLD(JOVAR2)
     A  31                                  ERRMSGID(JMV0010 *LIBL/QMFVADM 31)
     A  32                                  ERRMSGID(JMO0200 *LIBL/QMFVADM 32)
     A  33                                  ERRMSGID(JMO0210 *LIBL/QMFVADM 33)
     A                                      COLOR(YLW)
     A                                  6  2'Reverseringen oppdaterer varen i E-
     A                                      VR med gammel vare-'
     A                                  7  2'informasjon fra matche-registeret.'
     A                                  8  2'Sjekk varenummer, varetekster, var-
     A                                      egruppe, leverandør-'
     A                                  9  2'informasjon og søketekster etter a-
     A                                      t reverseringen er'
     A                                 10  2'avsluttet.'
     A                                 12  2'I vareregisteret (vareadm.) er ege-
     A                                      n varetekst, egen'
     A                                 13  2'varegruppe, priskode og lagerkode -
     A                                      uforandret etter'
     A                                 14  2'reverseringen, og må sjekkes !'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
