     A*%%TS  SD  20140703  154154  BOF630      REL-V7R1M0  5770-WDS
     A*%%EC
7.xx A* 280716 bsa Endringer relatert til ny GUI
     A*---------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20140703  154154  BOF630      REL-V7R1M0  5770-WDS
     A            B1FAKT         8S 5H
     A            B1NTPR         9S 2H
     A            B1VALG    R        B  9  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(7 9 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1NAVN    R        O  9  5REFFLD(JLNAVN)
     A            B1LDOR    R        O  9 42REFFLD(JLLDOR)
     A            B1BET          1A  O  9 54
     A            B1FBE          1A  O  9 68
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20050915  160725  HKO530      REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA09
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av betingelser'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  4  2'Frisøk. . .'
     A                                      COLOR(BLU)
7.xx A            B2STEK        35A  B  4 14COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
7.xx A                                  5  5'Navn'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 42'Nummer'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  2' 7=Betingelser  9=Fraktbetingelser'
     A                                      COLOR(BLU)
6.31 A**                                6 18'9=Fraktbetingelser'
6.31 A**                                    COLOR(BLU)
7.xx A                                  8  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  8  5'Navn              '
7.xx A                                      COLOR(WHT)
7.xx A                                  8 42'Nummer'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 50'Betingelse'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 64'Frakt.bet'
7.xx A                                      COLOR(WHT)
7.xx A**                                7  2'V  Navn                           -
7.xx A**                                          Nummer  Betingelse  Frakt.bet-
7.xx A**                                    ingelse'
7.xx A**                                    COLOR(WHT)
7.xx A            B2NAVN    R        B  6  5REFFLD(JLNAVN)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(LC)
     A                                      OVRDTA
7.xx A            B2LDOR    R        B  6 42REFFLD(JLLDOR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20050915  160824  HKO530      REL-V5R3M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F9=Gjenta søk'
     A                                      COLOR(BLU)
