     A*%%TS  SD  20150604  102338  BOF630      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20050613  133759  HKO530      REL-V5R2M0  5722-WDS
     A            B1RSTS    R        H      REFFLD(JPRSTS)
     A            B1LINE    R        H      REFFLD(JPLINE)
     A            B1VALG    R        B 16  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(5 7 8 9 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1BETI    R        O 16  5REFFLD(JPBETI)
     A            B1NTPR         9Y 2O 16 42EDTCDE(M)
     A            B1FAKT         8Y 5O 16 55EDTCDE(M)
     A            B1RABA         5Y 2O 16 67EDTCDE(M)
     A            B1AKTI         1A  O 16 76
     A            B1RKOD         1A  O 16 78
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20050613  133759  HKO530      REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0007)
     A                                      SFLPAG(0006)
     A                                      ROLLUP(10)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Aktiviser betingelse for betingels-
     A                                      esnivå'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Varenummer . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2VAR2    R   -7   O  4 31REFFLD(JVVARE)
     A                                      COLOR(YLW)
     A            B2VTE2    R        O  4 41REFFLD(JVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Betingelsesnivå:'
     A                                      COLOR(BLU)
     A                                      DSPATR(UL)
     A                                  6  2'Leverandør . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2LDOR    R        O  6 31REFFLD(JPLDOR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            B2LNAV    R        O  6 41REFFLD(JLNAVN)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  7  2'Prisgruppe . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2PRGR    R        O  7 31REFFLD(JPPRGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2PTXT        35A  O  7 41COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Varegruppe . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2OGRP    R        O  8 31REFFLD(JPOGRP)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            B2HGRP    R        O  8 34REFFLD(JPHGRP)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            B2UGRP    R        O  8 37REFFLD(JPUGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2UTXT        35A  O  8 41COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Modulnummer. . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2MODN    R        O  9 31REFFLD(JPMODN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2MTE1    R        O  9 41REFFLD(JUMTE1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Varenummer/Nobbnummer. . . .'
     A                                      COLOR(BLU)
     A            B2VARE    R   -7   O 10 31REFFLD(JPVARE)
     A                                      COLOR(YLW)
     A            B2NOBB    R        O 10 41REFFLD(JVNOBB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 11  2'Varetype . . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2VTYP    R        O 11 31REFFLD(JPVTYP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Leveringstype. . . . . . . .'
     A                                      COLOR(BLU)
     A            B2LETY    R        O 12 31REFFLD(JPLETY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14  2'5=Vis  7=Rabattelementer  8=Vis no-
     A                                      tat  9=Aktiviser/passiviser'
     A                                      COLOR(BLU)
     A                                 15  2'V  Betingelse                     -
     A                                             Nettopris     Faktor    Raba-
     A                                      tt     R'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  19980708  101004  HKO         REL-V3R7M0  5716-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny   F13=Avt-
     A                                      ale/notat'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20150604  102338  BOF630      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CA12
     A                                      CF13
     A                                      CF18
     A                                      PUTOVR
     A            C2RSTS    R        H      REFFLD(JPRSTS)
     A            C2LINE    R        H      REFFLD(JPLINE)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise betingelse'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Leverandør . . . . . . . . .'
     A            C2LDOR    R        O  4 31REFFLD(JPLDOR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2LNAV    R        O  4 41REFFLD(JLNAVN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Prisgruppe . . . . . . . . .'
     A            C2PRGR    R        O  5 31REFFLD(JPPRGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2PNAV    R        O  5 41REFFLD(JLNAVN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Overgruppe . . . . . . . . .'
     A            C2OGRP    R        O  6 31REFFLD(JPOGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OTXT        35A  O  6 41COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Hovedgruppe. . . . . . . . .'
     A            C2HGRP    R        O  7 31REFFLD(JPHGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2HTXT        35A  O  7 41COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Undergruppe. . . . . . . . .'
     A            C2UGRP    R        O  8 31REFFLD(JPUGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2UTXT        35A  O  8 41COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Modulnummer. . . . . . . . .'
     A            C2MODN    R        O  9 31REFFLD(JPMODN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2MTE1    R        O  9 41REFFLD(JUMTE1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Varenummer . . . . . . . . .'
     A            C2VARE    R   -7   O 10 31REFFLD(JPVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2VTEK    R        O 10 41REFFLD(JVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 11  2'Varetype . . . . . . . . . .'
     A            C2VTYP    R        O 11 31REFFLD(JPVTYP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Leveringstype. . . . . . . .'
     A            C2LETY    R        O 12 31REFFLD(JPLETY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14  2'Nobbnummer . . . . . . . . .'
     A            C2NOBB    R        O 14 31REFFLD(JVNOBB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 16  2'Betingelse . . . . . . . . .'
     A            C2BETI    R        O 16 31REFFLD(JPBETI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 18  2'Fra-dato . . . . . . . . . .'
     A            C2FDAT         6Y 0O 18 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 19  2'Til-dato . . . . . . . . . .'
     A            C2TDAT         6Y 0O 19 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20  2'Endringsdato avtaleeier. . .'
     A            C2DATO         6Y 0O 20 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A            C2ODAT         6Y 0O 22 48COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 57'/'
     A            C2EDAT         6Y 0O 22 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 68'/'
     A            C2EUSR    R        O 22 70REFFLD(JPEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake  F18=NOBB info'
     A                                      COLOR(BLU)
