     A*%%TS  SD  20150604  125653  BOF630      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  19980616  155400  HKO         REL-V3R7M0  5716-PW1
     A            B1ERST    R        H      REFFLD(JPERST)
     A            B1ELIN    R        H      REFFLD(JPELIN)
     A            B1VALG    R        B 15  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(5 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1ERAE    R        O 15  5REFFLD(JPERAE)
     A            B1EREG    R        O 15 44REFFLD(JPEREG)
     A            B1EVER    R        O 15 48REFFLD(JPEVER)
     A            B1EFDA         6Y 0O 15 60EDTWRD('  .  .  ')
     A            B1ETDA         6Y 0O 15 70EDTWRD('  .  .  ')
     A            B1RKOD         1A  O 15 80
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20150604  125653  BOF630      REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise rabattelement'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Leverandør . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2ELDO    R        O  4 31REFFLD(JPELDO)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            B2LNAV    R        O  4 41REFFLD(JLNAVN)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  5  2'Prisgruppe . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2EPRG    R        O  5 31REFFLD(JPEPRG)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2PTXT        35A  O  5 41COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Varegruppe . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2EOGR    R        O  6 31REFFLD(JPEOGR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            B2EHGR    R        O  6 34REFFLD(JPEHGR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            B2EUGR    R        O  6 37REFFLD(JPEUGR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            B2UTXT        35A  O  6 41COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Modulnummer. . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2EMOD    R        O  7 31REFFLD(JPEMOD)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            B2MTE1    R        O  7 41REFFLD(JUMTE1)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  8  2'Varenummer . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2EVAR    R   -7   O  8 31REFFLD(JPEVAR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            B2TEK1    R        O  8 41REFFLD(JVTEK1)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  9  2'Nobbnummer . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2NOBB    R        O  9 31REFFLD(JVNOBB)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                 10  2'Varetype . . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2EVTY    R        O 10 31REFFLD(JPEVTY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 11  2'Leveringstype. . . . . . . .'
     A                                      COLOR(BLU)
     A            B2ELET    R        O 11 31REFFLD(JPELET)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Betingelse . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2BETI    R        O 12 31REFFLD(JPBETI)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                 13  2'5=Vis'
     A                                      COLOR(BLU)
     A                                 14  2'V  Rabattelement                  -
     A                                            Regel     Verdi   Fra-dato  T-
     A                                      il-dato  R'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  19980416  154020  HKO         REL-V4R2M0  5769-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20050628  090229  HKO530      REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise rabattelement'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Rabattelement. . . . . . . .'
     A            C2ERAE    R        O  5 31REFFLD(JPERAE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Regel. . . . . . . . . . . .'
     A            C2EREG    R        O  7 31REFFLD(JPEREG)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7 44'1=Rabatt/Følgerabatt'
     A                                  8 44'2=Tilleggsrabatt'
     A                                  9 44'N=Nettopris'
     A                                 10 44'K=Kronetillegg'
     A                                 12  2'Verdi. . . . . . . . . . . .'
     A            C2EVER    R        O 12 31REFFLD(JPEVER)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12 44'(Rabatt-prosent eller beløp)'
     A                                 14  2'Fra-dato . . . . . . . . . .'
     A            C2EFDA         6Y 0O 14 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 15  2'Til-dato . . . . . . . . . .'
     A            C2ETDA         6Y 0O 15 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 19  2'Opprettet dato . . . . . . .'
     A            C2EODA         6Y 0O 19 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20  2'Endret dato. . . . . . . . .'
     A            C2EEDA         6Y 0O 20 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 21  2'Endret av. . . . . . . . . .'
     A            C2EEUS    R        O 21 31REFFLD(JPEEUS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
