     A*%%TS  SD  20020819  134650  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20020306  090117  HKO         REL-V5R1M0  5722-WDS
     A            B1VALG    R        B 11  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1GVGR    R        O 11  5REFFLD(JRGVGR)
     A            B1GBES    R        O 11 17REFFLD(JRGBES)
     A            B1GOGR    R        O 11 59REFFLD(JRGOGR)
     A            B1GHGR    R        O 11 62REFFLD(JRGHGR)
     A            B1GUGR    R        O 11 65REFFLD(JRGUGR)
     A            B1GBE2        12A  O 11 69
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020819  134538  HKO         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0011)
     A                                      ROLLDOWN(11)
     A                                      ROLLUP(10)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av varegruppereferanse'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Rapportør. . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2GRAP    R        O  5 31REFFLD(JRGRAP)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2RNAV    R        O  5 35REFFLD(JRNAVN)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  7  2'2=Endre  3=Kopier  4=Slett  5=Vis'
     A                                      COLOR(BLU)
     A                                  8  5'Rapp.'
     A                                      COLOR(WHT)
     A                                  9  2'V  varegruppe  Beskrivelse        -
     A                                                             Varegruppe'
     A                                      COLOR(WHT)
     A            B2GVGR    R        B 10  5REFFLD(JRGVGR)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2GBES    R        B 10 17REFFLD(JRGBES)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20020819  134650  HKO         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  19990813  104220  HKO         REL-V4R4M0  5769-PW1
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av varegruppereferanse'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Rapportør. . . . . . . . . .'
     A            C1GRAP    R        O  5 31REFFLD(JRGRAP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Varegruppe . . . . . . . . .'
     A            C1GVGR    R        B  6 31REFFLD(JRGVGR)
     A  31                                  ERRMSGID(JMR1010 *LIBL/QMFVADM 31)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  19980416  160322  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Referanse finnes fra før.'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  19990813  104220  HKO         REL-V4R4M0  5769-PW1
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av varegruppereferanse'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Rapportør. . . . . . . . . .'
     A            C1GRAP    R        O  5 31REFFLD(JRGRAP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Rapportør varegruppe . . . .'
     A            C1GVGR    R        O  6 31REFFLD(JRGVGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Beskrivelse. . . . . . . . .'
     A            C2GBES    R        B  8 31REFFLD(JRGBES)
     A  31                                  ERRMSGID(JMR1100 *LIBL/QMFVADM 31)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 10  2'Varegruppe . . . . . . . . .'
     A            C2GOGR    R        B 10 31REFFLD(JRGOGR)
     A  32                                  ERRMSGID(JMR1110 *LIBL/QMFVADM 32)
     A  33                                  ERRMSGID(JMR1120 *LIBL/QMFVADM 33)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2GHGR    R        B 10 34REFFLD(JRGHGR)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2GUGR    R        B 10 37REFFLD(JRGUGR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2UTXT        30A  O 10 42COLOR(YLW)
     A                                      OVRDTA
     A                                 20  2'Endret dato. . . . . . . . .'
     A            C2GEDA         6Y 0O 20 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 21  2'Endret av. . . . . . . . . .'
     A            C2GESI    R        O 21 31REFFLD(JRGESI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  19990813  104220  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 15 50)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette varegruppereferanse '
     A                                      DSPATR(RI)
     A                                  4  2'Rapportør . . .'
     A            D1GRAP    R        O  4 18REFFLD(JRGRAP)
     A                                  5  2'Varegruppe. . .'
     A            D1GVGR    R        O  5 18REFFLD(JRGVGR)
     A                                  7  2'Beskrivelse . .'
     A            D1GBES        30A  O  7 18
     A                                  8  2'Varegruppe. . .'
     A            JRGOGR    R        O  8 18
     A            JRGHGR    R        O  8 21
     A            JRGUGR    R        O  8 24
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  19980416  154020  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 15 50)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Rapportør . . .'
     A            K1GRAP    R        O  4 18REFFLD(JRGRAP)
     A                                      COLOR(YLW)
     A                                  5  2'Varegruppe  . .'
     A            K1GVGR    R        B  5 18REFFLD(JRGVGR)
     A  31                                  ERRMSGID(JMR1010 *LIBL/QMFVADM 31)
     A  32                                  ERRMSGID(JMR1030 *LIBL/QMFVADM 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  9  2'Rapportør . . .'
     A            JRGRAP    R        O  9 18OVRDTA
     A                                 10  2'Varegruppe. . .'
     A            JRGVGR    R        O 10 18OVRDTA
     A                                 11  2'Beskrivelse . .'
     A            K1GBES        30A  O 11 18
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
