     A*%%TS  SD  20020819  134815  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  19980423  114106  HKO         REL-V3R7M0  5716-PW1
     A            B1VALG    R        B 10  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1FVGR    R        O 10  5REFFLD(JRFVGR)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020819  134727  HKO         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av mottaksfilter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Rapportør. . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2FRAP    R        O  5 31REFFLD(JRFRAP)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2RNAV    R        O  5 35REFFLD(JRNAVN)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  7  2'2=Endre  3=Kopier  4=Slett  5=Vis'
     A                                      COLOR(BLU)
     A                                  8  2'V  Varegruppe'
     A                                      COLOR(WHT)
     A            B2FVGR    R        B  9  5REFFLD(JRFVGR)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20020819  134815  HKO         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  19980423  114106  HKO         REL-V3R7M0  5716-PW1
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av mottaksfilter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Rapportør. . . . . . . . . .'
     A            C1FRAP    R        O  5 31REFFLD(JRFRAP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Varegruppe . . . . . . . . .'
     A            C1FVGR    R        B  6 31REFFLD(JRFVGR)
     A  31                                  ERRMSGID(JMR1010 *LIBL/QMFVADM 31)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  19980423  114106  HKO         REL-V3R7M0  5716-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Varegruppe finnes fra før.'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  19980423  114106  HKO         REL-V3R7M0  5716-PW1
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av mottaksfilter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Rapportør. . . . . . . . . .'
     A            C1FRAP    R        O  5 31REFFLD(JRFRAP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Varegruppe . . . . . . . . .'
     A            C1FVGR    R        O  6 31REFFLD(JRFVGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 20  2'Endret dato. . . . . . . . .'
     A            C2FEDA         6Y 0O 20 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 21  2'Endret av. . . . . . . . . .'
     A            C2FESI    R        O 21 31REFFLD(JRFESI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  19980423  114106  HKO         REL-V3R7M0  5716-PW1
     A                                      WINDOW(*DFT 15 50)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette varegruppe fra mottaksfilt-
     A                                      er '
     A                                      DSPATR(RI)
     A                                  4  2'Rapportør . . .'
     A            D1FRAP    R        O  4 18REFFLD(JRFRAP)
     A                                  5  2'Varegruppe. . .'
     A            D1FVGR    R        O  5 18REFFLD(JRFVGR)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  19980423  114106  HKO         REL-V3R7M0  5716-PW1
     A                                      WINDOW(*DFT 15 50)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Rapportør . . .'
     A            K1FRAP    R        O  4 18REFFLD(JRFRAP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Varegruppe  . .'
     A            K1FVGR    R        B  5 18REFFLD(JRFVGR)
     A  31                                  ERRMSGID(JMR1010 *LIBL/QMFVADM 31)
     A  32                                  ERRMSGID(JMR1030 *LIBL/QMFVADM 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  9  2'Rapportør . . .'
     A            JRFRAP    R        O  9 18OVRDTA
     A                                 10  2'Varegruppe. . .'
     A            JRFVGR    R        O 10 18OVRDTA
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
