     A*%%TS  SD  20020827  054502  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20020827  054502  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 60)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Vedlikehold av mottaksfilter for -
     A                                      rapportør '
     A                                      DSPATR(RI)
     A                                  4  2'Rapportør. . . . .'
     A            B1RAPP    R        O  4 21REFFLD(JRRAPP)
     A                                      COLOR(YLW)
     A            B1NAVN    R        O  4 25REFFLD(JRNAVN)
     A                                      COLOR(YLW)
     A                                  7  2'Mottaksfilteret skal inneholde de -
     A                                      varegruppene som skal'
     A                                  8  2'leses fra rapportørens vareregiste-
     A                                      r.'
     A                                 10  2'En forutsetning for å legge inn mo-
     A                                      ttaksfilter er at'
     A                                 11  2'varegruppe finnes i rapportørens r-
     A                                      ecordformat.'
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
