     A*%%TS  SD  19990823  144626  HKO         REL-V4R2M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  19990823  134736  HKO         REL-V4R2M0  5769-PW1
     A            B1STEK    R        O  4  2REFFLD(JSSTEK)
     A            B1OKOD    R        O  4 39REFFLD(JSOKOD)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  19990823  144626  HKO         REL-V4R2M0  5769-PW1
     A                                      SFLSIZ(0010)
     A                                      SFLPAG(0009)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      KEEP
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Vise søketekster '
     A                                      DSPATR(RI)
     A          R B2CMD
     A*%%TS  SD  19980308  193401  HKO         REL-V3R7M0  5716-PW1
     A                                      WINDOW(*DFT 15 40)
     A                                 14  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
