     A*%%TS  SD  20020913  124426  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20020913  124426  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 12 43)
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Oppdatering av priser og vareinfo-
     A                                      rmsjon '
     A                                      DSPATR(RI)
     A                                  4  2'Kontrolliste . . .'
     A            B1VALG    R        B  4 21REFFLD(JÅVALG)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A                                      COLOR(YLW)
     A                                  4 26'1=ja,0=nei'
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
