     A*%%TS  SD  19990823  105829  HKO         REL-V4R2M0  5769-PW1
     A*%%EC
7.xx A* 040316 bsa Endringer relatert til ny GUI
     A*---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19990823  105829  HKO         REL-V4R2M0  5769-PW1
     A*                                     WINDOW(*DFT 15 67)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Oppdatering av vareinformasjon '
     A                                      DSPATR(RI)
7.xx A                                  4  2'Leverandør . +'
7.xx A            B1LDOR    R        B  4 17REFFLD(JVLDOR)
     A  31                                  ERRMSGID(JML0010 *LIBL/QMFVADM 31)
     A  32                                  ERRMSGID(JML0020 *LIBL/QMFVADM 32)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            B1NAVN    R        O  4 32REFFLD(JLNAVN)
     A                                      COLOR(YLW)
7.xx A                                  5  2'Varegruppe . +'
     A            B1OGRP    R        B  5 17REFFLD(JVOGRP)
     A  33                                  ERRMSGID(JVG1020 *LIBL/QMFVADM 33)
     A                                      COLOR(YLW)
7.xx A                                  5 20'+'
7.xx A            B1HGRP    R        B  5 22REFFLD(JVHGRP)
     A  34                                  ERRMSGID(JVG2020 *LIBL/QMFVADM 34)
     A                                      COLOR(YLW)
7.xx A                                  5 25'+'
     A            B1UGRP    R        B  5 27REFFLD(JVUGRP)
     A  35                                  ERRMSGID(JVG0020 *LIBL/QMFVADM 35)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            B1UTXT        35A  O  5 32COLOR(YLW)
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
