     A*%%TS  SD  20140702  073609  BOF630      REL-V7R1M0  5770-WDS
     A*%%EC
7.xx A* 040316 bsa Endringer relatert til ny GUI
     A*---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20140702  073609  BOF630      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 13 60)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Filter '
     A                                      DSPATR(RI)
     A                                  4  2'Varer med feilstatus . . . . .'
     A            B1VSTS    R        B  4 33REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 0)
     A                                  4 37'1=Ja,0=Nei'
     A                                  6  2'Varer med %-endring større enn'
     A            B1ENDR         4Y 2B  6 33COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
7.xx A                                 10  2'Modul . .+'
     A            B1MODN    R        B 10 13REFFLD(JUMODN)
     A                                      COLOR(YLW)
     A            B1MTXT    R        O 10 23REFFLD(JUMTE1)
     A                                  8  2'Vise frigitte/ikke frigitte'
     A            B1KO01         1A  B  8 33COLOR(YLW)
     A                                  8 37'F / I '
     A                                 12  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
