     A*%%TS  SD  20120111  141157  BOF620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A*                                     WINDOW(*DFT 23 80)
     A          R C2BLD
     A*%%TS  SD  20120111  141157  BOF620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CA12
     A                                      CF13
     A                                      CF17
     A                                      CF19
     A                                      CA20
     A                                      CF21
     A                                      CF22
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kalkulasjon av vare'
     A                                      COLOR(WHT)
     A                                  2 38'JV145C2'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Vare . . . . . . . . .'
     A            C2VARE    R   -7   O  4 25REFFLD(JVVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2VTEK    R   -3   O  4 34REFFLD(JVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Prisgivende leverandør'
     A            C2LDOR    R        O  5 25REFFLD(JXLDOR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2NAVN    R   -3   O  5 34REFFLD(JLNAVN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Leveringstype. . . . .'
     A            C2LETY    R        O  6 25REFFLD(JPLETY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6 41'Prisdato.'
     A            C2GDAT         6Y 0O  6 51COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                  6 62'Nobbnr..'
     A            C2NOBB    R        O  6 71REFFLD(JVNOBB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Priskode . . . . . . .'
     A            C2PKOD    R        O  7 25REFFLD(JVDPKO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7 41'Prisenhet'
     A            C2PENH    R        O  7 51REFFLD(JVPENH)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7 62'Modulnr.'
     A            C2MODN    R        O  7 71REFFLD(JVMODN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8 41'Prisgr...'
     A            C2PRGR    R        O  8 51REFFLD(JCPRGR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  8 62'Varegrp.'
     A            C2OGRP    R        O  8 71REFFLD(JVOGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2HGRP    R        O  8 74REFFLD(JVHGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2UGRP    R        O  8 77REFFLD(JVUGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9 41'Nobbpris.'
     A            C2NOPR    R        O  9 51REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A                                  9  2'Betingelse:'
     A                                      DSPATR(UL)
     A            C2BLDO    R        O 10  2REFFLD(JPLDOR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2BOGR    R        O 10  9REFFLD(JPOGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2BHGR    R        O 10 12REFFLD(JPHGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2BUGR    R        O 10 15REFFLD(JPUGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2BMOD    R        O 10 19REFFLD(JPMODN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A*           JPVARE    R   -7   O 10 28REFFLD(JPVARE)
     A*                                     COLOR(YLW)
     A*                                     OVRDTA
     A            C2VTYP    R        O 10 37REFFLD(JPVTYP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2BBET    R        O 11  2REFFLD(JPBETI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 11 41'Kostpris-faktor. . . . .'
     A            C2KFAK    R        O 11 66REFFLD(JCKOFA)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Nettopris. . . . . . . .'
     A            C2NTPR         9Y 2O 12 27COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A                                 12 41'Kostpris-beløp . . . . .'
     A            C2KBEL    R        O 12 66REFFLD(JCKOBE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13  2'Innkjøpspris-faktor. . .'
     A            C2IFAK         8Y 6O 13 27COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                 15 32'Enh1'
     A            C2ENH1    R        O 16 33REFFLD(JVPENH)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2ENH2    R        O 16 48REFFLD(JVPENH)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2ENH3    R        O 16 63REFFLD(JVPENH)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 15 47'Enh2'
     A                                 15 62'Enh3'
     A                                 17  2'Nobb-pris. . . . . . . .'
     A            C2NOP1    R        O 17 27REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A            C2NOP2    R        O 17 42REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A            C2NOP3    R        O 17 57REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A                                 18  2'Innkjøpspris . . . . . .'
     A            C2INP1    R        O 18 27REFFLD(JBINPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A            C2INP2    R        O 18 42REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A            C2INP3    R        O 18 57REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A                                 20  2'Kostpris . . . . . . . .'
     A            C2KOP1    R        O 20 27REFFLD(JBKOPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A            C2KOP2    R        O 20 42REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A            C2KOP3    R        O 20 57REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A                                 22  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 14  2'GTIN-nummer  . . . . . .'
     A            C2EAN1    R        O 14 27REFFLD(JVEAN1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13 41'Frakt faktor . . . . . .'
     A            C2FFAK    R          13 66REFFLD(JCKOFA)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 19  2'Innkjøpspris 2 . . . . .'
     A            C2IN21    R          19 27REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A            C2IN22    R          19 42REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
     A            C2IN23    R          19 57REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(K)
     A                                      OVRDTA
