     A*%%TS  SD  20090827  124913  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20090827  124913  BOF610      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 13 60)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Bytte enhet EVR '
     A                                      DSPATR(RI)
     A                                  4  2'Varenr. . . . .'
     A            B1VARE    R   -7   O  4 18REFFLD(JÅVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B1TEK1    R   -5   O  4 27REFFLD(JVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Basisenhet EVR.'
     A            B1BENH    R        O  5 18REFFLD(JVPENH)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Gml. Enhet VA .'
     A            B1GENH    R        O  6 18REFFLD(JVPENH)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B1GOFA    R        O  6 34REFFLD(JWGOFA)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Bytte til Enh .'
     A            B1NENH    R        O  7 18REFFLD(JVPENH)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B1NOFA    R        O  7 34REFFLD(JWGOFA)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  6 22'Omr.faktor '
     A                                  7 22'Omr.faktor'
     A          R ASUME                     ASSUME
     A                                 24 79' '
