     A*%%TS  SD  20170326  082724  ASP_A35     REL-V7R1M0  5770-WDS
6.30 A* nho  310315  Lagt inn ny linje og flyttet på F3
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20170326  082724  ASP_A35     REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 22 70)
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Statuskoder '
     A                                      DSPATR(RI)
     A                                  3  2'1 = Mangler/ugyldig varegruppe'
     A                                  4  2'2 = Mangler knytning mot leverandø-
     A                                      r i EVR'
     A                                  5  2'3 = Mangler forpakning, statistikk-
     A                                      enhet eller'
     A                                  6  6'lagerenhet'
     A                                  7  2'4 = Pris ble ikke funnet, eller er-
     A                                       ikke valgt'
     A                                  8  2'5 = Betingelse ble ikke funnet, el-
     A                                      ler er'
     A                                  9  6'ikke valgt'
     A                                 10  2'6 = Mangler påslagsfaktorer'
     A                                 11  2'7 = Det er negativ dekning'
     A                                 12  2'8 = Varen utelates ved oppdatering'
     A                                 13  2'9 = Feil oppsto under validering a-
     A                                      v vare'
     A                                 14  2'S = Vare er utgått i VA (stat=4)'
     A                                 15  2'U = Vare har utgåttdato i VA'
     A                                 16  2'E = Enhetsfeil, men enhet kan bytt-
     A                                      es'
     A                                 17  2'O = Enhet med forskjellig omr.fakt-
     A                                        VA / EVR'
     A                                 17 49'T'
     A                                 18  2'G = En annen funnet i EVR med dett-
     A                                      e GTIN.nr '
     A                                 18 49'T'
     A                                 19  2'L = Varetype=L på et eller flere  -
     A                                      lager.    '
     A                                 20  2'H = Mangler pris/enh.hos hovedleve-
     A                                      randør.'
     A                                 21  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  3 51'LILLA'
     A                                      COLOR(PNK)
     A                                      DSPATR(RI)
     A                                  3 57'Notatark i EVR'
     A                                  5 51'P=For høy        '
     A                                  6 53'omregningsfaktor '
     A                                  8 51'X=Pakning og /eller'
     A                                  9 53'pris er utgått'
     A                                 10 51'Y=Enhet finnes på'
     A                                 11 53'ordre el.bestill.'
     A                                 13 51'GUL: logistikkvare'
     A                                      COLOR(YLW)
     A                                 14 51'BLÅ: undervare'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
