     A*%%TS  SD  20021212  123339  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20021212  123339  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 54)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Gruppebehandling '
     A                                      DSPATR(RI)
     A                                  4  2'Leverandør . . .'
     A            B1NAVN    R        O  4 19REFFLD(JLNAVN)
     A                                      COLOR(YLW)
     A                                  5  2'Prisgivende lev.'
     A            B1PNAV    R        O  5 19REFFLD(JLNAVN)
     A                                      COLOR(YLW)
     A                                  6  2'Varegruppe . . .'
     A            B1OGRP    R        O  6 19REFFLD(JVOGRP)
     A                                      COLOR(YLW)
     A            B1HGRP    R        O  6 22REFFLD(JVHGRP)
     A                                      COLOR(YLW)
     A            B1UGRP    R        O  6 25REFFLD(JVUGRP)
     A                                      COLOR(YLW)
     A            B1UTXT        25A  O  6 29COLOR(YLW)
     A                                  9  2'Holde tilbake. .'
     A            B1VALH    R        B  9 19REFFLD(JÅVALG)
     A  31                                  ERRMSGID(JM00020 *LIBL/QMFVADM 31)
     A                                      COLOR(YLW)
     A                                      VALUES(1 0)
     A                                  9 25'1=ja,0=nei'
     A                                 10  2'Frigi. . . . . .'
     A            B1VALF    R        B 10 19REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 0)
     A                                 10 25'1=ja,0=nei'
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
