     A*%%TS  SD  20081022  120121  BOF570      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20081022  102836  BOF570      REL-V5R4M0  5722-WDS
     A            B1VALG    R        B  7  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1LAGE    R        O  7  5REFFLD(FOLAGE)
     A            B1OGRP    R        O  7  8REFFLD(FROGRP)
     A            B1HGRP    R        O  7 11REFFLD(FRHGRP)
     A            B1UGRP    R        O  7 14REFFLD(FRUGRP)
     A            B1MODN    R        O  7 18REFFLD(FRMODN)
     A            B1VARE    R   -7   O  7 28REFFLD(FRVARE)
     A            B1PR1L    R        O  7 38REFFLD(FRLDOR)
     A            B1PR2L    R        O  7 48REFFLD(FRLDOR)
     A            B1PR3L    R        O  7 58REFFLD(FRLDOR)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20081022  105511  BOF570      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CF06
     A                                      CF07
     A                                      CA23
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Valg av leverandør på-
     A                                       skaffevarer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'2=Endre  3=Kopier  4=Slett  5=Vis'
     A                                      COLOR(BLU)
     A                                  6  2'V'
     A                                      COLOR(WHT)
     A                                  6  5'Lg'
     A                                      COLOR(WHT)
     A                                  6  8'Og'
     A                                      COLOR(WHT)
     A                                  6 11'Hg'
     A                                      COLOR(WHT)
     A                                  6 14'Ugr'
     A                                      COLOR(WHT)
     A                                  6 18'Modulnr'
     A                                      COLOR(WHT)
     A                                  6 28'Varenr'
     A                                      COLOR(WHT)
     A                                  6 38'Pr.lev.1'
     A                                      COLOR(WHT)
     A                                  6 48'Pr.lev.2'
     A                                      COLOR(WHT)
     A                                  6 58'Pr.lev.3'
     A                                      COLOR(WHT)
     A*           B2LAGE    R        B  7  5REFFLD(FRPRGR)
     A*                                     COLOR(YLW)
     A* 22                                  DSPATR(PC)
     A*                                     OVRDTA
     A*           B2OGRP    R        B  7  8REFFLD(FROGRP)
     A*                                     COLOR(YLW)
     A*                                     CHECK(RB)
     A*                                     OVRDTA
     A*           B2HGRP    R        B  7 11REFFLD(FRHGRP)
     A*                                     COLOR(YLW)
     A*                                     CHECK(RB)
     A*                                     OVRDTA
     A*           B2UGRP    R        B  7 14REFFLD(FRUGRP)
     A*                                     COLOR(YLW)
     A*                                     CHECK(RB)
     A*                                     OVRDTA
     A*           B2MODN    R        B  7 18REFFLD(FRMODN)
     A*                                     COLOR(YLW)
     A*                                     CHECK(RB)
     A*                                     OVRDTA
     A*           B2VARE    R   -7   B  7 28REFFLD(FRVARE)
     A*                                     COLOR(YLW)
     A*                                     CHECK(RB)
     A*                                     OVRDTA
     A*           B2PR1L    R        B  7 38REFFLD(FRLDOR)
     A*                                     COLOR(YLW)
     A*                                     CHECK(RB)
     A*                                     OVRDTA
     A*           B2PR2L    R        B  7 46REFFLD(FRLDOR)
     A*                                     CHECK(RB)
     A*                                     COLOR(YLW)
     A*                                     OVRDTA
     A*           B2PR3L    R        B  7 54REFFLD(FRLDOR)
     A*                                     CHECK(RB)
     A*                                     COLOR(YLW)
     A*                                     OVRDTA
     A          R B2CMD
     A*%%TS  SD  20031116  134741  HKO         REL-V5R2M0  5722-WDS
     A*                                23  2'F1=Filter  F3=Gå tilbake  F4=Spørr-
     A                                 23  2'F1=Filter  F3=Gå tilbake  F5=Forny-
     A                                        F6=Opprett  F7=Les inn fra Excel'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20031115  122523  HKO         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Valg av leverandør på-
     A                                       skaffevarer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Lager. . . . . . . . . . . .'
     A            C1LAGE    R        B  5 31REFFLD(FOLAGE)
     A  40                                  ERRMSGID(MLP0015 *LIBL/QMFLAGR 40)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1LTXT    R        O  5 41REFFLD(VGUTXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Varegruppe . . . . . . . . .'
     A            C1OGRP    R        B  6 31REFFLD(FROGRP)
     A  41                                  ERRMSGID(VMG1020 *LIBL/QMFOFAK 41)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1HGRP    R        B  6 34REFFLD(FRHGRP)
     A  42                                  ERRMSGID(VMG2020 *LIBL/QMFOFAK 42)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1UGRP    R        B  6 37REFFLD(FRUGRP)
     A  43                                  ERRMSGID(VMG0020 *LIBL/QMFOFAK 43)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C1GTXT    R        O  6 41REFFLD(VGUTXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Modulnr. . . . . . . . . . .'
     A            C1MODN    R        B  7 31REFFLD(FRMODN)
     A  34                                  ERRMSGID(FMR0070 *LIBL/QMFOFAK 34)
     A  45                                  ERRMSGID(VMV0800 *LIBL/QMFOFAK 45)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C1MTXT        35A  O  7 41COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Varenr . . . . . . . . . . .'
     A            C1VARE    R   -7   B  8 31REFFLD(FRVARE)
     A  35                                  ERRMSGID(FMR0080 *LIBL/QMFOFAK 35)
     A  46                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 46)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1VTXT    R        O  8 41REFFLD(VVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20011015  100400  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Kombinasjon finnes fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20081022  105511  BOF570      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      CF20
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Valg av leverandør-
     A                                       på skaffevarer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Lager. . . . . . . . . . .'
     A            C1LAGE    R        O  4 29REFFLD(FOLAGE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1LTXT    R        O  4 39REFFLD(VGUTXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Varegruppe . . . . . . . .'
     A            C1OGRP    R        O  5 29REFFLD(FROGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1HGRP    R        O  5 32REFFLD(FRHGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1UGRP    R        O  5 35REFFLD(FRUGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1GTXT    R        O  5 39REFFLD(VGUTXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Modulnr. . . . . . . . . .'
     A            C1MODN    R        O  6 29REFFLD(FRMODN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1MTXT        35A  O  6 39COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Varenr . . . . . . . . . .'
     A            C1VARE    R   -7   O  7 29REFFLD(FRVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1VTXT    R        O  7 39REFFLD(VVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Prioritert leverandør 1. .'
     A            C2PR1L    R        B 10 29REFFLD(FRLDOR)
     A  40                                  ERRMSGID(LMO0210 *LIBL/QMFLAGR 40)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C21NAV        30A  O 10 39COLOR(YLW)
     A                                      OVRDTA
     A                                 11  2'Prioritert leverandør 2. .'
     A            C2PR2L    R        B 11 29REFFLD(FRLDOR)
     A  40                                  ERRMSGID(LMO0210 *LIBL/QMFLAGR 40)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C22NAV        30A  O 11 39COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Prioritert leverandør 3. .'
     A            C2PR3L    R        B 12 29REFFLD(FRLDOR)
     A  40                                  ERRMSGID(LMO0210 *LIBL/QMFLAGR 40)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C23NAV        30A  O 12 39COLOR(YLW)
     A                                      OVRDTA
     A            C2ODAT         6Y 0O 20 48COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20 57'/'
     A            C2EDAT         6Y 0O 20 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20 68'/'
     A            C2EUSR    R        O 20 70REFFLD(FREUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake  F4=Spørring'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20031115  122812  HKO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 22 50)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette prioritert leverandør'
     A                                      DSPATR(RI)
     A                                  4  2'Lager. . . . . . .'
     A            D1LAGE    R        O  4 21REFFLD(FOLAGE)
     A            D1LTXT        25A  O  4 24
     A                                  5  2'Varegruppe . . . .'
     A            D1OGRP    R        O  5 21REFFLD(FROGRP)
     A            D1HGRP    R        O  5 24REFFLD(FRHGRP)
     A            D1UGRP    R        O  5 27REFFLD(FRUGRP)
     A            D1GTXT        20A  O  5 31
     A                                  6  2'Modulnr. . . . . .'
     A            D1MODN    R        O  6 21REFFLD(FRMODN)
     A            D1MTXT        20A  O  6 28
     A                                  7  2'Varenummer . . . .'
     A            D1VARE    R   -7   O  7 21REFFLD(FRVARE)
     A            D1VTXT        20A  O  7 30
     A                                 21  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20081022  120121  BOF570      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 22 50)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  1  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  2  2'Lager. . . . . . .'
     A            K1LAGE    R        B  2 21REFFLD(FOLAGE)
     A  40                                  ERRMSGID(LMO0210 *LIBL/QMFLAGR 40)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  3  2'Varegruppe . . . .'
     A            K1OGRP    R        B  3 21REFFLD(FROGRP)
     A  41                                  ERRMSGID(VMG1020 *LIBL/QMFOFAK 41)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            K1HGRP    R        B  3 24REFFLD(FRHGRP)
     A  42                                  ERRMSGID(VMG2020 *LIBL/QMFOFAK 42)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            K1UGRP    R        B  3 27REFFLD(FRUGRP)
     A  43                                  ERRMSGID(VMG0020 *LIBL/QMFOFAK 43)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  4  2'Modulnr. . . . . .'
     A            K1MODN    R        B  4 21REFFLD(FRMODN)
     A  34                                  ERRMSGID(FMR0070 *LIBL/QMFOFAK 34)
     A  45                                  ERRMSGID(VMV0800 *LIBL/QMFOFAK 45)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Varenummer . . . .'
     A            K1VARE    R   -7   B  5 21REFFLD(FRVARE)
     A  35                                  ERRMSGID(FMR0080 *LIBL/QMFOFAK 35)
     A  46                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 46)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A*                                 6  2'Pri leverandør 1 .'
     A*           K1PR1L    R        B  6 21REFFLD(FRLDOR)
     A* 44                                  ERRMSGID(FRL0020 *LIBL/QMFOFAK 44)
     A*                                     COLOR(YLW)
     A*                                     CHECK(RB)
     A*                                     OVRDTA
     A*                                 7  2'Pri leverandør 2 .'
     A*           K1PR2L    R        B  7 21REFFLD(FRLDOR)
     A* 44                                  ERRMSGID(FRL0020 *LIBL/QMFOFAK 44)
     A*                                     COLOR(YLW)
     A*                                     CHECK(RB)
     A*                                     OVRDTA
     A*                                 8  2'Pri leverandør 2 .'
     A*           K1PR3L    R        B  8 21REFFLD(FRLDOR)
     A* 44                                  ERRMSGID(FRL0020 *LIBL/QMFOFAK 44)
     A*                                     COLOR(YLW)
     A*                                     CHECK(RB)
     A*                                     OVRDTA
     A                                 12  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                 13  2'Lager. . . . . . .'
     A            PLLAGE    R        O 13 21REFFLD(FOLAGE)
     A                                      OVRDTA
     A                                 14  2'Varegruppe . . . .'
     A            PLOGRP    R        O 14 21REFFLD(FROGRP)
     A                                      OVRDTA
     A            PLHGRP    R        O 14 24REFFLD(FRHGRP)
     A                                      OVRDTA
     A            PLUGRP    R        O 14 27REFFLD(FRUGRP)
     A                                      OVRDTA
     A                                 15  2'Modulnr. . . . . .'
     A            PLMODN    R        O 15 21REFFLD(FRMODN)
     A                                      OVRDTA
     A                                 16  2'Varenummer . . . .'
     A            PLVARE    R        O 16 21REFFLD(FRVARE)
     A                                      OVRDTA
     A*                                17  2'Pri leverandør 1 .'
     A*           PLPR1L    R        O 17 21REFFLD(FRLDOR)
     A*                                     OVRDTA
     A*                                18  2'Pri leverandør 2 .'
     A*           PLPR2L    R        O 18 21REFFLD(FRLDOR)
     A*                                     OVRDTA
     A*                                19  2'Pri leverandør 3 .'
     A*           PLPR3L    R        O 19 21REFFLD(FRLDOR)
     A*                                     OVRDTA
     A                                 21  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R F1WIN
     A*%%TS  SD  20031116  140826  HKO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 13 58)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Filter '
     A                                      DSPATR(RI)
     A                                  4  2'Lager. . . . . . .'
     A            F1LAGE    R        B  4 21REFFLD(FOLAGE)
     A  40                                  ERRMSGID(LPM0020 *LIBL/QMFLAGR 40)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            F1LTXT        30A  O  4 24COLOR(YLW)
     A                                  5  2'Varegruppe . . . .'
     A            F1OGRP    R        B  5 21REFFLD(FROGRP)
     A  41                                  ERRMSGID(VMG1020 *LIBL/QMFOFAK 41)
     A                                      COLOR(YLW)
     A            F1HGRP    R        B  5 24REFFLD(FRHGRP)
     A  42                                  ERRMSGID(VMG2020 *LIBL/QMFOFAK 42)
     A                                      COLOR(YLW)
     A            F1UGRP    R        B  5 27REFFLD(FRUGRP)
     A  43                                  ERRMSGID(VMG0020 *LIBL/QMFOFAK 43)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            F1GTXT        20A  O  5 31COLOR(YLW)
     A                                  6  2'Leverandør . . . .'
     A            F1PR1L    R        B  6 21REFFLD(FRLDOR)
     A  44                                  ERRMSGID(LMO0210 *LIBL/QMFLAGR 44)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            F1LNAV    R        O  6 28REFFLD(FLNAVN)
     A                                      COLOR(YLW)
     A                                 12  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
