     A*%%TS  SD  20050916  084341  HKO530      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R C1WIN
     A*%%TS  SD  20050916  084341  HKO530      REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 20 72)
     A                                      CA03
     A                                      CA12
     A                                      CF13
     A                                      CF14
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            C1LVAR    R        H      REFFLD(JXLVAR)
     A            C1ENUM    R        H      REFFLD(JLENUM)
     A                                  2  2' Kalkulasjon av skaffevare '
     A                                      DSPATR(RI)
     A                                  4  2'Prisgivende leverandør .'
     A            C1LDOR    R        O  4 27REFFLD(JXLDOR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1LNAV    R        O  4 34REFFLD(JLNAVN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Betingelse:'
     A                                      DSPATR(UL)
     A                                      COLOR(GRN)
     A                                  6 44'Varenr . . . . .'
     A            C1VARE    R   -7   O  6 61REFFLD(JVVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1BLDO    R        O  7  2REFFLD(JPLDOR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1BOGR    R        O  7  9REFFLD(JPOGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1BHGR    R        O  7 12REFFLD(JPHGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1BUGR    R        O  7 15REFFLD(JPUGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1BMOD    R        O  7 19REFFLD(JPMODN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1BVAR    R   -7   O  7 28REFFLD(JPVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1BVTY    R        O  7 37REFFLD(JPVTYP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1BLET    R        O  7 39REFFLD(JPLETY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7 44'Nobbnr . . . . .'
     A            C1NOBB    R        O  7 61REFFLD(JVNOBB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1BBET    R        O  8  2REFFLD(JPBETI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8 44'Modulnr. . . . .'
     A            C1MODN    R        O  8 61REFFLD(JVMODN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Innkjøpspris-faktor. . .'
     A            C1IFAK         8Y 6B  9 27COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 10  2'Nettopris. . . . . . . .'
     A            C1NTPR    R        B 10 27REFFLD(JBINPR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A                                 10 44'Nobb-pris. . . .'
     A            C1GRPR    R        O 10 61REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A                                 11 44'Pris fra-dato. .'
     A            C1GDAT         6Y 0O 11 61COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 12  2'Påslag:'
     A                                      DSPATR(UL)
     A                                 12 44'Priskode . . . .'
     A            C1KPRI         1A  O 12 61COLOR(YLW)
     A                                      OVRDTA
     A            C1POGR    R        O 13  2REFFLD(JCOGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1PHGR    R        O 13  5REFFLD(JCHGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1PUGR    R        O 13  8REFFLD(JCUGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1PLDO    R        O 13 12REFFLD(JCLDOR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1PMOD    R        O 13 19REFFLD(JCMODN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1PVAR    R   -7   O 13 28REFFLD(JCVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1PKPR    R        O 13 37REFFLD(JCKPRI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1PVTY    R        O 13 39REFFLD(JCVTYP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1PLET    R        O 13 41REFFLD(JCLETY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14  2'Kostpris-faktor. . . . .'
     A            C1KFAK         8Y 6B 14 27COLOR(YLW)
     A  31                                  ERRMSGID(JMV0310 *LIBL/QMFVADM 31)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 14 44'Enhet. . . . . .'
     A            C1ENHE    R        O 14 61REFFLD(JWENHE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 15  2'Kostpris-beløp . . . . .'
     A            C1KBEL    R        B 15 27REFFLD(JCKOBE)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 15 44'Innkjøpspris . .'
     A            C1INPR    R        O 15 61REFFLD(JBINPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A                                 16  2'Salgspris-faktor . . . .'
     A            C1SFAK         8Y 6B 16 27COLOR(YLW)
     A  32                                  ERRMSGID(JMV0330 *LIBL/QMFVADM 32)
     A  33                                  ERRMSGID(JMV0320 *LIBL/QMFVADM 33)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 16 44'Kostpris . . . .'
     A            C1KOPR    R        O 16 61REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A                                 17 44'Salgspris. . . .'
     A            C1SAPR    R        O 17 61REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A                                 19  2'F3=Gå tilbake   F13=Velg prisgiven-
     A                                      de lev.   F14=Velg betingelse'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
