     A*%%TS  SD  20080827  120402  BOF560      REL-V5R4M0  5722-WDS
     A*%%EC
7.01 A*%%EC 011119 bof : utvidet med valg til varepris + rød farge hvis alle utg
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20050524  125346  HKO530      REL-V5R2M0  5722-WDS
     A            B1VARE    R        H      REFFLD(JVVARE)
     A            B1VALG    R        B  7  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(2 4 5 7 9 0)
7.01 A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1TEK1    R        O  7  4REFFLD(JVTEK1)
7.01 A  50                                  COLOR(RED)
     A            B1VAR8         8A  O  7 40
7.01 A  50                                  COLOR(RED)
     A            B1LNAV        14A  O  7 49
7.01 A  50                                  COLOR(RED)
     A            B1EUDA         6Y 0O  7 64EDTWRD('  .  .  ')
7.01 A  50                                  COLOR(RED)
     A            B1UDAT         6Y 0O  7 73EDTWRD('  .  .  ')
7.01 A  50                                  COLOR(RED)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20050524  125346  HKO530      REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      ROLLUP(10)
     A                                      CA01
     A                                      CA03
     A                                      CA05
     A                                      CA08
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av slettede varer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'2=Endre EVR-vare  4=Slett EVR-vare-
     A                                        5=Vis EVR-vare  7=Søketekst i EVR'
     A                                      COLOR(BLU)
     A                                  5  2'9=Vare-leverandør'
     A                                      COLOR(BLU)
     A                                  5 64'EVR      VA'
     A                                      COLOR(WHT)
     A                                  6  4'EVR Varetekst                     -
     A                                        Varenr   EVR Leverandør Utg.dato -
     A                                      Utg.dato'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20050523  153134  HKO530      REL-V5R2M0  5722-WDS
     A                                 23  2'F1=Filter  F3=Gå tilbake  F5=Forny-
     A                                        F8=Oppd.Utg.dato fra VA'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20050524  092438  HKO530      REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 15 53)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette vare fra EVR '
     A                                      DSPATR(RI)
     A                                  4  2'Varenummer. . .'
     A            D1VARE    R        O  4 18REFFLD(JVVARE)
     A  31                                  ERRMSGID(JMV0800 *LIBL/QMFVADM 31)
     A                                  5  2'Varetekst 1 . .'
     A            JVTEK1    R        O  5 18
     A                                  6  2'Varetekst 2 . .'
     A            JVTEK2    R        O  6 18
     A                                  7  2'Varegruppe. . .'
     A            JVOGRP    R        O  7 18
     A            JVHGRP    R        O  7 21
     A            JVUGRP    R        O  7 24
     A                                  8  2'Leverandør. . .'
     A            JVLDOR    R        O  8 18
     A                                  9  2'Lev. varenr.. .'
     A            JVLVAR    R        O  9 18
     A                                 10  2'Nobbnr. . . . .'
     A            JVNOBB    R        O 10 18
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1MSG
     A*%%TS  SD  20020113  222008  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 9 43)
     A                                      CA03
     A                                      CA12
     A                                      CF13
     A                                      CA23
     A                                  2  2'Beholdningstall finnes på ett elle-
     A                                      r flere'
     A                                  3  2'lagre.'
     A                                  5  2'Sletting av vare må bekreftes med -
     A                                      F23 !!'
     A                                  8  2'F3=Gå tilbake  F13=Vis lager  F23=-
     A                                      Bekreft'
     A                                      COLOR(BLU)
     A          R H1WIN
     A*%%TS  SD  20080827  101643  BOF560      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 14 50)
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A                                      PUTOVR
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  2  2'Bla alternativer'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4  2'Varer uten utgåttdato:'
     A            H1UTGD    R        B  4 28REFFLD(JÅVALG)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      VALUES(0 1)
     A                                      CHKMSGID(JM00010 *LIBL/QMFBYGG)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  4 33'1=Ja'
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R I1WIN
     A*%%TS  SD  20080827  101643  BOF560      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 8 30)
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A                                      PUTOVR
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  3  2'Vil du oppdatere Utg.dato'
     A                                      COLOR(WHT)
     A                                  4  2'i EVR med VA ?           '
     A                                      COLOR(WHT)
     A                                  5  2'Bekreft med enter        '
     A                                      COLOR(WHT)
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
