     A*%%TS  SD  20050914  204745  HKO530      REL-V5R3M0  5722-WDS
     A*%%EC
6.30  *       180515 BKV  Endret LVAR pga økt fra 15 til 20 tegn
7.xx  * 7.00  180318 bkv  Endringer reltart til ny GUI.
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  19990824  183432  HKO         REL-V4R2M0  5769-PW1
     A            B1LDOR    R        H      REFFLD(JVLDOR)
     A            B1VALG    R        B 13  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 5 6)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1TEK1    R        O 13  4REFFLD(JVTEK1)
     A            B1VARE    R   -7   O 13 40REFFLD(JVVARE)
     A            B1NOBB    R        O 13 49REFFLD(JVNOBB)
     A            B1LVAR    R   -5   O 13 58REFFLD(JVLVAR)
     A            B1NAVN         7A  O 13 74
     A*
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20050914  204745  HKO530      REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0010)
     A                                      SFLPAG(0009)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CA09
     A                                      CA12
     A                                      KEEP
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Matching mot eget vareregister'
     A                                      COLOR(WHT)
7.xx A                                  2 38'JV501B2'
7.xx A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Egen varetekst'
     A                                      COLOR(BLU)
     A            B2ETE1        35A  O  4 17COLOR(YLW)
     A                                      OVRDTA
     A                                  4 54'Leverandør.'
     A                                      COLOR(BLU)
     A            B2ELDO    R        O  4 66REFFLD(JVLDOR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2ETE2        35A  O  5 17COLOR(YLW)
     A                                      OVRDTA
     A                                  5 54'Lev.varenr.'
     A                                      COLOR(BLU)
     A            B2ELVA    R   -5   O  5 66REFFLD(JVLVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Varegruppe . .'
     A                                      COLOR(BLU)
     A            B2OGRP    R        B  6 17REFFLD(JVOGRP)
     A  31                                  ERRMSGID(JVG0100 *LIBL/QMFVADM 31)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2HGRP    R        B  6 20REFFLD(JVHGRP)
     A  32                                  ERRMSGID(JVG0110 *LIBL/QMFVADM 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2UGRP    R        B  6 23REFFLD(JVUGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  6 54'EAN-nr. . .'
     A                                      COLOR(BLU)
     A            B2EEAN    R        O  6 66REFFLD(JVEAN1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Søketekst. . .'
     A                                      COLOR(BLU)
     A            B2STEK    R        B  7 17REFFLD(JSSTEK)
     A  22                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7 54'Nobbnr. . .'
     A                                      COLOR(BLU)
     A            B2ENOB    R        O  7 66REFFLD(JVNOBB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Frisøk . . . .'
     A                                      COLOR(BLU)
     A            B2FTEK    R        B  8 17REFFLD(JSSTEK)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 11  2'1=Velg vare  5=Vis  6=Søketekster'
     A                                      COLOR(BLU)
7.xx A                                 12  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                 12  4'Varetekst'
7.xx A                                      COLOR(WHT)
7.xx A                                 12 40'Varenr'
7.xx A                                      COLOR(WHT)
7.xx A                                 12 49'Nobb-nr'
7.xx A                                      COLOR(WHT)
7.xx A                                 12 58'Lev. varenr'
7.xx A                                      COLOR(WHT)
7.xx A                                 12 74'Lev.'
7.xx A                                      COLOR(WHT)
7.xx A                                  9  4'Varetekst'
7.xx A                                      COLOR(WHT)
7.xx A                                  9 40'Varenr'
7.xx A                                      COLOR(WHT)
7.xx A                                  9 49'Nobb-nr'
7.xx A                                      COLOR(WHT)
7.xx A                                  9 58'Lev. varenr'
7.xx A                                      COLOR(WHT)
     A            B2TEK1    R        B 10  4REFFLD(JVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2VARE         8Y 0B 10 40COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B2NOBB    R        B 10 49REFFLD(JVNOBB)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B2LVAR    R        B 10 58REFFLD(JVLVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20020717  104508  HKO         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F4=Spørring   F5=F-
     A                                      orny   F9=Gjenta søk'
     A                                      COLOR(BLU)
