     A*%%TS  SD  20100512  094316  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20100512  094316  BOF610      REL-V5R4M0  5722-WDS
     A            B1VALG         1Y 0B  7  2COLOR(YLW)
     A                                      VALUES(5 6 7 8 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFBYGG)
     A                                      EDTCDE(4)
     A            B1VARE    R   -7   O  7  4REFFLD(JVVARE)
     A            B1TEK1    R  -10   O  7 13REFFLD(JVTEK1)
     A            B1BENH    R        O  7 39REFFLD(JVPENH)
     A            B1GENH    R        O  7 43REFFLD(JVPENH)
     A            B1GOFA    R   -2   O  7 48REFFLD(JWGOFA)
     A                                      EDTCDE(L)
     A            B1NENH    R        O  7 63REFFLD(JVPENH)
     A            B1NOFA    R   -2   O  7 67REFFLD(JWGOFA)
     A                                      EDTCDE(L)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20100512  094316  BOF610      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA01
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bytte enhet i EVR'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Leverandør:'
     A            B2LDOR    R        O  4 21REFFLD(JLLDOR)
     A                                      COLOR(WHT)
     A            B2LNAV        25A  O  4 32COLOR(WHT)
     A                                  5  2'5=Detaljer  6=Priser  7=Enheter  8-
     A                                      =Bytte       '
     A                                      COLOR(BLU)
     A                                  6  2'V Varenr.    Varetekst            -
     A                                       Basis Gml.Enh/Omr.fakt.  Ny Enh/Om-
     A                                      r.fakt.   '
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20090902  121907  BOF610      REL-V5R4M0  5722-WDS
     A                                 23  2'F1=Filter  F3=Gå tilbake  F5=Forny'
     A                                      COLOR(BLU)
     A                                 23 38'F8=Bytt Alle'
     A                                      COLOR(BLU)
     A          R E1WIN
     A*%%TS  SD  20090902  122715  BOF610      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 16 65)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Bytter enhet på alle'
     A                                      DSPATR(RI)
     A                                  4  2'Leverandør . . . .'
     A            E1LDOR    R        O  4 21REFFLD(JLLDOR)
     A            E1LNAV        25A  O  4 32
     A                                  6 21'Rutinen bytter enhet i alle regist-
     A                                      er '
     A                                      COLOR(RED)
     A                                  7 21'Dette kan ta svært lang tid !!!   '
     A                                      COLOR(RED)
     A                                 15  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
