     A*%%TS  SD  20030130  150140  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20030130  145417  HKO         REL-V5R1M0  5722-WDS
     A            B1VARE    R        H      REFFLD(JVVARE)
     A            B1VALG         1Y 0B  7  2COLOR(YLW)
     A                                      VALUES(5 6 7 8 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFBYGG)
     A                                      EDTCDE(4)
     A            B1TEK1    R        O  7  4REFFLD(JVTEK1)
     A            B1VAR8         8A  O  7 40
     A            B1NOBB    R        O  7 49REFFLD(JVNOBB)
     A            B1LVAR    R   -5   O  7 58REFFLD(JVLVAR)
     A            B1VGRP         7A  O  7 74
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20030130  150140  HKO         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA01
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Varer i EVR uten sortimentskode -
     A                                      i VA'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'5=Detaljer  6=Priser  7=Enheter  8-
     A                                      =Produktinfo.'
     A                                      COLOR(BLU)
     A                                  6  2'V Varetekst                       -
     A                                          Varenr   Nobbnr   Lev.varenr   -
     A                                         Varegrp'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20030130  150140  HKO         REL-V5R1M0  5722-WDS
     A                                 23  2'F1=Filter  F3=Gå tilbake  F5=Forny'
     A                                      COLOR(BLU)
