     A*%%TS  SD  20111030  104612  BOF620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20111030  104612  BOF620      REL-V7R1M0  5770-WDS
     A            B1VALG         1Y 0B  8  2COLOR(YLW)
     A                                      VALUES(5 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFBYGG)
     A                                      EDTCDE(4)
     A            B1TEK1    R        O  8 20REFFLD(JVTEK1)
     A            B1VARE    R        O  8  4REFFLD(JVVARE)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20111030  104612  BOF620      REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA01
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLFOLD(CF07)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Varer pr. leverandør'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Hovedleverandør :'
     A            B2VLDO    R        O  4 20REFFLD(JLLDOR)
     A            B2VNAV        30A  B  4 28COLOR(YLW)
     A                                  5  2'Underleverandør :'
     A            B2PLDO    R        O  5 20REFFLD(JLLDOR)
     A            B2PNAV        30A  B  5 28COLOR(YLW)
     A                                  6  2'5=Detaljer'
     A                                      COLOR(BLU)
     A                                  7  2'V Varenr.         Varetekst       '
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20030108  120256  HKO         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake  F5=Forny'
     A                                      COLOR(BLU)
