     A*%%TS  SD  20090908  134941  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20090908  121036  BOF610      REL-V5R4M0  5722-WDS
     A            B1VARE    R        H      REFFLD(JVVARE)
     A            B1NOBB    R        H      REFFLD(JVNOBB)
     A            B1LVAR    R        H      REFFLD(JVLVAR)
     A            B1SKOD    R        H      REFFLD(JVDSKO)
     A            B1VALG         2Y 0B 10  2COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      VALUES(2 3 5 6 7 8 9 10 11 15 17 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1TEK1    R   -5   O 10  5REFFLD(JVTEK1)
     A            B1NYPO        13A  O 10 36
     A            B1OGRP    R        O 10 50REFFLD(JVOGRP)
     A            B1HGRP    R        O 10 53REFFLD(JVHGRP)
     A            B1UGRP    R        O 10 56REFFLD(JVUGRP)
     A            B1EVR          1A  O 10 60
     A            B1NLEV    R        O 10 63REFFLD(JVLDOR)
     A            B1SORT    R   -8   O 10 71REFFLD(JVSORT)
     A            B1SLDO    R        O 10 75REFFLD(JVSLDO)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20090908  134941  BOF610      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0011)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA01
     A                                      CA03
     A                                      CA05
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Varer i Sortiment'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Frisøk .'
     A                                      COLOR(BLU)
     A            B2STEK    R        B  4 11REFFLD(JSSTEK)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  4 49'Lev. . .'
     A                                      COLOR(BLU)
     A            B2LDOR    R        O  4 58REFFLD(JVLDOR)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2NAVN    R  -20   O  4 66REFFLD(JLNAVN)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  5 49'Prisgiv.'
     A                                      COLOR(BLU)
     A            B2PGIV    R        O  5 58REFFLD(JVLDOR)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2PNAV    R  -20   O  5 66REFFLD(JLNAVN)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  5  2'5=Vis EVR-vare    7=Priser      8=-
     A                                      Enheter    '
     A                                      COLOR(BLU)
     A                                  6 49'Varegrp.'
     A                                      COLOR(BLU)
     A            B2OGRP    R        O  6 58REFFLD(JVOGRP)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2HGRP    R        O  6 61REFFLD(JVHGRP)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2UGRP    R        O  6 64REFFLD(JVUGRP)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  6 68'Sort.'
     A                                      COLOR(BLU)
     A            B2SORT    R   -3   O  6 74REFFLD(JVSORT)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  6  2'10=Betingelser  11=Produktinformas-
     A                                      jon'
     A                                      COLOR(BLU)
     A                                  7  2'V  Varetekst                      -
     A                                      Nobbnr   Lev. varenr          Varen-
     A                                      r'
     A                                      COLOR(WHT)
     A            B2TEK1    R   -5   B  8  5REFFLD(JVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A  80                              9 36'Nobbnr'
     A  80                                  COLOR(WHT)
     A  81                              9 36'Lev. varenr'
     A  81                                  COLOR(WHT)
     A  82                              9 36'Varenr'
     A  82                                  COLOR(WHT)
     A                                  9 50'Varegrp.'
     A                                      COLOR(WHT)
     A                                  9 59'EVR'
     A                                      COLOR(WHT)
     A                                  9 63'Prisg.'
     A                                      COLOR(WHT)
     A                                  9 71'S'
     A                                      COLOR(WHT)
     A                                  9 75'S.Lev'
     A                                      COLOR(WHT)
     A            B2NOBB    R        B  8 36REFFLD(JVNOBB)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B2LVAR    R        B  8 45REFFLD(JVLVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2VARE         8Y 0B  8 66COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                  9  5'Varetekst'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20020913  121512  HKO         REL-V5R1M0  5722-WDS
     A                                 22  2'F1=Filter   F3=Gå tilbake    F5=F-
     A                                      orny'
     A                                      COLOR(BLU)
     A                                 23  2'                                 '
     A                                      COLOR(BLU)
     A          R H1WIN
     A*%%TS  SD  20090907  131109  BOF610      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 14 50)
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A                                      PUTOVR
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  2  2'Bla alternativer'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  5  2'Sortimentskode  . . .:'
     A            H1SORT    R        B  5 25REFFLD(JVSORT)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  6  2'Varegruppe  . . . . .:'
     A            H1OGRP    R        B  6 25REFFLD(JVOGRP)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            H1HGRP    R        B  6 29REFFLD(JVHGRP)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            H1UGRP    R        B  6 33REFFLD(JVUGRP)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  7  2'Vareeier  . . . . . .:'
     A            H1LDOR    R        B  7 25REFFLD(JVLDOR)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  8  2'Prisgiver . . . . . .:'
     A            H1PGIV    R        B  8 25REFFLD(JVLDOR)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
