     A*%%TS  SD  20031014  144335  HKO         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20031014  144335  HKO         REL-V5R2M0  5722-WDS
     A*                                     WINDOW(*DFT 22 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Innlesing av NOBB integrasjonsfil-
     A                                      er '
     A                                      DSPATR(RI)
     A                                  4  2'Mappenavn . . . . .'
     A            B1FLDR        20A  B  4 22COLOR(YLW)
     A                                  5  2'Reorganiser filer .'
     A            B1REOR         1Y 0B  5 22COLOR(YLW)
     A                                  5 25'1=ja,0=nei'
     A                                  7  2'Mappen må minimum inneholde NOBB i-
     A                                      ntegrasjonsfil.'
     A                                  8  2'For å ivareta datakonsistensen anb-
     A                                      efaler vi imidlertid'
     A                                  9  2'på det sterkeste at alle integrasj-
     A                                      onsfiler ligger'
     A                                 10  2'tilgjengelig i mappen samtidig - e-
     A                                      ksportert/innlest på'
     A                                 11  2'samme dato/tidspunkt.'
     A                                 13  2'Filene skal hete:'
     A                                      COLOR(WHT)
     A                                 14  2'Integrasjonsfil:  INTEG.DAT'
     A                                 15  2'Modultekst:       MODTXT.TXT'
     A                                 16  2'Modul stikkord:   STIKKORD.TXT'
     A                                 17  2'Modul standarder: STANDARD.TXT'
     A                                 18  2'Deltakere:        DELTAKER.TXT'
     A                                 19  2'Produsenter:      PRODUSNT.TXT'
     A                                 20  2'Slettede varer:   SLETTET.TXT'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B1MSG
     A*%%TS  SD  20010904  091133  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 12 36)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Valgt mappenavn er ugyldig, filene'
     A                                  3  2'ble ikke funnet i mappen, eller du'
     A                                  4  2'mangler tilgang for behandling av'
     A                                  5  2'mapper.'
     A                                  7  2'Sjekk at filene finnes i mappen.'
     A                                  8  2'Dersom du mangler tilgang må du'
     A                                  9  2'kontakte systemansvarlig.'
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B1SBM
     A*%%TS  SD  20010207  094420  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 5 36)
     A                                      CA03
     A                                      CA12
     A                                  3  2'Jobben er sendt som bakgrunnsjobb.'
     A          R ASUME                     ASSUME
     A                                 24 79' '
