     A*%%TS  SD  20080604  154642  BOF560      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      MSGLOC(16)
     A          R G1BLD
     A*%%TS  SD  20080604  154642  BOF560      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                  1  2'  SCANNING  '
     A                                      DSPATR(RI)
     A                                  3  2'Vare ikke funnet'
     A                                  4  2'I EVR eller VA! '
     A                                  5  2'Skriv forklaring'
     A            A1TXT1        15A  B  6  2DSPATR(PC)
     A                                      COLOR(YLW)
     A            A1TXT2        15A  B  7  2COLOR(YLW)
