     A*%%TS  SD  20080922  113803  BOF560      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20080922  113803  BOF560      REL-V5R4M0  5722-WDS
     A*                                     WINDOW(*DFT 15 51)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Oppretting av vare-query-fil '
     A                                      DSPATR(RI)
     A                                  5  2'Oppretter fil for QUERY-formål som-
     A                                       inneholder'
     A                                  6  2'noe vareinformasjon og status for -
     A                                       '
     A                                  7  2'overføring.                       -
     A                                                '
     A                                 10  2'Innholdet lagres i filen: JVAQPF'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B1SBM
     A*%%TS  SD  20010207  094420  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 5 36)
     A                                      CA03
     A                                      CA12
     A                                  3  2'Jobben er sendt som bakgrunnsjobb.'
     A          R ASUME                     ASSUME
     A                                 24 79' '
