     A*%%TS  SD  20020819  152509  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20000207  185329  HKO         REL-V4R4M0  5769-PW1
     A            B1VALG    R        B  6  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1ENHE    R        O  6  4REFFLD(JWENHE)
     A            B1ETXT        35A  O  6  8
     A            B1OFAP    R        O  6 44REFFLD(JWOFAP)
     A                                      EDTCDE(M)
     A            B1PAKN    R        O  6 59REFFLD(JWPAKN)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020819  152509  HKO         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0010)
     A                                      SFLPAG(0009)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      KEEP
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Velge enhet '
     A                                      DSPATR(RI)
     A                                  4  2'1=Velg'
     A                                      COLOR(BLU)
     A                                  5  2'V Enh Beskrivelse                 -
     A                                                 Omr.fakt    Kode'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  19980603  193658  HKO         REL-V3R7M0  5716-PW1
     A                                      WINDOW(*DFT 17 63)
     A                                 16  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
