     A*%%TS  SD  20100512  103724  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20090928  141207  BOF610      REL-V5R4M0  5722-WDS
     A            B1VALG    R        B 10  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1PLDO    R        O 10  5REFFLD(JWPLDO)
     A            B1PPKL    R        O 10 13REFFLD(JWPPKL)
     A            B1PGTI    R        O 10 17REFFLD(JWPGTI)
     A            B1PBES    R        O 10 34REFFLD(JWPBES)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20100512  103724  BOF610      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A  31                                  SFLMSGID(JMZ0110 *LIBL/QMFVADM 31)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Spørring på enhet pr. prisgiver   '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenr . . . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2PVAR    R   -7   O  5 31REFFLD(JWPVAR)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2TEK1    R        O  5 41REFFLD(JVTEK1)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  6  2'Pakning  . . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2PPAK    R        O  6 31REFFLD(JWPPAK)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2ENHE    R        O  6 36REFFLD(JWENHE)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  8  2'5=Vis                            '
     A                                      COLOR(BLU)
     A                                  9  2'V  Lev.nr  PK  GTIN-nr          B'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20090929  140314  BOF610      REL-V5R4M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F5=Forny          -
     A                                         '
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20020820  115304  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Prisgiver finnes fra før.'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20090928  103825  BOF610      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'PVARadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av enhet pr. prisgiver'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenummer . . . . . . . . .'
     A            C1PVAR    R   -7   O  5 31REFFLD(JWPVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Enhetskode . . . . . . . . .'
     A            C1PPAK    R        O  6 31REFFLD(JWPPAK)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Prisgiver  . . . . . . . . .'
     A            C1PLDO    R        O  7 31REFFLD(JWPLDO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Enhet  . . . . . . . . . . .'
     A            C2ENHE    R        O  8 31REFFLD(JWENHE)
     A                                      OVRDTA
     A                                 10  2'GTIN-nr. . . . . . . . . . .'
     A            C2PGTI    R        B 10 31REFFLD(JWPGTI)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 11  2'Pakningsklasse . . . . . . .'
     A            C2PPKL    R        B 11 31REFFLD(JWPPKL)
     A                                      COLOR(YLW)
     A                                      VALUES('F' 'D' 'T' ' ')
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 12  2'Bestillbar . . . . . . . . .'
     A            C2PBES    R        B 12 31REFFLD(JWPBES)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 12 33'1=Ja,0=Nei'
     A                                 23  2'F3=Gå tilbake              '
     A                                      COLOR(BLU)
     A            C2PODA         6Y 0O 23 48COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 57'/'
     A            C2PEDA         6Y 0O 23 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 68'/'
     A            C2PEUS    R        O 23 70REFFLD(JWEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
