     A*%%TS  SD  20140401  152536  BOFBMP      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20140305  123453  BOFBMP      REL-V7R1M0  5770-WDS
     A            B1VALG    R        B 10  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(5 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1PAKN    R        O 10  4REFFLD(JWPAKN)
     A            B1ENHE    R        O 10  8REFFLD(JWENHE)
     A            B1OFAP    R        O 10 28REFFLD(JWOFAP)
     A            B1SAEN         1Y 0O 10 43
     A            B1INEN         1Y 0O 10 49
     A            B1PBEN         1Y 0O 10 55
     A            B1PSEN    R        O 10 61REFFLD(JWPSEN)
     A            B1GTIN    R        O 10 65REFFLD(JWGTIN)
     A            B1RSTS         1A  O 10 80
     A            B1OFAK    R        O 10 12REFFLD(JWOFAK)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20140401  152536  BOFBMP      REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A                                      ROLLUP(10)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise enheter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenr . . . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2VARE    R   -7   O  5 31REFFLD(JWVARE)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2TEK1    R        O  5 41REFFLD(JVTEK1)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  6  2'Prisgiver  . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2LDOR    R        O  6 31REFFLD(JWLDOR)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2LNAV    R        O  6 41REFFLD(JVTEK1)
     A                                      COLOR(BLU)
     A                                      OVRDTA
6.32 A                                  7  2' 5=Vis'
     A                                      COLOR(BLU)
     A                                  8  2'V Kod Enh     Omr.fakt      Omr.fa-
     A                                      kt   Salgs Innkj Prisb. PSE   GTIN -
     A                                               R'
     A                                      COLOR(WHT)
     A                                  9 15' volum         pris       enhet en-
     A                                      het enhet '
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  19980603  194314  HKO         REL-V3R7M0  5716-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20140305  123630  BOFBMP      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise enhet'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenummer . . . . . . . . .'
     A            C1VARE    R   -7   O  5 31REFFLD(JWVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Enhetskode . . . . . . . . .'
     A            C1PAKN    R        O  6 31REFFLD(JWPAKN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Enhet. . . . . . . . . . . .'
     A            C2ENHE    R        O  8 31REFFLD(JWENHE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2ETXT        35A  O  8 36COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Omregningsfaktor volum . . .'
     A            C2OFAK    R        O 10 31REFFLD(JWOFAK)
     A                                      COLOR(YLW)
     A                                 11  2'Omregningsfaktor pris. . . .'
     A            C2OFAP    R        O 11 31REFFLD(JWOFAP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Bredde (mm). . . . . . . . .'
     A            C2BRED    R        O 12 31REFFLD(JWBRED)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13  2'Lengde (mm). . . . . . . . .'
     A            C2LENG    R        O 13 31REFFLD(JWLENG)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14  2'Høyde. (mm). . . . . . . . .'
     A            C2HOYD    R        O 14 31REFFLD(JWHOYD)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 15  2'Vekt . (gram). . . . . . . .'
     A            C2VEKT    R        O 15 31REFFLD(JWVEKT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 16  2'Volum. (m3). . . . . . . . .'
     A            C2VOLU    R        O 16 31REFFLD(JWVOLU)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 18  2'Sammensatt av enhet. . . . .'
     A            C2PAKS    R        O 18 31REFFLD(JWPAKS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 19  2'Antall i pakning . . . . . .'
     A            C2ANTP    R        O 19 31REFFLD(JWANTP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 20  2'Overstyrt PSE. . . . . . . .'
     A            C2PSEN    R        O 20 31REFFLD(JWPSEN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 20 34'1=Ja,0=Nei'
     A                                 21  2'GTIN . . . . . . . . . . . .'
     A            C2GTIN    R        O 21 31REFFLD(JWGTIN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 22  2'Bestillbar . . . . . . . . .'
     A            C2BEST    R        O 22 31REFFLD(JWBEST)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 22 34'1=Ja,0=Nei'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            C2ODAT         6Y 0O 23 48COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 57'/'
     A            C2EDAT         6Y 0O 23 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 68'/'
     A            C2EUSR    R        O 23 70REFFLD(JWEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
