     A*%%TS  SD  20050603  094735  HKO530      REL-V5R2M0  5722-WDS
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A*        020816 bsa Endringer relatert til ny GUI
     A*
     A*---------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20050603  094735  HKO530      REL-V5R2M0  5722-WDS
     A*                                     WINDOW(*DFT 17 69)
     A                                      CA03
     A                                      CA12
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Sletting av priser for prisgivend-
     A                                      e leverandør '
     A                                      DSPATR(RI)
7.xx A                                  5  2'Prisgivende leverandør+'
7.xx A            B1PGIV    R        B  5 27REFFLD(JVLDOR)
     A  31                                  ERRMSGID(JML0010 *LIBL/QMFVADM 31)
     A  32                                  ERRMSGID(JML0020 *LIBL/QMFVADM 32)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A            B1PNAV    R   -5   O  5 35REFFLD(JLNAVN)
     A                                      COLOR(YLW)
7.xx A                                  7  2'Leverandør (vareeier) +'
7.xx A            B1LDOR    R        B  7 27REFFLD(JLLDOR)
     A  33                                  ERRMSGID(JML0020 *LIBL/QMFVADM 33)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A            B1NAVN    R   -5   O  7 35REFFLD(JLNAVN)
     A                                      COLOR(YLW)
     A                                 10  2'Dersom det kun velges prisgivende -
     A                                      leverandør slettes alle priser'
     A                                 11  2'for denne prisgivende leverandøren-
     A                                      .'
     A                                 12  2'Ved å kombinere prisgiver og lever-
     A                                      andør slettes alle priser for'
     A                                 13  2'valgt prisgivende leverandør h-
     A                                      vor valgt leverandør er vareeier.'
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
      *
     A          R ASUME                     ASSUME
     A                                 24 79' '
