     A*%%TS  SD  20160922  081652  BOF630      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20160922  081652  BOF630      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 15 54)
     A                                      CA03
     A                                      CA12
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Lister / sletter kalkulert fra pr-
     A                                      gr'
     A                                      DSPATR(RI)
     A                                  4  2'Sletter ? . . . . .'
     A            B1SLET         1A  O  4 22COLOR(YLW)
     A            B1STXT        20A  O  4 24COLOR(YLW)
     A                                  6  2'Filnavn . . . . . .'
     A            B1FILE        12A  B  6 22COLOR(YLW)
     A                                  7  2'Mappenavn (QDLS). .'
     A            B1FLDR        20A  B  7 22COLOR(YLW)
     A                                 13  2'F3=Gå tilbake '
     A                                      COLOR(BLU)
     A                                  9  2'Sjekker om det finnes kalkyle med -
     A                                          '
     A                                      COLOR(WHT)
     A                                 10  2'prisgruppe. Dersom de ikke lenger '
     A                                      COLOR(WHT)
     A                                 11  2'har kalkyle blir de listet/slettet'
     A                                      COLOR(WHT)
     A          R B1MSG
     A*%%TS  SD  20010904  091133  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 12 36)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Valgt mappenavn er ugyldig, filene'
     A                                  3  2'ble ikke funnet i mappen, eller du'
     A                                  4  2'mangler tilgang for behandling av'
     A                                  5  2'mapper.'
     A                                  7  2'Sjekk at filene finnes i mappen.'
     A                                  8  2'Dersom du mangler tilgang må du'
     A                                  9  2'kontakte systemansvarlig.'
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B1SBM
     A*%%TS  SD  20010207  094420  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 5 36)
     A                                      CA03
     A                                      CA12
     A                                  3  2'Jobben er sendt som bakgrunnsjobb.'
     A          R ASUME                     ASSUME
     A                                 24 79' '
