     A*%%TS  SD  20140930  093721  NHO630      REL-V7R1M0  5770-WDS
     A*
7.xx A*      290716 bsa Endringer relatert til ny GUI
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20140716  125147  BOF630      REL-V7R1M0  5770-WDS
     A            B1RSTS    R        H      REFFLD(JXRSTS)
     A            B1VALG    R        B 12  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(5 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1LDOR    R        O 12  4REFFLD(JXLDOR)
     A            B1LNAV    R  -12   O 12 11REFFLD(JLNAVN)
     A            B1PRIS    R        O 12 35REFFLD(JXPRIS)
     A                                      EDTCDE(M)
     A            B1GDAT         6Y 0O 12 47EDTWRD('  .  .  ')
     A            B1LVAR    R        O 12 56REFFLD(JVLLVA)
     A            B1CRDO    R        O 12 77REFFLD(JXCRDO)
     A            B1RKOD         1A  O 12 79
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20140930  093721  NHO630      REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise priser'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenummer . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2VARE    R        O  5 31REFFLD(JXVARE)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A*           B2TEK1    R        O  5 40REFFLD(JVTEK1)
     A            B2TEK1        30   O  5 48COLOR(BLU)
     A                                      OVRDTA
     A                                  6  2'Leverandør . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2NUMM    R        O  6 31REFFLD(JXLDOR)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2LNAV    R        O  6 40REFFLD(JLNAVN)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  7  2'Prisenhet. . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2ENHE    R        O  7 31REFFLD(JWENHE)
     A                                      COLOR(BLU)
     A                                      OVRDTA
7.xx A                                  8  4'Lev.nr'
7.xx A                                      COLOR(WHT)
7.xx A                                 10  2'5=Vis'
     A                                      COLOR(BLU)
7.xx A                                 11  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                 11  4'Lev.nr'
7.xx A                                      COLOR(WHT)
7.xx A                                 11 11'Navn             '
7.xx A                                      COLOR(WHT)
7.xx A                                 11 35'Nobb-pris'
7.xx A                                      COLOR(WHT)
7.xx A                                 11 48' Dato  '
7.xx A                                      COLOR(WHT)
7.xx A                                 11 56'Lev.varenr'
7.xx A                                      COLOR(WHT)
7.xx A                                 11 77'V'
7.xx A                                      COLOR(WHT)
7.xx A                                 11 80'R'
7.xx A                                      COLOR(WHT)
7.xx A**                               10  2'V Lev.nr Navn                    N-
7.xx A**                                    obb-pris    Dato      Lev.varenr.  -
7.xx A**                                          V R'
7.xx A**                                    COLOR(WHT)
7.xx A            B2LDOR    R        B  9  4REFFLD(JXLDOR)
     A  31                                  ERRMSGID(JML0010 *LIBL/QMFVADM 31)
     A  32                                  ERRMSGID(JMX0020 *LIBL/QMFVADM 32)
     A  33                                  ERRMSGID(JMX0030 *LIBL/QMFVADM 33)
     A  34                                  ERRMSGID(JML0020 *LIBL/QMFVADM 34)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  19980406  211107  HKO         REL-V3R7M0  5716-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20140716  125147  BOF630      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            C1RSTS    R        H      REFFLD(JXRSTS)
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 34'Vise Nobb-pris'
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenummer . . . . . . . . .'
     A            C1VARE    R        O  5 31REFFLD(JXVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Leverandør . . . . . . . . .'
     A            C1LDOR    R        O  6 31REFFLD(JXLDOR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Nobb-pris. . . . . . . . . .'
     A            C2PRIS    R        O  8 31REFFLD(JXPRIS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTCDE(K)
     A                                  9  2'Gyldig fra-dato. . . . . . .'
     A            C1GDAT         6Y 0O  9 31COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('  .  .  ')
     A                                 10  2'Gyldig til-dato. . . . . . .'
     A            C2TDAT         6Y 0O 10 31COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('  .  .  ')
     A                                 11  2'Gammel Nobb-pris . . . . . .'
     A            C2GPRI    R        O 11 31REFFLD(JXGPRI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTCDE(K)
     A                                 13  2'Leverandørens varenummer . .'
     A            C2LVAR    R        O 13 31REFFLD(JVLLVA)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 16  2'Valutakode . . . . . . . . .'
     A            C2VALU    R        O 16 31REFFLD(JXVALU)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 17  2'Cross-docking. . . . . . . .'
     A            C2CRDO    R        O 17 31REFFLD(JXCRDO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 17 36'1=Ja,0=Nei'
     A                                 19  2'Opprettet dato . . . . . . .'
     A            C2ODAT         6Y 0O 19 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20  2'Sist endret dato . . . . . .'
     A            C2EDAT         6Y 0O 20 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 21  2'Endret av. . . . . . . . . .'
     A            C2EUSR    R        O 21 31REFFLD(JMEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
