     A*%%TS  SD  20091124  145400  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20091124  145400  BOF610      REL-V5R4M0  5722-WDS
     A            B1RSTS    R        H      REFFLD(JXRSTS)
     A            B1VALG    R        B 12  2REFFLD(JÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFVADM)
     A            B1LDOR    R        O 12  4REFFLD(JXLDOR)
     A            B1LNAV    R   -7   O 12 11REFFLD(JLNAVN)
     A            B1ENUM    R        O 12 40REFFLD(JXLDOR)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20091124  145400  BOF610      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise gyldige leverandører'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenummer . . . . . . . . .'
     A                                      COLOR(BLU)
     A            B2VARE    R        O  5 31REFFLD(JXVARE)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2TEK1    R        O  5 40REFFLD(JVTEK1)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  9  2'1=Vel'
     A                                      COLOR(BLU)
     A                                 10  2'V Lev.nr Navn                     -
     A                                        Lev.nr EVR                       -
     A                                               '
     A                                      COLOR(WHT)
     A            B2LDOR    R        B 11  4REFFLD(JXLDOR)
     A  31                                  ERRMSGID(JML0010 *LIBL/QMFVADM 31)
     A  32                                  ERRMSGID(JMX0020 *LIBL/QMFVADM 32)
     A  33                                  ERRMSGID(JMX0030 *LIBL/QMFVADM 33)
     A  34                                  ERRMSGID(JML0020 *LIBL/QMFVADM 34)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  19980406  211107  HKO         REL-V3R7M0  5716-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
