     A*%%TS  SD  20020313  082201  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20020313  082201  HKO         REL-V5R1M0  5722-WDS
     A                                  1  2'Meny  :'
     A                                      COLOR(WHT)
     A                                  1 10'KV330'
     A                                      COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Konvertering til versjon 3.30  '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  6 27'1. ASOKON generering av DB (RASOK3-
     A                                      301F)'
     A                                  7 27'2. ASOFAK generering av DB (KVOFAK-
     A                                      _330)'
     A                                  8 27'3. ASSHOP generering av DB (KVSHOP-
     A                                      _330)'
     A                                  9 27'4. ASLAGR Generering av DB (L330GC-
     A                                      )    '
     A                                 10 27'5. ASSTAT Generering av DB (KVSTAT-
     A                                      _330)'
     A                                 12 27'6. ASTELE Generering av DB (GLV330-
     A                                      C)   '
     A                                 13 27'  (Kjører alle filgrupper)        -
     A                                           '
     A                                 15 26'90. Gå ut av systemet'
     A                                 17  2'Husk ! For de som skal benytte rad-
     A                                      ioterminal, må det bygges nummerser-
     A                                      ie med'
     A                                      COLOR(RED)
     A                                 18  9'identifiskajon  LRADIO'
     A                                      COLOR(RED)
     A                                 20  2'ASP a.s       '
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A            A1FNAV        30A  O 20 50DSPATR(UL)
     A                                      COLOR(BLU)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 20'F6=Se på meldinger'
     A                                      COLOR(BLU)
     A                                 23 43'F10=Kommando-linje'
     A                                      COLOR(BLU)
     A                                 23 66'F12=Gå tilbake'
     A                                      COLOR(BLU)
