     A*%%TS  SD  20110330  140217  NHO620      REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LA102D
     A* Beskrivelse . . : Statuskoder, spesielle koder
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       260802 ASK  Nytt program
6.20 A* 6.20  300311 NHO  Lagt inn tester om hva som er tillatt vedr
     A*                   EDI
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A1BLD
     A*%%TS  SD  20110330  140217  NHO620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Spesielle koder '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Lager/Innkjøp'
     A                                      COLOR(WHT)
6.20 A                                  5 63'EDI-test på bruker'
6.20 A                                      DSPATR(HI)
6.20 A            A1AEDS    R        B  6 63REFFLD(LAAEDS)
6.20 A                                      COLOR(YLW)
6.20 A                                  6 69'1=Ja,0=Nei'
     A            A1AMVA    R        B  8 40REFFLD(LAAMVA)
     A                                      COLOR(YLW)
     A                                  6  2'Kode for merking av bestilling  . -
     A                                      .'
     A            A1ABND    R        B  6 40REFFLD(LAABND)
     A                                      COLOR(YLW)
     A                                  6 46'J, N, X'
     A                                  7  2'Antall desimaler ved utskrift . . -
     A                                      .'
     A            A1ADES    R        B  7 40REFFLD(LAADES)
     A                                      COLOR(YLW)
     A                                  7 46'0, 1, 2, 3'
     A                                  8  2'Skal mva vises i registrering . . -
     A                                      .'
     A                                  8 46'1=Ja,0=Nei'
     A                                  9  2'Benytte bare store bokstaver  . . -
     A                                      .'
     A            A1AHOY    R        B  9 40REFFLD(LAAHOY)
     A                                      COLOR(YLW)
     A                                  9 46'1=Ja,0=Nei'
     A                                 10  2'Kontroll mot neste ordretype  . . -
     A                                      .'
     A            A1ATYK    R        B 10 40REFFLD(LAATYK)
     A                                      COLOR(YLW)
     A                                 10 46'1=Ja,0=Nei'
     A                                 11  2'Bestillingsforslag bruke statuskod-
     A                                      e'
     A            A1ABST    R        B 11 40REFFLD(LAABST)
     A                                      COLOR(YLW)
     A                                 11 46'1=Ja,0=Nei'
     A                                 12  2'Lager:'
     A                                      COLOR(WHT)
     A                                 13  2'Opdatering av lager . . . . . . . -
     A                                      .'
     A            A1ALAG    R        B 13 40REFFLD(LAALAG)
     A                                      COLOR(YLW)
     A                                 13 46'1=Ja,0=Nei'
     A                                 15  2'Fra ordre:'
     A                                      COLOR(WHT)
     A                                 16  2'Bruke kostpris som innkjøpspris . -
     A                                      .'
     A            A1AINP    R        B 16 40REFFLD(LAAENL)
     A                                      COLOR(YLW)
     A                                 16 46'1=Ja,0=Nei'
     A                                 17  2'Automatisk bestilling brukes  . . -
     A                                      .'
     A            A1ABES    R        B 17 40REFFLD(LAAABE)
     A                                      COLOR(YLW)
     A                                 17 46'1=Ja,0=Nei'
     A                                 18  2'Hovedbok:'
     A                                      COLOR(WHT)
     A                                 19  2'Spesifiser kost . . . . . . . . . -
     A                                      .'
     A            A1ASAK    R        B 19 40REFFLD(LAASAK)
     A                                      COLOR(YLW)
     A                                 19 46'1=Ja,0=Nei'
     A                                 20  2'Spesifiser rabatt1  . . . . . . . -
     A                                      .'
     A            A1ASA1    R        B 20 40REFFLD(LAASA1)
     A                                      COLOR(YLW)
     A                                 20 46'1=Ja,0=Nei'
     A                                 21  2'Spesifiser rabatt2  . . . . . . . -
     A                                      .'
     A            A1ASA2    R        B 21 40REFFLD(LAASA2)
     A                                      COLOR(YLW)
     A                                 21 46'1=Ja,0=Nei'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
