     A*%%TS  SD  20020923  114211  HKO         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LA103D
     A* Beskrivelse . . : Statuskoder, faste ordretyper
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       260802 ASK  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A1BLD
     A*%%TS  SD  20020923  114211  HKO         REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Ordre-typer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Lager/Innkjøp:'
     A                                      COLOR(WHT)
     A                                  6  2'Ordre-type for standard bestilling-
     A                                      .'
     A            A1OT02    R        B  6 38REFFLD(LAAOT2)
     A                                      COLOR(YLW)
     A                                  7  2'Ordre-type for standard pakkseddel-
     A                                      .'
     A            A1OT03    R        B  7 38REFFLD(LAAOT3)
     A                                      COLOR(YLW)
     A                                  8  2'Ordre-type for standard faktura . -
     A                                      .'
     A            A1OT04    R        B  8 38REFFLD(LAAOT4)
     A                                      COLOR(YLW)
     A                                  9  2'Ordre-type for standard kreditnota-
     A                                      .'
     A            A1OT05    R        B  9 38REFFLD(LAAOT5)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
