     A*%%TS  SD  20020923  150223  HKO         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LA710D
     A* Beskrivelse . . : Årsoppgaver, parameterinntasting
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       260802 ASK  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      CA03
     A          R B1BLD
     A*%%TS  SD  20020923  150223  HKO         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Årsrutiner - Lager'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6  2'Nullstill Hittil i år tallene . . -
     A                                      . . . . .'
     A            B1VAL1         1Y 0B  6 46CHKMSGID(LRA0010 *LIBL/QMFLAGR)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                  6 50'1=Ja,0=Nei'
     A                                  7  2'Oppdater akkumulatorer fra histori-
     A                                      sk lager.'
     A            B1VAL2         1Y 0B  7 46CHKMSGID(LRA0010 *LIBL/QMFLAGR)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                  7 50'1=Ja,0=Nei'
     A                                  8  2'Oppdater saldo pr. 01/01 felt i la-
     A                                      ger . . .'
     A            B1VAL3         1Y 0B  8 46CHKMSGID(LRA0010 *LIBL/QMFLAGR)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                  8 50'1=Ja,0=Nei'
     A                                 11  2'Oppdatering av akkumulatorer fra h-
     A                                      istorisk lager kjøres for å'
     A                                 12  2'korrigere for eventeulle bevegelse-
     A                                      r etter nullstilling'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R C1BLD
     A*%%TS  SD  20020923  150223  HKO         REL-V5R1M0  5722-WDS
     A                                      CF10
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Årsrutiner - Lager'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Kjør rutinen . . . . . . . .'
     A            C1VALG         1Y 0B  5 31CHKMSGID(LRA0010 *LIBL/QMFLAGR)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                  5 35'1=Ja,0=Nei'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F10=Jobbkø'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
