     A*%%TS  SD  20020923  114827  HKO         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LA620D
     A* Beskrivelse . . : Oppdatering av lager fra bestilling
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       260802 ASK  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20020923  114827  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 10 40)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Oppdatere lager fra bestilling '
     A                                      DSPATR(RI)
     A                                  5  2'Bekreft at jobben skal kjøres.'
     A                                  9  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
