     A*%%TS  SD  20020924  104913  HKO         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LC500D
     A* Beskrivelse . . : Batchnummer
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  190516  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*%%EC
     A                                      DSPSIZ(27 132 *WIDE)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R A1WIN
     A*%%TS  SD  20020924  104913  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 10 30)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      KEEP
     A                                      PUTOVR
     A                                  2  2' Oppgi batchnummer '
     A                                      DSPATR(RI)
7.xx A                                  5  2'Batchnummer . +'
     A            A1BATC    R        B  5 18REFFLD(LCBATC)
     A  31                                  ERRMSGID(LMC0510 *LIBL/QMFLAGR 31)
     A  32                                  ERRMSGID(LMC0520 *LIBL/QMFLAGR 32)
     A  33                                  ERRMSGID(LMC0570 *LIBL/QMFLAGR 33)
     A  34                                  ERRMSGID(LMC0550 *LIBL/QMFLAGR 34)
     A  35                                  ERRMSGID(LMC0560 *LIBL/QMFLAGR 35)
     A  36                                  ERRMSGID(LMC0550 *LIBL/QMFLAGR 36)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  9  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  9 17'F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
