     A*%%TS  SD  20021119  215143  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
7.00 A                                      DSPSIZ(24 80 *DS3 -
7.00 A                                             27 132 *WIDE)
7.00 A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R C1WIN
     A*%%TS  SD  20021119  215143  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 12 72)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Registrering/vedlikehold av tekst-
     A                                      linje '
     A                                      DSPATR(RI)
     A            C1TEXT        70A  B  4  2COLOR(YLW)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                  6  2'Linjetype . . . .'
     A            C1LTYP    R        B  6 20REFFLD(LDLTYP)
     A  31                                  ERRMSGID(FMD0100 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FMD0111 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Lev.dato. . . . .'
     A            C1LDAT         6Y 0B  8 20COLOR(YLW)
     A  33                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 33)
     A  34                                  ERRMSGID(FMD0200 *LIBL/QMFOFAK 34)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
