     A*%%TS  SD  20020313  082436  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20000224  155654  AMD         REL-V4R4M0  5769-PW1
     A            B1VALG    R        B 10  2REFFLD(FÅVALA)
     A                                      COLOR(YLW)
     A                                      VALUES('2' '5' ' ')
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1NUMM_B  R        O 10  4REFFLD(FDNUMM)
     A N33                                  COLOR(GRN)
     A  33                                  COLOR(RED)
     A*           B1SUFF_B  R        O 10 11REFFLD(FDSUFF)
     A            B1SUFF_B  R        O 10 13REFFLD(FDSUFF)
     A N33                                  COLOR(GRN)
     A  33                                  COLOR(RED)
     A*           B1OTYP_B  R        O 10 14REFFLD(FOOTYP)
     A*           B1BDAT_B       6Y 0O 10 17EDTWRD('  .  .  ')
     A*           B1LDAT_B       6Y 0O 10 26EDTWRD('  .  .  ')
     A            B1OTYP_B  R        O 10 16REFFLD(FOOTYP)
     A            B1BDAT_B       6Y 0O 10 19
     A            B1LDAT_B       6Y 0O 10 28
     A N31                                  COLOR(GRN)
     A  31                                  COLOR(RED)
     A            B1MODA_B       6Y 0O 10 35EDTWRD('  .  .  ')
     A N32                                  COLOR(GRN)
     A  32                                  COLOR(RED)
     A            B1VARE    R   -7   O 10 44REFFLD(FDVARE)
     A            B1ANTA    R   -2 03O 10 53REFFLD(FDANTA)
     A                                      EDTWRD('      ,   ')
     A            B1BDAT_O       6Y 0O 10 64EDTWRD('  .  .  ')
     A            B1LDAT_O       6Y 0O 10 73EDTWRD('  .  .  ')
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020313  082342  HKO         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise kundeordre opp mot bestilling'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  4  2'Kunde :'
     A                                      COLOR(BLU)
     A            B2KUND    R        O  4 10REFFLD(FOKUND)
     A                                      OVRDTA
     A            B2NAVN    R        O  4 20REFFLD(FONAVN)
     A                                      OVRDTA
     A            B3NAVN    R        O  4 51REFFLD(FONAVN)
     A                                      OVRDTA
     A                                  5  2'Ordre :'
     A                                      COLOR(BLU)
     A            B2NUMM    R        O  5 10REFFLD(FONUMM)
     A                                      OVRDTA
     A*           B2SUFF    R        O  5 17REFFLD(FOSUFF)
     A            B2SUFF    R        O  5 20REFFLD(FOSUFF)
     A                                      OVRDTA
     A*           B2GATE    R        O  5 20REFFLD(FOADR1)
     A            B2GATE        27A  O  5 23
     A                                      OVRDTA
     A            B3GATE    R        O  5 51REFFLD(FOADR1)
     A                                      OVRDTA
     A                                  6  2'O.type:'
     A                                      COLOR(BLU)
     A            B2OTYP    R        O  6 10REFFLD(FOOTYP)
     A                                      OVRDTA
     A            B2STED    R        O  6 20REFFLD(FOSTED)
     A                                      OVRDTA
     A            B3STED    R        O  6 51REFFLD(FOSTED)
     A                                      OVRDTA
     A                                  7  2'Kundens ref. .:'
     A                                      COLOR(BLU)
     A            B2DREF    R        O  7 20REFFLD(FODREF)
     A                                      OVRDTA
     A                                  7 51'Telefon:'
     A                                      COLOR(BLU)
     A            B2TLFN        11A  O  7 60OVRDTA
     A                                  8  2'2=Endre  5=Vis bestilling'
     A                                      COLOR(BLU)
     A*                                 9  2'V Bestnr S  OT  B.Dato   L.Dato  B-
     A                                  9  2'V Bestnr   S  OT B.Dato   L.Dato B-
     A                                      ekreft. Varenr.      Antall  O.Dato-
     A                                         L.Dato '
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20020313  082436  HKO         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F5=Forny'
     A                                      COLOR(BLU)
