     A*%%TS  SD  20020924  120222  HKO         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LE620D
     A* Beskrivelse . . : Utskrift av diversevarer - parameterinntasting
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
6.NU A* 260514 Sjekket vedr  nummerserieutvidelse
7.xx A* 7.xx  190516 bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*%%EC
     A*
     A                                      DSPSIZ(27 132 *WIDE)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      CA03
     A                                      CA12
     A          R B1BLD
     A*%%TS  SD  20020924  120222  HKO         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A                                      CF04
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av diversevarer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      COLOR(WHT)
     A                                  5  2'Seleksjonskriterier:'
     A                                      COLOR(WHT)
7.xx A                                  6 35'Fra'
7.xx A                                  6 51'Til'
7.xx A                                  7  2'Varenummer . . . . . . . . +'
     A            B1FVAR    R   -7   B  7 31REFFLD(LWVARE)
     A                                      COLOR(YLW)
     A  35                                  ERRMSGID(LSO0020 *LIBL/QMFLAGR 35)
7.xx A                                  7 47'+'
7.xx A            B1TVAR    R   -7   B  7 49REFFLD(LWVARE)
     A                                      COLOR(YLW)
     A  35                                  ERRMSGID(LSO0020 *LIBL/QMFLAGR 35)
7.xx A                                  8  2'Lagernummer. . . . . . . . +'
     A            B1FLAG    R        B  8 31REFFLD(LWHGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  37                                  ERRMSGID(LSO0050 *LIBL/QMFLAGR 37)
7.xx A                                  8 47'+'
7.xx A            B1TLAG    R        B  8 49REFFLD(LWHGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  37                                  ERRMSGID(LSO0050 *LIBL/QMFLAGR 37)
7.xx A                                  9  2'Varegruppe . . . . . . . . +'
     A            B1FOGR    R        B  9 31REFFLD(LWOGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  37                                  ERRMSGID(LSO0050 *LIBL/QMFLAGR 37)
7.xx A                                  9 34'+'
7.xx A            B1FHGR    R        B  9 36REFFLD(LWHGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  37                                  ERRMSGID(LSO0050 *LIBL/QMFLAGR 37)
7.xx A                                  9 39'+'
7.xx A            B1FUGR    R        B  9 41REFFLD(LWUGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A                                  9 47'+'
7.xx A            B1TOGR    R        B  9 49REFFLD(LWOGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  37                                  ERRMSGID(LSO0050 *LIBL/QMFLAGR 37)
7.xx A                                  9 52'+'
7.xx A            B1THGR    R        B  9 54REFFLD(LWHGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  37                                  ERRMSGID(LSO0050 *LIBL/QMFLAGR 37)
7.xx A                                  9 57'+'
7.xx A            B1TUGR    R        B  9 59REFFLD(LWUGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 11  2'Sorteringsrekkefølge . . . .'
     A            B1SORT         1Y 0B 11 31CHKMSGID(LRA0010 *LIBL/QMFLAGR)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2 3)
     A                                 11 34'1 = Lager/varenummer'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F4=Spørring'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
