     A*%%TS  SD  20040915  100429  ASK         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20040915  100429  ASK         REL-V5R2M0  5722-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Database for trelastløsningen'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  5  2'Navn  '
     A                                      COLOR(WHT)
     A                                  5  9'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  6  2'MTPAPF Pakkeinformasjon fra sagbru-
     A                                      k'
     A            A1VA01         1A  B  6 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7  2'MUPAPF Pakkehistorikk. . . . . . .'
     A            A1VA02         1A  B  7 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9  2'LWPAPF Transaksjonsfil pakkeinfo .'
     A            A1VA03         1A  B  9 39COLOR(YLW)
     A                                 21 10' Oppgi file-gruppe . . . . . . '
     A            A1FGRP         3A  B 21 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      COLOR(YLW)
     A                                 22 10' Skal register(e) nullstilles. '
     A            A1NULL         1A  B 22 43VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 22 47'(S=Slettte innhold i registre)'
     A                                 24  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
