     A*%%TS  SD  20090816  173214  ASK610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20090816  173214  ASK610      REL-V5R4M0  5722-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Database for lager og lagertelling'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  5 20'Navn'
     A                                      COLOR(WHT)
     A                                  5 27'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  6 20'LBCHPF Lagertelling-Batch-register-
     A                                      . . .'
     A            A1VA01         1A  B  6 60VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 20'LTELPF Lagertelling-Telle-register-
     A                                      . . .'
     A            A1VA02         1A  B  7 60VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 20'LBHEPF Lagertelling-bunt-hode-regi-
     A                                      ster.'
     A            A1VA03         1A  B  9 60VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 20'LBDTPF Lagertelling-bunt-linje-reg-
     A                                      ister'
     A            A1VA04         1A  B 10 60VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12 20'LSORPF Lagerutskrift hjelpe-regist-
     A                                      er. .'
     A            A1VA05         1A  B 12 60VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13 20'LPSTPF Lagertelling hjelpe-registe-
     A                                      r . .'
     A            A1VA06         1A  B 13 60VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14 20'MSTPPF Parameter for syklisk telli-
     A                                      ng. .'
     A            A1VA12         1A  B 14 60VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 16 20'LWVAPF Arbeidsfil varemottak  . . -
     A                                      . . .'
     A            A1VA11         1A  B 16 60COLOR(YLW)
     A                                 15 20'MTHHPF Håndholdt transer for telli-
     A                                      ng. .'
     A            A1VA13         1A  B 15 60VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 17 20'LWA1PF Arbeidsfil Lager . . . . . -
     A                                      . . .'
     A            A1VA08         1A  B 17 60VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 18 20'LWA2PF Arbeidsfil ABC-analyse . . -
     A                                      . . .'
     A            A1VA09         1A  B 18 60VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 19 20'LWA3PF Arbeidsfil Historisk lagerb-
     A                                      ok. .'
     A            A1VA10         1A  B 19 60VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 21 10'Oppgi file-gruppe . . . . . . .'
     A                                 21 10'Oppgi file-gruppe . . . . . . :'
     A            A1FGRP         3A  B 21 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      COLOR(YLW)
     A                                 22 10'Skal register(e) nullstilles. .'
     A            A1NULL         1A  B 22 43VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 22 47'(S=Slette innhold i register)'
     A                                 24  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 15 20'MTHHPF Håndholdt transer for telli-
     A                                      ng. .'
