     A*%%TS  SD  20101215  105913  ASK610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20101215  105913  ASK610      REL-V5R4M0  5722-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Database for håndterminalløsninger'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  5  2'Navn  '
     A                                      COLOR(WHT)
     A                                  5  9'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  5 44'Navn  '
     A                                      COLOR(WHT)
     A                                  5 51'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  6  2'HBVAPF'
     A                                  6  9'Vare til håndterminal . . . .'
     A            A1VA01         1A  B  6 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  6 44'LWHBPF'
     A                                  6 51'Ny Håndholdt Trans - Best. '
     A            A1VA02         1A  B  6 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7  2'HBVEPF'
     A                                  7  9'EAN-nr til håndterminal-PSI .'
     A            A1VA03         1A  B  7 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 44'HOHXPF'
     A                                  7 51'Hjelpefil HT ekspedisjon  '
     A            A1VA17         1A  B  7 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8  2'HBVLPF'
     A                                  8  9'Lev.vnr til håndterminal PSI.'
     A            A1VA05         1A  B  8 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9  2'HBKUPF'
     A                                  9  9'Kunder til håndterminal . . .'
     A            A1VA07         1A  B  9 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11  2'HBTEPF'
     A                                 11  9'Varetellling fra håndterminal'
     A            A1VA09         1A  B 11 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12  2'HBBEPF'
     A                                 12  9'Bestillling fra håndterminal.'
     A            A1VA11         1A  B 12 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13  2'HBTRPF'
     A                                 13  9'Ordre/eksp. fra håndterminal.'
     A            A1VA12         1A  B 13 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 15  2'HOHEPF'
     A                                 15  9'Radioterminal ordre-hode. . .'
     A            A1VA13         1A  B 15 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 16  2'HODTPF'
     A                                 16  9'Radioterminal ordre-linje . .'
     A            A1VA14         1A  B 16 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 17  2'HRTRPF'
     A                                 17  9'Radioterminal ordre-transer .'
     A            A1VA15         1A  B 17 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 18  2'LWPLPF Radioterminal plukking. . .-
     A                                       .'
     A            A1VA16         1A  B 18 39VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 21 10' Oppgi file-gruppe . . . . . . '
     A            A1FGRP         3A  B 21 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      COLOR(YLW)
     A                                 22 10' Skal register(e) nullstilles. '
     A            A1NULL         1A  B 22 43VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 22 47'(S=Slettte innhold i registre)'
     A                                 24  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
