     A*%%TS  SD  20110324  111028  BSA620      REL-V5R4M0  5722-WDS
     A*
7.01 A*  7.xx  121119 bsa Nye tabeller ifbm EDI pakkseddel
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20040915  090542  ASK         REL-V5R2M0  5722-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Database for EDI og kostpris'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  5  2'Navn  '
     A                                      COLOR(WHT)
     A                                  5  9'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  5 44'Navn  '
     A                                      COLOR(WHT)
     A                                  5 51'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  6  2'LPHOST'
     A                                  6  9'EDI pakkseddel, hode. . . .'
     A            A1VA01         1A  B  6 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  6 44'VGKPST'
     A                                  6 51'Gjsn. kostpris pr. vare . .'
     A            A1VA16         1A  B  6 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7  2'LPKOST'
     A                                  7  9'EDI pakkseddel, kollinivå .'
     A            A1VA02         1A  B  7 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  7 44'VGKTST'
     A                                  7 51'Gjsn. kostpris faktortyper.'
     A            A1VA17         1A  B  7 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                  8  2'LPKLST'
     A                                  8  9'EDI pakkseddel, linjer. . .'
     A            A1VA03         1A  B  8 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  8 44'VGKTST'
     A                                  8 51'Gjsn. kostpris faktorer . .'
     A            A1VA18         1A  B  8 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                  9  2'LPPAST'
     A                                  9  9'EDI pakkseddel, parter. . .'
     A            A1VA04         1A  B  9 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                  9 44'VGKTST'
     A                                  9 51'Gjsn. kostpris parameter. .'
     A            A1VA19         1A  B  9 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                 10  2'LLPAST'
     A                                 10  9'EDI pakkseddel, lev.info. .'
     A            A1VA05         1A  B 10 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 10 44'GJKIPF'
     A                                 10 51'Gjsn. kostpris faktorimport'
     A            A1VA20         1A  B 10 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                 11  2'LBHOST'
     A                                 11  9'EDI pakkseddel, best.hode .'
     A            A1VA06         1A  B 11 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 12  2'LBLIST'
     A                                 12  9'EDI pakkseddel, best.linjer'
     A            A1VA07         1A  B 12 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 13  2'XPHOST'
     A                                 13  9'EDI pakkseddel, stag. hode.'
     A            A1VA08         1A  B 13 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 14  2'XPKOST'
     A                                 14  9'EDI pakkseddel, stag kolli.'
     A            A1VA09         1A  B 14 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 15  2'XPKLST'
     A                                 15  9'EDI pakkseddel, stag linjer'
     A            A1VA10         1A  B 15 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 16  2'XPPAST'
     A                                 16  9'EDI pakkseddel. stag parter'
     A            A1VA11         1A  B 16 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
      *
     A                                 21 10' Oppgi file-gruppe . . . . . . '
     A            A1FGRP         3A  B 21 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      COLOR(YLW)
     A                                 22 10' Skal register(e) nullstilles. '
     A            A1NULL         1A  B 22 43VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 22 47'(S=Slettte innhold i registre)'
     A                                 24  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
