     A*%%TS  SD  20110324  111028  BSA620      REL-V5R4M0  5722-WDS
     A*
7.01 A*  7.xx  081119 bsa Nye tabeller ifbm EDI bestillingI
7.02 A*  7.xx  121119 ask Nye tabeller ifbm WINNER integrasjon
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20040915  090542  ASK         REL-V5R2M0  5722-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Database for elektronisk utvekslin-
     A                                      g'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  5  2'Navn  '
     A                                      COLOR(WHT)
     A                                  5  9'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  5 44'Navn  '
     A                                      COLOR(WHT)
     A                                  5 51'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  6  2'LWEDPF'
     A                                  6  9'EDI--transaksjonsfil. . . .'
     A            A1VA04         1A  B  6 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  6 44'LWELPF'
     A                                  6 51'EDI-bestilling loggfil. . .'
     A            A1VA22         1A  B  6 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7  2'LWERPF'
     A                                  7  9'EDI-retur arbeidsfil. . . .'
     A            A1VA06         1A  B  7 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 44'LWNOPF'
     A                                  7 51'Best lev.dør Norgros XML. .'
     A            A1VA23         1A  B  7 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 44'LTOEPF'
     A                                  8 51'Tolleransegrenser EDI . . .'
     A            A1VA24         1A  B  8 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8  2'LWEOPF EDI-retur ordrebekreftelse.'
     A            A1VA19         1A  B  8 37COLOR(YLW)
     A                                  9  2'LWEPPF EDI-retur pakkseddel. . . .'
     A            A1VA20         1A  B  9 37COLOR(YLW)
6.30 A                                  9 44'ELOGPF'
6.30 A                                  9 51'EDI loggfil . . . . . . . .'
6.30 A            A1VA25         1A  B  9 79VALUES(' ' '1')
6.30 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.30 A                                      DSPATR(PC)
6.30 A                                      COLOR(YLW)
     A                                 10  2'LWEFPF EDI-retur faktura . . . . .'
     A            A1VA21         1A  B 10 37COLOR(YLW)
7.01 A                                 10 44'EDHEPF'
7.01 A                                 10 51'EDI-ekstern ordrehode . . .'
7.01 A            A1VA07         1A  B 10 79VALUES(' ' '1')
7.01 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.01 A                                      DSPATR(PC)
7.01 A                                      COLOR(YLW)
     A                                 11  2'LEDIPF'
     A                                 11  9'EDI-melding samleretur. . .'
     A            A1VA08         1A  B 11 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
7.01 A                                 11 44'EDDTPF'
7.01 A                                 11 51'EDI-ekstern ordrelinjer . .'
7.01 A            A1VA11         1A  B 11 79VALUES(' ' '1')
7.01 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.01 A                                      DSPATR(PC)
7.01 A                                      COLOR(YLW)
7.01 A                                 12  2'LWEBPF'
7.01 A                                 12  9'EDI-retur bestilling. . . .'
7.01 A            A1VA05         1A  B 12 37VALUES(' ' '1')
7.01 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.01 A                                      DSPATR(PC)
7.01 A                                      COLOR(YLW)
7.01 A                                 12 44'EDTXPF'
7.01 A                                 12 51'EDI-ekstern ordretekst. . .'
7.01 A            A1VA12         1A  B 12 79VALUES(' ' '1')
7.01 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.01 A                                      DSPATR(PC)
7.01 A                                      COLOR(YLW)
     A                                 13  2'LWJEPF Bestilllingsfil WEBTRADE. .'
     A            A1VA02         1A  B 13 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
7.01 A                                 13 44'XOTXPF'
7.01 A                                 13 51'Bestillingsinfo tekst . . .'
7.01 A            A1VA13         1A  B 13 79VALUES(' ' '1')
7.01 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.01 A                                      DSPATR(PC)
7.01 A                                      COLOR(YLW)
     A                                 14  2'LWFRPF Bestillingsfil Farveringen.'
     A            A1VA18         1A  B 14 37COLOR(YLW)
7.02 A                                 14 44'NOWHST'
7.02 A                                 14 51'Mappingtabell Winner hode .'
7.02 A            A1VA14         1A  B 14 79VALUES(' ' '1')
7.02 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.02 A                                      DSPATR(PC)
7.02 A                                      COLOR(YLW)
     A                                 15  2'LWNEPF Bestillingsfil ELFO/NELFO .'
     A            A1VA16         1A  B 15 37COLOR(YLW)
7.02 A                                 15 44'NOWLST'
7.02 A                                 15 51'Mappingtabell Winner linjer'
7.02 A            A1VA15         1A  B 15 79VALUES(' ' '1')
7.02 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.02 A                                      DSPATR(PC)
7.02 A                                      COLOR(YLW)
     A                                 16  2'LWLOPF Bestillingsfil Løvenskiold.'
     A            A1VA17         1A  B 16 37COLOR(YLW)
7.02 A                                 16 44'NOWCST'
7.02 A                                 16 51'Mappingtabell katalog/lev.'
7.02 A            A1VA26         1A  B 16 79VALUES(' ' '1')
7.02 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.02 A                                      DSPATR(PC)
7.02 A                                      COLOR(YLW)
7.02 A                                 17 44'WIMPST'
7.02 A                                 17 51'Importfile WINNER integ.   '
7.02 A            A1VA27         1A  B 17 79VALUES(' ' '1')
7.02 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.02 A                                      DSPATR(PC)
7.02 A                                      COLOR(YLW)
     A                                 18  2'LWEXPF'
     A                                 18  9'Arbeidsfil import fra EXCEL'
     A            A1VA10         1A  B 18 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 21 10' Oppgi file-gruppe . . . . . . '
     A            A1FGRP         3A  B 21 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      COLOR(YLW)
     A                                 22 10' Skal register(e) nullstilles. '
     A            A1NULL         1A  B 22 43VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 22 47'(S=Slettte innhold i registre)'
     A                                 24  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
