     A*%%TS  SD  20120926  110702  AMD620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20120926  110702  AMD620      REL-V7R1M0  5770-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Database bestillingsforslag og pro-
     A                                      gnoser'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  5  2'Navn  '
     A                                      COLOR(WHT)
     A                                  5  9'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  5 44'Navn  '
     A                                      COLOR(WHT)
     A                                  5 51'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  6  2'MPPAPF Parameter bestillingsforsl.'
     A            A1VA01         1A  B  6 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  6 44'CINTPF Internett vare / pris (BM).'
     A            A1VA12         1A  B  6 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7  2'LFHEPF'
     A                                  7  9'Bestillingsforslag hode . .'
     A            A1VA02         1A  B  7 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 44'CVARPF Readiness varefil . . (BM).'
     A            A1VA13         1A  B  7 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8  2'LFDTPF Bestillingsforslag linje. .'
     A            A1VA03         1A  B  8 37COLOR(YLW)
     A                                  8 44'NRLXPF NIB-innlesning RELEX  (BM).'
     A            A1VA14         1A  B  8 79VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10  2'MABCPF ABC-analyse hode. . . . . .'
     A            A1VA04         1A  B 10 37COLOR(YLW)
     A                                 11  2'MABDPF'
     A                                 11  9'ABC-analyse detaljer. . . .'
     A            A1VA05         1A  B 11 37VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13  2'MPROPF Prognoseregister. . . . . .'
     A            A1VA06         1A  B 13 37COLOR(YLW)
     A                                 14  2'MPRUPF Prognose ukeregister. . . .'
     A            A1VA07         1A  B 14 37COLOR(YLW)
     A                                 15  2'LWB1PF Arbeidsregister prognose. .'
     A            A1VA08         1A  B 15 37COLOR(YLW)
     A                                 16  2'MMATPF Bestillingsparameterreg.  .'
     A            A1VA09         1A  B 16 37COLOR(YLW)
     A                                 17  2'MLTIPF Ledetid leverandører. . . .'
     A            A1VA10         1A  B 17 37COLOR(YLW)
     A                                 18  2'MPSPPF Sperre oppd. fra prognose .'
     A            A1VA11         1A  B 18 37COLOR(YLW)
     A                                 21 10' Oppgi file-gruppe . . . . . . '
     A            A1FGRP         3A  B 21 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      COLOR(YLW)
     A                                 22 10' Skal register(e) nullstilles. '
     A            A1NULL         1A  B 22 43VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 22 47'(S=Slette innhold i registre)'
     A                                 24  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
