     A*%%TS  SD  20070328  132255  ASK550      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20070328  132255  ASK550      REL-V5R4M0  5722-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Database for bestillingsrutiner'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  5  2'Navn  '
     A                                      COLOR(WHT)
     A                                  5  9'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  5 42'Navn  '
     A                                      COLOR(WHT)
     A                                  5 49'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  6  2'LOHEPF Bestillings-hode . . . . .'
     A            A1VA01         1A  B  6 36VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  6 42'LUSRPF'
     A                                  6 49'Bestilling bruker register'
     A            A1VA09         1A  B  6 76VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7  2'LODTPF Bestillings-linjer . . . .'
     A            A1VA02         1A  B  7 36VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 42'LSTSPF'
     A                                  7 49'Lager faste koder. . . . .'
     A            A1VA10         1A  B  7 76VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8  2'LOTXPF Bestillings-tekster. . . .'
     A            A1VA03         1A  B  8 36VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
6.30 A                                  8 42'LLDGPF'
6.30 A                                  8 49'Tilleggsdager. . . . . . .'
6.30 A            A1VA26         1A  B  8 76VALUES(' ' '1')
6.30 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.30 A                                      DSPATR(PC)
6.30 A                                      COLOR(YLW)
     A                                  9  2'LFTXPF Bestilling tekster faste .'
     A            A1VA04         1A  B  9 36VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 42'LPLOPF'
     A                                  9 49'Utplukk parameter. . . . .'
     A            A1VA11         1A  B  9 76VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10  2'LDELPF Bestilling slettede. . . .'
     A            A1VA05         1A  B 10 36VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 42'LPLLPF'
     A                                 10 49'Utplukk linjer . . . . . .'
     A            A1VA12         1A  B 10 76VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 42'LLDIPF'
     A                                 11 49'Leverandør-distribusjon. .'
     A            A1VA16         1A  B 11 76VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12  2'SIHEPF Inng_faktura hode. . . . .'
     A            A1VA06         1A  B 12 36VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13  2'SIDTPF Inng_faktura linjer. . . .'
     A            A1VA07         1A  B 13 36VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14  2'LLOKPF Logg koder . . . . . . . .'
     A            A1VA22         1A  B 14 36VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13 42'LPM1PF'
     A                                 13 49'Plukk-1-linje-register . .'
     A            A1VA13         1A  B 13 76VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 15  2'LLOGPF Loggfil bestillinger . . .'
     A            A1VA18         1A  B 15 36VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14 42'LPM2PF'
     A                                 14 49'Plukk-2-linje-register . .'
     A            A1VA14         1A  B 14 76VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 16  2'LOVFPF Overføring til økonomi . .'
     A            A1VA19         1A  B 16 36COLOR(YLW)
     A                                 15 42'LPSOPF'
     A                                 15 49'Plukk-S-linje-register . .'
     A            A1VA15         1A  B 15 76VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 18  2'MJLOPF Logistikkpunkt . . . . . .'
     A            A1VA08         1A  B 18 36VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 17 42'LLHEPF'
     A                                 17 49'Lager-trans-hode-register.'
     A            A1VA23         1A  B 17 76VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 19  2'MDLOPF Lagerlokasjoner. . . . . .'
     A            A1VA17         1A  B 19 36COLOR(YLW)
     A                                 18 42'LLDTPF'
     A                                 18 49'Lager-trans-linje-register'
     A            A1VA24         1A  B 18 76VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
6.20 A                                 19 42'LSBOPF'
6.20 A                                 19 49'Synkronisering best/ordre '
6.20 A            A1VA25         1A  B 19 76VALUES(' ' '1')
6.20 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.20 A                                      DSPATR(PC)
6.20 A                                      COLOR(YLW)
     A                                 21 10'Oppgi file-gruppe . . . . . . .'
     A            A1FGRP         3A  B 21 42CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      COLOR(YLW)
     A                                 22 10'Skal register(e) nullstilles. .'
     A            A1NULL         1A  B 22 42VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 22 46'(S=Slette innhold i register)'
     A                                 24  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
