     A*%%TS  SD  20020922  185216  HKO         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LI650D
     A* Beskrivelse . . : EDI, Kvalitetskotroll av grunnlagsdata
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1BLD
     A*%%TS  SD  20020922  185216  HKO         REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kontroll EDI-grunnlagsdata'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Leverandør . . . . . . . . .'
     A            B1LDOR         6Y 0B  5 31
     A  33                                  ERRMSGID(LSO0080 *LIBL/QMFLAGR 33)
     A                                      DSPATR(UL)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A            B1LTEK        30A  O  5 39
     A                                  7  2'Kontrollere betingelser. . .'
     A            B1VAL1         1Y 0B  7 31COLOR(YLW)
     A                                  7 39'1=Ja,0=Nei'
     A                                  8  2'Kontrollere distribusjon . .'
     A            B1VAL2         1Y 0B  8 31COLOR(YLW)
     A                                  8 39'1=Ja,0=Nei'
     A                                  9  2'Kontrollere vareinformasjon.'
     A            B1VAL3         1Y 0B  9 31COLOR(YLW)
     A                                  9 39'1=Ja,0=Nei'
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
