     A*%%TS  SD  20020312  222734  HKO         REL-V5R1M0  5722-WDS
     A*
6.30 A*     BSA  131217  Utvider kontroller mot kunde/leverandør
6.30 A*                  kategorier.
7.01 A*     bsa  201020  Innført F tast for vedlikehold av importregler for
7.01 A*                  EDI faktura meldinger.
     A*
     A*
     A*%%EC
7.xx A                                      DSPSIZ(24 80 *DS3 -
7.xx A                                             27 132 *WIDE)
7.XX A*                                     DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/MFRF MFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  19980128  124042  HKO         REL-V3R7M0  5716-PW1
     A                                      CA03
     A                                      CF04
7.01 A                                      CF07
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      PUTOVR
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Automatisk import og oppdatering'
     A                                      COLOR(WHT)
7.xx A                                  2 38'LI720A1'
7.xx A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
6.30 A                                  4  5'Status. . . . . . . . .'
6.30 A            A1STAT    R        B  4 31REFFLD(GGSTAT)
     A  32                                  ERRMSGID(FMB0110 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
6.30 A                                  4 33'1=Aktivert, 0=Deaktivert'
6.30 A                                  5  5'Øvre beløpsgrense . . .'
6.30 A            A1OBEL    R        B  5 31REFFLD(GGOBEL)
     A  31                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
6.30 A                                  6  5'Nedre beløpsgrense. . .'
6.30 A            A1NBEL    R        B  6 31REFFLD(GGNBEL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
6.30 A                                  7  3'Mail sendes til'
     A                                      COLOR(WHT)
6.30 A            A1MAI1    R        B  7 20REFFLD(GGMAI1)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                      OVRDTA
6.30 A            A1MAI2    R        B  8 20REFFLD(GGMAI2)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                      OVRDTA
6.30 A            A1MAI3    R        B  9 20REFFLD(GGMAI3)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                      OVRDTA
6.30 A                                 10  3'Ordlyd på mail '
     A                                      COLOR(WHT)
6.30 A            A1TXT1    R        B 10 20REFFLD(GGTXT1)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                      OVRDTA
6.30 A            A1TXT2    R        B 11 20REFFLD(GGTXT2)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                      OVRDTA
6.30 A            A1TXT3    R        B 12 20REFFLD(GGTXT3)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                      OVRDTA
6.30 A                                 13  3'Utelate kundekategorier fra beløp-
6.30 A                                      kontroll'
     A                                      COLOR(WHT)
6.30 A            A1KK01    R        B 14  4REFFLD(GGKK01)
     A  33                                  ERRMSGID(RM01110 *LIBL/QMFOKON 81)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK02    R        B 14  9REFFLD(GGKK02)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK03    R        B 14 14REFFLD(GGKK03)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK04    R        B 14 19REFFLD(GGKK04)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK05    R        B 14 24REFFLD(GGKK05)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK06    R        B 14 29REFFLD(GGKK06)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK07    R        B 14 34REFFLD(GGKK07)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK08    R        B 14 39REFFLD(GGKK08)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK09    R        B 14 44REFFLD(GGKK09)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK10    R        B 14 49REFFLD(GGKK10)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK11    R        B 15  4REFFLD(GGKK11)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK12    R        B 15  9REFFLD(GGKK12)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK13    R        B 15 14REFFLD(GGKK13)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK14    R        B 15 19REFFLD(GGKK14)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK15    R        B 15 24REFFLD(GGKK15)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A                                 16  3'Stoppe kundekategorier fra automat-
6.30 A                                      isk innlesing'
6.30 A                                      COLOR(WHT)
6.30 A            A1KK16    R        B 17  4REFFLD(GGKK16)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK17    R        B 17  9REFFLD(GGKK17)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK18    R        B 17 14REFFLD(GGKK18)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK19    R        B 17 19REFFLD(GGKK19)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK20    R        B 17 24REFFLD(GGKK20)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK21    R        B 17 29REFFLD(GGKK21)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK22    R        B 17 34REFFLD(GGKK22)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK23    R        B 17 39REFFLD(GGKK23)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK24    R        B 17 44REFFLD(GGKK24)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A            A1KK25    R        B 17 49REFFLD(GGKK25)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.30 A                                 18  3'Stoppe leverandørkategorier fra au-
6.30 A                                      tomatisk innlesing'
6.30 A                                      COLOR(WHT)
6.30 A            A1LK01    R        B 19  4REFFLD(GGLK01)
6.30 A  33                                  ERRMSGID(RM01110 *LIBL/QMFOKON 81)
6.30 A                                      COLOR(YLW)
6.30 A                                      OVRDTA
6.30 A            A1LK02    R        B 19  9REFFLD(GGLK02)
6.30 A                                      COLOR(YLW)
6.30 A                                      OVRDTA
6.30 A            A1LK03    R        B 19 14REFFLD(GGLK03)
6.30 A                                      COLOR(YLW)
6.30 A                                      OVRDTA
6.30 A            A1LK04    R        B 19 19REFFLD(GGLK04)
6.30 A                                      COLOR(YLW)
6.30 A                                      OVRDTA
6.30 A            A1LK05    R        B 19 24REFFLD(GGLK05)
6.30 A                                      COLOR(YLW)
6.30 A                                      OVRDTA
6.30 A            A1LK06    R        B 19 29REFFLD(GGLK06)
6.30 A                                      COLOR(YLW)
6.30 A                                      OVRDTA
6.30 A            A1LK07    R        B 19 34REFFLD(GGLK07)
6.30 A                                      COLOR(YLW)
6.30 A                                      OVRDTA
6.30 A            A1LK08    R        B 19 39REFFLD(GGLK08)
6.30 A                                      COLOR(YLW)
6.30 A                                      OVRDTA
6.30 A            A1LK09    R        B 19 44REFFLD(GGLK09)
6.30 A                                      COLOR(YLW)
6.30 A                                      OVRDTA
6.30 A            A1LK10    R        B 19 49REFFLD(GGLK10)
6.30 A                                      COLOR(YLW)
6.30 A                                      OVRDTA
      *
6.30 A                                 21  2'Siste FTP'
     A            A1FDAT    R        O 21 12REFFLD(GGFDAT)
     A                                      COLOR(YLW)
6.30 A            A1FTID    R        O 21 24REFFLD(GGFTID)
     A                                      COLOR(YLW)
6.30 A                                 21 35'Siste oppdatering'
6.30 A            A1UDAT    R        O 21 53REFFLD(GGUDAT)
     A                                      COLOR(YLW)
6.30 A            A1UTID    R        O 21 65REFFLD(GGUTID)
     A                                      COLOR(YLW)
6.30 A                                 22  2'Sist kjørt ferdig'
6.30 A            A1SDAT    R        O 22 20REFFLD(GGUDAT)
     A                                      COLOR(YLW)
6.30 A            A1STID    R        O 22 32REFFLD(GGUTID)
     A                                      COLOR(YLW)
      *
     A                                 23  2'F3=Gå tilbake  F4=Spørring'
7.01 A                                      COLOR(BLU)
7.01 A                                 23 30'F7=Vedlikehold av regler'
     A                                      COLOR(BLU)
