     A*%%TS  SD  20150303  140705  ASK620      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20150303  140705  ASK620      REL-V7R1M0  5770-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Nexstep/EDI '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'EDI import setup'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  3'Oppsett av automatisk innhenting a-
     A                                      v EDI (bestilling/ordrbekr/faktura)-
     A                                      '
     A                                      COLOR(BLU)
     A                                  6  3'Du må avklare med Logiq om egne ma-
     A                                      pper for hvor disse meldingene skal-
     A                                       ligge'
     A                                      COLOR(RED)
     A                                  7  3'Selve FTP oppsettet skjer i AF100C-
     A                                      '
     A                                      COLOR(RED)
     A                                  8  3'Ønsker du kun å kjøre en innlesing-
     A                                       hvor alle ligger, kan du velge kun'
     A                                  9  3'faktura.'
      *
     A                                 11 15'1. Oppsett av EDI faktura         '
     A                                 12 15'2. Oppsett av EDI ordrebekreftelse'
     A                                 13 15'3. Oppsett av EDI bestillinger'
     A
     A                                 21 24'90. Gå ut av systemet'
     A                                 22 28'Valg:'
     A            A1VALG         2Y 0B 22 34EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Tilbake'
     A                                      COLOR(BLU)
