     A*%%TS  SD  20150826  085355  ASP_X19     REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20150826  085355  ASP_X19     REL-V7R1M0  5770-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Nexstep/EDI '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'EDI import setup'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A N40N41                           5 24'EDI Faktura         '
     A                                      COLOR(WHT)
     A  40N41                           5 24'EDI ordrebekreftelse'
     A                                      COLOR(WHT)
     A  40 41                           5 24'EDI bestillinger'
     A                                      COLOR(WHT)
      *
     A                                  7  7'Denne jobben oppretter alle nødven-
     A                                      dige elementer for automatisk impor-
     A                                      t'
     A                                  8  7'av EDI meldinger. Herunder jobbes-
     A                                      krivelser, jobbkøer, legge disse in-
     A                                      n'
     A                                  9  7'i delsystem. I tillegg opprettes -
     A                                      jobb i jobbkalenderen.'
      *
     A                                 15 18'Velg filgruppe:'
     A            A1FILG         3A  B 15 34
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Tilbake'
     A                                      COLOR(BLU)
