     A*%%TS  SD  20020923  081035  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A*
     A          R B1SFL                     SFL
     A*%%TS  SD  20010724  142044  ASK         REL-V4R4M0  5769-PW1
     A            B1VALG    R        B  7  2REFFLD(LÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 0)
     A                                      CHKMSGID(LM09990 *LIBL/QMFLAGR)
     A            B1NUMM    R        O  7  5REFFLD(LJNUMM)
     A            B1REFX    R        O  7 13REFFLD(LJREFX)
     A*
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020923  081035  HKO         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CF05
     A                                      KEEP
     A                                      OVERLAY
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&WCURRN)
     A            WCURRN         5S 0H
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A                                  2  2' Velge fast bestillingstekst '
     A                                      DSPATR(RI)
     A                                  4  2'1=Velg'
     A                                      COLOR(BLU)
     A                                  5  2'V  Kode    Beskrivelse'
     A                                      COLOR(WHT)
     A            B2NUMM    R        B  6  5REFFLD(LJNUMM)
     A                                      DLTCHK
     A  31                                  ERRMSGID(LM09990 *LIBL/QMFLAGR 31)
     A  32                                  ERRMSGID(LM09990 *LIBL/QMFLAGR 32)
     A                                      COLOR(YLW)
     A            B2REFX    R        B  6 13REFFLD(LJREFX)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A          R B2CMD
     A*%%TS  SD  19940410  133324  ASP         REL-V2R3M0  5738-PW1
     A                                      WINDOW(*DFT 17 43)
     A                                      OVERLAY
     A                                 16  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 16 18'F5=Forny'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
