     A*%%TS  SD  20030603  154428  ASK         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A1BLD
     A*%%TS  SD  20030603  154428  ASK         REL-V5R2M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av ABC-analyse'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5 33'Fra'
     A                                  5 45'Til'
     A            A1FAAR         4D 0B  6 31COLOR(YLW)
     A                                      DSPATR(PC)
     A  39                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 39)
     A            A1FPER         2D 0B  6 36COLOR(YLW)
     A            A1TAAR         4D 0B  6 43COLOR(YLW)
     A            A1TPER         2D 0B  6 48COLOR(YLW)
     A                                  7  2'Varenr . . . . . . . . . . .'
     A            A1FVAR         8D 0B  7 31CHECK(RZ)
     A  30                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 30)
     A                                      COLOR(YLW)
     A            A1TVAR         8D 0B  7 43CHECK(RZ)
     A                                      COLOR(YLW)
     A                                  8  2'Lager. . . . . . . . . . . .'
     A            A1FLAG         2D 0B  8 31CHECK(RZ)
     A  31                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A            A1TLAG         2D 0B  8 43CHECK(RZ)
     A                                      COLOR(YLW)
     A                                  9  2'Varegruppe . . . . . . . . .'
     A            A1FOGR         2D 0B  9 31CHECK(RZ)
     A  32                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 32)
     A                                      COLOR(YLW)
     A            A1FHGR         2D 0B  9 34CHECK(RZ)
     A  33                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 33)
     A                                      COLOR(YLW)
     A            A1FUGR         3D 0B  9 37CHECK(RZ)
     A  34                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 34)
     A                                      COLOR(YLW)
     A            A1TOGR         2D 0B  9 43CHECK(RZ)
     A                                      COLOR(YLW)
     A            A1THGR         2D 0B  9 46CHECK(RZ)
     A                                      COLOR(YLW)
     A            A1TUGR         3D 0B  9 49CHECK(RZ)
     A                                      COLOR(YLW)
     A                                 11  2'Produktansvarlig . . . . . .'
     A            A1SAKB         4A  B 11 31
     A  38                                  ERRMSGID(LM00010 *LIBL/QMFLAGR 36)
     A                                      COLOR(YLW)
     A                                 12  2'Leverandørnummer . . . . . .'
     A            A1LVNR         6D 0B 12 31CHECK(RZ)
     A  35                                  ERRMSGID(LM06000 *LIBL/QMFLAGR 35)
     A                                      COLOR(YLW)
     A                                 14  2'Listevariant . . . . . . . .'
     A            A1SORT         1D 0B 14 31CHECK(RZ)
     A  36                                  ERRMSGID(LM00010 *LIBL/QMFLAGR 36)
     A                                      COLOR(YLW)
     A                                 14 35'1 = Pr. varenummer'
     A                                 15 35'2 = Pr. overgruppe'
     A                                 16 35'3 = Pr. over-/hovedgruppe'
     A                                 17 35'4 = Pr. over-/hoved-/undergruppe'
     A                                 19  2'Analysegrunnlag . . . . . . '
     A            A1GLAG         1D 0B 19 31CHECK(RZ)
     A  37                                  ERRMSGID(LM00010 *LIBL/QMFLAGR 37)
     A                                      COLOR(YLW)
     A                                 19 35'1 = Omsetning'
     A                                 20 35'2 = Dekningsbidrag'
     A                                 21 35'3 = Kostverdi'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F4=Spørring'
     A                                      COLOR(BLU)
     A                                  6  2'Periode (ÅÅÅÅ/MM). . . . . .'
