     A*%%TS  SD  20080115  194154  ASK560      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      CA03
     A          R A1WIN
     A*%%TS  SD  20020924  114602  ASK         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 40)
     A                                  2  2' Feilmelding '
     A                                      DSPATR(RI)
     A                                  5  2'Denne bruker kan ikke endre varety-
     A                                      per '
     A                                      COLOR(GRN)
