     A*%%TS  SD  20020922  185904  HKO         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LL840D
     A* Beskrivelse . . : Sletting av poster i lager
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       260802 ASK  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      CA03
     A                                      CF10
     A          R B1BLD
     A*%%TS  SD  20020922  185904  HKO         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Sletting av lagerposter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'OBS!!! Sletter poster på angitt la-
     A                                      ger.'
     A                                  6  3'                                  -
     A                                                                    '
     A                                  7  3'                                  -
     A                                                                       '
     A                                  8  2'Lagernummer. . . . . . . . . . . .-
     A                                       . . .'
     A            B1LAGE    R        B  8 43REFFLD(LOLAGE)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                 10  2'Slette bare hvor varetype ikke er -
     A                                      "L". .'
     A            B1VAL1         1Y 0B 10 43CHKMSGID(LRA0010 *LIBL/QMFLAGR)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                 10 48'1=Ja,0=Nei'
     A                                 11  2'Slette poster som mangler i varere-
     A                                      gister'
     A            B1VAL2         1Y 0B 11 43CHKMSGID(LRA0010 *LIBL/QMFLAGR)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                 11 48'1=Ja,0=Nei'
     A                                 12  2'Slette alle poster på angitt lager-
     A                                       . . .'
     A            B1VAL3         1Y 0B 12 43CHKMSGID(LRA0010 *LIBL/QMFLAGR)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                 12 48'1=Ja,0=Nei'
     A                                 13  2'Slette poster i historisk lagerbok-
     A                                       . . .'
     A            B1VAL4         1Y 0B 13 43CHKMSGID(LRA0010 *LIBL/QMFLAGR)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                 13 48'1=Ja,0=Nei'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F10=Jobbkø'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20010718  144627  ASK         REL-V4R4M0  5769-PW1
     A                                      CA12
     A                                      PUTOVR
     A                                      WINDOW(*DFT 11 52)
     A                                  1  2'ADVARSEL! Sletting av poster'
     A                                      COLOR(RED)
     A                                  3  2'Du har på lager'
     A                                      COLOR(WHT)
     A            D1LAGE    R        O  3 18REFFLD(LOLAGE)
     A                                      COLOR(WHT)
     A                                  3 21'valgt å slette:'
     A                                      COLOR(WHT)
     A            D1TEK1        50A  O  4  2OVRDTA
     A            D1TEK2        50A  O  5  2OVRDTA
     A            D1TEK3        50A  O  6  2OVRDTA
     A                                  8  2'Bekreft at jobben skal kjøres'
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
