     A*%%TS  SD  20030515  105823  ASK         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A1BLD
     A                                      KEEP
     A                                      CA03
     A                                      CF04
     A                                      CF10
     A                                      CA12
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
                                        2  2'Uttrekk salg- & kjøpsstatistikk'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4 33'Fra'
     A                                  4 45'Til'
     A                                  5  2'Varenr . . . . . . . . . . .'
     A            A1FVAR         8D 0B  5 31CHECK(RZ)
     A  30                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 30)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A            A1TVAR         8D 0B  5 43CHECK(RZ)
     A                                      COLOR(YLW)
     A                                  6  2'Lager. . . . . . . . . . . .'
     A            A1FLAG         2D 0B  6 31CHECK(RZ)
     A  31                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A*           A1TLAG         2D 0B  6 43CHECK(RZ)
     A*                                     COLOR(YLW)
     A                                  7  2'Avdeling . . . . . . . . . .'
     A            A1FAVD         4D 0B  7 31CHECK(RZ)
     A  44                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                  8  2'Varegruppe . . . . . . . . .'
     A            A1FOGR         2D 0B  8 31CHECK(RZ)
     A  32                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 32)
     A                                      COLOR(YLW)
     A            A1FHGR         2D 0B  8 34CHECK(RZ)
     A  33                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 33)
     A                                      COLOR(YLW)
     A            A1FUGR         3D 0B  8 37CHECK(RZ)
     A  34                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 34)
     A                                      COLOR(YLW)
     A            A1TOGR         2D 0B  8 43CHECK(RZ)
     A                                      COLOR(YLW)
     A            A1THGR         2D 0B  8 46CHECK(RZ)
     A                                      COLOR(YLW)
     A            A1TUGR         3D 0B  8 49CHECK(RZ)
     A                                      COLOR(YLW)
     A                                  9  2'Varetype . . . . . . . . . .'
     A            A1VTYP         1A  B  9 31CHECK(RZ)
     A  45                                  ERRMSGID(LM00170 *LIBL/QMFLAGR 32)
     A                                      COLOR(YLW)
     A                                  9 35'(L/S/D, blank=alle)'
     A                                 10  2'Periode frem til . . . . . .'
     A            A1SLAR         4D 0B 10 31CHECK(RZ)
     A  41                                  ERRMSGID(LM00011 *LIBL/QMFLAGR 35)
     A                                      COLOR(YLW)
     A            A1SLMN         2D 0B 10 36CHECK(RZ)
     A  42                                  ERRMSGID(LM00011 *LIBL/QMFLAGR 35)
     A                                      COLOR(YLW)
     A                                 10 40'-'
     A            A1PAAR         1D 0B 10 43CHECK(RZ)
     A  43                                  ERRMSGID(LM00011 *LIBL/QMFLAGR 35)
     A                                      COLOR(YLW)
     A                                 10 45'år'
     A                                 12  2'Vise antall eller beløp. . .'
     A            A1ANBL         1D 0B 12 31CHECK(RZ)
     A  35                                  ERRMSGID(LM00011 *LIBL/QMFLAGR 35)
     A                                      COLOR(YLW)
     A                                 12 35'1=Beløp,0=Antall'
     A                                 13  2'Vise kjøpsstatistikk . . . .'
     A            A1KJOP         1D 0B 13 31CHECK(RZ)
     A  36                                  ERRMSGID(LM00011 *LIBL/QMFLAGR 36)
     A                                      COLOR(YLW)
     A                                 13 35'1=Ja,0=Nei'
     A                                 14  2'Vise varer uten bevegelse. .'
     A            A1SNUL         1D 0B 14 31CHECK(RZ)
     A  37                                  ERRMSGID(LM00011 *LIBL/QMFLAGR 37)
     A                                      COLOR(YLW)
     A                                 14 35'1=Ja,0=Nei'
     A                                 16  2'Blank linje pr. varelinje. .'
     A            A1BLAN         1D 0B 16 31CHECK(RZ)
     A  38                                  ERRMSGID(LM00011 *LIBL/QMFLAGR 38)
     A                                      COLOR(YLW)
     A                                 16 35'1=Ja,0=Nei'
     A                                 18  2'PC-mappe/folder/katalog. . .'
     A            A1MAPP        10A  B 18 31CHECK(LC)
     A  39                                  ERRMSGID(LM00011 *LIBL/QMFLAGR 39)
     A                                      COLOR(YLW)
     A                                 18 42'Filen lagres i denne katalogen'
     A                                 19  2'Filnavn. . . . . . . . . . .'
     A            A1FILN        10A  B 19 31CHECK(LC)
     A  40                                  ERRMSGID(LM00011 *LIBL/QMFLAGR 40)
     A                                      COLOR(YLW)
     A                                 19 42'Filen lagres med dette navnet'
     A                                 21  1'* Filen åpnes i Excel - husk å ang-
     A                                      i at SEMIKOLON er skilletegn'
     A                                      COLOR(BLU)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F4=Spørring'
     A                                      COLOR(BLU)
     A                                 23 32'F10=Batch'
     A                                      COLOR(BLU)
