     A*%%TS  SD  20051025  141544  GRO550      REL-V5R3M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LM10
     A* Beskrivelse . . : Bestilling/Innkjøp
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  020316  bsa  Justeringer basert på ny GUI og regler
7.01 A* 7.01  241120  bsa  Fjernet overgang til Multisupport meny
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20051025  141544  GRO550      REL-V5R3M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bestilling/Innkjøp'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5 27'Bestillinger'
     A                                      COLOR(WHT)
     A                                  6 27'1. Registrering av bestillinger'
     A                                  7 27'2. Utskrift av kontroll'
     A                                  8 27'3. Overføring til økonomi'
     A                                  9 27'4. Spørring på ikke-bekreftede bes-
     A                                      tillinger'
     A                                 11 27'Viderebehandling'
     A                                      COLOR(WHT)
7.01 A**                               12 27'5. Inngående faktura med scanning'
     A                                 13 27'6.'
     A                                 13 30'EDI Mottaksrutiner'
     A                                 14 27'7. Spørring på inngående faktura'
     A                                 15 27'8. Utskrift av faktura-kopi '
     A                                 17 27'Registeroppgaver'
     A                                      COLOR(WHT)
     A                                 18 27'21. Vedlikehold av faste registre'
     A                                 19 27'90. Gå ut av systemet'
7.xx A                                 20 30'Valg:'
7.xx A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 18'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 31'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 47'F6=Meldinger'
     A                                      COLOR(BLU)
7.xx A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
