     A*%%TS  SD  20160329  143311  ASP_G0X     REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LM19
     A* Beskrivelse . . : Bestilling/Innkjøp
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20160329  143311  ASP_G0X     REL-V7R1M0  5770-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Hovedmeny kjedekontor'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  5'Daglig drift'
     A                                      COLOR(WHT)
     A                                  6  4'1. Behandle EDI-meldinger'
     A                                  5 46'Spørringer'
     A                                      COLOR(WHT)
     A                                 20 27'90. Gå ut av systemet'
     A                                 21 30'Valg:'
     A            VALG           2Y 0B 21 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23 31'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 47'F6=Meldinger'
     A                                      COLOR(BLU)
7.xx A                                 23 61'F10=Kommando-linje'
7.xx A                                      COLOR(BLU)
     A                                  7  4'2. Ordre system'
     A                                  6 44'20. Spørring på kunder'
     A                                  7 44'21. Spørring på leverandører'
     A                                  8 44'22. Spørring på salgsfaktura'
     A                                  9  4'4. Regnskaps oppdateringer'
     A                                  8  4'3. Innkjøps system'
     A                                  9 44'23. Spørring på innkjøpsfaktura'
     A                                 10  4'5. Hovedmeny regnskap'
     A                                 11  4'6. EDI overføring til Logiq'
     A                                 12  4'7. Dagsoppgjør kasse'
     A                                 13  4'8. Øredifferanse liste'
     A                                 16  3'19. Andre funksjoner'
     A                                 10 44'24. Spørring på varer'
