     A*%%TS  SD  20030106  203059  ASK         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LM20
     A* Beskrivelse . . : Varemottak
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  220316  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20030106  203059  ASK         REL-V5R1M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Varemottak'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5 23'Registrering'
     A                                      COLOR(WHT)
     A                                  6 24'1. Varemottak med bestilling'
     A                                  7 24'2. Varemottak uten bestilling'
     A                                  8 24'3. Spørring på vareregister'
     A                                 10 23'Utskrifter'
     A                                      COLOR(WHT)
     A                                 11 24'5. Spørring/utskrift - ikke mottat-
     A                                      te varer'
     A                                 12 24'6. Etiketter'
     A                                 14 23'Registeroppgaver'
     A                                      COLOR(WHT)
     A                                 15 23'20. Vedlikehold av faste registre'
     A                                 18 23'90. Gå ut av systemet'
7.xx A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 18'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 31'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 47'F6=Meldinger'
     A                                      COLOR(BLU)
7.xx A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
