     A*%%TS  SD  20080528  102224  ASK560      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LM40
     A* Beskrivelse . . : Lager
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  190516  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A                                      CA22(22 'F12=Info')
     A          R A1MNU
     A*%%TS  SD  20080528  102224  ASK560      REL-V5R4M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Lager'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  5'Registrering'
     A                                      COLOR(WHT)
     A                                  5 45'Utskrift'
     A                                      COLOR(WHT)
     A                                  6  5'1. Lagertransaksjoner'
     A                                  6 45'11. Varebeholdnings-liste'
     A                                  7  5'2. Lagertelling'
     A                                  7 45'12. Lagerverdi-liste'
     A                                  9  5'Spørring'
     A                                      COLOR(WHT)
     A                                 10  5'3. Mot lager'
     A                                  8 45'13. Varebevegelser'
     A                                 11  5'4. Mot historisk lagerbok'
     A                                  9 45'14. Over/under min/max beholdning'
     A                                 10 45'15. Lager-register'
     A                                 11 45'16. Historisk lagerbok'
     A                                 12 45'17. Hyllevarmere'
     A                                 14  5'Registeroppgaver'
     A                                      COLOR(WHT)
     A                                 13 45'18. Omløpshastighet'
     A                                 16  5'21. Vedlikehold av faste registre'
     A                                 18 26'90. Gå ut av systemet    '
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 18'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 31'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 47'F6=Meldinger'
     A                                      COLOR(BLU)
7.xx A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
     A                                 15  5'20. ABC Analyse'
     A                                 14 45'19. Utskrift av ABC Analyse'
