     A*%%TS  SD  20070329  091323  ASK550      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LM71
     A* Beskrivelse . . : Statuskoder
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  160316  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20070329  091323  ASK550      REL-V5R4M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Statuskoder'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6  3'Vedlikehold av:'
     A                                      COLOR(WHT)
     A                                  6 45'Vedlikehold av:'
     A                                      COLOR(WHT)
     A                                  7  3'1. Generelle systemverdier'
     A                                  7 45'11. Ordre typer'
     A                                  8  3'2. Spesielle koder'
     A                                  8 45'12. Linjetyper'
     A                                  9  3'3. Faste ordretyper'
     A                                 10  3'4. Lager koder'
     A                                 10 45'14. Enheter'
     A                                 11 45'15. Varetyper'
     A                                 12 45'16. Leveringstyper'
     A                                 18 27'90. Gå ut av systemet    '
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 18'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 31'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 47'F6=Meldinger'
     A                                      COLOR(BLU)
7.xx A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
     A                                 11  3'5. Toleransegrenser/EDI'
     A                                 12  3'6. Legge inn loggkoder'
