     A*%%TS  SD  20050909  122152  GRO540      REL-V5R3M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LM80
     A* Beskrivelse . . : Diverseoppgaver
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.01 A* 7.01  241120  bsa  Fjernet Multisupport menypunkter.
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20050909  122152  GRO540      REL-V5R3M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Diverseoppgaver'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Oppdateringsrutiner'
     A                                      COLOR(WHT)
     A                                  5 46'Kontrollrutiner'
     A                                      COLOR(WHT)
     A                                  6  2'1. Oppdatere bestillingslinjer'
     A                                  6 46'10. Lagerkontrolliste'
     A                                  7  2'2. Oppdatere lager fra bestilling'
     A                                  7 46'11. EDI Kvalitetskontroll'
     A                                  8  2'3. Oppdatere lager fra lagerbok'
     A                                  8 46'12. Statistikk til EXCEL'
     A                                 10  2'Sletterutiner'
     A                                      COLOR(WHT)
7.01 A**                               10 46'Multisupport'
7.01 A**                                    COLOR(WHT)
     A                                 11  2'5. Sletting av poster i lager  '
7.01 A**                               11 46'31. Danner MLTARXCxxx-registre'
     A                                 12  2'6. Sletting av bestillinger'
7.01 A**                               12 46'32. Setter opp overføringsjobb'
7.01 A**                               13 46'33. Sletter poster ACCPOSPA'
     A                                 14  2'Årsrutiner'
     A                                      COLOR(WHT)
     A                                 15  2'20. Nullstilling av Hittil I År'
     A  41                             15 46'40. Innlesing lagerinfo. CSV'
     A  41                             16 46'41. Innlesing lagerplass'
     A  41                             17 46'42. Innlesing lagerlokasjoner'
     A                                 18 27'90. Gå ut av systemet    '
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 18'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 31'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 47'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
