     A*%%TS  SD  20040915  092839  ASK         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LM99
     A* Beskrivelse . . : Databasegenerering
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.01 A* 7.00  121119 bsa  Ny meny for opprette tabeller
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20040915  092839  ASK         REL-V5R2M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Databasegenerering'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6 27'Generering'
     A                                      COLOR(WHT)
     A                                  7 27'1. Database for bestilling/innkjøp'
     A                                  8 27'2. Database for lager og lagertell-
     A                                      ing'
     A                                  9 27'3. Database for håndterminalløsnin-
     A                                      ger'
     A                                 10 27'4. Database for elektronisk utveks-
     A                                      ling'
     A                                 15 27'Installasjon'
     A                                      COLOR(WHT)
     A                                 16 27'9. Legge inn std. installasjonsver-
     A                                      dier'
     A                                 18 26'90. Gå ut av systemet    '
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 18'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 31'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 47'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 62'F10=Kommando-linje'
     A                                      COLOR(BLU)
     A                                 11 27'5. Database for trelastløsningen'
     A                                 12 27'6. Database for bestillingsforslag-
     A                                       og prognoser'
     A                                 13 27'7. Database for Rapport&Analyse La-
     A                                      ger         '
     A                                 14 27'8. Database for EDI og kostpris'
      *
