     A*%%TS  SD  19961124  194851  KRKRI       REL-V3R1M0  5763-PW1
     A*%%EC
6.NU A* 280514 bof : endring mtp nummerutvidelse
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R D1BLD
     A*%%TS  SD  19961124  194851  KRKRI       REL-V3R1M0  5763-PW1
     A                                      WINDOW(*DFT 8 60)
     A                                      CA03
     A                                      CF04
     A                                      KEEP
     A                                      PUTOVR
     A                                  2  2'Bestillingsopplysninger for best n-
     A                                      r.'
     A            D1NUMM    R        O  2 40REFFLD(LONUMM)
     A            D1SUFF    R        O  2 50REFFLD(LOSUFF)
     A                                  4  2'Bilagsnr'
     A                                  4 12'Faktura-dato'
     A                                  4 26'Forfalls-dato'
     A                                  4 43'Faktura-beløp'
     A            D1BINR    R        B  5  2REFFLD(LOBINR)
     A  31                                  ERRMSGID(LSO0260 *LIBL/QMFLAGR 31)
     A  34                                  ERRMSGID(LSO0420 *LIBL/QMFLAGR 34)
     A  35                                  ERRMSGID(LSO0430 *LIBL/QMFLAGR 35)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            D1FKDA         6Y 0B  5 12
     A  32                                  ERRMSGID(LSO0240 *LIBL/QMFLAGR 32)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTWRD('      ')
     A            D1FFDA         6Y 0B  5 26
     A  33                                  ERRMSGID(LSO0250 *LIBL/QMFLAGR 33)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTWRD('      ')
     A            D1TOTF    R        B  5 42REFFLD(LOTOTF)
     A                                      EDTWRD('       0 ,  ')
     A                                      CHECK(RB)
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
