     A*%%TS  SD  20041103  145324  ASK530      REL-V5R2M0  5722-WDS
     A*%%EC
6.NU A* 280514 bof : endring mtp nummerutvidelse
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R D1BLD
     A*%%TS  SD  20041103  145324  ASK530      REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 9 60)
     A                                      CA03
     A                                      CF04
     A                                      KEEP
     A                                      PUTOVR
     A                                      CSRLOC(W_AWRO     W_AWCO)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL &-
     A                                      W_AWRO &W_AWCO)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_AWRO         3S 0H
     A            W_AWCO         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2'Bestillingsnummer . . . . . . . . -
     A                                      :'
     A            D1NUMM    R        O  2 40REFFLD(LONUMM)
     A            D1SUFF    R        O  2 50REFFLD(LOSUFF)
7.xx A                                  5  2'Selger +'
     A                                      COLOR(WHT)
7.xx A                                  5 23'Lager +'
     A                                      COLOR(WHT)
7.xx A                                  5 40'Forsendelsesmåte +'
     A                                      COLOR(WHT)
7.xx A            D1INNK    R        B  5 11REFFLD(LOINNK)
     A  33                                  ERRMSGID(LSO0210 *LIBL/QMFLAGR 33)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A            D1LAGE    R        B  5 31REFFLD(LOLAGE)
     A  34                                  ERRMSGID(LMA0160 *LIBL/QMFLAGR 34)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A            D1LMAT    R        B  5 59REFFLD(LOLMAT)
     A  38                                  ERRMSGID(LMA0200 *LIBL/QMFLAGR 38)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            D1INTX        20A  O  6  2OVRDTA
     A            D1LATX        15A  O  6 23OVRDTA
     A            D1LMTX    R        B  6 40REFFLD(LOLMTX)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A                                  8  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  8 17'F4=Spørring'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
