     A*%%TS  SD  20041021  121755  ASK530      REL-V5R2M0  5722-WDS
     A*%%EC
7.01 A                                      DSPSIZ(27 132 *WIDE -
7.01 A                                             24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20041021  121755  ASK530      REL-V5R2M0  5722-WDS
     A                                      WINDOW(4 32 14 44)
     A                                      CF03
     A                                      KEEP
     A                                  2  2' Samkjøre bestilling '
     A                                      DSPATR(RI)
     A                                  4  2'Denne funksjon gir mulighet til å -
     A                                      kjøre'
     A                                      COLOR(WHT)
     A                                  5  2'sammen igjen bestilling som er spl-
     A                                      ittet '
     A                                      COLOR(WHT)
     A                                  6  2'ut på forskjellig suffix :'
     A                                      COLOR(WHT)
     A                                  8  2'Basisbestilling/suffix . . . .'
     A            A1NUMM    R        O  8 33REFFLD(FONUMM)
     A            A1SUFF    R        O  8 42REFFLD(FOSUFF)
     A                                 10  2'Oppgi suffix som skal hentes'
     A                                 11  2'inn til basisbestilling. . . .'
     A            A2SUFF    R        B 11 33REFFLD(FOSUFF)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  31                                  ERRMSGID(FMO0670 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FMO0060 *LIBL/QMFOFAK 32)
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
      *
     A          R ASUME
     A*%%TS  SD  19980318  092024  AMD         REL-V3R7M0  5716-PW1
     A                                      ASSUME
     A                                 24 79' '
