     A*%%TS  SD  20140611  105729  BOF630      REL-V7R1M0  5770-WDS
     A*%%EC
     A* 110614 BOF : Endret iforb. med nummerutvidelse
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      MSGLOC(16)
     A          R B1SFL                     SFL
     A*%%TS  SD  20140611  105729  BOF630      REL-V7R1M0  5770-WDS
     A            B1VALG    R        B  4  2REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A            B1NUMM         8  0O  4  4EDTCDE(Z)
     A            B1SUFF         2Y 0O  4 13EDTCDE(Z)
     A            B1BDAT         6Y 0O  4 16
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20040330  201018  ASK         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0011)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  1  3' SØKE MED LEVR. '
     A                                      DSPATR(RI)
     A                                  3  2'1=Hente inn best.'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  19990114  171537  HKO         REL-V4R2M0  5769-PW1
     A                                 15  2'F5=Forny'
     A                                      COLOR(WHT)
