     A*%%TS  SD  20021210  144539  ASK         REL-V5R1M0  5722-WDS
     A*%%EC
7.01 A                                      DSPSIZ(27 132 *WIDE -
7.01 A                                             24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R D0BLD
     A*%%TS  SD  20021204  223715  ASK         REL-V5R1M0  5722-WDS
     A                                      WINDOW(4 36 14 40)
     A                                      CA03
     A                                      KEEP
     A                                      PUTOVR
     A                                  2  2'Utplukk/Utskrift av best_nummer'
     A                                      COLOR(WHT)
     A                                  4  2'Fra ordretype .'
     A            D0FOTY    R        B  4 18REFFLD(LOOTYP)
     A                                      OVRDTA
     A                                      DSPATR(PC)
     A  31                                  ERRMSGID(LM09990 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                  5  2'Til ordretype .'
     A            D0TOTY    R        B  5 18REFFLD(LOOTYP)
     A                                      DLTCHK
     A                                      OVRDTA
6.01 A  32                                  ERRMSGID(LM09990 *LIBL/QMFLAGR 32)
     A                                      COLOR(YLW)
     A                                  5 24'(Blank=Utskrift)'
     A                                  7  2'Seleksjon . . .'
     A            D0SVAR    R        B  7 18REFFLD(LÅSVAR)
     A                                      OVRDTA
     A                                      VALUES(0 1 2 3)
     A                                      CHKMSGID(LMD0100 *LIBL/QMFLAGR)
     A                                      COLOR(YLW)
     A                                  7 24'1=fra/til'
     A                                  8 24'3=tilfeldig'
     A                                  9  2'Droppe faste. .'
     A                                 10  2'tekstlinjer . .'
     A            D0PTXT    R        B 10 18REFFLD(LKPTXT)
     A                                      OVRDTA
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                 10 24'1=Ja,0=Nei'
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R D1BLD
     A*%%TS  SD  19961019  121555  KRKRI       REL-V3R1M0  5763-PW1
     A                                      CA03
     A                                      KEEP
     A                                      PUTOVR
     A                                      WINDOW(10 36 12 40)
     A                                  2  2'Best_nummer      fra      til'
     A                                      DSPATR(UL)
     A            D1FONR    R        B  3 16REFFLD(LONUMM)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      CHECK(RB)
     A  33                                  ERRMSGID(LM09990 *LIBL/QMFLAGR 33)
     A                                      COLOR(YLW)
     A            D1TONR    R        B  3 25REFFLD(LONUMM)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      CHECK(RB)
     A  34                                  ERRMSGID(LM09990 *LIBL/QMFLAGR 34)
     A                                      COLOR(YLW)
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R D2BLD
     A*%%TS  SD  20021210  144539  ASK         REL-V5R1M0  5722-WDS
     A                                      WINDOW(4 36 12 40)
     A                                      CA03
     A                                      KEEP
     A                                      PUTOVR
     A                                  2  2'Datoseleksjon'
     A                                      COLOR(WHT)
     A                                  4  2'T.o.m. best_dato . .'
     A            D2BDAT         6Y 0B  4 23COLOR(YLW)
     A                                      CHECK(RB)
     A  32                                  ERRMSGID(LM09990 *LIBL/QMFLAGR 32)
     A                                      EDTWRD('      ')
     A                                  4 34'Kode'
     A                                  5  2'Beløpsgrense . . .'
     A            D2BELG         8Y 0B  5 21OVRDTA
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A            D2BELK         1A  B  5 31OVRDTA
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  5 34'U=Under'
     A                                  6 34'O=Over'
     A                                  8  2'Best_nummer fra. . .'
     A            D2FONR    R        B  8 23REFFLD(LONUMM)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      CHECK(RB)
     A  33                                  ERRMSGID(LM09990 *LIBL/QMFLAGR 33)
     A                                      COLOR(YLW)
     A                                  9 14'til. . .'
     A            D2TONR    R        B  9 23REFFLD(LONUMM)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R D3BLD
     A*%%TS  SD  19961019  121555  KRKRI       REL-V3R1M0  5763-PW1
     A                                      CA03
     A                                      KEEP
     A                                      PUTOVR
     A                                      WINDOW(10 36 12 40)
     A                                  2  2'Tilfeldige bestillingsnummer'
     A                                      COLOR(WHT)
     A            D3UONR    R        O  4  7REFFLD(LONUMM)
     A                                      OVRDTA
     A            D3USUF    R        O  4 16REFFLD(LOSUFF)
     A                                      OVRDTA
     A            D3IONR    R        B  6  7REFFLD(LONUMM)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      CHECK(RB)
     A  31                                  ERRMSGID(LMO0020 *LIBL/QMFLAGR 31)
     A  32                                  ERRMSGID(LMO0040 *LIBL/QMFLAGR 32)
     A                                      COLOR(YLW)
     A            D3ISUF    R        B  6 16REFFLD(LOSUFF)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      CHECK(ER)
     A                                      COLOR(YLW)
     A                                  8  2'ENTER gir oppdatering og mulighet'
     A                                  9  2'for inntasting av flere nummer'
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R E2BLD
     A*%%TS  SD  19961019  121555  KRKRI       REL-V3R1M0  5763-PW1
     A                                      CA03
     A                                      KEEP
     A                                      OVERLAY
     A                                      WINDOW(7 36 12 40)
     A                                  2  2'Utskrift av bestillingsforslag'
     A                                      COLOR(WHT)
     A                                  4  2'Alternativ'
     A            E2PALT    R        B  4 14REFFLD(LKPALT)
     A                                      VALUES(0 1 2 3)
     A                                      CHKMSGID(LMG0010 *LIBL/QMFLAGR)
     A                                      COLOR(YLW)
     A                                  4 17'0=Standard forslag'
     A*
     A*
     A*
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R E3BLD
     A*%%TS  SD  19961019  121555  KRKRI       REL-V3R1M0  5763-PW1
     A                                      CA03
     A                                      KEEP
     A                                      OVERLAY
     A                                      WINDOW(7 36 12 40)
     A                                  2  2'Utskrift av bestilling'
     A                                      COLOR(WHT)
     A                                  4  2'Alternativ'
     A            E3PALT    R        B  4 13REFFLD(LKPALT)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LMG0010 *LIBL/QMFLAGR)
     A                                      COLOR(YLW)
     A                                  4 16'0=Standard'
     A*
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
