     A*%%TS  SD  20031230  084715  ASK         REL-V5R2M0  5722-WDS
     A*%%EC
7.xx A* 7.xx  140218  bkv  Justeringer basert på ny GUI og regler
     A*---------------------------------------------------------------
7.01 A                                      DSPSIZ(27 132 *WIDE -
7.01 A                                             24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R F1BLD
     A*%%TS  SD  20021204  213630  ASK         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 14 60)
     A                                      CA03
     A                                      CF04
     A                                      KEEP
     A                                      PUTOVR
     A                                  2  2'Velg hva skal skrives ut'
     A                                      COLOR(WHT)
7.xx A*                                 4 26'1='
7.xx A            F1OT02        30A  O  4 25
7.xx A            F1OT03        30A  O  5 25
7.xx A            F1OT04        30A  O  6 25
7.xx A            F1OT05        30A  O  7 25
7.xx A*            F1OT02    R        O  4 29REFFLD(LAAOT2)
7.xx A*                                      OVRDTA
7.xx A*                                  4 32'Bestilling,'
7.xx A*                                  5 26'2='
7.xx A*            F1OT03    R        O  5 29REFFLD(LAAOT3)
7.xx A*                                      OVRDTA
7.xx A*                                  5 32'Pakkseddel,'
7.xx A*                                  6 26'3='
7.xx A*            F1OT04    R        O  6 29REFFLD(LAAOT4)
7.xx A*                                      OVRDTA
7.xx A*                                  6 32'Inngående faktura,'
7.xx A                                  4  3'Alternativ .'
7.xx A            F1VALG    R        B  4 22REFFLD(LÅSVAR)
     A                                      OVRDTA
     A                                      VALUES(0 1 2 3 4)
     A                                      CHKMSGID(LMG0010 *LIBL/QMFLAGR)
     A                                      COLOR(YLW)
7.xx A*                                  7 26'4='
7.xx A*            F1OT05    R        O  7 29REFFLD(LAAOT5)
7.xx A*                                      OVRDTA
7.xx A**                                  7 32'Kreditnota'
7.xx A                                  8  4'eller ordretype .'
7.xx A            F1OTYP    R        B  8 22REFFLD(LAAOTY)
     A                                      DLTCHK
     A                                      OVRDTA
6.20 A**31                                  ERRMSGID(LS09990 *LIBL/QMFLAGR 31)
6.20 A  31                                  ERRMSGID(LSO0010 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                  9  3'Skriv best. bare registrert ved de-
     A                                      nne skjerm .'
     A            F1VLG2    R        B  9 50REFFLD(LÅSVAR)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LMG0010 *LIBL/QMFLAGR)
     A                                      COLOR(YLW)
     A                                  9 54'1=ja'
     A                                 10  3'Skriv best. bare registrert av den-
     A                                      ne bruker  .'
     A            F1VLG3    R        B 10 50REFFLD(LÅSVAR)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      VALUES(0 1)
     A                                      CHKMSGID(LMG0010 *LIBL/QMFLAGR)
     A                                      COLOR(YLW)
     A                                 10 54'1=ja'
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 13 18'F4=Jobbkø'
     A                                      COLOR(BLU)
     A*
     A          R F2BLD
     A*%%TS  SD  20031230  084715  ASK         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CF18
     A                                      KEEP
     A                                      PUTOVR
     A                                      WINDOW(*DFT 8 40)
     A                                  2  2'Periode og fakturadato'
     A                                      COLOR(WHT)
     A                                  4  2'Periode. . . .'
     A            F2PERI    R   -2   B  4 20REFFLD(LK1PER)
     A                                      OVRDTA
     A  31                                  ERRMSGID(LM00110 *LIBL/QMFLAGR 31)
     A  33                                  ERRMSGID(LM00120 *LIBL/QMFLAGR 33)
     A  36                                  ERRMSGID(FM01230 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Y)
     A                                  5  2'Faktura-dato .'
     A            F2DATO         6Y 0B  5 17OVRDTA
     A  32                                  ERRMSGID(LM00130 *LIBL/QMFLAGR 32)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Y)
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  7 17'F4=Jobbkø'
     A                                      COLOR(BLU)
     A                                  7 28'F18=Overstyr'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
