     A*%%TS  SD  20150918  144340  ASP_G0X     REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20150918  144340  ASP_G0X     REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CF10
     A                                      CF11
     A                                      KEEP
     A                                      RTNCSRLOC(&W_ACTR &W_ACTF)
     A            W_ACTR        10A  H
     A            W_ACTF        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kontroll av øredifferanser'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1' ----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6  2'Velg ordretyper som skal med på li-
     A                                      sta:'
     A            B1OTY1         2   B  6 41COLOR(YLW)
     A            B1OTY2         2   B  6 44COLOR(YLW)
     A            B1OTY3         2   B  6 47COLOR(YLW)
     A            B1OTY4         2   B  6 50COLOR(YLW)
     A            B1OTY5         2   B  6 53COLOR(YLW)
     A            B1OTY6         2   B  6 56COLOR(YLW)
     A                                  6 61'(Blank gir alle)'
     A                                  8  2'Grense for øredifferanse :'
     A            B1GRNS         2Y 0B  8 30COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTWRD('  ')
     A  42                                  ERRMSGID(LMI0153 *LIBL/QMFLAGR 42)
     A N30                                  DSPATR(PR)
     A                                  8 37'(Angis i hele kroner)'
     A                                 10  2'Antall med øredifferanser:'
     A            B1ANTA         6Y 0O 10 30COLOR(WHT)
     A                                      EDTWRD('      ')
     A                                 10 37'(Over angitt grense)'
     A                                 11  2'Total øredifferanse . . .:'
     A            B1DBEL        12Y 2O 11 30EDTWRD('        0 ,  -')
     A                                      COLOR(WHT)
     A  44                                  ERRMSGID(LMI0155 *LIBL/QMFLAGR 44)
     A                                 11 47'på totalt'
     A            B1ANTF         6S 0O 11 57COLOR(WHT)
     A                                 11 65'fakturaer.'
     A                                 13  6'Se liste for faktura detaljer!'
     A  30                                  DSPATR(ND)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
