     A*%%TS  SD  19980703  103331  AMD         REL-V3R7M0  5716-PW1
     A*%%EC
7.01 A                                      DSPSIZ(27 132 *WIDE -
7.01 A                                             24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R X1BLD
     A*%%TS  SD  19980703  103331  AMD         REL-V3R7M0  5716-PW1
     A                                      WINDOW(4 36 11 40)
     A                                      CA03
     A                                      KEEP
     A                                  2  2'Opplysning om hvem som holder ordr-
     A                                      e:'
     A                                      COLOR(WHT)
     A                                  4  2'Bruker. . . . . . . . .'
     A            X1KOUS    R        O  4 26REFFLD(LOKOUS)
     A                                  5  2'Skjerm-id . . . . . . .'
     A            X1KOWS    R        O  5 26REFFLD(LOKOWS)
     A                                  7  2'Dato. . . . . . . . . .'
     A            X1KODA         6Y 0O  7 26
     A                                      EDTWRD('  .  .  ')
     A                                  8  2'Klokkeslett . . . . . .'
     A            X1KOTI         6Y 0O  8 26
     A                                      EDTWRD('  .  .  ')
     A            X1DUMY         1A  B  9 26DSPATR(ND)
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
      *
     A          R ASUME
     A*%%TS  SD  19980318  092024  AMD         REL-V3R7M0  5716-PW1
     A                                      ASSUME
     A                                 24 79' '
