     A*%%TS  SD  20070403  084441  AMD550      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20070403  084441  AMD550      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'SMS/Forsendelsesmåter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  2'Forsendelsesmåter som gir SMS vars-
     A                                      ling'
     A            A1FM01    R        B  6  5REFFLD(RKFORM)
     A  31                                  ERRMSG('Ugyldig forsendelsesmåte')
     A                                      COLOR(YLW)
     A            A1FM02    R        B  6  9REFFLD(RKFORM)
     A                                      COLOR(YLW)
     A            A1FM03    R        B  6 13REFFLD(RKFORM)
     A                                      COLOR(YLW)
     A            A1FM04    R        B  6 17REFFLD(RKFORM)
     A                                      COLOR(YLW)
     A            A1FM05    R        B  6 21REFFLD(RKFORM)
     A                                      COLOR(YLW)
     A            A1FM06    R        B  6 25REFFLD(RKFORM)
     A                                      COLOR(YLW)
     A            A1FM07    R        B  6 29REFFLD(RKFORM)
     A                                      COLOR(YLW)
     A            A1FM08    R        B  6 33REFFLD(RKFORM)
     A                                      COLOR(YLW)
     A            A1FM09    R        B  6 37REFFLD(RKFORM)
     A                                      COLOR(YLW)
     A            A1FM10    R        B  6 41REFFLD(RKFORM)
     A                                      COLOR(YLW)
     A                                  8  2'Skal selger varsles ? (1=Ja)'
     A            A1SV01    R        B  9  5REFFLD(RAQKJO)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A            A1SV02    R        B  9  9REFFLD(RAQKJO)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A            A1SV03    R        B  9 13REFFLD(RAQKJO)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A            A1SV04    R        B  9 17REFFLD(RAQKJO)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A            A1SV05    R        B  9 21REFFLD(RAQKJO)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A            A1SV06    R        B  9 25REFFLD(RAQKJO)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A            A1SV07    R        B  9 29REFFLD(RAQKJO)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A            A1SV08    R        B  9 33REFFLD(RAQKJO)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A            A1SV09    R        B  9 37REFFLD(RAQKJO)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A            A1SV10    R        B  9 41REFFLD(RAQKJO)
     A                                      VALUES(0 1)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake  F4=Spørring'
     A                                      COLOR(BLU)
