     A*%%TS  SD  20030604  100655  ASK         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : LU103D
     A* Beskrivelse . . : Registrering av telletranser fra subliste
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R A1WIN
     A*%%TS  SD  20030604  100655  ASK         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 12 40)
     A                                      CA03
     A                                      PUTOVR
     A                                  2  2' Valg av subliste-nummer '
     A                                      DSPATR(RI)
     A                                  4  2'Buntnr. . . . .'
     A            A1NUMM    R        O  4 20REFFLD(LUNUMM)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  5  2'Lager . . . . .'
     A            A1LAGB    R        O  5 20REFFLD(LULAGE)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  7  2'Subliste-nummer'
     A            A1SUFF    R        B  7 20REFFLD(LESUFF)
     A  31                                  ERRMSGID(LMU0180 *LIBL/QMFLAGR 31)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  8  2'Hente inn saldo?'
     A            A1SALD         1D 0B  8 20COLOR(YLW)
     A                                  8 28'1=Ja,0=Nei'
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
