     A*%%TS  SD  20001110  142040  ASK         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R D1BLD
     A*%%TS  SD  20001102  140712  ASK         REL-V4R4M0  5769-PW1
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF09
     A                                      CF24
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Behandling av telletranser'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Bunt-nummer . . :'
     A                                      COLOR(WHT)
     A            D1ONUM    R        O  4 20REFFLD(LUNUMM)
     A            D1TEXT    R        O  4 31REFFLD(LUTEXT)
     A                                  8  2'Valg : 2=Endre  4=Slett'
     A                                      COLOR(BLU)
     A                                  9  2'V Varenr            Antall Enh  Te-
     A                                      kst/Beskrivelse                    -
     A                                               '
     A                                      COLOR(WHT)
     A            D1K001         1A  B 10  2
     A  41                                  ERRMSGID(LM99999 *LIBL/QMLAGRK 41)
     A                                      COLOR(YLW)
     A            D1V001         8A  O 10  4
     A  71                                  DSPATR(RI)
     A  81        D11001         8Y 1O 10 19EDTWRD('       , ')
     A  71                                  DSPATR(RI)
     A  82        D12001         9Y 2O 10 18EDTWRD('       ,  ')
     A  71                                  DSPATR(RI)
     A  83        D13001        10Y 3O 10 17EDTWRD('       ,   ')
     A  71                                  DSPATR(RI)
     A  80        D10001         7Y 0O 10 21EDTWRD('       ')
     A  71                                  DSPATR(RI)
     A            D1E001         3A  O 10 29
     A  71                                  DSPATR(RI)
     A            D1T001        40A  O 10 34
     A  71                                  DSPATR(RI)
     A N93        D1D001         2A  O 10 78
     A  71                                  DSPATR(RI)
     A            D1K002         1A  B 11  2
     A  42                                  ERRMSGID(LM99999 *LIBL/QMFLAGR 42)
     A                                      COLOR(YLW)
     A            D1V002         8A  O 11  4
     A  72                                  DSPATR(RI)
     A  81        D11002         8Y 1O 11 19EDTWRD('       , ')
     A  72                                  DSPATR(RI)
     A  82        D12002         9Y 2O 11 18EDTWRD('       ,  ')
     A  72                                  DSPATR(RI)
     A  83        D13002        10Y 3O 11 17EDTWRD('       ,   ')
     A  72                                  DSPATR(RI)
     A  80        D10002         7Y 0O 11 21EDTWRD('       ')
     A  72                                  DSPATR(RI)
     A            D1E002         3A  O 11 29
     A  72                                  DSPATR(RI)
     A            D1T002        40A  O 11 34
     A  72                                  DSPATR(RI)
     A N93        D1D002         2A  O 11 78
     A  72                                  DSPATR(RI)
     A            D1K003         1A  B 12  2
     A  43                                  ERRMSGID(LM99999 *LIBL/QMFLAGR 43)
     A                                      COLOR(YLW)
     A            D1V003         8A  O 12  4
     A  73                                  DSPATR(RI)
     A  81        D11003         8Y 1O 12 19EDTWRD('       , ')
     A  73                                  DSPATR(RI)
     A  82        D12003         9Y 2O 12 18EDTWRD('       ,  ')
     A  73                                  DSPATR(RI)
     A  83        D13003        10Y 3O 12 17EDTWRD('       ,   ')
     A  73                                  DSPATR(RI)
     A  80        D10003         7Y 0O 12 21EDTWRD('       ')
     A  73                                  DSPATR(RI)
     A            D1E003         3A  O 12 29
     A  73                                  DSPATR(RI)
     A            D1T003        40A  O 12 34
     A  73                                  DSPATR(RI)
     A N93        D1D003         2A  O 12 78
     A  73                                  DSPATR(RI)
     A            D1K004         1A  B 13  2
     A  44                                  ERRMSGID(LM99999 *LIBL/QMFLAGR 44)
     A                                      COLOR(YLW)
     A            D1V004         8A  O 13  4
     A  74                                  DSPATR(RI)
     A  81        D11004         8Y 1O 13 19EDTWRD('       , ')
     A  74                                  DSPATR(RI)
     A  82        D12004         9Y 2O 13 18EDTWRD('       ,  ')
     A  74                                  DSPATR(RI)
     A  83        D13004        10Y 3O 13 17EDTWRD('       ,   ')
     A  74                                  DSPATR(RI)
     A  80        D10004         7Y 0O 13 21EDTWRD('       ')
     A  74                                  DSPATR(RI)
     A            D1E004         3A  O 13 29
     A  74                                  DSPATR(RI)
     A            D1T004        40A  O 13 34
     A  74                                  DSPATR(RI)
     A N93        D1D004         2A  O 13 78
     A  74                                  DSPATR(RI)
     A            D1K005         1A  B 14  2
     A  45                                  ERRMSGID(LM99999 *LIBL/QMFLAGR 45)
     A                                      COLOR(YLW)
     A            D1V005         8A  O 14  4
     A  75                                  DSPATR(RI)
     A  81        D11005         8Y 1O 14 19EDTWRD('       , ')
     A  75                                  DSPATR(RI)
     A  82        D12005         9Y 2O 14 18EDTWRD('       ,  ')
     A  75                                  DSPATR(RI)
     A  83        D13005        10Y 3O 14 17EDTWRD('       ,   ')
     A  75                                  DSPATR(RI)
     A  80        D10005         7Y 0O 14 21EDTWRD('       ')
     A  75                                  DSPATR(RI)
     A            D1E005         3A  O 14 29
     A  75                                  DSPATR(RI)
     A            D1T005        40A  O 14 34
     A  75                                  DSPATR(RI)
     A N93        D1D005         2A  O 14 78
     A  75                                  DSPATR(RI)
     A            D1K006         1A  B 15  2
     A  46                                  ERRMSGID(LM99999 *LIBL/QMFLAGR 46)
     A                                      COLOR(YLW)
     A            D1V006         8A  O 15  4
     A  76                                  DSPATR(RI)
     A  81        D11006         8Y 1O 15 19EDTWRD('       , ')
     A  76                                  DSPATR(RI)
     A  82        D12006         9Y 2O 15 18EDTWRD('       ,  ')
     A  76                                  DSPATR(RI)
     A  83        D13006        10Y 3O 15 17EDTWRD('       ,   ')
     A  76                                  DSPATR(RI)
     A  80        D10006         7Y 0O 15 21EDTWRD('       ')
     A  76                                  DSPATR(RI)
     A            D1E006         3A  O 15 29
     A  76                                  DSPATR(RI)
     A            D1T006        40A  O 15 34
     A  76                                  DSPATR(RI)
     A N93        D1D006         2A  O 15 78
     A  76                                  DSPATR(RI)
     A            D1K007         1A  B 16  2
     A  47                                  ERRMSGID(LM99999 *LIBL/QMFLAGR 47)
     A                                      COLOR(YLW)
     A            D1V007         8A  O 16  4
     A  77                                  DSPATR(RI)
     A  81        D11007         8Y 1O 16 19EDTWRD('       , ')
     A  77                                  DSPATR(RI)
     A  82        D12007         9Y 2O 16 18EDTWRD('       ,  ')
     A  77                                  DSPATR(RI)
     A  83        D13007        10Y 3O 16 17EDTWRD('       ,   ')
     A  77                                  DSPATR(RI)
     A  80        D10007         7Y 0O 16 21EDTWRD('       ')
     A  77                                  DSPATR(RI)
     A            D1E007         3A  O 16 29
     A  77                                  DSPATR(RI)
     A            D1T007        40A  O 16 34
     A  77                                  DSPATR(RI)
     A N93        D1D007         2A  O 16 78
     A  77                                  DSPATR(RI)
     A                                 18  1'   VARENUMMER                     -
     A                                                                         -
     A                                                '
     A                                      DSPATR(UL)
     A                                      COLOR(TRQ)
     A            D1VAR0         8Y 0B 19  4
     A  38                                  ERRMSGID(LSO0140 *LIBL/QMFLAGR 38)
     A  21                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      CHECK(ER)
     A                                      CHECK(RZ)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A            D1VAR1         7A  B 20  4DSPATR(ND)
     A                                      DSPATR(PR)
     A                                 24  2'F3=Avslutt med valg  F4=Spørring  -
     A                                       F9=Varenr/antall '
     A                                      COLOR(BLU)
     A*
     A          R E0BLD
     A*%%TS  SD  20001110  142040  ASK         REL-V4R4M0  5769-PW1
     A                                      CA03
     A                                      SLNO(18)
     A                                      CLRL(07)
     A                                  1  1'   Varenummer         Antall     E-
     A                                      nh  Tekst                          -
     A                                                '
     A                                      DSPATR(UL)
     A                                      COLOR(TRQ)
     A            E0VARE    R        O  2  4REFFLD(LVVARE)
     A            E0ANT1        10Y 3B  2 20
     A  31                                  ERRMSGID(LSO0120 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            E0ENH1    R        O  2 34REFFLD(LVENH1)
     A            E0TEK1    R        O  2 39REFFLD(LVTEK1)
     A            E0ANT2        10Y 3B  3 20CHECK(ER)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A  52                                  DSPATR(ND)
     A  52                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            E0ENH2    R        O  3 34REFFLD(LVENH1)
     A  52                                  DSPATR(ND)
     A            E0ANT3        10Y 3B  4 20CHECK(RB)
     A                                      EDTCDE(Z)
     A  53                                  DSPATR(ND)
     A  53                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            E0ENH3    R        O  4 34REFFLD(LVENH1)
     A  53                                  DSPATR(ND)
     A                                  7  1'     F3=Gå tilbake                -
     A                                                                         -
     A                                           '
     A                                      COLOR(BLU)
     A          R E1BLD
     A*%%TS  SD  19971114  194859  KRKRI       REL-V3R1M0  5763-PW1
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A                                      SLNO(18)
     A                                      CLRL(07)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  1  1'   Varenummer         Antall     E-
     A                                      nh Tekst                           -
     A                                                '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            E1VARE    R        B  2  4REFFLD(LVVARE)
     A  33                                  ERRMSGID(LMV0010 *LIBL/QMFLAGR 33)
     A  37                                  ERRMSGID(LMV0060 *LIBL/QMFLAGR 37)
     A                                      CHECK(ER)
     A                                      COLOR(YLW)
     A            E1ANTT        10Y 3B  2 20
     A  34                                  ERRMSGID(LSO0350 *LIBL/QMFLAGR 34)
     A                                      EDTWRD('       ,   -')
     A                                      DSPATR(PC)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            E1ENH1    R        B  2 34REFFLD(LDENH1)
     A  35                                  ERRMSGID(LSO0360 *LIBL/QMFLAGR 35)
     A  39                                  ERRMSGID(LM99999 *LIBL/QMFLAGR 39)
     A            E1TEK1    R        O  2 38REFFLD(LVTEK1)
     A                                  7  1' F3=Gå tilbake                    -
     A                                                                         -
     A                                           '
     A                                      COLOR(BLU)
     A*
     A          R F1BLD
     A*%%TS  SD  19971014  203925  KRKRI       REL-V3R1M0  5763-PW1
     A                                      WINDOW(*DFT 8 40)
     A                                      CA03
     A                                      KEEP
     A                                      OVERLAY
     A                                  2  2'Oppdatering/Liste/Overføring'
     A                                      COLOR(WHT)
     A                                  4  2'Velg Behandling'
     A            F1SVAR    R        B  4 18REFFLD(LÅSVAR)
     A  31                                  ERRMSGID(LM10010 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                  4 22'0=Oppdatering'
     A                                  5 22'1=Kontroll-liste'
     A                                  6 22'2=Overføring'
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R T1BLD
     A*%%TS  SD  19970928  103639  KRKRI       REL-V3R1M0  5763-PW1
     A                                      WINDOW(*DFT 6 18)
     A                                      CA03
     A                                      KEEP
     A                                      OVERLAY
     A                                  2  2'Foran/Etter'
     A            T1KODE    R        B  2 16REFFLD(LÅVALA)
     A                                      VALUES('E' 'F')
     A                                      CHKMSGID(LMA0003 *LIBL/QMFLAGR)
     A                                      COLOR(YLW)
     A                                  5  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
