     A*%%TS  SD  20020925  092957  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      CA03(03 'F3=Gå tilbake')
     A          R A1BLD
     A*%%TS  SD  20020925  092957  HKO         REL-V5R1M0  5722-WDS
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Innlesing av data fra handterminal'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            A1TY01         2A  I  5  2
     A            A1VA01    R        I  5  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A            A1AN01         7A  I  5 23
     A  31                                  CHECK(ER)
     A            A1TY02         2A  I  5 45
     A  31                                  DSPATR(ND)
     A  31                                  DSPATR(PR)
     A            A1VA02    R        I  5 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(ND)
     A  31                                  DSPATR(PR)
     A            A1AN02         7A  I  5 66
     A  32                                  CHECK(ER)
     A  31                                  DSPATR(ND)
     A  31                                  DSPATR(PR)
     A            A1TY03         2A  I  6  2
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A            A1VA03    R        I  6  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A            A1AN03         7A  I  6 23
     A  33                                  CHECK(ER)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A            A1TY04         2A  I  6 45
     A  33                                  DSPATR(ND)
     A  33                                  DSPATR(PR)
     A            A1VA04    R        I  6 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  33                                  DSPATR(ND)
     A  33                                  DSPATR(PR)
     A            A1AN04         7A  I  6 66
     A  34                                  CHECK(ER)
     A  33                                  DSPATR(ND)
     A  33                                  DSPATR(PR)
     A            A1TY05         2A  I  7  2
     A  34                                  DSPATR(ND)
     A  34                                  DSPATR(PR)
     A            A1VA05    R        I  7  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  34                                  DSPATR(ND)
     A  34                                  DSPATR(PR)
     A            A1AN05         7A  I  7 23
     A  35                                  CHECK(ER)
     A  34                                  DSPATR(ND)
     A  34                                  DSPATR(PR)
     A            A1TY06         2A  I  7 45
     A  35                                  DSPATR(ND)
     A  35                                  DSPATR(PR)
     A            A1VA06    R        I  7 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  35                                  DSPATR(ND)
     A  35                                  DSPATR(PR)
     A            A1AN06         7A  I  7 66
     A  36                                  CHECK(ER)
     A  35                                  DSPATR(ND)
     A  35                                  DSPATR(PR)
     A            A1TY07         2A  I  8  2
     A  36                                  DSPATR(ND)
     A  36                                  DSPATR(PR)
     A            A1VA07    R        I  8  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  36                                  DSPATR(ND)
     A  36                                  DSPATR(PR)
     A            A1AN07         7A  I  8 23
     A  37                                  CHECK(ER)
     A  36                                  DSPATR(ND)
     A  36                                  DSPATR(PR)
     A            A1TY08         2A  I  8 45
     A  37                                  DSPATR(ND)
     A  37                                  DSPATR(PR)
     A            A1VA08    R        I  8 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  37                                  DSPATR(ND)
     A  37                                  DSPATR(PR)
     A            A1AN08         7A  I  8 66
     A  38                                  CHECK(ER)
     A  37                                  DSPATR(ND)
     A  37                                  DSPATR(PR)
     A            A1TY09         2A  I  9  2
     A  38                                  DSPATR(ND)
     A  38                                  DSPATR(PR)
     A            A1VA09    R        I  9  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  38                                  DSPATR(ND)
     A  38                                  DSPATR(PR)
     A            A1AN09         7A  I  9 23
     A  39                                  CHECK(ER)
     A  38                                  DSPATR(ND)
     A  38                                  DSPATR(PR)
     A            A1TY10         2A  I  9 45
     A  39                                  DSPATR(ND)
     A  39                                  DSPATR(PR)
     A            A1VA10    R        I  9 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  39                                  DSPATR(ND)
     A  39                                  DSPATR(PR)
     A            A1AN10         7A  I  9 66
     A  40                                  CHECK(ER)
     A  39                                  DSPATR(ND)
     A  39                                  DSPATR(PR)
     A            A1TY11         2A  I 10  2
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            A1VA11    R        I 10  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            A1AN11         7A  I 10 23
     A  41                                  CHECK(ER)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            A1TY12         2A  I 10 45
     A  41                                  DSPATR(ND)
     A  41                                  DSPATR(PR)
     A            A1VA12    R        I 10 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  41                                  DSPATR(ND)
     A  41                                  DSPATR(PR)
     A            A1AN12         7A  I 10 66
     A  42                                  CHECK(ER)
     A  41                                  DSPATR(ND)
     A  41                                  DSPATR(PR)
     A            A1TY13         2A  I 11  2
     A  42                                  DSPATR(ND)
     A  42                                  DSPATR(PR)
     A            A1VA13    R        I 11  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  42                                  DSPATR(ND)
     A  42                                  DSPATR(PR)
     A            A1AN13         7A  I 11 23
     A  43                                  CHECK(ER)
     A  42                                  DSPATR(ND)
     A  42                                  DSPATR(PR)
     A            A1TY14         2A  I 11 45
     A  43                                  DSPATR(ND)
     A  43                                  DSPATR(PR)
     A            A1VA14    R        I 11 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  43                                  DSPATR(ND)
     A  43                                  DSPATR(PR)
     A            A1AN14         7A  I 11 66
     A  44                                  CHECK(ER)
     A  43                                  DSPATR(ND)
     A  43                                  DSPATR(PR)
     A            A1TY15         2A  I 12  2
     A  44                                  DSPATR(ND)
     A  44                                  DSPATR(PR)
     A            A1VA15    R        I 12  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  44                                  DSPATR(ND)
     A  44                                  DSPATR(PR)
     A            A1AN15         7A  I 12 23
     A  45                                  CHECK(ER)
     A  44                                  DSPATR(ND)
     A  44                                  DSPATR(PR)
     A            A1TY16         2A  I 12 45
     A  45                                  DSPATR(ND)
     A  45                                  DSPATR(PR)
     A            A1VA16    R        I 12 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  45                                  DSPATR(ND)
     A  45                                  DSPATR(PR)
     A            A1AN16         7A  I 12 66
     A  46                                  CHECK(ER)
     A  45                                  DSPATR(ND)
     A  45                                  DSPATR(PR)
     A            A1TY17         2A  I 13  2
     A  46                                  DSPATR(ND)
     A  46                                  DSPATR(PR)
     A            A1VA17    R        I 13  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  46                                  DSPATR(ND)
     A  46                                  DSPATR(PR)
     A            A1AN17         7A  I 13 23
     A  47                                  CHECK(ER)
     A  46                                  DSPATR(ND)
     A  46                                  DSPATR(PR)
     A            A1TY18         2A  I 13 45
     A  47                                  DSPATR(ND)
     A  47                                  DSPATR(PR)
     A            A1VA18    R        I 13 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  47                                  DSPATR(ND)
     A  47                                  DSPATR(PR)
     A            A1AN18         7A  I 13 66
     A  48                                  CHECK(ER)
     A  47                                  DSPATR(ND)
     A  47                                  DSPATR(PR)
     A            A1TY19         2A  I 14  2
     A  48                                  DSPATR(ND)
     A  48                                  DSPATR(PR)
     A            A1VA19    R        I 14  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  48                                  DSPATR(ND)
     A  48                                  DSPATR(PR)
     A            A1AN19         7A  I 14 23
     A  49                                  CHECK(ER)
     A  48                                  DSPATR(ND)
     A  48                                  DSPATR(PR)
     A            A1TY20         2A  I 14 45
     A  49                                  DSPATR(ND)
     A  49                                  DSPATR(PR)
     A            A1VA20    R        I 14 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  49                                  DSPATR(ND)
     A  49                                  DSPATR(PR)
     A            A1AN20         7A  I 14 66
     A  50                                  CHECK(ER)
     A  49                                  DSPATR(ND)
     A  49                                  DSPATR(PR)
     A            A1TY21         2A  I 15  2
     A  50                                  DSPATR(ND)
     A  50                                  DSPATR(PR)
     A            A1VA21    R        I 15  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  50                                  DSPATR(ND)
     A  50                                  DSPATR(PR)
     A            A1AN21         7A  I 15 23
     A  51                                  CHECK(ER)
     A  50                                  DSPATR(ND)
     A  50                                  DSPATR(PR)
     A            A1TY22         2A  I 15 45
     A  51                                  DSPATR(ND)
     A  51                                  DSPATR(PR)
     A            A1VA22    R        I 15 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  51                                  DSPATR(ND)
     A  51                                  DSPATR(PR)
     A            A1AN22         7A  I 15 66
     A  52                                  CHECK(ER)
     A  51                                  DSPATR(ND)
     A  51                                  DSPATR(PR)
     A            A1TY23         2A  I 16  2
     A  52                                  DSPATR(ND)
     A  52                                  DSPATR(PR)
     A            A1VA23    R        I 16  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  52                                  DSPATR(ND)
     A  52                                  DSPATR(PR)
     A            A1AN23         7A  I 16 23
     A  53                                  CHECK(ER)
     A  52                                  DSPATR(ND)
     A  52                                  DSPATR(PR)
     A            A1TY24         2A  I 16 45
     A  53                                  DSPATR(ND)
     A  53                                  DSPATR(PR)
     A            A1VA24    R        I 16 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  53                                  DSPATR(ND)
     A  53                                  DSPATR(PR)
     A            A1AN24         7A  I 16 66
     A  54                                  CHECK(ER)
     A  53                                  DSPATR(ND)
     A  53                                  DSPATR(PR)
     A            A1TY25         2A  I 17  2
     A  54                                  DSPATR(ND)
     A  54                                  DSPATR(PR)
     A            A1VA25    R        I 17  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  54                                  DSPATR(ND)
     A  54                                  DSPATR(PR)
     A            A1AN25         7A  I 17 23
     A  55                                  CHECK(ER)
     A  54                                  DSPATR(ND)
     A  54                                  DSPATR(PR)
     A            A1TY26         2A  I 17 45
     A  55                                  DSPATR(ND)
     A  55                                  DSPATR(PR)
     A            A1VA26    R        I 17 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  55                                  DSPATR(ND)
     A  55                                  DSPATR(PR)
     A            A1AN26         7A  I 17 66
     A  56                                  CHECK(ER)
     A  55                                  DSPATR(ND)
     A  55                                  DSPATR(PR)
     A            A1TY27         2A  I 18  2
     A  56                                  DSPATR(ND)
     A  56                                  DSPATR(PR)
     A            A1VA27    R        I 18  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  56                                  DSPATR(ND)
     A  56                                  DSPATR(PR)
     A            A1AN27         7A  I 18 23
     A  57                                  CHECK(ER)
     A  56                                  DSPATR(ND)
     A  56                                  DSPATR(PR)
     A            A1TY28         2A  I 18 45
     A  57                                  DSPATR(ND)
     A  57                                  DSPATR(PR)
     A            A1VA28    R        I 18 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  57                                  DSPATR(ND)
     A  57                                  DSPATR(PR)
     A            A1AN28         7A  I 18 66
     A  58                                  CHECK(ER)
     A  57                                  DSPATR(ND)
     A  57                                  DSPATR(PR)
     A            A1TY29         2A  I 19  2
     A  58                                  DSPATR(ND)
     A  58                                  DSPATR(PR)
     A            A1VA29    R        I 19  6REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  58                                  DSPATR(ND)
     A  58                                  DSPATR(PR)
     A            A1AN29         7A  I 19 23
     A  59                                  CHECK(ER)
     A  58                                  DSPATR(ND)
     A  58                                  DSPATR(PR)
     A            A1TY30         2A  I 19 45
     A  59                                  DSPATR(ND)
     A  59                                  DSPATR(PR)
     A            A1VA30    R        I 19 49REFFLD(LVVARE)
     A                                      COLOR(YLW)
     A  59                                  DSPATR(ND)
     A  59                                  DSPATR(PR)
     A            A1AN30         7A  I 19 66
     A  59                                  DSPATR(ND)
     A  59                                  DSPATR(PR)
     A                                      CHECK(ER)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
