     A*%%TS  SD  20020925  093031  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R D1SFL                     SFL
     A*%%TS  SD  19981123  212713  KRKRI       REL-V3R2M0  5763-PW1
     A            D1LINE    R        O  8  2REFFLD(LVLINE)
     A            D1LEVE         9Y 3B  8 10EDTWRD('      ,   ')
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            D1ENH1    R        O  8 21REFFLD(LVENH1)
     A            D1VARE    R        O  8 26REFFLD(LVVARE)
     A            D1TEK1    R        O  8 42REFFLD(LVTEK1)
     A          R D2CTL                     SFLCTL(D1SFL)
     A*%%TS  SD  20020925  093031  HKO         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CA03
     A                                      CF05
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            SVRN02         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av bunt-vare-linjer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Buntnr. . .'
     A                                      COLOR(WHT)
     A            D2NUMM    R        O  4 14REFFLD(LUNUMM)
     A                                  6  2'Linje     Antall   Enh  Varenummer-
     A                                            Tekst'
     A                                      COLOR(WHT)
     A            D2LINE    R        B  7  2REFFLD(LVLINE)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            D2VARE    R        B  7 26REFFLD(LVVARE)
     A                                      DLTCHK
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A          R D2CMD
     A*%%TS  SD  19971123  131143  KRKRI       REL-V3R1M0  5763-PW1
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
