     A*%%TS  SD  20020925  093129  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      CA03(03 'F3=Gå tilbake')
     A          R C1BLD
     A*%%TS  SD  20020925  093129  HKO         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av etiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Etikett-type . . . . . . . .'
     A            C1ETYP         1D 0B  5 31CHECK(RB)
     A  20                                  DSPATR(PC)
     A                                      COLOR(YLW)
6.10 A                                  5 35'1=Vare, 2=Hylle-75x28'
     A                                  6 35'3=Hylle-100x28, 4=Reol-202x60'
     A                                  7 35'5=Bok-etikett, 6=Hylle-48x38'
     A                                  8 35'7=Hylle-100x38, 8=Vare-68x48'
     A                                 10  2'Pris på etiketten. . . . . .'
     A            C1ETPR         1D 0B 10 31
     A N98                                  DFTVAL('2')
     A                                      CHECK(RB)
     A  21                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 35'1=Uten pris'
     A                                 11 35'2=Med vanlig pris'
     A                                 12 35'3=Med tilbudspris'
     A                                 12 56'==>'
     A                                 12 60'Dato:'
     A            C1DATO         6Y 0B 12 66CHECK(RZ)
     A  21                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14  2'Sortering. . . . . . . . . .'
     A            C1SORT         1D 0B 14 31
     A N98                                  DFTVAL('0')
     A                                      CHECK(RB)
     A  22                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14 35'0=Varenumerrekkefølge'
     A                                 15 35'1=Lagerplasrekkefølge'
     A                                 17  2'Pris 1 hentes fra enhet. . .'
     A            C1ENH1         1D 0B 17 31
     A N98                                  DFTVAL('1')
     A                                      CHECK(RB)
     A  23                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 17 35'0=Ingen pris, 1=Enhet-1, 2=Enhet-2-
     A                                      , 3=Enhet-3'
     A                                 18  2'Pris 2 hentes fra enhet. . .'
     A            C1ENH2         1D 0B 18 31
     A N98                                  DFTVAL('2')
     A                                      CHECK(RB)
     A  25                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 18 35'0=Ingen pris, 1=Enhet-1, 2=Enhet-2-
     A                                      , 3=Enhet-3'
     A                                 21  2'Skrivertype styres via rutineregis-
     A                                      ter og enhetsregister'
     A                                      COLOR(RED)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            MELD          78A  O 24  2
     A  96                                  DSPATR(RI)
