     A*%%TS  SD  20051210  172920  ASK550      REL-V5R3M0  5722-WDS
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1
     A*%%TS  SD  20051210  172920  ASK550      REL-V5R3M0  5722-WDS
     A                                  1  2'SKI BYGG AS'
     A                                      COLOR(WHT)
     A                                  1 46'Ordre/Fakturering   Kl. : 17.28.27'
     A                                      COLOR(WHT)
     A                                  2  2'Plukk til bestilling pr. leverandø-
     A                                      r'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker: ASP_NOR     Dato: 10.12.05'
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Ordre:'
     A                                      COLOR(WHT)
     A                                  5  2'Kunde:'
     A                                      COLOR(WHT)
     A                                  6  2'L.kun:'
     A                                      COLOR(WHT)
     A                                  7  2'Leveringstype:'
     A                                      COLOR(WHT)
     A                                  4 19'OLE'
     A                                  4 23'OLSEN'
     A                                  4 29'BAKKEN'
     A                                  4 48'VINTERBRO'
     A                                  5 10'49999'
     A                                  5 19'BAKKESVINGEN'
     A                                  5 32'24'
     A                                  6 19'5566'
     A                                  6 24'BAKKEBYGRENDA'
     A                                  4 11'5566'
     A                                  4 16'O'
     A                                  7 19'Standard'
     A                                  7 28'leveringstype'
     A                                  7 60'Tlf: 69 89 09 77'
     A                                  8 60'Mob: 90 56 20 32'
     A                                  9  3'2=Plukk  7=Bestilling'
     A                                      COLOR(BLU)
     A                                 10  4'Levnr.'
     A                                      COLOR(WHT)
     A                                 10 11'Leverandør'
     A                                      COLOR(WHT)
     A                                 11  4'600026'
     A                                 10  2'V'
     A                                      COLOR(WHT)
     A                                 11  2'_'
     A                                      COLOR(YLW)
     A                                 11 11'BOSCH ROBERT AS K4557        '
     A                                 12  2'_'
     A                                      COLOR(YLW)
     A                                 13  2'_'
     A                                      COLOR(YLW)
     A                                 14  2'_'
     A                                      COLOR(YLW)
     A                                 15  2'2'
     A                                      COLOR(YLW)
     A                                 16  2'_'
     A                                      COLOR(YLW)
     A                                 17  2'_'
     A                                      COLOR(YLW)
     A                                 18  2'_'
     A                                      COLOR(YLW)
     A                                 19  2'_'
     A                                      COLOR(YLW)
     A                                 20  2'_'
     A                                      COLOR(YLW)
     A                                 22  3'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                 10 42'Bestnr'
     A                                      COLOR(WHT)
     A                                 10 50'Distribusjonstupe'
     A                                      COLOR(WHT)
     A                                 11 42'502083'
     A                                 11 50'EDI-bestilling'
     A                                 12  4'600043'
     A                                 12 11'CRAWFORD'
     A                                 12 20'DOOR'
     A                                 12 25'AS'
     A                                 12 42'502084'
     A                                 12 50'E-mail'
     A                                 13  4'600065'
     A                                 13 11'DIPLOMAT'
     A                                 13 20'NORGE'
     A                                 13 26'AS'
     A                                 13 42'502086'
     A                                 13 50'Ikke behandlet'
     A                                      COLOR(RED)
     A                                 14  4'600103'
     A                                 14 42'502087'
     A                                 14 11'JERN & KJEMIKALIER A/S'
     A                                 14 50'Fax'
     A                                 15  4'600143'
     A                                 15 11'MOELVEN'
     A                                 15 19'EIDSVOLL'
     A                                 15 28'AS'
     A                                 16  4'600219'
     A                                 16 11'SNICKERS'
     A                                 16 20'ORGINAL'
     A                                 16 28'NORGE'
     A                                 16 34'A/S'
     A                                  9 26'8=Send bestilling'
     A                                      COLOR(BLU)
     A          R B2
     A*%%TS  SD  20051210  172920  ASK550      REL-V5R3M0  5722-WDS
     A                                  1  2'SKI BYGG AS'
     A                                      COLOR(WHT)
     A                                  1 46'Ordre/Fakturering   Kl. : 17.28.27'
     A                                      COLOR(WHT)
     A                                  2  2'Bestillingslinjer til leverandør'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker: ASP_NOR     Dato: 10.12.05'
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Ordre:'
     A                                      COLOR(WHT)
     A                                  5  2'Kunde:'
     A                                      COLOR(WHT)
     A                                  4 19'OLE'
     A                                  4 23'OLSEN'
     A                                  4 29'BAKKEN'
     A                                  5 10'49999'
     A                                  5 19'BAKKESVINGEN'
     A                                  5 32'24'
     A                                  4 11'5566'
     A                                  4 16'O'
     A                                  9  3'2=Endre'
     A                                      COLOR(BLU)
     A                                 10  4'Varenr'
     A                                      COLOR(WHT)
     A                                 10  2'V'
     A                                      COLOR(WHT)
     A                                 11  2'_'
     A                                      COLOR(YLW)
     A                                 12  2'_'
     A                                      COLOR(YLW)
     A                                 13  2'_'
     A                                      COLOR(YLW)
     A                                 14  2'_'
     A                                      COLOR(YLW)
     A                                 15  2'_'
     A                                      COLOR(YLW)
     A                                 16  2'_'
     A                                      COLOR(YLW)
     A                                 17  2'_'
     A                                      COLOR(YLW)
     A                                 18  2'_'
     A                                      COLOR(YLW)
     A                                 19  2'_'
     A                                      COLOR(YLW)
     A                                 20  2'_'
     A                                      COLOR(YLW)
     A                                 23  3'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                 23 15'F7=Alle varer'
     A                                      COLOR(BLU)
     A                                  9 12'4=Slett'
     A                                      COLOR(BLU)
     A                                  7  2'Leverandør:'
     A                                      COLOR(WHT)
     A                                  7 14'600143 MOELVEN EIDSVOLL AS'
     A                                  7 52'Telefon  : 63 96 03 80'
     A                                  8 52'Fax      : 63 92 79 00'
     A                                 21  2'_'
     A                                      COLOR(YLW)
     A                                 11  4'25411091'
     A                                 10 13'Varetekst'
     A                                      COLOR(WHT)
     A                                 11 13'K-VIRKE FURU C18 36X098 CU.IMP'
     A                                 10 49'Ordre ant'
     A                                      COLOR(WHT)
     A                                 11 49'   100,000'
     A                                 10 60'Enh'
     A                                      COLOR(WHT)
     A                                 10 65'Best.ant'
     A                                      COLOR(WHT)
     A                                 11 60'LM '
     A                                 12  4'21173406'
     A                                 12 13'K-VIRKE GRAN C24 48X148 PRECUT'
     A                                 12 53'60,000'
     A                                 12 60'LM'
     A                                 12 68'60,000'
     A                                 11 67'100,000'
     A                                 13  4'25414087'
     A                                 13 13'REKKER GRAN 36X89 PRECUT 2,345M.'
     A                                 13 53'20,000'
     A                                 13 60'STK'
     A                                 13 68'25,000'
     A                                      COLOR(RED)
     A          R B3
     A*%%TS  SD  20051210  172920  ASK550      REL-V5R3M0  5722-WDS
     A                                  1  2'SKI BYGG AS'
     A                                      COLOR(WHT)
     A                                  1 46'Ordre/Fakturering   Kl. : 17.28.27'
     A                                      COLOR(WHT)
     A                                  2  2'Bestillingslinjer til leverandør'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker: ASP_NOR     Dato: 10.12.05'
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Ordre:'
     A                                      COLOR(WHT)
     A                                  5  2'Kunde:'
     A                                      COLOR(WHT)
     A                                  4 19'OLE'
     A                                  4 23'OLSEN'
     A                                  4 29'BAKKEN'
     A                                  5 10'49999'
     A                                  5 19'BAKKESVINGEN'
     A                                  5 32'24'
     A                                  4 11'5566'
     A                                  4 16'O'
     A                                  9  3'2=Endre'
     A                                      COLOR(BLU)
     A                                 10  4'Varenr'
     A                                      COLOR(WHT)
     A                                 10  2'V'
     A                                      COLOR(WHT)
     A                                 11  2'_'
     A                                      COLOR(YLW)
     A                                 12  2'_'
     A                                      COLOR(YLW)
     A                                 13  2'_'
     A                                      COLOR(YLW)
     A                                 14  2'_'
     A                                      COLOR(YLW)
     A                                 15  2'_'
     A                                      COLOR(YLW)
     A                                 16  2'_'
     A                                      COLOR(YLW)
     A                                 17  2'_'
     A                                      COLOR(YLW)
     A                                 18  2'_'
     A                                      COLOR(YLW)
     A                                 19  2'_'
     A                                      COLOR(YLW)
     A                                 20  2'_'
     A                                      COLOR(YLW)
     A                                 23  3'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                 23 15'F7=Alle varer'
     A                                      COLOR(BLU)
     A                                  9 12'4=Slett'
     A                                      COLOR(BLU)
     A                                  7  2'Leverandør:'
     A                                      COLOR(WHT)
     A                                  7 14'600143 MOELVEN EIDSVOLL AS'
     A                                  7 52'Telefon  : 63 96 03 80'
     A                                 21  2'_'
     A                                      COLOR(YLW)
     A                                 11  4'25411091'
     A                                 10 13'Varetekst'
     A                                      COLOR(WHT)
     A                                 11 13'K-VIRKE FURU C'
     A                                 10 65'Best.ant'
     A                                      COLOR(WHT)
     A                                 12  4'21173406'
     A                                 12 13'K-VIRKE GRAN C'
     A                                 12 68'60,000'
     A                                 11 67'100,000'
     A                                 13  4'25414087'
     A                                 13 13'REKKER GRAN 36'
     A                                 13 68'25,000'
     A                                      COLOR(RED)
     A                                  9 29'|'
     A                                      COLOR(BLU)
     A                                 10 29'|'
     A                                      COLOR(BLU)
     A                                 11 29'|'
     A                                      COLOR(BLU)
     A                                 12 29'|'
     A                                      COLOR(BLU)
     A                                 13 29'|'
     A                                      COLOR(BLU)
     A                                 14 29'|'
     A                                      COLOR(BLU)
     A                                 15 29'|'
     A                                      COLOR(BLU)
     A                                  8 29'_________________________________'
     A                                      COLOR(BLU)
     A                                 10 31' Fullføre bestilling '
     A                                      DSPATR(RI)
     A                                  9 61'|'
     A                                      COLOR(BLU)
     A                                 10 61'|'
     A                                      COLOR(BLU)
     A                                 11 61'|'
     A                                      COLOR(BLU)
     A                                 12 61'|'
     A                                      COLOR(BLU)
     A                                 13 61'|'
     A                                      COLOR(BLU)
     A                                 14 61'|'
     A                                      COLOR(BLU)
     A                                 15 61'|'
     A                                      COLOR(BLU)
     A                                 12 31'Ordretype:'
     A                                 12 45'BK'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13 31'Distribusjon:'
     A                                 13 49'0=Ingen '
     A                                 14 49'1=Fax'
     A                                 15 49'2=Mail'
     A                                 13 45'3'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 16 49'3=EDI'
     A                                 17 49'4=Print'
     A                                 16 29'|'
     A                                      COLOR(BLU)
     A                                 17 29'|'
     A                                      COLOR(BLU)
     A                                 18 29'|'
     A                                      COLOR(BLU)
     A                                 16 61'|'
     A                                      COLOR(BLU)
     A                                 17 61'|'
     A                                      COLOR(BLU)
     A                                 18 61'|'
     A                                      COLOR(BLU)
     A                                 19 29'---------------------------------'
     A                                      COLOR(BLU)
     A                                 18 32'F3=Avslutt'
     A                                      COLOR(BLU)
