     A*%%TS  SD  20081026  232450  KOB560      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK630D
     A* Beskrivelse . . : Kunder, utskrift av saldoliste - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       240702 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20081026  232450  KOB560      REL-V5R4M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A  98                                  PUTOVR
     A                                      RTNCSRLOC(&W_ACRD &W_AFLD)
     A            W_ACRD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Overføring av informasjon til lage-
     A                                      r'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4 11'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  6 11'Til lager . . . . . . :'
     A            A2LAGR    R        B  6 35REFFLD(LFRFR/LÅLAGE *LIBL/LFRF)
     A                                  8 11'Feltverdier som skal overføres fra-
     A                                       vareregister til lager:'
     A                                      COLOR(WHT)
     A                                 10 12'Lagerplass . . . . . :'
     A            A2PLAS         1A  B 10 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10 37'(J=Ja)'
     A                                 11 12'Minimumslager. . . . :'
     A            A2MINI         1A  B 11 35COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 11 37'(J=Ja)'
     A                                 12 12'Maksimumslager . . . :'
     A            A2MAKS         1A  B 12 35COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 12 37'(J=Ja)'
     A                                 13 12'Bestillingspunkt . . :'
     A            A2BPUN         1A  B 13 35COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 13 37'(J=Ja)'
     A                                 14 12'Bestillingsmengde. . :'
     A            A2BMEN         1A  B 14 35COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 14 37'(J=Ja)'
     A                                 15 12'Leveringstid . . . . :'
     A            A2LTID         1A  B 15 35COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 15 37'(J=Ja)'
     A                                 16 12'Sikkerhetslager. . . :'
     A            A2SIKL         1A  B 16 35COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 16 37'(J=Ja)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
