     A*%%TS  SD  20031209  223115  ASK         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      CA03
     A                                      CA12
     A          R C1BLD
     A*%%TS  SD  20031209  223115  ASK         REL-V5R2M0  5722-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bytte av lager i hele systemet'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  7  2'Fra lager. . '
     A            C1FLAG         2Y 0B  7 16COLOR(YLW)
     A  31                                  ERRMSGID(LSO0480 *LIBL/QMFLAGR 31)
     A                                      EDTCDE(Z)
     A                                  8  2'Til lager. .'
     A            C1TLAG         2Y 0B  8 16COLOR(YLW)
     A  32                                  ERRMSGID(LSO0490 *LIBL/QMFLAGR 32)
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
