     A*%%TS  SD  20110302  101153  ASP_SGX     REL-V6R1M0  5761-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20110302  101153  ASP_SGX     REL-V6R1M0  5761-WDS
     A                                      WINDOW(*DFT 15 54)
     A                                      CA03
     A                                      CA12
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Innlesing av lagerdata fra fil CS-
     A                                      V '
     A                                      DSPATR(RI)
     A                                  4  2'Filnavn . . . . . .'
     A            B1FILE        30A  B  4 22COLOR(YLW)
     A  36                                  ERRMSGID(FM00600 *LIBL/QMFOFAK 36)
     A                                  5  2'Mappenavn (IFS). .'
     A            B1FLDR        30A  B  5 22COLOR(YLW)
     A                                 10  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R B1MSG
     A*%%TS  SD  20010904  091133  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 12 36)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Valgt mappenavn er ugyldig, filene'
     A                                  3  2'ble ikke funnet i mappen, eller du'
     A                                  4  2'mangler tilgang for behandling av'
     A                                  5  2'mapper.'
     A                                  7  2'Sjekk at filene finnes i mappen.'
     A                                  8  2'Dersom du mangler tilgang må du'
     A                                  9  2'kontakte systemansvarlig.'
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
