     A*%%TS  SD  20090831  110357  BSA610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20090831  110357  BSA610      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 20 70)
     A                                      CF03
     A                                      KEEP
     A                                  2  1' Slettet bestilling '
     A                                      DSPATR(RI)
     A            A1DUMY         1A  B  3  2DSPATR(ND)
     A                                  4  1'Levr. :'
     A            A1LDOR    R        O  4 10REFFLD(LYLDOR)
     A                                      COLOR(YLW)
     A                                  4 33'Firma:'
     A            LYFIRM    R        O  4 43REFFLD(LYFIRM)
     A                                      COLOR(YLW)
     A                                  4 49'Skjerm-id :'
     A            LYWSID    R        O  4 61REFFLD(LYWSID)
     A                                      COLOR(YLW)
     A            A1NAVN    R        O  5  1REFFLD(LYNAVN)
     A                                      COLOR(YLW)
     A                                  5 33'År. .:'
     A            LYAARR    R        O  5 42REFFLD(LYAARR)
     A                                      COLOR(YLW)
     A                                  5 49'Bruker-id :'
     A            LYUSER    R        O  5 61REFFLD(LYUSER)
     A                                      COLOR(YLW)
     A            A1ADR1    R        O  6  1REFFLD(LYADR1)
     A                                      COLOR(YLW)
     A                                  6 33'Best.:'
     A            LYNUMM    R        O  6 40REFFLD(LYNUMM)
     A                                      COLOR(YLW)
     A                                  6 49'Opprettet :'
     A            A1DATE         6Y 0O  6 61EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A            A1ADR2    R        O  7  1REFFLD(LYADR2)
     A                                      COLOR(YLW)
     A                                  7 33'Suff.:'
     A            LYSUFF    R        O  7 44REFFLD(LYSUFF)
     A                                      COLOR(YLW)
     A                                  7 49'Klokken . :'
     A            A1TIME         6Y 0O  7 61EDTWRD('  :  :  ')
     A                                      COLOR(YLW)
     A            A1STED    R        O  8  1REFFLD(LYSTED)
     A                                      COLOR(YLW)
     A                                  8 33'Otype:'
     A            LYOTYP    R        O  8 44REFFLD(LYOTYP)
     A                                      COLOR(YLW)
     A                                 10  1'Lev.adr:'
     A            LYNAVN    R        O 11  1REFFLD(LYNAVN)
     A                                      COLOR(YLW)
     A                                 10 33'Bestill.dato. :'
     A            A1BDAT         6Y 0O 10 53EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A            LYADR1    R        O 12  1REFFLD(LYADR1)
     A                                      COLOR(YLW)
     A                                 11 33'Selger. . . . :'
     A            LYINNK    R        O 11 57REFFLD(LYINNK)
     A                                      COLOR(YLW)
     A            LYADR2    R        O 13  1REFFLD(LYADR2)
     A                                      COLOR(YLW)
     A                                 12 33'Total kjøp.'
     A                                 12 45'.'
     A                                 12 47':'
     A            A1KJOP    R        O 12 49REFFLD(LYTOTI)
     A                                      COLOR(YLW)
     A            LYSTED    R        O 14  1REFFLD(LYSTED)
     A                                      COLOR(YLW)
     A                                 16  1'Kommentar:'
     A            LYTYPE    R        O 16 12REFFLD(LYTYPE)
     A                                      COLOR(YLW)
     A                                 14 33'Vår ref . . . :'
     A            LYVREF    R        O 15 33REFFLD(LYVREF)
     A                                      COLOR(YLW)
     A            LYKOM1    R        O 17  1REFFLD(LYKOM1)
     A                                      COLOR(YLW)
     A                                 16 33'Deres ref . . :'
6.NU A            LYDREF    R        O 17 33REFFLD(LYDREF)
     A                                      COLOR(YLW)
     A            LYKOM2    R        O 18  1REFFLD(LYKOM2)
     A                                      COLOR(YLW)
     A                                 18 33'Rekvisisjon . :'
     A            LYREKV    R        O 18 49REFFLD(LYREKV)
     A                                      COLOR(YLW)
     A                                 19  1'F3=Gå tilbake'
     A                                      COLOR(BLU)
