     A*%%TS  SD  20070223  130709  BOF550      REL-V5R4M0  5722-WDS
     A*%%EC
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : MD200D
     A* Beskrivelse . . : Innlsing av plukkområder fra fil
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A* K0000 021222 bsa  Nytt program
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3 -
     A                                             27 132 *WIDE)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20070223  130709  BOF550      REL-V5R4M0  5722-WDS
     A*                                      WINDOW(*DFT 23 54)
     A                                      CA03
     A                                      CA12
     A**                                    CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Innlesing av plukkområder fra fi-
     A                                      l '
     A                                      DSPATR(RI)
     A                                 10  2'Filnavn . . . . . .'
     A            B1FILE        30A  B 10 22COLOR(YLW)
     A  36                                  ERRMSGID(FM00600 *LIBL/QMFOFAK 36)
     A                                 11  2'Mappenavn . . . . .'
     A            B1FLDR        20A  B 11 22COLOR(YLW)
     A**                               23  2'F3=Gå tilbake   F4=Spørring'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B1MSG
     A*%%TS  SD  20010904  091133  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 12 36)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Valgt mappenavn er ugyldig, filene'
     A                                  3  2'ble ikke funnet i mappen, eller du'
     A                                  4  2'mangler tilgang for behandling av'
     A                                  5  2'mapper.'
     A                                  7  2'Sjekk at filene finnes i mappen.'
     A                                  8  2'Dersom du mangler tilgang må du'
     A                                  9  2'kontakte systemansvarlig.'
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
