     A*%%TS  SD  20140604  150633  BOF630      REL-V7R1M0  5770-WDS
     A*%%EC
6.NU  * BOF 040614 Sjekket mtp. nummerutvidelse
7.xx A* 7.xx  160316  bsa  Justeringer basert på ny GUI og regler
     A*---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20140604  150633  BOF630      REL-V7R1M0  5770-WDS
     A            B1VALG    R        B  8  2REFFLD(LÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(2 3 4 5 0)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            B1LAGE    R        O  8  4REFFLD(MJLAGE)
     A            B1AVDE    R        O  8  7REFFLD(MJAVDE)
     A            B1SKAF    R        O  8 14REFFLD(MJSKAF)
     A            B1STED    R        O  8 34REFFLD(MJSTED)
     A            B1EANN    R        O  8 19REFFLD(MJEANN)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20050524  153138  ASK530      REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA04
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      RTNCSRLOC(&W_ACTR &W_ACTF)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ACTR        10A  H
     A            W_ACTF        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av Logistikkpunkt'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  4  2'+'
7.xx A                                  4  4'Lg'
7.xx A                                      COLOR(WHT)
7.xx A                                  6  2'2=Endre  3=Kopier  4=Slett  5=Vis'
     A                                      COLOR(BLU)
7.xx A                                  7  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  4'Lg'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  8'Avd'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 12'Skaffe'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 20'Ean-lokasjon '
7.xx A                                      COLOR(WHT)
7.xx A                                  7 35'Sted           '
     A                                      COLOR(WHT)
7.xx A            B2LAGE    R        B  5  4REFFLD(MJLAGE)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A          R B2CMD
     A*%%TS  SD  20050524  145408  ASK530      REL-V5R2M0  5722-WDS
     A                                 23  2'F3=Gå tilbake  F4=Spørring  F5=For-
     A                                      ny  F6=Opprett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20050524  232653  ASK530      REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ACTR &W_ACTF)
     A            W_ACTR        10A  H
     A            W_ACTF        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av logistikkpunkt'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  5  2'Lager. . . . . . . . . . . +'
     A            C1LAGE    R        B  5 31REFFLD(MJLAGE)
     A                                      OVRDTA
     A  32                                  ERRMSGID(LMP0015 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            C1LAGN        20A  O  5 39COLOR(GRN)
     A                                      OVRDTA
7.xx A                                  6  2'Avdeling . . . . . . . . . +'
     A            C1AVDE    R        B  6 31REFFLD(MJAVDE)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            C1AVDN        20A  O  6 39COLOR(GRN)
     A                                      OVRDTA
     A                                  7  2'Skaffeordre. . . . . . . . .'
     A            C1SKAF    R        B  7 31REFFLD(MJSKAF)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  7 34'(S)'
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20020306  135010  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Logistikkpunkt finnes '
     A                                  3  2'fra før.'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20050525  004316  ASK530      REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av logistikkpunkt'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Skaffeordre. . . .'
     A            C1SKAF    R        O  5 21REFFLD(MJSKAF)
     A                                      OVRDTA
     A                                  6  2'Lager. . . . . . .'
     A            C1LAGE    R        O  6 21REFFLD(MJLAGE)
     A                                      OVRDTA
     A            C1LAGN        20A  O  6 29COLOR(GRN)
     A                                      OVRDTA
     A                                  7  2'Avdeling . . . . .'
     A            C1AVDE    R        O  7 21REFFLD(MJAVDE)
     A            C1AVDN        20A  O  7 29COLOR(GRN)
     A                                  9  2'Ean-lokasjonsnr. .'
     A            C2EANN    R        B  9 21REFFLD(MJEANN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      DSPATR(PC)
     A                                 11  2'Sted . . . . . . .'
     A            C2STED    R        B 11 21REFFLD(MJSTED)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Adresse1 . . . . .'
     A            C2ADR1    R        B 12 21REFFLD(MJADR1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13  2'Adresse2 . . . . .'
     A            C2ADR2    R        B 13 21REFFLD(MJADR2)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14  2'Poststed . . . . .'
     A            C2PSTE    R        B 14 21REFFLD(MJPSTE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 20  2'Sist endret dato .'
     A            C2EDAT         6Y 0O 20 21EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      COLOR(GRN)
     A                                 21  2'Endret av. . . . .'
     A            C2EUSR    R        O 21 21REFFLD(LPEUSR)
     A                                      OVRDTA
     A                                      COLOR(GRN)
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20031014  151927  ASK         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 15 51)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Slette logistikkpunkt '
     A                                      DSPATR(RI)
     A                                  4  2'Skaffeordre'
     A            D1SKAF    R        O  4 16REFFLD(MJSKAF)
     A                                      OVRDTA
     A                                  5  2'Lager . . .'
     A            D1LAGE    R        O  5 16REFFLD(MJLAGE)
     A                                      OVRDTA
     A            D1LAGN        20A  O  5 21
     A                                      OVRDTA
     A                                  6  2'Avdeling. .'
     A            D1AVDE    R        O  6 16REFFLD(MJAVDE)
     A                                      OVRDTA
     A            D1AVDN        20A  O  6 21COLOR(GRN)
     A                                      OVRDTA
     A                                  7  2'Ean-loknr .'
     A            D1EANN    R        O  7 16REFFLD(MJEANN)
     A                                      OVRDTA
     A                                  8  2'Sted. . . .'
     A            D1STED    R        O  8 16REFFLD(MJSTED)
     A                                      OVRDTA
     A                                  9  2'Adresse1. .'
     A            D1ADR1    R        O  9 16REFFLD(MJADR1)
     A                                      OVRDTA
     A                                 10  2'Adresse2. .'
     A            D1ADR2    R        O 10 16REFFLD(MJADR2)
     A                                      OVRDTA
     A                                 11  2'Poststed. .'
     A            D1PSTE    R        O 11 16REFFLD(MJPSTE)
     A                                      OVRDTA
     A                                 13  2'F3=Gå tilbake '
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20031014  151927  ASK         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      PUTOVR
     A                                      WINDOW(*DFT 16 51)
     A                                      RTNCSRLOC(&W_ACTR &W_ACTF)
     A            W_ACTR        10A  H
     A            W_ACTF        10A  H
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Skaffeordre'
     A            K1SKAF    R        B  4 15REFFLD(MJSKAF)
     A  31                                  ERRMSGID(LMP0015 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  5  2'Lager . . +'
     A            K1LAGE    R        B  5 15REFFLD(MJLAGE)
     A  32                                  ERRMSGID(LMP0015 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            K1LAGN        20A  O  5 21OVRDTA
7.xx A                                  6  2'Avdeling. +'
     A            K1AVDE    R        B  6 15REFFLD(MJAVDE)
     A  33                                  ERRMSGID(LMP0015 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            K1AVDN        20A  O  6 21OVRDTA
     A                                  8  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                 10  2'Skaffeordre'
     A            K2SKAF    R        O 10 15REFFLD(MJSKAF)
     A                                      OVRDTA
     A                                 11  2'Lager . . .'
     A            K2LAGE    R        O 11 15REFFLD(MJLAGE)
     A                                      OVRDTA
     A            K2LAGN        20A  O 11 21OVRDTA
     A                                 12  2'Avdeling. .'
     A            K2AVDE    R        O 12 15REFFLD(MJAVDE)
     A                                      OVRDTA
     A            K2AVDN        20A  O 12 21OVRDTA
     A                                 14  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
