     A*%%TS  SD  20070531  140023  BOF550      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : MM102D
     A* Beskrivelse . . : Prognose pr.uke , vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       041206 BØ   Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20070531  140023  BOF550      REL-V5R4M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(LÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4)
     A                                      CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A            B1AAR     R        O  8  5REFFLD(MRAAR)
     A            B1ANTR    R        O  8 36REFFLD(MRANTP)
     A                                      EDTCDE(L)
     A            B1ANTP    R        O  8 18REFFLD(MRANTP)
     A                                      EDTCDE(L)
     A            B1UKE     R        O  8 12REFFLD(MRUKE)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20070531  140023  BOF550      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Logistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av antall pr. uke'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Varenr.'
     A            B2VARE    R   -7   O  4 10REFFLD(MRVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2NAVN        20A  O  4 20COLOR(YLW)
     A                                      OVRDTA
     A                                  4 42'Enhet'
     A            B2ENHS    R        O  4 48REFFLD(LÅENHE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  4 52'Lager'
     A            B2LAGE    R        B  4 58REFFLD(LÅLAGE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'2=Endre  3=Kopier  4=Slett'
     A                                      COLOR(BLU)
     A                                  6  2'V   År   Uke   Prognose Antall  Re-
     A                                      gistrert Antall           '
     A                                      COLOR(WHT)
     A            B2AAR     R        B  7  5REFFLD(MRAAR)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            B2UKE     R        B  7 12REFFLD(MRUKE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A          R B2CMD
     A*%%TS  SD  20010919  105848  HKO         REL-V4R4M0  5769-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20070531  140023  BOF550      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Prognose'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av antall pr. uke'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'År . . . . . . . . . . . . .'
     A            C1AAR     R        B  5 31REFFLD(MRAAR)
     A  31                                  ERRMSGID(MMR0010 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                  6  2'Uke  . . . . . . . . . . . .'
     A            C1UKE     R        B  6 31REFFLD(MRUKE)
     A  31                                  ERRMSGID(MMR0010 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  19990316  082956  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Denne År /uke finnes fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20070531  140023  BOF550      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Prognose     '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av prognose pr. uke'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'År   . . . . . . . . . . . .'
     A            C1AAR     R        O  5 31REFFLD(MRAAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Uke  . . . . . . . . . . . .'
     A            C1UKE     R        O  6 31REFFLD(MRUKE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Prognose antall  . . . . . .'
     A            C2ANTP    R        O  8 31REFFLD(MRANTP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTCDE(M)
     A                                  9  2'Registrert antall  . . . . .'
     A            C2ANTR    R        B  9 31REFFLD(MRANTP)
     A  31                                  ERRMSGID(HMR0130 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      EDTCDE(M)
     A                                 18  2'Opprettet dato . . . . . . .'
     A            C2ODAT         6Y 0O 18 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 19  2'Sist endret dato . . . . . .'
     A            C2EDAT         6Y 0O 19 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20  2'Endret av. . . . . . . . . .'
     A            C2EUSR    R        O 20 31REFFLD(MRUSER)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20061228  125116  ASP_VST     REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette Prognose pr. uke'
     A                                      DSPATR(RI)
     A                                  4  2'Varenr . . . . . .'
     A            D1VARE    R        O  4 21REFFLD(MRVARE)
     A                                  5  2'Lager  . . . . . .'
     A            D1LAGE    R        O  5 21REFFLD(MRLAGE)
     A                                  6  2'År . . . . . . . .'
     A            D1AAR     R        O  6 21REFFLD(MRAAR)
     A                                  7  2'Uke  . . . . . . .'
     A                                  8  2'Registrert antall '
     A            D1ANTR    R        O  8 21REFFLD(MRANTR)
     A                                      EDTCDE(L)
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            D1UKE     R        O  7 21REFFLD(MRUKE)
     A          R K1WIN
     A*%%TS  SD  20061228  125116  ASP_VST     REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 20 56)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  3  2'År . . . . . . . .'
     A            K1AAR     R        B  3 21REFFLD(MRAAR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                  4  2'Uke  . . . . . . .'
     A            K1UKE     R        B  4 21REFFLD(MRUKE)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                  8  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  9  2'Varenr.  . . . . .'
     A            MRVARE    R        O  9 21OVRDTA
     A                                 10  2'Lager  . . . . . .'
     A            MRLAGE    R        O 10 21OVRDTA
     A                                 11  2'År . . . . . . . .'
     A            MRAAR     R        O 11 21OVRDTA
     A                                 12  2'Uke  . . . . . . .'
     A            MRUKE     R        O 12 21OVRDTA
     A                                 17  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
