     A*%%TS  SD  20090903  200251  ASK610      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : MS101D
     A* Beskrivelse . . : Lister alle varer uten abc-kode
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       251007 bø   Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20080520  150517  ASK560      REL-V5R4M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1VARE    R   -7   O  8  4REFFLD(VVVARE)
     A            B1TEK1    R        O  8 13REFFLD(VVTEK1)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20090903  195538  ASK610      REL-V5R4M0  5722-WDS
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CF05
     A                                      CF09
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      PUTOVR
     A                                      SFLCSRRRN(&W_CURN)
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre        '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Lagervarer uten ABC-kode'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Lager:'
     A                                      COLOR(WHT)
     A            B2LAGE    R        O  4  9REFFLD(VLLAGE)
     A                                      OVRDTA
     A                                      COLOR(WHT)
     A                                  5  2'2=ABC-kode'
     A                                      COLOR(BLU)
     A                                  6  2'V  Varenr  Varetekst      '
     A                                      COLOR(WHT)
     A            B2VARE    R   -7   B  7  4REFFLD(VVVARE)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2TEK1    R        B  7 13REFFLD(VVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20090903  195538  ASK610      REL-V5R4M0  5722-WDS
     A                                 23  3'F3=Gå ut'
     A                                      COLOR(BLU)
     A                                 23 14'F5=Forny'
     A                                      COLOR(BLU)
     A                                 23 24'F9=Masseoppdatering'
     A                                      COLOR(BLU)
     A*
     A          R C2BLD
     A*%%TS  SD  20041217  103407  BOF530      REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Endre ABC-kode på vare'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenr.  . . . . . . . . . .'
     A            C2VARE    R        O  5 31REFFLD(VVVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Lagernr. . . . . . . . . . .'
     A            C2LAGE    R        O  6 31REFFLD(VLLAGE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Varenavn   . . . . . . . . .'
     A            C2TEK1    R        O  8 31REFFLD(VVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Varens ABC-kode  . . . . . .'
     A            C2KABC    R        B 10 31REFFLD(VLTABC)
     A  31                                  ERRMSGID(MMB0070 *LIBL/QMFLAGR 31)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 18  2'Opprettet dato . . . . . . .'
     A            C2ODAT         6Y 0O 18 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 19  2'Sist endret dato . . . . . .'
     A            C2EDAT         6Y 0O 19 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20  2'Endret av. . . . . . . . . .'
     A            C2USER        10   O 20 31
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20090903  200251  ASK610      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      WINDOW(*DFT 10 48)
     A                                  2  2' Masse oppdatering av ABC-kode'
     A                                      DSPATR(RI)
     A                                  5  2'Valgt ABC-kode:'
     A            D1KABC    R        B  5 18REFFLD(VLTABC)
     A                                  9  3'F3=Gå tilbake '
     A                                      COLOR(BLU)
     A                                  7  5'Alle varer uten ABC-kode får denne-
     A                                       verdi!'
     A                                      COLOR(RED)
