     A*%%TS  SD  20110513  131827  ASK620      REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : MS103D
     A* Beskrivelse . . : Syklisk telling
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       120809 ASK  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R C1BLD
     A*%%TS  SD  20110513  131827  ASK620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager        '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Start syklisk telling'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Ansvarlig   :'
     A            C1ANSV        31A  B  5 16COLOR(YLW)
     A  40                                  ERRMSGID(LMC0100 *LIBL/QMFLAGR 40)
     A                                      OVRDTA
     A                                      DSPATR(PC)
     A            C1ANTA         6Y 0O  5 52COLOR(WHT)
     A                                      EDTCDE(Z)
     A                                  5 60'varer til telling'
     A                                      COLOR(WHT)
     A                                  7  2'Begynt dato :'
     A            C1BDAT         6Y 0B  7 16COLOR(YLW)
     A  41                                  ERRMSGID(LMC0040 *LIBL/QMFLAGR 41)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                  7 27'Begynt kl.  :'
     A            C1BTIM         4Y 0B  7 41COLOR(YLW)
     A  42                                  ERRMSGID(LMC0060 *LIBL/QMFLAGR 42)
     A                                      EDTWRD('  .  ')
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                  7 56'Telle tildeling:'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  8  2'Slutt dato  :'
     A            C1EDAT         6Y 0B  8 16COLOR(YLW)
     A  43                                  ERRMSGID(LMC0050 *LIBL/QMFLAGR 43)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                  8 27'Slutt kl.   :'
     A            C1ETIM         4Y 0B  8 41COLOR(YLW)
     A  44                                  ERRMSGID(LMC0070 *LIBL/QMFLAGR 44)
     A                                      EDTWRD('  .  ')
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                  8 56'Brk1:'
     A            C1BRK1        10A  B  8 62COLOR(YLW)
     A                                      OVRDTA
     A                                      DSPATR(PR)
     A            C1ANT1         6Y 0B  8 74COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      DSPATR(PR)
     A                                  9 56'Brk2:'
     A            C1BRK2        10A  B  9 62COLOR(YLW)
     A                                      OVRDTA
     A                                      DSPATR(PR)
     A            C1ANT2         6Y 0B  9 74COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      DSPATR(PR)
     A                                 10 56'Brk3:'
     A            C1BRK3        10A  B 10 62COLOR(YLW)
     A                                      OVRDTA
     A                                      DSPATR(PR)
     A            C1ANT3         6Y 0B 10 74COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      DSPATR(PR)
     A                                 11  2'Antall på telleliste?'
     A            C1ANTL         1Y 0B 11 24COLOR(YLW)
     A                                 11 26'1=Ja,0=Nei'
     A                                 11 56'Brk4:'
     A            C1BRK4        10A  B 11 62COLOR(YLW)
     A                                      OVRDTA
     A                                      DSPATR(PR)
     A            C1ANT4         6Y 0B 11 74COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      DSPATR(PR)
     A                                 12 56'Brk5:'
     A            C1BRK5        10A  B 12 62COLOR(YLW)
     A                                      OVRDTA
     A                                      DSPATR(PR)
     A            C1ANT5         6Y 0B 12 74COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      DSPATR(PR)
     A                                 13  2'Sortering . . . . . .'
     A            C1SORT         1Y 0B 13 24COLOR(YLW)
     A                                 14 26'2=Lager,vgr,varetekst'
     A                                 15 26'3=Lager,varetekst'
     A                                 16 26'4=Lokasjon,varetekst  '
     A                                 17 26'5=Lager,vgr,varetekst,lokasjon'
     A                                 18 26'6=Lager,lev,vgr,varetekst,lokasjon'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 13 26'1=Lager,vgr,varenr'
     A          R A1WIN
     A*%%TS  SD  20020924  114602  ASK         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 40)
     A                                  2  2' Feilmelding '
     A                                      DSPATR(RI)
     A                                  5  2'Bruker kan ikke administrere '
     A                                  6  2'SYKLISK TELLING              '
     A                                      COLOR(GRN)
