     A*%%TS  SD  20040907  001254  ASK         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : MT100D
     A* Beskrivelse . . : Oversikt over pakker
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
6.30  *  6.30  120515 bkv  Endret LVAR pga økt fra 15 til 20 tegn
7.xx A* 7.xx   180516 bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R B1SFL                     SFL
     A*%%TS  SD  20040906  232920  ASK         REL-V5R2M0  5722-WDS
     A            B1VARE    R        H      REFFLD(MTVARE)
     A            B1VALG    R        B  9  2REFFLD(LÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(2 4 5 7 8 9 0)
     A                                      CHKMSGID(BM00010 *LIBL/QMFVEDL)
     A            B1LVAR    R   -5   O  9  4REFFLD(MTLVAR)
     A            B1LAGE    R        O  9 20REFFLD(MTLAGE)
     A            B1NUMM         6Y 0O  9 23EDTCDE(Z)
     A            B1STAT    R        O  9 30REFFLD(MTSTAT)
     A            B1TOTR    R   -1   O  9 32REFFLD(MTTOTL)
     A                                      EDTWRD('  0 , ')
     A            B1TOTL    R   -1   O  9 39REFFLD(MTTOTL)
     A                                      EDTWRD('  0 , ')
     A                                      COLOR(WHT)
     A            B1MLEN    R        O  9 46REFFLD(MTMLEN)
     A                                      EDTWRD(' ,  ')
     A            B1SLEN    R        O  9 51REFFLD(MTSLEN)
     A                                      EDTWRD(' ,  ')
     A                                      COLOR(WHT)
     A            B1SNIT    R        O  9 56REFFLD(MTSNIT)
     A                                      EDTWRD(' ,  ')
     A            B1TEXT        20A  O  9 61
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20040906  232920  ASK         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CA10
     A                                      CA12
     A                                      CA13
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ACTR &W_ACTF)
     A            W_CURN         5S 0H
     A            W_ACTR        10A  H
     A            W_ACTF        10A  H
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Trelast modul'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oversikt over pakker'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Varenummer. . . .'
     A                                      COLOR(BLU)
     A            B2SLVN    R        B  4 20REFFLD(MTLVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  4 48'Lager .'
     A                                      COLOR(BLU)
     A            B2SLAG         2A  B  4 56COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  5  4'Varenummer'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 24'Pakke'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  2'2=Endre  4=Slett  5=Vis pakke  7=L-
     A                                      engdefordeling  8=Historikk  9=Lage-
     A                                      r'
     A                                      COLOR(BLU)
7.xx A                                  8  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  8  4'Varenummer'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 20'LG'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 24'Pakke'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 30'S'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 33'Rest'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 40'Oppr'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 47'Min'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 52'Max'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 56'Snitt'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 62'Varetekst    '
7.xx A**                                8  2'V Varenummer      Lg  Pakke S  Res-
7.xx A**                                    t   Oppr   Min  Max Snitt  Vareteks-
7.xx A**                                    t    '
     A                                      COLOR(WHT)
7.xx A            B2LVAR    R   -5   B  6  4REFFLD(MTLVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A            B2NUMM         6Y 0B  6 23COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A            B2FUNK        10A  O  4 67DSPATR(RI)
     A                                      OVRDTA
7.xx A**                                4 44'F4'
7.xx A**                                4 59'F4'
7.xx A**                                8 20'F4'
     A          R B2CMD
     A*%%TS  SD  20040907  001254  ASK         REL-V5R2M0  5722-WDS
     A                                 22  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 22 17'F5=Forny'
     A                                      COLOR(BLU)
     A                                 22 27'F7=Vis alle'
     A                                      COLOR(BLU)
     A                                 22 40'F8=Vis bare delte'
     A                                      COLOR(BLU)
     A                                 22 59'F9=Vis slettede/tomme'
     A                                      COLOR(BLU)
     A                                 23 28'F10=Hent fra Tredata'
     A                                      COLOR(BLU)
     A                                 23  2'F6=Opprett pakke manuelt'
     A                                      COLOR(BLU)
     A                                 23 51'F13=Statuskoder'
     A                                      COLOR(BLU)
     A          R B4WIN
     A*%%TS  SD  20040827  104026  ASK         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 9 45)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette pakke '
     A                                      DSPATR(RI)
     A                                  4  2'Pakkenr.. :'
     A            B4NUMM         6Y 0O  4 14COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  5  2'Varenummer:'
     A            B4LVAR    R        O  5 14REFFLD(MTLVAR)
     A            B4TEXT        30A  O  6 14COLOR(YLW)
     A                                  8  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20040902  120501  ASK         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Trelastmodul'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Manuell pakkeregistrering'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Pakkenummer.'
     A            C1NUMM    R        B  5 15REFFLD(MTNUMM)
     A  35                                  ERRMSGID(MMT0010 *LIBL/QMFLAGR 35)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20040902  205619  ASK         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CF07
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Trelastmodul'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Pakkedetaljer      '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            C2FUNK         5   O  4 73DSPATR(RI)
     A                                  5  2'Pakkenummer.'
     A            C2NUMM    R        O  5 15REFFLD(MTNUMM)
     A                                      EDTCDE(Z)
     A                                  5 26'Artikkel'
     A            C2LVAR    R        B  5 35REFFLD(MTLVAR)
     A  35                                  ERRMSGID(MMT0020 *LIBL/QMFLAGR 35)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                  5 57'F4'
     A                                  5 63'Lager'
     A            C2LAGE    R        B  5 69REFFLD(MTLAGE)
     A  36                                  ERRMSGID(MMT0030 *LIBL/QMFLAGR 36)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                  5 72'F4'
     A                                  6  2'Varenummer .'
     A            C2VARE         8S 0O  6 15
     A            C2TEXT        35A  O  6 35
     A                                  7  2'Nobbnummer .'
     A            C2NOBB    R        O  7 15REFFLD(MTNOBB)
     A                                  8  2'Produsert..'
     A            C2PDAT         6Y 0O  8 14EDTWRD('  .  .  ')
     A            C2PTID         6Y 0O  8 23EDTWRD('  .  .  ')
     A                                 10  2'Antall i pk .'
     A            C2TANT    R        B 10 16REFFLD(MTTANT)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 10 26'Nom. tykkelse'
     A            C2NTYK    R        B 10 40REFFLD(MTNTYK)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 10 50'Pakke type. . .'
     A            C2PTYP    R        B 10 66REFFLD(MTPTYP)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 11  2'LM i pk . . .'
     A            C2TOTL    R        B 11 16REFFLD(MTTOTL)
     A                                      EDTWRD('   0 , ')
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 11 26'Nom. bredde .'
     A            C2NBRE    R        B 11 40REFFLD(MTNBRE)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 11 50'Serie nr. . . .'
     A            C2SERI    R        B 11 66REFFLD(MTSERI)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 12  2'Min. lengde .'
     A            C2MLEN    R        B 12 16REFFLD(MTMLEN)
     A                                      EDTWRD(' ,  ')
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 12 26'Akt. tykkelse'
     A            C2ATYK    R        B 12 40REFFLD(MTATYK)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 12 50'Linje nr. . . .'
     A            C2LINE    R        B 12 66REFFLD(MTLINE)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 13  2'Max. lengde .'
     A            C2SLEN    R        B 13 16REFFLD(MTSLEN)
     A                                      EDTWRD(' ,  ')
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 13 26'Akt. bredde .'
     A            C2ABRE    R        B 13 40REFFLD(MTABRE)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 13 50'Pakke korrigert'
     A            C2KORR    R     Y  B 13 66REFFLD(MTKORR)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 14  2'Snitt lengde'
     A            C2SNIT    R        B 14 16REFFLD(MTSNIT)
     A                                      EDTWRD(' ,  ')
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 14 50'Lengde justert.'
     A            C2LJUS    R        B 14 66REFFLD(MTLJUS)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 17  2'Antall korte.'
     A            C2KANT    R        B 17 16REFFLD(MTKANT)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 17 26'Nom. M3 . . .'
     A            C2NOMK    R        B 17 40REFFLD(MTNOMK)
     A                                      EDTWRD('0 ,   ')
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 17 49'Ordre nummer. .'
     A            C2ORDN    R        B 17 65REFFLD(MTORDN)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 18  2'Lm korte. . .'
     A            C2TOTK    R        B 18 16REFFLD(MTTOTK)
     A                                      EDTWRD('   0 , ')
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 18 26'Akt. M3 . . .'
     A            C2AKTK    R        B 18 40REFFLD(MTAKTK)
     A                                      EDTWRD('0 ,   ')
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 18 49'Kunde nummer. .'
     A            C2KUND    R        B 18 65REFFLD(MTKUND)
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 19  2'Prosent korte'
     A            C2PROS    R        B 19 16REFFLD(MTPROS)
     A                                      EDTWRD(' 0 ,  ')
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 19 26'Nom. M3 korte'
     A            C2KNOK    R        B 19 40REFFLD(MTKNOK)
     A                                      EDTWRD('0 ,   ')
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 19 49'Pakke status. .'
     A            C2STAT         1A  O 19 65
     A                                 20  2'Vekt. . . . .'
     A            C2VEKT    R        B 20 16REFFLD(MTVEKT)
     A                                      EDTWRD('  0 , ')
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 20 26'Akt. M3 korte'
     A            C2KAKK    R        B 20 40REFFLD(MTKAKK)
     A                                      EDTWRD('0 ,   ')
     A                                      COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                 20 49'Rest. lengde. .'
     A            C2RESL    R        O 20 65REFFLD(MTTOTL)
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F7=Lengdefordeling '
     A                                      COLOR(BLU)
     A          R D1BLD
     A*%%TS  SD  20040901  221904  ASK         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Trelastmodul'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Lengdefordeling    '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Pakkenummer.'
     A            D1NUMM    R        O  4 15REFFLD(MTNUMM)
     A                                      EDTCDE(Z)
     A                                  5  2'Varenr . . .'
     A            D1LVAR    R        O  5 15REFFLD(MTLVAR)
     A            D1TEXT        35A  O  5 38
     A                                  7  3'Lengdefordeling i Dm-grupper'
     A                                      COLOR(BLU)
     A                                  9  3'Dm 18'
     A            D1DM18    R        B  9 10REFFLD(MTDM18)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                  9 16'Dm 20'
     A            D1DM20    R        B  9 23REFFLD(MTDM20)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                  9 29'Dm 30'
     A            D1DM30    R        B  9 36REFFLD(MTDM30)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                  9 42'Dm 40'
     A            D1DM40    R        B  9 49REFFLD(MTDM40)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                  9 55'Dm 50'
     A            D1DM50    R        B  9 62REFFLD(MTDM50)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                  9 68'Dm 60'
     A            D1DM60    R        B  9 75REFFLD(MTDM60)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 10  3'Dm 19'
     A            D1DM19    R        B 10 10REFFLD(MTDM19)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 10 16'Dm 21'
     A            D1DM21    R        B 10 23REFFLD(MTDM21)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 10 29'Dm 31'
     A            D1DM31    R        B 10 36REFFLD(MTDM31)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 10 42'Dm 41'
     A            D1DM41    R        B 10 49REFFLD(MTDM41)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 10 55'Dm 51'
     A            D1DM51    R        B 10 62REFFLD(MTDM51)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 10 68'Dm 61'
     A            D1DM61    R        B 10 75REFFLD(MTDM61)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 11 16'Dm 22'
     A            D1DM22    R        B 11 23REFFLD(MTDM22)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 11 29'Dm 32'
     A            D1DM32    R        B 11 36REFFLD(MTDM32)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 11 42'Dm 42'
     A            D1DM42    R        B 11 49REFFLD(MTDM42)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 11 55'Dm 52'
     A            D1DM52    R        B 11 62REFFLD(MTDM52)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 11 68'Dm 62'
     A            D1DM62    R        B 11 75REFFLD(MTDM62)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 12 16'Dm 23'
     A            D1DM23    R        B 12 23REFFLD(MTDM23)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 12 29'Dm 33'
     A            D1DM33    R        B 12 36REFFLD(MTDM33)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 12 42'Dm 43'
     A            D1DM43    R        B 12 49REFFLD(MTDM43)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 12 55'Dm 53'
     A            D1DM53    R        B 12 62REFFLD(MTDM53)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 13 16'Dm 24'
     A            D1DM24    R        B 13 23REFFLD(MTDM24)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 13 29'Dm 34'
     A            D1DM34    R        B 13 36REFFLD(MTDM34)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 13 42'Dm 44'
     A            D1DM44    R        B 13 49REFFLD(MTDM44)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 13 55'Dm 54'
     A            D1DM54    R        B 13 62REFFLD(MTDM54)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 14 16'Dm 25'
     A            D1DM25    R        B 14 23REFFLD(MTDM25)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 14 29'Dm 35'
     A            D1DM35    R        B 14 36REFFLD(MTDM35)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 14 42'Dm 45'
     A            D1DM45    R        B 14 49REFFLD(MTDM45)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 14 55'Dm 55'
     A            D1DM55    R        B 14 62REFFLD(MTDM55)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 15 16'Dm 26'
     A            D1DM26    R        B 15 23REFFLD(MTDM26)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 15 29'Dm 36'
     A            D1DM36    R        B 15 36REFFLD(MTDM36)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 15 42'Dm 46'
     A            D1DM46    R        B 15 49REFFLD(MTDM46)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 15 55'Dm 56'
     A            D1DM56    R        B 15 62REFFLD(MTDM56)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 16 16'Dm 27'
     A            D1DM27    R        B 16 23REFFLD(MTDM27)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 16 29'Dm 37'
     A            D1DM37    R        B 16 36REFFLD(MTDM37)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 16 42'Dm 47'
     A            D1DM47    R        B 16 49REFFLD(MTDM47)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 16 55'Dm 57'
     A            D1DM57    R        B 16 62REFFLD(MTDM57)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 17 16'Dm 28'
     A            D1DM28    R        B 17 23REFFLD(MTDM28)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 17 29'Dm 38'
     A            D1DM38    R        B 17 36REFFLD(MTDM38)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 17 42'Dm 48'
     A            D1DM48    R        B 17 49REFFLD(MTDM48)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 17 55'Dm 58'
     A            D1DM58    R        B 17 62REFFLD(MTDM58)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 18 16'Dm 29'
     A            D1DM29    R        B 18 23REFFLD(MTDM29)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 18 29'Dm 39'
     A            D1DM39    R        B 18 36REFFLD(MTDM39)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 18 42'Dm 49'
     A            D1DM49    R        B 18 49REFFLD(MTDM49)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 18 55'Dm 59'
     A            D1DM59    R        B 18 62REFFLD(MTDM59)
     A                                      EDTCDE(Z)
     A  31                                  COLOR(YLW)
     A  31                                  DSPATR(PR)
     A                                 22  7'F3=Tilbake'
     A                                      COLOR(BLU)
     A          R H2WIN
     A*%%TS  SD  20040907  001254  ASK         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      WINDOW(*DFT 11 30)
     A                                  2  2'Statuskoder'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4  2' '
     A                                  4  5'Pakken er ubrukt'
     A                                  6  2'R'
     A                                  6  5'Pakken er reservert'
     A                                  8  2'S'
     A                                  8  5'Pakken er slettet'
     A                                  5  2'D'
     A                                  5  5'Pakken er delt'
     A                                  7  2'B'
     A                                  7  5'Pakken er brukt'
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
