     A*%%TS  SD  20030930  102532  MHA         REL-V5R2M0  5722-WDS
     A*%%EC
     A*          130318 bsa  Nytt program
     A*-----------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20021021  130850  HKO         REL-V5R1M0  5722-WDS
     A**          B1VALG    R        B  9  2REFFLD(FÅVALG)
     A**                                    COLOR(YLW)
     A**                                    VALUES(1 0)
     A**                                    CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1LINE    R        O  9  4REFFLD(NDLINE)
     A            B1OLIN    R        O  9  9REFFLD(FDLINE)
     A            B1ANTA    R        O  9 14REFFLD(NDANTA)
     A            B1ENHE    R        O  9 28REFFLD(NDENHE)
     A            B1VARE         8A  O  9 32
     A            B1TEK1        24A  O  9 41
     A            B1LDAT         6Y 0O  9 70EDTWRD('  .  .  ')
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20030930  102532  MHA         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF08
     A                                      CF09
     A                                      CA12
     A                                      CF13
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise ordrelinjer etter referanse'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Eksternreferanse'
     A                                      COLOR(BLU)
     A            B2NREF    R        O  4 19REFFLD(NONREF)
     A                                      COLOR(BLU)
     A                                  4 35'Kundenr'
     A            B2KUND         6Y 0O  4 43
     A            B2KNAV        25A  O  4 51
     A                                  5 35'Levnr. '
     A            B2LDOR         6Y 0O  5 43
     A                                      EDTCDE(Z)
     A            B2LNAV        25A  O  5 51
      *
     A                                  5  4'Linnr'
     A                                      COLOR(WHT)
     A*                                 7  2'1=Velg'
     A*                                     COLOR(BLU)
      *
     A*                                 8  2'V'
     A*                                     COLOR(WHT)
     A                                  8  4'Lin'
     A                                      COLOR(WHT)
     A                                  8  9'Olin'
     A                                      COLOR(WHT)
     A                                  8 18'Bestilt'
     A                                      COLOR(WHT)
     A                                  8 28'Enh'
     A                                      COLOR(WHT)
     A                                  8 32'Varenr  '
     A                                      COLOR(WHT)
     A                                  8 41'Varetekst         '
     A                                      COLOR(WHT)
     A                                  8 70'Lev.dato'
     A                                      COLOR(WHT)
      *
     A            B2LINE    R        B  6  4REFFLD(NDLINE)
     A* 31                                  ERRMSG('Kan ikke overføre varer med-
     A*                                      status 1-3' 31)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20021001  150320  HKO         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake  F5=Forny'
     A                                      COLOR(BLU)
