     A*%%TS  SD  20021008  161101  HKO         REL-V5R1M0  5722-WDS
      *
7.01  * 7.00  270619 bsa  Mottak av EDI bestilling/ordre
7.02  * 7.00  120719 bsa  Ny statuskode
      *
     A*%%EC
7.xx A                                      DSPSIZ(24 80 *DS3 -
7.xx A                                             27 132 *WIDE)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20021008  161101  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 40)
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Statuskoder '
     A                                      DSPATR(RI)
     A                                  4  2'1 = Ugyldig vare'
     A                                  5  2'2 = Ugyldig antall'
     A                                  6  2'3 = Ugyldig enhet'
7.01 A                                  7  2'4 = Avvik i GTIN nummer'
     A                                  8  2'5 = Ugyldig leveringstype'
     A                                  9  2'6 = Ugyldig leveringsdato'
     A                                 10  2'7 = Vare er utgått'
7.01 A                                 11  2'8 = Ikke lagervare'
7.02 A                                 12  2'9 = Skaffevare'
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
