     A*%%TS  SD  20051201  103754  HKO550      REL-V5R3M0  5722-WDS
     A*%%EC
7.00 A                                      DSPSIZ(24 80 *DS3 -
7.00 A                                             27 132 *WIDE)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20051201  103754  HKO550      REL-V5R3M0  5722-WDS
7.00 A            B1VALG    R        B  8  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(MM00010 *LIBL/QMFUMAL)
7.00 A            B1KODE    R        O  8  5REFFLD(NKKODE)
7.00 A            B1BESK    R        O  8 11REFFLD(NKBESK)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20051201  103754  HKO550      REL-V5R3M0  5722-WDS
7.00 A                                      SFLSIZ(0008)
7.00 A                                      SFLPAG(0007)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Velge kode for ordre-mottak '
     A                                      DSPATR(RI)
7.00 A                                  4  5'Kode'
7.00 A                                      COLOR(WHT)
7.00 A                                  4 11'Beskrivelse'
     A                                      COLOR(WHT)
7.00 A            B2KODE    R        B  5  5REFFLD(NKKODE)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.00 A            B2BESK    R        B  5 11REFFLD(NKBESK)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.00 A                                  6  2'1=Velg'
     A                                      COLOR(BLU)
7.00 A                                  7  2'V'
7.00 A                                      COLOR(WHT)
7.00 A                                  7  5'Kode'
7.00 A                                      COLOR(WHT)
7.00 A                                  7 11'Beskrivelse'
7.00 A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  19990114  171537  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 17 50)
     A                                 16  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
