     A*%%TS  SD  20170404  122620  ASP_D01     REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : Nexstep Light
     A* Format. . . . . : NL30
     A* Beskrivelse . . : Vedlikehold av faste registre
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
6.20 A*       310314 nho  Lagt inn nytt menypunkt 26, vedrlikehold av
6.20 A*                   prosjekt
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20170404  122620  ASP_D01     REL-V7R1M0  5770-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av faste registre'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  7'Vedlikehold av:'
     A                                      COLOR(WHT)
     A                                  5 46'Økonomi, Vedlikehold av:'
     A                                      COLOR(WHT)
     A                                  6  8'1. Varer'
     A                                  6 46'21. Kunder        '
     A                                  7  8'2. GTIN-nummer'
     A                                  7 46'22. Kundeprosjekt        '
     A                                  8  8'3. Gebyr/påslag '
     A                                  8 46'23. Leverandører '
     A                                  9  8'4. Prisoppdatering        '
     A                                  9 46'24. Selger                '
     A                                 10  8'5. Tilbudspriser          '
     A                                 10 46'25. Knytte leverandører   '
     A                                 11  8'6. Etiketter              '
     A                                 12  8'7. Etikettkoder, leverandører'
     A                                 13  8'8. Rabattmatrise             '
     A                                 14  8'9. Rabattkategori            '
     A                                 15  7'10. Varegrupper'
     A                                 17  7'Innlesing av :'
     A                                      COLOR(WHT)
     A                                 18  7'31. Optimera kampanje'
     A                                 21 30'Valg:'
     A            VALG           2Y 0B 21 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
NL   A**                               23  2'F1=Velg firma'
NL   A**                                    COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 11 46'26. Prosjekt'
