     A*%%TS  SD  20021021  104016  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20021021  104016  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 34)
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Melding '
     A                                      DSPATR(RI)
     A            B1MLD1        32A  O  4  2
     A            B1MLD2        32A  O  5  2
     A            B1MLD3        32A  O  6  2
     A            B1MLD4        32A  O  7  2
     A            B1MLD5        32A  O  8  2
     A            B1MLD6        32A  O  9  2
     A            B1MLD7        32A  O 10  2
     A            B1MLD8        32A  O 11  2
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
