     A*%%TS  SD  20060508  222615  HKO540      REL-V5R3M0  5722-WDS
     A*%%EC
7.xx A                                      DSPSIZ(24 80 *DS3 -
7.xx A                                             27 132 *WIDE)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20060508  222615  HKO540      REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 13 53)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Overføring av ekstern ordre til o-
     A                                      rdre '
     A                                      DSPATR(RI)
     A                                  5  2'Ordre-type . . . .'
     A            B1OTYP    R        B  5 21REFFLD(FOOTYP)
     A  31                                  ERRMSGID(FMA0260 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VMA5040 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A  41                              7  2' KUNDEN ER KREDITTSPERRET, OG ORDR-
     A                                      E KAN IKKE       '
     A                                      DSPATR(RI)
     A                                      COLOR(RED)
     A  41                              8  2' OVERFØRES !                      -
     A                                                       '
     A                                      DSPATR(RI)
     A                                      COLOR(RED)
     A  42                             10  2' KUNDEN HAR OVERSKREDET KREDITTGRE-
     A                                      NSE.             '
     A                                      DSPATR(RI)
     A                                      COLOR(RED)
     A  43                             10  2' KUNDEN HAR OVERSKREDET BELØPSGREN-
     A                                      SE ALMENNING     '
     A                                      DSPATR(RI)
     A                                      COLOR(RED)
     A                                 12  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
