     A*%%TS  SD  20070309  153346  KOB         REL-V5R4M0  5722-WDS
     A*%%EC
7.xx A*          290116 bsa  Justeringer basert på ny GUI og regler
Q.01 A*     bsa  080219    Quick wins tilpasninger - breder skjerm
     A*-----------------------------------------------------------------
Q.01 A                                      DSPSIZ(24 80 *DS3 -
Q.01 A                                             27 132 *WIDE)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R E2BLD
     A*%%TS  SD  20070309  153346  KOB         REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 18 40)
     A                                      CF03
     A                                      KEEP
     A                                      OVERLAY
     A                                  2  2'Utskrift av tilbud'
     A                                      COLOR(WHT)
7.xx A                                  2 30'FO600E2'
     A                                  4  2'Alternativ. . .'
7.xx A            E2VALG    R        B  4 18REFFLD(FÅSVA2)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2 3 4)
7.xx A                                  4 21'0=Standard forslag,'
7.xx A                                  5 21'1=Netto priser,'
7.xx A                                  6 21'2=Kun priser,'
7.xx A                                  7 21'3=Spesial/15,'
     A                                  8 21'4=Kun summer'
     A                                 10  2'Start utskrift.'
7.xx A            E2SVAR    R        B 10 18REFFLD(FÅSVA2)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      VALUES(0 1 2 3)
6.20 A  36                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
7.xx A                                 10 21'0=Fellesutkjøring'
7.xx A                                 11 21'1=Direkte'
7.xx A                                 12 21'2=Via jobbkø'
PDF  A N35                             13 21'3=Som e-mail'
     A                                 15  2'Alt. utkø . . .'
     A            E2OUTQ    R        B 15 18REFFLD(FK1UTQ)
     A  31                                  ERRMSGID(FM01060 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FM01070 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                 15 30'(Skriver)'
     A                                 17  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R E3BLD
     A*%%TS  SD  20021018  144235  AMD         REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      KEEP
     A                                      OVERLAY
7.xx A                                      WINDOW(*DFT 15 45)
     A                                  2  2'Utskrift av interne ordrepapirer'
     A                                      COLOR(WHT)
7.xx A                                  2 38'FO600E3'
     A                                  4  2'Alternativ . .'
7.xx A            E3VALG    R        B  4 17REFFLD(FÅSVA2)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A  34                                  ERRMSGID(FM00010 *LIBL/QMFOFAK 34)
     A                                      COLOR(YLW)
     A            E3BTX1    R   +2   O  4 20REFFLD(VABTX1)
     A            E3BTX2    R   +2   O  5 20REFFLD(VABTX2)
     A                                  7  2'Start utskrift'
7.xx A            E3SVAR    R        B  7 17REFFLD(FÅSVA2)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      VALUES(0 1 2 3)
6.20 A  36                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
7.xx A                                  7 20'0=Fellesutkjøring,'
7.xx A                                  8 20'1=Direkte,'
7.xx A                                  9 20'2=Jobbkø,'
7.xx A N35                             10 20'3=E-mail'
     A                                 12  2'Alt. utkø. . :'
     A            E3OUTQ    R        B 12 17REFFLD(FK1UTQ)
     A  31                                  ERRMSGID(FM01060 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FM01070 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                 12 29'(Skriver)'
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R E4BLD
     A*%%TS  SD  20021018  144235  AMD         REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      KEEP
     A                                      OVERLAY
     A                                      WINDOW(*DFT 12 45)
     A                                  2  2'Utskrift av pakkseddel-papirer'
     A                                      COLOR(WHT)
     A                                  4  2'Start utskrift'
7.xx A            E4SVAR    R        B  4 18REFFLD(FÅSVA2)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      VALUES(0 1 2)
     A                                      COLOR(YLW)
     A  33                                  ERRMSGID(FMO0700 *LIBL/QMFOFAK 33)
7.xx A                                  4 21'0=Fellesutkjøring,'
7.xx A                                  5 21'1=Direkte,'
7.xx A                                  6 21'2=Jobbkø'
     A                                  8  2'Alt. utkø. . :'
     A            E4OUTQ    R        B  8 18REFFLD(FK1UTQ)
     A  31                                  ERRMSGID(FM01060 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FM01070 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                  8 30'(Skriver)'
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R E5BLD
     A*%%TS  SD  19980513  143311  AMD         REL-V3R7M0  5716-PW1
     A                                      WINDOW(*DFT 12 45)
     A                                      CF03
     A                                      KEEP
     A                                      OVERLAY
     A                                  2  2'Utskrift av faktura/kreditnota'
     A                                      COLOR(WHT)
     A                                  4  2'Start utskrift'
7.xx A            E5SVAR    R        B  4 18REFFLD(FÅSVA2)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      VALUES(0 1 2)
     A                                      COLOR(YLW)
7.xx A                                  4 21'0=Fellesutkjøring,'
7.xx A                                  5 21'1=Direkte,'
7.xx A                                  6 21'2=Jobbkø'
     A                                  8  2'Alt. utkø. . :'
     A            E5OUTQ    R        B  8 18REFFLD(FK1UTQ)
     A  31                                  ERRMSGID(FM01060 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FM01070 *LIBL/QMFOFAK 32)
     A  33                                  ERRMSGID(FM00800 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                  8 30'(Skriver)'
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
