     A*%%TS  SD  20061225  200138  KOB         REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RA001D
     A* Beskrivelse . . : Statuskoder, vedlikehold av regnskapskoder
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A2BLD
     A*%%TS  SD  20061225  200138  KOB         REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av koder'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5 34'HOVEDBOKSKODER'
     A                                  7  3'Antall perioder . . .:'
     A            A21APE    R        B  7 26REFFLD(RA1APE)
     A                                      DLTCHK
     A  33                                  ERRMSGID(RMA0300 *LIBL/QMFOKON 33)
     A                                      DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                  7 43'Avsluttet periode. .:'
     A            A21PER    R        B  7 65REFFLD(RA1PER)
     A                                      DLTCHK
     A  34                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 34)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A21AAR    R        B  7 68REFFLD(RA1AAR)
     A                                      DLTCHK
     A  35                                  ERRMSGID(RMA0320 *LIBL/QMFOKON 35)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                  9  3'Øvre grense konto . .:'
     A            A21HKT    R        B  9 26REFFLD(RA1HKT)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                  9 43'Øvre grense kundenr.:'
     A            A21HRS    R        B  9 65REFFLD(RA1HRS)
     A                                      DLTCHK
     A  31                                  ERRMSGID(RMA0350 *LIBL/QMFOKON 31)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 11  3'Avdeling. . . . . . .:'
     A            A21ARS    R        B 11 26REFFLD(RA1ARS)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 11 28'(0/1)'
     A                                 11 43'Like perioder. . . .:'
     A            A21AVS    R        B 11 65REFFLD(RA1AVS)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      TEXT('Like perioder')
     A                                 11 68'(0/1)'
     A                                 12  3'Bruk kostnadsbærer. .:'
     A            A23BÆR    R        B 12 26REFFLD(RA3BÆR)
     A                                      COLOR(YLW)
     A                                      VALUES('J' 'N' ' ')
     A                                      OVRDTA
     A                                 12 28'(J/N)'
     A                                 12 43'Test mot bilagsnr. .:'
     A            A21BNR    R        B 12 65REFFLD(RA1BNR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 12 68'(J/N)'
     A                                 13 43'Benytt buntsum . . .:'
     A            A21BUN    R        B 13 65REFFLD(RA1BUN)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 13 68'(J/N)'
     A                                 14 43'Strekkode på bilag .:'
     A            A21SKD    R        B 14 65REFFLD(RA1SKD)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      VALUES('J' 'N' 'R')
     A                                 14 68'(J/N/R)'
     A                                 15  3'Avvikende regnskapsår:'
     A                                 15 43'Preregistrering. . .:'
     A            A21PRE    R        B 15 65REFFLD(RA1PRE)
     A                                      COLOR(YLW)
     A                                      VALUES('J' 'N' ' ')
     A                                      OVRDTA
     A                                 15 68'(J/N)'
     A                                 16  3'Regnskapsårets start.:'
     A            A23STP    R        B 16 26REFFLD(RA3STP)
     A                                      DLTCHK
     A  36                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 36)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 17  3'Måneder . . . . . . .: 01  02  03 -
     A                                       04  05  06  07  08  09  10  11  12-
     A                                        13'
     A                                 18  3'Regnskapsperioder . .:'
     A            A23P01    R        B 18 26REFFLD(RA3P01)
     A  37                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 37)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23P02    R        B 18 30REFFLD(RA3P02)
     A  38                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 38)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23P03    R        B 18 34REFFLD(RA3P03)
     A  39                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 39)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23P04    R        B 18 38REFFLD(RA3P04)
     A  40                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 40)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23P05    R        B 18 42REFFLD(RA3P05)
     A  41                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 41)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23P06    R        B 18 46REFFLD(RA3P06)
     A  42                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 42)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23P07    R        B 18 50REFFLD(RA3P07)
     A  43                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 43)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23P08    R        B 18 54REFFLD(RA3P08)
     A  44                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 44)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23P09    R        B 18 58REFFLD(RA3P09)
     A  45                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 45)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23P10    R        B 18 62REFFLD(RA3P10)
     A  46                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 46)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23P11    R        B 18 66REFFLD(RA3P11)
     A  47                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 47)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23P12    R        B 18 70REFFLD(RA3P12)
     A  48                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 48)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23P13    R        B 18 74REFFLD(RA3P13)
     A  49                                  ERRMSGID(RMA0310 *LIBL/QMFOKON 49)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 20  3'Sist endret dato. . .:'
     A            A21DAT         6Y 0O 20 26COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 21  3'Endret av . . . . . .:'
     A            A21USR    R        O 21 26REFFLD(RÅEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 19'F4=Forespørsel'
     A                                      COLOR(BLU)
