     A*%%TS  SD  20050417  130029  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RA000D
     A* Beskrivelse . . : Statuskoder, vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  020316  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A2BLD
     A*%%TS  SD  20050417  130029  KOB         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av koder'
     A                                      COLOR(WHT)
7.xx A                                  2 38'RA000A2'
7.xx A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6 14'00. Firmaopplysninger'
     A                                  7 14'01. Regnskapskoder'
     A                                  8 14'02. OCR-koder'
     A                                  9 14'03. Reskontrokoder'
     A                                 10 14'04. Sist brukte nummer'
     A                                 11 14'05. Betalingsvarsel'
     A                                 12 14'06. Rentenota'
     A                                 13 14'07. Redigere registreringsbildet'
     A                                 14 14'08. E-handelsinformasjon'
     A                                 15 14'09. Factoringinformasjon'
     A                                 17 14'Valg:'
     A            A2VALG         2Y 0B 17 20DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A  31                                  DSPATR(PC)
     A  31                                  ERRMSGID(RM00010 *LIBL/QMFOKON 31)
     A                                      CHECK(RZ)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
