     A*%%TS  SD  20031012  091253  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RA005D
     A* Beskrivelse . . : Statuskoder, vedlikehold renter/purring
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20031012  083721  KOB         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av koder'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5 26'Renteberegning'
     A                                      COLOR(WHT)
     A                                  7  5'Rente-% p.a. . . . .:'
     A            A26PPR    R        B  7 27REFFLD(RA6PPR)
     A                                      DSPATR(UL)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      EDTCDE(1)
     A                                  7 34'2 desimaler'
     A                                  8  5'Negative poster ut .:'
     A            A26PNU    R        B  8 27REFFLD(RA6PNU)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                  8 30'(J=Ja)'
     A                                  9  5'Rentegrense. . . . .:'
     A            A26PGR    R        B  9 27REFFLD(RA6PGR)
     A                                      DSPATR(UL)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 10  5'Sist kjørt rentenota:'
     A            A26PDA         6Y 0O 10 27DSPATR(UL)
     A                                      OVRDTA
     A                                      EDTWRD('  .  .  ')
     A                                 11  5'Antall løpedager . .:'
     A            A26PLD    R        B 11 27REFFLD(RA6PLD)
     A                                      DSPATR(UL)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 12  5'Rentegrense pr. fakt:'
     A            A26PFG    R        B 12 27REFFLD(RA6PFG)
     A                                      DSPATR(UL)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 13  5'Forfalt ikke betalt.:'
     A            A26PIB    R        B 13 27REFFLD(RA6PIB)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                 13 30'(J=Ja)'
     A                                 14  5'Oppdatere regnskap .:'
     A            A26POR    R        B 14 27REFFLD(RA6POR)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      VALUES('J' ' ')
     A                                 14 30'(J=Ja)'
     A                                 15  5'Bet.bet rentenota. .:'
     A            A26PBT    R        B 15 27REFFLD(RA6PBT)
     A  46                                  ERRMSGID(RM01010 *LIBL/QMFOKON 45)
     A                                      DSPATR(UL)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 16  5'Renter ved purring .:'
     A            A26RPU    R        B 16 27REFFLD(RA6RPU)
     A                                      VALUES('J' ' ')
     A                                      DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      OVRATR
     A                                 16 30'(J=Ja)'
     A                                 17  5'Kontaktperson. . . .:'
     A            A26KPR    R        B 17 27REFFLD(RA6KPR)
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 21  5'Sist endret dato . .:'
     A            A26DAT         6Y 0O 21 27COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22  5'Endret av. . . . . .:'
     A            A26USR    R        O 22 27REFFLD(RÅEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 24  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 24 20'F4=Spørring'
     A                                      COLOR(BLU)
