     A*%%TS  SD  20031005  235027  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RA001D
     A* Beskrivelse . . : Statuskoder, vedlikehold av regnskapskoder
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A2BLD
     A*%%TS  SD  20031005  235027  KOB         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av koder'
     A                                      COLOR(WHT)
7.xx A                                  2 38'RA008A2'
7.xx A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5 34'E-handelsinformasjon'
     A                                  7  3'Hoved EAN-nummer. . .:'
     A                                  9  3'Postkasse IBM . . . .:'
     A                                 11  3'Testmodus . . . . . .:'
     A                                 19  3'Sist endret dato. . .:'
     A                                 20  3'Endret av . . . . . .:'
     A                                 23  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 19'F4=Forespørsel'
     A                                      COLOR(BLU)
7.xx A                                 11 28'(T=Test)'
7.xx A                                      COLOR(WHT)
7.xx A                                 11 48'Slett T for å slå av'
7.xx A                                      COLOR(WHT)
     A            A28EAN    R        B  7 26REFFLD(RA8EAN)
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A            A28IBM    R        B  9 26REFFLD(RA8IBM)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      OVRATR
     A            A28TST    R        B 11 26REFFLD(RA8TST)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      OVRATR
     A            A28DAT         6Y 0O 19 26COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A            A28USR    R        O 20 26REFFLD(RA8USR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
