     A*%%TS  SD  20051225  130438  KOB550      REL-V5R3M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RA003D
     A* Beskrivelse . . : Statuskoder, vedlikehold av reskontrokoder
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A2BLD
     A*%%TS  SD  20051225  130438  KOB550      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av reskontrokoder'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  4'Aldersfordeling:'
     A                                  5 31'Kunder'
     A                                  5 39'Leverandører'
     A                                  6  6'Periode 1 - 0-A . . .:'
     A            A23KA1    R        B  6 32REFFLD(RA3KA1)
     A  33                                  ERRMSGID(RMA0500 *LIBL/QMFOKON 33)
     A                                      DSPATR(UL)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23LA1    R        B  6 44REFFLD(RA3LA1)
     A  37                                  ERRMSGID(RMA0500 *LIBL/QMFOKON 37)
     A                                      DSPATR(UL)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                  7  6'Periode 2 - A-B . . .:'
     A            A23KA2    R        B  7 32REFFLD(RA3KA2)
     A  34                                  ERRMSGID(RMA0500 *LIBL/QMFOKON 34)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23LA2    R        B  7 44REFFLD(RA3LA2)
     A  38                                  ERRMSGID(RMA0500 *LIBL/QMFOKON 38)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                  8  6'Periode 3 - B-C . . .:'
     A            A23KA3    R        B  8 32REFFLD(RA3KA3)
     A  35                                  ERRMSGID(RMA0500 *LIBL/QMFOKON 35)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A23LA3    R        B  8 44REFFLD(RA3LA3)
     A  39                                  ERRMSGID(RMA0500 *LIBL/QMFOKON 39)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 10  4'Standard betalingsbet..:'
     A            A21BEK    R        B 10 32REFFLD(RA1BEK)
     A  31                                  ERRMSGID(RM01030 *LIBL/QMFOKON 31)
     A                                      DSPATR(UL)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A21BEL    R        B 10 44REFFLD(RA1BEL)
     A  32                                  ERRMSGID(RM01030 *LIBL/QMFOKON 32)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 11  4'Store/Små bokstaver . .:'
     A            A21BKK    R        B 11 32REFFLD(RA1BKK)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A            A21BKL    R        B 11 44REFFLD(RA1BKL)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 12  4'Avkryssing. . . . . . .:'
     A            A23SAK    R        B 12 32REFFLD(RA3SAK)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                 12 36'(0 = Avkryssing med referanse)'
     A                                 13 36'(1 = Avkryssing uten referanse)'
     A                                 14  4'Krav til felter kunder.:'
     A            A23MFE    R        B 14 32REFFLD(RA3MFE)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14 36'(0=Ingen krav, 1=Standard krav)'
     A                                 15  4'Krav til felter lever..:'
     A            A23MFL    R        B 15 32REFFLD(RA3MFL)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      TEXT('Må-felt lever.')
     A                                 15 36'(0=Ingen krav, 1=Standard krav)'
     A                                 16  4'Skriv kundeinformasjon.:'
     A            A23KBR    R        B 16 32REFFLD(RA3KBR)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      TEXT('Kundebrev')
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 2)
     A                                 16 36'(0 = Ingen utskrift)'
     A                                 17 36'(1 = Vis bilde for valg)'
     A                                 18 36'(2 = Automatisk utskrift)'
     A                                 20  4'Sist endret dato . . . :'
     A            A23DAT         6Y 0O 20 32COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 21  4'Endret av. . . . . . . :'
     A            A23USR    R        O 21 32REFFLD(RÅEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  4'F3=Gå tilbake'
     A                                      COLOR(BLU)
