     A*%%TS  SD  20031230  114221  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RA006D
     A* Beskrivelse . . : Statuskoder, vedlikehold registreringsbilde
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R M1WIN
     A*%%TS  SD  20020503  234507  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(&WACTLI &WACTPO 10 54)
     A                                      CA03
     A                                      CA12
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A                                  2  2' Melding : '
     A                                      DSPATR(RI)
     A            M1MLD1    R        O  4  2REFFLD(RWMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            M1MLD2    R        O  5  2REFFLD(RWMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  2'Svar ja for OK, nei for ikke OK. .-
     A                                       . .'
     A            M1SVAR    R        B  7 43REFFLD(RWSVAR)
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      COLOR(YLW)
     A                                  9  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  7 46'(J/N)'
     A          R S1WIN
     A*%%TS  SD  19950512  075506  AMD         REL-V2R3M0  5738-PW1
     A                                      WINDOW(&WACTLI &WACTPO 15 74)
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A          R V1WIN
     A*%%TS  SD  20031230  114221  KOB         REL-V5R2M0  5722-WDS
7.xx A*                                     WINDOW(S1WIN)
     A                                      CA03
     A                                      CA12
7.xx A*                                     PUTOVR
     A                                  1 30'Redigerings-bilde '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
7.xx A                                  2 38'RA007V1'
7.xx A                                      COLOR(WHT)
     A                                  5  4' B i l a g s '
     A                                      COLOR(WHT)
     A                                  5 18'  D e b e t   '
     A                                      COLOR(WHT)
     A                                  5 35'M'
     A                                      COLOR(WHT)
     A                                  5 46' K r e d i t  '
     A                                      COLOR(WHT)
     A                                  5 62'M'
     A                                      COLOR(WHT)
     A                                  5 65'Pro-'
     A                                      COLOR(WHT)
     A                                  6  1'BK'
     A                                      COLOR(WHT)
     A                                  6  4' Dato     Nr '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  6 18'Avd  Konto Bærer'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  6 35'K'
     A                                      COLOR(WHT)
     A                                  6 38'Beløp'
     A                                      COLOR(WHT)
     A                                  6 45'Avd  Konto Bærer'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  6 65'sjekt'
     A                                      COLOR(WHT)
     A                                  6 71'Akt'
     A                                      COLOR(WHT)
     A            V1BIKO    R        B  7  1REFFLD(RA1BIK)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'C' 'D')
     A            V1BIDA    R        B  7  6REFFLD(RA1BID)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'C' 'D')
     A            V1BINR    R        B  7 14REFFLD(RA1BIN)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'A' 'C' 'D')
     A            V1DAVD    R        B  7 19REFFLD(RA1AVD)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1KONT    R        B  7 25REFFLD(RA1KTO)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D')
     A            V1DSPS    R        B  7 31REFFLD(RA1SPS)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1DMOM    R        B  7 35REFFLD(RA1MVA)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1BELP    R        B  7 40REFFLD(RA1BLP)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D')
     A            V1PROS    R        B  7 67REFFLD(RA1PRO)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1AKTI    R        B  7 72REFFLD(RA1AKT)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A                                  9  1'Referanse'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  9 17'Bilagstekst'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  9 38' Forfall '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  9 48'Kont.rab'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  9 58'Val'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  9 63'Valutabeløp'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 10  1'Avkr:'
     A                                      COLOR(WHT)
     A            V1KRYS    R        B 10  7REFFLD(RA1AKR)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1TEXT    R        B 10 21REFFLD(RA1FTX)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1FDAT    R        B 10 42REFFLD(RA1FOR)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1KRAB    R        B 10 52REFFLD(RA1RAB)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1VALK    R        B 10 59REFFLD(RA1VKO)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1VALB    R        B 10 66REFFLD(RA1VBE)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A                                 11  1'Ref.:'
     A                                      COLOR(WHT)
     A            V1REFN    R        B 11  7REFFLD(RA1REF)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A                                 11 17'Kid-felt'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 11 41'Att'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 11 51'Virk'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 11 63'Mengde  '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 12  1'L.fak'
     A                                      COLOR(WHT)
     A            V1LFAK    R        B 12  7REFFLD(RA1LFA)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1KIDI    R        B 12 21REFFLD(RA1KID)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1ATTE    R        B 12 42REFFLD(RA1ATT)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1VIRK    R        B 12 52REFFLD(RA1VRK)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1MNGD    R        B 12 66REFFLD(RA1MGN)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
7.xx A                                 23  1'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
