     A*%%TS  SD  20051002  004211  KOB540      REL-V5R3M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RA104D
     A* Beskrivelse . . : Faste konti, vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       250302 KOB  Nytt program
7.xx A* 7.xx  010316  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20051002  004211  KOB540      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av faste konti'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  4 30'Avd.'
7.xx A                                      COLOR(WHT)
7.xx A                                  4 37'Konto'
7.xx A                                      COLOR(WHT)
7.xx A                                  4 43'Bærer'
     A                                      COLOR(WHT)
7.xx A                                  5  3'Utgående merverdiavgift .+'
7.xx A            A2DA01    R        B  5 30REFFLD(RADA01)
     A  30                                  DSPATR(PC)
     A  30 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 30)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                  5 35'+'
7.xx A            A2DK01    R        B  5 37REFFLD(RADK01)
     A  31                                  DSPATR(PC)
     A  31 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 31)
     A  31 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 31)
     A  31 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 31)
     A  31 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 31)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS01    R        B  5 43REFFLD(RADS01)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                  6  3'Utgående mva utenl.tjen. +'
7.xx A            A2DA08    R        B  6 30REFFLD(RADA08)
     A  46                                  DSPATR(PC)
     A  46 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 32)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
7.xx A                                  6 35'+'
7.xx A            A2DK08    R        B  6 37REFFLD(RADK08)
     A  47                                  DSPATR(PC)
     A  47 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 35)
     A  47 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 35)
     A  47 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 35)
     A  47 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 35)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
7.xx A            A2DS08    R        B  6 43REFFLD(RADS08)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
7.xx A                                  7  3'Inngående merverdiavgift.+'
7.xx A            A2DA02    R        B  7 30REFFLD(RADA02)
     A  32                                  DSPATR(PC)
     A  32 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 32)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                  7 35'+'
7.xx A            A2DK02    R        B  7 37REFFLD(RADK02)
     A  33                                  DSPATR(PC)
     A  33 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 33)
     A  33 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 33)
     A  33 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 33)
     A  33 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 33)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS02    R        B  7 43REFFLD(RADS02)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                  8  3'Fylkesskattesjefen. . . .+'
7.xx A            A2DA04    R        B  8 30REFFLD(RADA04)
     A  36                                  DSPATR(PC)
     A  36 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 36)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                  8 35'+'
7.xx A            A2DK04    R        B  8 37REFFLD(RADK04)
     A  37                                  DSPATR(PC)
     A  37 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 37)
     A  37 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 37)
     A  37 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 37)
     A  37 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 37)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS04    R        B  8 43REFFLD(RADS04)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                  9  3'Konto for kunder. . . . .+'
7.xx A            A2DA05    R        B  9 30REFFLD(RADA05)
     A  38                                  DSPATR(PC)
     A  38 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 38)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                  9 35'+'
7.xx A            A2DK05    R        B  9 37REFFLD(RADK05)
     A  39                                  DSPATR(PC)
     A  39 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 39)
     A  39 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 39)
     A  39 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 39)
     A  39 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 39)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS05    R        B  9 43REFFLD(RADS05)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 10  3'Konto for leverandører. .+'
7.xx A            A2DA06    R        B 10 30REFFLD(RADA06)
     A  40                                  DSPATR(PC)
     A  40 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 40)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 10 35'+'
7.xx A            A2DK06    R        B 10 37REFFLD(RADK06)
     A  41                                  DSPATR(PC)
     A  41 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 41)
     A  41 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 41)
     A  41 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 41)
     A  41 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 41)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS06    R        B 10 43REFFLD(RADS06)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 11  3'Kontantrabatt kunder. . .+'
7.xx A            A2DA07    R        B 11 30REFFLD(RADA07)
     A  42                                  DSPATR(PC)
     A  42 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 42)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 11 35'+'
7.xx A            A2DK07    R        B 11 37REFFLD(RADK07)
     A  43                                  DSPATR(PC)
     A  43 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 44)
     A  43 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 44)
     A  43 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 44)
     A  43 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 44)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS07    R        B 11 43REFFLD(RADS07)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 12  3'Kontantrabatt leverandør.+'
7.xx A            A2DA16    R        B 12 30REFFLD(RADA16)
     A  58                                  DSPATR(PC)
     A  58 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 58)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 12 35'+'
7.xx A            A2DK16    R        B 12 37REFFLD(RADK16)
     A  59                                  DSPATR(PC)
     A  59 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 59)
     A  59 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 59)
     A  59 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 59)
     A  59 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 59)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS16    R        B 12 43REFFLD(RADS16)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 13  3'Konto for agio. . . . . .+'
7.xx A            A2DA12    R        B 13 30REFFLD(RADA12)
     A  50                                  DSPATR(PC)
     A  50 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 50)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 13 35'+'
7.xx A            A2DK12    R        B 13 37REFFLD(RADK12)
     A  51                                  DSPATR(PC)
     A  51 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 51)
     A  51 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 51)
     A  51 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 51)
     A  51 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 51)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS12    R        B 13 43REFFLD(RADS12)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 14  3'Konto for disagio . . . .+'
7.xx A            A2DA13    R        B 14 30REFFLD(RADA13)
     A  52                                  DSPATR(PC)
     A  52 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 52)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 14 35'+'
7.xx A            A2DK13    R        B 14 37REFFLD(RADK13)
     A  53                                  DSPATR(PC)
     A  53 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 53)
     A  53 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 53)
     A  53 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 53)
     A  53 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 53)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS13    R        B 14 43REFFLD(RADS13)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 15  3'Konto for renteinntekter.+'
7.xx A            A2DA11    R        B 15 30REFFLD(RADA11)
     A  48                                  DSPATR(PC)
     A  48 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 48)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 15 35'+'
7.xx A            A2DK11    R        B 15 37REFFLD(RADK11)
     A                                      DSPATR(UL)
     A  49                                  DSPATR(PC)
     A  49 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 49)
     A  49 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 49)
     A  49 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 49)
     A  49 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 49)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS11    R        B 15 43REFFLD(RADS11)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 16  3'Konto for øreavrunding. .+'
7.xx A            A2DA14    R        B 16 30REFFLD(RADA14)
     A  54                                  DSPATR(PC)
     A  54 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 54)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 16 35'+'
7.xx A            A2DK14    R        B 16 37REFFLD(RADK14)
     A  55                                  DSPATR(PC)
     A  55 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 55)
     A  55 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 55)
     A  55 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 55)
     A  55 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 55)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS14    R        B 16 43REFFLD(RADS14)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 17  3'Konto for kasse . . . . .+'
7.xx A            A2DA17    R        B 17 30REFFLD(RADA17)
     A  62                                  DSPATR(PC)
     A  62 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 62)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 17 35'+'
7.xx A            A2DK17    R        B 17 37REFFLD(RADK17)
     A  63                                  DSPATR(PC)
     A  63 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 63)
     A  63 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 63)
     A  63 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 63)
     A  63 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 63)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS17    R        B 17 43REFFLD(RADS17)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 18  3'Konto for bank. . . . . .+'
7.xx A            A2DA15    R        B 18 30REFFLD(RADA15)
     A  56                                  DSPATR(PC)
     A  56 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 56)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 18 35'+'
7.xx A            A2DK15    R        B 18 37REFFLD(RADK15)
     A  57                                  DSPATR(PC)
     A  57 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 57)
     A  57 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 57)
     A  57 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 57)
     A  57 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 57)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS15    R        B 18 43REFFLD(RADS15)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 19  3'Konto for inkassoprovisj.+'
7.xx A            A2DA19    R        B 19 30REFFLD(RADA19)
     A  65                                  DSPATR(PC)
     A  65 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 65)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 19 35'+'
7.xx A            A2DK19    R        B 19 37REFFLD(RADK19)
     A  66                                  DSPATR(PC)
     A  66 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 66)
     A  66 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 66)
     A  66 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 66)
     A  66 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 66)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS19    R        B 19 43REFFLD(RADS19)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 20  3'Konto for betalingsgebyr.+'
7.xx A            A2DA20    R        B 20 30REFFLD(RADA20)
     A  67                                  DSPATR(PC)
     A  67 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 67)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 20 35'+'
7.xx A            A2DK20    R        B 20 37REFFLD(RADK20)
     A  68                                  DSPATR(PC)
     A  68 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 68)
     A  68 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 68)
     A  68 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 68)
     A  68 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 68)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A            A2DS20    R        B 20 43REFFLD(RADS20)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
7.xx A                                 21  3'Konto for interimsføring.+'
7.xx A            A2DA21    R        B 21 30REFFLD(RADA21)
     A  69                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A  69 80                               ERRMSGID(RM01070 *LIBL/QMFOKON 67)
7.xx A                                 21 35'+'
7.xx A            A2DK21    R        B 21 37REFFLD(RADK21)
     A  70                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A  70 80                               ERRMSGID(RM02000 *LIBL/QMFOKON 68)
     A  70 81                               ERRMSGID(RM02010 *LIBL/QMFOKON 68)
     A  70 82                               ERRMSGID(RM02020 *LIBL/QMFOKON 68)
     A  70 83                               ERRMSGID(RM02030 *LIBL/QMFOKON 68)
7.xx A            A2DS21    R        B 21 43REFFLD(RADS21)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 23  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
7.xx A**                               23 18'F4=Forespørsel'
7.xx A**                                    COLOR(BLU)
