     A*%%TS  SD  20020730  130313  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : NXCLOUD
     A* Format. . . . . : RA136D
     A* Beskrivelse . . : Kobling mellom salgslager og distribusjonssenter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       250322 ASK  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(27 132 *WIDE)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20020325  222058  KOB         REL-V5R1M0  5722-WDS
     A            B1UID         15Y 0H
     A            B1VALG    R        B  6  2REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 4 5)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A            B1ELAG        20A  O  6  5
     A            B1ELTX        30A  O  6 27
     A            B1DGLN        14Y 0O  6 58
     A            B1DLDO         6Y 0O  6 73
     A            B1DLNA        30A  O  6 80
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020325  222058  KOB         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CF08
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'NXCLOUD'
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av eksterne lager'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      --------------------- '
     A                                      COLOR(WHT)
     A                                  4  2'2=Endre  4=Slett  5=Vis'
     A                                      COLOR(BLU)
     A                                  5  2'V'
     A                                      COLOR(WHT)
     A                                  5  5'Eksternt lager'
     A                                      COLOR(WHT)
     A                                  5 27'Eksternt lager navn'
     A                                      COLOR(WHT)
     A                                  5 58'GLN'
     A                                      COLOR(WHT)
     A                                  5 73'L.nr.'
     A                                      COLOR(WHT)
     A                                  5 80'Leverandør NAVN'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20010919  105848  HKO         REL-V4R4M0  5769-PW1
     A                                 23  2'F3=Gå tilbake  F5=Forny  F6=Oppret-
     A                                      t'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20020730  130313  KOB         REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'NXCLOUD'
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av eksternt lager'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      COLOR(WHT)
     A                                  7  2'Eksternt lager '
     A            C2ELAG        20A  B  7 24
     A                                      CHECK(LC)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  8  2'Eksternt lagernavn'
     A            C2ELTX        30A  B  8 24
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A  31                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  9  2'Adresse 1      '
     A            C2EAD1        30A  B  9 24
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A  31                                  DSPATR(PR)
     A                                 10  2'Adresse 2      '
     A            C2EAD2        30A  B 10 24
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A  31                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 11  2'Poststed       '
     A            C2ESTE        30A  B 11 24
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A  31                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 13  2'GLN distribusjon'
     A            C2DGLN        14Y 0B 13 24EDTWRD('             0')
     A                                      OVRDTA
     A  31                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 14  2'Leverandør     +'
     A            C2LDOR         6Y 0B 14 24EDTWRD('     0')
     A                                      OVRDTA
     A  31                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            C2LTEK        30A  O 14 31
     A                                      OVRDTA
     A                                 19  2'Sist endret dato'
     A            C2EDAT         6Y 0O 19 21COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20  2'Endret av'
     A            C2EUSR    R        O 20 21REFFLD(RAEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2MSG1
     A*%%TS  SD  20020325  222058  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Eksternt lager'
     A                                  3  2'er definert fra før!'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2MSG2
     A*%%TS  SD  20020325  222058  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Manglende info:'
     A            M2FELT        20A  O  3  2
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2MSG3
     A*%%TS  SD  20020325  222058  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'GLN er brukt på'
     A                                  3  2'lager'
     A            M3LAGE        20A  O  3  8
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2MSG4
     A*%%TS  SD  20020325  222058  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'GLN er brukt på distribusjon'
     A                                  3  2'lager'
     A            M4LAGE        20A  O  3  8
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20020325  222058  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2'Slettte eksternt lager'
     A                                      DSPATR(RI)
     A                                  6  2'Eksternt lager'
     A            D1ELAG        20A  O  6 18
     A            D1ELTX        30A  O  7 18
     A                                 11  5'Bekreft lager skal slettes!'
     A                                      COLOR(RED)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
