     A*%%TS  SD  20040216  235521  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RA140D
     A* Beskrivelse . . : Formularregister, vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       150802 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A          R A1BLD
     A*%%TS  SD  20021213  091152  KOB         REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      CF07
     A                                      CF12
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CLEAR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold formularregister'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  7 12'Rapport.:'
     A                                      COLOR(WHT)
     A            A1RAPP         2Y 0B  7 22DSPATR(PC)
     A                                      DSPATR(HI)
     A                                      DSPATR(MDT)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                  7 27'70 = Betalingsvarsel'
     A                                  8 27'71 = Kontoutdrag kunder'
     A                                  9 27'72 = Kontoutdrag leverandører'
     A                                 10 27'73 = Rentenota'
     A                                 12 12'Språk. .:'
     A                                      DSPATR(HI)
     A            A1SPRK         1Y 0B 12 22DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                 12 27'1 = Norsk           '
     A                                 13 27'2 = Engelsk             '
     A                                 14 27'3 = Tysk                '
     A                                 15 27'4 = Fransk              '
     A                                 16 27'5 = Spansk              '
     A                                 24  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B170A
     A*%%TS  SD  20031018  171627  KOB         REL-V5R2M0  5722-WDS
     A                                      CF03
     A                                      CF12
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                  1 22' Egne tekster på betalingsvarsel '
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  3  6'_Bankgiro___'
     A                                      DSPATR(UL)
     A                                  3 40'Kundenr.___'
     A                                      DSPATR(UL)
     A                                  3 55'Dato____'
     A                                      DSPATR(UL)
     A                                  3 66'Side nr.____'
     A                                      DSPATR(UL)
     A            L1            79A  B  4  2CHECK(LC)
     A                                      DSPATR(PC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  5  7'____________B E T A L I N G S V A -
     A                                      R S E L____________'
     A                                      DSPATR(UL)
     A                                  5 66'Forfall_'
     A                                      DSPATR(UL)
     A            L2            79A  B  6  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  7  2'_________I følge våre regnskaper v-
     A                                      iser Deres konto pr.'
     A                                      DSPATR(UL)
     A                                  7 57'  .  .  '
     A                                  7 66'_______________'
     A                                      DSPATR(UL)
     A            L3            79A  B  8  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  9  2'_________at følgende poster er for-
     A                                      falt til betaling:_________________-
     A                                      __________'
     A                                      DSPATR(UL)
     A            L4            79A  B 10  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 12  2'Bil.nr'
     A                                      DSPATR(UL)
     A                                 12  9'__Dato__'
     A                                      DSPATR(UL)
     A                                 12 18'T e k s t __________'
     A                                      DSPATR(UL)
     A                                 12 39'Forfall '
     A                                      DSPATR(UL)
     A                                 12 52'__Beløp __'
     A                                      DSPATR(UL)
     A                                 12 66'Restbeløp_'
     A                                      DSPATR(UL)
     A                                 12 77'P.nr'
     A                                      DSPATR(UL)
     A            L5            79A  B 13  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B170B
     A*%%TS  SD  20040216  235521  KOB         REL-V5R2M0  5722-WDS
     A                                      CF03
     A                                      CF12
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                  2  2'Sum forfalte poster i vår favør   -
     A                                                             ___'
     A                                      DSPATR(UL)
     A            L6            79A  B  3  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  4  2'Vi har belastet Deres konto med et-
     A                                       purregebyr på            '
     A                                      DSPATR(UL)
     A            L7            79A  B  5  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  6  2'Vi har beregnet        % renter av-
     A                                       forfalt saldo            '
     A                                      DSPATR(UL)
     A            L8            79A  B  7  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  8  2'Forfalt saldo inkl. gebyr/renter e-
     A                                      r etter dette             '
     A                                      DSPATR(UL)
     A            L9            79A  B  9  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
6.NU A**?                               9 63'  .  .  '
     A                                 10  2'Dette betalingsvarsel gjelder også-
     A                                       som nota.                 '
     A                                      DSPATR(UL)
     A            L10           79A  B 11  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 12  2'Etter lov om inkasso, varsles De h-
     A                                      erved om at vårt tilgodehavende må -
     A                                                '
     A                                      DSPATR(UL)
     A            L11           79A  B 13  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 14  2'være innbetalt innen 14 dager. I m-
     A                                      otsatt fall vil kravet bli sendt ti-
     A                                      l         '
     A                                      DSPATR(UL)
     A            L12           79A  B 15  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 16  2'inkasso uten ytterligere varsel.  -
7.xx A                                                      Inkassod.: '
     A                                      DSPATR(UL)
     A            L13           79A  B 17  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 18  2'Med hilsen                        -
     A                                                                         -
     A                                                '
     A                                      DSPATR(UL)
     A            L14           79A  B 19  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 20  2'Oppgi KID-nummer ved betaling '
     A                                      DSPATR(UL)
     A            L15           79A  B 21  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C171A
     A*%%TS  SD  20021213  091152  KOB         REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      CF12
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                  1 22' Egne tekster på kontoutdrag '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  3  6'_Bankgiro___'
     A                                      DSPATR(UL)
     A                                  3 40'__Kundenr___'
     A                                      DSPATR(UL)
     A                                  3 55'__Dato____'
     A                                      DSPATR(UL)
     A                                  3 66'__Side nr___'
     A                                      DSPATR(UL)
     A            L1            79A  B  4  2CHECK(LC)
     A                                      DSPATR(PC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  5 47'_____K O N T O U T D R A G_____'
     A                                      DSPATR(UL)
     A            L2            79A  B  6  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  7 46'_________________Utkjørt_'
     A                                      DSPATR(UL)
     A            L3            79A  B  8  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  9  2'__________________________________-
     A                                      ___________________________________-
     A                                      __________'
     A                                      DSPATR(UL)
     A            L4            79A  B 10  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 11  6'_______'
     A                                      DSPATR(UL)
     A                                 11 14'Bilags_'
     A                                      DSPATR(UL)
     A                                 11 22'Sfakt__'
     A                                      DSPATR(UL)
     A                                 11 50'____________B__E__L__Ø__P____'
     A                                      DSPATR(UL)
     A                                 12  6'Bilag__'
     A                                      DSPATR(UL)
     A                                 12 14'dato___'
     A                                      DSPATR(UL)
     A                                 12 22'nr.__'
     A                                      DSPATR(UL)
     A                                 12 28'T E K S T___________'
     A                                      DSPATR(UL)
     A                                 12 50'_________Debet'
     A                                      DSPATR(UL)
     A                                 12 65'________Kredit'
     A                                      DSPATR(UL)
     A            L5            79A  B 13  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A            L6            79A  B 14  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 15  6'______________________SALDO PR.'
     A                                      DSPATR(UL)
     A            L7            79A  B 16  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 17 28'SALDO I VÅR FAVØR______'
     A                                      DSPATR(UL)
     A            L8            79A  B 18  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 19 28'SALDO I DERES FAVØR____'
     A                                      DSPATR(UL)
     A            L9            79A  B 20  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 21 28'FAKTURERT HITTIL I ÅR__'
     A                                      DSPATR(UL)
     A            L10           79A  B 22  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D172A
     A*%%TS  SD  20021213  091152  KOB         REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      CF12
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                  1 22' Egne tekster på kontoutdrag '
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                      DSPATR(HI)
     A                                  3  6'_Bankgiro___'
     A                                      DSPATR(UL)
     A                                  3 40'__Lev.nr____'
     A                                      DSPATR(UL)
     A                                  3 55'__Dato____'
     A                                      DSPATR(UL)
     A                                  3 66'__Side nr___'
     A                                      DSPATR(UL)
     A            L1            79A  B  4  2CHECK(LC)
     A                                      DSPATR(PC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  5 47'_____K O N T O U T D R A G_____'
     A                                      DSPATR(UL)
     A            L2            79A  B  6  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  7 46'_________________Utkjørt_'
     A                                      DSPATR(UL)
     A            L3            79A  B  8  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  9  2'__________________________________-
     A                                      ___________________________________-
     A                                      __________'
     A                                      DSPATR(UL)
     A            L4            79A  B 10  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 11  6'_______'
     A                                      DSPATR(UL)
     A                                 11 14'Bilags_'
     A                                      DSPATR(UL)
     A                                 11 22'Sfakt__'
     A                                      DSPATR(UL)
     A                                 11 50'____________B__E__L__Ø__P____'
     A                                      DSPATR(UL)
     A                                 12  6'Bilag__'
     A                                      DSPATR(UL)
     A                                 12 14'dato___'
     A                                      DSPATR(UL)
     A                                 12 22'nr.__'
     A                                      DSPATR(UL)
     A                                 12 28'T E K S T___________'
     A                                      DSPATR(UL)
     A                                 12 50'_________Debet'
     A                                      DSPATR(UL)
     A                                 12 65'________Kredit'
     A                                      DSPATR(UL)
     A            L5            79A  B 13  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A            L6            79A  B 14  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 15  6'______________________SALDO PR.'
     A                                      DSPATR(UL)
     A            L7            79A  B 16  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 17 28'SALDO I VÅR FAVØR______'
     A                                      DSPATR(UL)
     A            L8            79A  B 18  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 19 28'SALDO I DERES FAVØR____'
     A                                      DSPATR(UL)
     A            L9            79A  B 20  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 21 28'KJØP HITTIL I ÅR_______'
     A                                      DSPATR(UL)
     A            L10           79A  B 22  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 23  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R E173A
     A*%%TS  SD  20021212  000556  KOB         REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      CF12
     A                                      ROLLUP
     A                                      ROLLDOWN
     A                                      CLEAR
     A                                  1 22'    Egne tekster på rentenota    '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                      COLOR(WHT)
     A                                  3  6'Bankgiro____'
     A                                      DSPATR(UL)
     A                                  3 40'Kundenr.___'
     A                                      DSPATR(UL)
     A                                  3 55'Dato____'
     A                                      DSPATR(UL)
     A                                  3 66'Side nr.____'
     A                                      DSPATR(UL)
     A            L1            79A  B  4  2CHECK(LC)
     A                                      DSPATR(PC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  5 22'___R E N T E N O T A   NR.___'
     A                                      DSPATR(UL)
     A                                  5 55'Forfall_'
     A                                      DSPATR(UL)
     A            L2            79A  B  6  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  7  2'_________I henhold til våre salgsb-
     A                                      etingelser er rentebelastning______-
     A                                      __________'
     A                                      DSPATR(UL)
     A            L3            79A  B  8  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  9  2'_________foretatt for følgende pos-
     A                                      ter t.o.m.'
     A                                      DSPATR(UL)
     A                                  9 47'nn.nn.nn'
     A                                  9 57'________________________'
     A                                      DSPATR(UL)
     A            L4            79A  B 10  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 11  2'_________Rentebelastning er foreta-
     A                                      tt med'
     A                                      DSPATR(UL)
     A                                 11 43'12,00'
     A                                 11 49'% p.a.__________________________'
     A                                      DSPATR(UL)
     A            L5            79A  B 12  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 13  2'Faktura'
     A                                      DSPATR(UL)
     A                                 13 10'_Dato__'
     A                                      DSPATR(UL)
     A                                 13 18'T e k s t____'
     A                                      DSPATR(UL)
     A                                 13 32'_____B e l ø p'
     A                                      DSPATR(UL)
     A                                 13 47'____Fra__'
     A                                      DSPATR(UL)
     A                                 13 57'___Til__'
     A                                      DSPATR(UL)
     A                                 13 66'Dager'
     A                                      DSPATR(UL)
     A                                 13 72'___Renter'
     A                                      DSPATR(UL)
     A            L6            79A  B 14  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 15  2'_________Rentebelastning i flg. re-
     A                                      ntenota (avrundet ned)___'
     A                                      DSPATR(UL)
     A            L7            79A  B 16  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 17  2'_________Beløpet er belastet Deres-
     A                                       konto hos oss___________'
     A                                      DSPATR(UL)
     A                                 17 62'          ========='
     A            L8            79A  B 18  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 19  2'_________Fri tekstlinje___________-
     A                                      ___________________________________-
     A                                      __________'
     A                                      DSPATR(UL)
     A            L9            79A  B 20  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 21  2'_________Fri tekstlinje___________-
     A                                      ___________________________________-
     A                                      __________'
     A                                      DSPATR(UL)
     A            L10           79A  B 22  2CHECK(LC)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 24  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
