     A*%%TS  SD  20080828  140717  ASP         REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      MSGLOC(16)
     A          R B1SFL                     SFL
     A*%%TS  SD  20050531  101704  ASK530      REL-V5R2M0  5722-WDS
     A            B1VALG    R        B  6  2REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1GKOD         4Y 0O  6  4EDTCDE(Z)
     A            B1GTXT        12A  O  6  9
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20000928  200319  ASK         REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  1  2' VALG AV AVD.  '
     A                                      DSPATR(RI)
     A                                  3  2'1=Hente inn avd. '
     A                                      COLOR(WHT)
     A            B2GKOD         4Y 0B  5  4COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  19990114  171537  ASK         REL-V4R2M0  5769-PW1
     A                                 15  2'F5=Forny'
     A                                      COLOR(WHT)
