     A*%%TS  SD  20020107  005709  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK100D
     A* Beskrivelse . . : Kunder, vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       230702 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20020107  005709  KOB         REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av koderegister'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A            A2PVLG    R        B  7 14REFFLD(RÅWVLG)
     A                                  7 16'    - Alle koder'
     A            A2PV14    R        B  7 48REFFLD(RÅWVLG)
     A                                  7 51'14 - Leverandørkategorier'
     A            A2PV00    R        B  8 14REFFLD(RÅWVLG)
     A                                  8 16' 00 - Firmaopplysninger'
     A            A2PV15    R        B  8 48REFFLD(RÅWVLG)
     A                                  8 51'15 - Mengde'
     A            A2PV01    R        B  9 14REFFLD(RÅWVLG)
     A                                  9 17'01 - Bilagstekster'
     A            A2PV16    R        B  9 48REFFLD(RÅWVLG)
     A                                  9 51'16 - Valutakurser'
     A            A2PV02    R        B 10 14REFFLD(RÅWVLG)
     A                                 10 17'02 - Betalingsmåte'
     A            A2PV17    R        B 10 48REFFLD(RÅWVLG)
     A                                 10 51'17 - Forsendelsesmåter'
     A            A2PV03    R        B 11 14REFFLD(RÅWVLG)
     A                                 11 17'03 - Betalingsbetingelser'
     A            A2PV18    R        B 11 48REFFLD(RÅWVLG)
     A                                 11 51'18 - Leveringsbetingelser'
     A            A2PV04    R        B 12 14REFFLD(RÅWVLG)
     A                                 12 17'04 - Faste kontonummer'
     A            A2PV19    R        B 12 48REFFLD(RÅWVLG)
     A                                 12 51'19 - Kontoklasser'
     A            A2PV05    R        B 13 14REFFLD(RÅWVLG)
     A                                 13 17'05 - MVA-koder'
     A            A2PV20    R        B 13 48REFFLD(RÅWVLG)
     A                                 13 51'20 - Kontogrupper'
     A            A2PV06    R        B 14 14REFFLD(RÅWVLG)
     A                                 14 17'06 - Rabattkategori   '
     A            A2PV21    R        B 14 48REFFLD(RÅWVLG)
     A                                 14 51'21 - Aktiviteter'
     A            A2PV07    R        B 15 14REFFLD(RÅWVLG)
     A                                 15 17'07 - Avdelinger'
     A            A2PV22    R        B 15 48REFFLD(RÅWVLG)
     A                                 15 51'22 - Speditører'
     A            A2PV08    R        B 16 14REFFLD(RÅWVLG)
     A                                 16 17'08 - Distrikter'
     A            A2PV23    R        B 16 48REFFLD(RÅWVLG)
     A                                 16 51'23 - Virksomhet'
     A            A2PV09    R        B 17 14REFFLD(RÅWVLG)
     A                                 17 17'09 - Selgere'
     A            A2PV24    R        B 17 48REFFLD(RÅWVLG)
     A                                 17 51'24 - Reklamasjonsårsak'
     A            A2PV10    R        B 18 14REFFLD(RÅWVLG)
     A                                 18 17'10 - Lagere'
     A            A2PV25    R        B 18 48REFFLD(RÅWVLG)
     A                                 18 51'25 - Kjørerute'
     A            A2PV11    R        B 19 14REFFLD(RÅWVLG)
     A                                 19 17'11 - Kundekategorier'
     A            A2PV26    R        B 19 48REFFLD(RÅWVLG)
     A                                 19 51'26 - Produktansvarlig'
     A            A2PV12    R        B 20 14REFFLD(RÅWVLG)
     A                                 20 17'12 - Land'
     A            A2PV27    R        B 20 48REFFLD(RÅWVLG)
     A                                 20 51'27 - Kostnadsbærergruppe'
     A            A2PV13    R        B 21 14REFFLD(RÅWVLG)
     A                                 21 16' 13 - Fordelingsnøkkler'
     A            A2PV28    R        B 21 48REFFLD(RÅWVLG)
     A                                 21 51'28 - Kostnadsbærer'
     A                                 23  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R M1WIN
     A                                      WINDOW(&W_AROW &W_ACOL 06 50)
     A                                      CA03
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  3  3'Skal sperrede koder tas med. .:'
     A            A2PKSP    R        B  3 35REFFLD(RHPKSP)
     A                                      COLOR(YLW)
     A                                  3 39'J/N'
     A                                  5  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
