     A*%%TS  SD  20020923  144147  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RC600D
     A* Beskrivelse . . : Kunder, inkasso - utskrift saksregister
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       230902 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A2BLD
     A*%%TS  SD  20020923  144147  KOB         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA12
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av inkassosaker'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6 11'Utvalg:'
     A                                      COLOR(WHT)
     A                                  7 13'Eldre enn dato. . . .:'
     A            A2EDAT         6Y 0B  7 36
     A  31                                  DSPATR(PC)
     A  31                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 31)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Eldre enn dato.')
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  9 13'Type utskrift . . . .:'
     A            A2TYPE         1A  B  9 36
     A  32                                  DSPATR(PC)
     A  32                                  ERRMSGID(RM00010 *LIBL/QMFOKON 37)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      TEXT('Type liste. . . . .')
     A                                      COLOR(YLW)
     A                                  9 40'(J=Ja - Avsluttede saker)'
     A                                 12  3'Rutinen skriver liste over avslutt-
     A                                      ede saker pr. oppgitt dato'
     A                                      COLOR(RED)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 10 40'(N=Nei - Ikke avsluttede saker)'
     A                                 13  3'eller liste over saker som fortsat-
     A                                      t står åpne'
     A                                      COLOR(RED)
