     A*%%TS  SD  20030101  195640  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RE600D
     A* Beskrivelse . . : Overføre saldobalanse til PC
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       301202 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20030101  195640  KOB         REL-V5R1M0  5722-WDS
     A                                      CA01
     A                                      CA03
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Poster fra Eksterne systemer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  4'Dato .:'
     A            A2PKDA    R        B  5 12REFFLD(RHPKDA)
     A  31                                  DSPATR(PC)
     A  31                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  5 22'Regnskapperiode/år.:'
     A            A2PPER    R        B  5 43REFFLD(RKPPER)
     A  35                                  DSPATR(PC)
     A  35                                  ERRMSGID(RMH0040 *LIBL/QMFOKON 35)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A            A2PRÅR    R        B  5 46REFFLD(RHPRÅR)
     A  32                                  DSPATR(PC)
     A  32                                  ERRMSGID(RMH0160 *LIBL/QMFOKON 32)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  7  4'Oversikt av systemer som kan lever-
     A                                      e poster:'
     A                                  9 12'01 = PCSuper - PC Systemer '
     A                                 10 12'02 = Rubicon               '
     A                                 11 12'03 = Q-Free                '
     A                                 12 12'04 = Ergosoft Lønn         '
     A                                 16  4'Velg kode i.h.t. system:'
     A            A2PSYS         2Y 0B 16 29
     A  34                                  DSPATR(PC)
     A  34                                  ERRMSGID(RMH0010 *LIBL/QMFOKON 36)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                 23  8'F3=Gå tilbake'
     A                                      COLOR(BLU)
