     A*%%TS  SD  20030119  133657  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RE125D
     A* Beskrivelse . . : Innlesing av posteringer - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       280302 BOF  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/IFRF IFRFR)
     A                                      HOME(21)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '        '))
     A          R O1WIN
     A*%%TS  SD  20020529  133245  BOF         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT  9 35)
     A                                      CA03(03 'F3=GÅ TILBAKE')
     A                                      CA12(12 'F12=ANNULLER')
     A                                      PUTOVR
     A                                  2  2'Innlesing av postering         '
     A                                      DSPATR(RI)
     A                                  4  2'Fima . . . . . . .'
     A            O1FRM          3D  B  4 21OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  5  2'Filnavn  . . . . .'
     A            O1FIL         10A  B  5 21OVRDTA
     A                                      COLOR(YLW)
     A                                  8  2'F3=Gå tilbake'
