     A*%%TS  SD  20021230  201224  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RE600D
     A* Beskrivelse . . : Overføre saldobalanse til PC
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       301202 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20021230  201224  KOB         REL-V5R1M0  5722-WDS
     A                                      CA01
     A                                      CA03
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Saldobalanse for PC-rapportering'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  4'Dato .:'
     A            A2PKDA    R        B  5 12REFFLD(RHPKDA)
     A  31                                  DSPATR(PC)
     A  31                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  5 22'Regnskapsperiode/år:'
     A            A2PPER    R        B  5 43REFFLD(RKPPER)
     A  35                                  DSPATR(PC)
     A  35                                  ERRMSGID(RMH0040 *LIBL/QMFOKON 35)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A            A2PRÅR    R        B  5 46REFFLD(RHPRÅR)
     A  32                                  DSPATR(PC)
     A  32                                  ERRMSGID(RMH0160 *LIBL/QMFOKON 32)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  7 22'Avdeling fra - til.:'
     A            A2PAVF    R        B  7 43REFFLD(RKPAVF)
     A  30                                  DSPATR(PR)
     A  33                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  7 48'-'
     A            A2PAVT    R        B  7 50REFFLD(RKPAVT)
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  8 22'Sum pr. konto/bærer:'
     A            A2PSPL    R        B  8 43REFFLD(RHPNUL)
     A  34                                  DSPATR(PC)
     A  34                                  ERRMSGID(RMH0010 *LIBL/QMFOKON 36)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  8 45'(J/N = Pr. konto/pr. kto + bærer)'
     A                                  9 22'Sum pr. avdeling. .:'
     A            A2PSAL    R        B  9 43REFFLD(RHPNUL)
     A  36                                  DSPATR(PC)
     A  36                                  ERRMSGID(RMH0010 *LIBL/QMFOKON 36)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  9 45'(J/N = Hele firma/pr. avdeling)'
      *
      * Tekst for PC
      *
     A  13                             11  4'Rutinen legger ut member Sxxxaaaa -
     A                                      i register RE03PF med tall i henhol-
     A                                      d  '
     A                                      COLOR(RED)
     A  13                             12  4'til regnskapsperiode/år. Faktisk p-
     A                                      er. og hittil i år, budsjett og i f-
     A                                      jor'
     A                                      COLOR(RED)
     A  13                             14  4'Etter at rutinen er kjørt kan RE03-
     A                                      PF overføres til PC.   '
     A                                      COLOR(RED)
     A  13                             16  4'Membernavnet har følgende verdier:-
     A                                       xxx = firma, aaaa = avdeling'
     A  13                             17  4'Dersom hele firma er valgt blir aa-
     A                                      aa satt = 0000'
     A  13                             19  4'Dersom mappe PCSALDO blir opprette-
     A                                      t, vil Sxxxaaaa bli lagt ut som    -
     A                                         '
     A  13                             20  4'en PCFIL i mappen med dokumentnavn-
     A                                       = Sxxxaaaa.                       -
     A                                         '
     A  14                             11  4'Rutinen legger ut member KLIxxx -
     A                                      i register RE04PF med tall i henhol-
     A                                      d  '
     A                                      COLOR(RED)
     A  14                             12  4'til regnskapsperiode/år.          -
     A                                                                         -
     A                                         '
     A                                      COLOR(RED)
     A  14                             14  4'Etter at rutinen er kjørt kan RE04-
     A                                      PF overføres til PC.   '
     A                                      COLOR(RED)
     A  14                             16  4'Membernavnet har følgende verdier:-
     A                                       xxx = firma'
     A  14                             18  4'Dersom mappe PCFINALE blir opprett-
     A                                      et, vil KLIxxx bli lagt ut som   -
     A                                         '
     A  14                             19  4'en PCFIL med dokumentnavn = KLIx-
     A                                      xx.                                -
     A                                         '
     A  15                             11  4'Rutinen legger ut member  KLIxxx  -
     A                                      i register RE05PF med tall i år og -
     A                                      i  '
     A                                      COLOR(RED)
     A  15                             12  4'fjor i henhold til regnskapsperiod-
     A                                      e/år.                              -
     A                                         '
     A                                      COLOR(RED)
     A  15                             14  4'Etter at rutinen er kjørt kan RE05-
     A                                      PF overføres til PC.   '
     A                                      COLOR(RED)
     A  15                             16  4'Mebernavnet har følgende verdier: -
     A                                      xxx = firma'
     A  15                             18  4'Dersom mappe PCTOTAL blir opprette-
     A                                      t, vil KLIxxx bli lagt ut som      -
     A                                         '
     A  15                             19  4'en PCFIL i mappen med dokumentnavn-
     A                                       = KLIxxx.                         -
     A                                         '
     A  16                             11  4'Rutinen legger ut member  KLIxxx  -
     A                                      i register RE06PF med tall i år og -
     A                                      i  '
     A                                      COLOR(RED)
     A  16                             12  4'fjor i henhold til regnskapsperiod-
     A                                      e/år.                              -
     A                                         '
     A                                      COLOR(RED)
     A  16                             14  4'Etter at rutinen er kjørt kan RE06-
     A                                      PF overføres til PC.   '
     A                                      COLOR(RED)
     A  16                             16  4'Membernavnet har følgende verdier:-
     A                                       xxx = firma'
     A  16                             18  4'Dersom mappe PCMAESTR blir opprett-
     A                                      et, vil KLIxxx bli lagt ut som     -
     A                                         '
     A  16                             19  4'en PCFIL i mappen med dokumentnavn-
     A                                       = KLIxxx.                         -
     A                                         '
     A  17                             11  5'Rutinen legger ut member  KLIxxx  -
     A                                      i register RE07PF med tall i år og -
     A                                      i  '
     A                                      COLOR(RED)
     A  17                             12  5'fjor i henhold til regnskapsperiod-
     A                                      e/år.                              -
     A                                         '
     A                                      COLOR(RED)
     A  17                             14  5'Etter at rutinen er kjørt kan RE07-
     A                                      PF overføres til PC.   '
     A                                      COLOR(RED)
     A  17                             16  5'Membernavnet har følgende verdier:-
     A                                       xxx = firma'
     A  17                             18  5'Dersom mappe PCMAX blir opprettet,-
     A                                       vil KLIxxx bli lagt ut som        -
     A                                         '
     A  17                             19  5'en PCFIL i mappen med dokumentnavn-
     A                                       = KLIxxx.                         -
     A                                         '
     A  18                             11  4'Rutinen legger ut member  KLIxxx  -
     A                                      i register RE08PF med tall i år og -
     A                                      i  '
     A                                      COLOR(RED)
     A  18                             12  4'fjor i henhold til regnskapsperiod-
     A                                      e/år.                              -
     A                                         '
     A                                      COLOR(RED)
     A  18                             14  4'Etter at rutinen er kjørt kan RE08-
     A                                      PF overføres til PC.   '
     A                                      COLOR(RED)
     A  18                             16  4'Membernavnet har følgende verdier:-
     A                                       xxx = firma'
     A  18                             18  4'Dersom mappe PCAKELIS blir opprett-
     A                                      et, vil KLIxxx bli lagt ut som     -
     A                                         '
     A  18                             19  4'en PCFIL i mappen med dokumentnavn-
     A                                       = KLIxxx.                         -
     A                                         '
     A                                 23 10'F3=Gå tilbake'
     A                                      COLOR(BLU)
