     A*%%TS  SD  20080328  090630  KOB560      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RE632D
     A* Beskrivelse . . : Skriver etiketter til NultiSupport
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       181005 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20080328  090630  KOB560      REL-V5R4M0  5722-WDS
     A                                      CA01
     A                                      CA03
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Skriv etiketter til Nexstep Arkiv'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  2'Angi regnskapsår og bilagsnummer f-
     A                                      ra til:'
     A                                  7  3'Regnskapsår . . . . .:'
     A            A2RAAR         4Y 0B  7 26DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      TEXT('Regnskapsår')
     A                                  9  3'Bilagsnummer fra til.:'
     A            A2BILF    R        B  9 26REFFLD(RTBILN)
     A  36                                  ERRMSGID(RMH0270 *LIBL/QMFOKON 36)
     A                                      DSPATR(UL)
     A                                      TEXT('Bilagsnummer')
     A                                      COLOR(YLW)
     A                                      CHECK(RZ)
6.NU A                                  9 36'-'
6.NU A            A2BILT    R        B  9 39REFFLD(RTBILN)
     A  36                                  ERRMSGID(RMH0270 *LIBL/QMFOKON 36)
     A                                      DSPATR(UL)
     A                                      TEXT('Bilagsnummer')
     A                                      COLOR(YLW)
     A                                      CHECK(RZ)
     A                                 23  4'F3 tilbake   '
     A                                      COLOR(BLU)
