     A*%%TS  SD  20080129  123959  KOBASP      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RE620D
     A* Beskrivelse . . : Overføre resultatrapport til PC
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       301202 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20080129  123959  KOBASP      REL-V5R4M0  5722-WDS
     A                                      CA01
     A                                      CA03
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Konteringsinformasjon til Nexstep -
     A                                      Arkiv'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A            A2KONT    R        B  7 26REFFLD(RHPNUL)
     A  36                                  ERRMSGID(RMH0270 *LIBL/QMFOKON 36)
     A                                      DSPATR(UL)
     A                                      TEXT('Kontoplan')
     A                                      DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 23  4'F3 tilbake   '
     A                                      COLOR(BLU)
     A                                  5  2'Velg hvilken informasjon som skal -
     A                                      overføres:'
     A                                  7  3'Kontoplan . . . . . .:'
     A                                  8  3'Avdelinger. . . . . .:'
     A                                  9  3'Kostnadsbærere. . . .:'
     A                                 10  3'Prosjekter. . . . . .:'
     A                                 11  3'Aktiviteter . . . . .:'
     A            A2AVDE    R        B  8 26REFFLD(RHPNUL)
     A  36                                  ERRMSGID(RMH0270 *LIBL/QMFOKON 36)
     A                                      DSPATR(UL)
     A                                      TEXT('Avdeling')
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A            A2SPES    R        B  9 26REFFLD(RHPNUL)
     A  36                                  ERRMSGID(RMH0270 *LIBL/QMFOKON 36)
     A                                      DSPATR(UL)
     A                                      TEXT('Kostnadsbærer')
     A                                      COLOR(YLW)
     A            A2PROS    R        B 10 26REFFLD(RHPNUL)
     A  36                                  ERRMSGID(RMH0270 *LIBL/QMFOKON 36)
     A                                      DSPATR(UL)
     A                                      TEXT('Prosjekt')
     A                                      COLOR(YLW)
     A            A2AKTI    R        B 11 26REFFLD(RHPNUL)
     A  36                                  ERRMSGID(RMH0270 *LIBL/QMFOKON 36)
     A                                      DSPATR(UL)
     A                                      TEXT('Aktivitet')
     A                                      COLOR(YLW)
