     A*%%TS  SD  20040614  145937  KRKRI       REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R A1WIN
     A*%%TS  SD  20040614  145831  KRKRI       REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 7 28)
     A                                      CF03
     A                                      CF12
     A                                      KEEP
     A                                      PUTOVR
     A                                  2  2'Oppgi bruker'
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  4  2'Bruker . :'
     A            A1USER    R        B  4 14REFFLD(LBUSER)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  6  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                  6 16'F12=Annuller'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
