     A*%%TS  SD  20210215  090924  SST_NXC     REL-V7R3M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RF010D
     A* Beskrivelse . . : Bilagsregistering
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       011103 KOB  Nytt program
6.20 A* R6.20 111010 NHO  Prosjekt og aktivitet fjernet fra bildet.    ttet
6.10 A* 6.10  190311 NHO  Lagt inn protect av feltet forfallsdato
6.24 A* 6.20  071212 NHO  Nye feilmeldinger
6.25 A* 6.20  220814 NHO  Endret indikator på feilmelding A2BUNT
6.25 A*                   Resulterte i at den ikke tok med seg
6.25 A*                   verdier fra bildet F5
7.xx A* 7.xx  290216  bsa  Justeringer basert på ny GUI og regler
7.02 A* K00   050520  bsa Skrevet om til 27x132 bilde
7.03 A* K00   021120  sst Ryddet opp i kolonner vedr overskrifter
7.01 A* 6.30  270416 NHO  Mulighet for å sortere vis på bilagskode
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(27 132 *WIDE)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '        '))
     A          R A2BLD
     A*%%TS  SD  20210215  090924  SST_NXC     REL-V7R3M0  5770-WDS
     A                                      CA01
     A                                      CA02
     A                                      CA03
     A                                      CA05
     A                                      CA06
     A                                      CA08
     A  98                                  PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bilagsregistrering'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      COLOR(WHT)
     A                                  4  2'Periode:'
     A            A2RPER    R        B  4 11REFFLD(RSRPER)
     A                                      OVRDTA
     A  31                                  DSPATR(PC)
     A  31 81                               ERRMSGID(RMS0011 *LIBL/QMFOKON 31)
     A  31 82                               ERRMSGID(RMS0012 *LIBL/QMFOKON 31)
     A  31 83                               ERRMSGID(RMS0013 *LIBL/QMFOKON 31)
     A  31 84                               ERRMSGID(RMS0014 *LIBL/QMFOKON 31)
     A  31 85                               ERRMSGID(RMS0015 *LIBL/QMFOKON 31)
     A            A2RAAR    R        B  4 14REFFLD(RSRAAR)
     A                                      OVRDTA
     A                                      DSPATR(UL)
     A                                  5  2'Buntnr.:'
     A            A2BUNT    R        B  5 11REFFLD(RTBUNT)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A  32                                  DSPATR(PC)
     A  97                                  ERRMSGID(RMS0020 *LIBL/QMFOKON 32)
     A                                  5 34'Buntsum :'
     A  62                                  DSPATR(ND)
     A            A2BSUM    R        B  5 44REFFLD(RSBSUM)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A  33                                  DSPATR(PC)
     A  62                                  DSPATR(ND)
     A                                 26  2'F1=Velg firma  F3=Gå tilbake   F5=-
     A                                      Søk på bunter  F6=Ny Bunt    F8=Ny -
     A                                      bunt fra Excel'
     A                                      COLOR(BLU)
     A          R A5BLD
     A*%%TS  SD  20201102  095413  SST700      REL-V7R3M0  5770-WDS
     A                                      CA01
     A                                      CA02
     A                                      CA03
     A                                      CF04
     A                                      CA07
     A                                      CF13
     A  98                                  PUTOVR
     A                                      RTNCSRLOC(&W_ACRD &W_AFLD)
     A            W_ACRD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bilagsregistrering'
     A                                      COLOR(WHT)
     A                                  2 38'RF010A5'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      COLOR(WHT)
     A                                  4  2'Periode:'
     A            A2RPER    R        O  4 11REFFLD(RSRPER)
     A            A2RAAR    R        O  4 14REFFLD(RSRAAR)
     A                                  4 57'Debet .:'
     A            A5PDEB    R        O  4 66REFFLD(RSPDEB)
     A                                      OVRDTA
     A                                  5  2'Buntnr.:'
     A            A2BUNT    R        O  5 11REFFLD(RTBUNT)
     A                                  5 32'Buntsum:'
     A  62                                  DSPATR(ND)
     A            A2BSUM    R        O  5 41REFFLD(RSBSUM)
     A  62                                  DSPATR(ND)
     A                                  5 57'Kredit.:'
     A            A5PKRE    R        O  5 66REFFLD(RSPKRE)
     A                                      OVRDTA
     A                                  6  2'Linje. :'
     A            A6LINJ    R        O  6 11REFFLD(RTLINJ)
     A                                      OVRDTA
     A                                  6 32'Diff. .:'
     A  62                                  DSPATR(ND)
     A            A5BDIF    R        O  6 41REFFLD(RSBSUM)
     A                                      OVRDTA
     A  62                                  DSPATR(ND)
     A                                  6 57'Diff. .:'
     A            A5PDIF    R        O  6 66REFFLD(RSPSUM)
     A                                      OVRDTA
     A                                  8  8'B i l a g s'
     A                                  8 25'D e b e t'
     A                                  8 39'M'
     A*                                     OVRATR
     A                                  8 57'K r e d i t'
     A                                  8 71'M'
     A                                  9  3'BK'
     A                                  9  8'Dato'
     A                                  9 19'Nr'
7.xx A**                                    DSPATR(UL)
     A                                  9 23'Avd'
     A                                  9 28'Konto'
     A                                  9 34'Bær.'
     A                                  9 39'k'
     A                                  9 48'Beløp'
     A                                  9 55'Avd'
     A                                  9 60'Konto'
     A                                  9 66'Bær.'
     A                                  9 71'k'
6.20 A**                                9 78'Akt'
6.20 A**08                                  DSPATR(ND)
6.20 A**                                    OVRATR
     A            A6BILK    R        O 10  3REFFLD(RTBILK)
     A                                      OVRDTA
     A            A6BDAT         6Y 0O 10  6OVRDTA
     A                                      EDTCDE(Z)
     A            A6BILN    R        O 10 13REFFLD(RTBILN)
     A                                      OVRDTA
     A            A6DAVD    R        O 10 22REFFLD(RTDAVD)
     A                                      OVRDTA
     A            A6DKTO    R        O 10 27REFFLD(RTDKTO)
     A                                      OVRDTA
     A            A6DSPS    R        O 10 34REFFLD(RTDSPS)
     A                                      OVRDTA
     A            A6DMVA    R        O 10 39REFFLD(RTDMVA)
     A                                      OVRDTA
     A            A6BELØ    R        O 10 41REFFLD(RTBELØ)
     A                                      OVRDTA
     A            A6CAVD    R        O 10 54REFFLD(RTCAVD)
     A                                      OVRDTA
     A            A6CKTO    R        O 10 59REFFLD(RTCKTO)
     A                                      OVRDTA
     A            A6CSPS    R        O 10 66REFFLD(RTCSPS)
     A                                      OVRDTA
     A            A6CMVA    R        O 10 71REFFLD(RTCMVA)
     A                                      OVRDTA
     A            A6PROS    R        O 10 73REFFLD(RP1PRO)
     A                                      OVRDTA
6.20 A***         A6AKTI    R        O 10 78REFFLD(RTAKTI)
6.20 A***                                   OVRDTA
     A            A6PTXT        25A  O 11 54OVRDTA
     A            A6BTXT        16A  O 12  8OVRDTA
     A            A61TXT        25A  O 12 25OVRDTA
     A            A62TXT        25A  O 12 54OVRDTA
     A            A6DGIR    R        O 13 25REFFLD(RLBGIR)
     A                                      OVRDTA
     A                                      EDTWRD('    .  .     ')
     A            A6CGIR    R        O 13 54REFFLD(RLBGIR)
     A                                      OVRDTA
     A                                      EDTWRD('    .  .     ')
     A                                 15  9'B i l a g s'
     A                                      COLOR(WHT)
     A                                 15 29'D e b e t'
     A                                      COLOR(WHT)
     A                                 15 48'M'
     A                                      COLOR(WHT)
     A  03                                  DSPATR(ND)
     A                                      OVRATR
     A                                 15 70'K r e d i t'
     A                                      COLOR(WHT)
     A                                 15 89'M'
     A                                      COLOR(WHT)
     A  03                                  DSPATR(ND)
     A                                      OVRATR
     A                                 15 91'Arb- '
     A                                      COLOR(WHT)
     A  07                                  DSPATR(ND)
     A                                      OVRATR
     A                                 16  4'BK'
     A                                      COLOR(WHT)
     A                                 16  9'Dato'
     A                                      COLOR(WHT)
     A                                 16 20'Nr'
     A                                      COLOR(WHT)
7.xx A**                                    DSPATR(UL)
     A                                 16 26'Avd'
     A                                      COLOR(WHT)
     A                                 16 33'Konto'
     A                                      COLOR(WHT)
     A                                 16 41'Bærer'
     A                                      COLOR(WHT)
7.xx A**                                    DSPATR(UL)
     A                                 16 48'k'
     A                                      COLOR(WHT)
     A  03                                  DSPATR(ND)
     A                                      OVRATR
     A                                 16 57'Beløp'
     A                                      COLOR(WHT)
     A                                 16 67'Avd'
     A                                      COLOR(WHT)
     A                                 16 74'Konto'
     A                                      COLOR(WHT)
     A                                 16 82'Bærer'
     A                                      COLOR(WHT)
7.xx A**                                    DSPATR(UL)
     A                                 16 89'k'
     A                                      COLOR(WHT)
     A  03                                  DSPATR(ND)
     A                                      OVRATR
     A                                 16 91'ordre'
     A                                      COLOR(WHT)
     A  07                                  DSPATR(ND)
     A                                      OVRATR
     A                                 16100'Prosjekt'
     A                                      COLOR(WHT)
     A  07                                  DSPATR(ND)
     A                                      OVRATR
     A                                 16111'U.Pro'
     A                                      COLOR(WHT)
     A  07                                  DSPATR(ND)
     A                                      OVRATR
6.20 A**                               16 78'Akt'
6.20 A**                                    COLOR(WHT)
6.20 A**08                                  DSPATR(ND)
6.20 A**                                    OVRATR
     A                                 17  2'+'
     A            A5BILK    R        B 17  4REFFLD(RTBILK)
     A                                      CHECK(RZ)
     A                                      DUP(17)
     A  31N69                               DSPATR(PC)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A  31 81                               ERRMSGID(RMT0010 *LIBL/QMFOKON)
     A            A5BDAT         6Y 0B 17  7CHECK(RZ)
     A                                      DUP(18)
     A  32N69                               DSPATR(PC)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A  32 81                               ERRMSGID(RMT0020 *LIBL/QMFOKON)
     A  32 82                               ERRMSGID(RMT0025 *LIBL/QMFOKON)
     A  32 95                               ERRMSGID(RMT0026 *LIBL/QMFOKON)
     A  32 96                               ERRMSGID(RMT0027 *LIBL/QMFOKON)
     A            A5BILN    R        B 17 14REFFLD(RTBILN)
     A                                      CHECK(RB)
     A                                      DUP(19)
     A                                      OVRDTA
     A  33                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A  33 81                               ERRMSGID(RMT0030 *LIBL/QMFOKON 33)
     A  33 82                               ERRMSGID(RMT0031 *LIBL/QMFOKON 33)
     A  63 81                               ERRMSGID(RMT0031 *LIBL/QMFOKON)
     A                                 17 23'+'
     A            A5DAVD    R        B 17 25REFFLD(RTDAVD)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(70)
     A  02                                  DSPATR(PR)
     A  02                                  DSPATR(ND)
     A  36                                  DSPATR(PC)
     A  36 81                               ERRMSGID(RMT0061 *LIBL/QMFOKON 36)
     A  36 82                               ERRMSGID(RMT0062 *LIBL/QMFOKON 36)
     A  36 83                               ERRMSGID(RMT0063 *LIBL/QMFOKON 36)
     A  36 57                               ERRMSGID(RMT0064 *LIBL/QMFOKON 36)
     A                                      OVRDTA
     A                                 17 30'+'
     A            A5DKTO    R        B 17 32REFFLD(RTDKTO)
     A                                      CHECK(RB)
     A                                      DUP(58)
     A  34                                  DSPATR(PC)
     A  34 81                               ERRMSGID(RMT0041 *LIBL/QMFOKON 34)
     A  34 82                               ERRMSGID(RMT0042 *LIBL/QMFOKON 34)
     A  34 83                               ERRMSGID(RMT0043 *LIBL/QMFOKON 34)
     A  34 84                               ERRMSGID(RMT0044 *LIBL/QMFOKON 34)
     A  34 93                               ERRMSGID(RMT0045 *LIBL/QMFOKON 34)
     A  34 86                               ERRMSGID(RMT0046 *LIBL/QMFOKON 34)
     A  34 87                               ERRMSGID(RMT0047 *LIBL/QMFOKON 34)
     A  34 88                               ERRMSGID(RMT0048 *LIBL/QMFOKON 34)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                 17 39'+'
     A            A5DSPS    R        B 17 41REFFLD(RTDSPS)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(59)
     A  01                                  DSPATR(PR)
     A  01                                  DSPATR(ND)
     A  35                                  DSPATR(PC)
     A  35 04                               ERRMSGID(RMT0051 *LIBL/QMFOKON 35)
     A  35 68                               ERRMSGID(RMT0052 *LIBL/QMFOKON 35)
     A  35 11                               ERRMSGID(RMT0053 *LIBL/QMFOKON 35)
     A  35 94                               ERRMSGID(RMT0054 *LIBL/QMFOKON 35)
     A                                      OVRDTA
     A                                 17 46'+'
     A            A5DMVA    R        B 17 48REFFLD(RTDMVA)
     A                                      COLOR(YLW)
     A                                      DUP(71)
     A  03                                  DSPATR(PR)
     A  03                                  DSPATR(ND)
     A  37                                  DSPATR(PC)
     A  37 81                               ERRMSGID(RMT0070 *LIBL/QMFOKON 37)
     A                                      OVRDTA
     A            A5BELØ    R        B 17 50REFFLD(RTBELØ)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(72)
     A  38                                  DSPATR(PC)
     A  38 81                               ERRMSGID(RMT0080 *LIBL/QMFOKON 38)
     A  38 92                               ERRMSGID(RMT0081 *LIBL/QMFOKON 38)
     A                                      OVRDTA
     A                                 17 63'+'
     A            A5CAVD    R        B 17 65REFFLD(RTCAVD)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(75)
     A  02                                  DSPATR(PR)
     A  02                                  DSPATR(ND)
     A  41                                  DSPATR(PC)
     A  41 81                               ERRMSGID(RMT0111 *LIBL/QMFOKON 41)
     A  41 82                               ERRMSGID(RMT0112 *LIBL/QMFOKON 41)
     A  41 83                               ERRMSGID(RMT0113 *LIBL/QMFOKON 41)
     A  41 57                               ERRMSGID(RMT0114 *LIBL/QMFOKON 41)
     A                                      OVRDTA
     A                                 17 71'+'
     A            A5CKTO    R        B 17 73REFFLD(RTCKTO)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(73)
     A  39                                  DSPATR(PC)
     A  39 81                               ERRMSGID(RMT0091 *LIBL/QMFOKON 39)
     A  39 82                               ERRMSGID(RMT0092 *LIBL/QMFOKON 39)
     A  39 83                               ERRMSGID(RMT0093 *LIBL/QMFOKON 39)
     A  39 86                               ERRMSGID(RMT0096 *LIBL/QMFOKON 39)
     A  39 87                               ERRMSGID(RMT0097 *LIBL/QMFOKON 39)
     A  39 88                               ERRMSGID(RMT0098 *LIBL/QMFOKON 39)
     A  39 89                               ERRMSGID(RMT0099 *LIBL/QMFOKON 39)
     A                                      OVRDTA
     A                                 17 80'+'
     A            A5CSPS    R        B 17 82REFFLD(RTCSPS)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(74)
     A  01                                  DSPATR(PR)
     A  01                                  DSPATR(ND)
     A  40                                  DSPATR(PC)
     A  40 04                               ERRMSGID(RMT0101 *LIBL/QMFOKON 40)
     A  40 68                               ERRMSGID(RMT0102 *LIBL/QMFOKON 40)
     A  40 11                               ERRMSGID(RMT0103 *LIBL/QMFOKON 40)
     A  40 94                               ERRMSGID(RMT0104 *LIBL/QMFOKON 40)
     A                                      OVRDTA
     A                                 17 87'+'
     A            A5CMVA    R        B 17 89REFFLD(RTCMVA)
     A                                      COLOR(YLW)
     A                                      DUP(76)
     A  03                                  DSPATR(PR)
     A  03                                  DSPATR(ND)
     A  42                                  DSPATR(PC)
     A  42 81                               ERRMSGID(RMT0120 *LIBL/QMFOKON 42)
     A                                      OVRDTA
     A            A5ARBO    R        B 17 91REFFLD(RÅARBO)
     A                                      COLOR(YLW)
     A                                      DUP(77)
     A  07                                  DSPATR(PR)
     A  07                                  DSPATR(ND)
     A  43                                  DSPATR(PC)
     A  43 81                               ERRMSGID(RMT0131 *LIBL/QMFOKON 43)
     A  43 82                               ERRMSGID(RMT0132 *LIBL/QMFOKON 43)
     A  43 83                               ERRMSGID(RMT0133 *LIBL/QMFOKON 43)
     A  43 84                               ERRMSGID(RMT0134 *LIBL/QMFOKON 43)
     A  43 85                               ERRMSGID(RMT0135 *LIBL/QMFOKON 43)
     A  43 86                               ERRMSGID(RMT0136 *LIBL/QMFOKON 43)
     A  43 87                               ERRMSGID(RMT0137 *LIBL/QMFOKON 43)
     A  43 88                               ERRMSGID(RMT0138 *LIBL/QMFOKON 43)
     A  43 89                               ERRMSGID(RMT0139 *LIBL/QMFOKON 43)
     A  43 90                               ERRMSGID(RMT0145 *LIBL/QMFOKON 43)
     A                                      OVRDTA
     A            A5AKTI    R        H      REFFLD(RTAKTI)
6.20 A*                                     COLOR(YLW)
6.20 A*                                     CHECK(LC)
6.20 A*                                     DUP(78)
6.20 A**08                                  DSPATR(PR)
6.20 A* 08                                  DSPATR(ND)
6.20 A* 44                                  DSPATR(PC)
6.20 A* 44 81                               ERRMSGID(RMT0141 *LIBL/QMFOKON 44)
6.20 A* 44 82                               ERRMSGID(RMT0142 *LIBL/QMFOKON 44)
6.20 A* 44 83                               ERRMSGID(RMT0143 *LIBL/QMFOKON 44)
6.20 A* 44 84                               ERRMSGID(RMT0144 *LIBL/QMFOKON 44)
6.20 A*                                     OVRDTA
     A                                 17 99'+'
     A            A5PROS    R        B 17101REFFLD(RÅPROA)
     A                                      COLOR(YLW)
     A                                      DUP(77)
     A  07                                  DSPATR(PR)
     A  07                                  DSPATR(ND)
     A  57                                  DSPATR(PC)
     A  57 81                               ERRMSGID(RMT0131 *LIBL/QMFOKON 57)
     A  57 82                               ERRMSGID(RMT0132 *LIBL/QMFOKON 57)
     A  57 83                               ERRMSGID(RMT0133 *LIBL/QMFOKON 57)
     A  57 84                               ERRMSGID(RMT0134 *LIBL/QMFOKON 57)
     A  57 85                               ERRMSGID(RMT0135 *LIBL/QMFOKON 57)
     A  57 86                               ERRMSGID(RMT0136 *LIBL/QMFOKON 57)
     A  57 87                               ERRMSGID(RMT0137 *LIBL/QMFOKON 57)
     A  57 88                               ERRMSGID(RMT0138 *LIBL/QMFOKON 57)
     A                                      OVRDTA
     A                                 17109'+'
     A            A5UPRO    R        B 17111REFFLD(RÅUPRO)
     A                                      COLOR(YLW)
     A                                      DUP(77)
     A  07                                  DSPATR(PR)
     A  07                                  DSPATR(ND)
     A  58                                  DSPATR(PC)
     A  58 81                               ERRMSGID(RMT0131 *LIBL/QMFOKON 58)
     A  58 82                               ERRMSGID(RMT0132 *LIBL/QMFOKON 58)
     A  58 83                               ERRMSGID(RMT0133 *LIBL/QMFOKON 58)
     A  58 84                               ERRMSGID(RMT0134 *LIBL/QMFOKON 58)
     A  58 85                               ERRMSGID(RMT0135 *LIBL/QMFOKON 58)
     A  58 86                               ERRMSGID(RMT0136 *LIBL/QMFOKON 58)
     A  58 87                               ERRMSGID(RMT0137 *LIBL/QMFOKON 58)
     A  58 88                               ERRMSGID(RMT0138 *LIBL/QMFOKON 58)
     A                                      OVRDTA
     A                                 18  2'Referanse'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  09 25 26                            DSPATR(ND)
     A                                      OVRATR
     A                                 18 32'Bilagstekst         '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  20                                  DSPATR(ND)
     A                                      OVRATR
     A                                 18 55'Forfall'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  21                                  DSPATR(ND)
     A                                      OVRATR
     A                                 18 65'Kont.rab'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  22                                  DSPATR(ND)
     A                                      OVRATR
     A                                 18 76'Val'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  23                                  DSPATR(ND)
     A                                      OVRATR
     A                                 18 82'Valutabeløp'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  24                                  DSPATR(ND)
     A                                      OVRATR
     A                                 19  2'Avkr'
     A                                      COLOR(WHT)
     A  09                                  DSPATR(ND)
     A                                      OVRATR
     A            A5KRYS    R        B 19 11REFFLD(RTKRYS)
     A                                      COLOR(YLW)
     A                                      DUP(79)
     A  09                                  DSPATR(PR)
     A  09                                  DSPATR(ND)
     A  45                                  DSPATR(PC)
     A  45 81                               ERRMSGID(RMT0150 *LIBL/QMFOKON 45)
     A                                      OVRDTA
     A                                      VALUES('S' 'X' ' ')
     A                                 19 13'(kode)'
     A            A5TEXT    R        B 19 32REFFLD(RTTEXT)
     A                                      COLOR(YLW)
     A                                      DUP(80)
     A  20                                  DSPATR(PR)
     A  20                                  DSPATR(ND)
     A  46                                  DSPATR(PC)
     A  46 81                               ERRMSGID(RMT0160 *LIBL/QMFOKON 46)
     A                                      OVRDTA
     A            A5FDAT         6Y 0B 19 56COLOR(YLW)
     A                                      CHECK(RZ)
     A  21                                  DSPATR(PR)
     A  21                                  DSPATR(ND)
     A  47                                  DSPATR(PC)
     A  47 81                               ERRMSGID(RMT0170 *LIBL/QMFOKON 47)
     A  47 82                               ERRMSGID(RMT0171 *LIBL/QMFOKON 47)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            A5KRAB    R        B 19 65REFFLD(RTKRAB)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(82)
     A  22                                  DSPATR(PR)
     A  22                                  DSPATR(ND)
     A  48                                  DSPATR(PC)
     A  48 81                               ERRMSGID(RMT0180 *LIBL/QMFOKON 48)
     A                                      OVRDTA
     A                                 19 74'+'
     A            A5VALK    R        B 19 76REFFLD(RTVALK)
     A                                      COLOR(YLW)
     A                                      DUP(83)
     A  23                                  DSPATR(PR)
     A  23                                  DSPATR(ND)
     A  49                                  DSPATR(PC)
     A  49 81                               ERRMSGID(RMT0191 *LIBL/QMFOKON 49)
     A  49 82                               ERRMSGID(RMT0192 *LIBL/QMFOKON 49)
     A  49 83                               ERRMSGID(RMT0193 *LIBL/QMFOKON 49)
     A  49 84                               ERRMSGID(RMT0194 *LIBL/QMFOKON 49)
     A                                      OVRDTA
     A            A5VALB    R        B 19 82REFFLD(RTVALB)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(84)
     A  24                                  DSPATR(PR)
     A  24                                  DSPATR(ND)
     A  50                                  DSPATR(PC)
     A  50 81                               ERRMSGID(RMT0200 *LIBL/QMFOKON 50)
     A                                      OVRDTA
     A                                 20  2'Ref'
     A                                      COLOR(WHT)
     A  25                                  DSPATR(ND)
     A                                      OVRATR
     A            A5REFN    R        B 20 11REFFLD(RTREFN)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(85)
     A  25                                  DSPATR(PR)
     A  25                                  DSPATR(ND)
     A  51N69                               DSPATR(PC)
     A  51 81                               ERRMSGID(RMT0210 *LIBL/QMFOKON 51)
     A  51 82                               ERRMSGID(RMT0211 *LIBL/QMFOKON 51)
     A  51 83                               ERRMSGID(RMT0212 *LIBL/QMFOKON 51)
     A                                      OVRDTA
     A*
     A                                 20 32'Kid felt'
     A  27                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                      OVRATR
     A*
     A                                 20 65'Att'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  28                                  DSPATR(ND)
     A                                      OVRATR
     A                                 20 76'Virk'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  06                                  DSPATR(ND)
     A                                      OVRATR
     A                                 20 82'Mengde'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  29                                  DSPATR(ND)
     A                                      OVRATR
     A                                 21  2'Lev.fak'
     A                                      COLOR(WHT)
     A  26                                  DSPATR(ND)
     A                                      OVRATR
     A            A5LFAK    R        B 21 11REFFLD(RTLFAK)
     A                                      COLOR(YLW)
     A                                      DUP(86)
     A  26                                  DSPATR(PR)
     A  26                                  DSPATR(ND)
     A  52                                  DSPATR(PC)
     A  52 81                               ERRMSGID(RMT0220 *LIBL/QMFOKON 52)
     A                                      OVRDTA
     A            A5KIDI    R        B 21 32REFFLD(RTKIDI)
     A                                      COLOR(YLW)
     A                                      DUP(87)
     A  27                                  DSPATR(PR)
     A  27                                  DSPATR(ND)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSGID(RML0340 *LIBL/QMFOKON 53)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                 21 63'J'
     A            A5ATTE    R        B 21 65REFFLD(RTATTE)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(88)
     A  28                                  DSPATR(PR)
     A  28                                  DSPATR(ND)
     A  54                                  DSPATR(PC)
     A  54 81                               ERRMSGID(RMT0240 *LIBL/QMFOKON 54)
     A                                      OVRDTA
     A                                      VALUES('J' ' ')
6.NU A*           A5ARBO    R        B  6 70REFFLD(RÅARBO)
6.NU A*                                     COLOR(YLW)
6.NU A*                                     DUP(90)
6.NU A* 07                                  DSPATR(PR)
6.NU A* 43                                  DSPATR(PC)
6.NU A* 56 81                               ERRMSGID(RMT0300 *LIBL/QMFOKON 56)
6.NU A* 56 89                               ERRMSGID(RMT0139 *LIBL/QMFOKON 56)
6.NU A* 56 90                               ERRMSGID(RMT0145 *LIBL/QMFOKON 56)
6.NU A*                                     OVRDTA
     A            A5VIRK    R        B 21 76REFFLD(RTVIRK)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(90)
     A  06                                  DSPATR(PR)
     A  06                                  DSPATR(ND)
     A  56                                  DSPATR(PC)
     A  56 81                               ERRMSGID(RMT0300 *LIBL/QMFOKON 56)
     A                                      OVRDTA
     A            A5MNGD    R        B 21 82REFFLD(RTMNGD)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(89)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(ND)
     A  55                                  DSPATR(PC)
     A  55 81                               ERRMSGID(RMT0250 *LIBL/QMFOKON 55)
     A                                      OVRDTA
     A                                 26  2'F1=Transaksjoner'
     A                                      COLOR(BLU)
     A                                 26 20'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 26 35'F4=Spørring'
     A                                      COLOR(BLU)
     A                                 26 48'F13=Rediger'
     A                                      COLOR(BLU)
     A                                 26 61'F7=Preregistrering'
     A                                      COLOR(BLU)
     A          R A7BLD
     A*%%TS  SD  20061122  132042  KOB         REL-V5R4M0  5722-WDS
     A                                      CA01
     A                                      CA02
     A                                      CA03
     A                                      CF04
     A                                      CA07
     A                                      CF13
     A  98                                  PUTOVR
     A                                      RTNCSRLOC(&W_ACRD &W_AFLD)
     A            W_ACRD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
7.02 A                                  1118'Kl. :'
     A                                      COLOR(WHT)
7.02 A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bilagsregistrering'
     A                                      COLOR(WHT)
7.xx A                                  2 38'RF010A7'
7.xx A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
7.02 A                                  2118'Dato:'
     A                                      COLOR(WHT)
7.02 A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
7.02 A                                      ------------------------------------
7.02 A                                      ---------------------------'
     A                                      COLOR(WHT)
     A                                  4  2'Periode:'
     A            A2RPER    R        O  4 11REFFLD(RSRPER)
     A            A2RAAR    R        O  4 14REFFLD(RSRAAR)
     A                                  4 57'Debet .:'
     A            A5PDEB    R        O  4 66REFFLD(RSPDEB)
     A                                      OVRDTA
     A                                  5  2'Buntnr.:'
     A            A2BUNT    R        O  5 11REFFLD(RTBUNT)
     A                                  5 32'Buntsum:'
     A  62                                  DSPATR(ND)
     A            A2BSUM    R        O  5 41REFFLD(RSBSUM)
     A  62                                  DSPATR(ND)
     A                                  5 57'Kredit.:'
     A            A5PKRE    R        O  5 66REFFLD(RSPKRE)
     A                                      OVRDTA
     A                                  6  2'Linje. :'
     A            A6LINJ    R        O  6 11REFFLD(RTLINJ)
     A                                      OVRDTA
     A                                  6 32'Diff. .:'
     A  62                                  DSPATR(ND)
     A            A5BDIF    R        O  6 41REFFLD(RSBSUM)
     A                                      OVRDTA
     A  62                                  DSPATR(ND)
     A                                  6 57'Diff. .:'
     A            A5PDIF    R        O  6 66REFFLD(RSPSUM)
     A                                      OVRDTA
     A                                  8  7'B i l a g s'
6.NU A                                  8 25'D e b e t'
6.NU A                                  8 39'M'
     A*                                     OVRATR
6.NU A                                  8 56'K r e d i t'
6.NU A                                  8 70'M'
     A  03                                  DSPATR(ND)
     A                                      OVRATR
6.NU A                                  8 73'PRO- '
6.20 A  07                                  DSPATR(ND)
6.20 A                                      OVRATR
     A                                  9  3'BK'
7.xx A                                  9  7'Dato'
7.xx A                                  9 16'Nr '
     A                                      DSPATR(UL)
7.xx A                                  9 23'Avd'
7.xx A                                  9 28'Konto'
7.xx A                                  9 34'Bærer'
     A                                      DSPATR(UL)
6.NU A                                  9 41'k'
     A  03                                  DSPATR(ND)
6.NU A                                  9 45'Beløp'
7.xx A                                  9 54'Avd'
7.xx A                                  9 59'Konto'
7.xx A                                  9 65'Bærer'
     A                                      DSPATR(UL)
6.NU A                                  9 71'k'
     A  03                                  DSPATR(ND)
     A            A6BILK    R        O 10  3REFFLD(RTBILK)
     A                                      OVRDTA
     A            A6BDAT         6Y 0O 10  6OVRDTA
     A                                      EDTCDE(Z)
     A            A6BILN    R        O 10 13REFFLD(RTBILN)
     A                                      OVRDTA
6.NU A            A6DAVD    R        O 10 22REFFLD(RTDAVD)
     A                                      OVRDTA
6.NU A            A6DKTO    R        O 10 27REFFLD(RTDKTO)
     A                                      OVRDTA
6.NU A            A6DSPS    R        O 10 34REFFLD(RTDSPS)
     A                                      OVRDTA
6.NU A            A6DMVA    R        O 10 39REFFLD(RTDMVA)
     A                                      OVRDTA
6.NU A            A6BELØ    R        O 10 41REFFLD(RTBELØ)
     A                                      OVRDTA
6.NU A            A6CAVD    R        O 10 54REFFLD(RTCAVD)
     A                                      OVRDTA
6.NU A            A6CKTO    R        O 10 59REFFLD(RTCKTO)
     A                                      OVRDTA
6.NU A            A6CSPS    R        O 10 66REFFLD(RTCSPS)
     A                                      OVRDTA
6.NU A            A6CMVA    R        O 10 71REFFLD(RTCMVA)
     A                                      OVRDTA
6.NU A            A6ARBO    R        O 10 73REFFLD(RP4ORD)
     A                                      OVRDTA
     A            A6BTXT        16A  O 12  8OVRDTA
     A            A61TXT        25A  O 12 25OVRDTA
     A            A62TXT        25A  O 12 54OVRDTA
     A            A6DGIR    R        O 13 25REFFLD(RLBGIR)
     A                                      OVRDTA
     A                                      EDTWRD('    .  .     ')
     A            A6CGIR    R        O 13 54REFFLD(RLBGIR)
     A                                      OVRDTA
     A                                      EDTWRD('    .  .     ')
7.02 A                                 15  8'B i l a g s'
     A                                      COLOR(WHT)
7.02 A                                 15 27'K r e d i t'
     A                                      COLOR(WHT)
7.02 A                                 15 51'D e b e t'
     A                                      COLOR(WHT)
7.02 A                                 16  5'BK'
     A                                      COLOR(WHT)
7.02 A                                 16  8'Dato'
7.xx A                                      COLOR(WHT)
7.02 A                                 16 17'Nr'
     A                                      COLOR(WHT)
7.xx A*                                     DSPATR(UL)
7.02 A                                 16 27'Leverandør'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
7.02 A                                 16 40'Beløp'
     A                                      COLOR(WHT)
7.02 A                                 16 51'Leverandør'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
7.02 A                                 16 62'Kid-felt'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A**                                    OVRATR
7.02 A                                 17  3'+'
7.02 A            A5BILK    R        B 17  5REFFLD(RTBILK)
     A                                      CHECK(RZ)
     A                                      DUP(17)
     A  31                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A  31 81                               ERRMSGID(RMT0010 *LIBL/QMFOKON)
7.02 A            A5BDAT         6Y 0B 17  8CHECK(RZ)
     A                                      DUP(18)
     A  32                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A  32 81                               ERRMSGID(RMT0020 *LIBL/QMFOKON)
     A  32 82                               ERRMSGID(RMT0025 *LIBL/QMFOKON)
7.02 A            A5BILN    R        B 17 15REFFLD(RTBILN)
     A                                      CHECK(RB)
     A                                      DUP(19)
     A                                      OVRDTA
     A  33                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A  33 81                               ERRMSGID(RMT0030 *LIBL/QMFOKON 33)
     A  33 82                               ERRMSGID(RMT0031 *LIBL/QMFOKON 33)
7.02 A                                 17 25'+'
7.02 A            A5CKTO    R        B 17 27REFFLD(RTDKTO)
     A                                      CHECK(RB)
     A                                      DUP(58)
     A  34                                  DSPATR(PC)
     A  34 81                               ERRMSGID(RMT0041 *LIBL/QMFOKON 34)
     A  34 82                               ERRMSGID(RMT0042 *LIBL/QMFOKON 34)
     A  34 83                               ERRMSGID(RMT0043 *LIBL/QMFOKON 34)
     A  34 84                               ERRMSGID(RMT0044 *LIBL/QMFOKON 34)
     A  34 86                               ERRMSGID(RMT0046 *LIBL/QMFOKON 34)
     A  34 87                               ERRMSGID(RMT0047 *LIBL/QMFOKON 34)
     A  34 88                               ERRMSGID(RMT0048 *LIBL/QMFOKON 34)
     A                                      OVRDTA
     A                                      COLOR(YLW)
7.02 A            A5BELØ    R        B 17 35REFFLD(RTBELØ)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(72)
     A  38                                  DSPATR(PC)
     A  38 81                               ERRMSGID(RMT0080 *LIBL/QMFOKON 38)
     A  38 92                               ERRMSGID(RMT0081 *LIBL/QMFOKON 38)
     A                                      OVRDTA
7.02 A                                 17 49'+'
7.02 A            A5DKTO    R        B 17 51REFFLD(RTCKTO)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(73)
     A  39                                  DSPATR(PC)
     A  39 81                               ERRMSGID(RMT0091 *LIBL/QMFOKON 39)
     A  39 82                               ERRMSGID(RMT0092 *LIBL/QMFOKON 39)
     A  39 83                               ERRMSGID(RMT0093 *LIBL/QMFOKON 39)
     A  39 86                               ERRMSGID(RMT0096 *LIBL/QMFOKON 39)
     A  39 87                               ERRMSGID(RMT0097 *LIBL/QMFOKON 39)
     A  39 88                               ERRMSGID(RMT0098 *LIBL/QMFOKON 39)
     A  39 89                               ERRMSGID(RMT0099 *LIBL/QMFOKON 39)
     A                                      OVRDTA
7.02 A            A5KIDI    R        B 17 62REFFLD(RTKIDI)
     A                                      COLOR(YLW)
     A                                      DUP(87)
     A  27                                  DSPATR(PR)
     A  27                                  DSPATR(ND)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSGID(RML0340 *LIBL/QMFOKON 53)
     A                                      OVRDTA
     A                                      CHECK(RB)
7.02 A                                 19  5'Bilagstekst         '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
7.02 A                                 19 28'Lev.fak:       '
     A                                      COLOR(WHT)
     A*                                     OVRATR
     A                                      DSPATR(UL)
7.02 A                                 19 51'Forfall'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
7.02 A                                 19 62'Val'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
7.02 A                                 19 68'Valutabeløp'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
7.02 A            A5TEXT    R        B 20  5REFFLD(RTTEXT)
     A                                      COLOR(YLW)
     A                                      DUP(80)
     A  20                                  DSPATR(PR)
     A  46                                  DSPATR(PC)
     A  46 81                               ERRMSGID(RMT0160 *LIBL/QMFOKON 46)
     A                                      OVRDTA
7.02 A            A5LFAK    R        B 20 28REFFLD(RTLFAK)
     A                                      COLOR(YLW)
     A                                      DUP(86)
     A  26                                  DSPATR(PR)
     A  26                                  DSPATR(ND)
     A  52                                  DSPATR(PC)
     A  52 81                               ERRMSGID(RMT0220 *LIBL/QMFOKON 52)
     A                                      OVRDTA
7.02 A            A5FDAT         6Y 0B 20 51COLOR(YLW)
     A                                      CHECK(RZ)
     A  21                                  DSPATR(ND)
     A  47                                  DSPATR(PC)
     A  47 81                               ERRMSGID(RMT0170 *LIBL/QMFOKON 47)
     A  47 82                               ERRMSGID(RMT0171 *LIBL/QMFOKON 47)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
7.02 A                                 20 60'+'
7.02 A            A5VALK    R        B 20 62REFFLD(RTVALK)
     A                                      COLOR(YLW)
     A                                      DUP(83)
     A  23                                  DSPATR(PR)
     A  23                                  DSPATR(ND)
     A  49                                  DSPATR(PC)
     A  49 81                               ERRMSGID(RMT0191 *LIBL/QMFOKON 49)
     A  49 82                               ERRMSGID(RMT0192 *LIBL/QMFOKON 49)
     A  49 83                               ERRMSGID(RMT0193 *LIBL/QMFOKON 49)
     A  49 84                               ERRMSGID(RMT0194 *LIBL/QMFOKON 49)
     A                                      OVRDTA
7.02 A            A5VALB    R        B 20 68REFFLD(RTVALB)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(84)
     A  24                                  DSPATR(PR)
     A  24                                  DSPATR(ND)
     A  50                                  DSPATR(PC)
     A  50 81                               ERRMSGID(RMT0200 *LIBL/QMFOKON 50)
     A                                      OVRDTA
7.02 A                                 26  2'F1=Transaksjoner'
     A                                      COLOR(BLU)
7.02 A                                 26 20'F3=Gå tilbake'
     A                                      COLOR(BLU)
7.02 A                                 26 35'F4=Spørring'
     A                                      COLOR(BLU)
7.02 A                                 26 48'F7=Vanlig registrering'
     A                                      COLOR(BLU)
     A          R B1SFL                     SFL
     A*%%TS  SD  20201102  093625  SST700      REL-V7R3M0  5770-WDS
     A            B1VALG    R        B 11  2REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(2 4 5 0)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A            B1LINJ    R        O 11  4REFFLD(RTLINJ)
     A            B1BILK    R        O 11 10REFFLD(RTBILK)
     A            B1BDAT         6S 0O 11 13TEXT('Bilags-dato')
     A            B1BILN    R        O 11 20REFFLD(RTBILN)
     A            B1DAVD    R        O 11 29REFFLD(RTDAVD)
     A            B1DKTO    R        O 11 34REFFLD(RTDKTO)
     A            B1DSPS    R        O 11 41REFFLD(RTDSPS)
     A            B1DMVA    R        O 11 46REFFLD(RTDMVA)
     A            B1BELØ    R        O 11 48REFFLD(RTBELØ)
     A                                      EDTWRD('      .   ,  ')
     A            B1CAVD    R        O 11 62REFFLD(RTCAVD)
     A            B1CKTO    R        O 11 67REFFLD(RTCKTO)
     A            B1CSPS    R        O 11 74REFFLD(RTCSPS)
     A            B1CMVA    R        O 11 79REFFLD(RTCMVA)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20201102  095937  SST700      REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            SVRN01         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Bilagsregistrering'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      COLOR(WHT)
     A                                  4  2'Velg og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  4 32'Buntnr.:'
     A            A2BUNT    R        O  4 41REFFLD(RTBUNT)
     A                                  4 54'Debet .:'
     A            A5PDEB    R        O  4 63REFFLD(RSPDEB)
     A                                      OVRDTA
     A                                      EDTCDE(J)
     A                                  8  3'2=Endre   4=Slett    5=Vis '
     A                                      COLOR(BLU)
     A                                  5 54'Kredit.:'
     A            A5PKRE    R        O  5 63REFFLD(RSPKRE)
     A                                      OVRDTA
     A                                      EDTCDE(J)
     A                                  6  4'Linje'
     A                                      COLOR(WHT)
     A                                  6 54'Diff. .:'
     A            A5PDIF    R        O  6 63REFFLD(RSPSUM)
     A                                      OVRDTA
     A                                      EDTCDE(J)
     A                                  9 11'B i l a g s'
     A                                      COLOR(WHT)
     A                                  9 30'   D e b e t   '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  9 46'M'
     A                                      COLOR(WHT)
     A                                  9 63'  K r e d i t  '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  9 79'M'
     A                                      COLOR(WHT)
     A                                 10  2'V'
     A                                      COLOR(WHT)
     A                                 10  5'Linj'
     A                                      COLOR(WHT)
     A                                 10 10'BK'
     A                                      COLOR(WHT)
     A                                 10 15'Dato'
     A                                      COLOR(WHT)
     A                                 10 26'Nr'
     A                                      COLOR(WHT)
7.xx A**                                    DSPATR(UL)
     A                                 10 30'Avd'
     A                                      COLOR(WHT)
     A                                 10 35'Konto'
     A                                      COLOR(WHT)
     A                                 10 41'Bær.'
     A                                      COLOR(WHT)
7.xx A**                                    DSPATR(UL)
     A                                 10 46'k'
     A                                      COLOR(WHT)
     A                                 10 56'Beløp'
     A                                      COLOR(WHT)
     A                                 10 63'Avd'
     A                                      COLOR(WHT)
     A                                 10 68'Konto'
     A                                      COLOR(WHT)
     A                                 10 74'Bær.'
     A                                      COLOR(WHT)
     A                                 10 79'k'
     A                                      COLOR(WHT)
     A            B2LINJ    R        B  7  4REFFLD(RTLINJ)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A  31                                  ERRMSGID(RM00020 *LIBL/QMFOKON 31)
     A  32                                  ERRMSGID(RM00030 *LIBL/QMFOKON 32)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
7.xx A            B2BILK    R        B  7 11REFFLD(RTBILK)
7.01 A                                      COLOR(YLW)
7.01 A                                      CHECK(FE)
7.01 A                                      CHECK(RB)
7.01 A* 31                                  ERRMSGID(RM00020 *LIBL/QMFOKON 31)
7.01 A* 32                                  ERRMSGID(RM00030 *LIBL/QMFOKON 32)
7.01 A                                      OVRDTA
7.01 A                                      EDTCDE(Z)
     A          R B2CMD
     A*%%TS  SD  19931028  135846  AMD         REL-V2R2M0  5738-PW1
7.02 A                                 26  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
7.02 A                                 26 21'F5=Forny'
     A                                      COLOR(BLU)
     A          R C2WIN
     A*%%TS  SD  20201102  093625  SST700      REL-V7R3M0  5770-WDS
     A                                      WINDOW(S1WIN)
     A                                      CF04
     A                                      CA03
     A                                      CA05
     A  98                                  PUTOVR
     A                                      RTNCSRLOC(&W_ACRD &W_AFLD)
     A            W_ACRD        10A  H
     A            W_AFLD        10A  H
     A                                  1  1'RF010C2'
     A                                  2  1'Linjenummer. . . . .:'
     A                                      COLOR(WHT)
     A            A5LINJ    R        O  2 23REFFLD(RTLINJ)
     A            C2NYEN    R        O  2 63REFFLD(RWNYEN)
     A                                      DSPATR(RI)
     A                                  4  7'B i l a g s'
     A                                      COLOR(WHT)
     A                                  4 25'D e b e t'
     A                                      COLOR(WHT)
     A                                  4 38'M'
     A                                      COLOR(WHT)
     A**                                    OVRATR
     A                                  4 56'K r e d i t'
     A                                      COLOR(WHT)
     A                                  4 70'M'
     A                                      COLOR(WHT)
     A*                                     OVRATR
6.NU A**                                4 70'Arb- '
6.NU A**                                    OVRATR
6.NU A**                                    COLOR(WHT)
     A                                  5  2'BK'
     A                                      COLOR(WHT)
     A                                  5  7'Dato'
     A                                      COLOR(WHT)
     A                                  5 18'Nr'
     A                                      COLOR(WHT)
7.xx A*                                     DSPATR(UL)
     A                                  5 22'Avd'
     A                                      COLOR(WHT)
     A                                  5 27'Konto'
     A                                      COLOR(WHT)
     A                                  5 33'Bær.'
     A                                      COLOR(WHT)
7.xx A**                                    DSPATR(UL)
     A                                  5 38'k'
     A                                      COLOR(WHT)
     A*                                     OVRATR
     A                                  5 47'Beløp'
     A                                      COLOR(WHT)
     A                                  5 54'Avd'
     A                                      COLOR(WHT)
     A                                  5 59'Konto'
     A                                      COLOR(WHT)
     A                                  5 65'Bær.'
     A                                      COLOR(WHT)
7.xx A*                                     DSPATR(UL)
     A                                  5 70'k'
     A                                      COLOR(WHT)
6.NU A**                                5 70'Ordre'
6.NU A**                                    OVRATR
6.NU A**                                    COLOR(WHT)
     A                                  7 65'Upr:'
     A                                      COLOR(WHT)
     A*                                     OVRATR
     A            A5BILK    R        B  6  2REFFLD(RTBILK)
     A                                      COLOR(YLW)
     A                                      CHECK(RZ)
     A                                      DUP(17)
     A                                      OVRDTA
     A  31                                  DSPATR(PC)
     A  31 81                               ERRMSGID(RMT0010 *LIBL/QMFOKON 31)
     A            A5BDAT         6Y 0B  6  5COLOR(YLW)
     A                                      CHECK(RZ)
     A                                      DUP(18)
     A  32                                  DSPATR(PC)
     A  32 81                               ERRMSGID(RMT0020 *LIBL/QMFOKON 32)
     A  32 82                               ERRMSGID(RMT0025 *LIBL/QMFOKON 32)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            A5BILN    R        B  6 12REFFLD(RTBILN)
     A                                      CHECK(RB)
     A                                      DUP(19)
     A                                      OVRDTA
     A  33                                  DSPATR(PC)
     A  33 81                               ERRMSGID(RMT0030 *LIBL/QMFOKON 33)
     A  33 82                               ERRMSGID(RMT0031 *LIBL/QMFOKON 33)
     A  63 81                               ERRMSGID(RMT0031 *LIBL/QMFOKON 33)
     A                                      COLOR(YLW)
     A            A5DAVD    R        B  6 21REFFLD(RTDAVD)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(70)
     A  02                                  DSPATR(PR)
     A  36                                  DSPATR(PC)
     A  36 81                               ERRMSGID(RMT0061 *LIBL/QMFOKON 36)
     A  36 82                               ERRMSGID(RMT0062 *LIBL/QMFOKON 36)
     A  36 83                               ERRMSGID(RMT0063 *LIBL/QMFOKON 36)
     A  36 57                               ERRMSGID(RMT0064 *LIBL/QMFOKON 36)
     A                                      OVRDTA
     A            A5DKTO    R        B  6 26REFFLD(RTDKTO)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(58)
     A  34                                  DSPATR(PC)
     A  34 81                               ERRMSGID(RMT0041 *LIBL/QMFOKON 34)
     A  34 82                               ERRMSGID(RMT0042 *LIBL/QMFOKON 34)
     A  34 83                               ERRMSGID(RMT0043 *LIBL/QMFOKON 34)
     A  34 84                               ERRMSGID(RMT0044 *LIBL/QMFOKON 34)
     A  34 86                               ERRMSGID(RMT0046 *LIBL/QMFOKON 34)
     A  34 87                               ERRMSGID(RMT0047 *LIBL/QMFOKON 34)
     A  34 88                               ERRMSGID(RMT0048 *LIBL/QMFOKON 34)
     A                                      OVRDTA
     A            A5DSPS    R        B  6 33REFFLD(RTDSPS)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(59)
     A  01                                  DSPATR(PR)
     A  35                                  DSPATR(PC)
     A  35 04                               ERRMSGID(RMT0051 *LIBL/QMFOKON 35)
     A  35 05                               ERRMSGID(RMT0052 *LIBL/QMFOKON 35)
     A  35 11                               ERRMSGID(RMT0053 *LIBL/QMFOKON 35)
     A  35 94                               ERRMSGID(RMT0054 *LIBL/QMFOKON 35)
     A                                      OVRDTA
     A            A5DMVA    R        B  6 38REFFLD(RTDMVA)
     A                                      COLOR(YLW)
     A                                      DUP(71)
     A  03                                  DSPATR(PR)
     A  37                                  DSPATR(PC)
     A  37 81                               ERRMSGID(RMT0070 *LIBL/QMFOKON 37)
     A                                      OVRDTA
     A            A5BELØ    R        B  6 40REFFLD(RTBELØ)
     A                                      CHECK(RB)
     A                                      DUP(72)
     A  38                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A  38 81                               ERRMSGID(RMT0080 *LIBL/QMFOKON 38)
     A            A5CAVD    R        B  6 53REFFLD(RTCAVD)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(75)
     A  02                                  DSPATR(PR)
     A  41                                  DSPATR(PC)
     A  41 81                               ERRMSGID(RMT0111 *LIBL/QMFOKON 41)
     A  41 82                               ERRMSGID(RMT0112 *LIBL/QMFOKON 41)
     A  41 83                               ERRMSGID(RMT0113 *LIBL/QMFOKON 41)
     A  41 57                               ERRMSGID(RMT0114 *LIBL/QMFOKON 41)
     A                                      OVRDTA
     A            A5CKTO    R        B  6 58REFFLD(RTCKTO)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(73)
     A  39                                  DSPATR(PC)
     A  39 81                               ERRMSGID(RMT0091 *LIBL/QMFOKON 39)
     A  39 82                               ERRMSGID(RMT0092 *LIBL/QMFOKON 39)
     A  39 83                               ERRMSGID(RMT0093 *LIBL/QMFOKON 39)
     A  39 86                               ERRMSGID(RMT0096 *LIBL/QMFOKON 39)
     A  39 87                               ERRMSGID(RMT0097 *LIBL/QMFOKON 39)
     A  39 88                               ERRMSGID(RMT0098 *LIBL/QMFOKON 39)
     A  39 89                               ERRMSGID(RMT0099 *LIBL/QMFOKON 39)
     A                                      OVRDTA
     A            A5CSPS    R        B  6 65REFFLD(RTCSPS)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(74)
     A  01                                  DSPATR(PR)
     A  40                                  DSPATR(PC)
     A  40 04                               ERRMSGID(RMT0101 *LIBL/QMFOKON 40)
     A  40 68                               ERRMSGID(RMT0102 *LIBL/QMFOKON 40)
     A  40 11                               ERRMSGID(RMT0103 *LIBL/QMFOKON 40)
     A  40 94                               ERRMSGID(RMT0104 *LIBL/QMFOKON 40)
     A                                      OVRDTA
     A            A5CMVA    R        B  6 70REFFLD(RTCMVA)
     A                                      COLOR(YLW)
     A                                      DUP(76)
     A  03                                  DSPATR(PR)
     A  42                                  DSPATR(PC)
     A  42 81                               ERRMSGID(RMT0120 *LIBL/QMFOKON 42)
     A                                      OVRDTA
6.20 A*           A5PROS    R        B  6 70REFFLD(RÅPROA)
6.20 A*                                     COLOR(YLW)
6.20 A*                                     CHECK(RB)
6.20 A*                                     DUP(77)
6.20 A* 07                                  DSPATR(PR)
6.20 A* 43                                  DSPATR(PC)
6.20 A* 43 81                               ERRMSGID(RMT0131 *LIBL/QMFOKON 43)
6.20 A* 43 82                               ERRMSGID(RMT0132 *LIBL/QMFOKON 43)
6.20 A* 43 83                               ERRMSGID(RMT0133 *LIBL/QMFOKON 43)
6.20 A* 43 84                               ERRMSGID(RMT0134 *LIBL/QMFOKON 43)
6.20 A* 43 85                               ERRMSGID(RMT0135 *LIBL/QMFOKON 43)
6.20 A* 43 86                               ERRMSGID(RMT0136 *LIBL/QMFOKON 43)
6.20 A* 43 87                               ERRMSGID(RMT0137 *LIBL/QMFOKON 43)
6.20 A* 43 88                               ERRMSGID(RMT0138 *LIBL/QMFOKON 43)
6.20 A*                                     OVRDTA
6.20 A*           A5AKTI    R        B  7 70REFFLD(RTAKTI)
6.20 A*                                     COLOR(YLW)
6.20 A*                                     CHECK(LC)
6.20 A*                                     DUP(78)
6.20 A* 08                                  DSPATR(PR)
6.20 A* 44                                  DSPATR(PC)
6.20 A* 44 81                               ERRMSGID(RMT0141 *LIBL/QMFOKON 44)
6.20 A* 44 82                               ERRMSGID(RMT0142 *LIBL/QMFOKON 44)
6.20 A* 44 83                               ERRMSGID(RMT0143 *LIBL/QMFOKON 44)
6.20 A* 44 84                               ERRMSGID(RMT0144 *LIBL/QMFOKON 44)
6.20 A*                                     OVRDTA
     A                                  8  2'Referanse'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
     A                                  8 21'Bilagstekst         '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
     A                                  8 43'Forfall'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
     A                                  8 52'Kont.rab'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
     A                                  8 61'Val'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
     A                                  8 65'Valutabeløp'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
     A                                  9  2'Avkr:'
     A                                      COLOR(WHT)
     A*                                     OVRATR
     A            A5KRYS    R        B  9  8REFFLD(RTKRYS)
     A                                      COLOR(YLW)
     A                                      DUP(79)
     A  09                                  DSPATR(PR)
     A  45                                  DSPATR(PC)
     A  45 81                               ERRMSGID(RMT0150 *LIBL/QMFOKON 45)
     A                                      OVRDTA
     A                                      VALUES('S' 'X' ' ')
     A            A5TEXT    R        B  9 21REFFLD(RTTEXT)
     A                                      COLOR(YLW)
     A                                      DUP(80)
     A  20                                  DSPATR(PR)
     A  46                                  DSPATR(PC)
     A  46 81                               ERRMSGID(RMT0160 *LIBL/QMFOKON 46)
     A                                      OVRDTA
     A            A5FDAT         6Y 0B  9 43COLOR(YLW)
     A                                      CHECK(RZ)
     A  47                                  DSPATR(PC)
     A  47 81                               ERRMSGID(RMT0170 *LIBL/QMFOKON 47)
     A  47 82                               ERRMSGID(RMT0171 *LIBL/QMFOKON 47)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            A5KRAB    R        B  9 52REFFLD(RTKRAB)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(82)
     A  22                                  DSPATR(PR)
     A  48                                  DSPATR(PC)
     A  48 81                               ERRMSGID(RMT0180 *LIBL/QMFOKON 48)
     A                                      OVRDTA
     A            A5VALK    R        B  9 61REFFLD(RTVALK)
     A                                      COLOR(YLW)
     A                                      DUP(83)
     A  23                                  DSPATR(PR)
     A  49                                  DSPATR(PC)
     A  49 81                               ERRMSGID(RMT0191 *LIBL/QMFOKON 49)
     A  49 82                               ERRMSGID(RMT0192 *LIBL/QMFOKON 49)
     A  49 83                               ERRMSGID(RMT0193 *LIBL/QMFOKON 49)
     A  49 84                               ERRMSGID(RMT0194 *LIBL/QMFOKON 49)
     A                                      OVRDTA
     A            A5VALB    R        B  9 65REFFLD(RTVALB)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(84)
     A  24                                  DSPATR(PR)
     A  50                                  DSPATR(PC)
     A  50 81                               ERRMSGID(RMT0200 *LIBL/QMFOKON 50)
     A                                      OVRDTA
     A                                 10  2'Ref.:'
     A                                      COLOR(WHT)
     A*                                     OVRATR
     A            A5REFN    R        B 10  8REFFLD(RTREFN)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(85)
     A  25                                  DSPATR(PR)
     A  51                                  DSPATR(PC)
     A  51 81                               ERRMSGID(RMT0210 *LIBL/QMFOKON 51)
     A  51 82                               ERRMSGID(RMT0211 *LIBL/QMFOKON 51)
     A  51 83                               ERRMSGID(RMT0212 *LIBL/QMFOKON 51)
     A                                      OVRDTA
     A                                 10 27'Kid-felt'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
     A                                 10 53'Att'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
     A                                 10 59'Virk'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
     A                                 10 65'Mengde'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*                                     OVRATR
     A                                 11  2'Lev.fak:'
     A                                      COLOR(WHT)
     A*                                     OVRATR
     A            A5LFAK    R        B 11 11REFFLD(RTLFAK)
     A                                      COLOR(YLW)
     A                                      DUP(86)
     A  26                                  DSPATR(PR)
     A  52                                  DSPATR(PC)
     A  52 81                               ERRMSGID(RMT0220 *LIBL/QMFOKON 52)
     A                                      OVRDTA
     A            A5KIDI    R        B 11 27REFFLD(RTKIDI)
     A                                      COLOR(YLW)
     A                                      DUP(87)
     A  27                                  DSPATR(PR)
     A  53                                  DSPATR(PC)
     A  53                                  ERRMSGID(RML0340 *LIBL/QMFOKON 53)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A            A5ATTE    R        B 11 54REFFLD(RTATTE)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(88)
     A  28                                  DSPATR(PR)
     A  54                                  DSPATR(PC)
     A  54 81                               ERRMSGID(RMT0240 *LIBL/QMFOKON 54)
     A                                      OVRDTA
     A                                      VALUES('J' ' ')
     A            A5MNGD    R        B 11 67REFFLD(RTMNGD)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(89)
     A  29                                  DSPATR(PR)
     A  55                                  DSPATR(PC)
     A  55 81                               ERRMSGID(RMT0250 *LIBL/QMFOKON 55)
     A                                      OVRDTA
     A                                 13  1'F3=Gå tilbake  F4=Spørring  F5=Skr-
     A                                      iv etikett'
     A                                      COLOR(BLU)
     A                                  7  2'Arb.ordre:'
     A                                      COLOR(WHT)
     A            A5ARBO    R        B  7 13REFFLD(RÅARBO)
     A                                      COLOR(YLW)
     A                                      DUP(90)
     A  07                                  DSPATR(PR)
     A  43                                  DSPATR(PC)
     A  56 81                               ERRMSGID(RMT0300 *LIBL/QMFOKON 56)
     A  56 89                               ERRMSGID(RMT0139 *LIBL/QMFOKON 56)
     A  56 90                               ERRMSGID(RMT0145 *LIBL/QMFOKON 56)
     A                                      OVRDTA
     A                                  7 21'MVA-grunnlag:'
     A                                      COLOR(WHT)
     A            A5GMVA    R        B  7 38REFFLD(RTGMVA)
     A  60                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7 52'Pro:'
     A                                      COLOR(WHT)
     A            A5PROS    R        B  7 57REFFLD(RÅPROA)
     A                                      COLOR(YLW)
     A                                      DUP(77)
     A  07                                  DSPATR(PR)
     A  43                                  DSPATR(PC)
     A  43 81                               ERRMSGID(RMT0131 *LIBL/QMFOKON 43)
     A  43 82                               ERRMSGID(RMT0132 *LIBL/QMFOKON 43)
     A  43 83                               ERRMSGID(RMT0133 *LIBL/QMFOKON 43)
     A  43 84                               ERRMSGID(RMT0134 *LIBL/QMFOKON 43)
     A  43 85                               ERRMSGID(RMT0135 *LIBL/QMFOKON 43)
     A  43 86                               ERRMSGID(RMT0136 *LIBL/QMFOKON 43)
     A  43 87                               ERRMSGID(RMT0137 *LIBL/QMFOKON 43)
     A  43 88                               ERRMSGID(RMT0138 *LIBL/QMFOKON 43)
     A  43 89                               ERRMSGID(RMT0139 *LIBL/QMFOKON 43)
     A  43 90                               ERRMSGID(RMT0145 *LIBL/QMFOKON 43)
     A                                      OVRDTA
     A*---------------
     A            A5UPRO    R        B  7 70REFFLD(RÅUPRO)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DUP(90)
     A  07                                  DSPATR(PR)
     A  56 81                               ERRMSGID(RMT0300 *LIBL/QMFOKON 56)
     A  58 85                               ERRMSGID(RMT0146 *LIBL/QMFOKON 58)
     A                                      OVRDTA
     A          R D1WIN
     A*%%TS  SD  20040405  200215  KOB         REL-V5R2M0  5722-WDS
     A                                      WINDOW(S1WIN)
     A                                      CA03
7.xx A                                  1  1'RF010D1'
     A                                  2  1'Linjenummer. . . . .:'
     A                                      COLOR(WHT)
     A            RTLINJ    R        O  2 24REFFLD(RTLINJ)
     A            D1NYEN    R        O  2 63REFFLD(RWNYEN)
     A                                      DSPATR(RI)
     A                                  4  4'B i l a g s'
     A                                      COLOR(WHT)
     A                                  4 21'D e b e t'
     A                                      COLOR(WHT)
     A                                  4 35'M'
     A                                      COLOR(WHT)
     A  03                                  DSPATR(ND)
     A                                  4 52'K r e d i t'
     A                                      COLOR(WHT)
     A                                  4 67'M'
     A                                      COLOR(WHT)
     A  03                                  DSPATR(ND)
6.20 A**                                4 69'Prosj.'
6.20 A**                                    COLOR(WHT)
6.20 A**07                                  DSPATR(ND)
     A                                  5  1'BK'
     A                                      COLOR(WHT)
7.xx A                                  5  4'Dato'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 13'Nr'
     A                                      COLOR(WHT)
7.xx A*                                     DSPATR(UL)
7.xx A                                  5 20'Avd'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 25'Konto'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 31'Bærer'
     A                                      COLOR(WHT)
7.xx A*                                     DSPATR(UL)
6.NU A                                  5 37'k'
     A                                      COLOR(WHT)
     A  03                                  DSPATR(ND)
6.NU A                                  5 42'Beløp'
     A                                      COLOR(WHT)
7.xx A                                  5 52'Avd'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 57'Konto'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 63'Bærer'
     A                                      COLOR(WHT)
7.xx A*                                     DSPATR(UL)
6.NU A                                  5 69'k'
     A                                      COLOR(WHT)
     A  03                                  DSPATR(ND)
6.NU A                                  5 71'sjekt'
     A                                      COLOR(WHT)
     A  08                                  DSPATR(ND)
     A            RTBILK    R        O  6  1REFFLD(RTBILK)
     A            D1BDAT         6S 0O  6  4
     A            RTBILN    R        O  6 11REFFLD(RTBILN)
6.NU A            RTDAVD    R        O  6 20REFFLD(RTDAVD)
     A  02                                  DSPATR(ND)
6.NU A            RTDKTO    R        O  6 25REFFLD(RTDKTO)
6.NU A            RTDSPS    R        O  6 32REFFLD(RTDSPS)
     A  01                                  DSPATR(ND)
6.NU A            RTDMVA    R        O  6 37REFFLD(RTDMVA)
     A  03                                  DSPATR(ND)
6.NU A            RTBELØ    R        O  6 39REFFLD(RTBELØ)
6.NU A            RTCAVD    R        O  6 52REFFLD(RTCAVD)
     A  02                                  DSPATR(ND)
6.NU A            RTCKTO    R        O  6 57REFFLD(RTCKTO)
6.NU A            RTCSPS    R        O  6 64REFFLD(RTCSPS)
     A  01                                  DSPATR(ND)
6.NU A            RTCMVA    R        O  6 69REFFLD(RTCMVA)
     A  03                                  DSPATR(ND)
6.20 A**          RTPROS    R        O  6 69REFFLD(RTPROS)
6.20 A**                                7 66'Akt:'
6.20 A**                                    COLOR(WHT)
6.20 A**07                                  DSPATR(ND)
6.20 A**          RTAKTI    R        O  7 71REFFLD(RTAKTI)
6.20 A**08                                  DSPATR(ND)
     A                                  8  1'Referanse'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  09 25 26                            DSPATR(ND)
     A                                  8 14'Bilagstekst         '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  20                                  DSPATR(ND)
     A                                  8 39'Forfall'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  21                                  DSPATR(ND)
     A                                  8 48'Kont.rab'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  22                                  DSPATR(ND)
     A                                  8 58'Val'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  23                                  DSPATR(ND)
     A                                  8 63'Valutabeløp'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  24                                  DSPATR(ND)
     A                                  9  1'Avkr:'
     A                                      COLOR(WHT)
     A  09                                  DSPATR(ND)
     A            RTKRYS    R        O  9  7REFFLD(RTKRYS)
     A  09                                  DSPATR(ND)
     A            RTTEXT    R        O  9 14REFFLD(RTTEXT)
     A  20                                  DSPATR(ND)
     A            D1FDAT         6S 0O  9 39
     A  21                                  DSPATR(ND)
     A            RTKRAB    R        O  9 49REFFLD(RTKRAB)
     A  22                                  DSPATR(ND)
     A            RTVALK    R        O  9 58REFFLD(RTVALK)
     A  23                                  DSPATR(ND)
     A            RTVALB    R        O  9 63REFFLD(RTVALB)
     A  24                                  DSPATR(ND)
     A                                 10  1'Ref.:'
     A                                      COLOR(WHT)
     A  25                                  DSPATR(ND)
     A            RTREFN    R        O 10  7REFFLD(RTREFN)
     A  25                                  DSPATR(ND)
     A                                 10 27'Kid-felt'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  27                                  DSPATR(ND)
     A                                 10 53'Att'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  28                                  DSPATR(ND)
     A                                 10 60'Virk'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  06                                  DSPATR(ND)
     A                                 10 66'Mengde'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A  29                                  DSPATR(ND)
     A                                 11  1'Lev.fak:'
     A                                      COLOR(WHT)
     A  26                                  DSPATR(ND)
     A            RTLFAK    R        O 11 10REFFLD(RTLFAK)
     A  26                                  DSPATR(ND)
     A            RTKIDI    R        O 11 27REFFLD(RTKIDI)
     A  27                                  DSPATR(ND)
     A            RTATTE    R        O 11 54REFFLD(RTATTE)
     A  28                                  DSPATR(ND)
     A            RTVIRK    R        O 11 60REFFLD(RTVIRK)
     A  06                                  DSPATR(ND)
     A            RTMNGD    R        O 11 66REFFLD(RTMNGD)
     A  29                                  DSPATR(ND)
     A                                 13  1'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R M1WIN
     A*%%TS  SD  20020106  001214  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(&W_AROW &W_ACOL 10 54)
     A                                      CA03
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Meldin10: '
     A                                      DSPATR(RI)
     A            M1MLD1    R        O  4  2REFFLD(RWMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            M1MLD2    R        O  5  2REFFLD(RWMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  2'Svar ja for OK, nei for ikke OK. .-
     A                                       . .'
     A            M1SVAR    R        B  7 43REFFLD(RWSVAR)
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      COLOR(YLW)
     A                                  7 47'J/N'
     A                                  9  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R S1WIN
     A*%%TS  SD  19940406  075932  AMD         REL-V2R3M0  5738-PW1
7.02 A                                      WINDOW(08 01 14 76)
7.02 A*                                      WINDOW(*DFT 14 76)
     A          R U1WSF                     SFL
     A*%%TS  SD  20040405  200855  KOB         REL-V5R2M0  5722-WDS
     A            U1BSUM    R        H      REFFLD(RSBSUM)
     A            U1VALG    R        B  6  2REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 4 0)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A            U1BUNT    R        O  6  5REFFLD(RSBUNT)
     A            U1RPER    R        O  6 12REFFLD(RSRPER)
     A            U1RAAR    R        O  6 15REFFLD(RSRAAR)
     A            U1DIFF    R        O  6 20REFFLD(RSBSUM)
     A            U1SLET         2A  O  6 36
     A          R U2WCT                     SFLCTL(U1WSF)
     A*%%TS  SD  20040405  185423  KOB         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      WINDOW(U2CMD)
     A                                      ROLLUP(10)
     A                                      CA03
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            SVRN02         4S 0H      SFLRCDNBR(CURSOR)
     A                                  1  1'Velg og trykk enter'
     A                                      COLOR(BLU)
7.xx A                                  2  5'Buntnr'
7.xx A                                      COLOR(WHT)
7.xx A                                  4  2'1=Velg'
     A                                      COLOR(BLU)
7.xx A                                  4 11'4=Slett'
     A                                      COLOR(BLU)
7.xx A                                  5  2'V'
     A                                      COLOR(WHT)
7.xx A            U2BUNT    R        B  3  5REFFLD(RSBUNT)
     A  31                                  DSPATR(PC)
     A  31                                  ERRMSGID(RMS0030 *LIBL/QMFOKON 31)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(RZ)
7.xx A                                  5  5'Buntnr'
     A                                      COLOR(WHT)
7.xx A                                  5 12'Periode'
     A                                      COLOR(WHT)
7.xx A                                  5 21'Differanse'
     A                                      COLOR(WHT)
7.xx A                                  5 33'Slettet'
     A                                      COLOR(WHT)
     A          R U2CMD
     A*%%TS  SD  19950509  131706  AMD         REL-V2R3M0  5738-PW1
     A                                      WINDOW(&W_AROW &W_ACOL 18 40)
     A                                      OVERLAY
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                 17  3'F3=Gå tilbake'
     A                                      COLOR(BLU)

     A          R V1WIN
     A*%%TS  SD  20040328  010639  KOB         REL-V5R2M0  5722-WDS
     A*                                     WINDOW(S1WIN)
7.xx A                                      WINDOW(02 02 14 74)
     A                                      CA03
     A                                      PUTOVR
7.xx A                                  1  1'RF010V1'
     A                                  2 28'Redigerings-bilde'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
7.xx A                                  4  5'B i l a g s'
     A                                      COLOR(WHT)
7.xx A                                  4 20'D e b e t'
     A                                      COLOR(WHT)
     A                                  4 34'M'
     A                                      COLOR(WHT)
7.xx A                                  4 47'K r e d i t'
     A                                      COLOR(WHT)
     A                                  4 62'M'
     A                                      COLOR(WHT)
     A                                  4 64'Pro- '
     A                                      COLOR(WHT)
     A                                  5  1'BK'
     A                                      COLOR(WHT)
7.xx A                                  5  5'Dato'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 14'Nr'
     A                                      COLOR(WHT)
7.xx A*                                     DSPATR(UL)
7.xx A                                  5 18'Avd'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 22'Konto'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 28'Bærer'
     A                                      COLOR(WHT)
7.xx A*                                     DSPATR(UL)
     A                                  5 34'K'
     A                                      COLOR(WHT)
     A                                  5 38'Beløp'
     A                                      COLOR(WHT)
7.xx A                                  5 46'Avd'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 50'Konto'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 56'Bærer'
     A                                      COLOR(WHT)
7.xx A*                                     DSPATR(UL)
     A                                  5 62'K'
     A                                      COLOR(WHT)
     A                                  5 64'sjekt'
     A                                      COLOR(WHT)
     A                                  5 71'Akt'
     A                                      COLOR(WHT)
     A            V1BIKO    R        B  6  1REFFLD(RA1BIK)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'C' 'D')
     A            V1BIDA    R        B  6  6REFFLD(RA1BID)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'C' 'D')
     A            V1BINR    R        B  6 14REFFLD(RA1BIN)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'A' 'C' 'D')
     A            V1DAVD    R        B  6 19REFFLD(RA1AVD)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'C' 'D' 'X')
     A            V1DKTO    R        B  6 24REFFLD(RA1KTO)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'C' 'D')
     A            V1DSPS    R        B  6 30REFFLD(RA1SPS)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'C' 'D' 'X')
     A            V1DMVA    R        B  6 34REFFLD(RA1MVA)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1BELP    R        B  6 40REFFLD(RA1BLP)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'C' 'D')
     A            V1PROS    R        B  6 66REFFLD(RA1PRO)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1AKTI    R        B  6 72REFFLD(RA1AKT)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A                                  8  1'Referanse'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  8 17'Bilagstekst'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
7.xx A                                  8 39'Forfall'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  8 48'Kont.rab'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  8 58'Val'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  8 63'Valutabeløp'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  9  1'Avkr:'
     A                                      COLOR(WHT)
     A            V1KRYS    R        B  9  7REFFLD(RA1AKR)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1TEXT    R        B  9 21REFFLD(RA1FTX)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1FDAT    R        B  9 42REFFLD(RA1FOR)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1KRAB    R        B  9 52REFFLD(RA1RAB)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1VALK    R        B  9 59REFFLD(RA1VKO)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1VALB    R        B  9 66REFFLD(RA1VBE)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A                                 10  1'Ref.:'
     A                                      COLOR(WHT)
     A            V1REFN    R        B 10  7REFFLD(RA1REF)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A                                 10 17'Kid-felt'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 10 41'Att'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 10 51'Virk'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 10 63'Mengde  '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 11  1'L.fak:'
     A                                      COLOR(WHT)
     A            V1LFAK    R        B 11  8REFFLD(RA1LFA)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1KIDI    R        B 11 21REFFLD(RA1KID)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1ATTE    R        B 11 42REFFLD(RA1ATT)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1VIRK    R        B 11 52REFFLD(RA1VRK)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A            V1MNGD    R        B 11 66REFFLD(RA1MGN)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'D' 'X')
     A                                 13  1'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 13 18'Enter=Oppdater'
     A                                      COLOR(BLU)
     A          R X1WIN
     A*%%TS  SD  20080215  104812  KOBASP      REL-V5R4M0  5722-WDS
     A                                      WINDOW(&W_AROW &W_ACOL 13 28)
     A                                      CA03
     A                                      CA05
     A                                      CA06
     A                                      CA07
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
7.xx A**                                1 20'RF010X1'
     A                                  2  3' Valg av kontotype '
     A                                      COLOR(WHT)
     A                                      DSPATR(RI)
     A                                  4  1'Velg og trykk enter'
     A                                      COLOR(BLU)
7.xx A**                                5  2'1=Velg'
7.xx A**                                    COLOR(BLU)
7.xx A**                                7  2'V'
7.xx A**                                    COLOR(WHT)
7.xx A**                                    DSPATR(UL)
7.xx A                                  6  2'Kontotype'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
7.xx A            X1VLG1    R        B  7 20REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 0)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
7.xx A                                  7 22'1/0'
7.xx A                                  7  2'Kontoplan'
7.xx A            X1VLG2    R        B  8 20REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 0)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
7.xx A                                  8 22'1/0'
7.xx A                                  8  2'Kunder'
7.xx A            X1VLG3    R        B  9 20REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 0)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
7.xx A                                  9 22'1/0'
7.xx A                                  9  2'Leverandører'
     A                                 12  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
7.xx A                                  7 15'(F5)'
7.xx A                                  8 15'(F6)'
7.xx A                                  9 15'(F7)'
