     A*%%TS  SD  19950201  142709  AMD         REL-V2R3M0  5738-PW1
     A*
     A* K00 bsa  080520    Valg om journal/kontrolliste
     A*
     A*-----------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(27 132 *WIDE -
     A                                             24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A          R A1WIN
     A*%%TS  SD  19950201  142709  AMD         REL-V2R3M0  5738-PW1
     A                                      CA03(03)
     A                                      KEEP
     A                                       WINDOW(2 2 8 55)
     A                                  2  2' Velg oppdateringstype '
     A                                      DSPATR(RI)
     A                                  4  2'Journal eller Kontrolliste'
     A            A1JOKO         1A  B  4 29
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES('J' 'K')
     A                                      DSPATR(PC)
     A                                  4 31'K=Kontroll,J=Journal'
     A                                  6  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
