     A*%%TS  SD  20140925  103312  ASK630      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20050604  204433  KOB         REL-V5R2M0  5722-WDS
     A            B1SKTY    R        H      REFFLD(RUSKTY)
     A            B1VALG    R        B  8  2REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(2 4 5 7)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOFAK)
     A            B1TYPE        20A  O  8  4
     A            B1SLAG    R        O  8 26REFFLD(RUSLAG)
     A            B1SBES    R        O  8 29REFFLD(RUSBES)
     A            B1SFRA    R        O  8 60REFFLD(RUSFRA)
     A            B1SDAT    R        O  8 71REFFLD(RUSDAT)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20100505  141827  ASK560      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av kortregister'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'2=Endre  4=Slett  5=Vis  7=Overfør-
     A                                      ing'
     A                                      COLOR(BLU)
     A                                  6  2'V Kort type            Lag Beskriv-
     A                                      else                    Gyldig fra -
     A                                      Avr.dato '
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20040831  092353  GRO         REL-V5R2M0  5722-WDS
     A                                 23  2'F3=Gå tilbake  F5=Forny  F6=Oppret-
     A                                      t'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20140925  103312  ASK630      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av kortregister'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Kort/avt.type.'
     A            C2SKTY         2Y 0B  5 17COLOR(YLW)
     A  31                                  ERRMSG('Kort/avt. type kan ikke vær-
     A                                      e 0 !')
     A  40                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A            C2KTPN        30A  O  5 24COLOR(YLW)
     A                                      OVRDTA
     A                                  5 57'Terminal korttype'
     A            C2KBTY         3   B  5 75COLOR(YLW)
     A                                  6  2'Lager. . . . .'
     A            C2SLAG    R     Y  B  6 17REFFLD(RUSLAG)
     A                                      COLOR(YLW)
     A  34                                  ERRMSG('Lagerkoden er feil !')
     A  40                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2LTXT        30A  O  6 24COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Brukerstedsnr.'
     A            C2SKID    R        B  8 17REFFLD(RUSKID)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  9  2'Beskrivelse. .'
     A            C2SBES    R        B  9 17REFFLD(RUSBES)
     A                                      DSPATR(UL)
     A  30                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Gyldig fra . .'
     A            C2SFRA         6Y 0B 10 17COLOR(YLW)
     A  32                                  ERRMSG('Gyldig FRA må fylles ut !')
     A  30                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      EDTWRD('  .  .  ')
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 11  2'Aktiv/passiv .'
     A            C2SHLD    R        B 11 17REFFLD(RUSHLD)
     A  33                                  ERRMSG('Aktiv/passiv kode må fylles-
     A                                       ut !')
     A  30                                  DSPATR(PR)
     A                                      VALUES('A' 'P')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 11 19'A=Aktiv P=Passiv'
     A                                 11 40'Ordreinfo kode. .'
     A            C2SITY         2A  B 11 58COLOR(YLW)
     A  41                                  ERRMSG('Ordreinfo kode finnes ikke')
     A  30                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 12  2'Sist kjørt . .'
     A            C2SDAT         6Y 0O 12 17COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 13  2'Kontoserie . .'
     A            C2SKTF         4S 0B 13 17DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
6.NU A**                               13 22' - '
     A                                 13 23'-'
     A            C2SKTT         4S 0B 13 25DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
6.NU A**                               13 30'(fra-til)'
     A                                 13 33'(fra-til)'
     A                                 14  2'Korttype . . .'
     A            C2STYP         1A  B 14 17
     A  35                                  ERRMSG('Korttype kan ikke være blan-
     A                                      k !')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES('F' 'K')
     A                                      OVRDTA
     A                                 14 19'F=Fordelskort, K=Kreditkort'
     A                                 15  2'Konto. . . . .'
     A            C2SKTO         4S 0B 15 17
     A  36                                  ERRMSG('Ugyldig konto !')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 15 25'Spes..'
     A            C2SPES         4  0B 15 32COLOR(YLW)
     A                                 16  2'Bilagskod . . '
     A            C2SBKD         2S 0B 16 17
     A  37                                  ERRMSG('Ugyldig bilagskode !')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 16 21'Debet'
     A            C2SKKD         2S 0B 16 27
     A  37                                  ERRMSG('Ugyldig bilagskode !')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 16 31'Kredit'
     A                                 17  2'Opfølging . . '
     A            C2SOME    R        B 17 17REFFLD(RUSOME)
     A  38                                  ERRMSG('Ugyldig oppfølgingsmetode!')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 17 19'R=Reskontro H=Hovedbok'
     A                                 18  2'Kjøremønster'
     A                                      COLOR(WHT)
     A                                 19  2'Frekvens. . . '
     A            C2SFRK    R        B 19 17REFFLD(RUSFRK)
     A  39                                  ERRMSG('Kun DG,UK,14 og MD')
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 19 20'DG=Daglig UK=Ukentlig 14=Hver 14.-
     A                                       dag  MD=Månedlig'
     A                                 20 16'Man  Tir.  Ons.  Tor.  Fre.  Lør. -
     A                                       Søn. '
     A                                 21  2'Dager. . . .  '
     A            C2SDG1    R        B 21 17REFFLD(RUSDG1)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1')
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 21 19'1=J'
     A            C2SDG2    R        B 21 23REFFLD(RUSDG2)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1')
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 21 25'1=J'
     A            C2SDG3    R        B 21 29REFFLD(RUSDG3)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1')
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 21 31'1=J'
     A            C2SDG4    R        B 21 35REFFLD(RUSDG4)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1')
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 21 37'1=J'
     A            C2SDG5    R        B 21 41REFFLD(RUSDG5)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1')
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 21 43'1=J'
     A            C2SDG6    R        B 21 47REFFLD(RUSDG6)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1')
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 21 49'1=J'
     A            C2SDG7    R        B 21 53REFFLD(RUSDG7)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1')
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 21 55'1=J'
     A                                 22 48'Sis endret '
     A            C2SEDA         6Y 0O 22 60COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 69'/'
     A            C2SEUS         3A  O 22 71COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=G tilbake   F4=Spøring '
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20050604  201355  KOB         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 12 60)
     A                                      CA03
     A                                      CA12
     A            D1SKTY    R        H      REFFLD(RUSKTY)
     A                                  2  2' Slette kortnummer '
     A                                      DSPATR(RI)
     A                                  4  2'Type . . . . . . .'
     A            D1TYPE        20   O  4 21
     A                                  5  2'Lager. . . . . . .'
     A            D1SLAG    R        O  5 21REFFLD(RUSLAG)
     A                                  7  2'Beskrivelse. . . .'
     A            D1SBES    R        O  7 21REFFLD(RUSBES)
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R F1WIN
     A*%%TS  SD  20050604  201355  KOB         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 16 30)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2'Hent inn'
     A                                      DSPATR(RI)
     A            F1HEAD        13A  O  2 11DSPATR(RI)
     A                                  4  2'1=Valg'
     A                                      COLOR(BLU)
     A                                  5  2'V'
     A                                      COLOR(WHT)
     A            F1ALTH        13A  O  5  5COLOR(WHT)
     A            F1VAL1         1A  B  6  2COLOR(YLW)
     A            F1ALT1        25A  O  6  5
     A            F1VAL2         1A  B  7  2COLOR(YLW)
     A            F1ALT2        25A  O  7  5
     A            F1VAL3         1A  B  8  2COLOR(YLW)
     A            F1ALT3        25A  O  8  5
     A            F1VAL4         1A  B  9  2COLOR(YLW)
     A            F1ALT4        25A  O  9  5
     A            F1VAL5         1A  B 10  2COLOR(YLW)
     A            F1ALT5        25A  O 10  5
     A            F1VAL6         1A  B 11  2COLOR(YLW)
     A            F1ALT6        25A  O 11  5
     A            F1VAL7         1A  B 12  2COLOR(YLW)
     A            F1ALT7        25A  O 12  5
     A            F1VAL8         1A  B 13  2COLOR(YLW)
     A            F1ALT8        25A  O 13  5
     A                                 15  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
