     A*%%TS  SD  20170317  094014  G0XEGASSKO  REL-V7R1M0  5770-WDS
     A*%%EC
7.xx A                                      DSPSIZ(24 80 *DS3 -
7.xx A                                             27 132 *WIDE)
7.XX A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20170315  222324  G0XEGASSKO  REL-V7R1M0  5770-WDS
     A            B1VALG    R        B  8  2REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(2 4 5)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1TILG    R        O  8  4REFFLD(RUFTIL)
     A            B1KTEK    R        O  8 25REFFLD(RUFTEK)
     A*
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20170315  225119  G0XEGASSKO  REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av tilganger'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'2=Endre  4=slett'
     A                                      COLOR(BLU)
     A                                  6  2'V  Tilgang             Beskrivelse-
     A                                                         '
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20040831  092353  GRO         REL-V5R2M0  5722-WDS
     A                                 23  2'F3=Gå tilbake  F6=Opprett  F5=Forn-
     A                                      y'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20170317  094014  G0XEGASSKO  REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            C2KTSQ    R        H      REFFLD(RUKTSQ)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av tilgangsregister'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6  2'Tilgang  . . .'
     A            C2TILG    R        B  6 18REFFLD(RUFTIL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                  7  2'Beskrivelse   '
     A            C2FTEK    R        B  7 18REFFLD(RUFTEK)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                 22 48'Sist endret'
     A            C2EDAT         6Y 0O 22 60COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 69'/'
     A            C2EUSR         3A  O 22 71COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake  '
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20170315  222324  G0XEGASSKO  REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 12 60)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette tilgang '
     A                                      DSPATR(RI)
     A                                  4  2'Tilgang  . . . . .'
     A            D1TILG    R        O  4 21REFFLD(RUFTIL)
     A                                  5  2'Beskrivelse. . . .'
     A            D1KTEK    R        O  5 21REFFLD(RUFTEK)
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
