     A*%%TS  SD  20031109  122216  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : XX405D
     A* Beskrivelse . . : Kopiering av firma til ny filgruppe
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       300403 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20031109  122216  KOB         REL-V5R2M0  5722-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kopiering av firma til ny filgrupp-
     A                                      e'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  4  3'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  6  8'V'
     A                                      COLOR(WHT)
     A                                  6 10'Navn  '
     A                                      COLOR(WHT)
     A                                  6 17'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  6 45'V'
     A                                      COLOR(WHT)
     A                                  6 47'Navn  '
     A                                      COLOR(WHT)
     A                                  6 54'Beskrivelse av file'
     A                                      COLOR(WHT)
     A            A1VGPL         1A  B  7  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                  7 10'AX405C Faste registre ASPGPL'
     A            A1VOFA         1A  B  7 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                  7 47'FX405C Faste registre ASOFAK'
     A            A1VOKO         1A  B  9  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                  9 10'RF405C Faste registre ASOKON'
     A            A1VSHO         1A  B  9 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                  9 47'BX405C Faste registre ASSHOP'
     A            A1VBNK         1A  B 11  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                 11 10'DB405C Faste registre ASBANK'
     A            A1VLAG         1A  B 11 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                 11 47'LX405C Faste registre ASLAGR'
     A            A1VTEL         1A  B 13  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                 13 10'GL405C Faste registre ASTELE'
     A            A1VSTA         1A  B 13 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                 13 47'SX405C Faste registre ASSTAT'
     A                                 17 22'Gammel filgruppe. . . . . . . :'
     A            A1FGRP         3A  O 17 55
     A                                 18 22'Gammelt firmanummer . . . . . :'
     A            A1FFIR         3A  O 18 55
     A                                 20 22'Oppgi ny filgruppe. . . . . . :'
     A            A1TGRP         3A  B 20 55CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                 21 22'Oppgi nytt firmanummer. . . . :'
     A            A1TFIR         3A  B 21 55
     A                                 23  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
