     A*%%TS  SD  20040126  142225  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RF410D
     A* Beskrivelse . . : Koder - kopiering av faste data
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200104 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A1BLD
     A*%%TS  SD  20040126  142225  KOB         REL-V5R2M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA12
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kopiering av faste data'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Fra . :'
     A            A1FFIR    R        O  5 10REFFLD(AFRFR/AAFFIR *LIBL/AFRF)
     A                                      DSPATR(UL)
     A            A1FNAV    R        O  5 14REFFLD(AFRFR/AAFNAV *LIBL/AFRF)
     A                                      DSPATR(UL)
     A                                  6  2'TIL . :'
     A            A1TFIR    R        O  6 10REFFLD(AFRFR/AAFFIR *LIBL/AFRF)
     A                                      DSPATR(UL)
     A            A1TNAV    R        O  6 14REFFLD(AFRFR/AAFNAV *LIBL/AFRF)
     A                                      DSPATR(UL)
     A                                  8  2'Velg koder'
     A                                      COLOR(BLU)
     A            A1KO01         1A  B 10 10VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 12'- Regnskapskoder         '
     A            A1KO02         1A  B 11 10VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 12'- OCR-koder              '
     A            A1KO03         1A  B 12 10VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12 12'- Reskontrokoder         '
     A            A1KO04         1A  B 13 10VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13 12'- Sist brukte nummer     '
     A            A1KO05         1A  B 14 10VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14 12'- Betalingsvarsel/Renteberegning'
     A            A1KO06         1A  B 15 10VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 15 12'- Redigere registreringsbildet  '
     A                                 23  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 21'F12=Annuller'
     A                                      COLOR(BLU)
