     A*%%TS  SD  20040120  211657  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RF413D
     A* Beskrivelse . . : Kontoplan, kopiering
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200104 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A1BLD
     A*%%TS  SD  20040120  211657  KOB         REL-V5R2M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA12
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kopiering av kontoplan'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  7 10'Fra firma . . :'
     A            A1FFIR    R        O  7 26REFFLD(AFRFR/AAFFIR *LIBL/AFRF)
     A                                      DSPATR(UL)
     A            A1FNAV    R        O  7 30REFFLD(AFRFR/AAFNAV *LIBL/AFRF)
     A                                      DSPATR(UL)
     A                                  9 10'Til firma . . :'
     A            A1TFIR    R        O  9 26REFFLD(AFRFR/AAFFIR *LIBL/AFRF)
     A                                      DSPATR(UL)
     A            A1TNAV    R        O  9 30REFFLD(AFRFR/AAFNAV *LIBL/AFRF)
     A                                      DSPATR(UL)
     A                                 23  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 20'F12=Annuller'
     A                                      COLOR(BLU)
