     A*%%TS  SD  20020122  202443  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK630D
     A* Beskrivelse . . : Felles, utskrift kontaktperson - parameterer
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       100806 HFL  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20020122  202443  KOB         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA12
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av kontaktpersoner'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  7  2'Utvalg:'
     A                                      COLOR(WHT)
     A                                  7 40'Fra    -  Til'
     A                                  8  4'Tilknyttet kunde. . .:'
     A            A2PKUN    R        B  8 27REFFLD(RKPALF)
     A  44                                  DSPATR(PC)
     A  31                                  ERRMSGID(RMH0290 *LIBL/QMFOKON 31)
     A  43                                  ERRMSGID(RMH0290 *LIBL/QMFOKON 31)
     A  43                                  ERRMSG('Velg kunde, leverandør elle-
     A                                      r alle')
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  8 30'(J=Ja, Blank)'
     A            A2PKUF    R        B  8 44REFFLD(RKPKNR)
     A  32                                  DSPATR(PC)
     A  32                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 32)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Kundenummer fra . .')
     A                                      COLOR(YLW)
     A                                  8 52'-'
     A            A2PKUT    R        B  8 55REFFLD(RKPKNR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Kundenummer til . .')
     A                                      COLOR(YLW)
     A                                  9  4'Avdeling. . . . . . .:'
     A            A2PKAF    R        B  9 44REFFLD(RKPAVF)
     A  33                                  DSPATR(PC)
     A  33                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  9 52'-'
     A            A2PKAT    R        B  9 55REFFLD(RKPAVT)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 10  4'Kundekategori . . . .:'
     A            A2PKKF    R        B 10 44REFFLD(RKPKAF)
     A  34                                  DSPATR(PC)
     A  34                                  ERRMSGID(RMH0350 *LIBL/QMFOKON 34)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 10 52'-'
     A            A2PKKT    R        B 10 55REFFLD(RKPKAT)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 11  4'Selger. . . . . . .:'
     A            A2PSEF    R        B 11 44REFFLD(RKPSEF)
     A  35                                  DSPATR(PC)
     A  35                                  ERRMSGID(RMH0370 *LIBL/QMFOKON 35)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 11 52'-'
     A            A2PSET    R        B 11 55REFFLD(RKPSET)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 12  4'Distrikt. . . . . . .:'
     A            A2PKDF    R        B 12 44REFFLD(RKPDIF)
     A  36                                  DSPATR(PC)
     A  36                                  ERRMSGID(RMH0400 *LIBL/QMFOKON 36)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Distrikt fra. . . .')
     A                                      COLOR(YLW)
     A                                 12 52'-'
     A            A2PKDT    R        B 12 55REFFLD(RKPDIT)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Distrikt til. . . .')
     A                                      COLOR(YLW)
     A                                 13  2'eller:'
     A                                      COLOR(WHT)
     A                                 14  4'Tilknyttet leverandør:'
     A            A2PLEV    R        B 14 27REFFLD(RKPALF)
     A  37                                  DSPATR(PC)
     A  37                                  ERRMSGID(RMH0290 *LIBL/QMFOKON 37)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 14 30'(J=Ja, Blank)'
     A            A2PLEF    R        B 14 44REFFLD(RKPKNR)
     A  38                                  DSPATR(PC)
     A  38                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 38)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Kundenummer fra . .')
     A                                      COLOR(YLW)
     A                                 14 52'-'
     A            A2PLET    R        B 14 55REFFLD(RKPKNR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Leverandørnr.til . .')
     A                                      COLOR(YLW)
     A                                 15  4'Avdeling. . . . . . .:'
     A            A2PLAF    R        B 15 44REFFLD(RKPAVF)
     A  39                                  DSPATR(PC)
     A  39                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 39)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 15 52'-'
     A            A2PLAT    R        B 15 55REFFLD(RKPAVT)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 16  4'Leverkategori . . . .:'
     A            A2PLKF    R        B 16 44REFFLD(RKPKAF)
     A  40                                  DSPATR(PC)
     A  40                                  ERRMSGID(RMH0350 *LIBL/QMFOKON 40)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 16 52'-'
     A            A2PLKT    R        B 16 55REFFLD(RKPKAT)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 17  4'Distrikt. . . . . . .:'
     A            A2PLDF    R        B 17 44REFFLD(RKPDIF)
     A  41                                  DSPATR(PC)
     A  41                                  ERRMSGID(RMH0400 *LIBL/QMFOKON 41)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Distrikt fra. . . .')
     A                                      COLOR(YLW)
     A                                 17 52'-'
     A            A2PLDT    R        B 17 55REFFLD(RKPDIT)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Distrikt til. . . .')
     A                                      COLOR(YLW)
     A                                 18  2'eller:'
     A                                      COLOR(WHT)
     A                                 19  4'Alle, alfabetisk . . :'
     A            A2PALL    R        B 19 27REFFLD(RKPALF)
     A  42                                  DSPATR(PC)
     A  42                                  ERRMSGID(RMH0290 *LIBL/QMFOKON 42)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Sortering . . . . .')
     A                                      COLOR(YLW)
     A                                 19 30'(J=Ja, Blank)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
