     A*%%TS  SD  20100505  140613  ASK560      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20030612  132833  HKO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 16 70)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Eksport av fil til kortselskap'
     A                                      DSPATR(RI)
     A                                  5  2'Korttype. . . . . .'
     A            B1KORT         2  0B  5 22
     A  36                                  ERRMSG('Det finnes flere forkomster-
     A                                       av denne korttypen. Bruk F4 og vel-
     A                                      g ut et.')
     A  40                                  ERRMSG('Ugyldig kortvalg - Prøv igj-
     A                                      en.')
6.20 A  41                                  ERRMSG('Overføring pågår allerede')
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            B1KTXT        15A  O  5 26COLOR(YLW)
     A                                  7  2'Transaksjoner f.o.m'
     A                                  7 31'(Blank=leser alle ikke overførte p-
     A                                      oster'
     A                                  6  2'Lager . . . . . . .'
6.11 A            B1LAGE         2  0B  6 22
6.11 A                                      COLOR(YLW)
6.11 A                                      CHECK(RB)
6.11 A                                  6 26'(00=alle lager)'
     A            B1FDAT         6Y 0B  7 22COLOR(YLW)
     A  31                                  ERRMSGID(SM00110 *LIBL/QMFSTAT 31)
     A  32                                  ERRMSGID(SM00050 *LIBL/QMFSTAT 32)
     A  35                                  ERRMSGID(SM00055 *LIBL/QMFSTAT 35)
     A                                      DSPATR(PC)
     A                                      EDTWRD('  .  .  ')
     A                                      CHECK(RB)
     A                                  8  2'Transaksjoner t.o.m'
     A            B1TDAT         6Y 0B  8 22COLOR(YLW)
     A  33                                  ERRMSGID(SM00110 *LIBL/QMFSTAT 33)
     A  34                                  ERRMSGID(SM00050 *LIBL/QMFSTAT 34)
     A                                      EDTWRD('  .  .  ')
     A                                      CHECK(RB)
     A**                               10  2'Filnavn . . . . . .'
     A**          B1FILE        12A  B 10 22COLOR(YLW)
     A**36                                  ERRMSGID(SM00600 *LIBL/QMFSTAT 36)
     A**38                                  ERRMSGID(SM00601 *LIBL/QMFSTAT 38)
     A**                               11  2'Mappenavn (QDLS). .'
     A**          B1FLDR        20A  B 11 22COLOR(YLW)
     A**37                                  ERRMSGID(SM00605 *LIBL/QMFSTAT 37)
     A                                 10  2'Omkjøring . . . . .'
     A            B1TIDL         1Y 0B 10 22COLOR(YLW)
     A  38                                  ERRMSG('Ugyldig valg - Prøv igjen')
     A                                 10 24'0=Nei 1=Ja(kun tidligere rapp.)'
     A                                 15  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R F1WIN
     A*%%TS  SD  20050604  201355  KOB         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 16 30)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2'Hent inn'
     A                                      DSPATR(RI)
     A            F1HEAD        13A  O  2 11DSPATR(RI)
     A                                  4  2'1=Valg'
     A                                      COLOR(BLU)
     A                                  5  2'V'
     A                                      COLOR(WHT)
     A            F1ALTH        13A  O  5  5COLOR(WHT)
     A            F1VAL1         1A  B  6  2COLOR(YLW)
     A            F1ALT1        25A  O  6  5
     A            F1VAL2         1A  B  7  2COLOR(YLW)
     A            F1ALT2        25A  O  7  5
     A            F1VAL3         1A  B  8  2COLOR(YLW)
     A            F1ALT3        25A  O  8  5
     A            F1VAL4         1A  B  9  2COLOR(YLW)
     A            F1ALT4        25A  O  9  5
     A            F1VAL5         1A  B 10  2COLOR(YLW)
     A            F1ALT5        25A  O 10  5
     A            F1VAL6         1A  B 11  2COLOR(YLW)
     A            F1ALT6        25A  O 11  5
     A            F1VAL7         1A  B 12  2COLOR(YLW)
     A            F1ALT7        25A  O 12  5
     A            F1VAL8         1A  B 13  2COLOR(YLW)
     A            F1ALT8        25A  O 13  5
     A                                 15  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B1MSG
     A*%%TS  SD  20020422  094714  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 13 38)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Feil oppstod under behandling av'
     A                                  3  2'transaksjonsfil'
     A**                                5  2'Valgt mappenavn er ugyldig, filnav-
     A**                                    n'
     A**                                6  2'er ugyldig, eller du mangler tilga-
     A**                                    ng'
     A**                                7  2'for behandling av mapper.'
     A**                                9  2'Dersom du mangler tilgang må du'
     A**                               10  2'kontakte systemansvarlig.'
     A                                 12  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B1SBM
     A*%%TS  SD  19980228  175922  HKO         REL-V3R7M0  5716-PW1
     A                                      WINDOW(*DFT 5 40)
     A                                      CA03
     A                                      CA12
     A                                  3  2'Jobben er sendt som bakgrunnsjobb.'
     A          R ASUME                     ASSUME
     A                                 24 79' '
