     A*%%TS  SD  20071106  115725  HFL550      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A          R M1WIN
     A                                      CA12
     A                                      KEEP
     A                                      WINDOW(&W_ACLI &W_ACPO 17 71)
     A            W_ACLI         2S 0P
     A            W_ACPO         3S 0P
     A                                  2  2'Årsrutine kjøres som første rutine-
     A                                       på nytt år.'
     A                                      COLOR(RED)
     A                                  3  2'Rutinen kjøres uansett om regnskap-
     A                                      et for forrige år er avsluttet elle-
     A                                      r'
     A                                      COLOR(RED)
     A                                  4  2'ikke.'
     A                                      COLOR(RED)
     A                                  5  2'Etter at rutinen er kjørt, kan det-
     A                                       registreres på to år samtidig,'
     A                                      COLOR(RED)
     A                                  6  2'i år og i fjor.'
     A                                      COLOR(RED)
     A                                  7  2'Kjøp hittil i år nullstilles etter-
     A                                       kopiering til fjoråret i kunde- og'
     A                                      COLOR(RED)
     A                                  8  2'leverandørreskontro.'
     A                                      COLOR(RED)
     A                                  9  2'Rutinen må kjøres bare en gang.'
     A                                      COLOR(RED)
     A                                 11  2'Du er i ferd med å starte rutinen -
     A                                      for'
     A  31                             11 40'ALLE FILGRUPPER.'
     A                                      COLOR(WHT)
     A N31                             11 40'FILGRUPPE'
     A                                      COLOR(WHT)
     A N31        W_FGRP         3A    11 50
     A                                      COLOR(WHT)
     A                                 13  2'Skal rutinen kjøres?'
     A                                 14  2'Svar ja for OK, nei for ikke OK. .-
     A                                       . .'
     A            M1SVAR    R        B 14 43REFFLD(AÅSVAR)
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 14 47'J=Ja'
     A                                 15 47'N=Nei'
     A                                 16  2'F12=Annuller'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
