     A*%%TS  SD  20021221  110206  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RF952D
     A* Beskrivelse . . : Flytting av poster til ny periode
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       201202 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20021221  110206  KOB         REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Flytter alle poster på en journal'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  8'Dato .:'
     A            A2PKDA    R        B  5 16REFFLD(RHPKDA)
     A  31                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 31)
     A                                      DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  5 26'Regnskapsår . . . .(Fra). .:'
     A            A2AARF    R        B  5 55REFFLD(RHPRÅR)
     A  32                                  ERRMSGID(RMA0210 *LIBL/QMFOKON 32)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  5 61'til'
     A            A2AART    R        B  5 65REFFLD(RHPRÅR)
     A  32                                  ERRMSGID(RMA0210 *LIBL/QMFOKON 32)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  6 26'Regnskapsperiode. .(Fra). .:'
     A            A2PERF    R        B  6 55REFFLD(RKPPER)
     A  33                                  ERRMSGID(RMA0220 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  6 61'til'
     A            A2PERT    R        B  6 65REFFLD(RKPPER)
     A  34                                  ERRMSGID(RMA0220 *LIBL/QMFOKON 34)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  7 26'Journalnr.  . . . . . . . .:'
     A            A2PJNR    R        B  7 55REFFLD(RHPJNR)
     A  35                                  ERRMSGID(RMH0450 *LIBL/QMFOKON 35)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  9  9'Rutinen endrer alle poster i hoved-
     A                                      bok, prosjekt, kunde- og '
     A                                      COLOR(RED)
     A                                 10  9'leverandør-reskontro innenfor oppg-
     A                                      itt regnskapsår og journalnummer.'
     A                                      COLOR(RED)
     A                                 12  9'Etter at rutinen er kjørt må følge-
     A                                      nde rutiner kjøres:'
     A                                      COLOR(RED)
     A                                 13  9'Dersom flytting mellom to regnskap-
     A                                      sår:'
     A                                      COLOR(RED)
     A                                 14 10'Kunde/leverandør : Kjør rutinen:'
     A                                      COLOR(RED)
     A                                 14 43'Oppdaterer saldo/kjøp fra posterin-
     A                                      ger'
     A                                 15 29'med nytt år og J i feltene for kjø-
     A                                      p i år/i fjor'
     A                                      COLOR(RED)
     A                                 16 10'Hovedbok/Prosjekt: Kjør rutinen:'
     A                                      COLOR(RED)
     A                                 16 43'Ny saldo utfra trans'
     A                                 16 64'på begge år'
     A                                      COLOR(RED)
     A                                 17  9'Dersom flytting innen samme regnsk-
     A                                      apsår:'
     A                                      COLOR(RED)
     A                                 18 10'Kunde-/Leverandør: Ingen oppdateri-
     A                                      ng nødvendig'
     A                                      COLOR(RED)
     A                                 19 10'Hovedbok/Prosjekt: Kjør rutinen:'
     A                                      COLOR(RED)
     A                                 19 43'Ny saldo utfra trans'
     A                                 19 65'på riktig år'
     A                                      COLOR(RED)
     A                                 20  9'Oppdateringsrutinene finnes på Hov-
     A                                      edmeny pkt. 5 Hjelperutiner'
     A                                      COLOR(RED)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
