     A*%%TS  SD  20070307  002447  KOB550      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RF960D
     A* Beskrivelse . . : Endring av postnummer
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       060307 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20070307  002447  KOB550      REL-V5R4M0  5722-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CF04
     A                                      CF07
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      PUTOVR
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Endring av postnummer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  7  7'Gamelt postnummer. . :'
     A                                  8  7'Nytt postnummer. . . :'
     A                                 23  5'F3=Gå tilbake  F4=Spøring  F7=Oppd-
     A                                      ater'
     A                                      COLOR(BLU)
     A            A1FPNR         4Y 0B  7 30DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            A1FTXT        25A  O  7 35DSPATR(UL)
     A                                      OVRDTA
     A            A1TPNR         4Y 0B  8 30DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            A1TTXT        25A  O  8 35DSPATR(UL)
     A                                      OVRDTA
     A                                  5  2'Registrer gammelt og nytt postnr, -
     A                                      trykk F7 for å oppdatere'
     A                                      COLOR(WHT)
