     A*%%TS  SD  20170308  104235  SST630      REL-V7R1M0  5770-WDS
     A*
7.xx A* K000 220620  bsa Endringer relatert til ny GUI
     A*
     A*
     A*
     A*
     A*-------------------------------------------------------------------
     A*%%EC
7.xx A                                      DSPSIZ(24 80 *DS3 -
7.xx A                                             27 132 *WIDE)
     A                                      REF(*LIBL/IFRF IFRFR)
     A                                      HOME(21)
     A                                      CA03(03 'F3=GÅ TILBAKE')
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '        '))
     A          R K1WIN
     A*%%TS  SD  20170308  104235  SST630      REL-V7R1M0  5770-WDS
     A                                      WINDOW(3 7 8 40)
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  7  3'F3=Avbryt kjøring'
     A                                      COLOR(BLU)
     A                                  2  2'Overstyre bilagsdato til NAV      -
     A                                         '
     A                                      DSPATR(RI)
     A            MELD          20A  O  6  3OVRDTA
     A  43                                  DSPATR(ND)
     A  44                                  DSPATR(RI)
     A  44                                  COLOR(RED)
     A                                  5  4'Bilagsdato'
     A            DATO           6A  B  5 17OVRDTA
     A                                      COLOR(YLW)
     A                                  5 25'(ddmmåå)'
     A          R S2WIN
     A*%%TS  SD  19990322  213748  BOF         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 09 40)
     A          R ASUME
     A*%%TS  SD  19980123  101059  MWE         REL-V3R7M0  5716-PW1
     A                                      ASSUME
     A                                 24 79' '
