     A*%%TS  SD  20190429  141629  NHO700      REL-V7R3M0  5770-WDS
6.20 A*  091112   NHO   Ny fil vedr DI systemer og FOVFPF
6.30 A*  210815   NHO   Ny sum fil for Visma Business butikk
6.31 A*  231116   NHO   Ny sum fil for Visma Business fakt
6.32 A*  160317   NHO   Ny FIL FQFWPF
7.00 A*  290419   NHO   Ny fil for Mamut fakt og Butikk
7.00 A*                 Flytt av alle felt 14 pos til venstre
7.01 A*  270619   NHO   Nye filer for Business lager
7.02 A*  311019   NHO   Ny for mvakode
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20190429  141629  NHO700      REL-V7R3M0  5770-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppretting av database'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  3'1=Valg'
     A                                      COLOR(BLU)
6.31 A*                                 7 27'V'
     A                                  5 13'V'
     A                                      COLOR(WHT)
6.31 A*                                 7 29'Navn  '
     A                                  5 15'Navn  '
     A                                      COLOR(WHT)
6.31 A*                                 7 36'Beskrivelse av file'
     A                                  5 22'Beskrivelse av file'
     A                                      COLOR(WHT)
     A            A1V0           1A  B  7 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 15'FOFUT Visma / sum fakt.      '
     A            A1V1           1A  B  8 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 15'RV01P Visma / flatfil        '
     A            A1V2           1A  B  9 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 15'RV01P Visma / flatfil BOVFPF '
     A            A1V3           1A  B 10 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 15'RZ01P Zirius / flatfil        '
     A            A1V4           1A  B 11 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 15'RZ02P Zirius / flatfil BOVFPF  '
     A            A1V5           1A  B 12 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12 15'RV01P DI-System/flatfil       '
     A            A1V6           1A  B 13 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13 15'RV02P DI-System/flatfil BOVFPF '
     A            A1V7           1A  B 14 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14 15'BQVWP DI-System/Summeringsfil  '
     A            A1V8           1A  B 15 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 15 15'BOVFU DI-System/Summert BOVFPF '
6.20 A*           A1V9           1A  B 16 13VALUES(' ' '1')
6.20 A*                                     CHKMSGID(AM00010 *LIBL/QMFAGPL)
6.20 A*                                     DSPATR(PC)
6.20 A*                                     COLOR(YLW)
     A                                 16 15'FOVIP DI-System/Summert FOVIPF '
     A            A1V10          1A  B 16 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 17 15'FOVUP DI-System/Summert FOVUPF '
     A            A1V9           1A  B 17 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A            A1V11          1A  B 18 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 18 15'BQBWP Business/Summeringsfil   '
     A            A1V12          1A  B 19 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 19 15'BOBFU Business/Summeringsfil   '
     A                                 20 10'Opgi file-gruppe . . . . . . : '
     A            A1FGRP         3A  B 20 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      DFTVAL('XXX')
     A                                      COLOR(YLW)
     A                                 21 10'Ska register(e) nullstilles. : '
     A            A1NULL         1A  B 21 43VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 21 47'(S=Slete innhold i register) '
     A                                 23  3'F3=G tilbake '
     A                                      COLOR(BLU)
     A                                  6 15'FQFWP Visma '
     A            A1V13          1A  B  6 13VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
7.00 A                                  5 53'V'
7.00 A                                      COLOR(WHT)
7.00 A                                  5 57'Navn'
7.00 A                                      COLOR(WHT)
7.00 A                                  5 64'Beskrivelse'
7.00 A                                      COLOR(WHT)
7.00 A            A1V14          1A  B  6 53VALUES(' ' '1')
7.00 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.00 A                                      DSPATR(PC)
7.00 A                                      COLOR(YLW)
7.00 A                                  6 57'RM01PF Mamut/Fakt'
7.00 A            A1V15          1A  B  7 53VALUES(' ' '1')
7.00 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.00 A                                      DSPATR(PC)
7.00 A                                      COLOR(YLW)
7.00 A                                  7 57'RM02PF Mamut/Butikk'
7.01 A            A1V20          1A  B  9 53VALUES(' ' '1')
7.01 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.01 A                                      DSPATR(PC)
7.01 A                                      COLOR(YLW)
7.01 A                                  9 57'RB20PF Nexst/Ny mva kode'
7.00 A            A1V16          1A  B 10 53VALUES(' ' '1')
7.00 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.00 A                                      DSPATR(PC)
7.00 A                                      COLOR(YLW)
7.00 A                                 10 57'RB10PF Nexst/Ny bil.kode'
7.01 A            A1V17          1A  B 12 53VALUES(' ' '1')
7.01 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.01 A                                      DSPATR(PC)
7.01 A                                      COLOR(YLW)
7.01 A                                 12 57'RV03PF Business/lager   '
7.01 A            A1V18          1A  B 13 53VALUES(' ' '1')
7.01 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.01 A                                      DSPATR(PC)
7.01 A                                      COLOR(YLW)
7.01 A                                 13 57'LOVUPF Business/lagerSum'
7.01 A            A1V19          1A  B 14 53VALUES(' ' '1')
7.01 A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
7.01 A                                      DSPATR(PC)
7.01 A                                      COLOR(YLW)
7.01 A                                 14 57'LOVIPF Business/lagerSum'
