     A*%%TS  SD  20020106  015815  KOB         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20020106  015815  KOB         REL-V5R1M0  5722-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
6.NU A***                               1 46'Økonomi'
6.NU A***                                   COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppretting av database'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  4  3'1=Valg'
     A                                      COLOR(BLU)
     A                                  7 25'Fra dette skjermbildet kan alle'
     A                                  8 25'databasefiler i økonomisystemet'
     A                                  9 25'bygges opp i en operasjon.     '
     A            A1VALL         1A  B 16 23VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 16 25'Alle databasefiler i økonomisystem-
     A                                      et.'
     A                                 20 10'Oppgi file-gruppe . . . . . . :'
     A            A1FGRP         3A  B 20 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      DFTVAL('XXX')
     A                                      COLOR(YLW)
     A                                 21 10'Skal register(e) nullstilles. :'
     A            A1NULL         1A  B 21 43VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 21 47'(S=Slette innhold i register)'
     A                                 23  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  1 37'AS Økonomi'
     A                                      COLOR(WHT)
