     A*%%TS  SD  20140327  101014  BOFBMP      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20140327  101014  BOFBMP      REL-V7R1M0  5770-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppretting av database'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  4  3'1=Valg'
     A                                      COLOR(BLU)
     A                                  5  8'V'
     A                                      COLOR(WHT)
     A                                  5 10'Navn  '
     A                                      COLOR(WHT)
     A                                  5 17'Beskrivelse av file'
     A                                      COLOR(WHT)
     A                                  5 45'V'
     A                                      COLOR(WHT)
     A                                  5 47'Navn  '
     A                                      COLOR(WHT)
     A                                  5 54'Beskrivelse av file'
     A                                      COLOR(WHT)
     A            A1VA01         1A  B  6  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  6 10'RA01PF Bilagskoder'
     A            A1VA15         1A  B 20  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 20 10'RA15PF Mengdekoder'
     A            A1VA02         1A  B  7  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 10'RA02PF Betalingsmåte'
     A            A1VA16         1A  B  6 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  6 47'RA16PF Valutakurser'
     A            A1VA03         1A  B  8  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 10'RA03PF Betalingsbetingelse'
     A            A1VA17         1A  B  7 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  7 47'RA17PF Forsendelsesmåte'
     A            A1VA04         1A  B  9  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 10'RA04PF Faste konti'
     A            A1VA18         1A  B  8 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 47'RA18PF Leveringsbetingelse'
     A            A1VA05         1A  B 10  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 10'RA05PF MVA-koder'
     A            A1VA19         1A  B  9 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 47'RA19PF Kontoklasse'
     A            A1VA06         1A  B 11  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 10'RA06PF Rabattgruppe'
     A            A1VA20         1A  B 10 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 47'RA20PF Kontogruppe'
     A            A1VA07         1A  B 12  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12 10'RA07PF Avdeling'
     A            A1VA21         1A  B 11 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 11 47'RA21PF Aktivitet'
     A            A1VA08         1A  B 13  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13 10'RA08PF Distrikt'
     A            A1VA22         1A  B 12 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12 47'RA22PF Speditør'
     A            A1VA09         1A  B 14  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14 10'RA09PF Selger'
     A            A1VA23         1A  B 13 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 13 47'RA23PF Virksomhet'
     A            A1VA10         1A  B 15  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 15 10'RA10PF Lager'
     A            A1VA24         1A  B 14 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 14 47'RA24PF Reklamasjonsårsak'
     A            A1VA11         1A  B 16  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 16 10'RA11PF Kundekategori'
     A            A1VA25         1A  B 15 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 15 47'RA25PF Kjørerute'
     A            A1VA12         1A  B 17  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 17 10'RA12PF Land'
     A            A1VA26         1A  B 16 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 16 47'RA26PF Saksbehandler'
     A            A1VA13         1A  B 18  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 18 10'RA13PF Fordelingsnøkkel'
     A            A1VA27         1A  B 17 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 17 47'RA27PF Kostnadsbærergruppe'
     A            A1VA14         1A  B 19  8VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 19 10'RA14PF Leverandørkategori'
     A            A1VA28         1A  B 18 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 18 47'RA28PF Kostnadsbærer'
     A            A1VA29         1A  B 19 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 19 47'RA29PF Mobiloperatør'
     A            A1VA30         1A  B 20 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 20 47'RA30PF Prisgrupper  '
     A            A1VA31         1A  B 21 45VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 21 47'RA31PF Leveringsmåte Bestilling'
     A                                 21  8'Oppgi file-gruppe . . . . . . :'
     A            A1FGRP         3A  B 21 40CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      DFTVAL('XXX')
     A                                      COLOR(YLW)
     A                                 22  8'Skal register(e) nullstilles. :'
     A            A1NULL         1A  B 22 40VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 22 43'(S=Slette innhold i register)'
     A                                 23  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
