     A*%%TS  SD  20050421  084434  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RCG01D
     A* Beskrivelse . . : Generering av databasefiler, inkasso
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       130902 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20050421  084434  KOB         REL-V5R2M0  5722-WDS
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppretting av databaser - autogiro'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5 11'1=Valg'
     A                                      COLOR(BLU)
     A                                  7 11'V'
     A                                      COLOR(WHT)
     A                                  7 13'Navn  '
     A                                      COLOR(WHT)
     A                                  7 20'Beskrivelse av file'
     A                                      COLOR(WHT)
     A            A1VAUT         1A  B  8 11VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  8 13'RAUTPF'
     A                                  8 20'Forsendelse Autogiro (grunnlag)'
     A            A1VKWC         1A  B  9 11VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 13'RKWCPF'
     A                                  9 20'Kundetrans. workfile C      '
     A            A1VKW4         1A  B 10 11VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 10 13'RKW4PF'
     A                                 10 20'Kundetrans. workfile 4      '
     A                                 20 10'Oppgi file-gruppe . . . . . . :'
     A            A1FGRP         3A  B 20 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      DFTVAL('XXX')
     A                                      COLOR(YLW)
     A                                 21 10'Skal register(e) nullstilles. :'
     A            A1NULL         1A  B 21 43VALUES(' ' 'S')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      COLOR(YLW)
     A                                 21 47'(S=Slette innhold i register)'
     A                                 23  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
