     A*%%TS  SD  20020407  210755  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RH501D
     A* Beskrivelse . . : Kontoplan, spørring
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       280302 KOB  Nytt program
7.xx A*       040516 bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20020120  204414  KOB         REL-V5R1M0  5722-WDS
     A            B1VALG    R        B 10  2REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 5 8)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A            B1KONT    R        O 10  5REFFLD(RHKONT)
     A                                      EDTCDE(Z)
     A            B1SPES    R        O 10 11REFFLD(RHSPES)
     A                                      EDTCDE(Z)
7.xx A            B1AVDE    R        O 10 17REFFLD(RHAVDE)
     A                                      EDTCDE(Z)
7.xx A            B1TEXT    R        O 10 22REFFLD(RHTEXT)
7.xx A            B1SPRK    R        O 10 54REFFLD(RHSPRK)
7.xx A            B1MVAK    R        O 10 61REFFLD(RHMVAK)
7.xx A            B1MVAO    R        O 10 64REFFLD(RHMVAO)
7.xx A            B1MVAG    R        O 10 67REFFLD(RHMVAG)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020328  230036  KOB         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Spørring på kontoplan'
     A                                      COLOR(WHT)
7.xx A                                  2 38'RH501B2'
7.xx A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  5  5'Konto'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 11'Bærer'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 17'Avd'
7.xx A                                      COLOR(WHT)
7.xx A                                  5 21'Tekst'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  2'Velg og trykk Enter.'
     A                                      COLOR(BLU)
7.xx A                                  9  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  9  5'Konto'
7.xx A                                      COLOR(WHT)
7.xx A                                  9 11'Bærer'
7.xx A                                      COLOR(WHT)
7.xx A                                  9 18'Avd'
7.xx A                                      COLOR(WHT)
7.xx A                                  9 22'Tekst             '
7.xx A                                      COLOR(WHT)
7.xx A                                  9 52'Spkod'
7.xx A                                      COLOR(WHT)
7.xx A                                  9 61'M'
7.xx A                                      COLOR(WHT)
7.xx A                                  9 64'O'
7.xx A                                      COLOR(WHT)
7.xx A                                  9 67'Gyld.'
7.xx A                                      COLOR(WHT)
7.xx A*                                 8 59'kode overstyring '
7.xx A*                                     COLOR(WHT)
7.xx A**                                9  2'V  Konto Bærer Avd Tekst          -
7.xx A**                                                   Sperr. <----- MVA ---
7.xx A**                                    --->'
7.xx A**                                    COLOR(WHT)
7.xx A            B2KONT    R        B  6  5REFFLD(RHKONT)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RZ)
7.xx A            B2SPES    R        B  6 11REFFLD(RHSPES)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RZ)
7.xx A            B2AVDE    R        B  6 16REFFLD(RHAVDE)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RZ)
7.xx A            B2ALFA    R        B  6 21REFFLD(RHALFA)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A**                                9 51'kode   kode overstyring '
7.xx A**                                    COLOR(WHT)
7.xx A                                  8  9'8=Poster'
     A                                      COLOR(BLU)
7.xx A                                  8  2'5=Vis'
     A                                      COLOR(BLU)
     A          R B2CMD
     A*%%TS  SD  20020120  204414  KOB         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20020407  210321  KOB         REL-V5R1M0  5722-WDS
     A                                      CA02
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      OVERLAY
     A                                      PUTOVR
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Spørring på kontoplan'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Konto. . . . . . . . . . . :'
     A            C1KONT    R        O  5 31REFFLD(RHKONT)
     A                                      EDTCDE(Z)
     A            C1SPES    R        O  5 37REFFLD(RHSPES)
     A                                      EDTCDE(Z)
     A            C1AVDE    R        O  5 42REFFLD(RHAVDE)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A  94        C2NOTB         8A  O  6 31DSPATR(RI)
     A                                  7  2'Beskrivelse. . . . . . . . :'
     A            C1TEXT    R        O  7 31REFFLD(RHTEXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      DSPATR(UL)
     A            C1TXT2    R        O  8 31REFFLD(RHTXT2)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  9  2'Alfabetisk sortering . . . :'
     A            C1ALFA    R        O  9 31REFFLD(RHALFA)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 10  2'MVA-kode . . . . . . . . . :'
     A            C1MVAK    R        O 10 31REFFLD(RHMVAK)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            C1ETXT    R        O 10 33REFFLD(RAETXT)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 11  2'Overstyring. . . . . . . . :'
     A            C1MVAO    R        O 11 31REFFLD(RHMVAO)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A            C1MVAG    R        O 11 33REFFLD(RHMVAG)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 12  2'Budsjett-nøkkel. . . . . . :'
     A            C1BNØK    R        O 12 31REFFLD(RHBNØK)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A            C1MTXT    R        O 12 34REFFLD(RAMTXT)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 13  2'Valutakode . . . . . . . . :'
     A            C1VALK    R        O 13 31REFFLD(RHVALK)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A            C1PMNA    R        O 13 35REFFLD(RAPMNA)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 14  2'Mengdekode . . . . . . . . :'
     A            C1MNGD    R        O 14 31REFFLD(RHMNGD)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A            C1OTXT    R        O 14 34REFFLD(RAOTXT)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 15  2'Prosjektkode . . . . . . . :'
     A            C1PROJ    R        O 15 31REFFLD(RHPROJ)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                 16  2'Kostnadsbærerkode. . . . . :'
     A            C1BÆRK    R        O 16 31REFFLD(RHBÆRK)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 17  2'Avdelingskode. . . . . . . :'
     A            C1AVDK    R        O 17 31REFFLD(RHAVDK)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 18  2'Nøkkeltall-kode. . . . . . :'
     A            C1NØKK    R        O 18 31REFFLD(RHNØKK)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 19  2'Sperrekode . . . . . . . . :'
     A            C1SPRK    R        O 19 31REFFLD(RHSPRK)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 19 34'(J=Sperret for postering)'
     A                                 21  2'Sist endret dato . . . . . .'
     A            C1EDAT         6Y 0O 21 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22  2'Endret av. . . . . . . . . .'
     A            C1EUSR    R        O 22 31REFFLD(RÅEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F2=Notatark'
     A                                      COLOR(BLU)
     A                                 23 16'F3=Gå tilbake'
     A                                      COLOR(BLU)
