     A*%%TS  SD  20020331  010047  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RH610D
     A* Beskrivelse . . : Kontoplan, utskrift - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       280302 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20020331  010047  KOB         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA12
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av kontoplan'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  8 10'Utvalg:'
     A                                      COLOR(WHT)
     A                                  8 18'Konto fra. . . . . . .:'
     A            A2PKTF    R        B  8 42REFFLD(RHPKTF)
     A  32                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 32)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  8 48'til'
     A            A2PKTT    R        B  8 52REFFLD(RHPKTT)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  9 18'Kostnadsbærer. . . . .:'
     A            A2PBØF    R        B  9 42REFFLD(RHPBØF)
     A                                      DSPATR(PC)
     A  30                                  DSPATR(PR)
     A  33                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  9 48'til'
     A            A2PBØT    R        B  9 52REFFLD(RHPBØT)
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 10 18'Avdeling fra . . . . .:'
     A            A2PAVF    R        B 10 42REFFLD(RHPAVF)
     A                                      DSPATR(PC)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 10 48'til'
     A            A2PAVT    R        B 10 52REFFLD(RHPAVT)
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 12 10'Skal sperrede konti tas med. .:'
     A            A2PKSP    R        B 12 42REFFLD(RHPKSP)
     A                                      COLOR(YLW)
     A                                 12 46'J/N'
     A                                 13 10'Skal kontogruppe skrives . . .:'
     A            A2PKKS    R        B 13 42REFFLD(RHPKKS)
     A                                      COLOR(YLW)
     A                                 13 46'J/N'
     A                                 14 10'Skal kontoklasse skrives . . .:'
     A            A2PKGS    R        B 14 42REFFLD(RHPKGS)
     A                                      COLOR(YLW)
     A                                 14 46'J/N'
     A                                 15 10'Sortering. . . . . . . . . . .:'
     A            A2PSRT    R        B 15 42REFFLD(RHPSRT)
     A  30                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 15 45'(K=Konto, A=Avdeling)'
     A                                 16 45'(B=Kostnadsbærer)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
