     A*%%TS  SD  20020106  194649  KOB         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20020106  194649  KOB         REL-V5R1M0  5722-WDS
     A                                      CA01
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A                                      KEEP
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  1  2'System:'
     A                                      COLOR(WHT)
     A                                  1 10SYSNAME
     A                                      COLOR(WHT)
     A                                  1 36'AS Økonomi'
     A                                      COLOR(WHT)
     A                                  1 65'Dato:'
     A                                      COLOR(WHT)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  2  2'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 10USER
     A                                      COLOR(WHT)
     A                                  2 30'Utskrift av kostnadsbærerrapport'
     A                                      COLOR(WHT)
     A                                  2 65'KL..:'
     A                                      COLOR(WHT)
     A                                  2 72TIME
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  7  8'Dato .:'
     A            A2PKDA    R        B  7 16REFFLD(RHPKDA)
     A  33                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 33)
     A*                                     DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  7 26'Regnskapsår . . . .:'
     A            A2PRÅR    R        B  7 47REFFLD(RHPRÅR)
     A  34                                  ERRMSGID(RMH0160 *LIBL/QMFOKON 34)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  7 52'Periode'
     A            A2PPER    R        B  7 60REFFLD(RHPPER)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  8 26'Denne periode fra .:'
     A            A2PPEF    R        B  8 47REFFLD(RHPPEF)
     A  35                                  ERRMSGID(RMH0170 *LIBL/QMFOKON 35)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  8 50'til'
     A            A2PPET    R        B  8 54REFFLD(RHPPET)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 10  8'Utvalg:'
     A                                 10 16'Kostnadsbærer fra:'
     A            A2PBØF    R        B 10 35REFFLD(REBKOD)
     A  30                                  DSPATR(PR)
     A  40                                  DSPATR(PC)
     A  36                                  ERRMSGID(RMH0131 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 10 41'til'
     A            A2PBØT    R        B 10 45REFFLD(REBKOD)
     A  30                                  DSPATR(PR)
     A  41                                  DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 11  8'eller'
     A                                 11 16'K.bærergruppe fra:'
     A            A2PBÆF    R        B 11 35REFFLD(REAGRP)
     A  30                                  DSPATR(PR)
     A  42                                  DSPATR(PC)
     A  37                                  ERRMSGID(RMH0132 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 11 41'til'
     A            A2PBÆT    R        B 11 45REFFLD(REAGRP)
     A  30                                  DSPATR(PR)
     A  43                                  DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 13 16'Konto fra . . . .:'
     A            A2PKTF    R        B 13 35REFFLD(RHPKTF)
     A  32                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 32)
     A                                      CHECK(FE)
     A  44                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 13 41'til'
     A            A2PKTT    R        B 13 45REFFLD(RHPKTT)
     A                                      CHECK(FE)
     A  45                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 14 16'Avdeling fra. . .:'
     A            A2PAVF    R        B 14 35REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A  46                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 14 41'til'
     A            A2PAVT    R        B 14 45REFFLD(RHPAVT)
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A  47                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 16  8'Sammenligning . . . . . .:'
     A            A2PSML    R        B 16 35REFFLD(RHPSML)
     A                                      COLOR(YLW)
     A                                 16 37'(B=Budsjett, F=Fjorår, G=Gjennomsn-
     A                                      itt)'
     A                                 17  8'Type avvik. . . . . . . .:'
     A            A2PAVV    R        B 17 35REFFLD(RHPAVV)
     A                                      COLOR(YLW)
     A                                 17 37'(P=Prosent brukt/oppnådd, D=Differ-
     A                                      anse i kr)'
     A                                 19  8'Gruppesum . . . . . . . .:'
     A            A2PKGS    R        B 19 35REFFLD(RHPKGS)
     A                                      COLOR(YLW)
     A                                 19 38'J/N'
     A                                 20  8'Klassesum . . . . . . . .:'
     A            A2PKKS    R        B 20 35REFFLD(RHPKKS)
     A                                      COLOR(YLW)
     A                                 20 38'J/N'
     A*                                21  8'Kostnadsbærergruppe-sum .:'
     A*           A2PGRS    R        B 21 35REFFLD(RHPKKS)
     A*                                     COLOR(YLW)
     A*                                21 38'J/N'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
