     A*%%TS  SD  20070524  092030  KOBASP      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RH610D
     A* Beskrivelse . . : Saldobalanse, utskrift - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       280302 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20070524  092030  KOBASP      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av saldobalanse'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  7  8'Dato .:'
     A            A2PKDA    R        B  7 16REFFLD(RHPKDA)
     A  33                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 33)
     A                                      DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  7 26'Regnskapsår . . . .:'
     A            A2PRÅR    R        B  7 47REFFLD(RHPRÅR)
     A  34                                  ERRMSGID(RMH0160 *LIBL/QMFOKON 34)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  7 52'Periode'
     A            A2PPER    R        B  7 60REFFLD(RHPPER)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  8 26'Denne periode fra .:'
     A            A2PPEF    R        B  8 47REFFLD(RHPPEF)
     A  35                                  ERRMSGID(RMH0170 *LIBL/QMFOKON 35)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  8 50'til'
     A            A2PPET    R        B  8 54REFFLD(RHPPET)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  9  8'Utvalg:'
     A                                  9 16'Konto fra . . . .:'
     A            A2PKTF    R        B  9 35REFFLD(RHPKTF)
     A  32                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 32)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  9 41'til'
     A            A2PKTT    R        B  9 45REFFLD(RHPKTT)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 10 16'Kostnadsbærer fra:'
     A            A2PBØF    R        B 10 35REFFLD(RHPBØF)
     A  30                                  DSPATR(PR)
     A  33                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 10 41'til'
     A            A2PBØT    R        B 10 45REFFLD(RHPBØT)
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 11 16'Avdeling fra. . .:'
     A            A2PAVF    R        B 11 35REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 11 41'til'
     A            A2PAVT    R        B 11 45REFFLD(RHPAVT)
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 11 51'Avdeling 0000 med ?:'
     A            A2ANUL    R        B 11 72REFFLD(RHPNUL)
     A                                      COLOR(YLW)
     A                                      VALUES('J' 'N')
7.xx A                                 11 74'J,N'
     A                                 12 16'og/eller. . . . .:'
     A            A2PA01    R        B 12 35REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA02    R        B 12 40REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA03    R        B 12 45REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA04    R        B 12 50REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA05    R        B 12 55REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA06    R        B 12 60REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA07    R        B 12 65REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA08    R        B 12 70REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA09    R        B 13 35REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA10    R        B 13 40REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA11    R        B 13 45REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA12    R        B 13 50REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA13    R        B 13 55REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA14    R        B 13 60REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA15    R        B 13 65REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA16    R        B 13 70REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA17    R        B 14 35REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA18    R        B 14 40REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA19    R        B 14 45REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA20    R        B 14 50REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA21    R        B 14 55REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA22    R        B 14 60REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA23    R        B 14 65REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A            A2PA24    R        B 14 70REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 15  8'Sortering . . . . . . . .:'
     A            A2PSRT    R        B 15 35REFFLD(RHPSRT)
     A                                      COLOR(YLW)
     A                                 15 37'(K=Konto, A=Avdeling, B=Kostnadsbæ-
     A                                      rer)'
     A                                 16  8'Sammenligning . . . . . .:'
     A            A2PSML    R        B 16 35REFFLD(RHPSML)
     A                                      COLOR(YLW)
     A                                      VALUES('B' 'F' 'G' 'A')
     A                                 16 37'(B=Budsj., A=Alt.budsj., F=Fjor, G-
     A                                      =Gj.sn.)'
     A                                 17  8'Type avvik. . . . . . . .:'
     A            A2PAVV    R        B 17 35REFFLD(RHPAVV)
     A                                      COLOR(YLW)
     A                                 17 37'(P=Prosent brukt/oppnådd, D=Differ-
     A                                      anse i kr)'
     A                                 18  8'Gruppesum . . . . . . . .:'
     A            A2PKGS    R        B 18 35REFFLD(RHPKGS)
     A                                      COLOR(YLW)
7.xx A                                 18 38'J,N'
     A                                 19  8'Klassesum . . . . . . . .:'
     A            A2PKKS    R        B 19 35REFFLD(RHPKKS)
     A                                      COLOR(YLW)
7.xx A                                 19 38'J,N'
     A                                 20  8'Spesifikasjon av bærer. .:'
     A            A2PSPB    R        B 20 35REFFLD(RHPKKS)
     A                                      COLOR(YLW)
7.xx A                                 20 38'J,N'
     A                                 21  8'Spesifikasjon av avdeling:'
     A            A2PSPA    R        B 21 35REFFLD(RHPKKS)
     A                                      COLOR(YLW)
7.xx A                                 21 38'J,N'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R M1WIN
     A                                      WINDOW(&W_AROW &W_ACOL 10 54)
     A                                      CA03
     A            W_AROW         2S 0P
     A            W_ACOL         3S 0P
     A                                  2  2' Melding : '
     A                                      DSPATR(RI)
     A            M1MLD1    R        O  4  2REFFLD(RWMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            M1MLD2    R        O  5  2REFFLD(RWMELD)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  2'Svar ja for OK, nei for ikke OK. .-
     A                                       . .'
     A            M1SVAR    R        B  7 43REFFLD(RWSVAR)
     A                                      VALUES('J' 'N')
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      COLOR(YLW)
7.xx A                                  7 47'J,N'
     A                                  9  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
