     A*%%TS  SD  20020122  202443  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RH628D
     A* Beskrivelse . . : Hovedbok, utskrift notatblokk parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       200704 HFL  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20020122  202443  KOB         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA12
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av notatblokk hovedbok'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  7 11'Utvalg:'
     A                                      COLOR(WHT)
     A                                  7 35'Fra    -  Til'
     A                                  8 13'Konto . . . . . . .:'
     A            A2PKNF    R        B  8 34REFFLD(RHPKTF)
     A  32                                  DSPATR(PC)
     A  32                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 34)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Kontonummer fra . .')
     A                                      COLOR(YLW)
     A                                  8 42'-'
     A            A2PKNT    R        B  8 45REFFLD(RHPKTT)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Kontonummer til . .')
     A                                      COLOR(YLW)
     A                                  9 13'Avdeling. . . . . .:'
     A            A2PAVF    R        B  9 34REFFLD(RHPAVF)
     A  33                                  DSPATR(PC)
     A  33                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  9 42'-'
     A            A2PAVT    R        B  9 45REFFLD(RHPAVT)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 10 13'Kostnadsbærer . . .:'
     A            A2PBØF    R        B 10 34REFFLD(RHPBØF)
     A  34                                  DSPATR(PC)
     A  34                                  ERRMSGID(RMH0131 *LIBL/QMFOKON 34)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 10 42'-'
     A            A2PBØT    R        B 10 45REFFLD(RHPBØT)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 11 13'Prosjekt. . . . . .:'
     A            A2PPRF    R        B 11 34REFFLD(RPPROF)
     A  35                                  DSPATR(PC)
     A  35                                  ERRMSGID(RMP0130 *LIBL/QMFOKON 35)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 11 42'-'
     A            A2PPRT    R        B 11 45REFFLD(RPPROT)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 12 13'Aktivitet . . . . .:'
     A            A2PAKF    R        B 12 34REFFLD(RPAKTI)
     A  36                                  DSPATR(PC)
     A  36                                  ERRMSGID(RMP0140 *LIBL/QMFOKON 36)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Aktivitet fra . . .')
     A                                      COLOR(YLW)
     A                                 12 42'-'
     A            A2PAKT    R        B 12 45REFFLD(RPAKTI)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Aktivitet til . . .')
     A                                      COLOR(YLW)
     A*                                13 13'Eldre enn dato. . .:'
     A*           A2PEDA         6Y 0B 13 34
     A* 31                                  DSPATR(PC)
     A* 31                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 31)
     A*                                     CHECK(RB)
     A*                                     DSPATR(HI)
     A*                                     DSPATR(UL)
     A*                                     DSPATR(MDT)
     A*                                     TEXT('Eldre enn dato.')
     A*                                     COLOR(YLW)
     A*                                     EDTCDE(Z)
     A*                                14 13'Bare konti  m/notat:'
     A*           A2PNOT    R        B 14 34REFFLD(RKPALF)
     A* 37                                  DSPATR(PC)
     A* 37                                  ERRMSGID(RMH0290 *LIBL/QMFOKON 41)
     A*                                     CHECK(RB)
     A*                                     DSPATR(HI)
     A*                                     DSPATR(UL)
     A*                                     DSPATR(MDT)
     A*                                     COLOR(YLW)
     A*                                14 37'(J=Ja, Blank)'
     A*                                16 11'Alfabetisk. . . . .:'
     A*           A2PSRT    R        B 16 34REFFLD(RKPALF)
     A* 41                                  DSPATR(PC)
     A* 41                                  ERRMSGID(RMH0290 *LIBL/QMFOKON 41)
     A*                                     CHECK(RB)
     A*                                     DSPATR(HI)
     A*                                     DSPATR(UL)
     A*                                     DSPATR(MDT)
     A*                                     TEXT('Sortering . . . . .')
     A*                                     COLOR(YLW)
     A*                                16 37'(J=Ja, Blank)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
