     A*%%TS  SD  20021230  011246  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RH653D
     A* Beskrivelse . . : Hovedbok, utskrift stikkprøver - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       280302 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20021230  011246  KOB         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A                                      CA01
     A                                      CA03
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av hovedbok-poster'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6 10'Dato:'
     A            A2PKDA    R        B  6 16REFFLD(RHPKDA)
     A  33                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 33)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  6 27'Regnskapsår . . .:'
     A            A2PRÅR    R        B  6 46REFFLD(RHPRÅR)
     A  34                                  ERRMSGID(RMH0160 *LIBL/QMFOKON 34)
     A                                      COLOR(YLW)
     A                                  7 27'Periode . . . . .:'
     A            A2PPEF    R        B  7 46REFFLD(RHPPEF)
     A  35                                  ERRMSGID(RMH0170 *LIBL/QMFOKON 35)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  7 49'til'
     A            A2PPET    R        B  7 53REFFLD(RHPPET)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  9 10'Utvalg: Avdeling fra .:'
     A            A2PAVF    R        B  9 34REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  9 41'til'
     A            A2PAVT    R        B  9 46REFFLD(RHPAVT)
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 10 18'Konto fra. . .:'
     A            A2PKTF    R        B 10 34REFFLD(RHPKTF)
     A  32                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 32)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 10 41'til'
     A            A2PKTT    R        B 10 46REFFLD(RHPKTT)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 12 18'Poster over Kr.'
     A            A2PBEL    R        B 12 34REFFLD(RHPBEL)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 12 46'blir tatt med'
     A                                 14 10'Og....: Hvert bilag nr.'
     A            A2PRAN    R        B 14 34REFFLD(RHPRAN)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 14 46'uansett beløp'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
