     A*%%TS  SD  20030104  183520  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RH610D
     A* Beskrivelse . . : Saldobalanse, utskrift - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       280302 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20030104  183520  KOB         REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av tabellarisk saldobalan-
     A                                      se'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  7  8'Dato .:'
     A            A2PKDA    R        B  7 16REFFLD(RHPKDA)
     A  33                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 33)
     A                                      DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  7 26'Regnskapsår . . . .:'
     A            A2PRÅR    R        B  7 47REFFLD(RHPRÅR)
     A  34                                  ERRMSGID(RMH0160 *LIBL/QMFOKON 34)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  7 52'Periode'
     A            A2PPER    R        B  7 60REFFLD(RHPPER)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  8 26'Denne periode fra .:'
     A            A2PPEF    R        B  8 47REFFLD(RHPPEF)
     A  35                                  ERRMSGID(RMH0170 *LIBL/QMFOKON 35)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                  8 50'til'
     A            A2PPET    R        B  8 54REFFLD(RHPPET)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 10  8'Utvalg:'
     A                                 10 16'Konto fra . . . .:'
     A            A2PKTF    R        B 10 35REFFLD(RHPKTF)
     A  32                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 32)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 10 41'til'
     A            A2PKTT    R        B 10 45REFFLD(RHPKTT)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 11 16'Kostnadsbærer fra:'
     A            A2PBØF    R        B 11 35REFFLD(RHPBØF)
     A  30                                  DSPATR(PR)
     A  33                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 11 41'til'
     A            A2PBØT    R        B 11 45REFFLD(RHPBØT)
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 12 16'Avdeling fra. . .:'
     A            A2PAVF    R        B 12 35REFFLD(RHPAVF)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 12 41'til'
     A            A2PAVT    R        B 12 45REFFLD(RHPAVT)
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 14  8'Sortering . . . . . . . .:'
     A            A2PSRT    R        B 14 35REFFLD(RHPSRT)
     A                                      COLOR(YLW)
     A                                 14 37'(K=Konto, A=Avdeling)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
