     A*%%TS  SD  20020802  081849  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RH930D
     A* Beskrivelse . . : Hovedbok, sletting av poster - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       280302 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20020802  081849  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(&WACTLI &WACTPO 15 50)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  2  2' Sletting av posteringer   '
     A                                      DSPATR(RI)
     A                                  5  2'Regnskapsår . . .:'
     A            B1RAAR    R        B  5 21REFFLD(RFRFR/RNRAAR *LIBL/RFRF)
     A  31                                  ERRMSGID(RMH0050 *LIBL/QMFOKON 31)
     A  32                                  ERRMSGID(RMH0060 *LIBL/QMFOKON 32)
     A  33                                  ERRMSGID(RMH0440 *LIBL/QMFOKON 33)
     A                                      EDTCDE(Z)
     A                                  7  2'Rutinen sletter alle poster eldre -
     A                                      enn angitt'
     A                                      COLOR(RED)
     A                                  8  2'regnskapsår i hovedbok. Dvs. at po-
     A                                      ster med  '
     A                                      COLOR(RED)
     A                                  9  2'regnskapsår = angitt år  -1 slette-
     A                                      s. Dersom du'
     A                                      COLOR(RED)
     A                                 10  2'har angitt 1997, slettes alle post-
     A                                      er fram til og'
     A                                      COLOR(RED)
     A                                 11  2'med 1996 fra posteringsregisteret'
     A                                      COLOR(RED)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
