     A*%%TS  SD  20020407  162434  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RH400D
     A* Beskrivelse . . : Hovedbok. fjerning av MVA-merke
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       070402 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A2BLD
     A*%%TS  SD  20020407  162434  KOB         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA12
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Fjerner MVA-merke på hovedbokspost-
     A                                      er'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  8 10'Dato:'
     A            A2PKDA    R        B  8 16REFFLD(RHPKDA)
     A  33                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 33)
     A                                      COLOR(YLW)
     A                                  8 27'Regnskapsår . . .:'
     A            A2PRÅR    R        B  8 46REFFLD(RHPRÅR)
     A  34                                  ERRMSGID(RMH0160 *LIBL/QMFOKON 34)
     A                                      COLOR(YLW)
     A                                 10 27'MVA-periode . . .:'
     A            A2PMVA    R        B 10 46REFFLD(RHPMVA)
     A                                      COLOR(YLW)
     A                                 14  3'Fjerner merke for at posten har væ-
     A                                      rt med på MVA-oppgjør.'
     A                                      COLOR(RED)
     A                                 15  3'Før MVA-oppgjør kan kjøres på nytt-
     A                                       må journal for feilkjørt MVA-oppgj-
     A                                      ør'
     A                                      COLOR(RED)
     A                                 16  3'slettes og saldomatrisen for hoved-
     A                                      bok oppdateres på nytt.'
     A                                      COLOR(RED)
     A                                 23  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
