     A*%%TS  SD  20020130  145749  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RH970D
     A* Beskrivelse . . : Hovedbok. spørring mot member i RTRAPF
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       070402 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R B1SFL                     SFL
     A*%%TS  SD  19990607  085115  BOF         REL-V4R2M0  5769-PW1
     A            B1VALG    R        B  6  2REFFLD(RWVALG)
     A                                      COLOR(YLW)
     A                                      VALUES('1' ' ')
     A                                      CHKMSGID(RMA0010 *LIBL/QMFOKON)
     A            B1NAME        10A  O  6  4
     A            B1MTXT        30A  O  6 15
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020106  195445  KOB         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&WCURRN)
     A            WCURRN         5S 0H
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A                                  2  1'Velg og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  3  2'1=Velg'
     A                                      COLOR(BLU)
     A                                  5  2'V Member/Bruker  Beskrivelse      '
     A                                      COLOR(WHT)
     A                                  1 15'Kopier registreringsfiler'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20020106  195445  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 50)
     A                                 14  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 14 19'F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
