     A*%%TS  SD  20201103  085056  SST700      REL-V7R3M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RM400
     A* Beskrivelse . . : Økonomisystemet, hjelpemeny
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       270902 KOB  Nytt program
     A*
6.20 A*       301012 NHO  Uttrekk av poster til Visma
6.21 A*       211112 NHO  Uttrekk av poster til Zirius
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20201103  085056  SST700      REL-V7R3M0  5770-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Diverse hjelperutiner for ASP'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Hovedbok'
     A                                      COLOR(WHT)
     A                                  5 41'Leverandørreskontro'
     A                                      COLOR(WHT)
     A                                  6  2' 1. Slette journal'
     A                                  6 40'13. Oppdatere søketekst'
     A                                  7  3'2. Flytting av journal'
     A                                  7 40'14. Oppdatere søketekst alle firma'
     A                                  8  2' 3. Fjerne mva-merke'
     A                                  8 40'15. Saldere leverandører med 0 i s-
     A                                      aldo'
     A                                  9  2' 4. Fjerne spes.hovedbok-merke'
     A                                 11  2'Kundereskontro'
     A                                      COLOR(WHT)
     A                                 11 41'Kundereskontro fortsatt'
     A                                      COLOR(WHT)
     A                                 12  2' 5. Oppdatere rentedato'
     A                                 12 40'17. Reorganisere spesialavtale'
     A                                 13  2' 6. Slette siste purrekjøring'
     A                                 14  2' 7. Oppdatere søketekst'
     A                                 15 41'Test / Uttrekk av poster'
     A                                      COLOR(WHT)
     A                                 16 40'18. Visma/Mamut/UniMicro'
     A                                 17 40'19. Zirius'
     A                                 15  2' 8. Oppdatere søketekst alle firma'
     A                                 16  2' 9. Slette generalnota-merke'
     A                                 17  2'10. Oppdatere memosaldo'
     A                                 18  2'11. Oppdatere purredato'
     A                                 19  2'12. Saldere kunder med 0 i saldo'
     A                                 21 30'Valg:'
     A            VALG           2Y 0B 21 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 22  2'F1=Nytt firma'
     A                                      COLOR(BLU)
     A                                 22 17'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 22 32'F6=Se på meldinger'
     A                                      COLOR(BLU)
     A                                 22 52'F10=Kommando-linje'
     A                                      COLOR(BLU)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 20  2'16. Oppdatere rentedato/rentekode'
