     A*%%TS  SD  20050711  162138  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK400D
     A* Beskrivelse . . : Kunder, sletting
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       230702 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20050711  162138  KOB         REL-V5R2M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA12
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppdatering fra kundekategori'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  7 11'Utvalg:'
     A                                  8 13'Kundekategori fra-til:'
     A            A2KATF    R        B  8 36REFFLD(RAKKOD)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  8 41'-'
     A            A2KATT    R        B  8 43REFFLD(RAKKOD)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10 13'Kun ikke utfylte felt:'
     A            A2UTFY         1A  B 10 36
     A  32                                  DSPATR(PC)
     A  32                                  ERRMSGID(RM00010 *LIBL/QMFOKON 37)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      TEXT('Kun utfylt. . . . .')
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'J')
     A                                 10 40'(J=Ja)'
     A                                 13  3'Rutinen oppdaterer kunderegisteret-
     A                                       basert på informasjon som hentes f-
     A                                      ra '
     A                                      COLOR(RED)
     A                                 14  3'kundekategori. Dersom du angir J i-
     A                                       feltet for kun ikke utfylte felt, '
     A                                      COLOR(RED)
     A                                 15  3'oppdateres kun de felten som ikke -
     A                                      er utfylt fra før. Dersom dette fel-
     A                                      tet'
     A                                      COLOR(RED)
     A                                 16  3'ikke er utfylt oppdateres alle fel-
     A                                      t som er utfylt på tilsvarende kund-
     A                                      e-'
     A                                      COLOR(RED)
     A                                 17  3'kategori på alle kunder innenfor v-
     A                                      algte kundekategorier'
     A                                      COLOR(RED)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
