     A*%%TS  SD  19991113  195155  KOB         REL-V4R4M0  5769-PW1
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK402D
     A* Beskrivelse . . : Kunder, sletting av posteringer - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       230702 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19991113  195155  KOB         REL-V4R4M0  5769-PW1
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      WINDOW(*DFT 15 50)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Sletting av posteringer   '
     A                                      DSPATR(RI)
     A                                  4  2'Firma:'
     A            B1FIRM    R        O  4  9REFFLD(AFRFR/AAFFIR *LIBL/AFRF)
     A            B1NAVN    R        O  4 13REFFLD(AFRFR/AAFNAV *LIBL/AFRF)
     A                                  6  2'Regnskapsår . . .:'
     A            B1RAAR    R        B  6 21REFFLD(RFRFR/RNRAAR *LIBL/RFRF)
     A  31                                  ERRMSGID(RMH0050 *LIBL/QMFOKON 31)
     A  32                                  ERRMSGID(RMH0060 *LIBL/QMFOKON 32)
     A  33                                  ERRMSGID(RMH0440 *LIBL/QMFOKON 33)
     A                                  8  2'Rutinen sletter alle poster eldre -
     A                                      enn angitt'
     A                                      COLOR(RED)
     A                                  9  2'regnskapsår i kundereskontro. Dvs.-
     A                                       at poster'
     A                                      COLOR(RED)
     A                                 10  2'med regnskapsår = angitt år -1 sle-
     A                                      ttes. Dersom'
     A                                      COLOR(RED)
     A                                 11  2'du har angitt 1997, slettes alle p-
     A                                      oster fram til'
     A                                      COLOR(RED)
     A                                 12  2'og med 1996 fra posteringsregister-
     A                                      et'
     A                                      COLOR(RED)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
