     A*%%TS  SD  20070310  004901  KOB550      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK502D
     A* Beskrivelse . . : Kunder, spørring - subprogram
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       230702 KOB  Nytt program
     A* V5.40 250505 KOB  Lagt inn vedlikehold av besøkadresse
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R C2BLD
     A*%%TS  SD  20070310  004901  KOB550      REL-V5R4M0  5722-WDS
     A                                      CA02
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CA06
     A                                      CA07
     A                                      CA08
     A                                      CA09
     A                                      CF10
     A                                      CA11
     A                                      CA13
     A                                      CA24
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      PUTOVR
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Spørring på kunder'
     A                                      COLOR(WHT)
7.xx A                                  2 38'RK502C2'
7.xx A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Kundenr. :'
     A            C2KUND    R        O  4 13REFFLD(RKKUND)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  94        C2NOTB         8A  O  4 44DSPATR(RI)
     A                                  5  2'Navn.  . :'
     A            C2NAVN    R        O  5 13REFFLD(RKNAVN)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5 44'Alfa . . . :'
     A            C2ALFA    R        O  5 57REFFLD(RKALFA)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Adresse. :'
     A            C2GATE    R        O  6 13REFFLD(RKGATE)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6 44'Postnr.. . :'
     A            C2PONR    R        O  6 57REFFLD(RKPONR)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6 63'Utenl.:'
     A            C2UPNR    R        O  6 71REFFLD(RKUPNR)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Adresse2 :'
     A            C2ADR2    R        O  7 13REFFLD(RKADR2)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7 44'Land . . . :'
     A            C2LAND    R        O  7 57REFFLD(RKLAND)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2LTXT    R   20   O  7 60REFFLD(RALTXT)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Postadr. :'
     A            C2STED    R        O  8 13REFFLD(RKSTED)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                  8 44'Sperret. . :'
     A            C2SPRK    R        O  8 57REFFLD(RKSPRK)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8 60'Passiv.:'
     A            C2PASS    R        O  8 69REFFLD(RKPASS)
     A                                  9  2'Telefon  :'
     A            C2TLFN    R        O  9 13REFFLD(RKTLFN)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9 26'Mobil'
     A            C2MOBN    R        O  9 32REFFLD(RKMOBN)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A*                                 9  2'Kont.pers:'
     A*           C2PERS    R        O  9 13REFFLD(RKPERS)
     A*                                     DSPATR(UL)
     A*                                     OVRDTA
     A                                  9 44'Renteberegn:'
     A            C2RENK    R        O  9 57REFFLD(RKRENK)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Bankgiro :'
     A            C2BGIR    R        O 10 13REFFLD(RKBGIR)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('0           ')
     A                                 10 26'Fax.:'
     A            C2TLFX    R        O 10 32REFFLD(RKTLFX)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10 44'Avgiftsfri :'
     A            C2MKOD    R        O 10 57REFFLD(RKMKOD)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 11  2'Foretaksnr'
     A            C2FTNR    R        O 11 13REFFLD(RKFTNR)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 11 26'P.nr:'
     A                                 11 44'Kred.sperre:'
     A            C2KRES    R        O 11 57REFFLD(RKKRES)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Betal.bet:'
     A            C2BETB    R        O 12 13REFFLD(RKBETB)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2CTXT    R        O 12 16REFFLD(RACTXT)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12 44'Kred.grense:'
     A            C2GRNS    R        O 12 57REFFLD(RKGRNS)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12 64'Låst:'
     A            C2KGRK    R        O 12 70REFFLD(RKKGRK)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13  2'Valuta . :'
     A            C2VALK    R        O 13 13REFFLD(RKVALK)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2PMNA    R        O 13 17REFFLD(RAPMNA)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13 44'Ordrerabatt:'
     A            C2ORAB    R        O 13 57REFFLD(RKORAB)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTCDE(1)
     A                                 14  2'Avdeling :'
     A            C2AVDE    R        O 14 13REFFLD(RKAVDE)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
6.20 A            C2GTXT    R   20   O 14 18REFFLD(RAGTXT)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14 44'Spesialavt.:'
     A            C2SPAV    R        O 14 57REFFLD(RKSPAV)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 15  2'Rabattkat:'
     A            C2RABK    R        O 15 13REFFLD(RKRABK)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2FTXT    R        O 15 17REFFLD(RAFTXT)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 15 44'Selger . . :'
     A            C2SLGR    R        O 15 57REFFLD(RKSLGR)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2ITXT    R   18   O 15 62REFFLD(RAITXT)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 16  2'Bet. måte:'
     A            C2BETM    R        O 16 13REFFLD(RKBETM)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2BTXT    R        O 16 15REFFLD(RABTXT)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 16 44'Lager. . . :'
     A            C2LAGR    R        O 16 57REFFLD(RKLAGR)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2JTXT    R   20   O 16 60REFFLD(RAJTXT)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 17  2'Kundekat.:'
     A            C2KATG    R        O 17 13REFFLD(RKKATG)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KTXT    R        O 17 18REFFLD(RAKTXT)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 17 44'Spes.fakt. :'
     A            C2SPFA    R        O 17 57REFFLD(RKSPFA)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 17 60'Lønn'
     A            C2SPL1    R        O 17 65REFFLD(RKSPL1)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2SPL2    R        O 17 67REFFLD(RKSPL2)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2SPL3    R        O 17 69REFFLD(RKSPL3)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2SPL4    R        O 17 71REFFLD(RKSPL4)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2SPL5    R        O 17 73REFFLD(RKSPL5)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 18  2'Distrikt :'
     A            C2DIST    R        O 18 13REFFLD(RKDIST)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2HTXT    R        O 18 18REFFLD(RAHTXT)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 18 44'Påslagstab.:'
     A            C2PTAB    R        O 18 57REFFLD(RKPTAB)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2PTA2    R        O 18 62REFFLD(RKPTA2)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 19 44'Frie koder'
     A            C2FRIE    R        O 19 55REFFLD(RKFRIE)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 20  2'E-mail . :'
     A            C2EMAL    R        O 20 13REFFLD(RKEMAL)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 21  2'Sist endret dato:'
     A            C2EDAT         6Y 0O 21 20EDTWRD('  .  .  ')
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 21 44'Endret av. :'
     A            C2ESIG    R        O 21 57REFFLD(RKESIG)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A*
     A*  Bilde B2 - funksjonstaster
     A*
     A          R B2CMD
     A*%%TS  SD  20050525  143549  KOB         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                 22  2'F2=Notatark  F3=Gå tilbake  F5=Pos-
     A                                      ter  F6=Flere koder  F7=Fakt.k/EDI'
     A                                      COLOR(BLU)
     A                                 23  2'F8=Autogiro  F9=Forsendelse  F10=K-
     A                                      ontaktperson  F11=Besøkadresse  F13-
     A                                      =Kort'
     A                                      COLOR(BLU)
     A*
     A          R E2WIN
     A*%%TS  SD  20050525  143549  KOB         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 17 50)
     A                                      PUTOVR
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Besøkadresse '
     A                                      DSPATR(RI)
     A                                  4  2'Kundenr.. . . .'
     A            E2KUND    R        O  4 18REFFLD(RKKUND)
     A                                  5  2'Navn. . . . . .'
     A            E2NAVN    R        O  5 18REFFLD(RKNAVN)
     A                                  6  2'Adresse . . . .'
     A            E2BGAT    R        O  6 18REFFLD(RKBGAT)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  7  2'Adresse 2 . . .'
     A            E2BADR    R        O  7 18REFFLD(RKBADR)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  8  2'Poststed. . . .'
     A            E2BPNR    R        O  8 18REFFLD(RKBPNR)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A            E2BSTE    R   25   O  8 23REFFLD(RKSTED)
     A                                      TEXT('Poststed')
     A                                 10  2'Web . .:'
     A            E2WEBA    R        O 10 11REFFLD(RKWEBA)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 12  2'Mobiloperatør .'
     A            E2MOBO    R        O 12 18REFFLD(RKMOBO)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A            E2MTXT    R        O 12 21REFFLD(RECTXT)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 16  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R F2WIN
     A*%%TS  SD  20070131  225929  KOB         REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 17 65)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2 19'Koder Nexstep Handel'
     A                                      COLOR(WHT)
     A                                  4  2'Fakturagebyr . . . .:'
     A            F2FAGB    R        O  4 24REFFLD(RKFAGB)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  4 38'Fraktgebyr . . . . .:'
     A            F2FRGB    R        O  4 60REFFLD(RKFRGB)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  5  2'Ekspedisjonsgebyr. .:'
     A            F2EKGB    R        O  5 24REFFLD(RKEKGB)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  5 38'Ordrebekreftelse . .:'
     A            F2ORDB    R        O  5 60REFFLD(RKORDB)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  6  2'Pris/Pakkseddel. . .:'
     A            F2PRPA    R        O  6 24REFFLD(RKPRPA)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  6 38'Samlefaktura . . . .:'
     A            F2SAMF    R        O  6 60REFFLD(RKSAMF)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  7  2'Fakturasekvens . . .:'
     A            F2SEKV    R        O  7 24REFFLD(RKSEKV)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  7 38'Krav til rekvisisjon:'
     A            F2REKV    R        O  7 60REFFLD(RKREKV)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  8  2'Fakturagrense. . . .:'
     A            F2FAGR    R        O  8 24REFFLD(RKFAGR)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  8 38'Antall fakturakopier:'
     A            F2FCOP    R        O  8 60REFFLD(RKFCOP)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  9  2'Rabattsperre . . . .:'
     A            F2RASP    R        O  9 24REFFLD(RKRASP)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  9 38'E-handelskunde. . . :'
     A            F2EBIZ    R        O  9 60REFFLD(RKEBIZ)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                 10  2'Pris på faktura. . .:'
     A            F2NETO    R        O 10 24REFFLD(RKNETO)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                 10 38'Leveringstype . . . :'
     A            F2LETY    R        O 10 60REFFLD(RKLETY)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 11  2'Fakt. e/prisbokenhet:'
     A            F2PBOK    R        B 11 24REFFLD(RKPBOK)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Frie statistikk-kode:'
     A            F2FRSK    R        O 12 24REFFLD(RKFRSK)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 14  2'Opprettet dato . . .:'
     A            F2NDAT         6Y 0O 14 24EDTWRD('  .  .  ')
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 13  2'Opprettet av . . . .:'
     A            F2NSIG    R        B 13 24REFFLD(RKNSIG)
     A                                 16  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R G2WIN
     A*%%TS  SD  20010107  234600  KOB         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 15 65)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  4  2'EDI-Kode ...........:'
     A            G2EDIK    R        O  4 24REFFLD(RKEDIK)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'EAN-Kunde ..........:'
     A            G2EANK    R        O  5 24REFFLD(RKEANK)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Fakturakunde .......:'
     A            G2FAKU    R        O  7 24REFFLD(RKFAKU)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
6.NU A            G2NAVN    R        O  7 33REFFLD(RKNAVN)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'EAN-fakt.kunde .....:'
     A            G2EANF    R        O  8 24REFFLD(RKEANF)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Konsern kundenr. ...:'
     A            G2KOKU    R        O  9 24REFFLD(RKKOKU)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A            G2KONA    R        O  9 31REFFLD(RKNAVN)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Factoring-nummer ...:'
     A            G2FACN    R        O 10 24REFFLD(RKFACN)
     A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 12  2'Fakturatype ...:'
7.xx A            G2FATY    R        O 12 24REFFLD(RKFATY)
7.xx A                                      DSPATR(UL)
7.xx A                                      COLOR(YLW)
7.xx A                                      OVRDTA
7.xx A            G2TBES        20A  O 12 27
7.xx A                                      COLOR(YLW)
7.xx A                                      DSPATR(UL)
7.xx A                                      OVRDTA
7.xx A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R H2WIN
     A*%%TS  SD  20050526  100838  KOB         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 15 65)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2 19'Autogiro'
     A                                      COLOR(WHT)
     A                                  4  2'Gyldig fra-dato ....:'
     A            H2AFDA         6Y 0O  4 24DSPATR(UL)
     A                                      OVRDTA
     A                                      EDTWRD('  .  .  ')
     A                                  5  2'Gyldig til-dato. . .:'
     A            H2ATDA         6Y 0O  5 24DSPATR(UL)
     A                                      OVRDTA
     A                                      EDTWRD('  .  .  ')
     A                                  6  2'Fullm. sendt . . . .:'
     A            H2SENT    R        O  6 24REFFLD(RKSENT)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R I2WIN
     A*%%TS  SD  20011230  233032  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 65)
     A                                      CA03
     A                                      CF04
     A                                      PUTOVR
     A                                  4  2'Forsendelsesmåte:'
     A            I2FORM    R        O  4 20REFFLD(RKFORM)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A            I2QTXT    R        O  4 23REFFLD(RAQTXT)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  5  2'Speditørnr......:'
     A            I2SPED    R        O  5 20REFFLD(RKSPED)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A            I2VTXT    R   -1   O  5 24REFFLD(RAVTXT)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  6  2'Leveringsbet....:'
     A            I2LBET    R        O  6 20REFFLD(RKLBET)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A            I2RTX1    R        O  6 23REFFLD(RARTX1)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  7  2'Lev.adresse.....:'
     A            I2LADR    R        O  7 20REFFLD(RKLADR)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  8  2'Kjørerute ......:'
     A            I2KJOR    R        O  8 20REFFLD(RKKJØR)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A            I2YTXT    R        O  8 23REFFLD(RAYTXT)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                  9  2'Rekkefølge rute.:'
     A            I2KJNR    R        O  9 20REFFLD(RKKJNR)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R J2WIN
     A*%%TS  SD  20050425  001359  KOB         REL-V5R2M0  5722-WDS
     A                                      WINDOW(&W_ALIN &W_ACOL 15 52)
     A                                      CA03
     A                                      CF04
     A                                      PUTOVR
     A                                      HELP
     A            W_ALIN         2S 0P
     A            W_ACOL         3S 0P
     A                                  4  2'Spesialavtale:'
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            J2SAT1    R        B  4 17REFFLD(RKSAT1)
     A            J2SAT2    R        B  5 17REFFLD(RKSAT2)
     A            J2SAT3    R        B  6 17REFFLD(RKSAT3)
