     A*%%TS  SD  20040219  080842  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK618D
     A* Beskrivelse . . : Kunder, utskrift av BANKGIRO
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       240702 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20040219  080842  KOB         REL-V5R2M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av bankgiroblanketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  4'Beløpet gjelder:'
     A                                      COLOR(WHT)
     A                                  5 47'Betalingsfrist:'
     A                                      COLOR(WHT)
     A            A2FDAT         6D 0B  5 63DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      DSPATR(PC)
     A            A2TXT1        40A  B  6  4CHECK(LC)
     A                                      DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2TXT2        40A  B  7  4CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2TXT3        40A  B  8  4CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2TXT4        40A  B  9  4CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2TXT5        40A  B 10  4CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2TXT6        40A  B 11  4CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12  4'Betalt av:'
     A                                      COLOR(WHT)
     A                                 12 47'Betalt til:'
     A                                      COLOR(WHT)
     A            A2BNAV        30A  B 13  4CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2MNAV        30A  B 13 47CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2BGAT        30A  B 14  4CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2MGAT        30A  B 14 47CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2BADR        30A  B 15  4CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2MADR        30A  B 15 47CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2BSTE        30A  B 16  4CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2MSTE        30A  B 16 47CHECK(LC)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 18  4'KID-Felt:'
     A                                      COLOR(WHT)
     A                                 18 29'Beløp'
     A                                      COLOR(WHT)
     A                                 18 47'Til konto       '
     A                                      COLOR(WHT)
     A            A2KKID        20M  B 19  4CHECK(RB)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            A2BELP        11Y 2B 19 26CHECK(RZ)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            A2MBGI        13A  B 19 47DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 21  4'Antall blanketter:'
     A                                      COLOR(WHT)
     A            A2ANTA         3D 0B 21 23DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 23  4'F3 = Gå tilbake'
     A                                      COLOR(BLU)
