     A*%%TS  SD  20081030  130235  KOBASP      REL-V5R4M0  5722-WDS
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK622D
     A* Beskrivelse . . : Kundeetiketter, utskrift - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       240702 KOB  Nytt program
7.xx A* 7.xx  180516 bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20060511  100415  KOB         REL-V5R3M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A  98                                  PUTOVR
     A                                      RTNCSRLOC(&W_ACRD &W_AFLD)
     A            W_ACRD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av kundeetiketter'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  6 11'Utvalg:'
7.xx A                                  6 35'Fra    -    Til'
7.xx A                                  7 13'Kunder. . . . . . .+'
     A            A2PKNF    R        B  7 34REFFLD(RKPKNR)
     A  57                                  DSPATR(PC)
     A  32                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 34)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Kundenummer fra . .')
     A                                      COLOR(YLW)
     A                                  7 42'-'
7.xx A                                  7 45'+'
7.xx A            A2PKNT    R        B  7 47REFFLD(RKPKNR)
     A  58                                  DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Kundenummer til . .')
     A                                      COLOR(YLW)
7.xx A                                  8 13'Avdeling. . . . . .+'
     A            A2PAVF    R        B  8 34REFFLD(RKPAVF)
     A  51                                  DSPATR(PC)
     A  33                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  8 42'-'
7.xx A                                  8 45'+'
7.xx A            A2PAVT    R        B  8 47REFFLD(RKPAVT)
     A  52                                  DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                  9 13'Kundekategori . . .+'
     A            A2PKAF    R        B  9 34REFFLD(RKPKAF)
     A  53                                  DSPATR(PC)
     A  34                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 34)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  9 42'-'
7.xx A                                  9 45'+'
7.xx A            A2PKAT    R        B  9 47REFFLD(RKPKAT)
     A  54                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 10 13'Selger. . . . . . .+'
     A            A2PSEF    R        B 10 34REFFLD(RKPSEF)
     A  55                                  DSPATR(PC)
     A  35                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 35)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 10 42'-'
7.xx A                                 10 45'+'
7.xx A            A2PSET    R        B 10 47REFFLD(RKPSET)
     A  56                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 11 13'Distrikt. . . . . .+'
     A            A2PDIF    R        B 11 34REFFLD(RKPDIF)
     A  59                                  DSPATR(PC)
     A  36                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 36)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Distrikt fra. . . .')
     A                                      COLOR(YLW)
     A                                 11 42'-'
7.xx A                                 11 45'+'
7.xx A            A2PDIT    R        B 11 47REFFLD(RKPDIT)
     A  60                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Distrikt til. . . .')
     A                                      COLOR(YLW)
7.xx A                                 12 13'Lager . . . . . . .+'
     A            A2PLAF    R        B 12 34REFFLD(RKPLAF)
     A  61                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 12 42'-'
7.xx A                                 12 45'+'
7.xx A            A2PLAT    R        B 12 47REFFLD(RKPLAT)
     A  62                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 14  3'Inntil 21 enkelt- +'
7.xx A            A2PKN1    R        B 14 23REFFLD(RKPKNR)
     A  47 11                               DSPATR(PC)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A  47 11                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
7.xx A                                 14 30'+'
     A            A2PKN2    R        B 14 32REFFLD(RKPKNR)
     A  47 12                               DSPATR(PC)
     A  47 12                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 14 39'+'
7.xx A            A2PKN3    R        B 14 41REFFLD(RKPKNR)
     A  47 13                               DSPATR(PC)
     A  47 13                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 14 48'+'
7.xx A            A2PKN4    R        B 14 50REFFLD(RKPKNR)
     A  47 14                               DSPATR(PC)
     A  47 14                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 14 57'+'
7.xx A            A2PKN5    R        B 14 59REFFLD(RKPKNR)
     A  47 15                               DSPATR(PC)
     A  47 15                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 14 66'+'
7.xx A            A2PKN6    R        B 14 68REFFLD(RKPKNR)
     A  47 16                               DSPATR(PC)
     A  47 16                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15 13'kunder. +'
7.xx A            A2PKN7    R        B 15 23REFFLD(RKPKNR)
     A  47 17                               DSPATR(PC)
     A  47 17                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15 30'+'
7.xx A            A2PKN8    R        B 15 32REFFLD(RKPKNR)
     A  47 18                               DSPATR(PC)
     A  47 18                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15 39'+'
     A            A2PKN9    R        B 15 41REFFLD(RKPKNR)
     A  47 19                               DSPATR(PC)
     A  47 19                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15 48'+'
7.xx A            A2PK10    R        B 15 50REFFLD(RKPKNR)
     A  47 20                               DSPATR(PC)
     A  47 20                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15 57'+'
7.xx A            A2PK11    R        B 15 59REFFLD(RKPKNR)
     A  47 21                               DSPATR(PC)
     A  47 21                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15 66'+'
7.xx A            A2PK12    R        B 15 68REFFLD(RKPKNR)
     A  47 22                               DSPATR(PC)
     A  47 22                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 21'+'
7.xx A            A2PK13    R        B 16 23REFFLD(RKPKNR)
     A  47 23                               DSPATR(PC)
     A  47 23                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 30'+'
7.xx A            A2PK14    R        B 16 32REFFLD(RKPKNR)
     A  47 24                               DSPATR(PC)
     A  47 24                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 39'+'
7.xx A            A2PK15    R        B 16 41REFFLD(RKPKNR)
     A  47 25                               DSPATR(PC)
     A  47 25                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 48'+'
7.xx A            A2PK16    R        B 16 50REFFLD(RKPKNR)
     A  47 26                               DSPATR(PC)
     A  47 26                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 57'+'
7.xx A            A2PK17    R        B 16 59REFFLD(RKPKNR)
     A  47 27                               DSPATR(PC)
     A  47 27                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 66'+'
     A            A2PK18    R        B 16 68REFFLD(RKPKNR)
     A  47 28                               DSPATR(PC)
     A  47 28                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 21'+'
7.xx A            A2PK19    R        B 17 23REFFLD(RKPKNR)
     A  47 29                               DSPATR(PC)
     A  47 29                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 30'+'
7.xx A            A2PK20    R        B 17 32REFFLD(RKPKNR)
     A  47 70                               DSPATR(PC)
     A  47 70                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 39'+'
7.xx A            A2PK21    R        B 17 41REFFLD(RKPKNR)
     A  47 71                               DSPATR(PC)
     A  47 71                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 18 11'Skriv kontaktperson (laser):'
     A            A2KPER    R        B 18 40REFFLD(RKPALF)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Kontaktperson . . .')
     A                                      COLOR(YLW)
     A                                 18 44'(J=Ja, Blank)'
     A                                 19 11'Ta med passive kunder:'
     A            A2PASS    R        B 19 34REFFLD(RKPALF)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Passive . . . . . .')
     A                                      COLOR(YLW)
     A                                 19 38'(J=Ja, Blank)'
     A                                 20 11'Type etiketter. . . .:'
     A            A2PETI    R        B 20 34REFFLD(RKPETI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      VALUES(1 3 4)
     A                                 20 38'(1=Enkel, 3=3 x 1, 4=Laser 3 x 7)'
     A                                 21 11'Alfabetisk. . . . .:'
     A            A2PSRT    R        B 21 34REFFLD(RKPALF)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      TEXT('Sortering . . . . .')
     A                                      COLOR(YLW)
     A                                 21 38'(J=Ja, Blank)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F4=Spørring'
     A                                      COLOR(BLU)
