     A*%%TS  SD  20040219  110325  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK647D
     A* Beskrivelse . . : Kunder, utskrift kundefordringer - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       240702 KOB  Nytt program
7.xx A*       060516 bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20040219  110325  KOB         REL-V5R2M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A  98                                  PUTOVR
     A                                      RTNCSRLOC(&W_ACRD &W_AFLD)
     A            W_ACRD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av kundefordringer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  7 11'Dato .:'
     A            A2PKDA    R        B  7 19REFFLD(RKPKDA)
     A  31                                  DSPATR(PC)
     A  31                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  8 11'Utvalg:'
     A                                      COLOR(WHT)
7.xx A                                  8 35'Fra    -   Til'
     A                                  9 13'Periode . . . . . .:'
     A            A2PPEF    R        B  9 34REFFLD(RKPPER)
     A  37                                  DSPATR(PC)
     A  37                                  ERRMSGID(RML0560 *LIBL/QMFOKON 37)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A            A2PÅRF    R        B  9 37REFFLD(RKPRÅR)
     A  32                                  DSPATR(PC)
     A  32                                  ERRMSGID(RMH0160 *LIBL/QMFOKON 32)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  9 42'-'
7.xx A            A2PPET    R        B  9 46REFFLD(RKPPER)
     A  45                                  DSPATR(PC)
     A  45 38                               ERRMSGID(RML0560 *LIBL/QMFOKON 38)
     A  45 39                               ERRMSGID(RMH0070 *LIBL/QMFOKON 39)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A            A2PÅRT    R        B  9 49REFFLD(RKPRÅR)
     A  32                                  DSPATR(PC)
     A  32                                  ERRMSGID(RMH0160 *LIBL/QMFOKON 32)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 10 13'Avdeling. . . . . .+'
     A            A2PAVF    R        B 10 34REFFLD(RKPAVF)
     A  51                                  DSPATR(PC)
     A  33                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 10 42'-'
7.xx A                                 10 44'+'
7.xx A            A2PAVT    R        B 10 46REFFLD(RKPAVT)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A  52                                  DSPATR(PC)
7.xx A                                 11 13'Kundekategori . . .+'
     A            A2PKAF    R        B 11 34REFFLD(RKPKAF)
     A  53                                  DSPATR(PC)
     A  34                                  ERRMSGID(RMH0350 *LIBL/QMFOKON 34)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 11 42'-'
7.xx A                                 11 44'+'
7.xx A            A2PKAT    R        B 11 46REFFLD(RKPKAT)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A  54                                  DSPATR(PC)
7.xx A                                 12 13'Selger. . . . . . .+'
     A            A2PSEF    R        B 12 34REFFLD(RKPSEF)
     A  55                                  DSPATR(PC)
     A  48                                  ERRMSGID(RMH0370 *LIBL/QMFOKON 35)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 12 42'-'
7.xx A                                 12 44'+'
7.xx A            A2PSET    R        B 12 46REFFLD(RKPSET)
     A  56                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 13 13'Kundenr.. . . . . .+'
     A            A2PKNF    R        B 13 34REFFLD(RKPKNR)
     A  57                                  DSPATR(PC)
     A  40                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 40)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 13 42'-'
7.xx A                                 13 44'+'
7.xx A            A2PKNT    R        B 13 46REFFLD(RKPKNR)
     A  58                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 14 13'Inntil 10 enkelt- .+'
     A            A2PKN1    R        B 14 34REFFLD(RKPKNR)
     A  47 11                               DSPATR(PC)
     A  47 11                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 14 41'+'
7.xx A            A2PKN2    R        B 14 43REFFLD(RKPKNR)
     A  47 12                               DSPATR(PC)
     A  47 12                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 14 50'+'
     A            A2PKN3    R        B 14 52REFFLD(RKPKNR)
     A  47 13                               DSPATR(PC)
     A  47 13                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 14 59'+'
7.xx A            A2PKN4    R        B 14 61REFFLD(RKPKNR)
     A  47 14                               DSPATR(PC)
     A  47 14                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 14 68'+'
7.xx A            A2PKN5    R        B 14 70REFFLD(RKPKNR)
     A  47 15                               DSPATR(PC)
     A  47 15                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15 23'kunder. .+'
     A            A2PKN6    R        B 15 34REFFLD(RKPKNR)
     A  47 16                               DSPATR(PC)
     A  47 16                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15 41'+'
7.xx A            A2PKN7    R        B 15 43REFFLD(RKPKNR)
     A  47 17                               DSPATR(PC)
     A  47 17                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15 50'+'
     A            A2PKN8    R        B 15 52REFFLD(RKPKNR)
     A  47 18                               DSPATR(PC)
     A  47 18                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15 59'+'
7.xx A            A2PKN9    R        B 15 61REFFLD(RKPKNR)
     A  47 19                               DSPATR(PC)
     A  47 19                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15 68'+'
7.xx A            A2PKN0    R        B 15 70REFFLD(RKPKNR)
     A  47 20                               DSPATR(PC)
     A  47 20                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 17 11'Sortering:'
     A                                      COLOR(WHT)
     A                                 17 41'(Kun ett begrep)'
     A                                 18 13'Kategori. . . . . .:'
     A            A2PKTG    R        B 18 34REFFLD(RKPKTG)
     A  46                                  DSPATR(PC)
     A  46 35                               ERRMSGID(RMH0090 *LIBL/QMFOKON 46)
     A  46 43                               ERRMSGID(RMH0360 *LIBL/QMFOKON 46)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 18 41'(J=Ja, Blank)'
     A                                 19 13'Avdeling. . . . . .:'
     A            A2PAVD    R        B 19 34REFFLD(RKPAVD)
     A  36                                  DSPATR(PC)
     A  36                                  ERRMSGID(RMH0090 *LIBL/QMFOKON 36)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 19 41'(J=Ja, Blank)'
     A                                 20 13'Selger. . . . . . .:'
     A            A2PSLG    R        B 20 34REFFLD(RKPSLG)
     A  48                                  DSPATR(PC)
     A  48                                  ERRMSGID(RMH0090 *LIBL/QMFOKON 48)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 20 41'(J=Ja, Blank)'
     A                                 21 13'Alfabetisk. . . . .:'
     A            A2PALF    R        B 21 34REFFLD(RKPALF)
     A  41                                  DSPATR(PC)
     A  41                                  ERRMSGID(RMH0290 *LIBL/QMFOKON 41)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 21 41'(J=Ja, Blank)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F4=Spørring'
     A                                      COLOR(BLU)
