     A*%%TS  SD  20040219  110835  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK650D
     A* Beskrivelse . . : Kunder, betalingsvarsel - paramter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       150902 KOB  Nytt program
7.xx A*       060516 bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A2BLD
     A*%%TS  SD  20040219  110835  KOB         REL-V5R2M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A  98                                  PUTOVR
     A                                      RTNCSRLOC(&W_ACRD &W_AFLD)
     A            W_ACRD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Betalingsvarsel - forslag'
     A                                      COLOR(WHT)
7.xx A                                  2 38'RK650A2'
7.xx A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  8'Kjøredato. . . . . . . .:'
     A            A2PKDA    R        B  5 34REFFLD(RKPKDA)
     A  31                                  DSPATR(PC)
     A  31                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                  6  8'Bilag purret etter . . .:'
     A            A2PFDA         6Y 0B  6 34TEXT('Purre/Inkasso-dato')
     A  33                                  DSPATR(PC)
     A  33                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                  6 44'blir ikke tatt med'
     A                                  7  8'Løpedager etter forfall.:'
     A            A25LDG    R        B  7 34REFFLD(RA5LDG)
     A  34                                  DSPATR(PC)
     A  34                                  ERRMSGID(RMA0770 *LIBL/QMFOKON 34)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  8  8'Bare forfalte poster?. .:'
     A            A2PFOR         1A  B  8 34TEXT('Bare forfalte poster')
     A  50                                  DSPATR(PC)
     A  50                                  ERRMSGID(RMA0010 *LIBL/QMFOKON 36)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  8 37'(J=Ja, A=Alle åpne når en post er -
     A                                      forfalt)'
     A                                  9  8'Bilag med purrenr. . . .:'
     A            A2PBEH         1A  B  9 34
     A  41                                  DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                      VALUES('<' '>' '=')
     A  41                                  ERRMSGID(RMA0640 *LIBL/QMFOKON 41)
     A            A2PPNR    R        B  9 37REFFLD(RKPPNR)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  9 42'(<,>,=)'
     A                                  9 51'(= 0 Tar med alle poster)'
     A                                 10 51'(> 0 Tar med purrekode 1,2..)'
     A                                 11  2'Utvalg:'
     A                                      COLOR(WHT)
     A                                 11 51'(> 1 Tar med purrekode 2,3..)'
7.xx A                                 12  8'Avdeling . . . . . . . .+'
     A            A2PAVF    R        B 12 34REFFLD(RKPAVF)
     A  51                                  DSPATR(PC)
     A  43                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 43)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 12 39'-'
7.xx A                                 12 41'+'
7.xx A            A2PAVT    R        B 12 43REFFLD(RKPAVT)
     A  52                                  DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 13  8'Kundekategori  . . . . .+'
     A            A2PKAF    R        B 13 34REFFLD(RKPKAF)
     A  53                                  DSPATR(PC)
     A  42                                  ERRMSGID(RMH0350 *LIBL/QMFOKON 42)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 13 39'-'
7.xx A                                 13 41'-'
7.xx A            A2PKAT    R        B 13 43REFFLD(RKPKAT)
     A  54                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 14  8'Selger. . . . . . . .  .+'
     A            A2PSEF    R        B 14 34REFFLD(RKPSEF)
     A  55                                  DSPATR(PC)
     A  44                                  ERRMSGID(RMH0370 *LIBL/QMFOKON 44)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 14 39'-'
7.xx A                                 14 41'+'
7.xx A            A2PSET    R        B 14 43REFFLD(RKPSET)
     A  56                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15  8'Kundenr.(Fra-til)  . . .+'
     A            A2PKNF    R        B 15 34REFFLD(RKPKNR)
     A  57                                  DSPATR(PC)
     A  48                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 40)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 15 41'-'
7.xx A                                 15 43'-'
7.xx A            A2PKNT    R        B 15 45REFFLD(RKPKNR)
     A  58                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16  8'Inntil 10 kundenr. . . .+'
     A            A2PKN1    R        B 16 34REFFLD(RKPKNR)
     A  47 11                               DSPATR(PC)
     A  47 11                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 41'+'
     A            A2PKN2    R        B 16 43REFFLD(RKPKNR)
     A  47 12                               DSPATR(PC)
     A  47 12                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 50'+'
7.xx A            A2PKN3    R        B 16 52REFFLD(RKPKNR)
     A  47 13                               DSPATR(PC)
     A  47 13                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 59'+'
7.xx A            A2PKN4    R        B 16 61REFFLD(RKPKNR)
     A  47 14                               DSPATR(PC)
     A  47 14                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 68'+'
7.xx A            A2PKN5    R        B 16 70REFFLD(RKPKNR)
     A  47 15                               DSPATR(PC)
     A  47 15                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 32'+'
     A            A2PKN6    R        B 17 34REFFLD(RKPKNR)
     A  47 16                               DSPATR(PC)
     A  47 16                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 41'+'
7.xx A            A2PKN7    R        B 17 43REFFLD(RKPKNR)
     A  47 17                               DSPATR(PC)
     A  47 17                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 50'+'
     A            A2PKN8    R        B 17 52REFFLD(RKPKNR)
     A  47 18                               DSPATR(PC)
     A  47 18                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 59'+'
7.xx A            A2PKN9    R        B 17 61REFFLD(RKPKNR)
     A  47 19                               DSPATR(PC)
     A  47 19                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 68'+'
     A            A2PKN0    R        B 17 70REFFLD(RKPKNR)
     A  47 20                               DSPATR(PC)
     A  47 20                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 18  2'Utskrift:'
     A                                      COLOR(WHT)
     A                                 19  8'Skriv kontrolliste . . .:'
     A            A2PSKR         1A  B 19 34TEXT('Skriv kvitteringsliste')
     A  36                                  DSPATR(PC)
     A  36                                  ERRMSGID(RMA0010 *LIBL/QMFOKON 36)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 19 37'(J=Ja, Blank)'
     A                                 20  2'Sortering:'
     A                                      COLOR(WHT)
     A                                 21  8'Alfabetisk . . . . . . .:'
     A            A25RAF    R        B 21 34REFFLD(RA5RAF)
     A  45                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A  45                                  ERRMSGID(RMH0290 *LIBL/QMFOKON 45)
     A                                 21 37'(J=Ja, Blank)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F4=Spørring'
     A                                      COLOR(BLU)
