     A*%%TS  SD  20040219  112647  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK650D
     A* Beskrivelse . . : Kunder, rentenota - paramter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       150902 KOB  Nytt program
7.xx A*       090516 bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20040219  112647  KOB         REL-V5R2M0  5722-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A  98                                  PUTOVR
     A                                      RTNCSRLOC(&W_ACRD &W_AFLD)
     A            W_ACRD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Renteberegning - forslag'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5 13'Renter t.o.m. dato.:'
     A            A2PKDA    R        B  5 34REFFLD(RKPKDA)
     A  31                                  DSPATR(PC)
     A  31                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  6 13'Forfallsdato. . . .:'
     A            A2PFDA    R        B  6 34REFFLD(RKPKDA)
     A  32                                  DSPATR(PC)
     A  32                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 32)
     A  32                                  ERRMSGID(RMH0380 *LIBL/QMFOKON 32)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  8 13'Renteprosent. . . .:'
     A            A26PPR    R        B  8 34REFFLD(RFRFR/RA6PPR *LIBL/RFRF)
     A                                      EDTCDE(1)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 13'Regnskapsperiode. .:'
     A            A2PPEF    R        B  9 34REFFLD(RKPPER)
     A  33                                  DSPATR(PC)
     A  33                                  ERRMSGID(RML0560 *LIBL/QMFOKON 33)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A            A2PRÅR    R        B  9 37REFFLD(RKPRÅR)
     A  34                                  DSPATR(PC)
     A  34                                  ERRMSGID(RMH0160 *LIBL/QMFOKON 34)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 11 11'Utvalg:'
     A                                      COLOR(WHT)
7.xx A                                 11 34'Fra    -   Til'
7.xx A                                 12 13'Avdeling. . . . . .+'
     A            A2PAVF    R        B 12 34REFFLD(RKPAVF)
     A  30                                  DSPATR(PR)
     A  35                                  DSPATR(PC)
     A  35                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 35)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 12 41'-'
7.xx A                                 12 43'+'
7.xx A            A2PAVT    R        B 12 45REFFLD(RKPAVT)
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 13 13'Kundekategori . . .+'
     A            A2PKAF    R        B 13 34REFFLD(RKPKAF)
     A  36                                  DSPATR(PC)
     A  36                                  ERRMSGID(RMH0350 *LIBL/QMFOKON 36)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 13 41'-'
7.xx A                                 13 43'-'
7.xx A            A2PKAT    R        B 13 45REFFLD(RKPKAT)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 14 13'Selger. . . . . . .+'
     A            A2PSEF    R        B 14 34REFFLD(RKPSEF)
     A  37                                  DSPATR(PC)
     A  37                                  ERRMSGID(RMH0370 *LIBL/QMFOKON 37)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 14 41'-'
7.xx A                                 14 43'+'
7.xx A            A2PSET    R        B 14 45REFFLD(RKPSET)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 15 13'Kundenr.. . . . . .+'
     A            A2PKNF    R        B 15 34REFFLD(RKPKNR)
     A  38                                  DSPATR(PC)
     A  38                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 38)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 15 41'-'
7.xx A                                 15 43'+'
     A            A2PKNT    R        B 15 45REFFLD(RKPKNR)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 13'Inntil 10 enkelt- .+'
     A            A2PKN1    R        B 16 34REFFLD(RKPKNR)
     A  40 11                               DSPATR(PC)
     A  40 11                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 41'+'
     A            A2PKN2    R        B 16 43REFFLD(RKPKNR)
     A  40 12                               DSPATR(PC)
     A  40 12                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 50'+'
     A            A2PKN3    R        B 16 52REFFLD(RKPKNR)
     A  40 13                               DSPATR(PC)
     A  40 13                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 59'+'
     A            A2PKN4    R        B 16 61REFFLD(RKPKNR)
     A  40 14                               DSPATR(PC)
     A  40 14                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 16 68'+'
     A            A2PKN5    R        B 16 70REFFLD(RKPKNR)
     A  40 15                               DSPATR(PC)
     A  40 15                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 23'kunder. .+'
     A            A2PKN6    R        B 17 34REFFLD(RKPKNR)
     A  40 16                               DSPATR(PC)
     A  40 16                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 41'+'
     A            A2PKN7    R        B 17 43REFFLD(RKPKNR)
     A  40 17                               DSPATR(PC)
     A  40 17                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 50'+'
     A            A2PKN8    R        B 17 52REFFLD(RKPKNR)
     A  40 18                               DSPATR(PC)
     A  40 18                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 59'+'
     A            A2PKN9    R        B 17 61REFFLD(RKPKNR)
     A  40 19                               DSPATR(PC)
     A  40 19                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
7.xx A                                 17 68'+'
     A            A2PKN0    R        B 17 70REFFLD(RKPKNR)
     A  40 20                               DSPATR(PC)
     A  40 20                               ERRMSGID(RMF0020 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 18 11'Sortering:'
     A                                      COLOR(WHT)
     A                                 19 13'Alfabetisk. . . . .:'
     A            A2PALF    R        B 19 34REFFLD(RKPALF)
     A  41                                  DSPATR(PC)
     A  41                                  ERRMSGID(RMH0290 *LIBL/QMFOKON 41)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 19 41'(J=Ja, Blank)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F4=Spørring'
     A                                      COLOR(BLU)
