     A*%%TS  SD  20041102  145947  GRO530      REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK811D
     A* Beskrivelse . . : Kunder, autogiro - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       021104 GRO  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20041102  145947  GRO530      REL-V5R2M0  5722-WDS
     A                                      KEEP
     A                                      CA01
     A                                      CA03
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  2  2'Autogiro'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  8  8'Forfallsdato etter . . .:'
     A            A2PKDA    R        B  8 34REFFLD(RKPKDA)
     A  31                                  DSPATR(PC)
     A  31                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 31)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                  8 42'blir'
     A                                  8 47'ikke'
     A                                  8 52'tatt'
     A                                  8 57'med'
     A                                 10  8'Utvalg:'
     A                                 10 33' Fra    - Til '
     A                                 11 10'Kundekategori  . . . .:'
     A            A2PKAF    R        B 11 34REFFLD(RKPKAF)
     A  42                                  DSPATR(PC)
     A  42                                  ERRMSGID(RMH0350 *LIBL/QMFOKON 42)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 11 41'-'
     A            A2PKAT    R        B 11 43REFFLD(RKPKAT)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 12 10'Avdeling . . . . . . .:'
     A            A2PAVF    R        B 12 34REFFLD(RKPAVF)
     A  30                                  DSPATR(PR)
     A  43                                  DSPATR(PC)
     A  43                                  ERRMSGID(RMH0130 *LIBL/QMFOKON 43)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 12 41'-'
     A            A2PAVT    R        B 12 43REFFLD(RKPAVT)
     A  30                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 13 10'Selger . . . . . . . .:'
     A            A2PSEF    R        B 13 34REFFLD(RKPSEF)
     A  44                                  DSPATR(PC)
     A  44                                  ERRMSGID(RMH0370 *LIBL/QMFOKON 44)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 13 41'-'
     A            A2PSET    R        B 13 43REFFLD(RKPSET)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 14 10'Kundenummer  . . . . .:'
     A            A2PKNF    R        B 14 34REFFLD(RKPKNR)
     A  48                                  DSPATR(PC)
     A  48                                  ERRMSGID(RMH0140 *LIBL/QMFOKON 40)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 14 41'-'
     A            A2PKNT    R        B 14 43REFFLD(RKPKNR)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 15 10'Bilag/Faktura-nr.  . .:'
     A            A2PBIF    R        B 15 34REFFLD(RKPKNR)
     A  47                                  DSPATR(PC)
     A  47                                  ERRMSGID(RMH0390 *LIBL/QMFOKON 47)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 15 41'-'
     A            A2PBIT    R        B 15 43REFFLD(RKPKNR)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 17  8'Sortering:'
     A                                 18 10'Alfabetisk . . . . . .:'
     A            A2PALF    R        B 18 34REFFLD(RKPALF)
     A  45                                  DSPATR(PC)
     A  45                                  ERRMSGID(RMH0290 *LIBL/QMFOKON 45)
     A                                      CHECK(RB)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(MDT)
     A                                      COLOR(YLW)
     A                                 18 37'(J=Ja, Blank)'
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 35'F3=Gå tilbake'
     A                                      COLOR(BLU)
