     A*%%TS  SD  20020106  205927  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK100D
     A* Beskrivelse . . : Kunder, vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       230702 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20020106  205927  KOB         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A                                      CA01
     A                                      CA03
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppdater saldo/kjøp i år'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Tast inn valg, og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  7  8'Oppgi regnskapsår. . . .:'
     A            A2RAAR    R        B  7 34REFFLD(RHPRÅR)
     A                                      COLOR(YLW)
     A                                  9  8'Oppdater saldo . . . . .:'
     A            A2SALD    R        B  9 34REFFLD(RKPLTY)
     A  31                                  ERRMSGID(RM00010 *LIBL/QMFOKON 31)
     A                                      VALUES('J' 'N')
     A                                      COLOR(YLW)
     A                                  9 38'(J=Ja, N=Nei)'
     A                                 10  8'Oppdater kjøp i år . . .:'
     A            A2KJØP    R        B 10 34REFFLD(RKPLTY)
     A  32                                  ERRMSGID(RM00010 *LIBL/QMFOKON 32)
     A                                      VALUES('J' 'N')
     A                                      COLOR(YLW)
     A                                 10 38'(J=Ja, N=Nei)'
     A                                 11  8'Oppdater kjøp i fjor . .:'
     A            A2KJØF    R        B 11 34REFFLD(RKPLTY)
     A  33                                  ERRMSGID(RM00010 *LIBL/QMFOKON 33)
     A                                      VALUES('J' 'N')
     A                                      COLOR(YLW)
     A                                 11 38'(J=Ja, N=Nei)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
