     A*%%TS  SD  20030311  213755  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK976D
     A* Beskrivelse . . : Kunder, oppdater siste purredato
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       230702 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20030311  213755  KOB         REL-V5R2M0  5722-WDS
     A                                      KEEP
     A                                      CA01
     A                                      CA03
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppdater siste purredato'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  7  3'Oppgi dato for siste betalingsvars-
     A                                      el:'
     A            A2PDAT         6Y 0B  7 41COLOR(YLW)
     A                                      EDTCDE(Y)
     A  31                                  ERRMSG('Ugyldig dato' 31)
     A                                  9  3'Rutinen legger inn oppgitt dato på-
     A                                       alle poster i kundereskontro.'
     A                                      COLOR(RED)
     A                                 10  3'Dvs. at ved neste kjøring av betal-
     A                                      ingsvarsel kontrolleres mot denne d-
     A                                      atoen.'
     A                                      COLOR(RED)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
