     A*%%TS  SD  20121102  102324  NHO620      REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK985D
     A* Beskrivelse . . : Uttrekk av poster til Zirius
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       221112 NHO  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20121102  102324  NHO620      REL-V7R1M0  5770-WDS
     A                                      KEEP
     A                                      CA01
     A                                      CA03
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Test / Uttrekk'
     A                                      COLOR(WHT)
     A                                  2 17'av poster til Zirius'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  3'Zirius................. fakturapos-
     A                                      ter :'
     A            A2ZLFA         1A  B  5 45COLOR(YLW)
     A                                  5 49'(J/N)'
     A                                  6 27'butikkposter  :'
     A            A2ZLBU         1A  B  6 45COLOR(YLW)
     A                                  6 49'(J/N)'
     A*
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
