     A*%%TS  SD  20201103  085503  SST700      REL-V7R3M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK985D
     A* Beskrivelse . . : Uttrekk av poster til Visma, Zirius etc
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       301012 NHO  Nytt program
7.00 A*       260419 NHO  Vedlikehold av Nexstep og Ny bilagskode
7.01 A*       030519 NHO  Test av Mamut
7.02 A*       100220 NHO  Fjernet vedlikehold av tabell, lagt inn
7.02 A*                   test av lagertranser
7.03 A*K00    031120 SST  Uni Micro
7.04 A*       150621 MST  Visma Global; lagerposter
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20201103  085503  SST700      REL-V7R3M0  5770-WDS
     A                                      KEEP
     A                                      CA01
     A                                      CA03
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Test / Uttrekk av poster til Visma'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  3'Visma  Global/std...... fakturapos-
     A                                      ter :'
     A            A2GLFA         1A  B  5 45COLOR(YLW)
     A                                  5 49'(J/N)'
     A                                  6 27'butikkposter  :'
     A            A2GLBU         1A  B  6 45COLOR(YLW)
     A                                  6 49'(J/N)'
7.04 A                                  7 27'lagerposter   :'
7.04 A            A2GLLA         1A  B  7 45COLOR(YLW)
7.04 A                                  7 49'(J/N)'
     A*
     A                                  8  3'Visma  Global/sum...... fakturapos-
     A                                      ter :'
     A            A2GSFA         1A  B  8 45COLOR(YLW)
     A                                  8 49'(J/N)  DI-syst.'
     A                                  9 27'butikkposter  :'
     A*
     A            A2GSBU         1A  B  9 45COLOR(YLW)
     A                                  9 49'(J/N)  DI-syst.'
     A*
     A                                 11  3'Visma  Business........ fakturapos-
     A                                      ter :'
     A            A2BUFA         1A  B 11 45COLOR(YLW)
     A                                 11 49'(J/N)'
     A*
     A                                 12 27'butikkposter  :'
     A            A2BUBU         1A  B 12 45COLOR(YLW)
     A                                 12 49'(J/N)'
     A                                 13 27'lagerposter   :'
     A            A2BULA         1A  B 13 45COLOR(YLW)
     A                                 13 49'(J/N)'
7.01 A*                                14  3'Mamut.................. fakturapos-
     A                                 15  3'Mamut.................. fakturapos-
     A                                      ter :'
7.02 A*           A2MAFA         1A  B 14 45COLOR(YLW)
7.02 A*                                14 49'(J/N)'
     A            A2MAFA         1A  B 15 45COLOR(YLW)
     A                                 15 49'(J/N)'
7.01 A*
7.02 A*                                15 27'butikkposter  :'
7.02 A*           A2MABU         1A  B 15 45COLOR(YLW)
7.02 A*                                15 49'(J/N)'
     A                                 16 27'butikkposter  :'
     A            A2MABU         1A  B 16 45COLOR(YLW)
     A                                 16 49'(J/N)'
7.00 A*
7.03 A*
7.03 A                                 18  3'Uni Micro ............. fakturapos-
7.03 A                                      ter :'
7.03 A*
7.03 A                                 19 27'butikkposter  :'
7.03 A                                 20 27'lagerposter   :'
7.03 A            A2UMFA         1A  B 18 45COLOR(YLW)
7.03 A                                 18 49'(J/N)'
7.03 A            A2UMBU         1A  B 19 45COLOR(YLW)
7.03 A                                 19 49'(J/N)'
7.03 A            A2UMLA         1A  B 20 45COLOR(YLW)
7.03 A                                 20 49'(J/N)'
     A*
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
