     A*%%TS  SD  20030523  091259  HKO         REL-V5R2M0  5722-WDS
     A*%%EC
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : FP600D
     A* Beskrivelse . . : Utskrift av spesialpriser
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  010416  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20030523  091259  HKO         REL-V5R2M0  5722-WDS
7.xx A*                                     WINDOW(*DFT 15 63)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Kopiering av leverandør til annen-
     A                                       filgruppe/firma '
     A                                      DSPATR(RI)
     A                                  5  2'Kopier fra:'
     A                                      COLOR(WHT)
7.xx A                                  6  2'Leverandør. . . . . . +'
     A            B1LEVR    R        B  6 26REFFLD(RLLEVR)
     A  31                                  ERRMSGID(RML0010 *LIBL/QMFOKON 31)
     A  32                                  ERRMSGID(RML0020 *LIBL/QMFOKON 32)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            B1NAVN    R        O  6 33REFFLD(RLNAVN)
     A                                      COLOR(YLW)
     A                                  8  2'Kopier til:'
     A                                      COLOR(WHT)
     A                                  9  2'Filgruppe . . . . . . .'
     A            B1FGRT         3A  B  9 26COLOR(YLW)
     A  33                                  ERRMSGID(RM00010 *LIBL/QMFOKON 33)
     A                                 10  2'Firma . . . . . . . . .'
     A            B1FIRT         3Y 0B 10 26COLOR(YLW)
     A  34                                  ERRMSGID(RM00010 *LIBL/QMFOKON 34)
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
