     A*%%TS  SD  20030102  160517  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RK100D
     A* Beskrivelse . . : Kunder, vedlikehold
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       230702 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20030102  160517  KOB         REL-V5R1M0  5722-WDS
     A                                      KEEP
     A                                      CA01
     A                                      CA03
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppdater passive leverandører'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  7  3'Oppgi dato for kontroll. .:'
     A            A2RDAT         6Y 0B  7 31COLOR(YLW)
     A                                      EDTCDE(Y)
     A  31                                  ERRMSG('Ugyldig dato' 31)
     A                                  9  3'Rutinen kontrollerer leverandørreg-
     A                                      isteret mot dato for siste posterin-
     A                                      g'
     A                                      COLOR(RED)
     A                                 10  3'Leverandører som ikke har hatt pos-
     A                                      teringer etter denne dato eller er -
     A                                      opprettet'
     A                                      COLOR(RED)
     A                                 11  3'tidligere enn 1. år før denne dato-
     A                                       blir merket med J i kode for passi-
     A                                      v'
     A                                      COLOR(RED)
     A                                 12  3'Det er videre en betingelse at sal-
     A                                      do = 0'
     A                                      COLOR(RED)
     A                                 14  3'Leverandører som er merket som pas-
     A                                      sive vises ikke i spørrebildet'
     A                                      COLOR(RED)
     A                                 22 48' '
     A                                 22 50' '
     A                                 24  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
