     A*%%TS  SD  20200412  183043  KRKRI       REL-V7R3M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RM000
     A* Beskrivelse . . : Økonomisystemet, hovedmeny
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       270902 KOB  Nytt program
8.01 A* 800   160223 ask  Lagt inn nye valg for regnskapslogg og masterdatalogg
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20200412  183043  KRKRI       REL-V7R3M0  5770-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Hovedmeny'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  3'Daglig drift'
     A                                      COLOR(WHT)
     A                                  5 37'Vedlikehold/Kontroll'
     A                                      COLOR(WHT)
     A                                  6  3'1. Registrering'
     A                                  6 36' 4. Vedlikehold'
     A                                  7  3'2. Rapporter'
     A                                  7 36' 5. Utskrift'
     A                                  8  3'3. Spørring'
     A                                  8 36' 6. Hjelperutiner'
     A                                  9 36' 7. Årsrutiner'
     A                                 11  3'Overgang delsystemer'
     A                                      COLOR(WHT)
     A                                 11 37'Overgang eksterne systemer'
     A                                      COLOR(WHT)
     A                                 12  3'8. Hovedbok'
     A                                 12 37'12. Overføring fra Lønn'
     A                                 13  3'9. Kundereskontro'
     A                                 13 37'13. Overføring fra/til PC-filer'
     A                                 14  2'10. Leverandørreskontro'
     A                                 15  2'11. Prosjektregnskap'
     A                                 15 37'18. Rapportering til ALTINN'
8.01 A                                 16 37'19. Oppslag mot regnskapslogg'
8.01 A                                 17 37'20. Oppslag mot masterdatalogg'
     A                                 19 37'90. Gå ut av systemet'
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
