     A*%%TS  SD  20080328  085411  KOB560      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RM120
     A* Beskrivelse . . : Økonomisystemet, overføringsrutiner
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       270902 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20080328  085411  KOB560      REL-V5R4M0  5722-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Overføringsrutiner'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  4'Overføring fra butikk'
     A                                      COLOR(WHT)
     A                                  5 45'Overføring fra lager/innkjøp'
     A                                      COLOR(WHT)
     A                                  6  3' 1. Overføring av posteringer'
     A                                  6 45' 9. Overføring av posteringer'
     A                                  7  3' 2. Registrering/Justering'
     A                                  7 45'10. Registrering/Justering'
     A                                  8  3' 3. Kontrolliste'
     A                                  8 45'11. Kontrolliste'
     A                                  9  3' 4. Journalliste'
     A                                  9 45'12. Journalliste'
     A                                 11  4'Overføring fra fakturering'
     A                                      COLOR(WHT)
     A                                 11 45'Overføring fra Scanning'
     A                                      COLOR(WHT)
     A                                 12  3' 5. Overføring av posteringer'
     A                                 12 45'13. Overføring Nexstep Arkiv'
     A                                 13  3' 6. Registrering/Justering'
     A                                 13 45'14. Overføring Compello'
     A                                 14  3' 7. Kontrolliste'
     A                                 15  3' 8. Journalliste'
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
