     A*%%TS  SD  20170615  090110  SST630      REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RM16
     A* Beskrivelse . . : Økonomisystemet, overføringsrutiner
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       270902 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20170615  090110  SST630      REL-V7R1M0  5770-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Rutiner for Compello'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Behandling av poster som er scanne-
     A                                      t'
     A                                      COLOR(WHT)
     A                                  7  2' 2. Overføre poster fra Compello '
     A                                  8  2' 3. Registrering/Justering'
     A                                  7 43'11. Se på RCOMPF'
     A                                  9  2' 4. Kontrolliste'
     A                                  8 43'12. Se på RCMPPF            '
     A                                 10  2' 5. Journalliste'
     A                                  9 43'13. Bygge RCOMPF          '
     A                                 10 43'14. Bygge RCMPPF            '
     A                                 12  2' 6. Feiltranser fra Compello'
     A  41                                  COLOR(RED)
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
     A                                 14  3'8. Se på overførte bilag'
     A                                 11 43'15. Se på RCMTPF (test om innlest)'
     A                                 12 43'16. Se på RCMDPF (innl.før,slettet-
     A                                      )'
     A                                 13 43'17. Bygge RCMTPF'
     A                                 14 43'18. Bygge RCMDPF'
     A                                 12 38'(26)'
     A                                  6  3'1. Se på poster fra Compello'
     A                                 11 38'(25)'
     A                                  2 36'RM27'
     A                                 15 43'19. Bygge RCMRPF'
