     A*%%TS  SD  20031014  125205  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RM300
     A* Beskrivelse . . : Økonomisystemet, autobank
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       270902 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20031014  125205  KOB         REL-V5R2M0  5722-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Autobank'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Utbetalingsforslag'
     A                                      COLOR(WHT)
     A                                  5 40'Bankavstemming'
     A                                      COLOR(WHT)
     A                                  6  2' 1. Kjør forslag'
     A                                  6 40' 7. Hovedrutine'
     A                                  7  2' 2. Hent lønnstransaksjoner'
     A                                  7 40' 8. Spørring på kontoinformasjon'
     A                                  8  2' 3. Vedlikehold av forslag'
     A                                  8 40' 9. Spørring på hovedbokskonto'
     A                                  9  2' 4. Overfør samlefil'
     A                                 10  2' 5. Oppkobling mot bank'
     A                                 11  2' 6. Forfallsregister'
     A                                 12 40'Hjelperutiner'
     A                                      COLOR(WHT)
     A                                 13  2'Bankreturer'
     A                                      COLOR(WHT)
     A                                 13 40'15. Faste data'
     A                                 14  2'10. Hent returdata'
     A                                 14 40'16. Sletter kontrollmember bank'
     A                                 15  2'11. Oppdater returdata'
     A                                 15 40'17. Sletter kontrollmember samlefi-
     A                                      l'
     A                                 16  2'12. Justering'
     A                                 16 40'18. Sletter kontrollmember retur'
     A                                 17  2'13. Kontrolliste'
     A                                 17 40'19. Tømmer arbeidsregister retur'
     A                                 18  2'14. Journalliste'
     A                                 18 40'20. Sletter historiske bankreturer'
     A                                 20 30'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
