     A*%%TS  SD  20120919  131309  ASP_C36     REL-V6R1M0  5761-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RM401
     A* Beskrivelse . . : Økonomisystemet, kundereskontro - inkasso
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       270902 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      CA01(01 'F1=Velg Firma')
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA05(05 'F5=Driftsmeny')
     A                                      CA06(06 'F6=Se på meldinger')
     A                                      CA10(10 'F10=Kommando-linje')
     A                                      CA12(12 'F12=Gå tilbake')
     A          R A1MNU
     A*%%TS  SD  20120919  131309  ASP_C36     REL-V6R1M0  5761-WDS
     A                                      KEEP
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kundereskontro - inkasso'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Inkasso'
     A                                      COLOR(WHT)
     A                                  5 43'Vedlikehold'
     A                                      COLOR(WHT)
     A                                  6  2' 1. Kjør forslag'
     A                                  6 43'10. Statuskoder'
     A                                  7  2' 2. Vedlikehold av forslag'
     A                                  7 43'11. Saksregister'
     A                                  8  2' 3. Utskrift av nytt forslag'
     A                                  8 43'12. Sletting av avsluttede saker'
     A                                  9  2' 4. Legg ut nye saker'
     A                                 10  2' 5. Overføring faktura'
     A                                 10 43'Regnskapsoppdatering'
     A                                      COLOR(WHT)
     A                                 11 43'15. Registrering/justering'
     A                                 12  2' 6. Innbetalinger'
     A                                 12 20'fra'
     A                                 12 24'Nexstep'
     A                                 12 43'16. Kontrolliste'
     A                                 13  2' 7. Overføring innbetalinger'
     A                                 13 43'17. Journalliste'
     A                                 15  2' 8. Hente retur fra Inkassofirma'
     A                                 15 43'Utskrifter'
     A                                      COLOR(WHT)
     A                                 16 43'23. Saksregister'
     A                                 17 43'24. Kunder som er utelatt'
     A                                 18 43'25. Poster med reklamasjon'
     A                                 21 30'Valg:'
     A            VALG           2Y 0B 21 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2'F1=Velg firma'
     A                                      COLOR(BLU)
     A                                 23 17'F3=Tilbake'
     A                                      COLOR(BLU)
     A                                 23 30'F5=Driftsmeny'
     A                                      COLOR(BLU)
     A                                 23 46'F6=Meldinger'
     A                                      COLOR(BLU)
     A                                 23 61'F10=Kommando-linje'
     A                                      COLOR(BLU)
