     A*%%TS  SD  20220906  093414  SST_800     REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20220830  120609  SST_800     REL-V7R3M0  5770-WDS
     A            B1HMNR         5S 0H
     A            B1VALG         2Y 0B  7  2COLOR(YLW)
     A                                      VALUES(0 2 3 4 5 7 9 10)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      EDTCDE(Z)
     A            B1TRAN        48A  O  7 31
     A            B1DATO        10A  O  7  6
     A            B1TIME         8A  O  7 17
     A            B1LINE         4A  O  7 26
     A            B1TRAH       200A  H
     A            B1KDAT          L  H
     A            B1KTIM          T  H
     A            B1KLIN         4S 0H
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20220830  120609  SST_800     REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA06
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'MalProff         '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av MalProff-transer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2' 2=Endre  4=Slette  5=Vise        -
     A                                                                         '
     A                                      COLOR(BLU)
     A                                  5  2'V   Dato       kl.      Line Trans'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20220906  093414  SST_800     REL-V7R3M0  5770-WDS
     A                                 23  2'F3=Gå tilbake  F5=Forny           -
     A                                       '
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20220906  093414  SST_800     REL-V7R3M0  5770-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager-Oppdatering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av Mal-Proff transer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Dato...:'
     A            C1DATO        10A  O  5 12
     A                                  6  2'Klokken:'
     A            C1TIME         8A  O  6 12
     A                                  7  2'Linje..:'
     A            C1LINE         4A  O  7 12
     A                                  8  2'Transaksjon:'
     A                                  9  4'GLN_nr.....:'
     A            C2GLN         14A  B  9 20
     A  30                                  DSPATR(PR)
     A                                 10  4'Dato.......:'
     A            C2DATO        10A  B 10 20
     A  31                                  DSPATR(PR)
     A                                 11  4'Tid........:'
     A            C2TIME         8A  B 11 20
     A  31                                  DSPATR(PR)
     A                                 12  4'Linjenr....:'
     A            C2LINE         4A  B 12 20
     A  31                                  DSPATR(PR)
     A                                 13  4'EAN/Gtin.nr:'
     A            C2EAN         14A  B 13 20
     A  30                                  DSPATR(PR)
     A                                 14  4'Antall.....:'
     A            C2ANT         11A  B 14 20
     A  31                                  DSPATR(PR)
     A                                 15  4'Ordrenr....:'
     A            C2ONR          9A  B 15 20
     A  31                                  DSPATR(PR)
     A                                 16  4'Avdeling...:'
     A            C2AVD         30A  B 16 20
     A  31                                  DSPATR(PR)
     A                                 17  4'Kundenr.MP.:'
     A            C2KNR         10A  B 17 20
     A  31                                  DSPATR(PR)
     A                                 18  4'KundeNavnMP:'
     A            C2KUN         30A  B 18 20
     A  31                                  DSPATR(PR)
     A            C2EDAT         8Y 0O 22 48COLOR(YLW)
     A                                      EDTWRD('    _  _  ')
     A                                      OVRDTA
     A                                 22 57'/'
     A            C2ETID         6Y 0O 22 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 68'/'
     A            C2EUSR        10A  O 22 70COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            C2KDAT          L  H
     A            C2KTIM          T  H
     A            C2KLIN         4S 0H
     A*
     A          R D1WIN
     A*%%TS  SD  20220830  122936  SST_800     REL-V7R3M0  5770-WDS
     A                                      WINDOW(*DFT 15 50)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Slett trans, bekreft med Enter'
     A                                      DSPATR(RI)
     A                                  4  2'Dato....:'
     A            D1DATO        10A  O  4 12
     A                                  5  2'Tid.....:'
     A            D1TIME         8A  O  5 12OVRDTA
     A                                  6  2'Linje...:'
     A            D1LINE         4A  O  6 12OVRDTA
     A                                  7  2'Trans...:'
     A            D1TRA1        48A  O  8  2OVRDTA
     A            D1TRA2        48A  O  9  2OVRDTA
     A            D1KDAT          L  H
     A            D1KTIM          T  H
     A            D1KLIN         4S 0H
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
