     A*%%TS  SD  20190402  094725  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A*
     A*
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20190402  094725  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A            B1VALG    R        B  7  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1KODE         4A  O  7  5
     A            B1TEXT        30A  O  7 10
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20190402  094725  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Velge '
     A                                      DSPATR(RI)
     A            B2TYPE        30A  B  2 10DSPATR(RI)
     A                                  3  5'Kode'
     A                                      COLOR(WHT)
     A                                  3 10'Beskrivelse'
     A                                      COLOR(WHT)
     A                                  5  2'1=Velg'
     A                                      COLOR(BLU)
     A                                  6  2'V'
     A                                      COLOR(WHT)
     A                                  6  5'Kode'
     A                                      COLOR(WHT)
     A                                  6 10'Beskrivelse'
     A                                      COLOR(WHT)
     A            B2KODE         4A  B  4  5COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2TEXT        30A  B  4 10COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20020226  090208  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 17 45)
     A                                 16  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
