     A*%%TS  SD  20200108  101305  G0TEGSVSTR  REL-V7R3M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RP140R
     A* Beskrivelse . . : Prosjekt, Budsjett pr konto
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       230819 sst  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *WIDE)
     A                                      REF(*LIBL/RPVAPF RPVAPFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20191018  102256  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A            B1VALG         1A  B  7  2COLOR(YLW)
     A                                      VALUES('0' '1')
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A            B1LASS    R        O  7  5REFFLD(RPVLAS)
     A                                      EDTCDE(4)
     A            B1BUDS    R        O  7  8REFFLD(RPVABJ)
     A                                      EDTCDE(4)
     A            B1ANTA    R        B  7 16REFFLD(RPVABJ)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A***         B1LEVT    R        O  7 26REFFLD(RPVLET)
     A            B1VARE    R   -7   O  7 27REFFLD(RPVVAR)
     A            B1VTXT    R  -10   O  7 36REFFLD(RPVTXT)
     A            B1ENHE    R        O  7 57REFFLD(RPVENH)
     A            B1KPRI         8Y 2O  7 61EDTCDE(1)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20200108  101305  G0TEGSVSTR  REL-V7R3M0  5770-WDS
     A  *DS3                                SFLSIZ(0012)
     A  *WIDE                               SFLSIZ(0012)
     A  *DS3                                SFLPAG(0011)
     A  *WIDE                               SFLPAG(0011)
     A  *DS3                                WINDOW(B2CMD)
     A  *WIDE                               WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA09
     A                                      CF10
     A                                      CA12
     A                                      CA15
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  5  2'1=Hent '
     A                                      COLOR(BLU)
     A            B2SLAS    R        B  4  5REFFLD(RPVLAS)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B2SVAR    R   -7   B  4 28REFFLD(RPVVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  1  1'Prosjekt:'
     A                                      COLOR(WHT)
     A            B2PTXT        60A  O  2 11COLOR(YLW)
     A                                      OVRDTA
     A            B2PROS        60A  O  1 11COLOR(YLW)
     A                                      OVRDTA
     A                                  2  1'(RP147)'
     A                                  4 10'F10=Overfør lass'
     A                                  6  2'V'
     A                                      COLOR(WHT)
     A                                  6  4'Lass'
     A                                      COLOR(WHT)
     A                                  6 10'Budsj'
     A                                      COLOR(WHT)
     A                                  6 17'Antall'
     A                                      COLOR(WHT)
     A                                  6 27'Varenr'
     A                                      COLOR(WHT)
     A                                  6 36'Beskrivelse'
     A                                      COLOR(WHT)
     A                                  6 57'Enh'
     A                                      COLOR(WHT)
     A                                  6 65'K.Pris'
     A                                      COLOR(WHT)
     A                                  3  5'Lass'
     A                                      COLOR(WHT)
     A                                  3 28'Varenr'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20191018  084422  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A  *DS3                                WINDOW(*DFT 20 70)
     A  *WIDE                               WINDOW(*DFT 20 70)
     A                                 19  2'F3=Gå tilbake  F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 80' '
