     A*%%TS  SD  20201006  151341  SST700      REL-V7R3M0  5770-WDS
     A*%%EC
     A*%%                                   DSPSIZ(24 80 *DS3                  -
     A                                      DSPSIZ(27 132 *DS3)
     A                                      REF(*LIBL/RPVAPF RPVAPFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20190911  084215  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A            B1VALG         1A  B 10  2COLOR(YLW)
     A                                      VALUES('0' '2' '4' '5' ' ')
     A                                      CHKMSGID(JM00010 *LIBL/QMFBYGG)
     A            B1ENHE    R        H      REFFLD(RPVENH)
     A            B1LASS    R        H      REFFLD(RPVLAS)
     A            B1LDAT    R        H      REFFLD(RPVLDA)
     A            B1SJBUAN  R        H      REFFLD(RPVABJ)
     A            B1VARE         8A  O 10  4
     A            B1BESK        20A  O 10 13
     A            B1LASSX        2A  O 10 34
     A            B1ENHET        3A  O 10 37
     A            B1BUDANT       5Y 0O 10 41EDTCDE(3)
     A            B1JBUANT       5Y 0B 10 47EDTCDE(M)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A**                                    EDTCDE(3)
     A            B1LDAX         8A  O 10 54
     A            B1PLUANT       5A  O 10 63
     A            B1LEVANT       5A  O 10 69
     A            B1FAKANT       5A  O 10 75
     A            B1BESANT       5A  O 10 81
     A            B1AVVANT       5A  O 10 87
     A            B1KSTPRS       9Y 2O 10 93EDTCDE(1)
     A            B1KSTTOT       9Y 2O 10106EDTCDE(1)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20190924  144502  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CA10
     A                                      CF11
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Prosjekt'
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av Budsjeterte varer'
     A                                      COLOR(WHT)
     A                                  2 38'RP145B2'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      COLOR(WHT)
     A                                  4  2'Prosjekt . .'
     A            B2PROSJ       20A  O  4 16COLOR(YLW)
     A                                      OVRDTA
     A                                  5  4'Varen'
     A                                      COLOR(WHT)
     A                                  5 11'Beskrivelse'
     A                                      COLOR(WHT)
     A            B2VARE         8A  B  6  4COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2BESK        20A  B  6 13COLOR(YLW)
     A  22                                  DSPATR(PC)
     A  22                                  ERRMSGID(RMS0011 *LIBL/QMFOKON 22)
     A                                      OVRDTA
     A                                  7  2'2=Endre            4=Slett'
     A                                      COLOR(BLU)
     A            B2PTEXT       80A  O  4 38COLOR(YLW)
     A                                      OVRDTA
     A                                  9 32'Lass'
     A                                  9 37'Enh'
     A                                  8 41'Budsj'
     A                                  9 42'Ant.'
     A                                  8 48'Just.'
     A                                  9 49'Ant.'
     A                                  8 54'Levering'
     A                                  9 56'Dato'
     A                                  8 63'Plukk'
     A                                  9 64'Ant.'
     A                                  8 69'Utlev'
     A                                  9 70'Ant.'
     A                                  8 75'Fakt.'
     A                                  9 76'Ant.'
     A                                  8 81'Best.'
     A                                  9 82'Ant.'
     A                                  8 87'Avvik'
     A                                  8 95'Kost'
     A                                  8101'Pris'
     A                                  9 88'Ant.'
     A                                  9 96'pr. Enhet'
     A                                  8114'Kost'
     A                                  9112'Totalt'
     A                                  9  2'V'
     A                                  9  4'Varenr.'
     A                                  9 13'Beskrivelse'
     A          R B2CMD
     A*%%TS  SD  20191002  101928  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A                                 26  2'F3=Gå tilbake  F5=Forny  F6=Oppret-
     A                                      t   F8=Legg ut excel-fil'
     A                                      COLOR(BLU)
     A**                               23 43'F10=Skriv Rapport'
     A          R C1BLD
     A*%%TS  SD  20200116  123705  G0TEGSVSTR  REL-V7R3M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Prosjekt         '
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Opprette Vare       '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      COLOR(WHT)
     A                                  5  2'Prosjekt . . . . . . . . . .'
     A            C1PROS         6A  O  5 31COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  6  2'Underprosjekt  . . . . . . .'
     A                                  7  2'Aktivitet  . . . . . . . . .'
     A            C1UPRO         6A  O  6 31COLOR(YLW)
     A                                      OVRDTA
     A            C1AKTI         6A  O  7 31COLOR(YLW)
     A                                      OVRDTA
     A            C1PTXT        30A  O  5 40COLOR(YLW)
     A                                      OVRDTA
     A            C1UTXT        30A  O  6 40COLOR(YLW)
     A                                      OVRDTA
     A            C1ATXT        30A  O  7 40COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Varenr . . . . . . . . . . .'
     A                                 10  2'Lass nummer  . . . . . . . .'
     A            C1VARE         8A  B  9 31COLOR(YLW)
     A                                      OVRDTA
     A            C1LASS         2S 0B 10 31COLOR(YLW)
     A                                      OVRDTA
     A          R C1MSG
     A*%%TS  SD  20190910  122523  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Vare finnes på lass fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20200116  123705  G0TEGSVSTR  REL-V7R3M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Prosjekt         '
     A                                      COLOR(WHT)
     A                                  1118'Kl. :'
     A                                      COLOR(WHT)
     A                                  1124TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av prosjekt   '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2118'Dato:'
     A                                      COLOR(WHT)
     A                                  2124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      COLOR(WHT)
     A                                  5  2'Prosjekt . . . . . . . . . .'
     A            C1PROS         6A  O  5 31COLOR(YLW)
     A                                      OVRDTA
     A            C1PTXT    R        O  5 41REFFLD(RPVTXT)
     A                                      COLOR(YLW)
     A  23                                  ERRMSGID(RMP0400 *LIBL/QMFOKON 23)
     A                                      OVRDTA
     A                                  6  2'Underprosjekt  . . . . . . .'
     A            C1UPRO         6A  O  6 31COLOR(YLW)
     A                                      OVRDTA
     A            C1UTXT    R        O  6 41REFFLD(RPVTXT)
     A                                      COLOR(YLW)
     A  23                                  ERRMSGID(RMP0400 *LIBL/QMFOKON 23)
     A                                      OVRDTA
     A                                  7  2'Aktivitet  . . . . . . . . .'
     A            C1AKTI         6A  O  7 31COLOR(YLW)
     A                                      OVRDTA
     A            C1ATXT    R        O  7 41REFFLD(RPVTXT)
     A                                      COLOR(YLW)
     A  23                                  ERRMSGID(RMP0400 *LIBL/QMFOKON 23)
     A                                      OVRDTA
     A                                  9  2'Vare nummer . .  . . . . . .'
     A            C1VARE         8A  O  9 31COLOR(YLW)
     A                                      OVRDTA
     A            C1VTXT    R        B  9 41REFFLD(RPVTXT)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A  27                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A  23                                  ERRMSGID(RMP0400 *LIBL/QMFOKON 23)
     A                                      OVRDTA
     A                                 10  2'Lass nummer . .  . . . . . .'
     A            C1LASS    R        O 10 31REFFLD(RPVLAS)
     A                                      COLOR(YLW)
     A  37                                  ERRMSGID(RMP0490 *LIBL/QMFOKON 37)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                 12  2'Konto  . . . . . . . . . . .'
     A            C2KONTO   R        B 12 31REFFLD(RPVKTO)
     A                                      COLOR(YLW)
     A  28                                  DSPATR(PC)
     A  37                                  ERRMSGID(RMP0490 *LIBL/QMFOKON 37)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      EDTCDE(Z)
     A                                 13  2'Enhet (Smart/her). . . . . .'
     A            C2ENS          3A  B 13 31COLOR(YLW)
     A                                      OVRDTA
     A**                                    DSPATR(PR)
     A            C2ENH          3A  B 13 36COLOR(YLW)
     A                                      OVRDTA
     A**                                    DSPATR(PR)
     A                                 14  2'Leveringsdato  . . . . . . .'
     A            C2LDAT        10A  B 14 31COLOR(YLW)
     A                                      OVRDTA
     A**                                    DSPATR(PR)
     A                                 15  2'Budsjett antall  . . . . . .'
     A            C2ABU     R        O 15 31REFFLD(RPVABJ)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTCDE(M)
     A                                 16  2'Budjsett antall justert  . .'
     A            C2ABJ     R        B 16 31REFFLD(RPVABJ)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A  29                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A                                      EDTCDE(M)
     A                                 17  2'Kostpris . . . . . . . . . .'
     A            C2KPR          9Y 2B 17 31
     A                                      EDTCDE(M)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A*                                     CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                 20  2'Endret dato. . . . . . . . .'
     A            C2EDAT         6Y 0O 20 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20 42'Av:'
     A            C2EUSR    R        O 20 46REFFLD(RPVEUS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake                     -
     A                                                                         -
     A                                                '
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20190916  150127  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette varelinje  '
     A                                      DSPATR(RI)
     A                                  4  2'Varenummer . . . .'
     A            D1VARE    R        O  4 21REFFLD(RPVVAR)
     A                                  5  2'Lassnummer . . . .'
     A            D1LASS    R        O  5 21REFFLD(RPVLAS)
     A                                  6  2'Beskrivelse. . . .'
     A            D1BESK    R        O  6 21REFFLD(RPVTXT)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20190916  150127  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Varenummer . . . .'
     A            K1VARE    R        B  4 21REFFLD(RPVVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  8  2'Varenummer . . . .'
     A            RPVVAR    R        O  8 21OVRDTA
     A                                  9  2'Beskrivelse. . . .'
     A            RPVTXT    R        O  9 21OVRDTA
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R CCMSG
     A*%%TS  SD  20130218  084604  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 8 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Feilmelding:               '
     A            CCMSG1        30   O  4  1
     A            CCMSG2        30   O  5  1
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
