     A*%%TS  SD  20200207  093031  ASP_IMT     REL-V7R3M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RP140R
     A* Beskrivelse . . : Prosjekt, Budsjett pr konto
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       230819 sst  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *WIDE)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R B2CTL
     A*%%TS  SD  20200207  093031  ASP_IMT     REL-V7R3M0  5770-WDS
     A  *DS3                                WINDOW(&W_ACLI &W_ACPO 12 66)
     A  *WIDE                               WINDOW(&W_ACLI &W_ACPO 12 66)
     A                                      CA03
     A                                      CA05
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ACLI         2S 0P
     A            W_ACPO         3S 0P
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            B2DATO    R        O  4 23REFFLD(RAGTXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  1  2'Prosjekt:'
     A                                      COLOR(WHT)
     A            B2PTXT        55A  O  2 12COLOR(YLW)
     A                                      OVRDTA
     A            B2PROS        55A  O  1 12COLOR(YLW)
     A                                      OVRDTA
     A                                  2  1'(RP151)'
     A                                  4  1'Prosjektvurdering pr.'
     A                                  7  1'Kalkyle. . . . .'
     A                                  8  1'Realisert. . . .'
     A                                  9  1'Avvik. . . . . .'
     A                                  6 23'Inntekt        Kost           DB  -
     A                                       DG'
     A            B2KINT         9Y 0O  7 19COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('   .   .   -')
     A            B2RINT         9Y 0O  8 19COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('   .   .   -')
     A            B2AINT         9Y 0O  9 19COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('   .   .   -')
     A            B2KKST         9Y 0O  7 32COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('      .   -')
     A            B2RKST         9Y 0O  8 32COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('      .   -')
     A            B2AKST         9Y 0O  9 32COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('      .   -')
     A            B2KDB          9Y 0O  7 45COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('      .   -')
     A            B2RDB          9Y 0O  8 45COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('      .   -')
     A            B2ADB          9Y 0O  9 45COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('      .   -')
     A            B2KDG          5Y 2O  7 57COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('   ,  -')
     A            B2RDG          5Y 2O  8 57COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('   ,  -')
     A            B2ADG          5Y 2O  9 57COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTWRD('   ,  -')
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B2CMD
     A*%%TS  SD  20190903  120632  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A  *DS3                                WINDOW(*DFT 12 66)
     A  *WIDE                               WINDOW(*DFT 12 66)
     A                                 11  2'F3=Gå tilbake  F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 11 66' '
