     A*%%TS  SD  20190110  151747  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20181219  104310  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A            B1VALG    R        B  7  2REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5 6 7 8 9)
     A                                      CHKMSGID(JM00010 *LIBL/QMFBYGG)
     A            B1FSD         10A  H
     A            B1FED         10A  H
     A            B1BUO         10A  H
     A            B1BUT         10A  H
     A            B1UPRO         6A  H
     A            B1AKTI         6A  H
     A            B1USER        10A  H
     A            B1PROS         6A  O  7  4
     A  51                                  COLOR(RED)
     A            B1BESK    R   -8   O  7 11REFFLD(RP1TXT)
     A            B1FLT1        11A  O  7 34
     A            B1FLT2        11A  O  7 46
     A            B1FLT3        11A  O  7 58
     A  41                                  COLOR(RED)
     A            B1FLT4        11A  O  7 70
     A  41                                  COLOR(RED)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20190110  151747  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CF07
     A                                      CA10
     A                                      CF11
     A                                      CA12
     A                                      CA13
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Prosjekt         '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikeh. av Prosjekt fra excel'
     A                                      COLOR(WHT)
     A                                  2 38'RP300B2'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            B2PROS    R        B  4  4REFFLD(RP1PRO)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  5  2'2=Endre  3=Kopier  4=Slett  5=Vis -
     A                                       6=Oppdater'
     A                                      COLOR(BLU)
     A                                  6  2'V'
     A                                      COLOR(WHT)
     A                                  6  4'Prosj.'
     A                                      COLOR(WHT)
     A                                  6 11'Beskrivelse'
     A                                      COLOR(WHT)
7.xx A*            B2HEAD        47A  O  8 34COLOR(WHT)
     A            B2HEA1        11A  O  6 34COLOR(WHT)
     A            B2HEA2        11A  O  6 46COLOR(WHT)
     A            B2HEA3        11A  O  6 58COLOR(WHT)
     A            B2HEA4        11A  O  6 70COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20190110  151747  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A                                 23  2'F3=Gå tilbake  F5=Forny           -
     A                                            F13=Hent Prosjekt fra Excel'
     A                                      COLOR(BLU)
     A**                               23 43'F10=Skriv Rapport'
     A          R C1BLD
     A*%%TS  SD  20130408  085738  SST620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Prosjekt         '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Opprette Prosjekt   '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Prosjekt . . . . . . . . . .'
     A            C1PROS    R        B  5 31REFFLD(RP1PRO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Under Prosjekt . . . . . . .'
     A            C1UPRO    R        B  6 31REFFLD(RP1PRO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Aktivitet. . . . . . . . . .'
     A            C1AKTI    R        B  7 31REFFLD(RP1PRO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20130215  111700  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Prosjekt finnes fra før.   '
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20181221  101101  G0XEGSVSTR  REL-V7R3M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Prosjekt         '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av prosjekt   '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  2'Prosjekt/Underpr./Akt. .'
     A            C1PROS         6A  B  5 27
     A N52                                  COLOR(YLW)
     A  52                                  COLOR(RED)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(PR)
     A            C1UPRO         6A  B  5 34
     A N52                                  COLOR(YLW)
     A  52                                  COLOR(RED)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(PR)
     A            C1AKTI         6A  B  5 41
     A N52                                  COLOR(YLW)
     A  52                                  COLOR(RED)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(PR)
     A            C2BESK    R        B  6 27REFFLD(RP1TXT)
     A N53                                  COLOR(YLW)
     A  53                                  COLOR(RED)
     A                                      CHECK(LC)
     A  30                                  DSPATR(PR)
     A  23                                  ERRMSGID(RMP0400 *LIBL/QMFOKON 23)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  7  2'Forv. start/slutt dato .'
     A            C2FSD         10A  B  7 27
     A N54                                  COLOR(YLW)
     A  54                                  COLOR(RED)
     A  24                                  ERRMSGID(RMP0410 *LIBL/QMFOKON 24)
     A  25                                  ERRMSGID(RMP0420 *LIBL/QMFOKON 25)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(PR)
     A  54                                  DSPATR(PC)
     A            C2FED         10A  B  7 38
     A  26                                  ERRMSGID(RMP0430 *LIBL/QMFOKON 26)
     A  27                                  ERRMSGID(RMP0440 *LIBL/QMFOKON 27)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(PR)
     A N55                                  COLOR(YLW)
     A  55                                  COLOR(RED)
     A  55                                  DSPATR(PC)
     A                                  8  2'Prosjektleder .  . . . .'
     A            C2PRL         10A  B  8 27
     A N56                                  COLOR(YLW)
     A  56                                  COLOR(RED)
     A  56                                  DSPATR(PC)
     A  37                                  ERRMSGID(RMP0490 *LIBL/QMFOKON 26)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(PR)
     A            C2PRX     R        O  8 38REFFLD(ILRNAV)
     A                                      OVRDTA
     A                                  9  2'Avdeling . . . . . . . .'
     A            C2AVD         10A  B  9 27
     A N57                                  COLOR(YLW)
     A  57                                  COLOR(RED)
     A  57                                  DSPATR(PC)
     A  26                                  ERRMSGID(RMP0430 *LIBL/QMFOKON 26)
     A  27                                  ERRMSGID(RMP0440 *LIBL/QMFOKON 27)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(PR)
     A            C2AVX     R        O  9 38REFFLD(ILRNAV)
     A                                      OVRDTA
     A                                 10  2'Kundenummer . .  . . . .'
     A            C2KNR         10A  B 10 27
     A N58                                  COLOR(YLW)
     A  58                                  COLOR(RED)
     A  58                                  DSPATR(PC)
     A  28                                  ERRMSGID(RMP0450 *LIBL/QMFOKON 26)
     A  29                                  ERRMSGID(RMP0460 *LIBL/QMFOKON 27)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(PR)
     A            C2KNA     R        O 10 38REFFLD(RKNAVN)
     A                                      OVRDTA
     A                                 11  2'Budsjett inntekter . . .'
     A            C2BUO         10A  B 11 27
     A N59                                  COLOR(YLW)
     A  59                                  COLOR(RED)
     A  59                                  DSPATR(PC)
     A  26                                  ERRMSGID(RMP0430 *LIBL/QMFOKON 26)
     A  27                                  ERRMSGID(RMP0440 *LIBL/QMFOKON 27)
     A  40                                  ERRMSGID(RMP0520 *LIBL/QMFOKON 40)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                 12  2'Budsjett kostnader . . .'
     A            C2BUT         10A  B 12 27
     A N59                                  COLOR(YLW)
     A  59                                  COLOR(RED)
     A  59                                  DSPATR(PC)
     A  26                                  ERRMSGID(RMP0430 *LIBL/QMFOKON 26)
     A  27                                  ERRMSGID(RMP0440 *LIBL/QMFOKON 27)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                 13  2'Prosjekt type  . . . . .'
     A            C2PTY     R        B 13 27REFFLD(RP1PTY)
     A N60                                  COLOR(YLW)
     A  60                                  COLOR(RED)
     A  60                                  DSPATR(PC)
     A                                      OVRDTA
     A  35                                  ERRMSGID(RMP0470 *LIBL/QMFOKON 35)
     A  30                                  DSPATR(PR)
     A                                 13 38'(I=Intern, K=Kunde)'
     A                                 17  2'Status . . . . . . . . .'
     A            C2STS     R        B 17 27REFFLD(RP1STS)
     A N61                                  COLOR(YLW)
     A  61                                  COLOR(RED)
     A  61                                  DSPATR(PC)
     A  36                                  ERRMSGID(RMP0480 *LIBL/QMFOKON 36)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                 17 38'(A=Avsluttet)'
     A                                 18  2'Bruk Underpr.Aktivitet .'
     A            C2RUP     R        B 18 27REFFLD(RP1RUP)
     A N62                                  COLOR(YLW)
     A  62                                  COLOR(RED)
     A  62                                  DSPATR(PC)
     A  38                                  ERRMSGID(RMP0500 *LIBL/QMFOKON 38)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A            C2RAK     R        B 18 30REFFLD(RP1RAK)
     A N63                                  COLOR(YLW)
     A  63                                  COLOR(RED)
     A  63                                  DSPATR(PC)
     A  39                                  ERRMSGID(RMP0510 *LIBL/QMFOKON 39)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                 18 38'(J=Ja)'
     A                                 20  2'Endret dato. . . . . . . . .'
     A            C2EDAT         6Y 0O 20 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A            C2EUSR    R        O 20 46REFFLD(RP1EAV)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake                     -
     A                                                                         -
     A                                                '
     A                                      COLOR(BLU)
     A                                 20 42'Av:'
     A                                 14  2'Kundens referanse. . . .'
     A                                 15  2'   Telefon . . . . . . .'
     A                                 16  2'   ePost . . . . . . . .'
     A            C2KRF     R        B 14 27REFFLD(RP1TXT)
     A                                      CHECK(LC)
     A  30                                  DSPATR(PR)
     A  23                                  ERRMSGID(RMP0400 *LIBL/QMFOKON 23)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            C2TLF     R        B 15 27REFFLD(RP1TXT)
     A                                      CHECK(LC)
     A  30                                  DSPATR(PR)
     A  23                                  ERRMSGID(RMP0400 *LIBL/QMFOKON 23)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            C2EPO         50A  B 16 27CHECK(LC)
     A  30                                  DSPATR(PR)
     A  23                                  ERRMSGID(RMP0400 *LIBL/QMFOKON 23)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A            C2HEAD        15A  O  5 61COLOR(RED)
     A                                      OVRDTA
     A*                                16 34'(J/N)'
     A*                                17 34'(J/N)'
6.30 A**                               24 43'F8=I ordre/bestilling'
6.30 A**                                    COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20130215  111700  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette prosjekt   '
     A                                      DSPATR(RI)
     A                                  4  2'Prosjekt . . . . .'
     A            D1PROS         6   O  4 21
     A            D1UPRO         6   O  4 28
     A            D1AKTI         6   O  4 35
     A                                  5  2'Bruker . . . . . .'
     A            D1USER        10   O  5 21
     A                                  6  2'Beskrivelse. . . .'
     A            RP1TXT    R        O  6 21
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20130215  111700  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Prosjekt . . . . .'
     A            K1PROS         6   B  4 21
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            K1UPRO         6   B  4 28
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            K1AKTI         6   B  4 35
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  8  2'Prosjekt . . . . .'
     A            D_PPRO         6   O  8 21OVRDTA
     A            D_UUPR         6   O  8 28OVRDTA
     A            D_AAKT         6   O  8 35OVRDTA
     A                                  9  2'Beskrivelse. . . .'
     A            RP1TXT    R        O  9 21OVRDTA
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R CCMSG
     A*%%TS  SD  20130218  084604  SST620      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 8 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Feilmelding:               '
     A            CCMSG1        30   O  4  1
     A            CCMSG2        30   O  5  1
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C3BLD
     A*%%TS  SD  20151123  151832  ASP_C07     REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 13 56)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_AFLD        10A  H
     A            W_ARCD        10A  H
     A                                  2  2'Valg for utskrift.'
     A                                  4  2'Prosjekt(fra). . .'
     A            C3FRAP    R        B  4 21REFFLD(RP1PRO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      DSPATR(PC)
     A                                  4 29'Ev.til'
     A            C3TILP    R        B  4 36REFFLD(RP1PRO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Denne Periode(fra)'
     A            C3FPER    R        B  5 21REFFLD(RP1PRO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A            C3TPER    R        B  5 36REFFLD(RP1PRO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                  5 29'Ev.til'
     A                                  5 43'(ååååmm)'
     A                                  6  2'Avdeling . . . . .'
     A            C3AVDE    R        B  6 21REFFLD(RP1AVD)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C3AVDX        25A  B  6 29COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Prosjektleder. . .'
     A            C3PROL         5Y 0B  7 21COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A            C3PROX        25A  B  7 29COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Rapport. . . . . .'
     A            C3RAPP    R        B  8 21REFFLD(RPHRAP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      CHECK(RZ)
     A                                 12  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            C3RAPT        25A  B  8 29COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Hittil i år  . . .'
     A            C3HIT          1A  B  9 21COLOR(YLW)
     A                                      OVRDTA
     A                                  9 29'J dersom bare hittil i år  '
     A                                 10  2'Valg av prosjekt .'
     A            C3AKTIV        1A  B 10 21COLOR(YLW)
     A                                      OVRDTA
     A                                 10 29'blank = Alle, 1 = Aktive'
     A                                 11 29'2 = Avsl. 3 = Aktive m/post.'
