     A*%%TS  SD  20171019  124434  G0XEGSVSTR  REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : RP550D
     A* Beskrivelse . . : Spørring ordre / bestilling
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20171019  124434  G0XEGSVSTR  REL-V7R1M0  5770-WDS
     A            B1VALG         1Y 0B  8  2CHKMSGID(LM00010 *LIBL/QMFLAGR)
     A                                      VALUES(0 5)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A            B1NUMM         8Y 0O  8  4EDTCDE(Z)
     A            B1OTYP         2A  O  8 13
     A            B1VARE         8A  O  8 16
     A            B1LNAV        22   O  8 25
     A            B1DATO         6Y 0O  8 48EDTWRD('  .  .  ')
     A            B1ANTA         9Y 2O  8 57EDTCDE(M)
     A            B1SALG         9Y 2O  8 69EDTCDE(M)
     A            B1BTYP         1A  H
     A            B1KUND         6Y 0H
     A            B1KASS        12A  H
     A            B1REFN        12A  H
     A            B1STAT        15A  H
     A            B1SUFF         2Y 0H
     A            B1TIME         6Y 0H
     A            B1USER        10A  H
     A            B1BINR         8Y 0H
     A            B1AARR         4Y 0H
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20171019  124434  G0XEGSVSTR  REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CA03
     A                                      CF05
     A                                      CF10
     A                                      CF11
     A                                      CA12
     A                                      PUTOVR
     A                                      SFLCSRRRN(&W_CURN)
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_CURN         5S 0H
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Varer i ordre      '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  7  2'V O/B.nr   Ot Varenr.  Varetekst  -
     A                                                    Dato       Antall    -
     A                                         Verdi'
     A                                      COLOR(WHT)
     A                                  6  4'5=Detaljer'
     A                                      COLOR(BLU)
     A                                  4 46'Prosjekt :'
     A                                      COLOR(WHT)
     A            B2PROJ    R        O  4 60REFFLD(FOPROJ)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5 46'Underpro.:'
     A                                      COLOR(WHT)
     A                                  6 46'Aktivitet:'
     A                                      COLOR(WHT)
     A            B2UPRO    R        O  5 60REFFLD(FOPROJ)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2AKTI    R        O  6 60REFFLD(FOPROJ)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.20 A**6.25                           23  2'F3=Gå tilbake  F5=Forny  F10=Inng.+
     A          R B2CMD
     A*%%TS  SD  20150303  115154  BOF620      REL-V7R1M0  5770-WDS
6.20 A**6.25                           23  2'F3=Gå tilbake  F5=Forny  F10=Inng.+
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F5=Forny'
     A                                      COLOR(BLU)
