     A*%%TS  SD  20030203  143229  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RR100D
     A* Beskrivelse . . : Resultatrapport, vedlikehold rapporthode
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       160902 KOB  Nytt program
7.xx A*       120516 bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20020916  114339  KOB         REL-V5R1M0  5722-WDS
     A            B1VALG    R    1   B 10  2REFFLD(RÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(2 3 4 5 6 7 8 9 0)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      EDTCDE(Z)
     A            B10RAP    R        O 10  5REFFLD(RR0RAP)
     A                                      EDTCDE(Z)
     A            B10TXT    R        O 10  9REFFLD(RR0TXT)
     A            B10BFJ    R        O 10 58REFFLD(RR0BFJ)
     A            B10AVV    R        O 10 64REFFLD(RR0AVV)
     A            B10HEL    R        O 10 69REFFLD(RR0HEL)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20021020  114727  KOB         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CF08
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av resultatrapport'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  5  5'Rap'
7.xx A                                      COLOR(WHT)
7.xx A                                  5  9'Rapportnavn'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  2'2=Endre    3=Kopier    4=Slett    -
     A                                      5=Vis    6=Utskrift'
     A                                      COLOR(BLU)
7.xx A                                  8  2'7=Oppdater linjer      8=Beregn ra-
     A                                      pport    9=Skriv ikke def. linjer'
     A                                      COLOR(BLU)
7.xx A**                                7 56'Samm   Av-  Skr-'
7.xx A**                                    COLOR(WHT)
7.xx A                                  9  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  9  5'Rap'
7.xx A                                      COLOR(WHT)
7.xx A                                  9  9'Rapportnavn            '
7.xx A                                      COLOR(WHT)
7.xx A                                  9 56'Smlg'
7.xx A                                      COLOR(WHT)
7.xx A                                  9 63'Avv'
7.xx A                                      COLOR(WHT)
7.xx A                                  9 68'Skr'
     A                                      COLOR(WHT)
7.xx A            B20RAP    R        B  6  5REFFLD(RR0RAP)
7.xx A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RZ)
     A                                      OVRDTA
7.xx A            B20TXT    R        B  6  9REFFLD(RR0TXT)
7.xx A                                      COLOR(YLW)
     A          R B2CMD
     A*%%TS  SD  20030203  143229  KOB         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A                                 23 42'F8=Generering'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20020916  111412  KOB         REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av resultatrapport'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Rapport. . . . . . . . . . .'
     A            C10RAP    R        B  5 31REFFLD(RR0RAP)
     A  31                                  ERRMSGID(RM00010 *LIBL/QMFOKON 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20020916  111412  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  1'Resultatrapport finnes fra før'
     A                                      COLOR(BLU)
     A                                  6  1'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20020916  113845  KOB         REL-V5R1M0  5722-WDS
     A                                      CA02
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av resultatrapport'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Rapportnummer. . . . . . . .'
     A            C10RAP    R        O  5 31REFFLD(RR0RAP)
     A                                      EDTCDE(Z)
     A                                  7  2'Beskrivelse. . . . . . . . .'
     A            C20TXT    R        B  7 31REFFLD(RR0TXT)
     A  36 81                               ERRMSGID(RMH0200 *LIBL/QMFOKON 81)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A  30                                  DSPATR(PR)
     A                                      DSPATR(PC)
     A                                      OVRDTA
     A                                  9  2'Sammenlign mot . . . . . . .'
     A            C20BFJ    R        B  9 31REFFLD(RR0BFJ)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A                                      OVRATR
     A                                      COLOR(YLW)
     A                                  9 34'(B=Budsjett, F=Fjorår)'
     A                                 11  2'Type avvik . . . . . . . . .'
     A            C20AVV    R        B 11 31REFFLD(RFRFR/RR0AVV *LIBL/RFRF)
7.xx A                                      COLOR(YLW)
     A                                 11 34'(P=Prosent, D=Differanse i kroner)'
     A                                 13  2'Skriv beløp. . . . . . . . .'
     A            C20HEL    R        B 13 31REFFLD(RFRFR/RR0HEL *LIBL/RFRF)
7.xx A                                      COLOR(YLW)
     A                                 13 34'(H=Hele kroner, T=Hele tusen)'
     A                                 20  2'Sist endret dato . . . . . .'
     A            C2EDAT         6Y 0O 20 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 21  2'Endret av. . . . . . . . . .'
     A            C2EUSR    R        O 21 31REFFLD(RÅEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20020916  110714  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette rapport '
     A                                      DSPATR(RI)
     A                                  4  2'Rapport. . .'
     A            D10RAP    R        O  4 15REFFLD(RR0RAP)
     A  32                                  ERRMSGID(RMH0250 *LIBL/QMFOKON 32)
     A  33                                  ERRMSGID(RMH0260 *LIBL/QMFOKON 33)
     A                                  6  2'Beskrivelse.'
     A            RR0TXT    R   40   O  6 15REFFLD(RR0TXT)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20020916  110714  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Rapport. . .'
     A            K10RAP    R        B  4 15REFFLD(RR0RAP)
     A  31                                  ERRMSGID(RMA0010 *LIBL/QMFOKON 31)
     A  32                                  ERRMSGID(RMA0030 *LIBL/QMFOKON 33)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                  6  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  8  2'Rapport. . .'
     A            RR0RAP    R        O  8 15
     A                                  9  2'Beskrivelse.'
     A            RR0TXT    R   40   O  9 15REFFLD(RR0TXT)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
