     A*%%TS  SD  20020917  000841  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RR825D
     A* Beskrivelse . . : Resultatrapporter, utskrift konti - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       180802 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R A2BLD
     A*%%TS  SD  20020917  000841  KOB         REL-V5R1M0  5722-WDS
     A                                      CA01
     A                                      CA03
     A                                      KEEP
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Økonomi'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av resultatrapport - kont-
     A                                      i'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  7  8'Rapport nr. . . . . . . .:'
     A            A20RAP    R        B  7 35REFFLD(RFRFR/RR0RAP *LIBL/RFRF)
     A  60                                  ERRMSGID(RMH0150 *LIBL/QMFOKON 33)
     A                                      DSPATR(PC)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9  8'Regnskapsperiode. . . . .:'
     A            A2PPER    R        B  9 35REFFLD(RHPPER)
     A  34                                  ERRMSGID(RMH0040 *LIBL/QMFOKON 34)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                      TEXT('Regnskapsperiode')
     A                                      EDTCDE(Z)
     A                                 11  8'Regnskapsår . . . . . . .:'
     A            A2PRÅR    R        B 11 35REFFLD(RHPRÅR)
     A  34                                  ERRMSGID(RMH0050 *LIBL/QMFOKON 34)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A                                 13  8'Utskrift av konti som ikke er med -
     A                                      på rapporten'
     A                                      COLOR(RED)
     A                                 23  3'F3=Gå tilbake'
     A                                      COLOR(BLU)
