     A*%%TS  SD  20020917  001058  KOB         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RR634D
     A* Beskrivelse . . : Resultatrapporter, bygg - parameter
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       180802 KOB  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20020917  001058  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 50)
     A                                      CF03
     A                                      CA12
     A                                  2  2' Bygg resultatrapport '
     A                                      DSPATR(RI)
     A                                  5  2'Rapport . . . . .:'
     A            B10RAP    R        B  5 21REFFLD(RR0RAP)
     A                                  7  2'Type rapport. . .:'
     A            B1TYPE         1Y 0B  7 21TEXT('Type rapport')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1)
     A                                  7 25'(0=Balanserapport)'
     A                                  8 25'(1=Resultatrapport)'
     A                                 10  2'Linjer pr.. . . .:'
     A            B1LINJ         1Y 0B 10 21TEXT('Linjer pr. konto/kontogruppe')
     A                                      EDTCDE(Z)
     A                                      VALUES(0 1 2)
     A                                 10 25'(0=Konto)'
     A                                 11 25'(1=Kontogruppe)'
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
