      ****************************************************************
      *               --- RT001D ---
      * Totalkontoplan: Parameterinntasting
      *
      ****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RFRF)
     A                                      PRINT
     A          R B000
     A                                      TEXT('Heading')
     A                                      OVERLAY
     A            WFNAVN        30A  O  1  2DSPATR(HI)
     A                                  1 55'Dato'
     A                                      DSPATR(HI)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                      DSPATR(HI)
     A                                  2 20'Danne total kontoplan          '
     A                                      DSPATR(HI)
     A                                  2 55'Tid '
     A                                      DSPATR(HI)
     A                                  2 60TIME
     A                                      DSPATR(HI)
     A                                  2 70'RT001'
     A                                      DSPATR(HI)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      --------'
     A                                      DSPATR(HI)
     A            WUSER         10A  O  2  2DSPATR(HI)
     A          R B001
     A                                      CA01(01 'GODKJENN')
     A                                      CA12(12 'ANNULLER')
     A                                      SLNO(04)
     A                                      CLRL(*END)
     A                                 20  2'F12=Annuller'
     A                                      COLOR(BLU)
     A                                  2  2'Velg regnskapsår...:'
     A            XAAR           4N 0B  2 25
     A                                  4  2'Danner "total kontoplan" av:'
     A                                  5  7'Saldo    i år            '
     A                                  6  7'Saldo    i fjor          '
     A                                  7  7'Budsjett i år            '
     A                                  8  7'Anslag   i år            '
