     A*%%TS  SD  20050930  131233  HKO530      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  20050930  131233  HKO530      REL-V5R3M0  5722-WDS
     A                                      CA03(03)
     A                                      CA12(12)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Vareadministrasjon'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Konverting til VA versjon 5.40'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'VA databibliotek. .'
     A            DLIB          10A  B  5 22CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      COLOR(YLW)
     A                                  7  2'EVR databibliotek .'
     A            ELIB          10A  B  7 22CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      COLOR(YLW)
     A                                 10  2'Minimum EVR databibliotek må oppgi-
     A                                      s !'
     A                                 12  2'Dersom VA databibliotek ikke oppgi-
     A                                      s er det kun VA-tabeller i'
     A                                 13  2'EVR databibliotek som behandles.'
     A                                 15  2'Kun VA-tabeller som allerede finne-
     A                                      s i EVR databibliotek oppdateres.'
     A                                 16  2'Ingen nye tabeller opprettes i EVR-
     A                                       databiblioteket.'
     A                                 19  2'Jobben sendes som bakgrunnsjobb !'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
