     A*%%TS  SD  20070304  003809  KOB         REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20020613  095854  KRKRI       REL-V5R1M0  5722-WDS
     A            B1ENDR         1A  H
     A            B1VALG    R   +1   B 11  2REFFLD(SÅVALG)
     A N21                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A            B1KODE    R        O 11  5REFFLD(SBKODE)
     A            B1KOPI         1A  O 11 18
     A            B1VIS1        15A  O 11 20
     A            B1VIS2        15A  O 11 36
     A            B1VIS3        15A  O 11 52
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20030123  115740  MHA         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF03
     A                                      CF05
     A                                      CF06
     A                                      CF11
     A                                      CF12
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            SVRN01         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av budsjett-register'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Velg og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  4 41'60=Beregn budsjett utfra annet'
     A                                      COLOR(BLU)
     A                                  5  2'2=Endre'
     A                                      COLOR(BLU)
     A                                  5 11'3=Kopiere'
     A                                      COLOR(BLU)
     A                                  5 22'4=Slette'
     A                                      COLOR(BLU)
     A                                  5 32'5=Vise'
     A                                      COLOR(BLU)
     A                                  5 41'62=Importer budsjett fra fil'
     A                                      COLOR(BLU)
     A                                  6  2'6=Utskrift'
     A                                      COLOR(BLU)
     A                                  6 14'8=Legg inn budsjett'
     A                                      COLOR(BLU)
     A                                  6 41'78=Overfør budsjett til økonomi'
     A                                      COLOR(BLU)
     A                                  7 41'99=Kjør akkumumlering'
     A                                      COLOR(BLU)
     A                                  9  2'V  Budsjettkode   valg1           -
     A                                      valg2           valg3'
     A                                      COLOR(WHT)
     A            B2KODE        12Y 0B 10  5
     A  31                                  ERRMSGID(SM00010 *LIBL/QMFSTAT 31)
     A  32                                  ERRMSGID(SM00200 *LIBL/QMFSTAT 32)
     A  33                                  ERRMSGID(SM00210 *LIBL/QMFSTAT 33)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      EDTWRD('            ')
     A          R B2CMD
     A*%%TS  SD  20020216  090530  KRKRI       REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F5=Forny'
     A                                      COLOR(BLU)
     A                                 23 27'F6=Opprette'
     A                                      COLOR(BLU)
     A                                 23 40'F11=Kjør akk. Alle'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20061030  223324  KOB         REL-V5R4M0  5722-WDS
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Registrering av budsjett-nivå'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4 65'Rekkefølge'
     A                                      COLOR(WHT)
     A                                  6  2'Angi rekkefølge ved å taste 1, 2 o-
     A                                      g 3'
     A                                      COLOR(GRN)
     A                                  7  2'Diverse'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7 23'Kundeopplysninger'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7 54'Vareopplysninger'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            C1SR11         1Y 0B  8  3COLOR(YLW)
     A                                      EDTWRD(' ')
     A                                  8  5'Pr. avdeling'
     A            C1SR21         1Y 0B  8 24COLOR(YLW)
     A                                      EDTWRD(' ')
     A                                  8 26'Pr. land'
     A            C1SR31         1Y 0B  8 55COLOR(YLW)
     A                                      EDTWRD(' ')
     A                                  8 57'Pr. overgruppe'
     A            C1SR12         1Y 0B  9  3COLOR(YLW)
     A                                      EDTWRD(' ')
     A                                  9  5'Pr. lager'
     A            C1SR22         1Y 0B  9 24COLOR(YLW)
     A                                      EDTWRD(' ')
     A                                  9 26'Pr. distrikt'
     A            C1SR32         1Y 0B  9 55COLOR(YLW)
     A                                      EDTWRD(' ')
     A                                  9 57'Pr. hovedgruppe'
     A            C1SR13         1Y 0B 10  3COLOR(YLW)
     A                                      EDTWRD(' ')
     A                                 10  5'Pr. leveringstype'
     A            C1SR23         1Y 0B 10 24COLOR(YLW)
     A                                      EDTWRD(' ')
     A                                 10 26'Pr. selger'
     A            C1SR33         1Y 0B 10 55COLOR(YLW)
     A                                      EDTWRD(' ')
     A                                 10 57'Pr. undergruppe'
     A            C1SR24         1Y 0B 11 24COLOR(YLW)
     A                                      EDTWRD(' ')
     A                                 11 26'Pr. kundekategori'
     A            C1SR34         1Y 0B 11 55COLOR(YLW)
     A                                      EDTWRD(' ')
     A                                 11 57'Pr. varenummer'
     A            C1SR25         1Y 0B 12 24COLOR(YLW)
     A                                      EDTWRD(' ')
     A                                 12 26'Pr. kundenr'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20020206  150634  KRKRI       REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      CF10
     A                                      CF12
     A                                      OVERLAY
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av budsjett-register'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            C2NYEN    R        O  4 65REFFLD(SÅNYEN)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A                                  5  2'Budsjettkode . . . . . . . :'
     A            C2KODE    R        O  5 31REFFLD(SBKODE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Kommentarer. . . . . . . . :'
     A            C2KOMM        30A  B  7 31OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                  9  2'Automatisk oppdatering fra :'
     A            C2AKOD    R        B  9 31REFFLD(SFRFR/SNAKOD *LIBL/SFRF)
     A                                      COLOR(YLW)
     A                                  9 47'(Budsjett kan ikke legges inn)'
     A                                 11  2'Kan endres . . . . . . . . :'
     A            C2ENDR    R        B 11 31REFFLD(SNENDR)
     A                                      COLOR(YLW)
     A                                 11 35'(N=Nei)'
     A                                 12  2'Oppdater akkumulering. . . :'
     A            C2AKKK    R        B 12 31REFFLD(SNAKKK)
     A                                      COLOR(YLW)
     A                                 12 35'(N=Nei)'
     A                                 15  2'Rekkefølge . . . . . . . . :'
     A            C2STX1        25A  O 15 31OVRDTA
     A                                      DSPATR(UL)
     A            C2STX2        25A  O 16 31OVRDTA
     A                                      DSPATR(UL)
     A            C2STX3        25A  O 17 31OVRDTA
     A                                      DSPATR(UL)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20061019  151723  KOB         REL-V5R4M0  5722-WDS
     A                                      WINDOW(S1WIN)
     A                                      CF12
     A                                  2  2' Sletting '
     A                                      DSPATR(RI)
     A                                  4  2'Budsjettkode. :'
     A            D1KODE    R        O  4 18REFFLD(SBKODE)
     A                                      DSPATR(UL)
     A                                  5  2'Tekst . . . . :'
     A            D1TEXT        30A  O  5 18DSPATR(UL)
     A                                  8  2'Budsjettår . .:'
     A            D1HHAA    R        B  8 18REFFLD(SFRFR/SBHHAA *LIBL/SFRF)
     A                                      COLOR(YLW)
     A                                  8 23'Versjon :'
     A            D1VERS    R        B  8 33REFFLD(SBVERS)
     A                                      COLOR(YLW)
     A                                  9  2'Akkumleringsår:'
     A            D1PAAR    R        B  9 18REFFLD(SFRFR/SAHHAA *LIBL/SFRF)
     A                                      COLOR(YLW)
     A                                  9 23'Versjon :'
     A            D1PERS    R        B  9 33REFFLD(SFRFR/SBVERS *LIBL/SFRF)
     A                                      COLOR(YLW)
     A                                 11  2'Budsjettkode .:'
     A            D1VALG    R        B 11 18REFFLD(SFRFR/SÅVALG *LIBL/SFRF)
     A                                      COLOR(YLW)
     A                                 11 24'(J=Ja)'
     A                                 12  2'Beløp/Antall .:'
     A            D1AABB    R        B 12 18REFFLD(SBAABB)
     A                                      COLOR(YLW)
     A                                      VALUES('A' 'B' 'K' 'R')
     A                                 12 24'(A=Antall, B=Beløp)'
     A                                 14  2'F12=Annuller'
     A                                      COLOR(BLU)
     A                                 13 24'(K=Kost, R=Rabatt)'
     A          R F0WIN
     A*%%TS  SD  20070304  003809  KOB         REL-V5R4M0  5722-WDS
     A                                      WINDOW(S1WIN)
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2'Vise opplysninger for :'
     A                                      COLOR(WHT)
     A            F0KODE    R        O  2 28REFFLD(SBKODE)
     A                                      COLOR(WHT)
     A                                  4  2'Budsjett-år. . . :'
     A            F0HHAA    R        B  4 21REFFLD(SBHHAA)
     A                                      COLOR(YLW)
     A                                      RANGE(1999 2050)
     A                                      OVRDTA
     A                                  6  2'Budsjett-versjon :'
     A            F0VERS    R        B  6 21REFFLD(SBVERS)
     A                                      COLOR(YLW)
     A                                  6 28'(O=Opprinnelig)'
     A                                  7 28'(M=Modifisert)'
     A                                  9  2'Antall/Beløp . . :'
     A            F0AABB    R        B  9 21REFFLD(SBAABB)
     A                                      COLOR(YLW)
     A                                      VALUES('A' 'B' 'K' 'R')
     A                                  9 28'(A=Antall)'
     A                                 10 28'(B=Beløp)'
     A                                 11 28'(K=Kost)'
     A                                 12 28'(R=Rabatt)'
     A                                 14  2'F12=Anuller '
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20061019  151723  KOB         REL-V5R4M0  5722-WDS
     A                                      WINDOW(S1WIN)
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2' Kopiering '
     A                                      DSPATR(RI)
     A                                  4  2'Budsjettkode. :'
     A            K2KODE    R        O  4 18REFFLD(SBKODE)
     A                                      DSPATR(UL)
     A                                  5  2'Tekst . . . . :'
     A            K1TEXT        30A  O  5 18DSPATR(UL)
     A                                  7  2'Fra budsjettår:'
     A            K1FHAA    R        B  7 18REFFLD(SBHHAA)
     A                                      COLOR(YLW)
     A                                  7 24'Versjon :'
     A            K1FERS    R        B  7 34REFFLD(SFRFR/SBVERS *LIBL/SFRF)
     A                                      COLOR(YLW)
     A                                  8  2'Til budsjettår:'
     A            K1THAA    R        B  8 18REFFLD(SBHHAA)
     A                                      COLOR(YLW)
     A                                  8 24'Versjon :'
     A            K1TERS    R        B  8 34REFFLD(SFRFR/SBVERS *LIBL/SFRF)
     A                                      COLOR(YLW)
     A                                 12  2'Beløp/Antall .:'
     A            K1AABB    R        B 12 18REFFLD(SBAABB)
     A                                      COLOR(YLW)
     A                                      VALUES('A' 'B' 'K' 'R')
     A                                 12 24'(A=Antall, B=Beløp)'
     A                                 13 24'(K=Kost, R=Rabatt)'
     A                                 14  2'F12=Annuller'
     A                                      COLOR(BLU)
     A          R P0WIN
     A*%%TS  SD  20061019  151723  KOB         REL-V5R4M0  5722-WDS
     A                                      WINDOW(S1WIN)
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2'Utskrift av budsjett for'
     A                                      COLOR(WHT)
     A            P0KODE    R        O  2 28REFFLD(SBKODE)
     A                                      COLOR(WHT)
     A                                  4  2'Budsjett-år. . . :'
     A            P0HHAA    R        B  4 21REFFLD(SBHHAA)
     A                                      COLOR(YLW)
     A                                      RANGE(1999 2050)
     A                                  6  2'Budsjett-versjon :'
     A            P0VERS    R        B  6 21REFFLD(SBVERS)
     A                                      COLOR(YLW)
     A                                  6 28'(O=Opprinnelig)'
     A                                  7 28'(M=Modifisert)'
     A                                  9  2'Antall/Beløp . . :'
     A            P0AABB    R        B  9 21REFFLD(SBAABB)
     A                                      COLOR(YLW)
     A                                      VALUES('A' 'B' 'K' 'R')
     A                                  9 28'(A=Antall)'
     A                                 10 28'(B=Beløp)'
     A                                 11 28'(K=Kost)'
     A                                 12 28'(R=Raatt)'
     A                                 14  2'F12=Anuller '
     A                                      COLOR(BLU)
     A          R R0WIN
     A*%%TS  SD  20061019  151723  KOB         REL-V5R4M0  5722-WDS
     A                                      WINDOW(S1WIN)
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2'Velg opplysninger for :'
     A                                      COLOR(WHT)
     A            R0KODE    R        O  2 28REFFLD(SBKODE)
     A                                      COLOR(WHT)
     A                                  4  2'Budsjett-år. . . :'
     A            R0HHAA    R        B  4 21REFFLD(SBHHAA)
     A                                      COLOR(YLW)
     A                                      RANGE(1999 2050)
     A                                  6  2'Budsjett-versjon :'
     A            R0VERS    R        B  6 21REFFLD(SBVERS)
     A                                      COLOR(YLW)
     A                                  6 28'(O=Opprinnelig)'
     A                                  7 28'(M=Modifisert)'
     A                                  9  2'Antall/Beløp . . :'
     A            R0AABB    R        B  9 21REFFLD(SBAABB)
     A                                      COLOR(YLW)
     A                                      VALUES('A' 'B')
     A                                  9 28'(A=Antall)'
     A                                 10 28'(B=Beløp)'
     A                                 11 28'(K=Kost)'
     A                                 12 28'(R=Rabatt)'
     A                                 14  2'F12=Anuller '
     A                                      COLOR(BLU)
     A          R T0WIN
     A*%%TS  SD  20061019  151723  KOB         REL-V5R4M0  5722-WDS
     A                                      WINDOW(S1WIN)
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2'Oppdater budsjett for :'
     A                                      COLOR(WHT)
     A            T0KODE    R        O  2 28REFFLD(SBKODE)
     A                                      COLOR(WHT)
     A                                  4  2'Budsjett-år. . . :'
     A            T0HHAA    R        B  4 21REFFLD(SBHHAA)
     A                                      COLOR(YLW)
     A                                      RANGE(1999 2050)
     A                                  6  2'Budsjett-versjon :'
     A            T0VERS    R        B  6 21REFFLD(SBVERS)
     A                                      COLOR(YLW)
     A                                  6 28'(O=Opprinnelig)'
     A                                  7 28'(M=Modifisert)'
     A                                  9  2'Antall/Beløp . . :'
     A            T0AABB    R        B  9 21REFFLD(SBAABB)
     A                                      COLOR(YLW)
     A                                      VALUES('A' 'B' 'K' 'R')
     A                                  9 28'(A=Antall)'
     A                                 10 28'(B=Beløp)'
     A                                 11 28'(K=Kost)'
     A                                 12 28'(R=Rabatt)'
     A                                 14  2'F12=Anuller '
     A                                      COLOR(BLU)
     A          R U0WIN
     A*%%TS  SD  20020211  145455  KRKRI       REL-V5R1M0  5722-WDS
     A                                      WINDOW(S1WIN)
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2'Ny akkumulering for   :'
     A                                      COLOR(WHT)
     A            U0KODE    R        O  2 28REFFLD(SBKODE)
     A                                      COLOR(WHT)
     A                                  4  2'År . . . . . . . :'
     A            U0HHAA    R        B  4 21REFFLD(SBHHAA)
     A                                      COLOR(YLW)
     A                                      RANGE(1999 2050)
     A                                 14  2'F12=Anuller '
     A                                      COLOR(BLU)
     A          R V0WIN
     A*%%TS  SD  20061019  151723  KOB         REL-V5R4M0  5722-WDS
     A                                      WINDOW(S1WIN)
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2'Importer budsjett for :'
     A                                      COLOR(WHT)
     A            V0KODE    R        O  2 28REFFLD(SBKODE)
     A                                      COLOR(WHT)
     A                                  4  2'Budsjett-år. . . :'
     A            V0HHAA    R        B  4 21REFFLD(SBHHAA)
     A                                      COLOR(YLW)
     A                                      RANGE(1999 2050)
     A                                  5  2'Budsjett-versjon :'
     A            V0VERS    R        B  5 21REFFLD(SBVERS)
     A                                      COLOR(YLW)
     A                                  5 28'(O=Opprinnelig)'
     A                                  6 28'(M=Modifisert)'
     A                                  8  2'Antall/Beløp . . :'
     A            V0AABB    R        B  8 21REFFLD(SBAABB)
     A                                      COLOR(YLW)
     A                                      VALUES('A' 'B' 'K' 'R')
     A                                  8 28'(A=Antall, B=Beløp)'
     A                                 11  2'Filnavn. . . . . :'
     A            V0FILE        10A  B 11 21COLOR(YLW)
     A                                 12  2'Bibliotek  . . . :'
     A            V0BIBL        10A  B 12 21COLOR(YLW)
     A                                 14  2'F12=Anuller '
     A                                      COLOR(BLU)
     A                                  9 28'(K=Kost, R=Rabatt)'
     A          R V1WIN
     A*%%TS  SD  20020816  093131  KRKRI       REL-V5R1M0  5722-WDS
     A                                      WINDOW(S1WIN)
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2'Overfør budsjett til økonomi for'
     A                                      COLOR(WHT)
     A            V1KODE    R        O  2 35REFFLD(SBKODE)
     A                                      COLOR(WHT)
     A                                  4  2'Budsjett-år. . . :'
     A            V1HHAA    R        B  4 21REFFLD(SBHHAA)
     A                                      COLOR(YLW)
     A                                      RANGE(1999 2050)
     A                                  5  2'Budsjett-versjon :'
     A            V1VERS    R        B  5 21REFFLD(SBVERS)
     A                                      COLOR(YLW)
     A                                  5 28'(O=Opprinnelig)'
     A                                  6 28'(M=Modifisert)'
     A                                 14  2'F12=Anuller '
     A                                      COLOR(BLU)
     A          R S1WIN
     A*%%TS  SD  19931028  171434  AMD         REL-V2R2M0  5738-PW1
     A                                      WINDOW(*DFT 15 50)
