     A*%%TS  SD  20061030  223836  KOB         REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20040201  232348  KOB         REL-V5R2M0  5722-WDS
     A            B1ENDR         1A  H
     A            B1AVDE    R        H      REFFLD(SCAVDE)
     A            B1LAGE    R        H      REFFLD(SCLAGE)
     A            B1OTYP    R        H      REFFLD(SCOTYP)
     A            B1LAND    R        H      REFFLD(SCLAND)
     A            B1DIST    R        H      REFFLD(SCDIST)
     A            B1SELG    R        H      REFFLD(SCSELG)
     A            B1LKAT    R        H      REFFLD(SCLKAT)
     A            B1LDOR    R        H      REFFLD(SCLDOR)
     A            B1OGRP    R        H      REFFLD(SCOGRP)
     A            B1HGRP    R        H      REFFLD(SCHGRP)
     A            B1UGRP    R        H      REFFLD(SCUGRP)
     A            B1VARE    R        H      REFFLD(SCVARE)
     A            B1VALG    R   +1   B 11  2REFFLD(SÅVALG)
     A N21                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A            B1VIS1        20A  O 11  5
     A            B1VIS2        20A  O 11 26
     A            B1VIS3        20A  O 11 47
     A            B1SUMB    R   +2   O 11 68REFFLD(SCBU01)
     A                                      EDTWRD('           ')
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20040201  232348  KOB         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF03
     A                                      CF05
     A                                      CF06
     A                                      CF12
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            SVRN01         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av budsjett-register'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Velg og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  4 65'År. .'
     A                                      COLOR(WHT)
     A            B2HHAA    R        O  4 76REFFLD(SCHHAA)
     A                                      COLOR(WHT)
     A                                      EDTWRD('    ')
     A                                  5  2'2=Endre'
     A                                      COLOR(BLU)
     A                                  5 11'4=Slette'
     A                                      COLOR(BLU)
     A                                  5 65'Versjon'
     A                                      COLOR(WHT)
     A            B2VERS    R        O  5 76REFFLD(SCVERS)
     A                                      COLOR(WHT)
     A            B2AABB         6A  O  6 65COLOR(WHT)
     A                                  9  2'V'
     A                                      COLOR(WHT)
     A            B2TXT1        20A  O  9  5COLOR(WHT)
     A            B2TXT2        20A  O  9 26COLOR(WHT)
     A            B2TXT3        20A  O  9 47COLOR(WHT)
     A                                  8 74'Total'
     A                                      COLOR(WHT)
     A            B2FIS1        15A  B 10  5
     A  31                                  ERRMSGID(SM00010 *LIBL/QMFSTAT 31)
     A  32                                  ERRMSGID(SM00200 *LIBL/QMFSTAT 32)
     A  33                                  ERRMSGID(SM00210 *LIBL/QMFSTAT 33)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  9 71'Budsjett'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20011125  135330  KRKRI       REL-V4R4M0  5769-PW1
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F5=Forny'
     A                                      COLOR(BLU)
     A                                 23 27'F6=Opprette'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20030123  115926  MHA         REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF09
     A                                      CF10
     A                                      CF12
     A                                      CF13
     A                                      CF24
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A                                      OVERLAY
     A                                      PUTOVR
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av budsjett-register'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            C2TXT1        15A  O  4  2OVRDTA
     A                                      COLOR(WHT)
     A            C2VIS1        15A  O  4 18OVRDTA
     A            C2NYEN    R        O  4 69REFFLD(SÅNYEN)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A            C2TXT2        15A  O  5  2OVRDTA
     A                                      COLOR(WHT)
     A            C2VIS2        15A  O  5 18OVRDTA
     A                                  5 35'Ford.nøkkel:'
     A            C2FNØK         2Y 0B  5 48EDTWRD('  ')
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A  31                                  ERRMSGID(RMI0040 *LIBL/QMFOKON 31)
     A  32                                  ERRMSGID(RMI0090 *LIBL/QMFOKON 32)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  5 52'Ford.metode'
     A            C2FMET         1Y 0B  5 69EDTWRD(' ')
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      VALUES(0 1 2 3 4 6 9)
     A                                      CHKMSGID(RMI0060 *LIBL/QMFOKON)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2TXT3        15A  O  6  2OVRDTA
     A                                      COLOR(WHT)
     A            C2VIS3        15A  O  6 18OVRDTA
     A                                  6 35'Periode. . :'
     A            C2RPER         2Y 0B  6 48EDTWRD('  ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHKMSGID(RMI0080 *LIBL/QMFOKON)
     A  33                                  ERRMSGID(RMI0100 *LIBL/QMFOKON 33)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      RANGE(0 13)
     A                                  6 52'Budsjett'
     A            C2AABB         6A  O  6 61OVRDTA
     A            C2TBEL         9Y 0B  6 69COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A  34                                  ERRMSGID(RMI0110 *LIBL/QMFOKON 34)
     A  35                                  ERRMSGID(RMI0120 *LIBL/QMFOKON 35)
     A                                      OVRATR
     A                                      EDTWRD('         ')
     A            C2HED1        15A  O  8  6COLOR(WHT)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A            C2HED2        15A  O  8 22COLOR(WHT)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A            C2HED3        15A  O  8 38COLOR(WHT)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A            C2HED4        15A  O  8 54COLOR(WHT)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A                                  8 73'Nøkkel'
     A                                      COLOR(WHT)
     A                                      DSPATR(RI)
     A                                  9  2'01'
     A            C2K101         9Y 0O  9 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K201         9Y 0O  9 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K301         9Y 0O  9 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K401    R        B  9 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2MP01    R        O  9 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A                                 10  2'02'
     A            C2K102         9Y 0O 10 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K202         9Y 0O 10 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K302         9Y 0O 10 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K402    R        B 10 57REFFLD(SCBU01)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2MP02    R        O 10 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A                                 11  2'03'
     A            C2K103         9Y 0O 11 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K203         9Y 0O 11 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K303         9Y 0O 11 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K403    R        B 11 57REFFLD(SCBU01)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2MP03    R        O 11 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A                                 12  2'04'
     A            C2K104         9Y 0O 12 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K204         9Y 0O 12 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K304         9Y 0O 12 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K404    R        B 12 57REFFLD(SCBU01)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2MP04    R        O 12 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A                                 13  2'05'
     A            C2K105         9Y 0O 13 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K205         9Y 0O 13 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K305         9Y 0O 13 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K405    R        B 13 57REFFLD(SCBU01)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2MP05    R        O 13 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A                                 14  2'06'
     A            C2K106         9Y 0O 14 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K206         9Y 0O 14 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K306         9Y 0O 14 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K406    R        B 14 57REFFLD(SCBU01)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2MP06    R        O 14 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A                                 15  2'07'
     A            C2K107         9Y 0O 15 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K207         9Y 0O 15 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K307         9Y 0O 15 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K407    R        B 15 57REFFLD(SCBU01)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2MP07    R        O 15 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A                                 16  2'08'
     A            C2K108         9Y 0O 16 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K208         9Y 0O 16 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K308         9Y 0O 16 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K408    R        B 16 57REFFLD(SCBU01)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2MP08    R        O 16 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A                                 17  2'09'
     A            C2K109         9Y 0O 17 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K209         9Y 0O 17 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K309         9Y 0O 17 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K409    R        B 17 57REFFLD(SCBU01)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2MP09    R        O 17 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A                                 18  2'10'
     A            C2K110         9Y 0O 18 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K210         9Y 0O 18 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K310         9Y 0O 18 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K410    R        B 18 57REFFLD(SCBU01)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2MP10    R        O 18 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A                                 19  2'11'
     A            C2K111         9Y 0O 19 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K211         9Y 0O 19 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K311         9Y 0O 19 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K411    R        B 19 57REFFLD(SCBU01)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2MP11    R        O 19 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A                                 20  2'12'
     A            C2K112         9Y 0O 20 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K212         9Y 0O 20 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K312         9Y 0O 20 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K412    R        B 20 57REFFLD(SCBU01)
     A                                      COLOR(YLW)
     A                                      EDTWRD('         ')
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A            C2MP12    R        O 20 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A                                 21  2'Sum'
     A            C2K114         9Y 0O 21 10EDTWRD('         ')
     A                                      OVRDTA
     A            C2K214         9Y 0O 21 26EDTWRD('         ')
     A                                      OVRDTA
     A            C2K314         9Y 0O 21 42EDTWRD('         ')
     A                                      OVRDTA
     A            C2K414         9Y 0O 21 57EDTWRD('         ')
     A                                      OVRDTA
     A            C2MPXF    R        O 21 74REFFLD(RFRFR/RAMP01 *LIBL/RFRF)
     A                                      EDTWRD('   , ')
     A                                      OVRDTA
     A            C2CMD1        18A  O 23 22COLOR(BLU)
     A                                      OVRDTA
     A            C2CMD2        18A  O 23 42COLOR(BLU)
     A                                      OVRDTA
     A            C2CMD3        18A  O 23 62COLOR(BLU)
     A                                      OVRDTA
     A            C2CMD4        18A  O 23  2COLOR(BLU)
     A                                      OVRDTA
     A          R D1WIN
     A*%%TS  SD  20011125  170251  KRKRI       REL-V4R4M0  5769-PW1
     A                                      WINDOW(S1WIN)
     A                                      CF12
     A                                  2  2' Slette post '
     A                                      DSPATR(RI)
     A                                  4  2'Budsjettkode. :'
     A            SCKODE    R        O  4 18REFFLD(SCKODE)
     A                                      DSPATR(UL)
     A                                  5  2'Tekst . . . . :'
     A            D1TEXT        30A  O  5 18DSPATR(UL)
     A                                 14  2'F12=Annuller'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20011125  170251  KRKRI       REL-V4R4M0  5769-PW1
     A                                      WINDOW(S1WIN)
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Budsjettkode. :'
     A            K1KODE    R        B  4 18REFFLD(SCKODE)
     A  31                                  ERRMSGID(SFA1010 *LIBL/QMFSTAT 31)
     A  33                                  ERRMSGID(SFA1030 *LIBL/QMFSTAT 33)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      DSPATR(MDT)
     A                                  5  2'Tekst . . . . :'
     A            K1TEXT        30A  B  5 18DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  7  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  9  2'Budsjettkode. :'
     A            SCKODE    R        O  9 18REFFLD(SCKODE)
     A                                      DSPATR(UL)
     A                                 14  2'F12=Annuller'
     A                                      COLOR(BLU)
     A          R M1BLD
     A*%%TS  SD  20050407  092832  KOB         REL-V5R2M0  5722-WDS
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av nivå-register'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Tast inn koder . . . '
     A                                  4 65'Budsjettering'
     A                                      COLOR(WHT)
     A                                  6  2'Diverse. . . . . . '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  6 23'Avdeling . . .'
     A N41                                  DSPATR(ND)
     A            M1AVDE    R        B  6 38REFFLD(SCAVDE)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A  71                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A N41                                  DSPATR(ND)
     A N41                                  DSPATR(PR)
     A                                  7 23'Lager  . . . .'
     A N42                                  DSPATR(ND)
     A            M1LAGE    R        B  7 38REFFLD(SCLAGE)
     A                                      COLOR(YLW)
     A  72                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A N42                                  DSPATR(ND)
     A N42                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                  8 23'Ordre-type . .'
     A N43                                  DSPATR(ND)
     A            M1OTYP    R        B  8 38REFFLD(SCOTYP)
     A                                      COLOR(YLW)
     A  73                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A N43                                  DSPATR(ND)
     A N43                                  DSPATR(PR)
     A                                 10  2'Lever.opplysninger:'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 10 23'Land . . . . .'
     A N44                                  DSPATR(ND)
     A            M1LAND    R        B 10 38REFFLD(SCLAND)
     A                                      COLOR(YLW)
     A  74                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A N44                                  DSPATR(ND)
     A N44                                  DSPATR(PR)
     A                                 11 23'Distrikt . . .'
     A N45                                  DSPATR(ND)
     A            M1DIST    R        B 11 38REFFLD(SCDIST)
     A                                      COLOR(YLW)
     A  75                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A N45                                  DSPATR(ND)
     A N45                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 12 23'Selger . . . .'
     A N46                                  DSPATR(ND)
     A            M1SELG    R        B 12 38REFFLD(SCSELG)
     A                                      COLOR(YLW)
     A  76                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A N46                                  DSPATR(ND)
     A N46                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 13 23'Lev. kategori.'
     A N47                                  DSPATR(ND)
     A            M1LKAT    R        B 13 38REFFLD(SCLKAT)
     A                                      COLOR(YLW)
     A  77                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A N47                                  DSPATR(ND)
     A N47                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 14 23'Leverandørnr. '
     A N48                                  DSPATR(ND)
     A            M1LDOR    R        B 14 38REFFLD(SCLDOR)
     A                                      COLOR(YLW)
     A  78                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A N48                                  DSPATR(ND)
     A N48                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 17  2'Vareopplysninger. .'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 17 23'Overgruppe . .'
     A N49                                  DSPATR(ND)
     A            M1OGRP    R        B 17 38REFFLD(SCOGRP)
     A                                      COLOR(YLW)
     A  79                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A N49                                  DSPATR(ND)
     A N49                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 18 23'Hovedgruppe. .'
     A N50                                  DSPATR(ND)
     A            M1HGRP    R        B 18 38REFFLD(SCHGRP)
     A                                      COLOR(YLW)
     A  80                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A N50                                  DSPATR(ND)
     A N50                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 19 23'Undergruppe. .'
     A N51                                  DSPATR(ND)
     A            M1UGRP    R        B 19 38REFFLD(SCUGRP)
     A                                      COLOR(YLW)
     A  81                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A N51                                  DSPATR(ND)
     A N51                                  DSPATR(PR)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 20 23'Varenummer . .'
     A N52                                  DSPATR(ND)
     A            M1VARE    R        B 20 38REFFLD(SCVARE)
     A                                      COLOR(YLW)
     A  82                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A N52                                  DSPATR(ND)
     A N52                                  DSPATR(PR)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R M2BLD
     A*%%TS  SD  20020211  111057  KRKRI       REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av nivå-register'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Tast inn koder . . . '
     A                                  4 65'Budsjettering'
     A                                      COLOR(WHT)
     A                                  6  5'Overgruppe'
     A                                  6 17'Hovedgruppe'
     A                                  6 30'Undergruppe'
     A            M2OGRP    R        B  7  8REFFLD(SCOGRP)
     A                                      COLOR(YLW)
     A  79                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A            M2HGRP    R        B  7 20REFFLD(SCHGRP)
     A                                      COLOR(YLW)
     A  80                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A            M2UGRP    R        B  7 34REFFLD(SCUGRP)
     A                                      COLOR(YLW)
     A  81                                  ERRMSGID(FMA0140 *LIBL/QMFOFAX 71)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A* Bilde V1 - Vindu
     A* for valg av kolonner
     A*
     A          R V1WIN
     A*%%TS  SD  20020213  113924  KRKRI       REL-V5R1M0  5722-WDS
     A                                      WINDOW(&WACTLI &WACTPO 11 28)
     A                                      CF03
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A                                  2  2' Velg kolonne-innhold '
     A                                      COLOR(GRN)
     A                                      DSPATR(RI)
     A                                  4 14'Innhold'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4 23'År'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  5  2'Kolonne 1. .:'
     A            V1INH1    R        B  5 17REFFLD(SÅVALG)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      VALUES('S' 'B')
     A            V1AAR1    R        B  5 23REFFLD(B2HHAA *SRC)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  6  2'Kolonne 2. .:'
     A            V1INH2    R        B  6 17REFFLD(SÅVALG)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      VALUES('S' 'B')
     A            V1AAR2    R        B  6 23REFFLD(B2HHAA *SRC)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  7  2'Kolonne 3. .:'
     A            V1INH3    R        B  7 17REFFLD(SÅVALG)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      VALUES('S' 'B')
     A            V1AAR3    R        B  7 23REFFLD(B2HHAA *SRC)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  8  2'Kolonne 4. .:'
     A            V1INH4    R        B  8 17REFFLD(SÅVALG)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      VALUES('S' 'B')
     A            V1AAR4    R        B  8 23REFFLD(B2HHAA *SRC)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R S1WIN
     A*%%TS  SD  19931028  171434  AMD         REL-V2R2M0  5738-PW1
     A                                      WINDOW(*DFT 15 50)
