     A*%%TS  SD  20061030  223848  KOB         REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20020211  145455  KRKRI       REL-V5R1M0  5722-WDS
     A            B1ENDR         1A  H
     A            B1VALG    R   +1   B 11  2REFFLD(SÅVALG)
     A N21                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A            B1KODE    R        O 11  5REFFLD(SCKODE)
     A            B1KOPI         1A  O 11 18
     A            B1VIS1        15A  O 11 20
     A            B1VIS2        15A  O 11 36
     A            B1VIS3        15A  O 11 52
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20050407  000448  KOB         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF03
     A                                      CF05
     A                                      CF12
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            SVRN01         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise innkjøp/budsjett tall'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Velg og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  5  2'5=Vise'
     A                                      COLOR(BLU)
     A                                  9  2'V  Budsjettkode   valg1           -
     A                                      valg2           valg3'
     A                                      COLOR(WHT)
     A            B2KODE        12Y 0B 10  5
     A  31                                  ERRMSGID(SM00010 *LIBL/QMFSTAT 31)
     A  32                                  ERRMSGID(SM00200 *LIBL/QMFSTAT 32)
     A  33                                  ERRMSGID(SM00210 *LIBL/QMFSTAT 33)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      EDTWRD('            ')
     A          R B2CMD
     A*%%TS  SD  20020213  124953  KRKRI       REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F5=Forny'
     A                                      COLOR(BLU)
     A          R F0WIN
     A*%%TS  SD  20061019  154533  KOB         REL-V5R4M0  5722-WDS
     A                                      WINDOW(S1WIN)
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2'Vise opplysninger for :'
     A                                      COLOR(WHT)
     A            F0KODE    R        O  2 28REFFLD(SCKODE)
     A                                      COLOR(WHT)
     A                                  4  2'Budsjett-år. . . :'
     A            F0HHAA    R        B  4 21REFFLD(SCHHAA)
     A                                      COLOR(YLW)
     A                                      RANGE(1999 2050)
     A                                  6  2'Budsjett-versjon :'
     A            F0VERS    R        B  6 21REFFLD(SCVERS)
     A                                      COLOR(YLW)
     A                                  6 28'(O=Opprinnelig)'
     A                                  7 28'(M=Modifisert)'
     A                                  9  2'Antall/Beløp . . :'
     A            F0AABB    R        B  9 21REFFLD(SCAABB)
     A                                      COLOR(YLW)
     A                                      VALUES('A' 'B' 'K' 'R')
     A                                  9 28'(A=Antall)'
     A                                 10 28'(B=Beløp)'
     A                                 11 28'(K=Kost)'
     A                                 12 28'(R=Rabatt)'
     A                                 14  2'F12=Anuller '
     A                                      COLOR(BLU)
     A          R S1WIN
     A*%%TS  SD  19931028  171434  AMD         REL-V2R2M0  5738-PW1
     A                                      WINDOW(*DFT 15 50)
