     A*%%TS  SD  20061030  223906  KOB         REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20040201  093457  KOB         REL-V5R2M0  5722-WDS
     A            B1ENDR         1A  H
     A            B1AVDE    R        H      REFFLD(SCAVDE)
     A            B1LAGE    R        H      REFFLD(SCLAGE)
     A            B1OTYP    R        H      REFFLD(SCOTYP)
     A            B1LAND    R        H      REFFLD(SCLAND)
     A            B1DIST    R        H      REFFLD(SCDIST)
     A            B1SELG    R        H      REFFLD(SCSELG)
     A            B1LKAT    R        H      REFFLD(SCLKAT)
     A            B1LDOR    R        H      REFFLD(SCLDOR)
     A            B1OGRP    R        H      REFFLD(SCOGRP)
     A            B1HGRP    R        H      REFFLD(SCHGRP)
     A            B1UGRP    R        H      REFFLD(SCUGRP)
     A            B1VARE    R        H      REFFLD(SCVARE)
     A            B1VALG    R   +1   B 11  2REFFLD(SÅVALG)
     A N21                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A            B1VIS1        20A  O 11  5
     A            B1VIS2        20A  O 11 26
     A            B1VIS3        20A  O 11 47
     A            B1SUMB    R   +2   O 11 68REFFLD(SCBU01)
     A                                      EDTWRD('           ')
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20040201  093830  KOB         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF03
     A                                      CF05
     A                                      CF12
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            SVRN01         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise salg/budsjett-informasjon'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Velg og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  4 65'År. .'
     A                                      COLOR(WHT)
     A            B2HHAA    R        O  4 76REFFLD(SCHHAA)
     A                                      COLOR(WHT)
     A                                      EDTWRD('    ')
     A                                  5  2'5=Vise'
     A                                      COLOR(BLU)
     A                                  5 65'Versjon'
     A                                      COLOR(WHT)
     A            B2VERS    R        O  5 76REFFLD(SCVERS)
     A                                      COLOR(WHT)
     A            B2AABB         6A  O  6 65COLOR(WHT)
     A                                  9  2'V'
     A                                      COLOR(WHT)
     A            B2TXT1        20A  O  9  5COLOR(WHT)
     A            B2TXT2        15A  O  9 26COLOR(WHT)
     A            B2TXT3        15A  O  9 47COLOR(WHT)
     A                                  9 74'Total'
     A                                      COLOR(WHT)
     A            B2FIS1        15A  B 10  5
     A  31                                  ERRMSGID(SM00010 *LIBL/QMFSTAT 31)
     A  32                                  ERRMSGID(SM00200 *LIBL/QMFSTAT 32)
     A  33                                  ERRMSGID(SM00210 *LIBL/QMFSTAT 33)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20020213  135824  KRKRI       REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 17'F5=Forny'
     A                                      COLOR(BLU)
     A          R C5BLD
     A*%%TS  SD  20040201  011321  KOB         REL-V5R2M0  5722-WDS
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF09
     A                                      CF10
     A                                      CF12
     A                                      CF13
     A                                      CF24
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A                                      OVERLAY
     A                                      PUTOVR
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise salg/budsjett tall'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            C5TXT1        15A  O  4  2OVRDTA
     A                                      COLOR(WHT)
     A            C5VIS1        20A  O  4 18OVRDTA
     A            C5TXT2        15A  O  5  2OVRDTA
     A                                      COLOR(WHT)
     A            C5VIS2        20A  O  5 18OVRDTA
     A            C5TXT3        15A  O  6  2OVRDTA
     A                                      COLOR(WHT)
     A            C5VIS3        20A  O  6 18OVRDTA
     A            C5HED1        15A  O  8  6COLOR(WHT)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A            C5HED2        15A  O  8 22COLOR(WHT)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A            C5HED3        15A  O  8 38COLOR(WHT)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A            C5HED4        15A  O  8 54COLOR(WHT)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A                                  8 73'  %   '
     A                                      COLOR(WHT)
     A                                      DSPATR(RI)
     A                                  9  2'01'
     A            C5K101         9Y 0O  9 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K201         9Y 0O  9 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K301         9Y 0O  9 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K401    R        O  9 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      OVRDTA
     A            C5MP01         5Y 2O  9 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A                                 10  2'02'
     A            C5K102         9Y 0O 10 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K202         9Y 0O 10 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K302         9Y 0O 10 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K402    R        O 10 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      OVRDTA
     A            C5MP02         5Y 2O 10 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A                                 11  2'03'
     A            C5K103         9Y 0O 11 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K203         9Y 0O 11 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K303         9Y 0O 11 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K403    R        O 11 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      OVRDTA
     A            C5MP03         5Y 2O 11 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A                                 12  2'04'
     A            C5K104         9Y 0O 12 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K204         9Y 0O 12 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K304         9Y 0O 12 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K404    R        O 12 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      OVRDTA
     A            C5MP04         5Y 2O 12 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A                                 13  2'05'
     A            C5K105         9Y 0O 13 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K205         9Y 0O 13 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K305         9Y 0O 13 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K405    R        O 13 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      OVRDTA
     A            C5MP05         5Y 2O 13 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A                                 14  2'06'
     A            C5K106         9Y 0O 14 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K206         9Y 0O 14 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K306         9Y 0O 14 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K406    R        O 14 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      OVRDTA
     A            C5MP06         5Y 2O 14 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A                                 15  2'07'
     A            C5K107         9Y 0O 15 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K207         9Y 0O 15 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K307         9Y 0O 15 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K407    R        O 15 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      OVRDTA
     A            C5MP07         5Y 2O 15 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A                                 16  2'08'
     A            C5K108         9Y 0O 16 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K208         9Y 0O 16 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K308         9Y 0O 16 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K408    R        O 16 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      OVRDTA
     A            C5MP08         5Y 2O 16 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A                                 17  2'09'
     A            C5K109         9Y 0O 17 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K209         9Y 0O 17 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K309         9Y 0O 17 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K409    R        O 17 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      OVRDTA
     A            C5MP09         5Y 2O 17 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A                                 18  2'10'
     A            C5K110         9Y 0O 18 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K210         9Y 0O 18 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K310         9Y 0O 18 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K410    R        O 18 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      OVRDTA
     A            C5MP10         5Y 2O 18 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A                                 19  2'11'
     A            C5K111         9Y 0O 19 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K211         9Y 0O 19 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K311         9Y 0O 19 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K411    R        O 19 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      OVRDTA
     A            C5MP11         5Y 2O 19 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A                                 20  2'12'
     A            C5K112         9Y 0O 20 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K212         9Y 0O 20 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K312         9Y 0O 20 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K412    R        O 20 57REFFLD(SCBU01)
     A                                      EDTWRD('         ')
     A                                      OVRDTA
     A            C5MP12         5Y 2O 20 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A                                 21  2'Sum'
     A            C5K114         9Y 0O 21 10EDTWRD('         ')
     A                                      OVRDTA
     A            C5K214         9Y 0O 21 26EDTWRD('         ')
     A                                      OVRDTA
     A            C5K314         9Y 0O 21 42EDTWRD('         ')
     A                                      OVRDTA
     A            C5K414         9Y 0O 21 57EDTWRD('         ')
     A                                      OVRDTA
     A            C5MPXF         5Y 2O 21 73EDTWRD('   ,  -')
     A                                      OVRDTA
     A            C5CMD1        18A  O 23  2COLOR(BLU)
     A                                      OVRDTA
     A            C5CMD2        18A  O 23 22COLOR(BLU)
     A                                      OVRDTA
     A            C5CMD3        18A  O 23 42COLOR(BLU)
     A                                      OVRDTA
     A            C5CMD4        18A  O 23 62COLOR(BLU)
     A                                      OVRDTA
     A          R V1WIN
     A*%%TS  SD  20020213  113924  KRKRI       REL-V5R1M0  5722-WDS
     A                                      WINDOW(&WACTLI &WACTPO 11 28)
     A                                      CF03
     A            WACTLI         2S 0P
     A            WACTPO         3S 0P
     A                                  2  2' Velg kolonne-innhold '
     A                                      COLOR(GRN)
     A                                      DSPATR(RI)
     A                                  4 14'Innhold'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4 23'År'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  5  2'Kolonne 1. .:'
     A            V1INH1    R        B  5 17REFFLD(SÅVALG)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      VALUES('S' 'B')
     A            V1AAR1    R        B  5 23REFFLD(B2HHAA *SRC)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  6  2'Kolonne 2. .:'
     A            V1INH2    R        B  6 17REFFLD(SÅVALG)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      VALUES('S' 'B')
     A            V1AAR2    R        B  6 23REFFLD(B2HHAA *SRC)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  7  2'Kolonne 3. .:'
     A            V1INH3    R        B  7 17REFFLD(SÅVALG)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      VALUES('S' 'B')
     A            V1AAR3    R        B  7 23REFFLD(B2HHAA *SRC)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  8  2'Kolonne 4. .:'
     A            V1INH4    R        B  8 17REFFLD(SÅVALG)
     A                                      COLOR(YLW)
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A                                      VALUES('S' 'B')
     A            V1AAR4    R        B  8 23REFFLD(B2HHAA *SRC)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R S1WIN
     A*%%TS  SD  19931028  171434  AMD         REL-V2R2M0  5738-PW1
     A                                      WINDOW(*DFT 15 50)
