     A                                      DSPSIZ(27 132 *WIDE -
     A                                             24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A          R M1WIN
     A*%%TS  SD  19950201  142709  AMD         REL-V2R3M0  5738-PW1
     A                                      CA12
     A                                      KEEP
7.xx A                                       WINDOW(2 2 9 70)
     A                                  2  2' SEPA fil    '
     A                                      DSPATR(RI)
     A                                  4  2'Filsti/navn'
     A            M1FILE        50   B  4 14COLOR(WHT)
7.xx A                                  7  7'Trykk på OK knappen'
7.xx A                                      COLOR(WHT)
