     A*%%TS  SD  20051014  135822  HKO530      REL-V5R3M0  5722-WDS
     A*%%EC
7.xx A*     BSA  220116    Endringer relatert til ny GUI
     A*-------------------------------------------------------------------
7.00 A                                      DSPSIZ(24 80 *DS3 -
7.00 A                                             27 132 *WIDE)
7.00 A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20051014  135822  HKO530      REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 15 60)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  2  2' Spørring på salg '
     A                                      DSPATR(RI)
     A                                  4  2'År . . . . . . . .'
     A            B1PAAR    R        B  4 21REFFLD(SFPAAR)
     A  31                                  ERRMSGID(SM00100 *LIBL/QMFSTAT 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  6  2'Dato . . . . . . .'
     A            B1BIDA         6Y 0B  6 21COLOR(YLW)
     A  32                                  ERRMSGID(SM00050 *LIBL/QMFSTAT 32)
     A                                      CHECK(RB)
     A                                      EDTWRD('  .  .  ')
7.xx A                                  8  2'Kunde. . . . . . +'
     A            B1VKUN    R        B  8 21REFFLD(SFVKUN)
     A  33                                  ERRMSGID(SRK0020 *LIBL/QMFSTAT 33)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            B1KNAV        30A  O  8 30COLOR(YLW)
7.xx A                                  9  2'Kundeprosjekt. . +'
     A            B1KPRO    R        B  9 21REFFLD(SFKPRO)
     A  34                                  ERRMSGID(SFL0210 *LIBL/QMFSTAT 34)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            B1PNAV        30A  O  9 30COLOR(YLW)
     A                                 14  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
