     A*%%TS  SD  20040319  124752  KOB         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      CF03
     A                                      CF12
     A          R B1BLD
     A*%%TS  SD  20040319  124752  KOB         REL-V5R2M0  5722-WDS
     A                                      KEEP
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Utskrift av bruksrettytelser'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Utvalgskriterier:'
     A                                  7  2'Almenning. . . . . . . . . .'
     A            B1ALME         4Y 0B  7 31EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                  9  2'Regnskapsår. . . . . . . . .'
     A            B1PAAR         4Y 0B  9 31COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                 11 31'Fra     Til'
     A                                      COLOR(WHT)
     A                                 12  2'Fakturadato. . . . . . . . .'
     A            B1FDAT         6Y 0B 12 31COLOR(YLW)
     A                                      CHECK(RB)
     A  36                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 36)
     A  38                                  ERRMSGID(FM00055 *LIBL/QMFOFAK 38)
     A            B1TDAT         6Y 0B 12 39COLOR(YLW)
     A                                      CHECK(RB)
     A  37                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 37)
     A                                 14  2'Utskriftsvariant . . . . . .'
     A            B1VARI         1Y 0B 14 31COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      VALUES(1 2)
     A                                 14 39'(1 = Detaljert liste)'
     A                                 15 39'(2 = Sammendrag)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 18'F4=Spørring'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
