     A*%%TS  SD  20030702  153720  ASK         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/LFRF LFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20030702  153720  ASK         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise fakturalinje'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Fakturadato. . . . . .'
     A            B1FKDA         6Y 0O  5 25EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                  5 65'Ordretype. .'
     A            B1OTYP    R        O  5 78REFFLD(SLOTYP)
     A                                      COLOR(YLW)
     A                                  6  2'Fakturanummer. . . . .'
     A            B1BINR    R        O  6 25REFFLD(SLBINR)
     A                                      COLOR(YLW)
     A                                  6 65'Linjetype. .'
     A            B1LTYP    R        O  6 78REFFLD(SLLTYP)
     A                                      COLOR(YLW)
     A                                  7  2'Bestillingsnummer. . .'
     A            B1NUMM    R        O  7 25REFFLD(SLNUMM)
     A                                      COLOR(YLW)
     A                                  8  2'Ordrenummer  . . . . .'
     A            B1ORNR    R        O  8 25REFFLD(SLORNR)
     A                                      COLOR(YLW)
     A                                 10  2'Varenummer . . . . . .'
     A            B1VARE    R        O 10 25REFFLD(SLVARE)
     A                                      COLOR(YLW)
     A                                 11  2'Varetekst-1. . . . . .'
     A            B1TEK1    R        O 11 25REFFLD(SLTEK1)
     A                                      COLOR(YLW)
     A                                 12  2'Varetekst-2. . . . . .'
     A            B1TEK2    R        O 12 25REFFLD(SLTEK2)
     A                                      COLOR(YLW)
     A                                 13  2'Antall kjøpt . . . . .'
     A            B1ANTA    R        O 13 25REFFLD(SLANTA)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 14  2'Enhet. . . . . . . . .'
     A            B1ENH1    R        O 14 25REFFLD(SLENH1)
     A                                      COLOR(YLW)
     A                                 16  2'Kostpris . . . . . . .'
     A            B1KOST    R        O 16 25REFFLD(SLKOST)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 18  2'Rabatt-1 . . . . . . .'
     A            B1RKR1    R        O 18 25REFFLD(SLRKR1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            B1RAB1    R        O 18 40REFFLD(SLRAB1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 18 48'%'
     A                                 19  2'Rabatt-2 . . . . . . .'
     A            B1RKR2    R        O 19 25REFFLD(SLRKR2)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            B1RAB2    R        O 19 40REFFLD(SLRAB2)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 19 48'%'
     A                                 20  2'Ordrerabatt. . . . . .'
     A            B1RKRO    R        O 20 25REFFLD(SLRKRO)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 21  2'Innkjøpspris . . . . .'
     A            B1KJOP    R        O 21 25REFFLD(SLKJOP)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
