     A*%%TS  SD  20001029  145846  KOB         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19990518  195220  KAI         REL-V4R2M0  5769-PW1
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise kjøpsdetaljer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Leverandør . . . . . . .'
     A            B1VALN    R        O  5 27REFFLD(SIVALN)
     A                                      COLOR(YLW)
     A            B1NAVN        30A  O  5 42COLOR(YLW)
     A***                               6  2'Leveringsadresse . . . .'
     A***         B1LADR    R        O  6 27REFFLD(SILADR)
     A***                                   COLOR(YLW)
     A***         B1LNAV        30A  O  6 42COLOR(YLW)
     A                                  8  2'Vare . . . . . . . . . .'
     A            B1VARE    R   -7   O  8 27REFFLD(SIVARE)
     A                                      COLOR(YLW)
     A            B1TEK1    R        O  8 42REFFLD(SITEK1)
     A                                      COLOR(YLW)
     A                                 10  2'Ordretype. . . . . . . .'
     A            B1OTYP    R        O 10 27REFFLD(SIOTYP)
     A                                      COLOR(YLW)
     A                                 10 42'Fakturadato. . . . . . .'
     A            B1BIDA         6Y 0O 10 67EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                 11  2'Fakturanummer. . . . . .'
     A            B1BINR    R        O 11 27REFFLD(SIBINR)
     A                                      COLOR(YLW)
     A                                 11 42'Bestillingsdato. . . . .'
     A            B1ORDA         6Y 0O 11 67EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                 12  2'Bestillingsnummer. . . .'
     A            B1ORNR    R        O 12 27REFFLD(SIORNR)
     A                                      COLOR(YLW)
     A                                 12 42'Klokkeslett. . . . . . .'
     A            B1TIME         6Y 0O 12 67EDTWRD('  :  :  ')
     A                                      COLOR(YLW)
     A                                 13 42'Skjerm-id. . . . . . . .'
     A            B1WSID    R        O 13 67REFFLD(SIWSID)
     A                                      COLOR(YLW)
     A                                 15  2'Antall bestillt. . . . .'
     A            B1ANTA    R        O 15 27REFFLD(SIANTA)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 15 42'Kostpris . . . . . . . .'
     A            B1SUMK    R        O 15 67REFFLD(SISUMK)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 16  2'Enhet. . . . . . . . . .'
     A            B1OENH    R        O 16 27REFFLD(SIOENH)
     A                                      COLOR(YLW)
     A                                 16 42'Innkjøpspris (Brutto). .'
     A            B1SUMB    R        O 16 67REFFLD(SISUMB)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 18  2'Kampanje . . . . . . . .'
     A            B1KAMP    R        O 18 27REFFLD(SIKAMP)
     A                                      COLOR(YLW)
     A                                 17 42'Rabatt-1 . . . . . . . .'
     A            B1RAB1    R        O 17 67REFFLD(SIRAB1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 19  2'Priskode . . . . . . . .'
     A            B1PKOD    R        O 19 27REFFLD(SIPKOD)
     A                                      COLOR(YLW)
     A                                 18 42'Rabatt-2 . . . . . . . .'
     A            B1RAB2    R        O 18 67REFFLD(SIRAB2)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 19 42'Ordrerabatt. . . . . . .'
     A            B1RABO    R        O 19 67REFFLD(SIRABO)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 20 42'Innkjøpspris (Netto) . .'
     A            B1SUMN    R        O 20 67REFFLD(SISUMB)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
