     A*%%TS  SD  20050326  175604  KOB         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20050326  175604  KOB         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av innkjøpsstatistikk'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Leverandør . . . . . . .'
     A            B1VALN    R        O  5 27REFFLD(SIVALN)
     A                                      COLOR(YLW)
     A            B1LNAV        30A  O  5 34COLOR(YLW)
     A                                  7  2'Vare . . . . . . . . . .'
     A            B1VARE    R   -7   O  7 27REFFLD(SIVARE)
     A                                      COLOR(YLW)
     A            B1TEK1    R        O  7 36REFFLD(SITEK1)
     A                                      COLOR(YLW)
     A                                  9  2'Ordretype. . . . . . . .'
     A            B1OTYP    R        O  9 27REFFLD(SIOTYP)
     A                                      COLOR(YLW)
     A                                  9 42'Fakturadato. . . . . . .'
     A            B1BIDA         6Y 0O  9 67EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                 10  2'Bestillingsnr. . . . . .'
     A            B1BINR    R        O 10 27REFFLD(SIBINR)
     A                                      COLOR(YLW)
     A                                 10 42'Ordredato. . . . . . . .'
     A            B1ORDA         6Y 0O 10 67EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                 11  2'Ordrenummer. . . . . . .'
     A            B1ORNR    R        O 11 27REFFLD(SIORNR)
     A                                      COLOR(YLW)
     A                                 11 42'Klokkeslett. . . . . . .'
     A            B1TIME         6Y 0O 11 67EDTWRD('  :  :  ')
     A                                      COLOR(YLW)
     A                                 12  2'Nobbnummer . . . . . . .'
     A            B1NOBB    R        O 12 27REFFLD(SINOBB)
     A                                      COLOR(YLW)
     A                                 12 42'Skjerm-id. . . . . . . .'
     A            B1WSID    R        O 12 67REFFLD(SIWSID)
     A                                      COLOR(YLW)
     A                                 13  2'Enhet bestilt. . . . . .'
     A            B1OENH    R        O 13 27REFFLD(SIOENH)
     A                                      COLOR(YLW)
     A                                 13 42'Antall bestillt. . . . .'
     A            SIOANT    R        O 13 67REFFLD(SIOANT)
     A                                      COLOR(YLW)
     A                                 14  2'Lager. . . . . . . . . .'
     A            B1LAGE    R        O 14 27REFFLD(SILAGE)
     A                                      COLOR(YLW)
     A                                 14 42'Salgspris (opprinnlig) .'
     A            B1SUMO    R        O 14 67REFFLD(SISUMO)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 15 42'Salgspris (brutto) . . .'
     A            B1SUMB    R        O 15 67REFFLD(SISUMB)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 16  2'Kostpris . . . . . . . .'
     A            B1SUMK    R        B 16 27REFFLD(SISUMK)
     A                                      EDTCDE(M)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 16 42'Rabatt-1 . . . . . . . .'
     A            B1RAB1    R        O 16 67REFFLD(SIRAB1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 17  2'Kampanje . . . . . . . .'
     A            B1KAMP    R        B 17 27REFFLD(SIKAMP)
     A                                      COLOR(YLW)
     A                                 17 42'Rabatt-2 . . . . . . . .'
     A            B1RAB2    R        O 17 67REFFLD(SIRAB2)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 18  2'Avdeling . . . . . . . .'
     A            B1KAVD    R        B 18 27REFFLD(SIKAVD)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 18 42'Ordrerabatt. . . . . . .'
     A            B1RABO    R        O 18 67REFFLD(SIRABO)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 19  2'Selger . . . . . . . . .'
     A            B1SELG    R        B 19 27REFFLD(SISELG)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                 19 42'Salgspris (netto). . . .'
     A            B1SUMN    R        O 19 67REFFLD(SISUMB)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 19'F4=Spørring'
     A                                      COLOR(BLU)
