     A*%%TS  SD  20050326  120714  KOB         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A*
     A          R B1SFL                     SFL
     A*%%TS  SD  20050326  120303  KOB         REL-V5R2M0  5722-WDS
     A            B1LINE    R        H      REFFLD(SILINE)
     A            B1WSID    R        H      REFFLD(SIWSID)
     A            B1VALG    R        B  9  2REFFLD(SÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES('2' ' ')
     A                                      CHKMSGID(SM00010 *LIBL/QMFSTAT)
     A            B1PAAR    R        H      REFFLD(SIPAAR)
     A            B1VARE    R   -7   O  9  4REFFLD(SIVARE)
6.NU A            B1TEK1    R   -4   O  9 13REFFLD(SITEK1)
6.NU A            B1BIDA         6Y 0O  9 45EDTCDE(Z)
6.NU A            B1BINR    R        O  9 52REFFLD(SIBINR)
6.NU A            B1ORNR    R        O  9 61REFFLD(SIORNR)
     A            B1SUMK    R   -2   O  9 70REFFLD(SISUMK)
     A                                      EDTCDE(M)
     A*
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20050326  120303  KOB         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA01
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A                                      SFLCSRRRN(&WCURRN)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            WCURRN         5S 0H
     A            WVISRN         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av innkjøpsstatistikk'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Velg og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  4 65'År. :'
     A                                      COLOR(WHT)
     A            B2PAAR    R        B  4 71REFFLD(SIPAAR)
     A                                      COLOR(YLW)
     A                                  5  3'2=Endre'
     A                                      COLOR(BLU)
     A                                  7  2'V Vare     Varetekst              -
6.NU A                                               Dato   Bestnr   Ordre    K-
     A                                      ostpris'
     A                                      COLOR(WHT)
     A            B2VARE         8Y 0B  8  4COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
6.NU A            B2BINR    R        B  8 52REFFLD(SIBINR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A*
     A          R B2CMD
     A*%%TS  SD  19980615  155607  HKO         REL-V4R2M0  5769-PW1
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
