     A*%%TS  SD  20050326  181357  KOB         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A1BLD
     A*%%TS  SD  20050326  181357  KOB         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppdatere innkjøpsstatistikk'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Velg 1 for oppdatering:'
     A                                      COLOR(BLU)
     A                                  7 12'Faste opplysninger fra leverandørr-
     A                                      egisteret:'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            A1LKAT         1Y 0B  8 14COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      DFTVAL('0')
     A                                  8 16'Leverandørkategori'
     A            A1DIST         1Y 0B  9 14COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      DFTVAL('0')
     A                                  9 16'Distrikt'
     A            A1SELG         1Y 0B 10 14COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      DFTVAL('0')
     A                                 10 16'Selger'
     A            A1AVDE         1Y 0B 11 14COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      DFTVAL('0')
     A                                 11 16'Avdeling'
     A            A1LAGR         1Y 0B 12 14COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      DFTVAL('0')
     A                                 12 16'Lager'
     A                                 14 12'Faste opplysninger fra vareregiste-
     A                                      ret:'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            A1NOBB         1Y 0B 15 14COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      DFTVAL('0')
     A                                 15 16'Nobbnummer'
     A            A1NMOD         1Y 0B 16 14COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      DFTVAL('0')
     A                                 16 16'Nobb modulnummer'
     A            A1LDOR         1Y 0B 17 14COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      DFTVAL('0')
     A                                 17 16'Leverandørnummer'
     A            A1LVAR         1Y 0B 18 14COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      DFTVAL('0')
     A                                 18 16'Leverandørens varenummer'
     A            A1VGRP         1Y 0B 19 14COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      DFTVAL('0')
     A                                 19 16'Varegruppe'
     A            A1AGRP         1Y 0B 20 14COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      DFTVAL('0')
     A                                 20 16'Alternativ varegruppe'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B1WIN
     A*%%TS  SD  20031208  100652  KRKRI       REL-V5R1M0  5722-WDS
     A                                      WINDOW(5 40 10 30)
     A                                      CA04
     A                                      CA12
     A                                      KEEP
     A                                      PUTOVR
     A                                  2  1'Oppgi parametre for kjøringen:'
     A                                      COLOR(WHT)
     A                                  4  1'År . . . . . :'
     A            B1PAAR         4Y 0B  4 16COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  6  1'Fra periode. :'
     A            B1FPER         2Y 0B  6 16COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  7  1'Til periode. :'
     A            B1TPER         2Y 0B  7 16COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  9  1'F4=Jobbkø'
     A                                      COLOR(BLU)
     A                                  9 12'F12=Annuler'
     A                                      COLOR(BLU)
