     A*%%TS  SD  20230417  093219  SST700      REL-V7R3M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOKON
     A* Format. . . . . : RA509D
     A* Beskrivelse . . : Selgere, spørring
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *WIDE)
     A                                      REF(*LIBL/RFRF RFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20230417  093219  SST700      REL-V7R3M0  5770-WDS
     A            B1TEXT        60A  O  4  2COLOR(YLW)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20230417  093219  SST700      REL-V7R3M0  5770-WDS
     A  *DS3                                SFLSIZ(0015)
     A  *WIDE                               SFLSIZ(0015)
     A  *DS3                                SFLPAG(0014)
     A  *WIDE                               SFLPAG(0014)
     A  *DS3                                WINDOW(B2CMD)
     A  *WIDE                               WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            B2HEAD        40A  B  2  2COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20230414  161140  SST_800     REL-V7R3M0  5770-WDS
     A  *DS3                                WINDOW(*DFT 19 65)
     A  *WIDE                               WINDOW(*DFT 19 65)
     A                                 16  2'F3=Gå tilbake           '
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
