     A*%%TS  SD  20020312  222734  HKO         REL-V5R1M0  5722-WDS
     A*
     A*
     A*
     A*
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  19980128  124042  HKO         REL-V3R7M0  5716-PW1
     A                                      CA03
     A                                      CF04
     A                                      CF10
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A                                      PUTOVR
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av referansekunde'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      COLOR(WHT)
     A                                  5  5'Referansekundenummer. +'
     A            A1KUND         6S 0B  5 31
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            A1KTXT        30A  O  5 39
     A                                      OVRDTA
     A                                  7  5'Siste kjøredato . . . .'
     A            A1KDAT    R        B  7 31REFFLD(FÅODAT)
     A                                      COLOR(YLW)
     A                                  8  5'Siste kjøretidspunkt. .'
     A            A1KTID    R        B  8 31REFFLD(FÅOTIM)
     A                                      COLOR(YLW)
      *
     A                                 23  2'F3=Gå tilbake  F4=Spørring  -
     A                                      F10=Kjør direkte'
     A                                      COLOR(BLU)
