     A*%%TS  SD  19980615  202858  HKO         REL-V4R2M0  5769-PW1
     A*%%EC
7.xx A*          010216 bsa  Justeringer basert på ny GUI og regler
     A*-----------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19980615  202858  HKO         REL-V4R2M0  5769-PW1
     A*                                     WINDOW(*DFT 14 60)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2' Spørring på fakturaregister '
     A                                      COLOR(WHT)
7.xx A                                  2 38'SO500B1'
7.xx A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'År . . . . . . . .'
     A            B1AARR    R        B  5 21REFFLD(SOAARR)
     A  31                                  ERRMSGID(FMO0300 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A                                  7  2'Ordretype. . . . +'
     A            B1OTYP    R        B  7 21REFFLD(SOOTYP)
     A  32                                  ERRMSGID(VMA5020 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
7.xx A                                  9  2'Kunde. . . . . . +'
     A            B1KUND    R        B  9 21REFFLD(SOKUND)
     A  33                                  ERRMSGID(FRK0020 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A            B1KNAV        30A  O  9 29COLOR(YLW)
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
