     A*%%TS  SD  20051027  102541  AMD550      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20051027  102541  AMD550      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise ordrehode'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Ordrenummer.'
     A            B1NUMM    R        O  5 15REFFLD(SONUMM)
     A                                      COLOR(YLW)
6.NU A            B1SUFF    R        O  5 24REFFLD(SOSUFF)
     A                                      COLOR(YLW)
     A                                  5 38'Ordredato. .'
     A            B1BDAT         6Y 0O  5 51EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                  6  2'Ordretype. .'
     A            B1OTYP    R        O  6 15REFFLD(SOOTYP)
     A                                      COLOR(YLW)
     A                                  6 38'Lev.dato . .'
     A            B1LDAT         6Y 0O  6 51EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                  7 38'Fakturadato.'
     A            B1FKDA         6Y 0O  7 51EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                  8  2'Selger . . .'
     A            B1SELG    R        O  8 15REFFLD(SOSELG)
     A                                      COLOR(YLW)
     A                                  8 38'Vår ref. . .'
     A            B1VREF    R        O  8 51REFFLD(SOVREF)
     A                                      COLOR(YLW)
     A                                  9  2'Avdeling . .'
     A            B1AVDE    R        O  9 15REFFLD(SOAVDE)
     A                                      COLOR(YLW)
     A                                  9 38'Kundens ref.'
     A            B1DREF    R        O  9 51REFFLD(SODREF)
     A                                      COLOR(YLW)
     A                                 10  2'Prosjekt . .'
     A            B1PROJ    R        O 10 15REFFLD(SOPROJ)
     A                                      COLOR(YLW)
     A                                 10 38'Kundens rekv'
     A            B1REKV    R        O 10 51REFFLD(SOREKV)
     A                                      COLOR(YLW)
     A                                 11  2'Lager. . . .'
     A            B1LAGE    R        O 11 15REFFLD(SOLAGE)
     A                                      COLOR(YLW)
     A                                 11 38'Betalingsbet'
     A            B1BETB    R        O 11 51REFFLD(SOBETB)
     A                                      COLOR(YLW)
     A                                 13  2'Kunde:'
     A            B1KUND    R        O 13  9REFFLD(SOKUND)
     A                                      COLOR(YLW)
     A                                 13 38'Kundeprosjekt:'
     A            B1KPRO    R        O 13 53REFFLD(SOKPRO)
     A                                      COLOR(YLW)
     A            B1KNAV        30A  O 14  2COLOR(YLW)
     A            B1NAVN    R        O 14 38REFFLD(SONAVN)
     A                                      COLOR(YLW)
     A            B1KGAT        30A  O 15  2COLOR(YLW)
     A            B1ADR1    R        O 15 38REFFLD(SOADR1)
     A                                      COLOR(YLW)
     A            B1KAD2        30A  O 16  2COLOR(YLW)
     A            B1ADR2    R        O 16 38REFFLD(SOADR2)
     A                                      COLOR(YLW)
     A            B1KSTE        30A  O 17  2COLOR(YLW)
     A            B1STED    R        O 17 38REFFLD(SOSTED)
     A                                      COLOR(YLW)
     A                                 19  2'Total kost .'
     A            B1TOTK        11Y 2O 19 15COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 19 38'Speditør . .'
     A            B1SPED    R        O 19 51REFFLD(SOSPED)
     A                                      COLOR(YLW)
     A                                 20  2'Total rabatt'
     A            B1TOTR        11Y 2O 20 15COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 20 38'Forsendmåte.'
     A            B1LMAT    R        O 20 51REFFLD(SOLMAT)
     A                                      COLOR(YLW)
     A            B1LMTX    R        O 20 55REFFLD(SOLMTX)
     A                                      COLOR(YLW)
     A                                 21  2'Total salg .'
     A            B1TOTS        11Y 2O 21 15COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 21 38'Leveringsbet'
     A            B1LBET    R        O 21 51REFFLD(SOLBET)
     A                                      COLOR(YLW)
     A            B1LBT1        25A  O 21 55COLOR(YLW)
     A            B1LBT2        25A  O 22 55COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            B1LBT3        25A  O 23 55COLOR(YLW)
