     A*%%TS  SD  20080222  212908  KOB550      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20080222  212908  KOB550      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise fakturalinje'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Fakturadato. . . . . .'
     A            B1FKDA         6Y 0O  4 25EDTWRD('  .  .  ')
     A                                      COLOR(YLW)
     A                                  4 62'Ordretype . . .'
     A            B1OTYP    R        O  4 78REFFLD(SDOTYP)
     A                                      COLOR(YLW)
     A                                  5  2'Fakturanummer. . . . .'
     A            B1BINR    R        O  5 25REFFLD(SDBINR)
     A                                      COLOR(YLW)
     A                                  5 62'Linjetype . . .'
     A            B1LTYP    R        O  5 78REFFLD(SDLTYP)
     A                                      COLOR(YLW)
     A                                  6  2'Ordrenummer. . . . . .'
     A            B1NUMM    R        O  6 25REFFLD(SDNUMM)
     A                                      COLOR(YLW)
     A                                  6 62'Leveringstype .'
     A            B1LETY    R        O  6 79REFFLD(SDLETY)
     A                                      COLOR(YLW)
     A                                  7  2'Varenummer . . . . . .'
     A            B1VARE    R        O  7 25REFFLD(SDVARE)
     A                                      COLOR(YLW)
     A                                  7 62'Priskode. . . .'
     A            B1KPRI    R        O  7 79REFFLD(SDKPRI)
     A                                      COLOR(YLW)
     A                                  8  2'Varetekst-1. . . . . .'
     A            B1TEK1    R        O  8 25REFFLD(SDTEK1)
     A                                      COLOR(YLW)
     A                                  9  2'Varetekst-2. . . . . .'
     A            B1TEK2    R        O  9 25REFFLD(SDTEK2)
     A                                      COLOR(YLW)
     A                                 10  2'Antall bestillt. . . .'
     A            B1ANTA    R        O 10 25REFFLD(SDANTA)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            B1ENH1    R        O 10 40REFFLD(SDENH1)
     A                                      COLOR(YLW)
     A                                 11  2'Kostpris . . . . . . .'
     A            B1KOPR    R        O 11 27REFFLD(SDKOPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 12  2'Salgspris (brutto) . .'
     A            B1SAPR    R        O 12 27REFFLD(SDSAPR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 13  2'Rabatt-1 . . . . . . .'
     A            B1RKR1    R        O 13 25REFFLD(SDRKR1)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
6.30 A            B1RAB1    R        O 13 40REFFLD(SDRAB1)
6.30 A                                      COLOR(YLW)
6.30 A                                      EDTCDE(M)
6.30 A                                 13 48'%'
     A                                 14  2'Rabatt-2 . . . . . . .'
     A            B1RKR2    R        O 14 25REFFLD(SDRKR2)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
6.30 A            B1RAB2    R        O 14 40REFFLD(SDRAB2)
6.30 A                                      COLOR(YLW)
6.30 A                                      EDTCDE(M)
6.30 A                                 14 48'%'
     A                                 15  2'Ordrerabatt. . . . . .'
     A            B1RKRO    R        O 15 25REFFLD(SDRKRO)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                 16  2'Salgspris (netto). . .'
     A            B1SALG    R        O 16 25REFFLD(SDSALG)
     A                                      EDTCDE(M)
     A                                      COLOR(YLW)
     A                                 17  2'Prosjekt/Aktivitet . .'
     A            B1PROJ    R        O 17 25REFFLD(FFRFR/SDPROJ *LIBL/FFRF)
     A                                      COLOR(YLW)
     A            B1AKTI    R        O 17 32REFFLD(FFRFR/SDAKTI *LIBL/FFRF)
     A                                      COLOR(YLW)
     A                                 18  2'Kontohenvisning. . . .'
     A            B1KHEV    R        O 18 25REFFLD(SDKHEV)
     A                                      COLOR(YLW)
     A                                 19  2'Salgskonto . . . . . .'
     A            B1AVDE    R        O 19 25REFFLD(SDAVDE)
     A                                      COLOR(YLW)
     A            B1KONT    R        O 19 30REFFLD(SDKONT)
     A                                      COLOR(YLW)
     A            B1SPES    R        O 19 37REFFLD(SDSPES)
     A                                      COLOR(YLW)
     A                                 20  2'Kostnadskonto. . . . .'
     A            B1KAV3    R        O 20 25REFFLD(VAKAV3)
     A                                      COLOR(YLW)
     A            B1KKO3    R        O 20 30REFFLD(VAKKO3)
     A                                      COLOR(YLW)
     A            B1KSP3    R        O 20 37REFFLD(VAKSP3)
     A                                      COLOR(YLW)
     A                                 21  2'Innkjøpskonto. . . . .'
     A            B1KAV4    R        O 21 25REFFLD(VAKAV4)
     A                                      COLOR(YLW)
     A            B1KKO4    R        O 21 30REFFLD(VAKKO4)
     A                                      COLOR(YLW)
     A            B1KSP4    R        O 21 37REFFLD(VAKSP4)
     A                                      COLOR(YLW)
     A                                 22  2'Kost, motpost. . . . .'
     A            B1KAV8    R        O 22 25REFFLD(VAKAV8)
     A                                      COLOR(YLW)
     A            B1KKO8    R        O 22 30REFFLD(VAKKO8)
     A                                      COLOR(YLW)
     A            B1KSP8    R        O 22 37REFFLD(VAKSP8)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
