     A*%%TS  SD  20040329  220836  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASSTAT
     A* Format. . . . . : SP132D
     A* Beskrivelse . . : Vedlikehold av parameterfil-kundenummer (fra-til)
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  300916  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A          R B2BLD
     A*%%TS  SD  20040329  220836  KOB         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      CLRL(*ALL)
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av parameterfil'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Type:'
     A            B2TYPE    R        O  4  8REFFLD(SPTYPE)
     A            B2TEXT        30A  O  4 19
     A                                  4 65'Kundenummer'
     A                                      COLOR(WHT)
     A                                  7 30'Fra'
7.xx A                                  7 42'Til'
7.xx A                                  8  2'Kundenummer. . . . . . . .+'
     A            B2FKU1         6Y 0B  8 30COLOR(YLW)
     A  31                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                  8 40'+'
7.xx A            B2TKU1         6Y 0B  8 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                  9 28'+'
     A            B2FKU2         6Y 0B  9 30COLOR(YLW)
     A  32                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                  9 40'+'
7.xx A            B2TKU2         6Y 0B  9 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 10 28'+'
     A            B2FKU3         6Y 0B 10 30COLOR(YLW)
     A  33                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 10 40'+'
7.xx A            B2TKU3         6Y 0B 10 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 11 28'+'
     A            B2FKU4         6Y 0B 11 30COLOR(YLW)
     A  34                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 11 40'+'
7.xx A            B2TKU4         6Y 0B 11 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 12 28'+'
     A            B2FKU5         6Y 0B 12 30COLOR(YLW)
     A  35                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 12 40'+'
7.xx A            B2TKU5         6Y 0B 12 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 13 28'+'
     A            B2FKU6         6Y 0B 13 30COLOR(YLW)
     A  36                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 13 40'+'
7.xx A            B2TKU6         6Y 0B 13 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 14 28'+'
     A            B2FKU7         6Y 0B 14 30COLOR(YLW)
     A  37                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 14 40'+'
7.xx A            B2TKU7         6Y 0B 14 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 15 28'+'
     A            B2FKU8         6Y 0B 15 30COLOR(YLW)
     A  38                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 15 40'+'
7.xx A            B2TKU8         6Y 0B 15 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 16 28'+'
     A            B2FKU9         6Y 0B 16 30COLOR(YLW)
     A  39                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 16 40'+'
7.xx A            B2TKU9         6Y 0B 16 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 17 28'+'
     A            B2FKU10        6Y 0B 17 30COLOR(YLW)
     A  40                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 17 40'+'
7.xx A            B2TKU10        6Y 0B 17 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake  F4=Spørring'
     A                                      COLOR(BLU)
