     A*%%TS  SD  20040623  124445  KOB         REL-V5R2M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASSTAT
     A* Format. . . . . : SP133D
     A* Beskrivelse . . : Vedlikehold av parameterfil-kundenummerprosjekt
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  031016  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A          R B2BLD
     A*%%TS  SD  20040623  124445  KOB         REL-V5R2M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      CLRL(*ALL)
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av parameterfil'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Type:'
     A            B2TYPE    R        O  4  8REFFLD(SPTYPE)
     A            B2TEXT        30A  O  4 19
     A                                  4 65'Kundeprosjekt'
     A                                      COLOR(WHT)
     A                                  7 30'Fra'
7.xx A                                  7 42'Til'
7.xx A                                  8  2'Kundeprosjekt. . . . . . .+'
     A            B2FLA1         6Y 0B  8 30COLOR(YLW)
     A  31                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                  8 40'+'
7.xx A            B2TLA1         6Y 0B  8 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                  9 28'+'
     A            B2FLA2         6Y 0B  9 30COLOR(YLW)
     A  32                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                  9 40'+'
7.xx A            B2TLA2         6Y 0B  9 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 10 28'+'
     A            B2FLA3         6Y 0B 10 30COLOR(YLW)
     A  33                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 10 40'+'
7.xx A            B2TLA3         6Y 0B 10 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 11 28'+'
     A            B2FLA4         6Y 0B 11 30COLOR(YLW)
     A  34                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 11 40'+'
7.xx A            B2TLA4         6Y 0B 11 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 12 28'+'
     A            B2FLA5         6Y 0B 12 30COLOR(YLW)
     A  35                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 12 40'+'
7.xx A            B2TLA5         6Y 0B 12 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 13 28'+'
     A            B2FLA6         6Y 0B 13 30COLOR(YLW)
     A  36                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 13 40'+'
7.xx A            B2TLA6         6Y 0B 13 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 14 28'+'
     A            B2FLA7         6Y 0B 14 30COLOR(YLW)
     A  37                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 14 40'+'
7.xx A            B2TLA7         6Y 0B 14 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 15 28'+'
     A            B2FLA8         6Y 0B 15 30COLOR(YLW)
     A  38                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 15 40'+'
7.xx A            B2TLA8         6Y 0B 15 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 16 28'+'
     A            B2FLA9         6Y 0B 16 30COLOR(YLW)
     A  39                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 16 40'+'
7.xx A            B2TLA9         6Y 0B 16 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 17 28'+'
     A            B2FLA10        6Y 0B 17 30COLOR(YLW)
     A  40                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
7.xx A                                 17 40'+'
7.xx A            B2TLA10        6Y 0B 17 42COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
