     A*%%TS  SD  20050328  225329  KOB         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20010611  143948  KRKRI       REL-V4R4M0  5769-PW1
     A            B1ENDR         1A  H
7.xx A            B1VALG    R   +1   B  8  2REFFLD(SÅVALG)
     A N21                                  DSPATR(PC)
     A                                      COLOR(YLW)
7.xx A            B1TYPE    R        O  8  5REFFLD(SRTYPE)
7.xx A            B1KODE    R        O  8 16REFFLD(SRKODE)
7.xx A            B1VAL1    R        O  8 20REFFLD(SRVALG)
7.xx A            B1TEXT        30A  O  8 36
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20030123  102118  MHA         REL-V5R1M0  5722-WDS
7.xx A                                      SFLSIZ(0014)
7.xx A                                      SFLPAG(0013)
7.xx A                                      ROLLUP(10)
7.xx A                                      ROLLDOWN(11)
     A                                      CF03
     A                                      CF05
     A                                      CF06
     A                                      CF10
     A                                      CF12
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            SVRN01         4S 0H      SFLRCDNBR(CURSOR)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av parameterfil'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  6  2'2=Endre'
     A                                      COLOR(BLU)
7.xx A                                  6 10'3=Kopiere'
     A                                      COLOR(BLU)
7.xx A                                  6 20'4=Slette'
     A                                      COLOR(BLU)
7.xx A                                  6 29'5=Vise'
     A                                      COLOR(BLU)
7.xx A                                  6 36'6=Utskrift'
     A                                      COLOR(BLU)
7.xx A                                  6 47'7=Utvalg'
     A                                      COLOR(BLU)
7.xx A                                  6 56'8=Sortering'
     A                                      COLOR(BLU)
7.xx A                                  6 69'9=Summering'
     A                                      COLOR(BLU)
7.xx A                                  7  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  5'Type'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 16'Kd'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 20'Valg'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 36'Tekst'
7.xx A                                      COLOR(WHT)
7.xx A*                                 7  2'V  Type       Kd Valg            T-
7.xx A*                                     ekst'
7.xx A*                                     COLOR(WHT)
7.xx A                                  4  2'V . .'
7.xx A                                      COLOR(WHT)
7.xx A            B2VALG    R   +1   B  4  8REFFLD(SÅVALG)
     A                                      COLOR(YLW)
     A  21                                  DSPATR(PC)
7.xx A                                  4 12'Type . .'
7.xx A                                      COLOR(WHT)
7.xx A            B2TYPE    R        B  4 21REFFLD(SPTYPE)
     A  31                                  ERRMSGID(SM00010 *LIBL/QMFSTAT 31)
     A  32                                  ERRMSGID(SM00200 *LIBL/QMFSTAT 32)
     A  33                                  ERRMSGID(SM00210 *LIBL/QMFSTAT 33)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
7.xx A                                  4 36'Velg og trykk Enter.'
7.xx A                                      COLOR(BLU)
7.xx A          R B2CMD
     A*%%TS  SD  19980623  112218  HKO         REL-V4R2M0  5769-PW1
     A                                 23  2'F3=Gå tilbake  F5=Forny  F6=Oppre-
     A                                      tt  F10=Vis/ikke vis detaljer'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20010621  084822  KRKRI       REL-V4R4M0  5769-PW1
     A                                      CF03
     A                                      CF12
     A                                      CLRL(*ALL)
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av parameterfil'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Statistikktype . . . . . . :'
     A            C1TYPE    R        B  5 31REFFLD(SPTYPE)
     A                                      COLOR(YLW)
     A                                      COMP(NE '*USER')
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                  4 65'Statistikktype'
     A                                      COLOR(WHT)
     A          R C2BLD
     A*%%TS  SD  20010911  130613  KRKRI       REL-V4R4M0  5769-PW1
     A                                      CF03
     A                                      CF10
     A                                      CF12
     A                                      OVERLAY
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av parameterfil'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            C2NYEN    R        O  4 65REFFLD(SÅNYEN)
     A                                      DSPATR(RI)
     A                                      OVRDTA
     A                                  5  2'Statistikktype . . . . . . :'
     A            C1TYPE    R        O  5 31REFFLD(SPTYPE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Tekst. . . . . . . . . . . :'
     A            C2TEXT        30A  B  7 31
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                  9  2'Beholdes etter bruk. . . . :'
     A            C2SLET         1A  B  9 31OVRDTA
     A                                      COLOR(YLW)
     A                                  9 35'(N=Nei)'
     A                                 11  2'Kan endres . . . . . . . . :'
     A            C2ENDR         1A  B 11 31OVRDTA
     A                                      COLOR(YLW)
     A                                 11 35'(N=Nei)'
     A                                 13  2'Sorteringsrekkefølge . . . :'
     A            C2SRT1         2Y 0O 13 31OVRDTA
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A            C2STX1        25A  O 13 34OVRDTA
     A                                      DSPATR(UL)
     A            C2SRT2         2Y 0O 14 31OVRDTA
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A            C2STX2        25A  O 14 34OVRDTA
     A                                      DSPATR(UL)
     A            C2SRT3         2Y 0O 15 31OVRDTA
     A                                      DSPATR(UL)
     A                                      EDTCDE(Z)
     A            C2STX3        25A  O 15 34OVRDTA
     A                                      DSPATR(UL)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C3BLD
     A*%%TS  SD  20011207  154050  KRKRI       REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av parameterfil'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Type'
     A            C3TYPE    R        O  4  7REFFLD(SFRFR/SPTYPE *LIBL/SFRF)
     A            C3TEXT        30A  O  4 18TEXT('Tekst')
     A                                  4 65'Sortering'
     A                                      COLOR(WHT)
     A                                  6  2'Angi sorteringsrekkefølge ved å ta-
     A                                      ste 1, 2 og 3:'
     A                                      COLOR(GRN)
     A                                  7  2'Vareopplysninger'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7 33'Fra / til'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            C3SR11         1Y 0B  8  3COLOR(YLW)
     A  31                                  ERRMSGID(SMP1110 *LIBL/QMFSTAT 31)
     A                                      EDTWRD(' ')
7.xx A                                  8  5'(k)'
7.xx A                                  8  9'Pr. alt. hovedgruppe'
     A            C3SR31         1Y 0B  8 34COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                  8 36'(k)'
7.xx A                                  8 40'Pr. varenummer'
     A            C3SR12         1Y 0B  9  3COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                  9  5'(k)'
7.xx A                                  9  9'Pr. alt. undergruppe'
     A            C3SR32         1Y 0B  9 34COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                  9 36'(k)'
7.xx A                                  9 40'Pr. leverandørnr'
     A            C3SR13         1Y 0B 10  3COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 10  5'(k)'
7.xx A                                 10  9'Pr. rabattgruppe'
     A            C3SR14         1Y 0B 11  3COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 11  5'(k)'
7.xx A                                 11  9'Pr. overgruppe (Nobb)'
     A            C3SR41         1Y 0B 11 34COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 11 36'(k)'
7.xx A                                 11 40'Pr. periode'
     A            C3SR15         1Y 0B 12  3COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 12  5'(k)'
7.xx A                                 12  9'Pr. hovedgruppe (Nobb)'
     A            C3SR42         1Y 0B 12 34COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 12 36'(k)'
7.xx A                                 12 40'Pr. fakt.nr/kred.nr'
     A            C3SR16         1Y 0B 13  3COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 13  5'(k)'
7.xx A                                 13  9'Pr. undergruppe (Nobb)'
     A            C3SR43         1Y 0B 13 34COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 13 36'(k)'
7.xx A                                 13 40'Pr. fakturadato'
     A                                 15  3'Kundeopplysninger'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
7.xx A                                 15 33'Ordreopplysninger'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
7.xx A            C3SR21         1Y 0B 16  3COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 16  5'(k)'
7.xx A                                 16  9'Pr. leverandørkategori'
     A            C3SR51         1Y 0B 16 34COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 16 36'(k)'
7.xx A                                 16 40'Pr. ordre-type      '
7.xx A            C3SR22         1Y 0B 17  3COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 17  5'(k)'
7.xx A                                 17  9'Pr. rabatt-kategori'
     A            C3SR52         1Y 0B 17 34COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 17 36'(k)'
7.xx A                                 17 40'Pr. avdeling        '
7.xx A            C3SR23         1Y 0B 18  3COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 18  5'(k)'
7.xx A                                 18  9'Pr. distrikt'
     A            C3SR53         1Y 0B 18 34COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 18 36'(k)'
7.xx A                                 18 40'Pr. lager           '
7.xx A            C3SR24         1Y 0B 19  3COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 19  5'(k)'
7.xx A                                 19  9'Pr. selger'
     A            C3SR54         1Y 0B 19 34COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 19 36'(k)'
7.xx A                                 19 40'Pr. produktansvarlig'
7.xx A            C3SR25         1Y 0B 20  3COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 20  5'(k)'
7.xx A                                 20  9'Pr. land'
7.xx A            C3SR26         1Y 0B 21  3COLOR(YLW)
     A                                      EDTWRD(' ')
7.xx A                                 21  5'(k)'
     A                                 21  9'Pr. hovedgr-leverandørkat'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C4BLD
     A*%%TS  SD  20030123  134248  MHA         REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av parameterfil'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Type'
     A            C4TYPE    R        O  4  7REFFLD(SFRFR/SPTYPE *LIBL/SFRF)
     A            C4TEXT        30A  O  4 18TEXT('Tekst')
     A                                  4 65'Summering'
     A                                      COLOR(WHT)
     A                                  7  2'Oppgi spesifikasjonsgrad:'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9  2'Skriv summer pr.'
     A            C4SUM1        20A  O  9 19
     A                                  9 40'.'
     A            C4SPS1         1A  B  9 42COLOR(YLW)
     A                                  9 44'(N=Nei)'
     A                                  9 56'Sideskift'
     A            C4SSS1         1A  B  9 67COLOR(YLW)
     A                                  9 70'(J=Ja)'
     A                                 10  2'Skriv summer pr.'
     A            C4SUM2        20A  O 10 19
     A                                 10 40'.'
     A            C4SPS2         1A  B 10 42COLOR(YLW)
     A                                 10 44'(N=Nei)'
     A                                 10 56'Sideskift'
     A            C4SSS2         1A  B 10 67COLOR(YLW)
     A                                 10 70'(J=Ja)'
     A                                 11  2'Skriv summer pr.'
     A            C4SUM3        20A  O 11 19
     A                                 11 40'.'
     A            C4SPS3         1A  B 11 42COLOR(YLW)
     A                                 11 44'(N=Nei)'
     A                                 11 56'Sideskift'
     A            C4SSS3         1A  B 11 67COLOR(YLW)
     A                                 11 70'(J=Ja)'
     A                                 12  2'Skriv summer pr. Firma. . . . . . -
     A                                      . . .'
     A            C4SPS4         1A  B 12 42COLOR(YLW)
     A                                 12 44'(N=Nei)'
     A                                 14  2'Skriv linje under totaler . . . . -
     A                                      . . .'
     A            C4SPS7         1A  B 14 42COLOR(YLW)
     A                                 14 44'(N=Nei)'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C5BLD
     A*%%TS  SD  20011207  154050  KRKRI       REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A                                      OVERLAY
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av parameterfil'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Type'
     A            C5TYPE    R        O  4  7REFFLD(SFRFR/SPTYPE *LIBL/SFRF)
     A            C5TEXT        30A  O  4 18TEXT('Tekst')
     A                                  4 65'Utvalg'
     A                                      COLOR(WHT)
     A                                  6 12'Vareopplysninger'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  6 45'Fra / til'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7 12'11. Alt. hovedgruppe'
     A                                  7 45'31. Varenummer'
     A                                  8 12'12. Alt. undergruppe'
     A                                  8 45'32. Leverandør'
     A                                  9 12'13. Rabatt-gruppe'
     A                                 10 12'14. Overgruppe (Nobb)'
     A                                 10 45'41. Periode'
     A                                 11 12'15. Hovedgruppe (Nobb)'
     A                                 11 45'42. Fakt.nr/kred.nr.'
     A                                 12 12'16. Undergruppe (Nobb)'
     A                                 12 45'43. Fakturadato'
     A                                 13 45'44. Kampanje'
     A                                 14 12'Kundeopplysninger'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 15 12'21. Leverandørkategori'
     A                                 15 45'Diverse'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 16 12'22. Rabatt-kategori'
     A                                 16 45'51. Ordre-type'
     A                                 17 12'23. Distrikt'
     A                                 17 45'52. Avdeling'
     A                                 18 12'24. Selger'
     A                                 18 45'53. Lager'
     A                                 19 12'25. Land'
     A                                 19 45'54. Produktansvarlig'
     A                                 21  2'Velg nummer og trykk enter. . .:'
     A                                      COLOR(BLU)
     A            C5VALG         2D 0B 21 35CHECK(RB)
     A                                      OVRDTA
     A                                      CHECK(ER)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  19980622  122945  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(S1WIN)
     A                                      CF12
     A                                  2  2' Slette post '
     A                                      DSPATR(RI)
     A                                  4  2'Statistikktype:'
     A            SPTYPE    R        O  4 18REFFLD(SPTYPE)
     A                                      DSPATR(UL)
     A                                  5  2'Tekst . . . . :'
     A            D1TEXT        30A  O  5 18DSPATR(UL)
     A                                 14  2'F12=Annuller'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  19980622  122945  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(S1WIN)
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Statistikktype:'
     A            K1TYPE    R        B  4 18REFFLD(SPTYPE)
     A  31                                  ERRMSGID(SFA1010 *LIBL/QMFSTAT 31)
     A  33                                  ERRMSGID(SFA1030 *LIBL/QMFSTAT 33)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                      DSPATR(MDT)
     A                                  5  2'Tekst . . . . :'
     A            K1TEXT        30A  B  5 18DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  7  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  9  2'Statistikktype:'
     A            SPTYPE    R        O  9 18REFFLD(SPTYPE)
     A                                      DSPATR(UL)
     A                                 14  2'F12=Annuller'
     A                                      COLOR(BLU)
     A          R P0WIN
     A*%%TS  SD  20050328  225329  KOB         REL-V5R2M0  5722-WDS
     A                                      WINDOW(S1WIN)
     A                                      CF03
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2'Velg utskriftsvariant for'
     A                                      COLOR(WHT)
     A            P0TYPE    R        O  2 28REFFLD(SPTYPE)
     A                                      COLOR(WHT)
     A                                  4  2'Valg:'
     A            P0VALG         2A  B  4  9COLOR(YLW)
     A                                      VALUES('10' '11' '12' '21' '23' '33-
     A                                      ' '66' '  ')
     A                                  4 16'10=Innkjøpsstatistikk'
     A                                 14  2'F12=Anuller '
     A                                      COLOR(BLU)
     A                                  5 16'11=Mengdestatistikk - m3'
     A          R P1WIN
     A*%%TS  SD  19980625  235430  KOB         REL-V4R2M0  5769-PW1
     A                                      WINDOW(S1WIN)
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2'Oppgi parametre for kjøringen:'
     A                                      COLOR(WHT)
     A                                  4  2'Oppgi periode fra. . . .:'
     A            P1FMND         2Y 0B  4 28COLOR(YLW)
     A                                      EDTCDE(Z)
     A            P1FAAR         4Y 0B  4 31COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  4 37'(mmåååå)'
     A                                  6  2'Oppgi periode til. . . .:'
     A            P1TMND         2Y 0B  6 28COLOR(YLW)
     A                                      EDTCDE(Z)
     A            P1TAAR         4Y 0B  6 31COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  6 37'(mmåååå)'
     A                                 14  2'F12=Annuler'
     A                                      COLOR(BLU)
     A          R P2WIN
     A*%%TS  SD  19980718  124453  KOB         REL-V4R2M0  5769-PW1
     A                                      WINDOW(S1WIN)
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2'Oppgi parametre for kjøringen:'
     A                                      COLOR(WHT)
     A                                  4  2'Oppgi periode. . . . . .:'
     A            P2PMND         2Y 0B  4 28COLOR(YLW)
     A                                      EDTCDE(Z)
     A            P2PAAR         4Y 0B  4 31COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  4 37'(mmåååå)'
     A                                  6  2'Samenligninges med . . .:'
     A            P2SMLI         1A  B  6 28COLOR(YLW)
     A                                  6 37'(B=Budsjett)'
     A                                  7 37'(F=Fjorår)'
     A                                 14  2'F12=Anuller '
     A                                      COLOR(BLU)
     A          R P3WIN
     A*%%TS  SD  19980730  111401  KOB         REL-V4R2M0  5769-PW1
     A                                      WINDOW(S1WIN)
     A                                      CF12
     A                                      PUTOVR
     A                                  2  2'Oppgi parametre for kjøringen:'
     A                                      COLOR(WHT)
     A                                  4  2'Oppgi periode. . . . . .:'
     A            P3PMND         2Y 0B  4 28COLOR(YLW)
     A                                      EDTCDE(Z)
     A            P3PAAR         4Y 0B  4 31COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  4 37'(mmåååå)'
     A                                 14  2'F12=Anuller '
     A                                      COLOR(BLU)
     A          R S1WIN
     A*%%TS  SD  19931028  171434  AMD         REL-V2R2M0  5738-PW1
     A                                      WINDOW(*DFT 15 50)
