     A*%%TS  SD  20011207  134201  KRKRI       REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A          R B2BLD
     A*%%TS  SD  20011207  134201  KRKRI       REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CA04
     A                                      CA12
     A                                      CLRL(*ALL)
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av parameterfil'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Type:'
     A            B2TYPE    R        O  4  8REFFLD(SRTYPE)
     A            B2TEXT        30A  O  4 19
     A                                  4 65'Leverandørnr'
     A                                      COLOR(WHT)
     A                                  7 30'Fra'
     A                                  7 40'Til'
     A                                  8  2'Leverandørnummer . . . . .'
     A            B2FLE1         6Y 0B  8 30COLOR(YLW)
     A  31                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2TLE1         6Y 0B  8 40COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2FLE2         6Y 0B  9 30COLOR(YLW)
     A  32                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2TLE2         6Y 0B  9 40COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2FLE3         6Y 0B 10 30COLOR(YLW)
     A  33                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2TLE3         6Y 0B 10 40COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2FLE4         6Y 0B 11 30COLOR(YLW)
     A  34                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2TLE4         6Y 0B 11 40COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2FLE5         6Y 0B 12 30COLOR(YLW)
     A  35                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2TLE5         6Y 0B 12 40COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2FLE6         6Y 0B 13 30COLOR(YLW)
     A  36                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2TLE6         6Y 0B 13 40COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2FLE7         6Y 0B 14 30COLOR(YLW)
     A  37                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2TLE7         6Y 0B 14 40COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2FLE8         6Y 0B 15 30COLOR(YLW)
     A  38                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2TLE8         6Y 0B 15 40COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2FLE9         6Y 0B 16 30COLOR(YLW)
     A  39                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2TLE9         6Y 0B 16 40COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2FLE10        6Y 0B 17 30COLOR(YLW)
     A  40                                  ERRMSGID(FMD0140 *LIBL/QMFOFAX 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B2TLE10        6Y 0B 17 40COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
