     A*%%TS  SD  20010911  114950  KRKRI       REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SFRF SFRFR)
     A                                      PRINT
     A          R B2BLD
     A*%%TS  SD  20010625  141257  KRKRI       REL-V4R4M0  5769-PW1
     A                                      CA03
     A                                      CA12
     A                                      CLRL(*ALL)
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av parameterfil'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Type:'
     A            B2TYPE    R        O  4  8REFFLD(SPTYPE)
     A            B2TEXT        30A  O  4 19
     A                                  4 65'Fakturadato'
     A                                      COLOR(WHT)
     A                                  7 30'Fra'
     A                                  7 40'Til'
     A                                  8  2'Fakturadato. . . . . . . .'
     A            B2FFAK         8Y 0B  8 30COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTWRD('        ')
     A            B2TFAK         8Y 0B  8 40COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTWRD('        ')
     A                                  9 30'hhååmmdd'
     A                                  9 40'hhååmmdd'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
