     A*%%TS  SD  19950201  142709  AMD         REL-V2R3M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/AFRF AFRFR)
     A          R M1WIN
     A*%%TS  SD  19950201  142709  AMD         REL-V2R3M0  5738-PW1
     A                                      CA12
     A                                      KEEP
     A                                  2  2' Informasjon '
     A                                      DSPATR(RI)
     A            M1MLD1        30   O  4  2COLOR(WHT)
     A                                      TEXT('Meldingsfelt')
     A            M1MLD2        30   O  5  2COLOR(WHT)
     A                                      TEXT('Meldingsfelt')
     A          R ASUME                     ASSUME
     A                                 24 79' '
