     A*%%TS  SD  19990103  154811  KOB         REL-V4R2M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R A1BLD
     A*%%TS  SD  19990103  154811  KOB         REL-V4R2M0  5769-PW1
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA12(12 'F12=Annuller')
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'AS Statistikk'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Konvertering av registre'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  3'1=Valg av register'
     A                                      COLOR(BLU)
     A                                  7 27'V'
     A                                      COLOR(WHT)
     A                                  7 29'Navn  '
     A                                      COLOR(WHT)
     A                                  7 36'Beskrivelse av file'
     A                                      COLOR(WHT)
     A            A1VAA1         1A  B  8 27VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                  8 29'SSTAPF Statistikkregister i år  (S-
     A                                      O1)'
     A            A1VAA2         1A  B  9 27VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                  9 29'SBUDPF Budsjettregister         (R-
     A                                      B1)'
     A            A1VAA3         1A  B 10 27VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                 10 29'SSTAPF Statistikkregister ifjor (F-
     A                                      O1)'
     A            A1VAA4         1A  B 12 27VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                 12 29'SISTPF Innkjøpstatistikk  i år  (S-
     A                                      I1)'
     A            A1VAA5         1A  B 13 27VALUES(' ' '1')
     A                                      CHKMSGID(AM00010 *LIBL/QMFAGPL)
     A                                      DSPATR(PC)
     A                                 13 29'SISTPF Innkjøpstatistikk  ifjor (F-
     A                                      I1)'
     A                                 20 10'Oppgi file-gruppe . . . . . . :'
     A            A1FGRP         3A  B 20 43CHKMSGID(AG00010 *LIBL/QMFAGPL)
     A                                      COMP(NE ' ')
     A                                      DFTVAL('XXX')
     A                                 23  5'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 21'F12=Annuller'
     A                                      COLOR(BLU)
