     A*%%TS  SD  20051026  142747  HKO550      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20041125  104911  HKO         REL-V5R2M0  5722-WDS
     A            B1VALG    R        B 10  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(2 3 4 5 0)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1SBGF    R        O 10  4REFFLD(EKEBGF)
     A            B1SBGT    R        O 10 14REFFLD(EKEBGT)
     A            B1SBPR    R        O 10 24REFFLD(EKEBPR)
6.20 A                                      EDTCDE(J)
6.NU A            B1SKTB    R        O 10 32REFFLD(EKEKTB)
6.NU A            B1SMRK    R   -3   O 10 34REFFLD(EKEMRK)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20051021  151643  HKO530      REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA01
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av bonuselement'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                      COLOR(WHT)
     A                                  5  2'Bonustype. . . . . . . . .'
     A            B2BOTY    R        O  5 29REFFLD(EKEBOT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2BTXT    R        O  5 34REFFLD(VATBES)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'År . . . . . . . . . . . .'
     A            B2SAAR         4S 0O  6 29
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'2=Endre  3=Kopier  4=Slett  5=Vis'
     A                                      COLOR(BLU)
     A                                  9  2'V Fra-beløp Til-beløp  Bonus K Mer-
     A                                      knad'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20010114  194850  HKO         REL-V4R4M0  5769-PW1
     A                                 23  2'F1=Sett år   F3=Gå tilbake   F5=Fo-
     A                                      rny   F6=Opprett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20051021  141728  HKO530      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Opprett bonussats'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Bonustype. . . . . . . . .'
     A            C1BOTY    R        O  5 29REFFLD(EKEBOT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C1BTXT    R        O  5 34REFFLD(VATBES)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'År . . . . . . . . . . . .'
     A            C1SAAR         4S 0O  6 29
     A                                      COLOR(YLW)
     A                                  8  2'Fra beløpsgrense . . . . .'
     A            C1SBGF    R        B  8 29REFFLD(EKEBGF)
     A  31                                  ERRMSGID(EMK0200 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  9  2'Til beløpsgrense . . . . .'
     A            C1SBGT    R        B  9 29REFFLD(EKEBGT)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20041119  130358  GRO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 7 35)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Bonussats finnes fra før. '
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20051026  142747  HKO550      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av bonussatser'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Bonustype. . . . . . . . .'
     A            C1BOTY    R        O  4 29REFFLD(EKEBOT)
     A                                      COLOR(YLW)
     A**                                    OVRDTA
     A            C1BTXT    R        O  4 32REFFLD(VATBES)
     A                                      COLOR(YLW)
     A**                                    OVRDTA
     A                                  5  2'År . . . . . . . . . . . .'
     A            C1SAAR         4S 0O  5 29
     A                                      COLOR(YLW)
     A**                                    OVRDTA
     A                                  6  2'Fra beløpsgrense . . . . .'
     A            C1SBGF    R        O  6 29REFFLD(EKEBGF)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Til beløpsgrense . . . . .'
     A            C1SBGT    R        O  7 29REFFLD(EKEBGT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Bonus-prosent. . . . . . .'
     A            C2SBPR    R        B  9 29REFFLD(EKEBPR)
     A  31                                  ERRMSGID(EMK0210 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
6.20 A                                      EDTCDE(J)
     A                                      DSPATR(PC)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 11  2'Merknad. . . . . . . . . .'
     A            C2SMRK    R        B 11 29REFFLD(EKEMRK)
     A                                      CHECK(LC)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 13  2'Bonus fra første krone . .'
     A            C2SKTB    R        B 13 29REFFLD(EKEKTB)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 13 31'1=Ja,0=Nei'
     A                                 13 44'Velges dersom bonus skal regnes fr-
     A                                      a'
     A                                 14 44'første krone når fra-beløpsgrense'
     A                                 15 44'er oppnådd'
     A            C2SODA         6Y 0O 22 48COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 57'/'
     A            C2SEDA         6Y 0O 22 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 68'/'
     A            C2SEUS    R        O 22 70REFFLD(EKEEUS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  20051021  141728  HKO530      REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 13 68)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette bonussats '
     A                                      DSPATR(RI)
     A                                  4  2'År. . . . . . .'
     A            EKSAAR         4S 0O  4 18
     A                                  5  2'Fra-beløp . . .'
     A            EKSBGF    R        O  5 18REFFLD(EKEBGF)
     A                                  6  2'Til-beløp . . .'
     A            EKSBGT    R        O  6 18REFFLD(EKEBGT)
     A                                  8  2'Bonus-prosent .'
     A            EKSBPR    R        O  8 18REFFLD(EKEBPR)
     A                                 10  2'Merknad . . . .'
     A            EKSMRK    R        O 10 18REFFLD(EKEMRK)
     A                                 12  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20041125  105509  HKO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 14 53)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'År. . . . . . .'
     A            K1SAAR         4S 0B  4 18
     A                                      COLOR(YLW)
     A                                  5  2'Fra-beløp . . .'
     A            K1SBGF    R        B  5 18REFFLD(EKEBGF)
     A  31                                  ERRMSGID(EMK0200 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(EMK0030 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  6  2'Til-beløp . . .'
     A            K1SBGT    R        B  6 18REFFLD(EKEBGT)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  8  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  9  2'År. . . . . . .'
     A            EKSAAR         4S 0O  9 18
     A                                 10  2'Fra-beløp . . .'
     A            EKSBGF    R        B 10 18REFFLD(EKEBGF)
     A                                      OVRDTA
     A                                 11  2'Til-beløp . . .'
     A            EKSBGT    R        O 11 18REFFLD(EKEBGT)
     A                                      OVRDTA
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R H1WIN
     A*%%TS  SD  20100303  142229  ASP_A04     REL-V6R1M0  5761-WDS
     A                                      WINDOW(*DFT 14 50)
     A                                      CA03
     A                                      CF04
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A                                      PUTOVR
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A                                  2  2'Sett årstall for bonus'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4  2'Velg Årstall .:'
     A            H1SAAR    R        B  4 19REFFLD(FNAARR)
     A                                      DLTCHK
     A  31                                  ERRMSGID(FMO0300 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(EMK0300 *LIBL/QMFOFAK 32)
     A                                      OVRDTA
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 12  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
