     A*%%TS  SD  20051021  083151  HKO530      REL-V5R3M0  5722-WDS
     A*%%EC
     A*
7.xx A* 7.xx  150316  bsa  Justeringer basert på ny GUI og regler
     A*---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20051021  083151  HKO530      REL-V5R3M0  5722-WDS
     A            B1KMNR         5  0H
     A            B1VALG    R        B  8  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 5 7 9)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1KBOT    R        O  8  5REFFLD(VATBOT)
     A            B1KBES    R        O  8  9REFFLD(VATBES)
     A            B1KKAT         4S 0O  8 46
     A            B1KTXT        20A  O  8 51
     A            B1KDAT         6Y 0O  8 73
     A                                      EDTWRD('  .  .  ')
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20051021  083151  HKO530      REL-V5R3M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A**                                    CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kobling maler og kundekategorier'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  4  5'Bty'
7.xx A                                      COLOR(WHT)
7.xx A                                  6  2'5=Vise  7=Fjerne BT  9=Oppd. kkat'
     A                                      COLOR(BLU)
7.xx A                                  7  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  5'Bty'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  9'Beskrivelse                '
7.xx A                                      COLOR(WHT)
7.xx A                                  7 46'Kkat'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 51'Beskrivelse      '
7.xx A                                      COLOR(WHT)
7.xx A                                  7 72'Opd.dato'
     A                                      COLOR(WHT)
7.xx A            B2TBOT    R        B  5  5REFFLD(VATBOT)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20020226  080848  HKO         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20051019  114913  HKO530      REL-V5R3M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Bonustype finnes fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20051019  115603  HKO530      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av bonustype'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Bonustype. . . . . . . . . .'
     A            C1TBOT    R        O  5 31REFFLD(VATBOT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Beskrivelse. . . . . . . . .'
     A            C2TBES    R        O  7 31REFFLD(VATBES)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Mal. . . . . . . . . . . . .'
     A            C2MBES    R        O  8 31REFFLD(VATBES)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Kundekategori. . . . . . . .'
     A            C2KKAT         4S 0O  9 31COLOR(YLW)
     A            C2KBES        30A  O  9 36COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Sist oppdatert . . . . . . .'
     A            C2KDAT         6Y 0O 10 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A            C2ODAT         6Y 0O 22 48COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 57'/'
     A            C2TEDA         6Y 0O 22 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 68'/'
     A            C2TEUS    R        O 22 70REFFLD(VATEUS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R M1WIN
     A*%%TS  SD  20100305  135445  ASP_A04     REL-V6R1M0  5761-WDS
     A                                      WINDOW(*DFT 18 50)
     A                                      CA03
     A**                                    CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  4  2' Oppdater bonusmal til kunder'
     A                                      DSPATR(RI)
     A                                  7  2'Kundekategori:'
     A            M1KKAT    R        O  7 18REFFLD(FÅKKAT)
     A  31                                  ERRMSGID(FRA1110 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FRA1120 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            M1KTXT        20A  O  7 24
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 17  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R R1WIN
     A*%%TS  SD  20100305  135445  ASP_A04     REL-V6R1M0  5761-WDS
     A                                      WINDOW(*DFT 18 50)
     A                                      CA03
     A**                                    CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  4  2' Fjerne bonusmal fra kunder'
     A                                      DSPATR(RI)
     A                                  7  2'Kundekategori:'
     A            R1KKAT    R        O  7 18REFFLD(FÅKKAT)
     A  31                                  ERRMSGID(FRA1110 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FRA1120 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            R1KTXT        20A  O  7 24
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 17  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
