     A*%%TS  SD  20070319  160803  AMD550      REL-V5R4M0  5722-WDS
     A*%%EC
     A*
7.xx A* 7.xx  140316  bsa  Justeringer basert på ny GUI og regler
     A*---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20070319  160356  AMD550      REL-V5R4M0  5722-WDS
7.xx A            B1VALG    R        B  9  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
7.xx A            B1JTYP    R        O  9  5REFFLD(VAJTYP)
7.xx A            B1JTXT    R        O  9  9REFFLD(VAJTXT)
7.xx A            B1JSEL    R        O  9 32REFFLD(VAJSEL)
7.xx A            B1JKJO    R        O  9 36REFFLD(VAJKJO)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20070319  160356  AMD550      REL-V5R4M0  5722-WDS
7.xx A                                      SFLSIZ(0014)
7.xx A                                      SFLPAG(0013)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av logg-koder '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  4  4'Kode Beskrivelse'
7.xx A                                      COLOR(WHT)
7.xx A                                  4  9'Beskrivelse'
7.xx A                                      COLOR(WHT)
7.xx A                                  6  2'2=Endre  3=Kopier  4=Slett  5=Vis'
     A                                      COLOR(BLU)
7.xx A                                  7 30'Opf.'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 35'Kj.'
7.xx A                                      COLOR(WHT)
7.xx A                                  8  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  8  4'Kode'
7.xx A                                      COLOR(WHT)
7.xx A                                  8  9'Beskrivelse        '
7.xx A                                      COLOR(WHT)
7.xx A                                  8 30'selg'
7.xx A                                      COLOR(WHT)
7.xx A                                  8 35'knt'
7.xx A                                      COLOR(WHT)
7.xx A            B2JTYP    R        B  5  5REFFLD(VAJTYP)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
7.xx A            B2JTXT    R        B  5  9REFFLD(VAJTXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20020226  084800  HKO         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20070319  160356  AMD550      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av logg - koder'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Logg - kode  . . . . . . . .'
     A            C1JTYP    R        B  5 31REFFLD(VAJTYP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20070314  145338  AMD550      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Logg.kode finnes fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20070319  160356  AMD550      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av logg - koder'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Logg - kode. . . . . . . . .'
     A            C1JTYP    R        O  4 31REFFLD(VAJTYP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Beskrivelse. . . . . . . . .'
     A            C2JTXT    R        B  5 31REFFLD(VAJTXT)
     A  31                                  ERRMSGID(VMA8100 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                  7  2'Følges opp av selger . . . .'
     A            C2JSEL    R        B  7 31REFFLD(VAJSEL)
     A                                      VALUES(' ' '1')
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  7 34'1=Ja,Blank=Nei'
     A                                  8  2'Behandles i kjørekontorløsn.'
     A            C2JKJO    R        B  8 31REFFLD(VAJKJO)
     A                                      VALUES(' ' '1')
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  8 34'1=Ja,Blank=Nei'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A            C2JEDA         6Y 0O 23 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 68'/'
     A            C2JEUS    R        O 23 70REFFLD(VAJEUS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R D1WIN
     A*%%TS  SD  20070319  160356  AMD550      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 14 41)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette logg - kode      '
     A                                      DSPATR(RI)
     A                                  4  2'Logg - kode. . . .'
     A            D1JTYP    R        O  4 21REFFLD(VAJTYP)
     A                                  5  2'Beskrivelse. . . .'
     A            VAJTXT    R        O  5 21
     A                                  7  2'Kjørekontorløsning'
     A            VAJKJO    R        O  7 21
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  20070314  150715  AMD550      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      WINDOW(*DFT 14 41)
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Logg - kode. . . .'
     A            K1JTYP    R        B  4 21REFFLD(VAJTYP)
     A  31                                  ERRMSGID(VMA8010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VMA8030 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  8  2'Logg - kode. . . .'
     A            VAJTYP    R        O  8 21OVRDTA
     A                                  9  2'Beskrivelse. . . .'
     A            VAJTXT    R        O  9 21OVRDTA
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
