     A*%%TS  SD  20031014  161041  AMD         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20031014  161041  AMD         REL-V5R2M0  5722-WDS
     A            B1VALG    R        B  7  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1KKOD    R        O  7  5REFFLD(VAKKOD)
     A            B1KLTY    R        O  7 11REFFLD(VAKLTY)
     A            B1KOTY    R        O  7 13REFFLD(VAKOTY)
     A            B1KTXT    R        O  7 16REFFLD(VAKTXT)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20031014  155701  AMD         REL-V5R2M0  5722-WDS
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A                                      SFLCSRRRN(&W_CURN)
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      WINDOW(B2CMD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Velge kontohenvisning '
     A                                      DSPATR(RI)
     A                                  4  2'1=Velg'
     A                                      COLOR(BLU)
     A                                  5  2'V  Kode LT OT Beskrivelse'
     A                                      COLOR(WHT)
     A            B2KKOD    R        B  6  5REFFLD(VAKKOD)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2KTXT    R        B  6 16REFFLD(VAKTXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20031014  155701  AMD         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 17 46)
     A                                 16  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME
     A*%%TS  SD  20031014  155701  AMD         REL-V5R2M0  5722-WDS
     A                                      ASSUME
     A                                 24 79' '
