     A*%%TS  SD  20020308  100301  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20020308  100301  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 8 25)
     A                                      CA03
     A                                      CA12
     A                                      CF04
     A                                      KEEP
     A                                      OVERLAY
     A                                  2  2' Velg ordretype '
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  4  2'Ordretype. . . . . .'
     A            B1OTYP    R        B  4 23REFFLD(FOOTYP)
     A                                  7  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R ASUME                     ASSUME
     A                                 24 79' '
