     A*%%TS  SD  20080828  141350  ASP         REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      MSGLOC(16)
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20000928  184420  HKO         REL-V4R4M0  5769-PW1
     A            B1VALG    R        B  6  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1OTYP    R        O  6  4REFFLD(VAOTYP)
     A            B1OTXT        14A  O  6  7
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20000928  184420  HKO         REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  1  2' VALG AV ORDRETYPE '
     A                                      DSPATR(RI)
     A                                  3  2'1=Hente inn type'
     A                                      COLOR(WHT)
     A            B2OTYP    R        B  5  4REFFLD(VAOTYP)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A            B2OTXT        14A  B  5  7COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  19990114  171537  HKO         REL-V4R2M0  5769-PW1
     A                                 15  2'F5=Forny'
     A                                      COLOR(WHT)
