     A*%%TS  SD  20020812  150501  HKO         REL-V5R1M0  5722-WDS
     A*
7.xx A*   290716 bsa Endringer relatert til ny GUI
     A*
     A*%%EC
6.31 A                                      DSPSIZ(24 80 *DS3 -
6.31 A                                             27 132 *WIDE)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20020812  150501  HKO         REL-V5R1M0  5722-WDS
     A            B1VALG    R        B  7  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1PKOD    R        O  7  6REFFLD(VAPKOD)
     A            B1PTXT    R        O  7 11REFFLD(VAPTXT)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020812  150501  HKO         REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Velge priskode '
     A                                      DSPATR(RI)
7.xx A                                  3  5'Kode'
7.xx A                                      COLOR(WHT)
7.xx A                                  5  2'1=Velg'
     A                                      COLOR(BLU)
7.xx A**                                6  2'V  Kode  Beskrivelse'
7.xx A                                  6  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  6  5'kode'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 11'Beskrivelse'
7.xx A**                                5  2'V  Kode  Beskrivelse'
     A                                      COLOR(WHT)
7.xx A            B2PKOD    R        B  4  6REFFLD(VAPKOD)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20020226  090208  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 17 46)
     A                                 16  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
