     A*%%TS  SD  20091029  202308  ASK610      REL-V5R4M0  5722-WDS
     A*%%EC
7.xx A* 7.xx  020216  bsa  Justeringer basert på ny GUI og regler
     A*---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20091029  201958  ASK610      REL-V5R4M0  5722-WDS
     A            B1VALG    R        B  7  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1KKOD    R        O  7  5REFFLD(VAMKOD)
     A            B1KLTY    R        O  7  9REFFLD(VAMKOF)
     A            B1KOTY    R        O  7 11REFFLD(VAMKLA)
     A            B1KTXT    R        O  7 14REFFLD(VAMTXT)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20091029  202308  ASK610      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A                                      SFLCSRRRN(&W_CURN)
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Velge avgiftskode '
     A                                      DSPATR(RI)
7.xx A                                  3  2'1=Velg'
     A                                      COLOR(BLU)
7.xx A                                  4  5'Ko'
7.xx A                                      COLOR(WHT)
7.xx A                                  4 14'Beskrivelse                       '
7.xx A                                      COLOR(WHT)
7.xx A                                  6  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  6  5'Ko'
7.xx A                                      COLOR(WHT)
7.xx A                                  6  9'S'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 11'I'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 14'Beskrivelse                       '
7.xx A**                                5  2'V  Ko  S I OT Beskrivelse   '
     A                                      COLOR(WHT)
7.xx A            B2KKOD    R        B  5  5REFFLD(VAMKOD)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
7.xx A            B2KTXT    R        B  5 14REFFLD(VAMTXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20091029  201606  ASK610      REL-V5R4M0  5722-WDS
7.xx A                                      WINDOW(*DFT 17 50)
     A                                 16  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME
     A*%%TS  SD  20031014  155701  AMD         REL-V5R2M0  5722-WDS
     A                                      ASSUME
     A                                 24 79' '
