     A*%%TS  SD  20101105  111305  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20030321  115758  HKO         REL-V5R2M0  5722-WDS
     A            B1ALFA        18A  H
     A            B1VALG    R        B  9  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 7)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1NAVN        35A  O  9  4
     A            B1LDOR    R        O  9 40REFFLD(VDLDOR)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20101105  111305  BOF610      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA09
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Leverandører med varer '
     A                                      DSPATR(RI)
     A                                  4  2'Sortiment.'
     A                                      COLOR(BLU)
     A            B2VSOR    R        O  4 13REFFLD(VDVSOR)
     A                                      COLOR(BLU)
     A                                  4 25'Lager '
     A                                      COLOR(BLU)
     A            B2LAGE    R        O  4 32REFFLD(VDLAGE)
     A                                      COLOR(BLU)
     A                                  5  2'Frisøk . .'
     A                                      COLOR(BLU)
     A            B2STEK        35A  B  5 13COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  6  2'1=Legg til sortiment  7=Varegruppe-
     A                                      r'
     A                                      COLOR(BLU)
     A                                  7  2'V Navn                            -
     A                                          Lev.nr'
     A                                      COLOR(WHT)
     A            B2ALFA        18A  B  8  4COLOR(YLW)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A            B2LDOR    R        B  8 40REFFLD(VDLDOR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20030910  115637  HKO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 21 48)
     A                                 20  2'F3=Gå tilbake  F9=Gjenta søk  F5=F-
     A                                      orny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
