     A*%%TS  SD  20011115  122557  HKO         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20011115  122557  HKO         REL-V4R4M0  5769-PW1
     A*                                     WINDOW(*DFT 17 68)
     A                                      CA03
     A                                      CA12
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Maskinell oppretting av sortiment-
     A                                       '
     A                                      DSPATR(RI)
     A                                  4  2'Sortiment. . . . . . . . . . .'
     A            B1VSOR    R        B  4 33REFFLD(VCVSOR)
     A  31                                  ERRMSGID(VMC0010 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                  5  2'Beskrivelse. . . . . . . . . .'
     A            B1BESK    R        B  5 33REFFLD(VCBESK)
     A  32                                  ERRMSGID(VMC0100 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                  7  2'Les vareregister fra filgruppe'
     A            B1FGRP         3A  B  7 33COLOR(YLW)
     A  33                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 33)
     A                                 10  2'Rutinen leser vareregisteret for v-
     A                                      algt filgruppe, og oppretter'
     A                                 11  2'totalsortiment i henhold til dette-
     A                                      . Sortimentet opprettes i den'
     A                                 12  2'filgruppen rutinen kjøres i.'
     A                                 14  2'Eventuellt eksisterende sortiment -
     A                                      med samme navn erstattes.'
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
