     A*%%TS  SD  20140822  104459  BOF630      REL-V7R1M0  5770-WDS
     A* 220814 BOF : Utvidet med filter
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20100520  101846  BOF610      REL-V5R4M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
6.14 A                                      VALUES(0 2 8)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1VARE    R   -7   O  8  5REFFLD(VEVARE)
     A            B1TEK1    R  -17   O  8 14REFFLD(VVTEK1)
     A            B1VENH    R        O  8 33REFFLD(VEPENH)
     A            B1LDOR    R        O  8 38REFFLD(VEPLDO)
     A            B1LNAV        16A  O  8 46
     A            B1PGTI    R        O  8 64REFFLD(VEPGTI)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20140822  104459  BOF630      REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CF09
     A                                      CF10
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A  31                                  SFLMSGID(VME0310 *LIBL/QMFOFAK 31)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold GTIN-nr pr. hovedlev. '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  3'2=Endre  8=GTIN nummer           '
     A                                      COLOR(BLU)
     A                                  6  2'Varenr.'
     A                                      COLOR(WHT)
     A                                  6 20'GTIN'
     A                                      COLOR(WHT)
     A            B2VARE    R   -7   B  6 10REFFLD(VEVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2PGTI    R        B  6 25REFFLD(VEPGTI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'V'
     A                                      COLOR(WHT)
     A                                  7  5'Varenr.'
     A                                      COLOR(WHT)
     A                                  7 14'Varenavn'
     A                                      COLOR(WHT)
     A                                  7 33'Enhet'
     A                                      COLOR(WHT)
     A                                  7 38'Leverandør'
     A                                      COLOR(WHT)
     A                                  7 64'GTIN'
     A                                      COLOR(WHT)
     A            B2TEXT        25A  B  5 55OVRDTA
     A                                      COLOR(YLW)
     A  50                                  DSPATR(RI)
     A N50                                  DSPATR(ND)
     A          R C2BLD
     A*%%TS  SD  20090930  122507  BOF610      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering '
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av enhet pr. prisgiver'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenummer . . . . . . . . .'
     A            C1PVAR    R   -7   O  5 31REFFLD(VEPVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2'Enhet  . . . . . . . . . . .'
     A            C1PENH    R        O  6 31REFFLD(VEPENH)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Prisgiver  . . . . . . . . .'
     A            C1PLDO    R        O  7 31REFFLD(VEPLDO)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'GTIN-nr. . . . . . . . . . .'
     A            C2PGTI    R        B 10 31REFFLD(VEPGTI)
     A                                      COLOR(YLW)
     A  31                                  ERRMSGID(VME0340 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VMX0030 *LIBL/QMFOFAK 32)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 11  2'Pakningsklasse . . . . . . .'
     A            C2PKLA    R        B 11 31REFFLD(VEPKLA)
     A                                      COLOR(YLW)
     A                                      VALUES('F' 'D' 'T' ' ')
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 11 33'(F/D/T/ )'
     A                                 12  2'Bestillbar . . . . . . . . .'
     A            C2PBES    R        B 12 31REFFLD(VEPBES)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                 12 33'1=Ja,0=Nei'
     A                                 23  2'F3=Gå tilbake              '
     A                                      COLOR(BLU)
     A            C2PODA         6Y 0O 23 48COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 57'/'
     A            C2PEDA         6Y 0O 23 59COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 23 68'/'
     A            C2PEUS    R        O 23 70REFFLD(VEEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20140822  100357  BOF630      REL-V7R1M0  5770-WDS
     A                                 23  2'F1=Filter  F3=Gå tilbake   F4=Spør-
     A                                      ring  F5=orny  F09=GTIN pr prisgive-
     A                                      r'
     A                                      COLOR(BLU)
     A                                 24  2'F10=Gamle GTINnr'
     A                                      COLOR(BLU)
     A          R F1WIN
     A*%%TS  SD  20140630  145820  BOF630      REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 10 50)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2'Filter for visning :'
     A                                      COLOR(WHT)
     A                                  4  2'GTIN  . . . . . . . . . '
     A            F1GTIN    R        B  4 28REFFLD(VEPGTI)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  9  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
