     A*%%TS  SD  20020226  093539  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
7.xx A*          120419 bsa  Justeringer basert på ny GUI og regler
Q.01 A*          120419 bsa  Utvidet skjerm
     A*
     A*
     A*-----------------------------------------------------------------
Q.01 A                                      DSPSIZ(24 80 *DS3 -
Q.01 A                                             27 132 *WIDE)
Q.01 A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20020226  093539  HKO         REL-V5R1M0  5722-WDS
7.xx A            B1VALG    R        B  8  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 7)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
7.xx A            B1ENHE    R        O  8  5REFFLD(VEENHE)
7.xx A            B1ETXT    R        O  8 10REFFLD(VAETXT)
7.xx A            B1SAEN    R        O  8 48REFFLD(VESAEN)
7.xx A            B1INEN    R        O  8 53REFFLD(VEINEN)
7.xx A            B1PBEN    R        O  8 58REFFLD(VEPBEN)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020226  093539  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(B2CMD)
7.xx A                                      SFLSIZ(0008)
7.xx A                                      SFLPAG(0007)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Velge enhet fra vare '
     A                                      DSPATR(RI)
7.xx A                                  3  2'Enh'
7.xx A                                      COLOR(WHT)
7.xx A                                  5  2'1=Velg'
     A                                      COLOR(BLU)
7.xx A                                  5 10'7=Vis pr.prisgiver'
     A                                      COLOR(BLU)
7.xx A                                  6  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  6  5'Enh'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 10'Beskrivelse               '
7.xx A                                      COLOR(WHT)
7.xx A                                  6 47'Sa.'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 52'In.'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 57'Pb.'
     A                                      COLOR(WHT)
7.xx A            B2ENHE    R        B  4  5REFFLD(VEENHE)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
7.xx A                                  7 47'enh'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 52'enh'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 57'enh'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  19990114  171537  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 17 60)
     A                                 16  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
