     A*%%TS  SD  20120524  104132  BOF610      REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20120524  104132  BOF610      REL-V7R1M0  5770-WDS
     A*                                     WINDOW(*DFT 15 60)
     A                                      CA03
     A                                      CA12
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Overføring av GTIN pr. leverandør-
     A                                        '
     A                                      DSPATR(RI)
     A                                  5  2'Leverandør  . . . .'
     A            B1LDOR         6Y 0B  5 23
     A  33                                  ERRMSGID(LSO0080 *LIBL/QMFLAGR 33)
     A                                      DSPATR(UL)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A            B1LTEK        25A  O  5 30
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
