     A*%%TS  SD  20030106  203059  NHO         REL-V5R1M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : VG00
     A* Beskrivelse . . : Gjennomsnittlig kostpris
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03(03 'F3=Gå tilbake')
     A                                      CA10(10 'F10=Kommando-linje')
     A          R A1MNU
     A*%%TS  SD  20030106  203059  ASK         REL-V5R1M0  5722-WDS
     A            A1FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Gjennomsnittlig kostpris'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  6  6'Vedlikehold'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  6 35'Hjelpeprogrammer'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  6'1.Kostpris på vare'
     A                                  7 35'10.Startverdi kostpris fra statist-
     A                                      ikk'
     A                                  8  6'2.Kostprisfaktorer'
     A                                  8 35'11.Startverdi kostpris fra kalkule-
     A                                      rt'
     A                                  9 35'12.Faktorer fra Excel'
     A                                  9  6'3.Faktortyper'
     A                                 10  6'4.Parameter'
     A                                 10 35'13.Kostpriser fra ekstern fil'
     A                                 11 35'14.Oppdatere salgsstat. med gj.sn.-
     A                                       kostpris'
     A                                 13 35'Installasjon'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 14 35'20.Generere tabeller'
     A                                 20 29'Valg:'
     A            VALG           2Y 0B 20 36EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23 18'F3=Tilbake'
     A                                      COLOR(BLU)
