     A*%%TS  SD  20020226  095009  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
7.xx A* 7.00  040216  bsa  Justeringer basert på ny GUI og regler
     A*
     A*---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
7.xx A*                                     HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20001010  001941  KOB         REL-V4R4M0  5769-PW1
7.xx A            B1VALG    R        B  9  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 2 3 4 5 7)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
7.xx A            B1OOGR    R        O  9  6REFFLD(VGOOGR)
7.xx A            B1OTXT    R        O  9 11REFFLD(VGOTXT)
7.xx A            B1OKHV    R        O  9 48REFFLD(VGOKHV)
7.xx A            B1OPRA    R        O  9 57REFFLD(VGOPRA)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020226  094913  HKO         REL-V5R1M0  5722-WDS
7.xx A                                      SFLSIZ(0014)
7.xx A                                      SFLPAG(0013)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av varegruppe'
     A                                      COLOR(WHT)
     A                                  2 38'VG100B2'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  4  5'Ogrp'
7.xx A                                      COLOR(WHT)
7.xx A                                  4 11'Beskrivelse'
7.xx A                                      COLOR(WHT)
7.xx A            B2OOGR    R        B  5  6REFFLD(VGOOGR)
7.xx A  31                                  ERRMSGID(VMG1010 *LIBL/QMFOFAK 31)
7.xx A  32                                  ERRMSGID(VMG1020 *LIBL/QMFOFAK 32)
7.xx A                                      COLOR(YLW)
7.xx A  22                                  DSPATR(PC)
7.xx A                                      CHECK(RB)
7.xx A                                      OVRDTA
7.xx A            B2OTXT    R        B  5 11REFFLD(VGOTXT)
7.xx A                                      COLOR(YLW)
7.xx A                                      CHECK(LC)
7.xx A                                      OVRDTA
7.xx A                                  6  2'2=Endre  3=Kopier  4=Slett  5=Vis -
     A                                       7=Behandle hovedgruppe'
     A                                      COLOR(BLU)
7.xx A                                  7  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  5'Ogrp'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 11'Beskrivelse                       '
7.xx A                                      COLOR(WHT)
7.xx A                                  7 48'Konto-'
     A                                      COLOR(WHT)
7.xx A                                  7 57'Prod'
     A                                      COLOR(WHT)
7.xx A                                  8 48'henv.'
     A                                      COLOR(WHT)
7.xx A                                  8 57'ansv'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20020226  095009  HKO         REL-V5R1M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  20020226  095009  HKO         REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av vareuruppe'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Overgruppe . . . . . . . . .'
     A            C1OOGR    R        B  5 31REFFLD(VGOOGR)
     A  31                                  ERRMSGID(VMG1010 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  19990112  143848  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Overgruppe finnes fra før'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20001010  001941  KOB         REL-V4R4M0  5769-PW1
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av overgruppe'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Overgruppe . . . . . . . . .'
     A            C1OOGR    R        O  5 31REFFLD(VGOOGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Beskrivelse. . . . . . . . .'
     A            C2OTXT    R        B  7 31REFFLD(VGOTXT)
     A  31                                  ERRMSGID(VMG1100 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                      OVRDTA
7.xx A                                  9  2'Kontohenvisning. . . . . . +'
     A            C2OKHV    R        B  9 31REFFLD(VGOKHV)
     A  32                                  ERRMSGID(VMA2020 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2KTXT    R        O  9 36REFFLD(FFRFR/VAKTXT *LIBL/FFRF)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 11  2'Produktansvarlig . . . . . +'
     A            C2OPRA    R        B 11 31REFFLD(VGOPRA)
     A  33                                  ERRMSGID(FRA2020 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2ZTXT    R        O 11 36REFFLD(RFRFR/RAZTXT *LIBL/RFRF)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 19  2'Sist endret dato . . . . . .'
     A            C2OEDA         6Y 0O 19 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20  2'Endret av. . . . . . . . . .'
     A            C2OEUS    R        O 20 31REFFLD(VGOEUS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  19990112  150031  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette overgruppe '
     A                                      DSPATR(RI)
     A                                  4  2'Overgruppe . . . .'
     A            D1OOGR    R        O  4 21REFFLD(VGOOGR)
     A                                  6  2'Beskrivelse. . . .'
     A            VGOTXT    R        O  6 21
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  19990112  150031  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Overgruppe . . . .'
     A            K1OOGR    R        B  4 21REFFLD(VGOOGR)
     A  31                                  ERRMSGID(VMG1010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VMG1030 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  6  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  8  2'Overgruppe . . . .'
     A            VGOOGR    R        O  8 21OVRDTA
     A                                  9  2'Beskrivelse. . . .'
     A            VGOTXT    R        O  9 21OVRDTA
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
