     A*%%TS  SD  20020226  102234  HKO         REL-V5R1M0  5722-WDS
     A*%%EC
7.xx A* 040316 bsa Endringer relatert til ny GUI
     A*---------------------------------------------------------------
7.00 A                                      DSPSIZ(24 80 *DS3 -
7.00 A                                             27 132 *WIDE)
7.00 A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20020226  102234  HKO         REL-V5R1M0  5722-WDS
     A            B1VALG    R        B  7  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1HOGR    R        O  7  5REFFLD(VGHOGR)
     A            B1HHGR    R        O  7 10REFFLD(VGHHGR)
     A            B1HTXT    R        O  7 15REFFLD(VGHTXT)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020226  102234  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(B2CMD)
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Velge hovedgruppe '
     A                                      DSPATR(RI)
7.xx A                                  3  5'Ogr'
7.xx A                                      COLOR(WHT)
7.xx A                                  3 10'Hgr'
7.xx A                                      COLOR(WHT)
7.xx A                                  3 15'Beskrivelse'
7.xx A                                      COLOR(WHT)
7.xx A                                  5  2'1=Velg'
     A                                      COLOR(BLU)
7.xx A                                  6  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  6  5'Ogr'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 10'Hgr'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 15'Beskrivelse'
     A                                      COLOR(WHT)
7.xx A            B2HOGR    R        B  4  5REFFLD(VGHOGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A            B2HHGR    R        B  4 10REFFLD(VGHHGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A            B2HTXT    R        B  4 15REFFLD(VGHTXT)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  19990114  171537  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 17 50)
     A                                 16  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
