     A*%%TS  SD  20181102  121745  NHO630      REL-V7R3M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASLAGR
     A* Format. . . . . : VG715D
     A* Beskrivelse . . : Vedlikehold parametre
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       180123 ask  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/VGKKST)
     A                                      PRINT
     A                                      HOME(21)
     A          R C2BLD
     A*%%TS  SD  20020730  125617  KOB         REL-V5R1M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Legge inn gj. kostpris i salgsstat-
     A                                      istikk'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Henter historiske glidende kostpri-
     A                                      ser og oppdaterer statistikk post'
     A                                      COLOR(RED)
     A                                  7  2'Startår'
     A                                      COLOR(WHT)
     A            C2SAAR         4Y 0B  7 11COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      EDTCDE(Z)
     A                                  7 20'Overskriv gammel kostpris?'
     A                                      COLOR(WHT)
     A            C2ERST         1   B  7 47COLOR(YLW)
     A                                      OVRDTA
     A                                  7 50'J/N'
     A                                      COLOR(WHT)
     A                                  9 71'Utelat'
     A                                      COLOR(WHT)
     A                                 10  2'Alle lager'
     A                                      COLOR(WHT)
     A            C2LAG0         1Y 0B 10 18
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                 10 20'1/0'
     A                                 10 27'Velg lager'
     A            C2LAG1         2Y 0B 10 43
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            C2LAG2         2Y 0B 10 46
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            C2LAG3         2Y 0B 10 49
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            C2LAG4         2Y 0B 10 52
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            C2LAG5         2Y 0B 10 55
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            C2LAG6         2Y 0B 10 58
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            C2LAG7         2Y 0B 10 61
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            C2LAG8         2Y 0B 10 64
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            C2LAG9         2Y 0B 10 67
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            C2LAGU         1Y 0B 10 73
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                 10 76'1/0'
     A                                 11  2'Alle ordretyper'
     A                                      COLOR(WHT)
     A                                 11 27'Velg ordretyper'
     A                                 11 20'1/0'
     A            C2OTY0         1Y 0B 11 18
     A                                      EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OTY1         2   B 11 43
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OTY2         2   B 11 46
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OTY3         2   B 11 49
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OTY4         2   B 11 52
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OTY5         2   B 11 55
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OTY6         2   B 11 58
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OTY7         2   B 11 61
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OTY8         2   B 11 64
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OTY9         2   B 11 67
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2OTYU         1Y 0B 11 73
     A                                      COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                 11 76'1/0'
     A                                 13  2'Bare artikkelnr'
     A                                      COLOR(WHT)
     A            C2ARTN         8   B 13 18
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R C1MSG
     A*%%TS  SD  20020307  004349  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A  41                              2  2'Star år må velges'
     A  42                              2  2'Erstatningsvalg må angis'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*%%RS+<record-sequences>
     A*%%RS+ <sequence name="Untitled">
     A*%%RS+  <device type="display" width="80" height="24" />
     A*%%RS+ </sequence>
     A*%%RS </record-sequences>
