     A*%%TS  SD  19990205  152649  HKO         REL-V4R2M0  5769-PW1
     A*%%EC
     A* 800   20220330 ask  Innlesing av gj.kostpriser fra fil
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19990205  152649  HKO         REL-V4R2M0  5769-PW1
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Lager/Innkjøp'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Innlesing av kostpriser fra fil'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  3'Filnavn'
     A                                  5 21'VGIMST'
     A                                      COLOR(RED)
     A                                  7  3'Oppdatere lager'
     A            B1LAGR         2Y 0B  7 21COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  7 30'Kostpriser blir lagt inn på angitt
     A                                       lager'
     A                                  9  3'Gjelder fra dato'
     A            B1DATE         6Y 0B  9 21COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  9 30'Kostpriser blir gjeldende fra angi-
     A                                      tt tid'
     A                                 10  3'            tid '
     A                                 13 10'Er angitt enhet på varen avviker f-
     A                                      ra lagerenhet'
     A                                      COLOR(RED)
     A                                 14 10'blir den omregnet til lagerenhet'
     A                                      COLOR(RED)
     A            B1TIME         6Y 0B 10 21COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R B1MSG1
     A*%%TS  SD  20020325  222058  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Lager'
     A                                  3  2'Må fylles ut'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A*
     A          R B1MSG2
     A*%%TS  SD  20020325  222058  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Dato '
     A                                  3  2'Ugyldig dato/tid'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
