     A*%%TS  SD  20080630  134013  BOF560      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3 -
     A                                             27 132 *WIDE)
     A                                      REF(*LIBL/JFRF JFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20080630  134013  BOF560      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 11 58)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette priser VVPRPF ut fra CSV'
     A                                      DSPATR(RI)
     A                                  4  2'Filnavn (IFS): '
     A            B1FILE        30A  B  4 18COLOR(YLW)
     A                                  6  2'Oppgi filnavn som ligger i  -
                                            (path).'
     A                                  7  2'/asp/xxx/pcfiler'
     A                                 10  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B1MSG
     A*%%TS  SD  20010904  091133  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 12 36)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Valgt mappenavn er ugyldig, filene'
     A                                  3  2'ble ikke funnet i mappen, eller du'
     A                                  4  2'mangler tilgang for behandling av'
     A                                  5  2'mapper.'
     A                                  7  2'Sjekk at filene finnes i mappen.'
     A                                  8  2'Dersom du mangler tilgang må du'
     A                                  9  2'kontakte systemansvarlig.'
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
     A*%%RS+<record-sequences>
     A*%%RS+ <sequence name="Untitled">
     A*%%RS+  <device type="display" width="80" height="24" />
     A*%%RS+ </sequence>
     A*%%RS </record-sequences>
