     A*%%TS  SD  20060531  074304  HKO550      REL-V5R3M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R C2BLD
     A*%%TS  SD  20060531  074304  HKO550      REL-V5R3M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold/oppretting av plakatin-
     A                                      formasjon'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Plakat-type . . . .'
     A            C2TYPE    R        B  4 22REFFLD(VRTYPE)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  4 28'STD,ENKEL,TILB'
     A                                  4 45'Varenr. . . . . . .'
     A            C2VARE    R   -7   O  4 65REFFLD(VRVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  5  2'Plakat-format . . .'
     A            C2FORM    R        B  5 22REFFLD(VRFORM)
     A  31                                  ERRMSGID(VMR0100 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  5 28'A3,A4,A5,A6'
     A                                  5 45'Nobbnr. . . . . . .'
     A            C2NOBB    R        O  5 65REFFLD(VVNOBB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6 45'GTIN-nr.  . . . . .'
     A            C2EANN    R        O  6 65REFFLD(VXEANN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Enhet . . . . . . .'
     A            C2ENHE    R        B  7 22REFFLD(VRENHE)
     A  32                                  ERRMSGID(VMA1020 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  8  2'Plakatpris inkl.mva'
     A            C2PRIS    R        B  8 22REFFLD(VRPRIS)
     A  33                                  ERRMSGID(VMR0110 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A                                  8 45'Salgspris inkl.mva.'
     A            C2SAIM    R        O  8 65REFFLD(VRPRIS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Produsent:'
     A                                      COLOR(WHT)
     A                                 10 45'Merke:'
     A                                      COLOR(WHT)
     A            C2PNAV    R        B 11  2REFFLD(VRPNAV)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A            C2MERK    R        B 11 45REFFLD(VRMERK)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                 12  2'Produkt-tekst/Salgsargument:'
     A                                      COLOR(WHT)
     A                                 12 45'Varetekst, Hovedgruppe, Undergrupp-
     A                                      e:'
     A                                      COLOR(WHT)
     A            C2TEK1    R        B 13  2REFFLD(VRTEK1)
     A  34                                  ERRMSGID(VMR0120 *LIBL/QMFOFAK 34)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A            VVTEK1    R        O 13 45COLOR(YLW)
     A            C2TEK2    R        B 14  2REFFLD(VRTEK2)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A            VVTEK2    R        O 14 45COLOR(YLW)
     A            C2TEK3    R        B 15  2REFFLD(VRTEK3)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A            VGHTXT    R        O 15 45COLOR(YLW)
     A            C2TEK4    R        B 16  2REFFLD(VRTEK4)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A            VGUTXT    R        O 16 45COLOR(YLW)
     A            C2TEK5    R        B 17  2REFFLD(VRTEK5)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A            C2TEK6    R        B 18  2REFFLD(VRTEK6)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A                                 19  2'Beskrivelse:'
     A                                      COLOR(WHT)
     A            C2BES1    R        B 20  2REFFLD(VRBES1)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A            C2BES2    R        B 21  2REFFLD(VRBES2)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A            C2BES3    R        B 22  2REFFLD(VRBES3)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A            C2ODAT         6Y 0O 22 49COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 58'/'
     A            C2EDAT         6Y 0O 22 60COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 22 69'/'
     A            C2EUSR    R        O 22 71REFFLD(VREUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring   F7=U-
     A                                      tskrift   F8=Vareinfo.   F9=Tilbuds-
     A                                      priser'
     A                                      COLOR(BLU)
