     A*%%TS  SD  20110503  092029  NHO620      REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : VT102D
     A* Beskrivelse . . : Endre utløpsdato og klokkeslett
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       120511 NHO  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R A2BLD
     A*%%TS  SD  20110503  092029  NHO620      REL-V7R1M0  5770-WDS
     A                                      KEEP
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Endre utløpsdato/tid'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Utvalg:'
     A                                      COLOR(WHT)
     A                                  7  2'Kampanjenavn . . . . . . . . . . :'
     A            A2KAMP    R        B  7 38REFFLD(VTKAMP)
     A  43                                  ERRMSGID(VMT0035 *LIBL/QMFOFAK 43)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Til dato/tidspunkt . . . . . . . :'
     A            A2TDAT         6Y 0B  8 38COLOR(YLW)
     A  39                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 39)
     A                                      EDTWRD('  .  .  ')
     A                                      CHECK(RB)
     A                                  8 48'-'
     A            A2TTIM         4Y 0B  8 51COLOR(YLW)
     A  40                                  ERRMSGID(FM00060 *LIBL/QMFOFAK 40)
     A                                      EDTWRD('  :  ')
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R A2MSG
     A*%%TS  SD  20020325  225553  NHO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Advarsel: Utvalgte poster '
                                        3  2 'vil bli endret'
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
