     A*%%TS  SD  20090528  114803  ASP_X50     REL-V5R3M0  5722-WDS
     A*%%EC
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : VT600D
     A* Beskrivelse . . : Utskrift av tilbudspriser
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  010416  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20090528  114803  ASP_X50     REL-V5R3M0  5722-WDS
     A*                                     WINDOW(*DFT 15 60)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Utskrift av tilbudspriser '
     A                                      DSPATR(RI)
7.xx A                                  2 38'VT600B1'
7.xx A                                      COLOR(WHT)
7.xx A                                  4  2'Dato . . . . . . . .'
7.xx A            B1DATO         6Y 0B  4 23COLOR(YLW)
     A  31                                  ERRMSGID(VMT0200 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VMT0210 *LIBL/QMFOFAK 32)
     A  33                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 33)
     A                                      CHECK(RB)
     A                                      EDTWRD('  .  .  ')
7.xx A                                  6  2'Kampanje . . . . . .'
7.xx A            B1KAMP    R        B  6 23REFFLD(VTKAMP)
     A                                      COLOR(YLW)
7.xx A                                  8  2'Tilbudsperiode . . .'
7.xx A            B1FPER         6Y 0B  8 23COLOR(YLW)
     A  34                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 34)
     A  36                                  ERRMSGID(FM00210 *LIBL/QMFOFAK 36)
     A  37                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 37)
     A                                      CHECK(RB)
     A                                      EDTWRD('  .  .  ')
7.xx A                                  8 32'-'
7.xx A            B1TPER         6Y 0B  8 34COLOR(YLW)
     A  35                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 35)
     A                                      CHECK(RB)
     A                                      EDTWRD('  .  .  ')
7.xx A                                 10  2'Varegruppe fra/til +'
7.xx A            B1FOGR    R        B 10 23REFFLD(VVOGRP)
     A  38                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 38)
     A                                      COLOR(YLW)
7.xx A                                 10 26'+'
7.xx A            B1FHGR    R        B 10 28REFFLD(VVHGRP)
     A  38                                  ERRMSGID(FM00200 *LIBL/QMFOFAK 38)
     A                                      COLOR(YLW)
7.xx A                                 10 31'+'
7.xx A            B1FUGR    R        B 10 33REFFLD(VVUGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A                                 10 37'-'
7.xx A                                 10 39'+'
7.xx A            B1TOGR    R        B 10 41REFFLD(VVOGRP)
     A                                      COLOR(YLW)
7.xx A                                 10 44'+'
7.xx A            B1THGR    R        B 10 46REFFLD(VVHGRP)
     A                                      COLOR(YLW)
7.xx A                                 10 49'+'
7.xx A            B1TUGR    R        B 10 51REFFLD(VVUGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
7.xx A                                 12  2'Lager  . . . . . . +'
7.xx A            B1LAGE    R        B 12 23REFFLD(VLLAGE)
     A  39                                  ERRMSGID(FMA0160 *LIBL/QMFOFAK 39)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
