     A*%%TS  SD  19991109  222551  HKO         REL-V4R4M0  5769-PW1
     A*%%EC
6.31 A*%% 191217 BOF: UTVIDET MED Å VISE BATCH
7.xx A*          030216 bsa  Justeringer basert på ny GUI og regler
     A*----------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19991109  222551  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 14 58)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Endring av lagerenhet på vare '
     A                                      DSPATR(RI)
     A                                  4  2'Gammel lagerenhet . . . . .'
     A            B1ENLG    R        O  4 30REFFLD(VVENHL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  5  2'Ny lagerenhet . . . . . . +'
     A            B1ENHL    R        B  5 30REFFLD(VVENHL)
     A  31                                  ERRMSGID(VMV0350 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VME0200 *LIBL/QMFOFAK 32)
     A  37                                  ERRMSGID(VMV0360 *LIBL/QMFOFAK 37)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Dersom du velger å endre lagerenhe-
     A                                      t vil denne rutinen'
     A                                  8  2'oppdatere lagerbeholding og antall-
     A                                       i historisk lagerbok.'
     A                                 10  2'DETTE KAN TA LANG TID !!!'
     A                                 13  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
6.31 A          R N1WIN
6.31 A*%%TS  SD  20090116  163232  BOF560      REL-V5R4M0  5722-WDS
6.31 A                                      WINDOW(*DFT 20 70)
6.31 A                                      CA03
6.31 A                                      CA12
6.31 A                                  2  2' Varen finnes på tellinger'
6.31 A                                      DSPATR(RI)
6.31 A            N1ENHE         3   O  2 33COLOR(WHT)
6.31 A                                  4  2'Følgnde transer : '
6.31 A            N1TX01        40   O  5  2COLOR(WHT)
6.31 A            N1TX02        40   O  6  2COLOR(WHT)
6.31 A            N1TX03        40   O  7  2COLOR(WHT)
6.31 A            N1TX04        40   O  8  2COLOR(WHT)
6.31 A            N1TX05        40   O  9  2COLOR(WHT)
6.31 A            N1TX06        40   O 10  2COLOR(WHT)
6.31 A            N1TX07        40   O 11  2COLOR(WHT)
6.31 A            N1TX08        40   O 12  2COLOR(WHT)
6.31 A            N1TX09        40   O 13  2COLOR(WHT)
6.31 A            N1TX10        40   O 14  2COLOR(WHT)
6.31 A            N1TX11        40   O 15  2COLOR(WHT)
6.31 A            N1TX12        40   O 16  2COLOR(WHT)
6.31 A            N1TX13        40   O 17  2COLOR(WHT)
6.31 A                                 18  2'F3=Gå tilbake'
6.31 A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
