     A*%%TS  SD  19991115  134045  HKO         REL-V4R4M0  5769-PW1
     A*%%EC
7.xx A*          030216 bsa  Justeringer basert på ny GUI og regler
     A*----------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19991115  134045  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 18 58)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Endring av statistikkenhet på var-
     A                                      e '
     A                                      DSPATR(RI)
     A                                  4  2'Gammel statistikkenhet. . .'
     A            B1ENSG    R        O  4 30REFFLD(VVENHS)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  5  2'Ny statistikkenhet. . . . +'
     A            B1ENHS    R        B  5 30REFFLD(VVENHS)
     A  31                                  ERRMSGID(VMV0350 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VME0200 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Dersom du velger å endre statistik-
     A                                      kenhet vil denne'
     A                                  8  2'rutinen oppdatere kjøpt og solgt a-
     A                                      ntall i statistikkene.'
     A                                 10  2'DETTE KAN TA LANG TID !!!'
     A                                 12  2'Det er viktig at det er sammsvar m-
     A                                      ellom statistikkenhet'
     A                                 13  2'på varer innefor en varegruppe. De-
     A                                      tte for at summering'
     A                                 14  2'av antall innenfor en varegruppe s-
     A                                      kal bli mest'
     A                                 15  2'mulig korrekt.'
     A                                 17  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
