     A*%%TS  SD  20090116  163232  BOF560      REL-V5R4M0  5722-WDS
     A*%%EC
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : VV115D
     A* Beskrivelse . . : Sammenslåing av varer
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  010416  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20060213  140256  HKO550      REL-V5R3M0  5722-WDS
7.xx A*                                     WINDOW(*DFT 15 68)
     A                                      CA03
     A                                      CA12
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Sammenslåing av varer '
     A                                      DSPATR(RI)
7.xx A                                  4  2'Varenr. . . . . . . +'
     A            B1GVAR         8Y 0B  4 24COLOR(YLW)
     A  31                                  ERRMSGID(VMV0010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 32)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B1GTEK    R        O  4 33REFFLD(VVTEK1)
     A                                      COLOR(YLW)
     A                                  6  2'Slås sammen med:'
     A                                      COLOR(WHT)
7.xx A                                  7  2'Varenr (beholdes) . +'
     A            B1NVAR         8Y 0B  7 24COLOR(YLW)
     A  33                                  ERRMSGID(VMV0010 *LIBL/QMFOFAK 33)
     A  34                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 34)
     A  35                                  ERRMSGID(VMV0900 *LIBL/QMFOFAK 35)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B1NTEK    R        O  7 33REFFLD(VVTEK1)
     A                                      COLOR(YLW)
     A                                 10  2'Sjekk at det er samsvar mellom enh-
     A                                      etene på varene som skal slås'
     A                                 11  2'sammen før sammenslåing!'
7.xx A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R M1WIN
     A*%%TS  SD  20090116  163232  BOF560      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Filer som bør sjekkes.'
     A                                      DSPATR(RI)
     A                                  4  2'Gamle varenr blir slettet'
     A                                  5  2'fra følgende filer :'
     A            M1TX01        30   O  6  2COLOR(WHT)
     A            M1TX02        30   O  7  2COLOR(WHT)
     A            M1TX03        30   O  8  2COLOR(WHT)
     A            M1TX04        30   O  9  2COLOR(WHT)
     A            M1TX05        30   O 10  2COLOR(WHT)
     A            M1TX06        30   O 11  2COLOR(WHT)
     A            M1TX07        30   O 12  2COLOR(WHT)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R N1WIN
     A*%%TS  SD  20090116  163232  BOF560      REL-V5R4M0  5722-WDS
     A                                      WINDOW(*DFT 20 70)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Transer med enhet som utgår'
     A                                      DSPATR(RI)
     A            N1ENHE         3   O  2 33COLOR(WHT)
     A                                  4  2'Følgnde transer : '
     A            N1TX01        40   O  5  2COLOR(WHT)
     A            N1TX02        40   O  6  2COLOR(WHT)
     A            N1TX03        40   O  7  2COLOR(WHT)
     A            N1TX04        40   O  8  2COLOR(WHT)
     A            N1TX05        40   O  9  2COLOR(WHT)
     A            N1TX06        40   O 10  2COLOR(WHT)
     A            N1TX07        40   O 11  2COLOR(WHT)
     A            N1TX08        40   O 12  2COLOR(WHT)
     A            N1TX09        40   O 13  2COLOR(WHT)
     A            N1TX10        40   O 14  2COLOR(WHT)
     A            N1TX11        40   O 15  2COLOR(WHT)
     A            N1TX12        40   O 16  2COLOR(WHT)
     A            N1TX13        40   O 17  2COLOR(WHT)
     A                                 18  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
