     A*%%TS  SD  19990621  204613  HKO         REL-V4R2M0  5769-PW1
     A*%%EC
7.xx A*          030216 bsa  Justeringer basert på ny GUI og regler
     A*----------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19990621  204613  HKO         REL-V4R2M0  5769-PW1
     A*                                     WINDOW(*DFT 15 68)
     A                                      CA03
     A                                      CA12
     A                                      CF04
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Bytting av varenummer på vare '
     A                                      DSPATR(RI)
7.xx A                                  5  2'Gammelt varenummer. +'
     A            B1GVAR         8Y 0B  5 24COLOR(YLW)
     A  31                                  ERRMSGID(VMV0010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 32)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A            B1TEK1    R        O  5 33REFFLD(VVTEK1)
     A                                      COLOR(YLW)
     A                                  7  2'Nytt varenummer . . .'
     A            B1NVAR         8Y 0B  7 24COLOR(YLW)
     A  33                                  ERRMSGID(VMV0010 *LIBL/QMFOFAK 33)
     A  34                                  ERRMSGID(VMV0030 *LIBL/QMFOFAK 34)
6.20 A  35                                  ERRMSGID(JMV0030 *LIBL/QMFVADM 35)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
