     A*%%TS  SD  20101109  124656  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20101109  124656  BOF610      REL-V5R4M0  5722-WDS
     A            B1VARE    R        H      REFFLD(VVVARE)
     A            B1LVAR    R        H      REFFLD(VVLVAR)
     A            B1NOBB    R        H      REFFLD(VVNOBB)
     A            B1VALG         1Y 0B 11  2COLOR(YLW)
     A                                      VALUES(5 6 8 9 0)
     A                                      CHKMSGID(BM00010 *LIBL/QMFVEDL)
     A                                      EDTCDE(4)
     A            B1TEK1    R   -1   O 11  4REFFLD(VVTEK1)
     A  50                                  COLOR(RED)
     A            B1NYPO        15A  O 11 39
     A            B1LNAV         4A  O 11 55
     A            B1ENHE    R        O 11 60REFFLD(VPENHE)
     A            B1SAIM    R        O 11 64REFFLD(VPSAPR)
     A            B1KPRI    R        H      REFFLD(VVKPRI)
     A            B1VTYP    R        H      REFFLD(VVVTYP)
     A            B1SENT         1A  H
     A            B1SESS         1A  H
     A            B1STAT         4A  O 11 75
     A            B1KPLA         1Y 0O 11 80EDTCDE(Z)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20101109  124656  BOF610      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CF06
     A                                      CA09
     A                                      CA12
     A                                      CF13
     A                                      CA21
     A                                      CA22
     A                                      CA23
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A  40                                  SFLMSGID(FM00700 *LIBL/QMFOFAK 40)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Spørring på vare - plakatløsning'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Varegruppe . .'
     A                                      COLOR(BLU)
     A            B2OGRP    R        B  4 17REFFLD(VVHGRP)
     A  34                                  ERRMSGID(VMG0100 *LIBL/QMFOFAK 34)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2HGRP    R        B  4 20REFFLD(VVHGRP)
     A  35                                  ERRMSGID(VMG0110 *LIBL/QMFOFAK 35)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2UGRP    R        B  4 23REFFLD(VVUGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  5  2'Frisøk . . . .'
     A                                      COLOR(BLU)
     A            B2STEK        35A  B  5 17COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  7  2'5=Vareinformasjon  6=Plakatutskrif-
     A                                      t  8=Produktinformasjon  9=Tilbudsp-
     A                                      riser'
     A                                      COLOR(BLU)
     A                                  8  2'V Varetekst                       -
     A                                          Varenr   Nobbnr   Lev.varenr'
     A                                      COLOR(WHT)
     A            B2TEK1    R        B  9  4REFFLD(VVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2VARE         8Y 0B  9 40COLOR(YLW)
     A  36                                  ERRMSGID(VMV0010 *LIBL/QMFOFAK 36)
     A  37                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 37)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B2NOBB    R        B  9 49REFFLD(VVNOBB)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B2LVAR    R        B  9 58REFFLD(VVLVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'V Varetekst                       -
     A                                         Varenr   Nobbnr Lev. Enh.'
     A                                      COLOR(WHT)
6.NU A* 81                             10 41'Nobbnr'
6.NU A* 81                                  COLOR(WHT)
6.NU A* 82                             10 41'Lev. varenr'
6.NU A* 82                                  COLOR(WHT)
     A                                 10 66'Inkl.mva'
     A                                      COLOR(WHT)
     A                                 10 75'CPKT'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20060611  204620  HKO550      REL-V5R3M0  5722-WDS
     A                                 22  2'F3=Gå tilbake  F4=Spørring  F5=For-
     A                                      ny  F6=Opprett  F9=Gjenta søk  F13=-
     A                                      Scanning'
     A                                      COLOR(BLU)
     A N83                             23  2'F21=Inkl.skaffevarer'
     A                                      COLOR(BLU)
     A  83                             23  2'F21=Eksl.skaffevarer'
     A                                      COLOR(BLU)
     A N84                             23 30'F22=Kun varer med plakatinfo.  '
     A                                      COLOR(BLU)
     A  84                             23 30'F22=Også varer uten plakatinfo.'
     A                                      COLOR(BLU)
     A                                 23 67'F23=Bytt info.'
     A                                      COLOR(BLU)
     A          R E1WIN
     A*%%TS  SD  19990428  224045  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Scanning '
     A                                      DSPATR(RI)
     A                                  4  2'GTIN-nummer .'
     A            E1EANN        14A  B  4 16COLOR(YLW)
     A  31                                  ERRMSGID(VMX0010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 32)
     A                                      CHECK(ER)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  6  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
