     A*%%TS  SD  20081111  142138  BOF570      REL-V5R4M0  5722-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : VV551D
     A* Beskrivelse . . : Vise vare/pris
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  110117 bsa  Justeringer basert på ny GUI og regler
7.01 A* R6.30 240616 BSA  Lagt inn F tast for VA info
7.02 A* R6.30 040618 BSA  Lagt inn F tast for varekort
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*%%EC
7.xx A                                      DSPSIZ(24 80 *DS3 -
7.xx A                                             27 132 *WIDE)
7.XX A**                                    DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R C2BLD
     A*%%TS  SD  20081111  142138  BOF570      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA05
7.02 A                                      CA07
     A                                      CA12
     A                                      CF08
     A                                      CF09
7.01 A                                      CF10
6.31 A                                      CF18
     A                                      CA23
     A                                      PUTOVR
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vise vare/pris'
     A                                      COLOR(WHT)
     A                                  2 38'VV551C2'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  4  2'Kunde. . . . +'
     A            C2KUND         6Y 0B  4 17COLOR(YLW)
     A  31                                  ERRMSGID(FRK0020 *LIBL/QMFOFAK 31)
     A  40                                  ERRMSGID(FM00700 *LIBL/QMFOFAK 40)
     A  41                                  ERRMSGID(FMB0200 *LIBL/QMFOFAK 41)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            C2KNAV        28A  O  4 27COLOR(YLW)
     A                                      OVRDTA
     A                                  4 58'Salgspris .'
     A            C2SAGM    R        O  4 70REFFLD(VPSAPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  5  2'Kundeprosjekt+'
     A            C2KPRO         6Y 0B  5 17COLOR(YLW)
     A  32                                  ERRMSGID(FML0020 *LIBL/QMFOFAK 32)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A            C2PNAV        28A  O  5 27COLOR(YLW)
     A                                      OVRDTA
     A                                  5 58'Butikkpris.'
     A            C2BUPR    R        O  5 70REFFLD(VPBUPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  6  2'Leveringstype+'
     A            C2LETY    R        B  6 17REFFLD(VYLETY)
     A  33                                  ERRMSGID(VMY0020 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6 58'Kostpris. .'
     A            C2KOPR    R        O  6 70REFFLD(VPKOPR)
     A N80                                  DSPATR(ND)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7 58'Innkj.pris.'
     A            C2INPR    R        O  7 70REFFLD(VPINPR)
     A N80                                  DSPATR(ND)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  8  2'Varenummer . .'
     A            C2VARE    R   -7   O  8 17REFFLD(VVVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2TEK1        28A  O  8 27COLOR(YLW)
     A                                      OVRDTA
     A                                  8 58'DG. . . . .'
     A            C2DEKN         5Y 2O  8 70COLOR(YLW)
     A N80                                  DSPATR(ND)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A                                  9  2'Nobbnr . . . .'
     A            C2NOBB    R        O  9 17REFFLD(VVNOBB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2TEK2        28A  O  9 27COLOR(YLW)
     A                                      OVRDTA
     A                                  9 58'Varetype. .'
     A            C2VTYP    R        O  9 70REFFLD(VVVTYP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 10  2'Varegruppe . .'
     A            C2OGRP    R        O 10 17REFFLD(VVOGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2HGRP    R        O 10 20REFFLD(VVHGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2UGRP    R        O 10 23REFFLD(VVUGRP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2UTXT        28A  O 10 27COLOR(YLW)
     A                                      OVRDTA
     A                                 10 58'Priskode. .'
     A            C2KPRI    R        O 10 70REFFLD(VVKPRI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 11 58'Prisgruppe.'
     A            C2PRGR    R        O 11 70REFFLD(VPGPRG)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 11  2'Leverandør . .'
     A            C2LDOR    R        O 11 17REFFLD(VVLDOR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2LNAV        28A  O 11 27COLOR(YLW)
     A                                      OVRDTA
     A                                 12  2'Lev. varenr. .'
     A            C2LVAR    R        O 12 17REFFLD(VVLVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 12 58'Kampanje. .'
     A            C2KAMP    R        O 12 70REFFLD(VTKAMP)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13  2'Modulnr. . . .'
     A            C2NMOD    R        O 13 17REFFLD(VVNMOD)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 13 58'Kost. tilb.'
     A            C2KPTI    R        O 13 70REFFLD(VTKOP1)
     A N80                                  DSPATR(ND)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14  2'GTIN-nr. . . .'
     A            C2EANN    R        O 14 17REFFLD(VXEANN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 14 58'Tilbudsperiode'
     A                                 15  2'Utgår dato . .'
     A            C2UDAT         6Y 0O 15 17COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A            C2TFDA         6Y 0O 15 58COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 15 67'-'
     A            C2TFTI         4Y 0O 15 69COLOR(YLW)
     A                                      EDTWRD('  :  ')
     A                                      OVRDTA
     A                                 16  2'Erstattes av .'
     A            C2ENOB    R        O 16 17REFFLD(VVNOBB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2TTDA         6Y 0O 16 58COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 16 67'-'
     A            C2TTTI         4Y 0O 16 69COLOR(YLW)
     A                                      EDTWRD('  :  ')
     A                                      OVRDTA
     A                                 17  2'Antall'
     A                                 17 17'Enh'
     A                                 17 23'Kundepris'
     A                                 17 34'inkl.mva'
     A                                 17 44'Rabatt'
     A                                 17 52'L'
     A                                 17 54'P'
     A            C2ANTA        11Y 3B 18  2COLOR(YLW)
     A  35                                  ERRMSGID(VMV0560 *LIBL/QMFOFAK 35)
     A                                      CHECK(RB)
     A                                      DSPATR(PC)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A            C2ENHE    R        B 18 17REFFLD(VPENHE)
     A  34                                  ERRMSGID(VME0200 *LIBL/QMFOFAK 34)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2SAPR    R        B 18 22REFFLD(VPSAPR)
     A  36                                  ERRMSGID(VMV0570 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C2SAIM    R        B 18 33REFFLD(VPSAPR)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C2RABA         5Y 2B 18 44COLOR(YLW)
     A                                      CHECK(RB)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A                                 18 58'Tilbudspris'
     A                                 18 71'inkl.mva'
     A            C2ANT1        11Y 3O 19  2COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A            C2ENH1    R        O 19 17REFFLD(VPENHE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2S1PR    R        O 19 22REFFLD(VPSAPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2S1IM    R        O 19 33REFFLD(VPSAPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2LET1    R        O 19 52REFFLD(VYLETY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KPR1    R        O 19 54REFFLD(VVKPRI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2T1PR    R        O 19 58REFFLD(VTTIP1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2T1IM    R        O 19 70REFFLD(VTTIP1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2ANT2        11Y 3O 20  2COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A            C2ENH2    R        O 20 17REFFLD(VPENHE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2S2PR    R        O 20 22REFFLD(VPSAPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2S2IM    R        O 20 33REFFLD(VPSAPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2LET2    R        O 20 52REFFLD(VYLETY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KPR2    R        O 20 54REFFLD(VVKPRI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2T2PR    R        O 20 58REFFLD(VTTIP2)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2T2IM    R        O 20 70REFFLD(VTTIP2)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2ANT3        11Y 3O 21  2COLOR(GRN)
     A                                      EDTCDE(M)
     A                                      OVRDTA
     A            C2ENH3    R        O 21 17REFFLD(VPENHE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2S3PR    R        O 21 22REFFLD(VPSAPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2S3IM    R        O 21 33REFFLD(VPSAPR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2LET3    R        O 21 52REFFLD(VYLETY)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2KPR3    R        O 21 54REFFLD(VVKPRI)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2T3PR    R        O 21 58REFFLD(VTTIP3)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2T3IM    R        O 21 70REFFLD(VTTIP3)
     A                                      COLOR(YLW)
     A                                      OVRDTA
6.31 A                                 22  2'F3=Gå tilbake  F4=Spørring  F5=For-
7.02 A*                                     ny  F8=Produktinfo  F9=Beholding'
7.02 A                                      ny  F7=Vis varekort  F8=Produktinfo'
     A                                      COLOR(BLU)
7.02 A*                                23  2'F10=VA info  F18=NOBB info  F23=Vi-
7.02 A*                                     s DG'
7.02 A                                 23  2'F9=Beholdning  -
7.02 A                                       F10=VA info  F18=NOBB info  F23=Vi-
7.02 A                                      s DG'
     A                                      COLOR(BLU)
7.01 A**                               23  2'F18=NOBB info  F23=Vis DG'
