     A*%%TS  SD  20030911  084730  HKO         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  19990111  185915  HKO         REL-V4R2M0  5769-PW1
     A            B1LDOR    R        H      REFFLD(VVLDOR)
     A            B1OGRP    R        H      REFFLD(VVOGRP)
     A            B1HGRP    R        H      REFFLD(VVHGRP)
     A            B1UGRP    R        H      REFFLD(VVUGRP)
     A            B1NMOD    R        H      REFFLD(VVNMOD)
     A            B1VALG    R        B 10  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 5 0)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1TEK1    R        O 10  4REFFLD(VVTEK1)
     A            B1VARE    R   -7   O 10 40REFFLD(VVVARE)
     A            B1NOBB    R        O 10 49REFFLD(VVNOBB)
     A            B1LVAR    R   -5   O 10 58REFFLD(VVLVAR)
     A            B1NAVN         7A  O 10 74
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20030911  084730  HKO         REL-V5R2M0  5722-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CA09
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Oppretting av varer i sortiment'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Varegruppe. . . .'
     A                                      COLOR(BLU)
     A            B2OGRP    R        B  4 20REFFLD(VVOGRP)
     A  31                                  ERRMSGID(VMG0100 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2HGRP    R        B  4 23REFFLD(VVHGRP)
     A  32                                  ERRMSGID(VMG0110 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2UGRP    R        B  4 26REFFLD(VVUGRP)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  4 59'Sortiment:'
     A                                      COLOR(BLU)
     A            B2VSOR    R        O  4 70REFFLD(VDVSOR)
     A                                      COLOR(YLW)
     A                                  5 59'Lager    :'
     A                                      COLOR(BLU)
     A            B2LAGE    R        O  5 70REFFLD(VDLAGE)
     A                                      COLOR(YLW)
     A                                  5  2'Frisøk. . . . . .'
     A                                      COLOR(BLU)
     A            B2STEK        35A  B  5 20COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  7  2'1=Legg til sortiment  5=Vis'
     A                                      COLOR(BLU)
     A                                  8  2'V Varetekst                       -
     A                                           Varenr  Nobb-nr  Lev. varenr  -
     A                                         Lev.'
     A                                      COLOR(WHT)
     A            B2TEK1    R        B  9  4REFFLD(VVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B2VARE         8Y 0B  9 40
     A  33                                  ERRMSGID(VMV0010 *LIBL/QMFOFAK 33)
     A  34                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 34)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B2NOBB    R        B  9 49REFFLD(VVNOBB)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B2LVAR    R   -5   B  9 58REFFLD(VVLVAR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20030911  084730  HKO         REL-V5R2M0  5722-WDS
     A                                 23  2'F3=Gå tilbake  F4=Spørring  F5=For-
     A                                      ny  F9=Gjenta søk'
     A                                      COLOR(BLU)
