     A*%%TS  SD  20101105  154916  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20030910  211358  HKO         REL-V5R2M0  5722-WDS
     A            B1VALG    R        B  9  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(1 5 0)
     A                                      CHKMSGID(JM00010 *LIBL/QMFOFAK)
     A            B1TEK1    R        O  9  4REFFLD(VVTEK1)
     A            B1VARE    R   -7   O  9 40REFFLD(VVVARE)
     A            B1NOBB    R        O  9 49REFFLD(VVNOBB)
     A            B1LVAR    R   -5   O  9 58REFFLD(VVLVAR)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20101105  154916  BOF610      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0011)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      KEEP
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Varer i modul '
     A                                      DSPATR(RI)
     A                                  3  2'Sortiment .'
     A                                      COLOR(BLU)
     A            B2VSOR    R        O  3 14REFFLD(VDVSOR)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  3 26'Lager '
     A                                      COLOR(BLU)
     A            B2LAGE    R        O  3 33REFFLD(VDLAGE)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  4  2'Leverandør.'
     A                                      COLOR(BLU)
     A            B2LDOR    R        O  4 14REFFLD(VDLDOR)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2LNAV        35A  O  4 24COLOR(BLU)
     A                                      OVRDTA
     A                                  5  2'Varegruppe.'
     A                                      COLOR(BLU)
     A            B2OGRP    R        O  5 14REFFLD(VDOGRP)
     A                                      DLTEDT
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2HGRP    R        O  5 17REFFLD(VDHGRP)
     A                                      DLTEDT
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2UGRP    R        O  5 20REFFLD(VDUGRP)
     A                                      DLTEDT
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2UTXT    R        O  5 24REFFLD(VGUTXT)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A                                  6  2'Modul . . .'
     A                                      COLOR(BLU)
     A            B2MODN    R        O  6 14REFFLD(VDMODN)
     A                                      OVRDTA
     A                                      COLOR(BLU)
     A            B2MTE1        35A  O  6 24COLOR(BLU)
     A                                      OVRDTA
     A                                  7  2'1=Legg til sortiment  5=Detaljer'
     A                                      COLOR(BLU)
     A                                  8  2'V Varetekst                       -
     A                                          Varenr   Nobbnr   Lev.varenr'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20010625  144410  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 22 73)
     A                                 21  1'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
