     A*%%TS  SD  20101105  154205  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20030910  150344  HKO         REL-V5R2M0  5722-WDS
     A            B1VALG    R        B  9  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1 7)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1NMOD    R        O  9  5REFFLD(VVNMOD)
     A            B1MTE1        35A  O  9 15
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20101105  154205  BOF610      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      WINDOW(B2CMD)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Moduler med varer '
     A                                      DSPATR(RI)
     A                                  4  2'Sortiment.'
     A                                      COLOR(BLU)
     A            B2VSOR    R        O  4 13REFFLD(VDVSOR)
     A                                      COLOR(BLU)
     A                                  4 25'Lager '
     A                                      COLOR(BLU)
     A            B2LAGE    R        O  4 32REFFLD(VDLAGE)
     A                                      COLOR(BLU)
     A                                  5  2'Leverandør'
     A                                      COLOR(BLU)
     A            B2LDOR    R        O  5 13REFFLD(VDLDOR)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2LNAV        35A  O  5 23COLOR(BLU)
     A                                      OVRDTA
     A                                  6  2'Varegruppe'
     A                                      COLOR(BLU)
     A            B2OGRP    R        O  6 13REFFLD(VDOGRP)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2HGRP    R        O  6 16REFFLD(VDHGRP)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2UGRP    R        O  6 19REFFLD(VDUGRP)
     A                                      COLOR(BLU)
     A                                      OVRDTA
     A            B2UTXT        35A  O  6 23COLOR(BLU)
     A                                      OVRDTA
     A                                  7  2'1=Legg til sortiment  7=Varer'
     A                                      COLOR(BLU)
     A                                  8  2'V  Modulnr   Beskrivelse'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20030910  150121  HKO         REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 21 60)
     A                                 20  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
