     A*%%TS  SD  20080828  141559  ASP         REL-V5R4M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      MSGLOC(16)
     A          R B1SFL                     SFL
     A*%%TS  SD  20000926  222233  HKO         REL-V4R4M0  5769-PW1
     A            B1VARE    R        H      REFFLD(VVVARE)
     A            B1VALG    R        B  7  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(BM00010 *LIBL/QMFVEDL)
     A            B1TEK1        17A  O  7  4
     A            B1TEK2        17A  O  8  4
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20000926  222202  HKO         REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0005)
     A                                      SFLPAG(0004)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA02
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  1  2' VALG AV VARE '
     A                                      DSPATR(RI)
     A                                  3  2'Frisøk:'
     A                                      COLOR(WHT)
     A            B2STEK        19A  B  4  2COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  6  2'1=Hente inn vare'
     A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20000926  215359  HKO         REL-V4R4M0  5769-PW1
     A                                 15  2'F2=Gjenta  F5=Forny'
     A                                      COLOR(WHT)
