     A*%%TS  SD  20001011  143649  HKO         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      MSGLOC(16)
     A          R B1BLD
     A*%%TS  SD  20001011  143649  HKO         REL-V4R4M0  5769-PW1
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  1  2' PRIS / ETIKETT '
     A                                      DSPATR(RI)
     A                                  3  2'Kunde:'
     A            B1KUND         6Y 0B  3  9COLOR(YLW)
     A  31                                  ERRMSGID(FRK0020 *LIBL/QMFOFAK 31)
     A                                      EDTCDE(Z)
     A            B1KNA1        19A  O  5  2COLOR(YLW)
     A            B1KNA2        11A  O  6  2COLOR(YLW)
     A                                 15  2'F4=Søk'
     A                                      COLOR(WHT)
