     A*%%TS  SD  20001011  145018  HKO         REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      MSGLOC(16)
     A          R B1BLD
     A*%%TS  SD  20001011  145018  HKO         REL-V4R4M0  5769-PW1
     A                                      CA01
     A                                      CF02
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A                                  1  2' PRIS / ETIKETT '
     A                                      DSPATR(RI)
     A                                  3  2'Vare:'
     A            B1VARE    R   -7   O  3  8REFFLD(VVVARE)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            B1TEK1        19A  O  4  2COLOR(YLW)
     A                                      OVRDTA
     A            B1TEK2        16A  O  5  2COLOR(YLW)
     A                                      OVRDTA
     A            B1LNAV        19A  O  6  2COLOR(YLW)
     A                                      OVRDTA
     A            B1ENH1    R        O  8  2REFFLD(VVENHE)
     A                                      COLOR(YLW)
     A  80                                  DSPATR(RI)
     A                                      OVRDTA
     A            B1ENH2    R        O  8  6REFFLD(VVENHE)
     A                                      COLOR(YLW)
     A  81                                  DSPATR(RI)
     A                                      OVRDTA
     A            B1ENH3    R        O  8 10REFFLD(VVENHE)
     A                                      COLOR(YLW)
     A  82                                  DSPATR(RI)
     A                                      OVRDTA
     A                                 10  2'Pris:'
     A            B1SAIM         9Y 2O 10  9COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            B1KPRI         1A  O 10 20COLOR(YLW)
     A                                      OVRDTA
     A                                 11  2'Rabatt:'
     A            B1RAB1         4Y 2O 11 10COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A            B1RAB2         4Y 2O 11 16COLOR(YLW)
     A                                      OVRDTA
     A                                      EDTCDE(4)
     A                                 13  2'Antall:'
     A            B1ANTA        10Y 3B 13 10COLOR(YLW)
     A  31                                  ERRMSGID(FM09999 *LIBL/QMFOFAK 31)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                 15  2'F1=Enhet F2=Etikett'
     A                                      COLOR(WHT)
