     A*%%TS  SD  19980826  135450  HKO         REL-V4R2M0  5769-PW1
     A*%%EC
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : VV620D
     A* Beskrivelse . . : Utskrift av vareregister for scanning
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  010416  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  19980826  135450  HKO         REL-V4R2M0  5769-PW1
     A*                                     WINDOW(*DFT 15 67)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Utskrift av vareregister for scan-
     A                                      ning '
     A                                      DSPATR(RI)
7.xx A                                  5  2'Varesortiment. . +'
     A            B1VSOR    R        B  5 21REFFLD(VCVSOR)
     A  31                                  ERRMSGID(VMC0010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VMC0020 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A            B1BESK    R        O  5 32REFFLD(VCBESK)
     A                                      COLOR(YLW)
7.xx A                                  6  2'Lager  . . . . . +'
     A            B1LAGE    R        B  6 21REFFLD(VCLAGE)
     A  33                                  ERRMSGID(FMA0160 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A            B1LTXT    R        O  6 32REFFLD(VCBESK)
     A                                      COLOR(YLW)
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
