     A*%%TS  SD  20140930  134204  BOF630      REL-V7R1M0  5770-WDS
6.30 A* 040914 Bof : nye parametre.
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20140930  134204  BOF630      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A                                  2  2' Sletting av varer uten salg / utg-
     A                                      åtte varer'
     A                                      DSPATR(RI)
     A                                  3  2'Rutinen sletter varer fra vareregi-
     A                                      steret.'
     A                                  5  2'Følgende må være oppfyllt på vare -
     A                                      før sletting:'
     A                                  6  2'- lager eller skaffevare (varetype-
     A                                       L eller S)'
     A                                  7  2'- ikke ha beholdning i noen lagre.-
     A                                       Dersom batchnr er valgt testes'
     A                                  8  4'det mot at varen er tellt i batche-
     A                                      n istedenfor mot beholdning.'
     A                                  9  4'Batchnr skal derfor kun velges der-
     A                                      som dette er en totaltelling'
     A                                 10  2'- ikke ligge i bestilling, i ordre-
     A                                       eller i pakkseddel'
     A                                 12  2'Kontrolliste u/oppdatering .'
     A            B1KNTR    R        B 12 31REFFLD(FÅJANE)
     A                                      DSPATR(PC)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 12 34'1=Ja,0=Nei'
     A                                 13  2'Slette utgåtte varer . . . .'
     A            B1UTGV    R        B 13 31REFFLD(FÅJANE)
     A                                      COLOR(YLW)
     A                                 13 34'1=Ja,0=Nei'
     A                                 13 48'Hvis utg.dato er satt på vare,'
     A                                 14 48'eller på alle lager'
     A                                 15  2'Batchnr fra telling. . . . .'
     A            B1BATC        10A  B 15 31COLOR(YLW)
     A  35                                  ERRMSGID(FM00710 *LIBL/QMFOFAK 35)
     A                                 16  2'Ant. mnd. for sist opprettet'
     A            B1ANTO         2Y 0B 16 31EDTCDE(4)
     A  37                                  ERRMSGID(FM00730 *LIBL/QMFOFAK 37)
     A                                      COLOR(YLW)
     A                                 16 48'Kan velge 1-12 mnd.'
     A                                 17  2'Ant. mnd. for sist solgt    '
     A            B1ANTS         2Y 0B 17 31EDTCDE(4)
     A  38                                  ERRMSGID(FM00730 *LIBL/QMFOFAK 38)
     A                                      COLOR(YLW)
     A                                 17 48'Kan velge 1-12 mnd.'
     A                                 19  2'Sorteringsrekkefølge . . . .'
     A            B1SRT1         1Y 0B 19 31COLOR(YLW)
     A  31                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 31)
     A                                      EDTCDE(Z)
     A                                 19 34'Varegruppe'
     A                                 19 48'Gyldige valg 1, 2, 3'
     A            B1SRT2         1Y 0B 20 31COLOR(YLW)
     A  32                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 32)
     A                                      EDTCDE(Z)
     A                                 20 34'Leverandør'
     A            B1SRT3         1Y 0B 21 31COLOR(YLW)
     A  33                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 33)
     A                                      EDTCDE(Z)
     A                                 21 34'Varetekst'
     A            B1SRT4         1Y 0B 22 31COLOR(YLW)
     A  34                                  ERRMSGID(FM00011 *LIBL/QMFOFAK 34)
     A                                      EDTCDE(Z)
     A                                 22 34'Varenummer'
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
