     A*%%TS  SD  20120119  132231  ASP_NOR     REL-V6R1M0  5761-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20120119  132231  ASP_NOR     REL-V6R1M0  5761-WDS
     A                                      WINDOW(*DFT 15 57)
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                  2  2' Sett varetype til S etter tellere-
     A                                      sultat '
     A                                      DSPATR(RI)
     A                                  4  2'Batch. . . . . . .'
     A            B1BATC        10A  B  4 21COLOR(YLW)
     A  31                                  ERRMSGID(FLE0010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FLE0020 *LIBL/QMFOFAK 32)
     A                                  5  2'Tellistenr . . . .'
     A            B1NUMM         6Y 0O  5 21COLOR(YLW)
     A                                      EDTCDE(Z)
     A                                  6  2'Oppdatering  . . .'
     A            B1OPPD         1A  B  6 21COLOR(YLW)
     A  31                                  ERRMSGID(FLE0010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FLE0020 *LIBL/QMFOFAK 32)
     A                                      VALUES(' ' '1')
     A                                  6 24'1=Oppdaterer'
     A                                  7  2'Behandler lagervarer i lagergister-
     A                                      et.'
     A                                  8  2'Alle varer som ligger i oppgitt ba-
     A                                      tch settes '
     A                                  9  2'til S=skaffevare hvis tellet = 0 o-
     A                                      g iordre/ibest= 0'
     A                                 11  2'Vær oppmerksom på at en vare som  -
     A                                      bytter varetype fra'
     A                                 12  2'L til S, slettes eventuell lagerbe-
     A                                      holdning på varen.'
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
