     A*%%TS  SD  20070412  122009  HKO550      REL-V5R4M0  5722-WDS
     A*%%EC
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASOFAK
     A* Format. . . . . : VV780D
     A* Beskrivelse . . : Kopiering av varer filgrupper/firma
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsbeskrivelse
     A* ----- ------ ---- -------------------------------------------------
7.xx A* 7.xx  010416  bsa  Justeringer basert på ny GUI og regler
     A*
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20070412  122009  HKO550      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kopiering av varer til filgrupper/-
     A                                      firma'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Vareutplukk:'
     A                                      COLOR(WHT)
7.xx A                                  5  2'Leverandør . . . . . . +'
7.xx A            B1LDOR    R        B  5 27REFFLD(VVLDOR)
     A  31                                  ERRMSGID(VMV0500 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FRL0020 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1LNAV        30A  O  5 42COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  6  2'Varegruppe . . . . . . +'
7.xx A            B1OGRP    R        B  6 27REFFLD(VVOGRP)
     A  33                                  ERRMSGID(VMG1020 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  6 30'+'
7.xx A            B1HGRP    R        B  6 32REFFLD(VVHGRP)
     A  34                                  ERRMSGID(VMG2020 *LIBL/QMFOFAK 34)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  6 35'+'
     A            B1UGRP    R        B  6 37REFFLD(VVUGRP)
     A  35                                  ERRMSGID(VMG0020 *LIBL/QMFOFAK 35)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1UTXT    R        O  6 42REFFLD(VGUTXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  7  2'Varenummer . . . . . . +'
7.xx A            B1VAR0    R   -7   B  7 27REFFLD(VVVARE)
     A  36                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 36)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  7 38'+'
     A            B1VAR1    R   -7   B  7 40REFFLD(VVVARE)
     A  37                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 37)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  8 25'+'
7.xx A            B1VAR2    R   -7   B  8 27REFFLD(VVVARE)
     A  38                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 38)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  8 38'+'
7.xx A            B1VAR3    R   -7   B  8 40REFFLD(VVVARE)
     A  39                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 39)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  9 25'+'
7.xx A            B1VAR4    R   -7   B  9 27REFFLD(VVVARE)
     A  40                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 40)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                  9 38'+'
7.xx A            B1VAR5    R   -7   B  9 40REFFLD(VVVARE)
     A  41                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 41)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 10 25'+'
7.xx A            B1VAR6    R   -7   B 10 27REFFLD(VVVARE)
     A  42                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 42)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 10 38'+'
7.xx A            B1VAR7    R   -7   B 10 40REFFLD(VVVARE)
     A  43                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 43)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 11 25'+'
7.xx A            B1VAR8    R   -7   B 11 27REFFLD(VVVARE)
     A  44                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 44)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 11 38'+'
7.xx A            B1VAR9    R   -7   B 11 40REFFLD(VVVARE)
     A  45                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 45)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A                                 12  2'Varer opprettet dato . .'
7.xx A            B1ODAT         6Y 0B 12 27EDTWRD('  .  .  ')
     A  46                                  ERRMSGID(FM00050 *LIBL/QMFOFAK 46)
     A  47                                  ERRMSGID(VMV0510 *LIBL/QMFOFAK 47)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 14  2'Overstyringer:'
     A                                      COLOR(WHT)
7.xx A                                 15  2'Varetype . . . . . . . .'
7.xx A            B1VTYP    R        B 15 27REFFLD(VVVTYP)
     A  48                                  ERRMSGID(VMV0520 *LIBL/QMFOFAK 48)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 17  2'Begrense kopiering:'
     A                                      COLOR(WHT)
     A                                 18  2'Filgruppe / firma. . . . . .'
     A            B1FGT0         3A  B 18 31COLOR(YLW)
     A                                      OVRDTA
     A                                 18 35'/'
     A            B1FIT0         3Y 0B 18 37COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT1         3A  B 18 42COLOR(YLW)
     A                                      OVRDTA
     A                                 18 46'/'
     A            B1FIT1         3Y 0B 18 48COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT2         3A  B 19 31COLOR(YLW)
     A                                      OVRDTA
     A                                 19 35'/'
     A            B1FIT2         3Y 0B 19 37COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT3         3A  B 19 42COLOR(YLW)
     A                                      OVRDTA
     A                                 19 46'/'
     A            B1FIT3         3Y 0B 19 48COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT4         3A  B 20 31COLOR(YLW)
     A                                      OVRDTA
     A                                 20 35'/'
     A            B1FIT4         3Y 0B 20 37COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT5         3A  B 20 42COLOR(YLW)
     A                                      OVRDTA
     A                                 20 46'/'
     A            B1FIT5         3Y 0B 20 48COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT6         3A  B 21 31COLOR(YLW)
     A                                      OVRDTA
     A                                 21 35'/'
     A            B1FIT6         3Y 0B 21 37COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT7         3A  B 21 42COLOR(YLW)
     A                                      OVRDTA
     A                                 21 46'/'
     A            B1FIT7         3Y 0B 21 48COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT8         3A  B 22 31COLOR(YLW)
     A                                      OVRDTA
     A                                 22 35'/'
     A            B1FIT8         3Y 0B 22 37COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT9         3A  B 22 42COLOR(YLW)
     A                                      OVRDTA
     A                                 22 46'/'
     A            B1FIT9         3Y 0B 22 48COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
     A          R B1SBM
     A*%%TS  SD  19980228  175922  HKO         REL-V3R7M0  5716-PW1
     A                                      WINDOW(*DFT 5 40)
     A                                      CA03
     A                                      CA12
     A                                  3  2'Jobben er sendt som bakgrunnsjobb.'
