     A*%%TS  SD  20070412  122009  HKO550      REL-V5R4M0  5722-WDS
     A*
7.xx A*     BSA  280219    Endringer relatert til ny GUI
     A*
     A*-----------------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20070412  122009  HKO550      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      RTNCSRLOC(&WACTRE &WACTFE)
     A            WACTRE        10A  H
     A            WACTFE        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Kopiering av varer til filgrupper/-
     A                                      firma'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  4  2'Vareutplukk:'
     A                                      COLOR(WHT)
     A                                  5  2'Filnavn        . . . . . . .'
     A            B1FILE        12A  B  5 31
     A  31                                  ERRMSGID(VMV0500 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                  6  2'Mappe        . . . . . . . .'
     A            B1MAPP        20A  B  6 31
     A  33                                  ERRMSGID(VMG1020 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Begrense kopiering:'
     A                                      COLOR(WHT)
     A                                  8  2'Filgruppe / firma. . . . . .'
     A            B1FGT0         3A  B  8 31COLOR(YLW)
     A                                      OVRDTA
     A                                  8 35'/'
     A            B1FIT0         3Y 0B  8 37COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT1         3A  B  8 42COLOR(YLW)
     A                                      OVRDTA
     A                                  8 46'/'
     A            B1FIT1         3Y 0B  8 48COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT2         3A  B  9 31COLOR(YLW)
     A                                      OVRDTA
     A                                  9 35'/'
     A            B1FIT2         3Y 0B  9 37COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT3         3A  B  9 42COLOR(YLW)
     A                                      OVRDTA
     A                                  9 46'/'
     A            B1FIT3         3Y 0B  9 48COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT4         3A  B 10 31COLOR(YLW)
     A                                      OVRDTA
     A                                 10 35'/'
     A            B1FIT4         3Y 0B 10 37COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT5         3A  B 10 42COLOR(YLW)
     A                                      OVRDTA
     A                                 10 46'/'
     A            B1FIT5         3Y 0B 10 48COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT6         3A  B 11 31COLOR(YLW)
     A                                      OVRDTA
     A                                 11 35'/'
     A            B1FIT6         3Y 0B 11 37COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT7         3A  B 11 42COLOR(YLW)
     A                                      OVRDTA
     A                                 11 46'/'
     A            B1FIT7         3Y 0B 11 48COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT8         3A  B 12 31COLOR(YLW)
     A                                      OVRDTA
     A                                 12 35'/'
     A            B1FIT8         3Y 0B 12 37COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            B1FGT9         3A  B 12 42COLOR(YLW)
     A                                      OVRDTA
     A                                 12 46'/'
     A            B1FIT9         3Y 0B 12 48COLOR(YLW)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 14  2'Overstyringer:'
     A                                      COLOR(WHT)
     A                                 15  2'Varetype . . . . . . . . . .'
     A            B1VTYP    R        B 15 31REFFLD(VVVTYP)
     A  48                                  ERRMSGID(VMV0520 *LIBL/QMFOFAK 48)
     A                                      COLOR(YLW)
     A                                      OVRDTA
7.xx A**                               20  2'F3=Gå tilbake   F4=Spørring'
7.xx A                                 20  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B1SBM
     A*%%TS  SD  19980228  175922  HKO         REL-V3R7M0  5716-PW1
     A                                      WINDOW(*DFT 5 40)
     A                                      CA03
     A                                      CA12
     A                                  3  2'Jobben er sendt som bakgrunnsjobb.'
     A          R B1MSG
     A*%%TS  SD  20010904  091133  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 12 36)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Valgt mappenavn er ugyldig, filene'
     A                                  3  2'ble ikke funnet i mappen, eller du'
     A                                  4  2'mangler tilgang for behandling av'
     A                                  5  2'mapper.'
     A                                  7  2'Sjekk at filene finnes i mappen.'
     A                                  8  2'Dersom du mangler tilgang må du'
     A                                  9  2'kontakte systemansvarlig.'
     A                                 11  2'F3=Gå tilbake'
     A                                      COLOR(BLU)

