     A*%%TS  SD  20040917  140122  HKO         REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A          R B1BLD
     A*%%TS  SD  20040917  140122  HKO         REL-V5R2M0  5722-WDS
     A*                                     WINDOW(*DFT 15 51)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Oppretting av vare-query-fil '
     A                                      DSPATR(RI)
     A                                  5  2'Oppretter fil for QUERY-formål som-
     A                                       inneholder'
     A                                  6  2'vareinformasjon, nyeste EAN-nummer-
     A                                      ,'
     A                                  7  2'enhetsinformasjon og nyeste pris/t-
     A                                      ilbudspris'
     A                                  8  2'pr. enhet/leveringstype'
     A                                 10  2'Innholdet lagres i filen: VVAQPF'
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R B1SBM
     A*%%TS  SD  20010207  094420  HKO         REL-V4R4M0  5769-PW1
     A                                      WINDOW(*DFT 5 36)
     A                                      CA03
     A                                      CA12
     A                                  3  2'Jobben er sendt som bakgrunnsjobb.'
     A          R ASUME                     ASSUME
     A                                 24 79' '
