     A*%%TS  SD  20091124  131450  BOF610      REL-V5R4M0  5722-WDS
     A*%%EC
7.xx A*          230216 bsa  Justeringer basert på ny GUI og regler
     A*-----------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20091120  154039  BOF610      REL-V5R4M0  5722-WDS
     A            B1VALG    R        B  8  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 5)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1EANN    R        O  8  5REFFLD(VXEANN)
     A            B1VARE    R   -7   O  8 20REFFLD(VXVARE)
     A            B1TEK1    R        O  8 30REFFLD(VVTEK1)
     A            B1ODAT         6Y 0O  8 67EDTWRD('  .  .  ')
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20091123  093043  BOF610      REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CF04
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Spørring GTIN uten enhet  '
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
7.xx A                                  4  6'GTIN-nummer'
7.xx A                                      COLOR(WHT)
7.xx A                                  4 23'Varenr.'
     A                                      COLOR(WHT)
7.xx A            B2EANN    R        B  5  5REFFLD(VXEANN)
7.xx A  31                                  ERRMSGID(VMX0010 *LIBL/QMFOFAK 31)
7.xx A  32                                  ERRMSGID(VMX0020 *LIBL/QMFOFAK 32)
7.xx A                                      COLOR(YLW)
7.xx A  22                                  DSPATR(PC)
7.xx A                                      CHECK(RB)
7.xx A                                      OVRDTA
7.xx A                                  5 20'+'
7.xx A            B2VARE         8Y 0B  5 22COLOR(YLW)
7.xx A                                      EDTCDE(Z)
7.xx A                                      CHECK(RB)
7.xx A                                      OVRDTA
7.xx A**                                7 69'dato'
7.xx A**                                    COLOR(WHT)
7.xx A                                  6  2'5=Vis'
     A                                      COLOR(BLU)
7.xx A                                  7  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  7  6' GTIN-nummer '
7.xx A                                      COLOR(WHT)
7.xx A                                  7 20' Varenr.'
7.xx A                                      COLOR(WHT)
7.xx A                                  7 30'Varetekst              '
7.xx A                                      COLOR(WHT)
7.xx A                                  7 68'Oppr.dato'
7.xx A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20091124  131450  BOF610      REL-V5R4M0  5722-WDS
     A                                 23  2'F3=Gå tilbake   F4=Spørring   F5=F-
     A                                      orny             '
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20070305  123436  BOF550      REL-V5R4M0  5722-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Ordre/Fakturering'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Vedlikehold av GTIN-nummer'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'GTIN-nummer. . . . . . . . .'
     A            C1EANN    R        O  5 31REFFLD(VXEANN)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Varenummer . . . . . . . . .'
     A            C2VARE         8Y 0B  7 31COLOR(YLW)
     A  31                                  ERRMSGID(VMV0010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(VMV0020 *LIBL/QMFOFAK 32)
     A  30                                  DSPATR(PR)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C2TEK1    R        O  7 41REFFLD(VVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 16  2'Opprettet (dato/klokkeslett)'
     A            C2ODAT         6Y 0O 16 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 16 40'/'
     A            C2OTIM         6Y 0O 16 42COLOR(YLW)
     A                                      EDTWRD('  :  :  ')
     A                                      OVRDTA
     A                                 19  2'Sist endret dato . . . . . .'
     A            C2EDAT         6Y 0O 19 31COLOR(YLW)
     A                                      EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                 20  2'Endret av. . . . . . . . . .'
     A            C2EUSR    R        O 20 31REFFLD(VXEUSR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake   F4=Spørring'
     A                                      COLOR(BLU)
