     A*%%TS  SD  20030124  103803  MHA         REL-V5R1M0  5722-WDS
     A*%%EC
7.xx A* 040316 bsa Endringer relatert til ny GUI
7.01 A* 210819 nho Nytt program, spørring på Returkode
     A*---------------------------------------------------------------
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/FFRF FFRFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20020226  120814  HKO         REL-V5R1M0  5722-WDS
     A            B1VALG    R        B  7  2REFFLD(FÅVALG)
     A                                      COLOR(YLW)
     A                                      VALUES(0 1)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A            B1DKOD         1A  O  7  6
     A            B1DTXT    R        O  7 11REFFLD(VYBESK)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20020226  120814  HKO         REL-V5R1M0  5722-WDS
     A                                      WINDOW(B2CMD)
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A                                  2  2' Velge returkode     '
     A                                      DSPATR(RI)
7.xx A                                  3  5'Returkode    '
7.xx A                                      COLOR(WHT)
7.xx A                                  3 23'(kode)'
7.xx A                                      COLOR(WHT)
7.xx A                                  4  5'Beskrivelse'
7.xx A                                      COLOR(WHT)
7.xx A                                  5  2'1=Velg'
     A                                      COLOR(BLU)
7.xx A                                  6  2'V'
7.xx A                                      COLOR(WHT)
7.xx A                                  6  5'Kode'
7.xx A                                      COLOR(WHT)
7.xx A                                  6 11'Beskrivelse'
     A                                      COLOR(WHT)
7.xx A            B2DKOD         1A  B  3 19
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      OVRDTA
7.xx A            B2DTXT    R   -7   B  4 19REFFLD(VYBESK)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                      OVRDTA
     A          R B2CMD
     A*%%TS  SD  20030124  103803  MHA         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 18 46)
     A                                 17  2'F3=Gå tilbake   F5=Forny'
     A                                      COLOR(BLU)
     A          R ASUME                     ASSUME
     A                                 24 79' '
