     A*%%TS  SD  20140616  124528  SST620      REL-V7R1M0  5770-WDS
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A* System. . . . . : ASCOMP
     A* Format. . . . . : XC060D
     A* Beskrivelse . . : Compello, integrasjon justering feiltranser
     A*
     A* Spesialversjon. :
     A* Tilpasset for . :
     A*
     A* Ref.   Dato  Sign Endringsveskrivelse
     A* ----- ------ ---- -------------------------------------------------
     A*       211211 sst  Nytt program
     A*
     A*
     A* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RCOMPF RCOMPFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20120410  150603  SST620      REL-V7R1M0  5770-WDS
     A            B1HUID    R        H      REFFLD(RCHUID)
     A            B1VALG         1A  B  8  2COLOR(YLW)
     A                                      VALUES(' ' '2' '4' '5')
     A                                      CHKMSGID(RM00010 *LIBL/QMFOKON)
     A            B1FIRM    R        O  8  5REFFLD(RCFIRM)
     A  41                                  COLOR(BLU)
     A            B1BILN         8A  O  8 10
     A  41                                  COLOR(BLU)
     A            B1RPER    R        O  8 19REFFLD(RCRPER)
     A  41                                  COLOR(BLU)
     A            B1BDAT        10   O  8 26
     A  41                                  COLOR(BLU)
     A            B1DKTO        10   O  8 37
     A  41                                  COLOR(BLU)
     A            B1BELO        15   O  8 48
     A  41                                  COLOR(BLU)
     A            B1KKTO        10   O  8 64
     A  41                                  COLOR(BLU)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20120410  140231  SST620      REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CA03
     A                                      CA05
     A                                      CF06
     A                                      CA12
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Compello'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'5=Vis                             -
     A                                               '
     A                                      COLOR(BLU)
     A                                  6  2'V  Firm Bil.nr'
     A                                      COLOR(WHT)
     A            B2FIRM    R        B  7  5REFFLD(RCFIRM)
     A                                      COLOR(YLW)
     A                                      CHECK(RZ)
     A                                      OVRDTA
     A            B2BILN         8A  B  7 10COLOR(YLW)
     A                                      OVRDTA
     A            B2HUID    R        H      REFFLD(RCHUID)
     A                                  6 18'Periode  Bilagsdato  Deb.kto      -
     A                                      Beløp         Kre.kto       '
     A                                      COLOR(WHT)
     A                                  2  2'Visning av transer fra Compello'
     A                                      COLOR(WHT)
     A*%%         B2RAAR    R        B  7 16REFFLD(RCRAAR)
     A*%%                                   COLOR(YLW)
     A*%%                                   CHECK(RZ)
     A*%%                                   OVRDTA
     A          R B2CMD
     A*%%TS  SD  20010919  105848  HKO         REL-V4R4M0  5769-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny   F6=Oppr-
     A                                      ett'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20120113  120627  ASP_620     REL-V7R1M0  5770-WDS
     A                                      CA02
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW     W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
     A            L_FNAV        30A  O  1  2COLOR(WHT)
     A                                  1 46'Compello'
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
     A                                  2  2'Justering av feiltranser'
     A                                      COLOR(WHT)
     A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
     A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Firma . .:'
     A            C2FIRM    R        B  5 15REFFLD(RCFIRM)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  42                                  DSPATR(PC)
     A                                  6  2'Bilagsnr.:'
     A            C2BILN    R        B  6 15REFFLD(RCBILN)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A  43                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A*%                                6 32'År . . . :'
     A*%          C2RAAR    R        B  6 43REFFLD(RCRAAR)
     A*%30                                  DSPATR(PR)
     A*%                                    COLOR(YLW)
     A*%44                                  DSPATR(PC)
     A            C2RPER    R        B  6 43REFFLD(RCRPER)
     A                                      CHECK(LC)
     A  30                                  DSPATR(PR)
     A  45                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  7  2'Bilagskode'
     A            C2BILK    R        B  7 15REFFLD(RCBILK)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A  30                                  DSPATR(PR)
     A  46                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      CHECK(LC)
     A                                  7 32'Bilagsdato'
     A            C2BDAT    R        B  7 43REFFLD(RCBDAT)
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A  30                                  DSPATR(PR)
     A  47                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  8  2'Beløp. . :'
     A            C2BELO    R        B  8 15REFFLD(RCBELO)
     A                                      DSPATR(UL)
     A  30                                  DSPATR(PR)
     A  48                                  DSPATR(PC)
     A                                      OVRDTA
     A                                      COLOR(YLW)
     A                                  9  2'DebetAvd.'
     A            C2DAVD    R        B  9 15REFFLD(RCDAVD)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A  49                                  DSPATR(PC)
     A                                  9 33'Konto:'
     A            C2DKTO    R        B  9 40REFFLD(RCDKTO)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  50                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  9 48'Spes.:'
     A            C2DSPS    R        B  9 55REFFLD(RCDSPS)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  51                                  DSPATR(PC)
     A                                      OVRDTA
     A                                  9 61'MvaKod:'
     A            C2DMVA    R        B  9 69REFFLD(RCDMVA)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  52                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 10  2'Kred.Avd.'
     A            C2CAVD    R        B 10 15REFFLD(RCCAVD)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A  53                                  DSPATR(PC)
     A                                 10 33'Konto:'
     A            C2CKTO    R        B 10 40REFFLD(RCCKTO)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  54                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 10 48'Spes.:'
     A            C2CSPS    R        B 10 55REFFLD(RCCSPS)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  55                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 10 61'MvaKod:'
     A            C2CMVA    R        B 10 69REFFLD(RCCMVA)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  56                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 11  2'ForfallsD'
     A            C2FDAT    R        B 11 15REFFLD(RCFDAT)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  57                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 11 33'ValutaBel'
     A            C2VALB    R        B 11 44REFFLD(RCVALB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A  58                                  DSPATR(PC)
     A                                 11 61'Valutakod'
     A            C2VALK    R        B 11 71REFFLD(RCVALK)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  59                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 12  2'Bil.Tekst'
     A            C2TEXT    R        B 12 15REFFLD(RCTEXT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A  30                                  DSPATR(PR)
     A  60                                  DSPATR(PC)
     A                                 13  2'LevFaktNr'
     A            C2LFAK    R        B 13 15REFFLD(RCLFAK)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  61                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 14  2'Kid . . :'
     A            C2KIDI    R        B 14 15REFFLD(RCKIDI)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  62                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 15  2'Prosjekt:'
     A            C2PROS    R        B 15 15REFFLD(RCPROS)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  63                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 15 33'Aktivitet:'
     A            C2AKTI    R        B 15 44REFFLD(RCAKTI)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  64                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 16  2'Endret Dato'
     A            C2EDAT    R        B 16 15REFFLD(RCEDAT)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  33                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 16 33'Endret tid'
     A            C2ETIM    R        B 16 44REFFLD(RCETIM)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A  33                                  DSPATR(PC)
     A                                      OVRDTA
     A                                 19  2'Feilmeld:'
     A            C2FEIL    R        O 19 15REFFLD(RCFEIL)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23 16'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A                                 23 32'F4=Spørring'
     A                                      COLOR(BLU)
     A                                 17  2'CompHUID:'
     A            C2HUID    R        O 17 15REFFLD(RCHUID)
     A                                      TEXT('Comello Id')
     A                                  5 32'Firma.'
     A                                  5 39'.'
     A                                  5 41':'
     A                                  6 32'Periode:'
     A                                  6 51'(ååååmm)'
     A          R D1WIN
     A*%%TS  SD  20020821  225320  KOB         REL-V5R1M0  5722-WDS
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette linje '
     A                                      DSPATR(RI)
     A            D1FIRM    R        O  5 21REFFLD(RCFIRM)
     A                                  6  2'Bilagsnummer . . .'
     A            D1BILN    R        O  6 21REFFLD(RCBILN)
     A                                  7  2'Beskrivelse. . . .'
     A            RCTEXT    R        O  8 12
     A            D1HUID    R        H      REFFLD(RCHUID)
     A                                 14  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
