     A*%%TS  SD  20151118  154224  BOF620      REL-V7R1M0  5770-WDS
     A*%%EC
8.cl A                                      DSPSIZ(24 80 *DS3 -
8.cl A                                             27 132 *WIDE)
     A                                      REF(*LIBL/XVGVPF XVGVPFR)
     A                                      PRINT
     A                                      HOME(21)
     A          R B1SFL                     SFL
     A*%%TS  SD  20001006  104224  HKO         REL-V4R4M0  5769-PW1
8.cl A            B1VALG         1Y 0B  8  2COLOR(YLW)
     A                                      VALUES(0 2 3 4 5)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      EDTCDE(Z)
8.cl A            B1NOBB    R        O  8  5REFFLD(XVNOBB)
8.cl A            B1TEK1    R   20   O  8 14REFFLD(XVTEK1)
8.cl A            B1LDOR    R        O  8 36REFFLD(XVLDOR)
8.cl A            B1LDOX        15A  O  8 43
8.cl A            B1FOGR    R        O  8 60REFFLD(XVFOGR)
8.cl A            B1FHGR    R        O  8 63REFFLD(XVFHGR)
8.cl A            B1FUGR    R        O  8 66REFFLD(XVFUGR)
8.cl A            B1TOGR    R        O  8 71REFFLD(XVTOGR)
8.cl A            B1THGR    R        O  8 74REFFLD(XVTHGR)
8.cl A            B1TUGR    R        O  8 77REFFLD(XVTUGR)
     A          R B2CTL                     SFLCTL(B1SFL)
     A*%%TS  SD  20151118  154224  BOF620      REL-V7R1M0  5770-WDS
8.cl A                                      SFLSIZ(0015)
8.cl A                                      SFLPAG(0014)
     A                                      ROLLUP(10)
     A                                      ROLLDOWN(11)
     A                                      CF01
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      OVERLAY
     A                                      PUTOVR
     A  12                                  SFLDSP
     A  13                                  SFLDSPCTL
     A  14                                  SFLCLR
     A  15                                  SFLEND(*MORE)
     A                                      SFLCSRRRN(&W_CURN)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_VIRN         4S 0H      SFLRCDNBR(CURSOR)
     A            W_CURN         5S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
8.cl A            L_FNAV        30A  O  1  2COLOR(WHT)
8.cl A                                  1 46SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
8.cl A                                  2  2'Vedlikehold av vare i varegruppeko-
     A                                      nvert.'
     A                                      COLOR(WHT)
8.cl A                                  2 46'Bruker:'
8.cl A                                      COLOR(WHT)
8.cl A                                  2 54USER
8.cl A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
8.cl A                                  4  2'Velg og trykk Enter.'
8.cl A                                      COLOR(BLU)
8.cl A                                  5  2'Valg'
8.cl A                                      COLOR(WHT)
8.cl A            B2VALG         1Y 0B  5  7COLOR(YLW)
     A                                      VALUES(0 1 2 3 4 5)
     A                                      CHKMSGID(FM00010 *LIBL/QMFOFAK)
     A                                      EDTCDE(Z)
8.cl A                                  5  9'Varenr'
8.cl A                                      COLOR(WHT)
8.cl A            B2NOBB    R        B  5 16REFFLD(XVNOBB)
     A  31                                  ERRMSGID(FMX0010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FMX0020 *LIBL/QMFOFAK 32)
     A                                      COLOR(YLW)
     A  22                                  DSPATR(PC)
     A                                      OVRDTA
8.cl A                                  5 25'Gml.vgrp'
8.cl A                                      COLOR(WHT)
8.cl A            B2FOGR    R        B  5 34REFFLD(XVFOGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.cl A            B2FHGR    R        B  5 37REFFLD(XVFHGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.cl A            B2FUGR    R        B  5 40REFFLD(XVFUGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.cl A                                  5 55'Gml vgrp'
8.cl A                                      COLOR(WHT)
8.cl A                                  5 71'Ny vgrp'
8.cl A                                      COLOR(WHT)
8.cl A                                  6  3'1=Opprett  2=Endre  3=Kopiere  4=S-
     A                                      lette  5=Vise'
     A                                      COLOR(BLU)
8.cl A                                  7  2'V'
8.cl A                                      COLOR(WHT)
8.cl A                                  7  5'Varenr.'
8.cl A                                      COLOR(WHT)
8.cl A                                  7 14'Beskrivelse         '
8.cl A                                      COLOR(WHT)
8.cl A                                  7 36'Lev.nr'
8.cl A                                      COLOR(WHT)
8.cl A                                  7 43'Lev.          '
8.cl A                                      COLOR(WHT)
8.cl A                                  7 60'Og'
8.cl A                                      COLOR(WHT)
8.cl A                                  7 63'Hg'
8.cl A                                      COLOR(WHT)
8.cl A                                  7 66'Ugr'
8.cl A                                      COLOR(WHT)
8.cl A                                  7 71'Og'
8.cl A                                      COLOR(WHT)
8.cl A                                  7 74'Hg'
8.cl A                                      COLOR(WHT)
8.cl A                                  7 77'Ugr'
8.cl A                                      COLOR(WHT)
     A          R B2CMD
     A*%%TS  SD  20001010  084551  HKO         REL-V4R4M0  5769-PW1
     A                                 23  2'F3=Gå tilbake   F5=Forny  -
     A                                         F1=Filter'
     A                                      COLOR(BLU)
     A          R C1BLD
     A*%%TS  SD  19990608  125634  HKO         REL-V4R2M0  5769-PW1
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
8.cl A            L_FNAV        30A  O  1  2COLOR(WHT)
8.cl A                                  1 46SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
8.cl A                                  2  2'Opprette vare i varegr.konverterin-
     A                                      g'
     A                                      COLOR(WHT)
8.cl A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
8.cl A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A                                  5  2'Varenummer . . . . . . . . .'
     A            C1NOBB    R        B  5 31REFFLD(XVNOBB)
     A  31                                  ERRMSGID(FMX0010 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A          R C1MSG
     A*%%TS  SD  19990608  125634  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 7 30)
     A                                      CA03
     A                                      CA12
     A                                  2  2'Vare (vgr-konvertering) '
     A                                  3  2'finnes fra før'
     A                                  6  2'F3=Gå tilbake   F12=Annuler'
     A                                      COLOR(BLU)
     A          R C2BLD
     A*%%TS  SD  20151013  143612  BOF620      REL-V7R1M0  5770-WDS
     A                                      CA03
     A                                      CF04
     A                                      CA12
     A                                      PUTOVR
     A                                      CSRLOC(W_AROW W_ACOL)
     A                                      RTNCSRLOC(*WINDOW &W_AROW &W_ACOL)
     A                                      RTNCSRLOC(&W_ARCD &W_AFLD)
     A            W_AROW         3S 0H
     A            W_ACOL         3S 0H
     A            W_ARCD        10A  H
     A            W_AFLD        10A  H
8.cl A            L_FNAV        30A  O  1  2COLOR(WHT)
8.cl A                                  1 46SYSNAME
     A                                      COLOR(WHT)
     A                                  1 66'Kl. :'
     A                                      COLOR(WHT)
     A                                  1 72TIME
     A                                      COLOR(WHT)
8.cl A                                  2  2'Vedlikehold av varegruppekonverter-
     A                                      ing'
     A                                      COLOR(WHT)
8.cl A                                  2 46'Bruker:'
     A                                      COLOR(WHT)
8.cl A                                  2 54USER
     A                                      COLOR(WHT)
     A                                  2 66'Dato:'
     A                                      COLOR(WHT)
     A                                  2 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(WHT)
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      COLOR(WHT)
     A            C2NYEN        11A  O  4 69DSPATR(RI)
     A                                      OVRDTA
     A                                  5  2'Nobbnr (Varenr)  . . . . . .'
     A            C1NOBB    R        O  5 31REFFLD(XVNOBB)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.cl A            C1TEK1    R        O  5 40REFFLD(XVTEK1)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.cl A            C1LDOR    R        O  6 31REFFLD(XVLDOR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
8.cl A            C2LDOT        35A  O  6 38COLOR(YLW)
     A                                      OVRDTA
     A                                  7  2'Fra Varegruppe . . . . . . .'
     A            C2FOGR    R        O  7 31REFFLD(XVFOGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2FHGR    R        O  7 34REFFLD(XVFHGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2FUGR    R        O  7 37REFFLD(XVFUGR)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A            C2FGRT    R        O  7 41REFFLD(XVFGRT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  9  2'Ny varegruppe  . . . . . . .'
     A            C2TOGR    R        B  9 31REFFLD(XVTOGR)
     A  31                                  ERRMSGID(VMG3020 *LIBL/QMFOFAK 31)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2THGR    R        B  9 34REFFLD(XVTOGR)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      OVRDTA
     A            C2TUGR    R        B  9 37REFFLD(XVTUGR)
     A                                      COLOR(YLW)
     A  30                                  DSPATR(PR)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A            C2TGRT    R        O  9 41REFFLD(XVTGRT)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                 23  2'F3=Gå tilbake'
     A                                      COLOR(BLU)
     A          R D1WIN
     A*%%TS  SD  19990608  125634  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(S1WIN)
     A                                      CA03
     A                                      CA12
     A                                  2  2' Slette varenr i varegruppe-konver-
     A                                      tering '
     A                                      DSPATR(RI)
     A                                  4  2'Varegnr  . . . .'
     A            D1NOBB    R        O  4 21REFFLD(XVNOBB)
     A            D1TEK1    R        O  5 21REFFLD(XVTEK1)
     A                                 14  2'F3=Gå tilbake   F12=Annuler'
     A                                      COLOR(BLU)
     A          R K1WIN
     A*%%TS  SD  19990608  125634  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(S1WIN)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2' Kopiere til: '
     A                                      DSPATR(RI)
     A                                  4  2'Varenr. . . . . .'
     A            K1NOBB    R        B  4 21REFFLD(XVNOBB)
     A  31                                  ERRMSGID(FMX0010 *LIBL/QMFOFAK 31)
     A  32                                  ERRMSGID(FMX0030 *LIBL/QMFOFAK 33)
     A                                      COLOR(YLW)
     A                                      OVRDTA
     A                                  6  2' Kopiere fra: '
     A                                      DSPATR(RI)
     A                                  8  2'Varenr . . . . .'
     A            XVNOBB    R        O  8 21DSPATR(UL)
     A            XVTEK1    R        O  9 21DSPATR(UL)
     A                                  9  2'Beskrivelse. . . .'
     A                                 14  2'F3=Gå tilbake   F12=Annuler'
     A                                      COLOR(BLU)
     A          R F1WIN
     A*%%TS  SD  19990608  125634  HKO         REL-V4R2M0  5769-PW1
     A                                      WINDOW(*DFT 15 56)
     A                                      CA03
     A                                      CA12
     A                                      PUTOVR
     A                                  2  2'Filter for visning :'
     A                                      COLOR(WHT)
     A                                  4  2'Vis kun ikke utfylte  . . .'
     A            F1IKKE    R        B  4 31REFFLD(XVOMSE)
     A                                      COLOR(YLW)
     A                                  4 34'1=Ja'
     A                                 14  2'F3=Gå tilbake   F12=Annuler'
     A                                      COLOR(BLU)
     A          R S1WIN
     A*%%TS  SD  19931028  171434  AMD         REL-V2R2M0  5738-PW1
     A                                      WINDOW(*DFT 15 56)
