     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : FR100R
      * Beskrivelse . . : Rabattmatrise, vedlikehold
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
      *       190199 HKO  Nytt program
      *       170300 HKO  Lagt inn leverandør som nivå i rabattmatrisen
      *       150503 HKO  Lagt inn kundekategori som nivå i rabattmatrisen
      *       151103 HKO  Erstattet rabattgruppe med varegruppe og modulnr
      *                   Kan kombinere varegruppe med leverandør
      *                   Lagt inn rabatt på bunnpris
      *                   Lagt inn filter
      *       080104 HKO  Åpnet for 0%-rabatt
      *       140504 HKO  Kan legge inn varer fra VA
      *       300605 HKO  Åpnet for generell rabatt
5.70  * PRGR  221008 BOF  Utvidet med prisgruppe
5.71  *       080210 bof  Prisgruppe ved kall til FR700R               l
      *
      * 6.10  250609 BSA  Oppdatert med sporingsinformasjon
6.nu  * R6.30 030614 bsa  Programmet gjennomgått mtp nummerutvidelser.
6.41  * R6.40 110118 bof  Utvidet med påslag
      *
7.xx  * 7.00  240216 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS
7.01  *K00  070620 BOF NXS-4138  Kunne kombinere rabattkat.og kundekat.i rab.matr.
      *
8.01  *PRG2   100622 BOF  Utvidet prisgruppe fra 1 til 2 posisjoner
8.02  *PRG2   080822 bsa  Setter kode for søkefelt, da det forsvant når feltet
8.02  *PRG2               prisgruppe ble utvidet.
8.03  *PRG2   080822 bsa  Skrevet om til bredt skjermbilde pga at den feiler ved
8.03  *PRG2               utvidels av felt og bruk av newlook designer.
8.04  *K00  030522 sst NXS-12523 Oppdatering av rabattmatrise fra excel
8.05  *K00  290082 sst NXS-12523 Styre brukertilgang via adgangskontroll
8.06  *K00  020424 bsa    Justert pga umerkede endringer i skjermfila.
      *
9.01  *       180615 bof  Kun enkelte brukere har tilgang til å endre prgr=' '
9.01  *                   FBKO19 styrer hvilke brukere - b_mast (masterbruker)
9.01  *                   For bruker i en prisgr
9.01  *                       - kun kopiere fra prisgr=' '
9.01  *                       - lov til å slette / endre med egen prisgr.
9.01  *                       - lov til å se egen og blank prisgr.
9.01  *                       - love til selektere bort prisgr=' ' hvis egen.
9.02  *        080218 bof     - love til selektere bort prisgr=' ' hvis egen.
9.03  *K000 120925 bsa    Ny F tast for kopiering av rabatt.
9.04  *K000 031125 bsa    Legger inn spørreprogram på prisgruppe
      *
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      *  Bruk av indikatorer:
      *
      *       LR = Avslutt program
      *       10 = Rollup
      *       11 = Rolldown
      *       12 = Sfldsp
      *       13 = Sfldspctl
      *       14 = Sflclr
      *       15 = Sflend
      *       21 = Home-key
      *       22 = Plassering av cursor
      *       30 = Protect av felter ved vise
      *    31-79 = Varsle m/feilmeldinger/skjermindikatorer
      *    80-99 = Arbeidsindikatorer
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     ffrablr    if   e           k disk    rename(frabpfr:frablrr)
     ffrablu    uf a e           k disk    rename(frabpfr:frablur)
     ffrabl1    if   e           k disk    rename(frabpfr:frabl1r)
5.70 ffrabld    if   e           k disk    rename(frabpfr:frabldr)
     ffrabl2    if   e           k disk    rename(frabpfr:frabl2r)
     ffrabl3    if   e           k disk    rename(frabpfr:frabl3r)
     ffrabl4    if   e           k disk    rename(frabpfr:frabl4r)
     ffrabl5    if   e           k disk    rename(frabpfr:frabl5r)
     ffrabl6    if   e           k disk    rename(frabpfr:frabl6r)
     ffrabl7    if   e           k disk    rename(frabpfr:frabl7r)
     ffrabl8    if   e           k disk    rename(frabpfr:frabl8r)
     ffrabl9    if   e           k disk    rename(frabpfr:frabl9r)
     ffrabla    if   e           k disk    rename(frabpfr:frablar)
     ffrablb    if   e           k disk    rename(frabpfr:frablbr)
     ffrablc    if   e           k disk    rename(frabpfr:frablcr)
     fra06pf    if   e           k disk    rename(ra06pfr:ra06pfr)
5.70 fra30lr    if   e           k disk    rename(ra30pfr:ra30lrr)
     fra11pf    if   e           k disk    rename(ra11pfr:ra11pfr)
     frkunl1    if   e           k disk    rename(rkunpfr:rkunl1r)
     ffkprl1    if   e           k disk    rename(fkprpfr:fkprl1r)
     fvogrl1    if   e           k disk    rename(vogrpfr:vogrl1r)
     fvhgrl1    if   e           k disk    rename(vhgrpfr:vhgrl1r)
     fvugrl1    if   e           k disk    rename(vugrpfr:vugrl1r)
     frlevl1    if   e           k disk    rename(rlevpfr:rlevl1r)
     fvvarl1    if   e           k disk    rename(vvarpfr:vvarl1r)
     fvvarlb    if   e           k disk    rename(vvarpfr:vvarlbr)
     fvenhl1    if   e           k disk    rename(venhpfr:venhl1r)
     fvltpl1    if   e           k disk    rename(vltppfr:vltpl1r)
     fjvarl1    if   e           k disk    rename(jvarpfr:jvarl1r)
9.01 ffusrl1    if   e           k disk    rename(fusrpfr:fusrl1r)
9.03 fausrl1    if   e           k disk    rename(ausrpfr:ausrl1r)
      *
     ffr100d    cf   e             workstn sfile(b1sfl:w_srrn)
     f                                     infds(dspfbk)
      *
      * Definering av Local data area
      *
     d                uds
     d l_user                911    920
8.04 d l_lib                 934    943
     d l_firm                944    946  0
     d l_fnav                951    980
      *
      * Definering av Information Data Structure - display feedback
      *
     d dspfbk          ds
     d  d_fcrn               378    379I 0
      *
      * Definering av variable i nøkler
      *
5.70 d frablr_prgr     s                   like(frprgr)
     d frablr_rkat     s                   like(frrkat)
     d frablr_kkat     s                   like(frkkat)
     d frablr_kund     s                   like(frkund)
     d frablr_kpro     s                   like(frkpro)
     d frablr_ogrp     s                   like(frogrp)
     d frablr_hgrp     s                   like(frhgrp)
     d frablr_ugrp     s                   like(frugrp)
     d frablr_ldor     s                   like(frldor)
     d frablr_modn     s                   like(frmodn)
     d frablr_vare     s                   like(frvare)
     d frablr_enhe     s                   like(frenhe)
     d frablr_lety     s                   like(frlety)
5.70 d frablu_prgr     s                   like(frprgr)
     d frablu_rkat     s                   like(frrkat)
     d frablu_kkat     s                   like(frkkat)
     d frablu_kund     s                   like(frkund)
     d frablu_kpro     s                   like(frkpro)
     d frablu_ogrp     s                   like(frogrp)
     d frablu_hgrp     s                   like(frhgrp)
     d frablu_ugrp     s                   like(frugrp)
     d frablu_ldor     s                   like(frldor)
     d frablu_modn     s                   like(frmodn)
     d frablu_vare     s                   like(frvare)
     d frablu_enhe     s                   like(frenhe)
     d frablu_lety     s                   like(frlety)
5.70 d frabl1_prgr     s                   like(frprgr)
     d frabl1_rkat     s                   like(frrkat)
     d frabl1_kkat     s                   like(frkkat)
     d frabl1_kund     s                   like(frkund)
     d frabl1_kpro     s                   like(frkpro)
     d frabl1_ogrp     s                   like(frogrp)
     d frabl1_hgrp     s                   like(frhgrp)
     d frabl1_ugrp     s                   like(frugrp)
     d frabl1_ldor     s                   like(frldor)
     d frabl1_modn     s                   like(frmodn)
     d frabl1_vare     s                   like(frvare)
     d frabl1_enhe     s                   like(frenhe)
     d frabl1_lety     s                   like(frlety)
5.70 d frabld_rkat     s                   like(frrkat)
     d frabl2_kkat     s                   like(frkkat)
     d frabl3_kund     s                   like(frkund)
     d frabl3_kpro     s                   like(frkpro)
     d frabl3_ogrp     s                   like(frogrp)
     d frabl3_hgrp     s                   like(frhgrp)
     d frabl3_ugrp     s                   like(frugrp)
     d frabl3_ldor     s                   like(frldor)
     d frabl4_kpro     s                   like(frkpro)
     d frabl5_ogrp     s                   like(frogrp)
     d frabl5_hgrp     s                   like(frhgrp)
     d frabl5_ugrp     s                   like(frugrp)
     d frabl6_hgrp     s                   like(frhgrp)
     d frabl6_ugrp     s                   like(frugrp)
     d frabl7_ugrp     s                   like(frugrp)
     d frabl8_ldor     s                   like(frldor)
     d frabl9_modn     s                   like(frmodn)
     d frabla_vare     s                   like(frvare)
5.70 d frabla_prgr     s                   like(frprgr)
     d frabla_enhe     s                   like(frenhe)
     d frabla_lety     s                   like(frlety)
     d frablb_enhe     s                   like(frenhe)
     d frablc_lety     s                   like(frlety)
     d ra06pf_fkod     s                   like(rafkod)
     d ra11pf_kkod     s                   like(rakkod)
5.70 d ra30lr_dkod     s                   like(redkod)
     d rkunl1_kund     s                   like(rkkund)
     d fkprl1_kund     s                   like(flkund)
     d fkprl1_kpro     s                   like(flkpro)
     d vogrl1_oogr     s                   like(vgoogr)
     d vhgrl1_hogr     s                   like(vghogr)
     d vhgrl1_hhgr     s                   like(vghhgr)
     d vugrl1_uogr     s                   like(vguogr)
     d vugrl1_uhgr     s                   like(vguhgr)
     d vugrl1_uugr     s                   like(vguugr)
     d rlevl1_levr     s                   like(rllevr)
     d vvarl1_vare     s                   like(vvvare)
     d vvarlb_nmod     s                   like(vvnmod)
     d venhl1_enhe     s                   like(vaeenh)
     d vltpl1_lety     s                   like(vylety)
     d jvarl1_vare     s                   like(jvvare)
9.01 d fusrl1_user     s                   like(fbuser)
      *
      * Definering av variable
      *
     d w_fcrn          s              4  0
     d w_stel          s              4  0
     d w_spge          s              4  0
     d w_srrn          s              4  0
     d w_sfrn          s                   like(w_srrn)
     d w_ssrn          s                   like(w_srrn)
      *
     d w_seqe          s              1
     d b_forn          s              1    inz(*off)
     d b_oppr          s              1    inz(*off)
     d b_anul          s              1    inz(*off)
     d b_feil          s              1    inz(*off)
     d b_inlr          s              1    inz(*off)
9.01 d b_mast          s              1    inz(*off)
9.01 d b_prok          s              1    inz(*off)
9.01 d b_funn          s              1    inz(*off)
9.03 d b_copy          s              1    inz(*off)
      *
     d w_dato_fra      s               d   datfmt(*iso)
     d w_dato_til      s               d   datfmt(*iso)
     d w_udat          s               d   datfmt(*iso)
     d w_utim          s               t   timfmt(*iso)
     d w_ra1f          s               d   datfmt(*iso)
     d w_ra1t          s               d   datfmt(*iso)
     d w_ra2f          s               d   datfmt(*iso)
     d w_ra2t          s               d   datfmt(*iso)
     d w_ranf          s               d   datfmt(*iso)
     d w_rant          s               d   datfmt(*iso)
     d w_rbuf          s               d   datfmt(*iso)
     d w_rbut          s               d   datfmt(*iso)
     d w_ratf          s               d   datfmt(*iso)
     d w_ratt          s               d   datfmt(*iso)
     d w_dekf          s               d   datfmt(*iso)
     d w_dekt          s               d   datfmt(*iso)
      *
     d w_mtxt          s             35
      *
     d w_firm          s                   like(frfirm)
     d w_prgr          s                   like(frprgr)
     d w_rkat          s                   like(frrkat)
     d w_kkat          s                   like(frkkat)
     d w_kund          s                   like(frkund)
     d w_kpro          s                   like(frkpro)
     d w_ogrp          s                   like(frogrp)
     d w_hgrp          s                   like(frhgrp)
     d w_ugrp          s                   like(frugrp)
     d w_ldor          s                   like(frldor)
     d w_modn          s                   like(frmodn)
     d w_vare          s                   like(frvare)
     d w_enhe          s                   like(vaeenh)
     d w_lety          s                   like(vylety)
5.70 d w_dtxt          s                   like(redtxt)
     d w_rtxt          s                   like(raftxt)
     d w_ktxt          s                   like(raktxt)
     d w_knav          s                   like(rknavn)
     d w_gtxt          s                   like(vgutxt)
     d w_lnav          s                   like(rlnavn)
     d w_vtxt          s                   like(vvtek1)
     d w_etxt          s                   like(vaetxt)
     d w_ltxt          s                   like(vybesk)
     d w_pnav          s                   like(flnavn)
9.01 d w_mld1          s             50
8.05 d w_tilgko        s             10
8.05 d w_rutine        s             10
8.05 d w_adv           s              3
8.05 d w_status        s             10
8.05 d frabmal         s             10    inz('FRABMAL   ')
8.05 d libadb          s             10    inz('ADB       ')
      *
5.70 d s_prgr          s                   like(frprgr)
     d s_rkat          s                   like(frrkat)
     d s_kkat          s                   like(frkkat)
     d s_kund          s                   like(frkund)
     d s_kpro          s                   like(frkpro)
     d s_ogrp          s                   like(frogrp)
     d s_hgrp          s                   like(frhgrp)
     d s_ugrp          s                   like(frugrp)
     d s_ldor          s                   like(frldor)
     d s_modn          s                   like(frmodn)
     d s_vare          s                   like(frvare)
     d s_enhe          s                   like(frenhe)
     d s_lety          s                   like(frlety)
      *
9.03 d s_nota          s                   like(frnota)
9.03 d s_pslm          s                   like(frpslm)
9.03 d s_rab1          s                   like(frrab1)
9.03 d s_ra1d          s                   like(frra1d)
9.03 d s_ra1f          s                   like(frra1f)
9.03 d s_ra1t          s                   like(frra1t)
9.03 d s_rab2          s                   like(frrab2)
9.03 d s_ra2d          s                   like(frra2d)
9.03 d s_ra2f          s                   like(frra2f)
9.03 d s_ra2t          s                   like(frra2t)
9.03 d s_rabn          s                   like(frrabn)
9.03 d s_rand          s                   like(frrand)
9.03 d s_ranf          s                   like(frranf)
9.03 d s_rant          s                   like(frrant)
9.03 d s_rabb          s                   like(frrabb)
9.03 d s_rabd          s                   like(frrabd)
9.03 d s_rbuf          s                   like(frrbuf)
9.03 d s_rbut          s                   like(frrbut)
9.03 d s_rabt          s                   like(frrabt)
9.03 d s_ratd          s                   like(frratd)
9.03 d s_ratf          s                   like(frratf)
9.03 d s_ratt          s                   like(frratt)
9.03 d s_dekn          s                   like(frdekn)
9.03 d s_dekd          s                   like(frdekd)
9.03 d s_dekf          s                   like(frdekf)
9.03 d s_dekt          s                   like(frdekt)
      *
      * Definering av konstanter
      *
8.03 d c_sfil          s              2  0 inz(15)
      *
      * Forklaring på spesielle felter
      * som benyttes ved sub-files.
      * - - - - - - - - - - - - - - - - -
      * w_fcrn - Første recordnummer på siden
      * w_stel - Subfile-teller
      * w_spge - Sidestørrelse i subfile (page)
      * w_srrn - Relativt recordnummer i subfile
      * w_sfrn - Første recordnummer på siste side
      * w_ssrn - Siste recordnummer på siste side
      * w_curn - Current recordnummer på siden
      * w_virn - Side og cursorplassering som skal vises
      * w_afld - Aktivt feltnavn
      * w_arow - Aktiv rad for cursor
      * w_acol - Aktiv kolonne for cursor
      *
      * Benyttede skjermbilder.
      * - - - - - - - - - - - - - - - - -
      * B1SFL  - B1 Subfile - record
      * B2CTL  - B2 Subfile - control record
      * B2CMD  - B2 Eget skjermbilde for CMD-taster
      * C1BLD  - C1 Skjermbilde for innlegging av nøkkel ved oppretting
      * C1MSG  - C1 Meldingsbilde for C1BLD
      * C2BLD  - C2 Skjermbilde for opprette/endre/vise
      * D1WIN  - D1 Vindu for slette (Delete)
      * K1WIN  - K1 Vindu for kopiere
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B2CTL Behandle åpningsbildet med subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Send Alt
      *
     c     b2taga        tag
      *
     c                   write     b2cmd
      *
      * Bare data
      *
     c     b2tagb        tag
      *
     c                   exsr      dsp_subfile                                  DSP SFL
8.05  *
8.05  * Sjekk om funkjsonstast er tillatt
8.05  *
8.05 c                   eval      w_adv = *blank
8.05 c                   select
8.05 c                   when      *inkh
8.05 c                   eval      w_adv = 'F08'
8.05 c                   other
8.05 c                   endsl
8.05 c                   if        w_adv <> *blank
8.05 c                   eval      w_tilgko = l_user
8.05 c                   eval      w_rutine = 'FR100R'
8.05 c                   eval      w_status = *blank
8.05 c                   call      'AD005R'
8.05 c                   parm                    w_tilgko
8.05 c                   parm                    w_rutine
8.05 c                   parm                    w_adv
8.05 c                   parm                    w_status
8.05 c                   if        w_status <> 'Ok'
8.05 c                   goto      b2tagb
8.05 c                   endif
8.05 c                   endif
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      avslutt
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      b2tagb
     c                   when      *inke
     c                   exsr      forny
     c                   goto      b2tagb
     c                   when      *inkf
9.02 c*                  if        b_mast = *off
9.02 c*                  exsr      PG_varsel2
9.02 c*                  goto      b2tagb
9.02 c*                  else
     c                   exsr      xc1bld
     c                   goto      b2taga
9.02 c*                  endif
8.04 c                   when      *inkh
8.04 c                   exsr      Excel
8.04 c                   goto      b2taga
9.03 c                   when      *inki
9.03 c                   exsr      copy_matrix
9.03 c                   goto      b2taga
     c                   when      *in10
     c                   exsr      crt_subfile
     c                   goto      b2tagb
     c                   when      *in11
     c                   exsr      bck_subfile
     c                   goto      b2tagb
     c                   when      *in21
     c                   eval      *in22 = *on
     c                   goto      b2taga
     c                   endsl
      *
      * Filter
      *
     c                   if        *inka
     c                   exsr      filter
     c                   goto      b2taga
     c                   endif
      *
      * Bytting mellom å vise ordinære rabatter/priser og datostyrte
      * rabatter/priser
      *
     c                   if        *inkx
     c                   if        *in80 = *off
     c                   eval      *in80 = *on
     c                   else
     c                   eval      *in80 = *off
     c                   endif
     c                   exsr      forny                                        TØM SFL
     c                   goto      b2taga
     c                   endif
      *
      * Posisjonering
      *
5.70 c                   if        b2prgr <> *blank or
5.70 c                             b2rkat <> 0 or
     c                             b2kkat <> 0 or
     c                             b2kund <> 0 or
     c                             b2kpro <> 0 or
     c                             b2ogrp <> 0 or
     c                             b2hgrp <> 0 or
     c                             b2ugrp <> 0 or
     c                             b2ldor <> 0 or
     c                             b2modn <> 0 or
     c                             b2vare <> *blank or
     c                             b2enhe <> *blank or
     c                             b2lety <> 0
     c                   exsr      posisjoner
     c                   goto      b2tagb
     c                   endif
      *
      * Behandling av subfile
      *
     c                   exsr      subfile
      *
     c                   goto      b2taga
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for fornying av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     forny         begsr
      *
     c                   if        w_fcrn <> 0
     c     w_fcrn        chain     b1sfl
     c                   endif
      *
     c                   select
     c                   when      w_seqe = 'A'
     c                   eval      frabl2_kkat = b1kkat
     c     frabl2_key    setll     frabl2
5.70 c                   when      w_seqe = 'R'
5.70 c                   eval      frabld_rkat = b1rkat
5.70 c     frabld_key    setll     frabld
     c                   when      w_seqe = 'K'
     c                   eval      frabl3_kund = b1kund
     c                   eval      frabl3_kpro = b1kpro
     c                   eval      frabl3_ogrp = b1ogrp
     c                   eval      frabl3_hgrp = b1hgrp
     c                   eval      frabl3_ugrp = b1ugrp
     c                   eval      frabl3_ldor = b1ldor
     c     frabl3_key    setll     frabl3
     c                   when      w_seqe = 'P'
     c                   eval      frabl4_kpro = b1kpro
     c     frabl4_key    setll     frabl4
     c                   when      w_seqe = 'O'
     c                   eval      frabl5_ogrp = b1ogrp
     c                   eval      frabl5_hgrp = b1hgrp
     c                   eval      frabl5_ugrp = b1ugrp
     c     frabl5_key    setll     frabl5
     c                   when      w_seqe = 'H'
     c                   eval      frabl6_hgrp = b1hgrp
     c                   eval      frabl6_ugrp = b1ugrp
     c     frabl6_key    setll     frabl6
     c                   when      w_seqe = 'U'
     c                   eval      frabl7_ugrp = b1ugrp
     c     frabl7_key    setll     frabl7
     c                   when      w_seqe = 'L'
     c                   eval      frabl8_ldor = b1ldor
     c     frabl8_key    setll     frabl8
     c                   when      w_seqe = 'M'
     c                   eval      frabl9_modn = b1modn
     c     frabl9_key    setll     frabl9
     c                   when      w_seqe = 'V'
     c                   eval      frabla_vare = b1vare
5.70 c                   eval      frabla_prgr = b1prgr
     c                   eval      frabla_enhe = b1enhe
     c                   eval      frabla_lety = b1lety
     c     frabla_key    setll     frabla
     c                   when      w_seqe = 'E'
     c                   eval      frablb_enhe = b1enhe
     c     frablb_key    setll     frablb
     c                   when      w_seqe = 'T'
     c                   eval      frablc_lety = b1lety
     c     frablc_key    setll     frablc
     c                   other
5.70 c                   eval      frabl1_prgr = b1prgr
     c                   eval      frabl1_rkat = b1rkat
     c                   eval      frabl1_kkat = b1kkat
     c                   eval      frabl1_kund = b1kund
     c                   eval      frabl1_kpro = b1kpro
     c                   eval      frabl1_ogrp = b1ogrp
     c                   eval      frabl1_hgrp = b1hgrp
     c                   eval      frabl1_ugrp = b1ugrp
     c                   eval      frabl1_ldor = b1ldor
     c                   eval      frabl1_modn = b1modn
     c                   eval      frabl1_vare = b1vare
     c                   eval      frabl1_enhe = b1enhe
     c                   eval      frabl1_lety = b1lety
     c     frabl1_key    setll     frabl1
     c                   endsl
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c     end_forny     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for posisjonering i subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     posisjoner    begsr
      *
      * Posisjoner startverdi på rabattkategori
      *
5.70 c                   if        b2prgr <> *blank
     c                   eval      w_seqe = *blank
5.70 c                   eval      frabl1_prgr = b2prgr
     c                   eval      frabl1_rkat = b2rkat
     c                   eval      frabl1_kkat = b2kkat
     c                   eval      frabl1_kund = b2kund
     c                   eval      frabl1_kpro = b2kpro
     c                   eval      frabl1_ogrp = b2ogrp
     c                   eval      frabl1_hgrp = b2hgrp
     c                   eval      frabl1_ugrp = b2ugrp
     c                   eval      frabl1_ldor = b2ldor
     c                   eval      frabl1_modn = b2modn
     c                   eval      frabl1_vare = b2vare
     c                   eval      frabl1_enhe = b2enhe
     c                   eval      frabl1_lety = b2lety
     c     frabl1_key    setll     frabl1
     c                   goto      end_pos
     c                   endif
      *
7.01 c                   if        b2rkat <> 0 and
7.01 c                             b2kkat <> 0
7.01 c                   eval      w_seqe = *blank
7.01 c                   eval      frabl1_prgr = b2prgr
7.01 c                   eval      frabl1_rkat = b2rkat
7.01 c                   eval      frabl1_kkat = b2kkat
7.01 c                   eval      frabl1_kund = b2kund
7.01 c                   eval      frabl1_kpro = b2kpro
7.01 c                   eval      frabl1_ogrp = b2ogrp
7.01 c                   eval      frabl1_hgrp = b2hgrp
7.01 c                   eval      frabl1_ugrp = b2ugrp
7.01 c                   eval      frabl1_ldor = b2ldor
7.01 c                   eval      frabl1_modn = b2modn
7.01 c                   eval      frabl1_vare = b2vare
7.01 c                   eval      frabl1_enhe = b2enhe
7.01 c                   eval      frabl1_lety = b2lety
7.01 c     frabl1_key    setll     frabl1
7.01 c                   goto      end_pos
7.01 c                   endif
      *
5.70  * Posisjoner startverdi på rabattkategori
      *
5.70 c                   if        b2rkat <> 0
5.70 c                   eval      w_seqe = 'R'
5.70 c                   eval      frabld_rkat = b2rkat
5.70 c     frabld_key    setll     frabld
5.70 c                   goto      end_pos
5.70 c                   endif
      *
      * Posisjoner startverdi på kundekategori
      *
     c                   if        b2kkat <> 0
     c                   eval      w_seqe = 'A'
     c                   eval      frabl2_kkat = b2kkat
     c     frabl2_key    setll     frabl2
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på kunde
      *
     c                   if        b2kund <> 0
     c                   eval      w_seqe = 'K'
     c                   eval      frabl3_kund = b2kund
     c                   eval      frabl3_kpro = b2kpro
     c                   eval      frabl3_ogrp = b2ogrp
     c                   eval      frabl3_hgrp = b2hgrp
     c                   eval      frabl3_ugrp = b2ugrp
     c                   eval      frabl3_ldor = b2ldor
     c     frabl3_key    setll     frabl3
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på kundeprosjekt
      *
     c                   if        b2kpro <> 0
     c                   eval      w_seqe = 'P'
     c                   eval      frabl4_kpro = b2kpro
     c     frabl4_key    setll     frabl4
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på overgruppe
      *
     c                   if        b2ogrp <> 0
     c                   eval      w_seqe = 'O'
     c                   eval      frabl5_ogrp = b2ogrp
     c                   eval      frabl5_hgrp = b2hgrp
     c                   eval      frabl5_ugrp = b2ugrp
     c     frabl5_key    setll     frabl5
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på hovedgruppe
      *
     c                   if        b2hgrp <> 0
     c                   eval      w_seqe = 'H'
     c                   eval      frabl6_hgrp = b2hgrp
     c                   eval      frabl6_ugrp = b2ugrp
     c     frabl6_key    setll     frabl6
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på undergruppe
      *
     c                   if        b2ugrp <> 0
     c                   eval      w_seqe = 'U'
     c                   eval      frabl7_ugrp = b2ugrp
     c     frabl7_key    setll     frabl7
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på leverandør
      *
     c                   if        b2ldor <> 0
     c                   eval      w_seqe = 'L'
     c                   eval      frabl8_ldor = b2ldor
     c     frabl8_key    setll     frabl8
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på modulnr
      *
     c                   if        b2modn <> 0
     c                   eval      w_seqe = 'M'
     c                   eval      frabl9_modn = b2modn
     c     frabl9_key    setll     frabl9
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på vare
      *
     c                   if        b2vare <> *blank
     c                   eval      w_seqe = 'V'
     c                   eval      frabla_vare = b2vare
5.70 c                   eval      frabla_prgr = b2prgr
     c                   eval      frabla_enhe = b2enhe
     c                   eval      frabla_lety = b2lety
     c     frabla_key    setll     frabla
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på enhet
      *
     c                   if        b2enhe <> *blank
     c                   eval      w_seqe = 'E'
     c                   eval      frablb_enhe = b2enhe
     c     frablb_key    setll     frablb
     c                   goto      end_pos
     c                   endif
      *
      * Posisjoner startverdi på leveringstype
      *
     c                   if        b2lety <> 0
     c                   eval      w_seqe = 'T'
     c                   eval      frablc_lety = b2lety
     c     frablc_key    setll     frablc
     c                   goto      end_pos
     c                   endif
      *
     c     end_pos       tag
      *
      * Blanker subfile, og fyller opp i.h.t. posisjonering
      *
     c                   eval      *in22 = *off
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
      * Blanker posisjoneringsfelter
      *
5.70 c                   eval      b2prgr = *blank
     c                   eval      b2rkat = 0
     c                   eval      b2kkat = 0
     c                   eval      b2kund = 0
     c                   eval      b2kpro = 0
     c                   eval      b2ogrp = 0
     c                   eval      b2hgrp = 0
     c                   eval      b2ugrp = 0
     c                   eval      b2ldor = 0
     c                   eval      b2modn = 0
     c                   eval      b2vare = *blank
     c                   eval      b2enhe = *blank
     c                   eval      b2lety = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     subfile       begsr
      *
     c                   eval      b_forn = *off
      *
     c                   if        *in22 = *off
     c                   eval      *in22 = *on
     c                   else
     c                   eval      *in22 = *off
     c                   endif
      *
     c                   eval      w_virn = w_fcrn
      *
      * Leser og behandler subfile
      *
     c                   do        w_ssrn
     c                   readc     b1sfl
      *
     c                   if        %eof
     c                   leave
     c                   endif
      *
     c                   eval      *in22 = *off
     c                   eval      w_virn = w_srrn
      *
      * Endre
      *
     c                   if        b1valg = 2
9.01 c                   if        b_mast = *off
9.01 c                   eval      w_prgr = b1prgr
9.01 c                   exsr      sjekk_prgr2
9.01 c                   endif
9.01 c                   if        b_prok = *off
5.70 c                   eval      c1prgr = b1prgr
     c                   eval      c1rkat = b1rkat
     c                   eval      c1kkat = b1kkat
     c                   eval      c1kund = b1kund
     c                   eval      c1kpro = b1kpro
     c                   eval      c1ogrp = b1ogrp
     c                   eval      c1hgrp = b1hgrp
     c                   eval      c1ugrp = b1ugrp
     c                   eval      c1ldor = b1ldor
     c                   eval      c1modn = b1modn
     c                   eval      c1vare = b1vare
     c                   eval      c1enhe = b1enhe
     c                   eval      c1lety = b1lety
     c                   exsr      xc2bld
9.01 c                   endif
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Kopier
      *
     c                   if        b1valg = 3
9.01 c                   if        b_mast = *off
9.01 c                   eval      w_prgr = b1prgr
9.01 c                   exsr      sjekk_prgr1
9.01 c                   endif
9.01 c                   if        b_prok = *off
5.70 c                   eval      k1prgr = b1prgr
     c                   eval      k1rkat = b1rkat
     c                   eval      k1kkat = b1kkat
     c                   eval      k1kund = b1kund
     c                   eval      k1kpro = b1kpro
     c                   eval      k1ogrp = b1ogrp
     c                   eval      k1hgrp = b1hgrp
     c                   eval      k1ugrp = b1ugrp
     c                   eval      k1ldor = b1ldor
     c                   eval      k1modn = b1modn
     c                   eval      k1vare = b1vare
     c                   eval      k1enhe = b1enhe
     c                   eval      k1lety = b1lety
     c                   exsr      xk1win
9.01 c                   endif
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Slett
      *
     c                   if        b1valg = 4
9.01 c                   if        b_mast = *off
9.01 c                   eval      w_prgr = b1prgr
9.01 c                   exsr      sjekk_prgr2
9.01 c                   endif
9.01 c                   if        b_prok = *off
5.70 c                   eval      d1prgr = b1prgr
     c                   eval      d1rkat = b1rkat
     c                   eval      d1kkat = b1kkat
     c                   eval      d1kund = b1kund
     c                   eval      d1kpro = b1kpro
     c                   eval      d1ogrp = b1ogrp
     c                   eval      d1hgrp = b1hgrp
     c                   eval      d1ugrp = b1ugrp
     c                   eval      d1ldor = b1ldor
     c                   eval      d1modn = b1modn
     c                   eval      d1vare = b1vare
     c                   eval      d1enhe = b1enhe
     c                   eval      d1lety = b1lety
     c                   exsr      xd1win
9.01 c                   endif
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
      * Vis
      *
     c                   if        b1valg = 5
5.70 c                   eval      c1prgr = b1prgr
     c                   eval      c1rkat = b1rkat
     c                   eval      c1kkat = b1kkat
     c                   eval      c1kund = b1kund
     c                   eval      c1kpro = b1kpro
     c                   eval      c1ogrp = b1ogrp
     c                   eval      c1hgrp = b1hgrp
     c                   eval      c1ugrp = b1ugrp
     c                   eval      c1ldor = b1ldor
     c                   eval      c1modn = b1modn
     c                   eval      c1vare = b1vare
     c                   eval      c1enhe = b1enhe
     c                   eval      c1lety = b1lety
     c                   exsr      xc2bld
     c                   eval      b1valg = 0
     c                   update    b1sfl
     c                   iter
     c                   endif
      *
     c                   enddo
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c     end_subfile   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av skjermbilde for ny rad (C1BLD)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc1bld        begsr
      *
     c                   eval      b_oppr = *on
     c                   eval      b_forn = *off
      *
9.01 c                   if        b_mast = *off
9.01 c                   eval      c1prgr = f1prgr
9.02 c                   eval      c1rkat = 750
9.01 c                   else
5.70 c                   eval      c1prgr = *blank
9.02 c                   eval      c1rkat = 0
9.01 c                   endif
     c                   eval      c1rkat = 0
     c                   eval      c1kkat = 0
     c                   eval      c1kund = 0
     c                   eval      c1kpro = 0
     c                   eval      c1ogrp = 0
     c                   eval      c1hgrp = 0
     c                   eval      c1ugrp = 0
     c                   eval      c1ldor = 0
     c                   eval      c1modn = 0
     c                   eval      c1vare = *blank
     c                   eval      c1enhe = *blank
     c                   eval      c1lety = 0
      *
     c                   exsr      hent_info
      *
     c     c1taga        tag
      *
     c                   exfmt     c1bld
      *
      * Behandling av funksjonstaster
      *
     c                   select
     c                   when      *inkc or *inkl
     c                   goto      end_c1bld
     c                   when      *inkd
     c                   exsr      spØrring
     c                   goto      c1taga
     c                   endsl
      *
5.70 c                   if        c1prgr = *blank and
5.70 c                             c1rkat = 0 and
     c                             c1kkat = 0 and
     c                             c1kund = 0 and
     c                             c1kpro = 0 and
     c                             c1ogrp = 0 and
     c                             c1hgrp = 0 and
     c                             c1ugrp = 0 and
     c                             c1ldor = 0 and
     c                             c1vare = *blank and
     c                             c1modn = 0 and
     c                             c1enhe = *blank and
     c                             c1lety = 0
     c                   goto      end_c1bld
     c                   endif
9.01  * sjekker om man prøver å kopiere til annen filgruppe
9.01  *
9.01 c                   if        b_mast = *off
9.01 c                   if        c1prgr =  *blank
9.01 c                   exsr      PG_varsel2
9.01 c                   goto      c1taga
9.01 c                   endif
9.01 c                   if        c1prgr <> f1prgr
9.01 c                   exsr      PG_varsel2
9.01 c                   goto      c1taga
9.01 c                   endif
9.01 c                   endif
      *
      * Sjekker input
      *
5.70 c                   eval      w_prgr = c1prgr
     c                   eval      w_rkat = c1rkat
     c                   eval      w_kkat = c1kkat
     c                   eval      w_kund = c1kund
     c                   eval      w_kpro = c1kpro
     c                   eval      w_ogrp = c1ogrp
     c                   eval      w_hgrp = c1hgrp
     c                   eval      w_ugrp = c1ugrp
     c                   eval      w_ldor = c1ldor
     c                   eval      w_modn = c1modn
     c                   eval      w_vare = c1vare
     c                   eval      w_enhe = c1enhe
     c                   eval      w_lety = c1lety
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      c1taga
     c                   endif
      *
      * Sender opp informasjonsbildet dersom rad finnes fra før
      *
5.70 c                   eval      frablr_prgr = c1prgr
     c                   eval      frablr_rkat = c1rkat
     c                   eval      frablr_kkat = c1kkat
     c                   eval      frablr_kund = c1kund
     c                   eval      frablr_kpro = c1kpro
     c                   eval      frablr_ogrp = c1ogrp
     c                   eval      frablr_hgrp = c1hgrp
     c                   eval      frablr_ugrp = c1ugrp
     c                   eval      frablr_ldor = c1ldor
     c                   eval      frablr_modn = c1modn
     c                   eval      frablr_vare = c1vare
     c                   eval      frablr_enhe = c1enhe
     c                   eval      frablr_lety = c1lety
     c     frablr_key    chain     frablr                             90
     c                   if        *in90 = *off
     c                   exsr      xc1msg
     c                   if        b_anul = *on
     c                   goto      c1taga
     c                   endif
     c                   endif
      *
      * Kaller vedlikeholdsprogram
      *
     c                   exsr      xc2bld
      *
9.02 c                   if        b_mast = *off
9.02 c                   eval      c1prgr = f1prgr
9.02 c                   eval      c1rkat = 750
9.02 c                   else
5.70 c                   eval      c1prgr = *blank
9.02 c                   eval      c1rkat = 0
9.02 c                   endif
     c                   eval      c1rkat = 0
     c                   eval      c1kkat = 0
     c                   eval      c1kund = 0
     c                   eval      c1kpro = 0
     c                   eval      c1ogrp = 0
     c                   eval      c1hgrp = 0
     c                   eval      c1ugrp = 0
     c                   eval      c1ldor = 0
     c                   eval      c1vare = *blank
     c                   eval      c1modn = 0
     c                   eval      c1enhe = *blank
     c                   eval      c1lety = 0
      *
     c                   eval      c1rtxt = *blank
     c                   eval      c1ktxt = *blank
     c                   eval      c1knav = *blank
     c                   eval      c1pnav = *blank
     c                   eval      c1gtxt = *blank
     c                   eval      c1lnav = *blank
     c                   eval      c1mtxt = *blank
     c                   eval      c1vtxt = *blank
     c                   eval      c1etxt = *blank
     c                   eval      c1ltxt = *blank
     c                   goto      c1taga
      *
     c     end_c1bld     tag
      *
     c                   if        b_forn = *on
     c                   exsr      forny
     c                   endif
      *
     c                   eval      b_oppr = *off
      *
     c                   endsr
8.04  *
8.04  * ___________________________________________________________________
8.04  *  Oppdatering av rabattmatrise fra Excel
8.04  * ___________________________________________________________________
8.04  *
8.04 c     Excel         begsr
8.04  *
8.04 c                   exfmt     c1msgexcel
8.04  *
8.04 c                   select
8.04 c                   when      *inkg = *on
8.04 c                   call      'UPPDIFSM'
8.04 c                   parm                    FRABMAL
8.04 c                   parm                    L_lib
8.04 c                   parm                    FRABMAL
8.04 c                   when      *inkh = *on
8.04 c                   call      'NYRABMXLC'
8.04 c                   when      *inki = *on
8.04 c                   call      'NYRABMXUC'
8.04 c                   endsl
8.04 c                   exsr      forny
8.04  *
8.04 c                   endsr
8.04  *
9.03  *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
9.03  *  Oppdatering av rabattmatrise fra Excel
9.03  *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
9.03  *
9.03 c     Copy_matrix   begsr
9.03  *
9.03 c                   eval      c9fkat = 0
9.04 c                   eval      c9fktx = *blanks
9.03 c                   eval      c9tkat = 0
9.04 c                   eval      c9tktx = *blanks
9.04 c                   eval      c9fprg = *blanks
9.04 c                   eval      c9fptx = *blanks
9.04 c                   eval      c9tprg = *blanks
9.04 c                   eval      c9tptx = *blanks
9.03  *
9.03 c     c9taga        tag
9.03  *
9.03 c                   exfmt     c9win
9.03  *
9.03  * Behandling av funksjonstaster
9.03  *
9.03 c                   select
9.03 c                   when      *inkc or *inkl
9.03 c                   goto      end_c9bld
9.03 c                   when      *inkd
9.03 c                   exsr      spØrring
9.03 c                   goto      c9taga
9.03 c                   endsl
9.03  *
9.03  * Prisgruppe
9.03  *
9.03 c                   if        c9fprg <> *blank
9.03 c                   eval      ra30lr_dkod = c9fprg
9.03 c     ra30lr_key    chain     ra30lr
9.03 c                   if        not %found
9.03 c                   eval      *in42 = *on
9.03 c                   goto      c9taga
9.03 c                   endif
9.03 c                   endif
9.03  *
9.03 c                   if        c9tprg <> *blank
9.03 c                   eval      ra30lr_dkod = c9tprg
9.03 c     ra30lr_key    chain     ra30lr
9.03 c                   if        not %found
9.03 c                   eval      *in42 = *on
9.03 c                   goto      c9taga
9.03 c                   endif
9.03 c                   endif
9.03  *
9.03  * Rabattkategori må være gyldig
9.03  *
9.03 c                   if        c9fkat <> 0
9.03 c                   eval      ra06pf_fkod = c9fkat
9.03 c     ra06pf_key    chain     ra06pf
9.03 c                   if        not %found
9.03 c                   eval      *in36 = *on
9.03 c                   goto      c9taga
9.03 c                   endif
9.03 c                   endif
9.03  *
9.03 c                   if        c9tkat <> 0
9.03 c                   eval      ra06pf_fkod = c9tkat
9.03 c     ra06pf_key    chain     ra06pf
9.03 c                   if        not %found
9.03 c                   eval      *in36 = *on
9.03 c                   goto      c9taga
9.03 c                   endif
9.03 c                   endif
9.03  * Kan ikke være like verdier
9.03 c                   if        c9fprg = c9tprg and
9.03 c                             c9fkat = c9tkat
9.03 c                   eval      *in37 = *on
9.03 c                   goto      c9taga
9.03 c                   endif
9.03  * Til kan ikke være blank
9.03 c                   if        c9fkat <> 0 and
9.03 c                             c9tkat = 0
9.03 c                   eval      *in43 = *on
9.03 c                   goto      c9taga
9.03 c                   endif
9.03  * Fra kan ikke være blank
9.03 c                   if        c9tkat <> 0 and
9.03 c                             c9fkat = 0
9.03 c                   eval      *in41 = *on
9.03 c                   goto      c9taga
9.03 c                   endif
9.03  * Må finnes elementer på "fra rabattkategori"
9.03 c                   eval      b_copy = *off
9.03 c                   eval      frablr_prgr = %trim(c9fprg)
9.03 c                   eval      frablr_rkat = c9fkat
9.03 c     frablr_key    setll     frablr
9.03 c     frablr_key2   reade     frablr
9.03 c                   dow       not %eof
9.03 c*                  if        %trim(frprgr) = *blanks
9.03 c                   eval      b_copy = *on
9.03 c*                  endif
9.03 c     frablr_key2   reade     frablr
9.03 c                   enddo
9.03 c                   if        b_copy = *off
9.03 c                   eval      *in38 = *on
9.03 c                   goto      c9taga
9.03 c                   endif
9.03  * Må ikke finnes elementer på "til rabattkategori" allerede
9.03 c                   eval      b_copy = *off
9.03 c                   eval      frablr_prgr = %trim(c9tprg)
9.03 c                   eval      frablr_rkat = c9tkat
9.03 c     frablr_key    setll     frablr
9.03 c     frablr_key2   reade     frablr
9.03 c                   dow       not %eof
9.03 c*                  if        %trim(frprgr) = *blanks
9.03 c                   eval      b_copy = *on
9.03 c*                  endif
9.03 c     frablr_key2   reade     frablr
9.03 c                   enddo
9.03 c                   if        b_copy = *on
9.03 c                   eval      *in39 = *on
9.03 c                   goto      c9taga
9.03 c                   endif
9.03  *
9.03  * Så starter vi kopiering av elementer
9.03  *
9.03 c                   eval      frablr_prgr = %trim(c9fprg)
9.03 c                   eval      frablr_rkat = c9fkat
9.03 c     frablr_key    setll     frablr
9.03 c     frablr_key2   reade     frablr
9.03 c                   dow       not %eof
9.03 c*                  if        %trim(frprgr) = *blanks
9.03  *
9.03  * Tar vare felter og sjekker nøkkel før vi kopierer
9.03  *
9.03 c                   eval      s_prgr = frprgr
9.03 c                   eval      s_rkat = frrkat
9.03 c                   eval      s_kkat = frkkat
9.03 c                   eval      s_kund = frkund
9.03 c                   eval      s_kpro = frkpro
9.03 c                   eval      s_ogrp = frogrp
9.03 c                   eval      s_hgrp = frhgrp
9.03 c                   eval      s_ugrp = frugrp
9.03 c                   eval      s_ldor = frldor
9.03 c                   eval      s_modn = frmodn
9.03 c                   eval      s_vare = frvare
9.03 c                   eval      s_enhe = frenhe
9.03 c                   eval      s_lety = frlety
9.03  *
9.03 c                   eval      s_nota = frnota
9.03 c                   eval      s_pslm = frpslm
9.03 c                   eval      s_rab1 = frrab1
9.03 c                   eval      s_ra1d = frra1d
9.03 c                   eval      s_ra1f = frra1f
9.03 c                   eval      s_ra1t = frra1t
9.03 c                   eval      s_rab2 = frrab2
9.03 c                   eval      s_ra2d = frra2d
9.03 c                   eval      s_ra2f = frra2f
9.03 c                   eval      s_ra2t = frra2t
9.03 c                   eval      s_rabn = frrabn
9.03 c                   eval      s_rand = frrand
9.03 c                   eval      s_ranf = frranf
9.03 c                   eval      s_rant = frrant
9.03 c                   eval      s_rabb = frrabb
9.03 c                   eval      s_rabd = frrabd
9.03 c                   eval      s_rbuf = frrbuf
9.03 c                   eval      s_rbut = frrbut
9.03 c                   eval      s_rabt = frrabt
9.03 c                   eval      s_ratd = frratd
9.03 c                   eval      s_ratf = frratf
9.03 c                   eval      s_ratt = frratt
9.03 c                   eval      s_dekn = frdekn
9.03 c                   eval      s_dekd = frdekd
9.03 c                   eval      s_dekf = frdekf
9.03 c                   eval      s_dekt = frdekt
9.03  *
9.03  * Legg ut ny post
9.03  *
9.03 c*                  eval      frablu_prgr = s_prgr
9.03 c                   eval      frablu_prgr = %trim(c9tprg)
9.03 c*                  eval      frablu_rkat = s_rkat
9.03 c                   eval      frablu_rkat = c9tkat
9.03 c                   eval      frablu_kkat = s_kkat
9.03 c                   eval      frablu_kund = s_kund
9.03 c                   eval      frablu_kpro = s_kpro
9.03 c                   eval      frablu_ogrp = s_ogrp
9.03 c                   eval      frablu_hgrp = s_hgrp
9.03 c                   eval      frablu_ugrp = s_ugrp
9.03 c                   eval      frablu_ldor = s_ldor
9.03 c                   eval      frablu_modn = s_modn
9.03 c                   eval      frablu_vare = s_vare
9.03 c                   eval      frablu_enhe = s_enhe
9.03 c                   eval      frablu_lety = s_lety
9.03 c     frablu_key    chain     frablu
9.03 c                   if        not %found
9.03 c                   eval      frfirm = w_firm
9.03 c*                  eval      frprgr = s_prgr
9.03 c                   eval      frprgr = %trim(c9tprg)
9.03 c*                  eval      frrkat = s_rkat
9.03 c                   eval      frrkat = c9tkat
9.03 c                   eval      frkkat = s_kkat
9.03 c                   eval      frkund = s_kund
9.03 c                   eval      frkpro = s_kpro
9.03 c                   eval      frogrp = s_ogrp
9.03 c                   eval      frhgrp = s_hgrp
9.03 c                   eval      frugrp = s_ugrp
9.03 c                   eval      frldor = s_ldor
9.03 c                   eval      frmodn = s_modn
9.03 c                   eval      frvare = s_vare
9.03 c                   eval      frenhe = s_enhe
9.03 c                   eval      frlety = s_lety
9.03  *
9.03 c                   eval      frnota = *blank
9.03 c*                  eval      s_nota = frnota
9.03 c                   eval      frpslm = s_pslm
9.03 c                   eval      frrab1 = s_rab1
9.03 c                   eval      frra1d = s_ra1d
9.03 c                   eval      frra1f = s_ra1f
9.03 c                   eval      frra1t = s_ra1t
9.03 c                   eval      frrab2 = s_rab2
9.03 c                   eval      frra2d = s_ra2d
9.03 c                   eval      frra2f = s_ra2f
9.03 c                   eval      frra2t = s_ra2t
9.03 c                   eval      frrabn = s_rabn
9.03 c                   eval      frrand = s_rand
9.03 c                   eval      frranf = s_ranf
9.03 c                   eval      frrant = s_rant
9.03 c                   eval      frrabb = s_rabb
9.03 c                   eval      frrabd = s_rabd
9.03 c                   eval      frrbuf = s_rbuf
9.03 c                   eval      frrbut = s_rbut
9.03 c                   eval      frrabt = s_rabt
9.03 c                   eval      frratd = s_ratd
9.03 c                   eval      frratf = s_ratf
9.03 c                   eval      frratt = s_ratt
9.03 c                   eval      frdekn = s_dekn
9.03 c                   eval      frdekd = s_dekd
9.03 c                   eval      frdekf = s_dekf
9.03 c                   eval      frdekt = s_dekt
9.03  *
9.03 c                   time                    frodat
9.03 c                   time                    frotim
9.03 c                   eval      frousr = l_user
9.03 c                   time                    fredat
9.03 c                   time                    fretim
9.03 c                   eval      freusr = l_user
9.03 c                   write     frablur
9.03 c                   endif
9.03  *
9.03 c**                 endif
9.03  *
9.03 c     frablr_key2   reade     frablr
9.03 c                   enddo
9.03  *
9.03 c                   exsr      forny
9.03  *
9.03 c     end_c9bld     endsr
9.03  *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for utlegging av opprettelsesmelding
      * Meldingsbildet legges ut dersom det forsøkes å opprette en rad som
      * finnes fra før.
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc1msg        begsr
      *
     c                   eval      b_anul = *off
      *
     c                   exfmt     c1msg
      *
      * Behandling av funksjonstaster
      *
     c                   if        *inkc or *inkl
     c                   eval      b_anul = *on
     c                   goto      end_c1msg
     c                   endif
      *
     c     end_c1msg     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * C2BLD Behandle bilde for ny - endring - vise
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xc2bld        begsr
      *
     c                   eval      w_arow = 0
     c                   eval      w_acol = 0
      *
5.70 c                   eval      frablr_prgr = c1prgr
     c                   eval      frablr_rkat = c1rkat
     c                   eval      frablr_kkat = c1kkat
     c                   eval      frablr_kund = c1kund
     c                   eval      frablr_kpro = c1kpro
     c                   eval      frablr_ogrp = c1ogrp
     c                   eval      frablr_hgrp = c1hgrp
     c                   eval      frablr_ugrp = c1ugrp
     c                   eval      frablr_ldor = c1ldor
     c                   eval      frablr_modn = c1modn
     c                   eval      frablr_vare = c1vare
     c                   eval      frablr_enhe = c1enhe
     c                   eval      frablr_lety = c1lety
     c     frablr_key    chain     frablr                             90
      *
     c                   if        *in90 = *off
      *
     c                   eval      c2rab1 = frrab1
     c                   eval      c2ra1d = frra1d
     c                   eval      c2ra1f = 0
     c                   eval      c2ra1t = 0
     c                   eval      c2rab2 = frrab2
     c                   eval      c2ra2d = frra2d
     c                   eval      c2ra2f = 0
     c                   eval      c2ra2t = 0
     c                   eval      c2rabn = frrabn
     c                   eval      c2rand = frrand
     c                   eval      c2ranf = 0
     c                   eval      c2rant = 0
     c                   eval      c2rabb = frrabb
     c                   eval      c2rabd = frrabd
     c                   eval      c2rbuf = 0
     c                   eval      c2rbut = 0
     c                   eval      c2rabt = frrabt
     c                   eval      c2ratd = frratd
     c                   eval      c2ratf = 0
     c                   eval      c2ratt = 0
     c                   eval      c2dekn = frdekn
     c                   eval      c2dekd = frdekd
     c                   eval      c2dekf = 0
     c                   eval      c2dekt = 0
6.41 c                   eval      c2pslm = frpslm
     c                   eval      c2eusr = freusr
      *
     c                   if        frra1f <> *loval
     c     *dmy          move      frra1f        c2ra1f
     c                   endif
      *
     c                   if        frra1t <> *loval
     c     *dmy          move      frra1t        c2ra1t
     c                   endif
      *
     c                   if        frra2f <> *loval
     c     *dmy          move      frra2f        c2ra2f
     c                   endif
      *
     c                   if        frra2t <> *loval
     c     *dmy          move      frra2t        c2ra2t
     c                   endif
      *
     c                   if        frranf <> *loval
     c     *dmy          move      frranf        c2ranf
     c                   endif
      *
     c                   if        frrant <> *loval
     c     *dmy          move      frrant        c2rant
     c                   endif
      *
     c                   if        frrbuf <> *loval
     c     *dmy          move      frrbuf        c2rbuf
     c                   endif
      *
     c                   if        frrbut <> *loval
     c     *dmy          move      frrbut        c2rbut
     c                   endif
      *
     c                   if        frratf <> *loval
     c     *dmy          move      frratf        c2ratf
     c                   endif
      *
     c                   if        frratt <> *loval
     c     *dmy          move      frratt        c2ratt
     c                   endif
      *
     c                   if        frdekf <> *loval
     c     *dmy          move      frdekf        c2dekf
     c                   endif
      *
     c                   if        frdekt <> *loval
     c     *dmy          move      frdekt        c2dekt
     c                   endif
      *
     c     *dmy          move      frodat        c2odat
     c     *dmy          move      fredat        c2edat
      *
     c                   else
      *
     c                   eval      c2rab1 = 0
     c                   eval      c2ra1d = 0
     c                   eval      c2ra1f = 0
     c                   eval      c2ra1t = 0
     c                   eval      c2rab2 = 0
     c                   eval      c2ra2d = 0
     c                   eval      c2ra2f = 0
     c                   eval      c2ra2t = 0
     c                   eval      c2rabn = 0
     c                   eval      c2rand = 0
     c                   eval      c2ranf = 0
     c                   eval      c2rant = 0
     c                   eval      c2rabb = 0
     c                   eval      c2rabd = 0
     c                   eval      c2rbuf = 0
     c                   eval      c2rbut = 0
     c                   eval      c2rabt = 0
     c                   eval      c2ratd = 0
     c                   eval      c2ratf = 0
     c                   eval      c2ratt = 0
     c                   eval      c2dekn = 0
     c                   eval      c2dekd = 0
6.41 c                   eval      c2pslm = 0
     c                   eval      c2dekf = 0
     c                   eval      c2dekt = 0
     c                   eval      c2odat = 0
     c                   eval      c2edat = 0
     c                   eval      c2eusr = *blank
      *
     c                   endif
      *
     c                   if        b1valg = 3
5.70 c                   eval      c1prgr = k1prgr
     c                   eval      c1rkat = k1rkat
     c                   eval      c1kkat = k1kkat
     c                   eval      c1kund = k1kund
     c                   eval      c1kpro = k1kpro
     c                   eval      c1ogrp = k1ogrp
     c                   eval      c1hgrp = k1hgrp
     c                   eval      c1ugrp = k1ugrp
     c                   eval      c1ldor = k1ldor
     c                   eval      c1modn = k1modn
     c                   eval      c1vare = k1vare
     c                   eval      c1enhe = k1enhe
     c                   eval      c1lety = k1lety
     c                   endif
      *
     c                   if        b1valg = 5
     c                   eval      *in30 = *on
     c                   endif
      *
      * Henter beskrivelse av nivå
      *
     c                   exsr      hent_info
      *
      * Henter tilleggsinformasjon
      *
     c                   eval      c2kpri = *blank
     c                   eval      c2dggj = 0
      *
     c                   if        c1vare <> *blank
     c                   eval      c2kpri = vvkpri
     c                   endif
      *
     c     c2tagb        tag
      *
     c                   exfmt     c2bld
      *
     c                   if        *inkc or *inkl or *in30
     c                   goto      end_c2bld
     c                   endif
      *
      * Validering av input
      *
      *  rabatt-1
      *
     c                   if        c2ra1f <> 0
     c     *dmy          test (d)                c2ra1f                 32
     c                   if        *in32 = *on
     c                   goto      c2tagb                                                    .
     c                   endif
     c                   endif
      *
     c                   if        c2ra1t <> 0
     c     *dmy          test (d)                c2ra1t                 33
     c                   if        *in33 = *on
     c                   goto      c2tagb                                                    .
     c                   endif
     c                   endif
      *
     c                   if        c2ra1d <> 0 or
     c                             c2ra1f <> 0 or
     c                             c2ra1t <> 0
     c                   if        c2ra1d = 0 or
     c                             c2ra1f = 0 or
     c                             c2ra1t = 0
     c                   eval      *in34 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
     c                   if        c2ra1f <> 0
     c     *dmy          move      c2ra1f        w_dato_fra
     c     *dmy          move      c2ra1t        w_dato_til
     c                   if        w_dato_fra > w_dato_til
     c                   eval      *in35 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
      *  rabatt-2
      *
     c                   if        c2ra2f <> 0
     c     *dmy          test (d)                c2ra2f                 36
     c                   if        *in36 = *on
     c                   goto      c2tagb                                                    .
     c                   endif
     c                   endif
      *
     c                   if        c2ra2t <> 0
     c     *dmy          test (d)                c2ra2t                 37
     c                   if        *in37 = *on
     c                   goto      c2tagb                                                    .
     c                   endif
     c                   endif
      *
     c                   if        c2ra2d <> 0 or
     c                             c2ra2f <> 0 or
     c                             c2ra2t <> 0
     c                   if        c2ra2d = 0 or
     c                             c2ra2f = 0 or
     c                             c2ra2t = 0
     c                   eval      *in38 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
     c                   if        c2ra2f <> 0
     c     *dmy          move      c2ra2f        w_dato_fra
     c     *dmy          move      c2ra2t        w_dato_til
     c                   if        w_dato_fra > w_dato_til
     c                   eval      *in39 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
      *  rabatt på nettopris
      *
     c                   if        c2ranf <> 0
     c     *dmy          test (d)                c2ranf                 40
     c                   if        *in40 = *on
     c                   goto      c2tagb                                                    .
     c                   endif
     c                   endif
      *
     c                   if        c2rant <> 0
     c     *dmy          test (d)                c2rant                 41
     c                   if        *in41 = *on
     c                   goto      c2tagb                                                    .
     c                   endif
     c                   endif
      *
     c                   if        c2rand <> 0 or
     c                             c2ranf <> 0 or
     c                             c2rant <> 0
     c                   if        c2rand = 0 or
     c                             c2ranf = 0 or
     c                             c2rant = 0
     c                   eval      *in42 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
     c                   if        c2ranf <> 0
     c     *dmy          move      c2ranf        w_dato_fra
     c     *dmy          move      c2rant        w_dato_til
     c                   if        w_dato_fra > w_dato_til
     c                   eval      *in43 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
      *  rabatt på bunnpris
      *
     c                   if        c2rbuf <> 0
     c     *dmy          test (d)                c2rbuf                 44
     c                   if        *in44 = *on
     c                   goto      c2tagb                                                    .
     c                   endif
     c                   endif
      *
     c                   if        c2rbut <> 0
     c     *dmy          test (d)                c2rbut                 45
     c                   if        *in45 = *on
     c                   goto      c2tagb                                                    .
     c                   endif
     c                   endif
      *
     c                   if        c2rabd <> 0 or
     c                             c2rbuf <> 0 or
     c                             c2rbut <> 0
     c                   if        c2rabd = 0 or
     c                             c2rbuf = 0 or
     c                             c2rbut = 0
     c                   eval      *in46 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
     c                   if        c2rbuf <> 0
     c     *dmy          move      c2rbuf        w_dato_fra
     c     *dmy          move      c2rbut        w_dato_til
     c                   if        w_dato_fra > w_dato_til
     c                   eval      *in47 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
      *  rabatt på tilbudspris
      *
     c                   if        c2ratf <> 0
     c     *dmy          test (d)                c2ratf                 48
     c                   if        *in48 = *on
     c                   goto      c2tagb                                                    .
     c                   endif
     c                   endif
      *
     c                   if        c2ratt <> 0
     c     *dmy          test (d)                c2ratt                 49
     c                   if        *in49 = *on
     c                   goto      c2tagb                                                    .
     c                   endif
     c                   endif
      *
     c                   if        c2ratd <> 0 or
     c                             c2ratf <> 0 or
     c                             c2ratt <> 0
     c                   if        c2ratd = 0 or
     c                             c2ratf = 0 or
     c                             c2ratt = 0
     c                   eval      *in50 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
     c                   if        c2ratf <> 0
     c     *dmy          move      c2ratf        w_dato_fra
     c     *dmy          move      c2ratt        w_dato_til
     c                   if        w_dato_fra > w_dato_til
     c                   eval      *in51 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
      *  dekningsgrad
      *
     c                   if        c2dekn <> 0 or
     c                             c2dekd <> 0
     c                   if        c2rab1 <> 0 or
     c                             c2ra1d <> 0 or
     c                             c2rab2 <> 0 or
     c                             c2ra2d <> 0 or
     c                             c2rabn <> 0 or
     c                             c2rand <> 0 or
     c                             c2rabb <> 0 or
     c                             c2rabd <> 0 or
     c                             c2rabt <> 0 or
6.41 c                             c2ratd <> 0 or
6.41 c                             c2pslm <> 0
     c                   eval      *in55 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
6.41  *
6.41  *  påslag
6.41  *
6.41 c                   if        c2pslm <> 0
6.41 c                   if        c2rab2 <> 0 or
6.41 c                             c2ra2d <> 0 or
6.41 c                             c2rabn <> 0 or
6.41 c                             c2rand <> 0 or
6.41 c                             c2rabb <> 0 or
6.41 c                             c2rabd <> 0 or
6.41 c                             c2rabt <> 0 or
6.41 c                             c2ratd <> 0 or
6.41 c                             c2dekn <> 0 or
6.41 c                             c2dekd <> 0
6.41 c                   eval      *in60 = *on
6.41 c                   goto      c2tagb
6.41 c                   endif
6.41 c                   endif
      *
     c                   if        c2dekf <> 0
     c     *dmy          test (d)                c2dekf                 56
     c                   if        *in56 = *on
     c                   goto      c2tagb                                                    .
     c                   endif
     c                   endif
      *
     c                   if        c2dekt <> 0
     c     *dmy          test (d)                c2dekt                 57
     c                   if        *in57 = *on
     c                   goto      c2tagb                                                    .
     c                   endif
     c                   endif
      *
     c                   if        c2dekd <> 0 or
     c                             c2dekf <> 0 or
     c                             c2dekt <> 0
     c                   if        c2dekd = 0 or
     c                             c2dekf = 0 or
     c                             c2dekt = 0
     c                   eval      *in58 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
     c                   if        c2dekf <> 0
     c     *dmy          move      c2dekf        w_dato_fra
     c     *dmy          move      c2dekt        w_dato_til
     c                   if        w_dato_fra > w_dato_til
     c                   eval      *in59 = *on
     c                   goto      c2tagb
     c                   endif
     c                   endif
      *
      * Kalkuler DG
      *
     c                   if        *inku = *on
     c                   exsr      kalk_dg
     c                   goto      c2tagb
     c                   endif
      *
      * Oppdatering av rabattmatrise
      *
     c                   clear                   frablur
      *
5.70 c                   eval      frablu_prgr = c1prgr
     c                   eval      frablu_rkat = c1rkat
     c                   eval      frablu_kkat = c1kkat
     c                   eval      frablu_kund = c1kund
     c                   eval      frablu_kpro = c1kpro
     c                   eval      frablu_ogrp = c1ogrp
     c                   eval      frablu_hgrp = c1hgrp
     c                   eval      frablu_ugrp = c1ugrp
     c                   eval      frablu_ldor = c1ldor
     c                   eval      frablu_modn = c1modn
     c                   eval      frablu_vare = c1vare
     c                   eval      frablu_enhe = c1enhe
     c                   eval      frablu_lety = c1lety
     c     frablu_key    chain     frablur                            90
      *
     c                   eval      frrab1 = c2rab1
     c                   eval      frra1d = c2ra1d
     c                   eval      frra1f = *loval
     c                   eval      frra1t = *loval
     c                   eval      frrab2 = c2rab2
     c                   eval      frra2d = c2ra2d
     c                   eval      frra2f = *loval
     c                   eval      frra2t = *loval
     c                   eval      frrabn = c2rabn
     c                   eval      frrand = c2rand
     c                   eval      frranf = *loval
     c                   eval      frrant = *loval
     c                   eval      frrabb = c2rabb
     c                   eval      frrabd = c2rabd
     c                   eval      frrbuf = *loval
     c                   eval      frrbut = *loval
     c                   eval      frrabt = c2rabt
     c                   eval      frratd = c2ratd
     c                   eval      frratf = *loval
     c                   eval      frratt = *loval
     c                   eval      frdekn = c2dekn
     c                   eval      frdekd = c2dekd
     c                   eval      frdekf = *loval
     c                   eval      frdekt = *loval
6.41 c                   eval      frpslm = c2pslm
     c                   eval      freusr = l_user
      *
     c                   if        c2ra1f <> 0
     c     *dmy          move      c2ra1f        frra1f
     c                   endif
      *
     c                   if        c2ra1t <> 0
     c     *dmy          move      c2ra1t        frra1t
     c                   endif
      *
     c                   if        c2ra2f <> 0
     c     *dmy          move      c2ra2f        frra2f
     c                   endif
      *
     c                   if        c2ra2t <> 0
     c     *dmy          move      c2ra2t        frra2t
     c                   endif
      *
     c                   if        c2ranf <> 0
     c     *dmy          move      c2ranf        frranf
     c                   endif
      *
     c                   if        c2rant <> 0
     c     *dmy          move      c2rant        frrant
     c                   endif
      *
     c                   if        c2rbuf <> 0
     c     *dmy          move      c2rbuf        frrbuf
     c                   endif
      *
     c                   if        c2rbut <> 0
     c     *dmy          move      c2rbut        frrbut
     c                   endif
      *
     c                   if        c2ratf <> 0
     c     *dmy          move      c2ratf        frratf
     c                   endif
      *
     c                   if        c2ratt <> 0
     c     *dmy          move      c2ratt        frratt
     c                   endif
      *
     c                   if        c2dekf <> 0
     c     *dmy          move      c2dekf        frdekf
     c                   endif
      *
     c                   if        c2dekt <> 0
     c     *dmy          move      c2dekt        frdekt
     c                   endif
      *
     c                   time                    fretim
     c                   time                    fredat
      *
     c                   if        *in90 = *off
6.10 c                   time                    fredat
6.10 c                   time                    fretim
6.10 c                   eval      freusr = l_user
     c                   update    frablur
     c                   else
     c                   eval      frfirm = w_firm
5.70 c                   eval      frprgr = c1prgr
     c                   eval      frrkat = c1rkat
     c                   eval      frkkat = c1kkat
     c                   eval      frkund = c1kund
     c                   eval      frkpro = c1kpro
     c                   eval      frogrp = c1ogrp
     c                   eval      frhgrp = c1hgrp
     c                   eval      frugrp = c1ugrp
     c                   eval      frldor = c1ldor
     c                   eval      frmodn = c1modn
     c                   eval      frvare = c1vare
     c                   eval      frenhe = c1enhe
     c                   eval      frlety = c1lety
     c                   eval      frnota = *blank
     c                   time                    frodat
6.10 c                   time                    frotim
6.10 c                   eval      frousr = l_user
6.10 c                   time                    fredat
6.10 c                   time                    fretim
6.10 c                   eval      freusr = l_user
     c                   write     frablur
     c                   endif
      *
      * Oppdater subfile
      *
     c                   if        b1valg = 2
     c                   if        *in80 = *off
     c                   eval      b1rab1 = c2rab1
     c                   eval      b1rabn = c2rabn
     c                   eval      b1dekn = c2dekn
     c                   else
     c                   eval      b1rab1 = c2ra1d
     c                   eval      b1rabn = c2rand
     c                   eval      b1dekn = c2dekd
     c                   endif
     c                   endif
      *
     c                   if        b_oppr = *on or
     c                             b1valg = 3
     c                   eval      b_forn = *on
     c                   endif
      *
     c     end_c2bld     tag
      *
     c                   eval      *in30  = *off
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av slette-bildet (D1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xd1win        begsr
      *
5.70 c                   eval      frablr_prgr = d1prgr
     c                   eval      frablr_rkat = d1rkat
     c                   eval      frablr_kkat = d1kkat
     c                   eval      frablr_kund = d1kund
     c                   eval      frablr_kpro = d1kpro
     c                   eval      frablr_ogrp = d1ogrp
     c                   eval      frablr_hgrp = d1hgrp
     c                   eval      frablr_ugrp = d1ugrp
     c                   eval      frablr_ldor = d1ldor
     c                   eval      frablr_modn = d1modn
     c                   eval      frablr_vare = d1vare
     c                   eval      frablr_enhe = d1enhe
     c                   eval      frablr_lety = d1lety
     c     frablr_key    chain     frablr                             90
      *
     c                   exfmt     d1win
      *
     c                   if        *inkc or *inkl
     c                   goto      end_d1win
     c                   endif
      *
     c                   eval      b_forn = *on
      *
      * Sletter rabattmatrise-nivå
      *
5.70 c                   eval      frablu_prgr = d1prgr
     c                   eval      frablu_rkat = d1rkat
     c                   eval      frablu_kkat = d1kkat
     c                   eval      frablu_kund = d1kund
     c                   eval      frablu_kpro = d1kpro
     c                   eval      frablu_ogrp = d1ogrp
     c                   eval      frablu_hgrp = d1hgrp
     c                   eval      frablu_ugrp = d1ugrp
     c                   eval      frablu_ldor = d1ldor
     c                   eval      frablu_modn = d1modn
     c                   eval      frablu_vare = d1vare
     c                   eval      frablu_enhe = d1enhe
     c                   eval      frablu_lety = d1lety
     c     frablu_key    chain     frablur                            90
     c                   delete    frablur
      *
     c     end_d1win     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å behandle kopierings-bildet (K1WIN)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     xk1win        begsr
      *
      * Tar vare på nøkkel til rad det skal kopieres fra
      *
5.70 c                   eval      s_prgr = k1prgr
     c                   eval      s_rkat = k1rkat
     c                   eval      s_kkat = k1kkat
     c                   eval      s_kund = k1kund
     c                   eval      s_kpro = k1kpro
     c                   eval      s_ogrp = k1ogrp
     c                   eval      s_hgrp = k1hgrp
     c                   eval      s_ugrp = k1ugrp
     c                   eval      s_ldor = k1ldor
     c                   eval      s_modn = k1modn
     c                   eval      s_vare = k1vare
     c                   eval      s_enhe = k1enhe
     c                   eval      s_lety = k1lety
      *
      * Fyller kopierings-bildet
      *
5.70 c                   eval      frablr_prgr = k1prgr
     c                   eval      frablr_rkat = k1rkat
     c                   eval      frablr_kkat = k1kkat
     c                   eval      frablr_kund = k1kund
     c                   eval      frablr_kpro = k1kpro
     c                   eval      frablr_ogrp = k1ogrp
     c                   eval      frablr_hgrp = k1hgrp
     c                   eval      frablr_ugrp = k1ugrp
     c                   eval      frablr_ldor = k1ldor
     c                   eval      frablr_modn = k1modn
     c                   eval      frablr_vare = k1vare
     c                   eval      frablr_enhe = k1enhe
     c                   eval      frablr_lety = k1lety
     c     frablr_key    chain     frablr                             90
9.01 c                   if        b_mast = *off
9.01 c                   eval      k1prgr = f1prgr
9.01 c                   eval      s_prgr = f1prgr
9.01 c                   goto      k1tagc
9.01 c                   endif
      *
     c     k1tagb        tag
      *
     c                   exfmt     k1win
      *
     c                   if        *inkc or *inkl
     c                   goto      end_k1win
     c                   endif
      *
      * Spørring
      *
     c                   if        *inkd = *on
     c                   exsr      spØrring
     c                   goto      k1tagb
     c                   endif
9.01  * sjekker om man prøver å kopiere til annen filgruppe
9.01  *
9.01 c*                  if        b_mast = *off
9.01 c*                  if        k1prgr =  *blank
9.01 c*                  exsr      PG_varsel1
9.01 c*                  goto      k1tagb
9.01 c*                  endif
9.01 c*                  if        k1prgr <> f1prgr
9.01 c*                  exsr      PG_varsel1
9.01 c*                  goto      k1tagb
9.01 c*                  endif
9.01 c*                  endif
      *
      * Sjekker om rad finnes fra før
      *
5.70 c                   eval      frablr_prgr = k1prgr
     c                   eval      frablr_rkat = k1rkat
     c                   eval      frablr_kkat = k1kkat
     c                   eval      frablr_kund = k1kund
     c                   eval      frablr_kpro = k1kpro
     c                   eval      frablr_ogrp = k1ogrp
     c                   eval      frablr_hgrp = k1hgrp
     c                   eval      frablr_ugrp = k1ugrp
     c                   eval      frablr_ldor = k1ldor
     c                   eval      frablr_modn = k1modn
     c                   eval      frablr_vare = k1vare
     c                   eval      frablr_enhe = k1enhe
     c                   eval      frablr_lety = k1lety
     c     frablr_key    chain     frablr                             90
     c                   if        *in90 = *off
     c                   eval      *in32 = *on
     c                   goto      k1tagb
     c                   endif
      *
      * Sjekker input
      *
5.70 c                   eval      w_prgr = k1prgr
     c                   eval      w_rkat = k1rkat
     c                   eval      w_kkat = k1kkat
     c                   eval      w_kund = k1kund
     c                   eval      w_kpro = k1kpro
     c                   eval      w_ogrp = k1ogrp
     c                   eval      w_hgrp = k1hgrp
     c                   eval      w_ugrp = k1ugrp
     c                   eval      w_ldor = k1ldor
     c                   eval      w_modn = k1modn
     c                   eval      w_vare = k1vare
     c                   eval      w_enhe = k1enhe
     c                   eval      w_lety = k1lety
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      k1tagb
     c                   endif
      *
      * Kaller vedlikeholdsprogram
      *
9.01 c     k1tagc        tag
5.70 c                   eval      c1prgr = s_prgr
     c                   eval      c1rkat = s_rkat
     c                   eval      c1kkat = s_kkat
     c                   eval      c1kund = s_kund
     c                   eval      c1kpro = s_kpro
     c                   eval      c1ogrp = s_ogrp
     c                   eval      c1hgrp = s_hgrp
     c                   eval      c1ugrp = s_ugrp
     c                   eval      c1ldor = s_ldor
     c                   eval      c1modn = s_modn
     c                   eval      c1vare = s_vare
     c                   eval      c1enhe = s_enhe
     c                   eval      c1lety = s_lety
      *
     c                   exsr      xc2bld
      *
     c     end_k1win     endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for tømming av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     clr_subfile   begsr
      *
     c                   eval      *in14 = *on
     c                   write     b2ctl
     c                   eval      *in14 = *off
      *
     c                   eval      *in15 = *off
     c                   eval      w_srrn = 0
     c                   eval      w_sfrn = 0
     c                   eval      w_ssrn = 0
     c                   eval      w_spge = 0
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Fyll opp subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     crt_subfile   begsr
      *
     c                   eval      w_spge = w_spge + c_sfil
     c                   eval      w_srrn = w_ssrn
      *
     c                   dou       w_srrn = w_spge
      *
     c                   select
     c                   when      w_seqe = 'A'
     c                   read      frabl2
5.70 c                   when      w_seqe = 'R'
5.70 c                   read      frabld
     c                   when      w_seqe = 'K'
     c                   read      frabl3
     c                   when      w_seqe = 'P'
     c                   read      frabl4
     c                   when      w_seqe = 'O'
     c                   read      frabl5
     c                   when      w_seqe = 'H'
     c                   read      frabl6
     c                   when      w_seqe = 'U'
     c                   read      frabl7
     c                   when      w_seqe = 'L'
     c                   read      frabl8
     c                   when      w_seqe = 'M'
     c                   read      frabl9
     c                   when      w_seqe = 'V'
     c                   read      frabla
     c                   when      w_seqe = 'E'
     c                   read      frablb
     c                   when      w_seqe = 'T'
     c                   read      frablc
     c                   other
     c                   read      frabl1
     c                   endsl
      *
     c                   if        %eof or
     c                             frfirm <> w_firm
     c                   eval      *in15 = *on
     c                   leave
     c                   endif
9.01  * test på egen prisgruppe
9.01 c                   if        b_mast = *off
9.01  * sjekk alle ikke master
9.01 c                   if        f1prgr <> *blank and
9.01 c                             frprgr <> *blank and
9.01 c                             frprgr <> f1prgr
9.01 c                   iter
9.01 c                   endif
9.01  *
9.01  * her sjekkes om blank - hvis egen så bort med blank
9.01 c                   if        f1prva = 1  and
9.01 c                             frprgr = *blank
9.01 c                   exsr      sjekk_blank
9.01 c                   if        b_funn = *on
9.01 c                   iter
9.01 c                   endif
9.01 c                   endif
9.10 c                   else
9.01  *master
9.01 c                   if        f1prgr <> *blank and
9.01 c                             frprgr <> f1prgr
9.01 c                   iter
9.01 c                   endif
9.01 c                   endif
      *
     c                   if        f1kund <> 0
     c                   if        frrkat <> 0 and
     c                             frrkat <> f1rkat or
     c                             frkkat <> 0 and
     c                             frkkat <> f1kkat or
     c                             frkund <> 0 and
     c                             frkund <> f1kund
     c                   iter
     c                   endif
     c                   endif
      *
     c                   if        f1kpro <> 0 and
     c                             frkpro <> 0 and
     c                             frkpro <> f1kpro
     c                   iter
     c                   endif
      *
     c                   eval      w_srrn = w_srrn + 1
      *
     c                   select
     c                   when      w_seqe = 'A'
     c                   eval      frabl2_kkat = frkkat
5.70 c                   when      w_seqe = 'R'
5.70 c                   eval      frabld_rkat = frrkat
     c                   when      w_seqe = 'K'
     c                   eval      frabl3_kund = frkund
     c                   eval      frabl3_kpro = frkpro
     c                   eval      frabl3_ogrp = frogrp
     c                   eval      frabl3_hgrp = frhgrp
     c                   eval      frabl3_ugrp = frugrp
     c                   eval      frabl3_ldor = frldor
     c                   when      w_seqe = 'P'
     c                   eval      frabl4_kpro = frkpro
     c                   when      w_seqe = 'O'
     c                   eval      frabl5_ogrp = frogrp
     c                   eval      frabl5_hgrp = frhgrp
     c                   eval      frabl5_ugrp = frugrp
     c                   when      w_seqe = 'H'
     c                   eval      frabl6_hgrp = frhgrp
     c                   eval      frabl6_ugrp = frugrp
     c                   when      w_seqe = 'U'
     c                   eval      frabl7_ugrp = frugrp
     c                   when      w_seqe = 'L'
     c                   eval      frabl8_ldor = frldor
     c                   when      w_seqe = 'M'
     c                   eval      frabl9_modn = frmodn
     c                   when      w_seqe = 'V'
     c                   eval      frabla_vare = frvare
5.70 c                   eval      frabla_prgr = frprgr
     c                   eval      frabla_enhe = frenhe
     c                   eval      frabla_lety = frlety
     c                   when      w_seqe = 'E'
     c                   eval      frablb_enhe = frenhe
     c                   when      w_seqe = 'T'
     c                   eval      frablc_lety = frlety
     c                   other
5.70 c                   eval      frabl1_prgr = frprgr
     c                   eval      frabl1_rkat = frrkat
     c                   eval      frabl1_kkat = frkkat
     c                   eval      frabl1_kund = frkund
     c                   eval      frabl1_kpro = frkpro
     c                   eval      frabl1_ogrp = frogrp
     c                   eval      frabl1_hgrp = frhgrp
     c                   eval      frabl1_ugrp = frugrp
     c                   eval      frabl1_ldor = frldor
     c                   eval      frabl1_modn = frmodn
     c                   eval      frabl1_vare = frvare
     c                   eval      frabl1_enhe = frenhe
     c                   eval      frabl1_lety = frlety
     c                   endsl
      *
5.70 c                   eval      b1prgr = frprgr
     c                   eval      b1rkat = frrkat
     c                   eval      b1kkat = frkkat
     c                   eval      b1kund = frkund
     c                   eval      b1kpro = frkpro
     c                   eval      b1ogrp = frogrp
     c                   eval      b1hgrp = frhgrp
     c                   eval      b1ugrp = frugrp
     c                   eval      b1ldor = frldor
     c                   eval      b1modn = frmodn
     c                   eval      b1vare = frvare
     c                   eval      b1enhe = frenhe
     c                   eval      b1lety = frlety
      *
     c                   if        *in80 = *off
     c                   eval      b1rab1 = frrab1
     c                   eval      b1rabn = frrabn
     c                   eval      b1dekn = frdekn
     c                   else
     c                   eval      b1rab1 = frra1d
     c                   eval      b1rabn = frrand
     c                   eval      b1dekn = frdekd
     c                   endif
      *
     c                   write     b1sfl
     c                   enddo
      *
     c                   if        w_srrn > w_ssrn
     c                   eval      w_sfrn = w_ssrn + 1
     c                   endif
      *
     c                   eval      w_ssrn = w_srrn
     c                   eval      w_virn = w_sfrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for å bla tilbake en side i subfilen
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     bck_subfile   begsr
      *
     c                   if        *in15
     c                   select
     c                   when      w_seqe = 'A'
     c     frabl2_key    setgt     frabl2
     c                   readp     frabl2
5.70 c                   when      w_seqe = 'R'
5.70 c     frabld_key    setgt     frabld
5.70 c                   readp     frabld
     c                   when      w_seqe = 'K'
     c     frabl3_key    setgt     frabl3
     c                   readp     frabl3
     c                   when      w_seqe = 'P'
     c     frabl4_key    setgt     frabl4
     c                   readp     frabl4
     c                   when      w_seqe = 'O'
     c     frabl5_key    setgt     frabl5
     c                   readp     frabl5
     c                   when      w_seqe = 'H'
     c     frabl6_key    setgt     frabl6
     c                   readp     frabl6
     c                   when      w_seqe = 'U'
     c     frabl7_key    setgt     frabl7
     c                   readp     frabl7
     c                   when      w_seqe = 'L'
     c     frabl8_key    setgt     frabl8
     c                   readp     frabl8
     c                   when      w_seqe = 'M'
     c     frabl9_key    setgt     frabl9
     c                   readp     frabl9
     c                   when      w_seqe = 'V'
     c     frabla_key    setgt     frabla
     c                   readp     frabla
     c                   when      w_seqe = 'E'
     c     frablb_key    setgt     frablb
     c                   readp     frablb
     c                   when      w_seqe = 'T'
     c     frablc_key    setgt     frablc
     c                   readp     frablc
     c                   other
     c     frabl1_key    setgt     frabl1
     c                   readp     frabl1
     c                   endsl
     c                   endif
      *
      * Leser tilbake en side
      *
     c                   eval      w_stel = 0
      *
     c                   dou       w_stel = w_ssrn + c_sfil
      *
     c                   select
     c                   when      w_seqe = 'A'
     c                   readp     frabl2
5.70 c                   when      w_seqe = 'R'
5.70 c                   readp     frabld
     c                   when      w_seqe = 'K'
     c                   readp     frabl3
     c                   when      w_seqe = 'P'
     c                   readp     frabl4
     c                   when      w_seqe = 'O'
     c                   readp     frabl5
     c                   when      w_seqe = 'H'
     c                   readp     frabl6
     c                   when      w_seqe = 'U'
     c                   readp     frabl7
     c                   when      w_seqe = 'L'
     c                   readp     frabl8
     c                   when      w_seqe = 'M'
     c                   readp     frabl9
     c                   when      w_seqe = 'V'
     c                   readp     frabla
     c                   when      w_seqe = 'E'
     c                   readp     frablb
     c                   when      w_seqe = 'T'
     c                   readp     frablc
     c                   other
     c                   readp     frabl1
     c                   endsl
      *
     c                   if        %eof or
     c                             frfirm <> w_firm
     c                   leave
     c                   endif
9.01  * test på egen prisgruppe
9.01 c                   if        b_mast = *off
9.01  * sjekk alle ikke master
9.01 c                   if        f1prgr <> *blank and
9.01 c                             frprgr <> *blank and
9.01 c                             frprgr <> f1prgr
9.01 c                   iter
9.01 c                   endif
9.01  *
9.01  * her sjekkes om blank - hvis egen så bort med blank
9.01 c                   if        f1prva = 1  and
9.01 c                             frprgr = *blank
9.01 c                   exsr      sjekk_blank
9.01 c                   if        b_funn = *on
9.01 c                   iter
9.01 c                   endif
9.01 c                   endif
9.01 c                   else
9.01  *master
9.01 c                   if        f1prgr <> *blank and
9.01 c                             frprgr <> f1prgr
9.01 c                   iter
9.01 c                   endif
9.01 c                   endif
      *
     c                   if        f1kund <> 0
     c                   if        frrkat <> 0 and
     c                             frrkat <> f1rkat or
     c                             frkkat <> 0 and
     c                             frkkat <> f1kkat or
     c                             frkund <> 0 and
     c                             frkund <> f1kund
     c                   iter
     c                   endif
     c                   endif
      *
     c                   if        f1kpro <> 0 and
     c                             frkpro <> 0 and
     c                             frkpro <> f1kpro
     c                   iter
     c                   endif
      *
     c                   eval      w_stel = w_stel + 1
      *
     c                   select
     c                   when      w_seqe = 'A'
     c                   eval      frabl2_kkat = frkkat
5.70 c                   when      w_seqe = 'R'
5.70 c                   eval      frabld_rkat = frrkat
     c                   when      w_seqe = 'K'
     c                   eval      frabl3_kund = frkund
     c                   eval      frabl3_kpro = frkpro
     c                   eval      frabl3_ogrp = frogrp
     c                   eval      frabl3_hgrp = frhgrp
     c                   eval      frabl3_ugrp = frugrp
     c                   eval      frabl3_ldor = frldor
     c                   when      w_seqe = 'P'
     c                   eval      frabl4_kpro = frkpro
     c                   when      w_seqe = 'O'
     c                   eval      frabl5_ogrp = frogrp
     c                   eval      frabl5_hgrp = frhgrp
     c                   eval      frabl5_ugrp = frugrp
     c                   when      w_seqe = 'H'
     c                   eval      frabl6_hgrp = frhgrp
     c                   eval      frabl6_ugrp = frugrp
     c                   when      w_seqe = 'U'
     c                   eval      frabl7_ugrp = frugrp
     c                   when      w_seqe = 'L'
     c                   eval      frabl8_ldor = frldor
     c                   when      w_seqe = 'M'
     c                   eval      frabl9_modn = frmodn
     c                   when      w_seqe = 'V'
     c                   eval      frabla_vare = frvare
5.70 c                   eval      frabla_prgr = frprgr
     c                   eval      frabla_enhe = frenhe
     c                   eval      frabla_lety = frlety
     c                   when      w_seqe = 'E'
     c                   eval      frablb_enhe = frenhe
     c                   when      w_seqe = 'T'
     c                   eval      frablc_lety = frlety
     c                   other
5.70 c                   eval      frabl1_prgr = frprgr
     c                   eval      frabl1_rkat = frrkat
     c                   eval      frabl1_kkat = frkkat
     c                   eval      frabl1_kund = frkund
     c                   eval      frabl1_kpro = frkpro
     c                   eval      frabl1_ogrp = frogrp
     c                   eval      frabl1_hgrp = frhgrp
     c                   eval      frabl1_ugrp = frugrp
     c                   eval      frabl1_ldor = frldor
     c                   eval      frabl1_modn = frmodn
     c                   eval      frabl1_vare = frvare
     c                   eval      frabl1_enhe = frenhe
     c                   eval      frabl1_lety = frlety
     c                   endsl
      *
     c                   enddo
      *
     c                   if        %eof
     c                   select
     c                   when      w_seqe = 'A'
     c     frabl2_key    setll     frabl2
5.70 c                   when      w_seqe = 'R'
     c     frabld_key    setll     frabld
     c                   when      w_seqe = 'K'
     c     frabl3_key    setll     frabl3
     c                   when      w_seqe = 'P'
     c     frabl4_key    setll     frabl4
     c                   when      w_seqe = 'O'
     c     frabl5_key    setll     frabl5
     c                   when      w_seqe = 'H'
     c     frabl6_key    setll     frabl6
     c                   when      w_seqe = 'U'
     c     frabl7_key    setll     frabl7
     c                   when      w_seqe = 'L'
     c     frabl8_key    setll     frabl8
     c                   when      w_seqe = 'M'
     c     frabl9_key    setll     frabl9
     c                   when      w_seqe = 'V'
     c     frabla_key    setll     frabla
     c                   when      w_seqe = 'E'
     c     frablb_key    setll     frablb
     c                   when      w_seqe = 'T'
     c     frablc_key    setll     frablc
     c                   other
     c     frabl1_key    setll     frabl1
     c                   endsl
     c                   endif
      *
      * Blanker og fyller opp subfile
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for display av subfile
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     dsp_subfile   begsr
      *
     c                   if        w_srrn <> 0
     c                   eval      *in12 = *on
     c                   else
     c                   write     b2cmd
     c                   endif
      *
     c                   eval      *in13 = *on
     c                   exfmt     b2ctl
      *
     c                   eval      *in12 = *off
     c                   eval      *in13 = *off
      *
     c                   eval      w_fcrn = d_fcrn
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av spørring
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     spØrring      begsr
5.70  *
5.70  * Prisgruppe
5.70  *
5.70 c                   if        w_afld = 'B2PRGR'
5.70 c                   call      'RA530R'
5.70 c                   parm                    w_firm
5.70 c                   parm                    b2prgr
5.70 c                   parm                    w_dtxt
5.70 c                   leavesr
5.70 c                   endif
9.01  *
9.01 c                   if        w_afld = 'F1PRGR'
9.01 c                   call      'RA530R'
9.01 c                   parm                    w_firm
9.01 c                   parm                    f1prgr
9.01 c                   parm                    f1ptxt
9.01 c                   leavesr
9.01 c                   endif
9.04  *
9.04 c                   if        w_afld = 'C9FPRG'
9.04 c                   call      'RA530R'
9.04 c                   parm                    w_firm
9.04 c                   parm                    c9fprg
9.04 c                   parm                    c9fptx
9.04 c                   leavesr
9.04 c                   endif
9.04  *
9.04 c                   if        w_afld = 'C9TPRG'
9.04 c                   call      'RA530R'
9.04 c                   parm                    w_firm
9.04 c                   parm                    c9tprg
9.04 c                   parm                    c9tptx
9.04 c                   leavesr
9.04 c                   endif
      *
      * Rabattkategori
      *
     c                   if        w_afld = 'B2RKAT'
     c                   call      'RA506R'
     c                   parm                    w_firm
     c                   parm                    b2rkat
     c                   parm                    w_rtxt
     c                   leavesr
     c                   endif
5.70  *
5.70 c                   if        w_afld = 'C1PRGR'
5.70 c                   call      'RA530R'
5.70 c                   parm                    w_firm
5.70 c                   parm                    c1prgr
5.70 c                   parm                    c1ptxt
5.70 c                   leavesr
5.70 c                   endif
      *
     c                   if        w_afld = 'C1RKAT'
     c                   call      'RA506R'
     c                   parm                    w_firm
     c                   parm                    c1rkat
     c                   parm                    c1rtxt
     c                   leavesr
     c                   endif
5.70  *
5.70 c                   if        w_afld = 'K1PRGR'
5.70 c                   call      'RA530R'
5.70 c                   parm                    w_firm
5.70 c                   parm                    k1prgr
5.70 c                   parm                    w_dtxt
5.70 c                   leavesr
5.70 c                   endif
      *
     c                   if        w_afld = 'K1RKAT'
     c                   call      'RA506R'
     c                   parm                    w_firm
     c                   parm                    k1rkat
     c                   parm                    w_rtxt
     c                   leavesr
     c                   endif
      *
9.03 c                   if        w_afld = 'C9FKAT'
9.03 c                   call      'RA506R'
9.03 c                   parm                    w_firm
9.03 c                   parm                    c9fkat
9.04 c                   parm                    c9fktx
9.03 c                   leavesr
9.03 c                   endif
      *
9.03 c                   if        w_afld = 'C9TKAT'
9.03 c                   call      'RA506R'
9.03 c                   parm                    w_firm
9.03 c                   parm                    c9tkat
9.04 c                   parm                    c9tktx
9.03 c                   leavesr
9.03 c                   endif
      *
      * Kundekategori
      *
     c                   if        w_afld = 'B2KKAT'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    b2kkat
     c                   parm                    w_ktxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1KKAT'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    c1kkat
     c                   parm                    c1ktxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1KKAT'
     c                   call      'RA511R'
     c                   parm                    w_firm
     c                   parm                    k1kkat
     c                   parm                    w_ktxt
     c                   leavesr
     c                   endif
      *
      * Kunde
      *
     c                   if        w_afld = 'B2KUND'
     c                   eval      b2kpro = 0
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    b2kund
     c                   parm                    w_knav
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1KUND'
     c                   eval      c1kpro = 0
     c                   eval      c1pnav = *blank
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    c1kund
     c                   parm                    c1knav
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1KUND'
     c                   eval      k1kpro = 0
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    k1kund
     c                   parm                    w_knav
     c                   leavesr
     c                   endif
      *
      * Kundeprosjekt
      *
     c                   if        w_afld = 'B2KPRO'
     c                   call      'FL500R'
     c                   parm                    w_firm
     c                   parm                    b2kund
     c                   parm                    b2kpro
     c                   parm                    w_knav
     c                   parm                    w_pnav
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1KPRO'
     c                   call      'FL500R'
     c                   parm                    w_firm
     c                   parm                    c1kund
     c                   parm                    c1kpro
     c                   parm                    c1knav
     c                   parm                    c1pnav
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1KPRO'
     c                   call      'FL500R'
     c                   parm                    w_firm
     c                   parm                    k1kund
     c                   parm                    k1kpro
     c                   parm                    w_knav
     c                   parm                    w_pnav
     c                   leavesr
     c                   endif
      *
      * Overgruppe
      *
     c                   if        w_afld = 'B2OGRP'
     c                   call      'VG510R'
     c                   parm                    w_firm
     c                   parm                    b2ogrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1OGRP'
     c                   call      'VG510R'
     c                   parm                    w_firm
     c                   parm                    c1ogrp
     c                   parm                    c1gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1OGRP'
     c                   call      'VG510R'
     c                   parm                    w_firm
     c                   parm                    k1ogrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
      * Hovedgruppe
      *
     c                   if        w_afld = 'B2HGRP'
     c                   call      'VG511R'
     c                   parm                    w_firm
     c                   parm                    b2ogrp
     c                   parm                    b2hgrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1HGRP'
     c                   call      'VG511R'
     c                   parm                    w_firm
     c                   parm                    c1ogrp
     c                   parm                    c1hgrp
     c                   parm                    c1gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1HGRP'
     c                   call      'VG511R'
     c                   parm                    w_firm
     c                   parm                    k1ogrp
     c                   parm                    k1hgrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
      * Undergruppe
      *
     c                   if        w_afld = 'B2UGRP'
     c                   call      'VG512R'
     c                   parm                    w_firm
     c                   parm                    b2ogrp
     c                   parm                    b2hgrp
     c                   parm                    b2ugrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1UGRP'
     c                   call      'VG512R'
     c                   parm                    w_firm
     c                   parm                    c1ogrp
     c                   parm                    c1hgrp
     c                   parm                    c1ugrp
     c                   parm                    c1gtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1UGRP'
     c                   call      'VG512R'
     c                   parm                    w_firm
     c                   parm                    k1ogrp
     c                   parm                    k1hgrp
     c                   parm                    k1ugrp
     c                   parm                    w_gtxt
     c                   leavesr
     c                   endif
      *
      * Leverandør
      *
     c                   if        w_afld = 'B2LDOR'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    b2ldor
     c                   parm                    w_lnav
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1LDOR'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    c1ldor
     c                   parm                    c1lnav
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1LDOR'
     c                   call      'RL500R'
     c                   parm                    w_firm
     c                   parm                    k1ldor
     c                   parm                    w_lnav
     c                   leavesr
     c                   endif
      *
      * Modulnr
      *
     c                   if        w_afld = 'B2MODN'
     c                   call      'FO707C'
     c                   parm                    w_firm
     c                   parm                    b2modn
     c                   parm                    w_mtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1MODN'
     c                   call      'FO707C'
     c                   parm                    w_firm
     c                   parm                    c1modn
     c                   parm                    c1mtxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1MODN'
     c                   call      'FO707C'
     c                   parm                    w_firm
     c                   parm                    k1modn
     c                   parm                    w_mtxt
     c                   leavesr
     c                   endif
      *
      * Varenummer
      *
     c                   if        w_afld = 'B2VARE'
     c                   eval      w_vare = b2vare
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    w_vtxt
     c                   eval      b2vare = w_vare
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1VARE'
     c                   eval      w_vare = c1vare
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    c1vtxt
     c                   eval      c1vare = w_vare
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1VARE'
     c                   eval      w_vare = k1vare
     c                   call      'VV500R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    w_vtxt
     c                   eval      k1vare = w_vare
     c                   leavesr
     c                   endif
      *
      * Enhet
      *
     c                   if        w_afld = 'B2ENHE'
     c                   if        b2vare <> *blank
     c                   eval      w_vare = b2vare
     c                   call      'VE550R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    b2enhe
     c                   parm                    w_etxt
     c                   else
     c                   call      'VA510R'
     c                   parm                    w_firm
     c                   parm                    b2enhe
     c                   parm                    w_etxt
     c                   endif
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1ENHE'
     c                   if        c1vare <> *blank
     c                   eval      w_vare = c1vare
     c                   call      'VE550R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    c1enhe
     c                   parm                    c1etxt
     c                   else
     c                   call      'VA510R'
     c                   parm                    w_firm
     c                   parm                    c1enhe
     c                   parm                    c1etxt
     c                   endif
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1ENHE'
     c                   if        k1vare <> *blank
     c                   eval      w_vare = k1vare
     c                   call      'VE550R'
     c                   parm                    w_firm
     c                   parm                    w_vare
     c                   parm                    k1enhe
     c                   parm                    w_etxt
     c                   else
     c                   call      'VA510R'
     c                   parm                    w_firm
     c                   parm                    k1enhe
     c                   parm                    w_etxt
     c                   endif
     c                   leavesr
     c                   endif
      *
      * Leveringstype
      *
     c                   if        w_afld = 'B2LETY'
     c                   call      'VY500R'
     c                   parm                    w_firm
     c                   parm                    b2lety
     c                   parm                    w_ltxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'C1LETY'
     c                   call      'VY500R'
     c                   parm                    w_firm
     c                   parm                    c1lety
     c                   parm                    c1ltxt
     c                   leavesr
     c                   endif
      *
     c                   if        w_afld = 'K1LETY'
     c                   call      'VY500R'
     c                   parm                    w_firm
     c                   parm                    k1lety
     c                   parm                    w_ltxt
     c                   leavesr
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Filter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     filter        begsr
      *
     c     f1tagb        tag
      *
     c                   exfmt     f1win
      *
     c                   if        *inkc or *inkl
     c                   leavesr
     c                   endif
      *
      * Spørring
      *
     c                   if        *inkd
      *
     c                   if        w_afld = 'F1KUND'
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    f1kund
     c                   parm                    f1knav
     c                   goto      f1tagb
     c                   endif
      *
     c                   if        w_afld = 'F1KPRO'
     c                   call      'FL500R'
     c                   parm                    w_firm
     c                   parm                    f1kund
     c                   parm                    f1kpro
     c                   parm                    f1knav
     c                   parm                    f1pnav
     c                   goto      f1tagb
     c                   endif
9.01  *
9.01 c                   if        w_afld = 'F1PRGR'
9.01 c                   call      'RA530R'
9.01 c                   parm                    w_firm
9.01 c                   parm                    f1prgr
9.01 c                   parm                    f1ptxt
9.01 c                   goto      f1tagb
9.01 c                   endif
      *
     c                   endif
      *
      * Validering
      *
     c                   if        f1kund <> 0
     c                   eval      rkunl1_kund = f1kund
     c     rkunl1_key    chain     rkunl1                             31
     c                   if        *in31 = *on
     c                   goto      f1tagb
     c                   endif
     c                   eval      f1knav = rknavn
     c                   endif
      *
     c                   if        f1kund = 0 and
     c                             f1kpro <> 0
     c                   eval      *in32 = *on
     c                   goto      f1tagb
     c                   endif
      *
     c                   if        f1kpro <> 0
     c                   eval      fkprl1_kund = f1kund
     c                   eval      fkprl1_kpro = f1kpro
     c     fkprl1_key    chain     fkprl1                             33
     c                   if        *in33 = *on
     c                   goto      f1tagb
     c                   endif
     c                   eval      f1pnav = flnavn
     c                   endif
9.01  *
9.01  * validering prisgruppe
9.01  *
9.01 c                   if        w_prgr <> *blank
9.01 c                   eval      ra30lr_dkod = w_prgr
9.01 c     ra30lr_key    chain     ra30lr
9.01 c                   if        not %found(ra30lr)
9.01 c                   eval      *in34 = *on
9.01 c                   goto      f1tagb
9.01 c                   endif
9.01 c                   endif
      *
      * Henter verdier til liste-bildet
      *
     c                   eval      b2kunf = f1kund
     c                   eval      b2kprf = f1kpro
      *
      * Nullstiller og avbryter dersom kunde ikke er utfylt
      *
     c                   if        f1kund = 0
     c                   eval      f1rkat = 0
     c                   eval      f1kkat = 0
     c                   eval      f1kpro = 0
     c                   eval      f1knav = *blank
     c                   eval      f1pnav = *blank
     c                   goto      end_filter
     c                   endif
      *
      * Finner rabattkategori/kundekategori for kunde
      *
     c                   eval      rkunl1_kund = f1kund
     c     rkunl1_key    chain     rkunl1
     c                   if        %found
     c                   eval      f1rkat = rkrabk
     c                   eval      f1kkat = rkkatg
     c                   endif
      *
      * Henter overstyringer fra kundeprosjekt
      *
     c                   if        f1kpro <> 0
      *
     c                   eval      fkprl1_kund = f1kund
     c                   eval      fkprl1_kpro = f1kpro
     c     fkprl1_key    chain     fkprl1
     c                   if        %found
      *
     c                   if        florka <> 0
     c                   eval      f1rkat = florka
     c                   endif
      *
     c                   if        flokun <> 0
     c                   eval      f1kund = flokun
     c                   eval      f1kpro = 0
     c                   endif
      *
     c                   if        flokpr <> 0
     c                   eval      f1kpro = flokpr
     c                   endif
      *
     c                   if        flokun <> 0
     c                   eval      rkunl1_kund = flokun
     c     rkunl1_key    chain     rkunl1
     c                   if        %found
     c                   eval      f1rkat = rkrabk
     c                   eval      f1kkat = rkkatg
     c                   endif
     c                   endif
      *
     c                   endif
     c                   endif
      *
      * Blanker subfile, og fyller opp i.h.t. filter
      *
     c     end_filter    tag
      *
     c                   eval      *in22 = *off
      *
     c                   eval      w_seqe = *blank
      *
5.70 c                   eval      frabl1_prgr = *blank
     c                   eval      frabl1_rkat = 0
     c                   eval      frabl1_kkat = 0
     c                   eval      frabl1_kund = 0
     c                   eval      frabl1_kpro = 0
     c     frabl1_key    setll     frabl1
      *
     c                   exsr      clr_subfile
     c                   exsr      crt_subfile
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Sjekker inntastede verdier, og henter beskrivelser
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_input   begsr
      *
     c                   eval      b_feil = *off
      *
5.70 c                   eval      w_dtxt = *blank
     c                   eval      w_rtxt = *blank
     c                   eval      w_ktxt = *blank
     c                   eval      w_knav = *blank
     c                   eval      w_pnav = *blank
     c                   eval      w_gtxt = *blank
     c                   eval      w_lnav = *blank
     c                   eval      w_mtxt = *blank
     c                   eval      w_vtxt = *blank
     c                   eval      w_etxt = *blank
     c                   eval      w_ltxt = *blank
9.01  *
9.01  * Sjekker input master-prisgruppe
9.01  *
9.01 c                   if        b_mast = *off and
9.01 c                             c1prgr <> *blank and
9.01 c                             c1prgr <> f1prgr
9.01 c                   eval      *in52 = *on
9.01 c                   leavesr
9.01 c                   endif
      *
      * Rabattmatrise-nivå
      *
     c***                if        w_rkat = 0 and
     c***                          w_kkat = 0 and
     c***                          w_kund = 0
     c***                eval      *in31 = *on
     c***                eval      b_feil = *on
     c***                leavesr
     c***                endif
      *
7.01 c*                   if        w_rkat <> 0 and
7.01 c*                             w_kkat <> 0 or
7.01 c                   if        w_rkat <> 0 and
     c                             w_kund <> 0 or
     c                             w_kkat <> 0 and
     c                             w_kund <> 0
     c                   eval      *in33 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
      *
     c                   if        w_modn <> 0
     c                   if        w_ogrp <> 0 or
     c                             w_ldor <> 0 or
     c                             w_vare <> *blank
     c                   eval      *in34 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   endif
      *
     c                   if        w_vare <> *blank
     c                   if        w_ogrp <> 0 or
     c                             w_ldor <> 0 or
     c                             w_modn <> 0
     c                   eval      *in35 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   endif
5.70  *
5.70  * Prisgruppe
5.70  *
5.70 c                   if        w_prgr <> *blank
5.70 c                   eval      ra30lr_dkod = w_prgr
5.70 c     ra30lr_key    chain     ra30lr                             49
5.70 c                   if        *in49 = *on
5.70 c                   eval      b_feil = *on
5.70 c                   leavesr
5.70 c                   endif
5.70 c                   eval      w_dtxt = redtxt
5.70 c                   endif
      *
      * Rabattkategori
      *
     c                   if        w_rkat <> 0
     c                   eval      ra06pf_fkod = w_rkat
     c     ra06pf_key    chain     ra06pf                             36
     c                   if        *in36 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_rtxt = raftxt
     c                   endif
      *
      * Kundekategori
      *
     c                   if        w_kkat <> 0
     c                   eval      ra11pf_kkod = w_kkat
     c     ra11pf_key    chain     ra11pf                             37
     c                   if        *in37 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_ktxt = raktxt
     c                   endif
      *
      * Kunde / kundeprosjekt
      *
     c                   if        w_kund <> 0
     c                   eval      rkunl1_kund = w_kund
     c     rkunl1_key    chain     rkunl1                             38
     c                   if        *in38 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_knav = rknavn
     c                   endif
      *
     c                   if        w_kund = 0 and
     c                             w_kpro <> 0
     c                   eval      *in39 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
      *
     c                   if        w_kpro <> 0
     c                   eval      fkprl1_kund = w_kund
     c                   eval      fkprl1_kpro = w_kpro
     c     fkprl1_key    chain     fkprl1                             40
     c                   if        *in40 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_pnav = flnavn
     c                   endif
      *
      * Overgruppe
      *
     c                   if        w_ogrp <> 0 and
     c                             w_hgrp = 0
     c                   eval      vogrl1_oogr = w_ogrp
     c     vogrl1_key    chain     vogrl1                             41
     c                   if        *in41 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_gtxt = vgotxt
     c                   endif
      *
      * Hovedgruppe
      *
     c                   if        w_hgrp <> 0 and
     c                             w_ugrp = 0
     c                   eval      vhgrl1_hogr = w_ogrp
     c                   eval      vhgrl1_hhgr = w_hgrp
     c     vhgrl1_key    chain     vhgrl1                             42
     c                   if        *in42 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_gtxt = vghtxt
     c                   endif
      *
      * Undergruppe
      *
     c                   if        w_ugrp <> 0
     c                   eval      vugrl1_uogr = w_ogrp
     c                   eval      vugrl1_uhgr = w_hgrp
     c                   eval      vugrl1_uugr = w_ugrp
     c     vugrl1_key    chain     vugrl1                             43
     c                   if        *in43 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_gtxt = vgutxt
     c                   endif
      *
      * Leverandør
      *
     c                   if        w_ldor <> 0
     c                   eval      rlevl1_levr = w_ldor
     c     rlevl1_key    chain     rlevl1                             44
     c                   if        *in44 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_lnav = rlnavn
     c                   endif
      *
      * Modul
      *
     c                   if        w_modn <> 0
     c                   eval      vvarlb_nmod = w_modn
     c     vvarlb_key    chain     vvarlb                             45
     c                   if        *in45 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   call      'FO714C'
     c                   parm                    w_firm
     c                   parm                    w_modn
     c                   parm                    w_mtxt
     c                   endif
      *
      * Varenummer
      *
     c                   if        w_vare <> *blank
     c                   eval      vvarl1_vare = w_vare
     c     vvarl1_key    chain     vvarl1
     c                   if        %found
     c                   eval      w_vtxt = vvtek1
     c                   else
     c                   eval      jvarl1_vare = w_vare
     c     jvarl1_key    chain     jvarl1
     c                   if        not %found
     c                   eval      *in46 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_vtxt = jvtek1
     c                   endif
     c                   endif
      *
      * Enhet
      *
     c                   if        w_enhe <> *blank
     c                   eval      venhl1_enhe = w_enhe
     c     venhl1_key    chain     venhl1                             47
     c                   if        *in47 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_etxt = vaetxt
     c                   endif
      *
      * Leveringstype
      *
     c                   if        w_lety <> 0
     c                   eval      vltpl1_lety = w_lety
     c     vltpl1_key    chain     vltpl1                             48
     c                   if        *in48 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      w_ltxt = vybesk
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Henter beskrivelse
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     hent_info     begsr
      *
     c                   eval      c1rtxt = *blank
     c                   eval      c1ktxt = *blank
     c                   eval      c1knav = *blank
     c                   eval      c1pnav = *blank
     c                   eval      c1gtxt = *blank
     c                   eval      c1lnav = *blank
     c                   eval      c1mtxt = *blank
     c                   eval      c1vtxt = *blank
     c                   eval      c1etxt = *blank
     c                   eval      c1ltxt = *blank
5.70  *
5.70  * Prisgruppe
5.70  *
5.70 c                   if        c1prgr <> *blank
5.70 c                   eval      ra30lr_dkod = c1prgr
5.70 c     ra30lr_key    chain     ra30lr
5.70 c                   if        %found
5.70 c                   eval      c1ptxt = redtxt
5.70 c                   endif
5.70 c                   endif
      *
      * Rabattkategori
      *
     c                   if        c1rkat <> 0
     c                   eval      ra06pf_fkod = c1rkat
     c     ra06pf_key    chain     ra06pf
     c                   if        %found
     c                   eval      c1rtxt = raftxt
     c                   endif
     c                   endif
      *
      * Kundekategori
      *
     c                   if        c1kkat <> 0
     c                   eval      ra11pf_kkod = c1kkat
     c     ra11pf_key    chain     ra11pf                             91
     c                   if        *in91 = *off
     c                   eval      c1ktxt = raktxt
     c                   endif
     c                   endif
      *
      * Kunde
      *
     c                   if        c1kund <> 0
     c                   eval      rkunl1_kund = c1kund
     c     rkunl1_key    chain     rkunl1
     c                   if        %found
     c                   eval      c1knav = rknavn
     c                   endif
     c                   endif
      *
      * Kundeprosjekt
      *
     c                   if        c1kpro <> 0
     c                   eval      fkprl1_kund = c1kund
     c                   eval      fkprl1_kpro = c1kpro
     c     fkprl1_key    chain     fkprl1
     c                   if        %found
     c                   eval      c1pnav = flnavn
     c                   endif
     c                   endif
      *
      * Overgruppe
      *
     c                   if        c1ogrp <> 0 and
     c                             c1hgrp = 0
     c                   eval      vogrl1_oogr = c1ogrp
     c     vogrl1_key    chain     vogrl1
     c                   if        %found
     c                   eval      c1gtxt = vgotxt
     c                   endif
     c                   endif
      *
      * Hovedgruppe
      *
     c                   if        c1hgrp <> 0 and
     c                             c1ugrp = 0
     c                   eval      vhgrl1_hogr = c1ogrp
     c                   eval      vhgrl1_hhgr = c1hgrp
     c     vhgrl1_key    chain     vhgrl1
     c                   if        %found
     c                   eval      c1gtxt = vghtxt
     c                   endif
     c                   endif
      *
      * Undergruppe
      *
     c                   if        c1ugrp <> 0
     c                   eval      vugrl1_uogr = c1ogrp
     c                   eval      vugrl1_uhgr = c1hgrp
     c                   eval      vugrl1_uugr = c1ugrp
     c     vugrl1_key    chain     vugrl1
     c                   if        %found
     c                   eval      c1gtxt = vgutxt
     c                   endif
     c                   endif
      *
      * Leverandør
      *
     c                   if        c1ldor <> 0
     c                   eval      rlevl1_levr = c1ldor
     c     rlevl1_key    chain     rlevl1
     c                   if        %found
     c                   eval      c1lnav = rlnavn
     c                   endif
     c                   endif
      *
      * Modul
      *
     c                   if        c1modn <> 0
     c                   call      'FO714C'
     c                   parm                    w_firm
     c                   parm                    c1modn
     c                   parm                    c1mtxt
     c                   endif
      *
      * Varenummer
      *
     c                   if        c1vare <> *blank
     c                   eval      vvarl1_vare = c1vare
     c     vvarl1_key    chain     vvarl1
     c                   if        %found
     c                   eval      c1vtxt = vvtek1
     c                   else
     c                   eval      jvarl1_vare = c1vare
     c     jvarl1_key    chain     jvarl1
     c                   if        %found
     c                   eval      c1vtxt = jvtek1
     c                   endif
     c                   endif
     c                   endif
      *
      * Enhet
      *
     c                   if        c1enhe <> *blank
     c                   eval      venhl1_enhe = c1enhe
     c     venhl1_key    chain     venhl1
     c                   if        %found
     c                   eval      c1etxt = vaetxt
     c                   endif
     c                   endif
      *
      * Leveringstype
      *
     c                   if        c1lety <> 0
     c                   eval      vltpl1_lety = c1lety
     c     vltpl1_key    chain     vltpl1
     c                   if        %found
     c                   eval      c1ltxt = vybesk
     c                   endif
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Kalkuler DG for linje i rabattmatrise
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     kalk_dg       begsr
      *
     c                   eval      w_vare = c1vare
      *
     c                   eval      w_ra1f = *loval
     c                   eval      w_ra1t = *loval
     c                   eval      w_ra2f = *loval
     c                   eval      w_ra2t = *loval
     c                   eval      w_ranf = *loval
     c                   eval      w_rant = *loval
     c                   eval      w_rbuf = *loval
     c                   eval      w_rbut = *loval
     c                   eval      w_ratf = *loval
     c                   eval      w_ratt = *loval
     c                   eval      w_dekf = *loval
     c                   eval      w_dekt = *loval
      *
     c                   if        c2ra1f <> 0
     c     *dmy          move      c2ra1f        w_ra1f
     c                   endif
      *
     c                   if        c2ra1t <> 0
     c     *dmy          move      c2ra1t        w_ra1t
     c                   endif
      *
     c                   if        c2ra2f <> 0
     c     *dmy          move      c2ra2f        w_ra2f
     c                   endif
      *
     c                   if        c2ra2t <> 0
     c     *dmy          move      c2ra2t        w_ra2t
     c                   endif
      *
     c                   if        c2ranf <> 0
     c     *dmy          move      c2ranf        w_ranf
     c                   endif
      *
     c                   if        c2rant <> 0
     c     *dmy          move      c2rant        w_rant
     c                   endif
      *
     c                   if        c2rbuf <> 0
     c     *dmy          move      c2rbuf        w_rbuf
     c                   endif
      *
     c                   if        c2rbut <> 0
     c     *dmy          move      c2rbut        w_rbut
     c                   endif
      *
     c                   if        c2ratf <> 0
     c     *dmy          move      c2ratf        w_ratf
     c                   endif
      *
     c                   if        c2ratt <> 0
     c     *dmy          move      c2ratt        w_ratt
     c                   endif
      *
     c                   if        c2dekf <> 0
     c     *dmy          move      c2dekf        w_dekf
     c                   endif
      *
     c                   if        c2dekt <> 0
     c     *dmy          move      c2dekt        w_dekt
     c                   endif
      *
     c                   time                    w_udat
     c                   time                    w_utim
      *
     c                   call      'FR700R'
     c                   parm                    w_firm
5.71 c                   parm                    c1prgr
     c                   parm                    c1ogrp
     c                   parm                    c1hgrp
     c                   parm                    c1ugrp
     c                   parm                    c1ldor
     c                   parm                    c1modn
     c                   parm                    w_vare
     c                   parm                    c1enhe
     c                   parm                    c1lety
     c                   parm                    c2rab1
     c                   parm                    c2ra1d
     c                   parm                    w_ra1f
     c                   parm                    w_ra1t
     c                   parm                    c2rab2
     c                   parm                    c2ra2d
     c                   parm                    w_ra2f
     c                   parm                    w_ra2t
     c                   parm                    c2rabn
     c                   parm                    c2rand
     c                   parm                    w_ranf
     c                   parm                    w_rant
     c                   parm                    c2rabb
     c                   parm                    c2rabd
     c                   parm                    w_rbuf
     c                   parm                    w_rbut
     c                   parm                    c2rabt
     c                   parm                    c2ratd
     c                   parm                    w_ratf
     c                   parm                    w_ratt
     c                   parm                    c2dekn
     c                   parm                    c2dekd
     c                   parm                    w_dekf
     c                   parm                    w_dekt
     c                   parm                    w_udat
     c                   parm                    w_utim
     c                   parm                    b_inlr
     c                   parm                    c2dggj
      *
     c                   endsr
9.01  *
9.01  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
9.01  * Sjekker om prisgruppen har en kopi av blank
9.01  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
9.01  *
9.01 c     sjekk_blank   begsr
9.01 c                   eval      b_funn = *off
9.01  *
9.01 c                   eval      frablr_prgr = f1prgr
9.01 c                   eval      frablr_rkat = frrkat
9.01 c                   eval      frablr_kkat = frkkat
9.01 c                   eval      frablr_kund = frkund
9.01 c                   eval      frablr_kpro = frkpro
9.01 c                   eval      frablr_ogrp = frogrp
9.01 c                   eval      frablr_hgrp = frhgrp
9.01 c                   eval      frablr_ugrp = frugrp
9.01 c                   eval      frablr_ldor = frldor
9.01 c                   eval      frablr_modn = frmodn
9.01 c                   eval      frablr_vare = frvare
9.01 c                   eval      frablr_enhe = frenhe
9.01 c                   eval      frablr_lety = frlety
9.01 c     frablr_key    chain     frablr                             90
9.01 c                   if        %found(frablr)
9.01 c                   eval      b_funn = *on
9.01 c                   endif
9.01  *
9.01 c                   endsr
9.01  *
9.01  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
9.01  * Sjekker om bruker har lov til å kopiere prisgruppen
9.01  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
9.01  *
9.01 c     sjekk_prgr1   begsr
6.01 c                   eval      b_prok = *off
9.01  *
9.01 c                   if        w_prgr <> *blank and
9.01 c                             w_prgr <> f1prgr
9.01 c                   eval      b_prok = *on
9.01 c                   exsr      PG_varsel1
9.01 c                   endif
9.01  *
9.01 c                   endsr
9.01  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
9.01  * Sjekker om bruker har lov til å endre/slette - prisgruppen
9.01  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
9.01  *
9.01 c     sjekk_prgr2   begsr
9.01 c                   eval      b_prok = *off
9.01  *
9.01 c                   if        w_prgr <> *blank and
9.01 c                             w_prgr <> f1prgr
9.01 c                   eval      b_prok = *on
9.01 c                   exsr      PG_varsel2
9 01 c                   endif
9.01  *
9.01 c                   if        w_prgr =  *blank
9.01 c                   eval      b_prok = *on
9.01 c                   exsr      PG_varsel2
9.01 c                   endif
9.01  *
9.01 c                   endsr
9.01  *
9.01  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
9.01  * Varsel vedr styring av vedlikehold av prisgruppe
9.01  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
9.01  *
9.01 c     PG_varsel1    begsr
9.01  *
9.01 c                   eval      w_mld1 = 'Du kan kun kopiere  +
9.01 c                                       egne eller felles pri+
9.01 c                                       sgrupper.'
9.01 c                   call      'AA005R'
9.01 c                   parm                    w_mld1
9.01  *
9.01 c                   endsr
9.01  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
9.01  * Varsel vedr styring av vedlikehold av prisgruppe
9.01  * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
9.01  *
9.01 c     PG_varsel2    begsr
9.01  *
9.01 c                   eval      w_mld1 = 'Du kan kun +
9.01 c                                       endre/slette egne +
9.01 c                                       prisgrupper'
9.01 c                   call      'AA005R'
9.01 c                   parm                    w_mld1
9.01  *
9.01 c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppslag på rabattmatrise
      *
     c     frablr_key    klist
     c                   kfld                    w_firm
5.70 c                   kfld                    frablr_prgr
     c                   kfld                    frablr_rkat
     c                   kfld                    frablr_kkat
     c                   kfld                    frablr_kund
     c                   kfld                    frablr_kpro
     c                   kfld                    frablr_ogrp
     c                   kfld                    frablr_hgrp
     c                   kfld                    frablr_ugrp
     c                   kfld                    frablr_ldor
     c                   kfld                    frablr_modn
     c                   kfld                    frablr_vare
     c                   kfld                    frablr_enhe
     c                   kfld                    frablr_lety
9.03  *
9.03  * Key for oppslag på rabattmatrise
9.03  *
9.03 c     frablr_key2   klist
9.03 c                   kfld                    w_firm
9.03 c                   kfld                    frablr_prgr
9.03 c                   kfld                    frablr_rkat
      *
      * Key for oppdatering av rabattmatrise
      *
     c     frablu_key    klist
     c                   kfld                    w_firm
5.70 c                   kfld                    frablu_prgr
     c                   kfld                    frablu_rkat
     c                   kfld                    frablu_kkat
     c                   kfld                    frablu_kund
     c                   kfld                    frablu_kpro
     c                   kfld                    frablu_ogrp
     c                   kfld                    frablu_hgrp
     c                   kfld                    frablu_ugrp
     c                   kfld                    frablu_ldor
     c                   kfld                    frablu_modn
     c                   kfld                    frablu_vare
     c                   kfld                    frablu_enhe
     c                   kfld                    frablu_lety
      *
5.70  * Key for posisjonering på prisgruppe
      *
     c     frabl1_key    klist
     c                   kfld                    w_firm
5.70 c                   kfld                    frabl1_prgr
     c                   kfld                    frabl1_rkat
     c                   kfld                    frabl1_kkat
     c                   kfld                    frabl1_kund
     c                   kfld                    frabl1_kpro
     c                   kfld                    frabl1_ogrp
     c                   kfld                    frabl1_hgrp
     c                   kfld                    frabl1_ugrp
     c                   kfld                    frabl1_ldor
     c                   kfld                    frabl1_modn
     c                   kfld                    frabl1_vare
     c                   kfld                    frabl1_enhe
     c                   kfld                    frabl1_lety
      *
      * Key for posisjonering på kundekategori
      *
     c     frabl2_key    klist
     c                   kfld                    w_firm
     c                   kfld                    frabl2_kkat
5.70  *
5.70  * Key for posisjonering på rabattkategori
5.70  *
5.70 c     frabld_key    klist
5.70 c                   kfld                    w_firm
5.70 c                   kfld                    frabld_rkat
      *
      * Key for posisjonering på kunde
      *
     c     frabl3_key    klist
     c                   kfld                    w_firm
     c                   kfld                    frabl3_kund
     c                   kfld                    frabl3_kpro
     c                   kfld                    frabl3_ogrp
     c                   kfld                    frabl3_hgrp
     c                   kfld                    frabl3_ugrp
     c                   kfld                    frabl3_ldor
      *
      * Key for posisjonering på kundeprosjekt
      *
     c     frabl4_key    klist
     c                   kfld                    w_firm
     c                   kfld                    frabl4_kpro
      *
      * Key for posisjonering på overgruppe
      *
     c     frabl5_key    klist
     c                   kfld                    w_firm
     c                   kfld                    frabl5_ogrp
     c                   kfld                    frabl5_hgrp
     c                   kfld                    frabl5_ugrp
      *
      * Key for posisjonering på hovedgruppe
      *
     c     frabl6_key    klist
     c                   kfld                    w_firm
     c                   kfld                    frabl6_hgrp
     c                   kfld                    frabl6_ugrp
      *
      * Key for posisjonering på undergruppe
      *
     c     frabl7_key    klist
     c                   kfld                    w_firm
     c                   kfld                    frabl7_ugrp
      *
      * Key for posisjonering på leverandør
      *
     c     frabl8_key    klist
     c                   kfld                    w_firm
     c                   kfld                    frabl8_ldor
      *
      * Key for posisjonering på modulnr
      *
     c     frabl9_key    klist
     c                   kfld                    w_firm
     c                   kfld                    frabl9_modn
      *
      * Key for posisjonering på varenummer
      *
     c     frabla_key    klist
     c                   kfld                    w_firm
     c                   kfld                    frabla_vare
5.70 c                   kfld                    frabla_prgr
     c                   kfld                    frabla_enhe
     c                   kfld                    frabla_lety
      *
      * Key for posisjonering på enhet
      *
     c     frablb_key    klist
     c                   kfld                    w_firm
     c                   kfld                    frablb_enhe
      *
      * Key for posisjonering på leveringstype
      *
     c     frablc_key    klist
     c                   kfld                    w_firm
     c                   kfld                    frablc_lety
      *
      * Key for oppslag på rabattkategori
      *
     c     ra06pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra06pf_fkod
      *
      * Key for oppslag på kundekategori
      *
     c     ra11pf_key    klist
     c                   kfld                    w_firm
     c                   kfld                    ra11pf_kkod
5.70  *
5.70  * Key for oppslag på prisgruppe
5.70  *
5.70 c     ra30lr_key    klist
5.70 c                   kfld                    w_firm
5.70 c                   kfld                    ra30lr_dkod
      *
      * Key for oppslag på kunde
      *
     c     rkunl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rkunl1_kund
      *
      * Key for oppslag på kundeprosjekt
      *
     c     fkprl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    fkprl1_kund
     c                   kfld                    fkprl1_kpro
      *
      * Key for oppslag på overgruppe
      *
     c     vogrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vogrl1_oogr
      *
      * Key for oppslag på hovedgruppe
      *
     c     vhgrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vhgrl1_hogr
     c                   kfld                    vhgrl1_hhgr
      *
      * Key for oppslag på undergruppe
      *
     c     vugrl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vugrl1_uogr
     c                   kfld                    vugrl1_uhgr
     c                   kfld                    vugrl1_uugr
      *
      * Key for oppslag på leverandør
      *
     c     rlevl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rlevl1_levr
      *
      * Key for oppslag på vare
      *
     c     vvarl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarl1_vare
      *
     c     vvarlb_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vvarlb_nmod
      *
      * Key for oppslag på enhet
      *
     c     venhl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    venhl1_enhe
      *
      * Key for oppslag på leveringstype
      *
     c     vltpl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    vltpl1_lety
      *
      * Key for oppslag på vare (VA)
      *
     c     jvarl1_key    klist
     c                   kfld                    jvarl1_vare
9.01  *
9.01  * Key for oppslag på bruker
9.01  *
9.01 c     fusrl1_key    klist
9.01 c                   kfld                    w_firm
9.01 c                   kfld                    fusrl1_user
      *
      * Henter firma fra LDA
      *
     c                   eval      w_firm = l_firm
9.01  *
9.01  * Henter prisgruppe
9.01  *
9.01 c                   call      'VL711R   '
9.01 c                   parm                    w_prgr
9.01  *
9.01  * Henter opplysninger fra ofak bruker
9.01  *
9.01 c                   eval      fusrl1_user = l_user
9.01 c     fusrl1_key    chain     fusrl1
9.01 c                   if        fbko19 = 1
9.01 c                   eval      b_mast = *on
9.01 c                   endif
9.01  *
9.01 c                   if        b_mast = *off
9.01 c                   eval      ra30lr_dkod = w_prgr
9.01 c     ra30lr_key    chain     ra30lr                             49
9.01 c                   movel     redtxt        f1ptxt
9.01 c                   eval      f1prgr = w_prgr
9.01 c                   eval      *in29  = *on
9.01 c                   endif
9.03  *
9.03  * Har bruker tilgang til å kopiere rabattkategri.
9.03  *
9.03 c     l_user        chain     ausrl1
9.03 c                   if        %found and
9.03 c                             ablevl = 99
9.03 c                   eval      *in81 = *on
9.03 c                   endif
      *
      * Initierer skjermbilde
      *
     c                   eval      *in22 = *on
      *
      * Posisjonerer databasen, og fyller opp subfile
      *
     c     frabl1_key    setll     frabl1
      *
     c                   exsr      crt_subfile
      *
     c                   endsr
