     h option(*nodebugio) datedit(*dmy)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * System  . . . . : ASOFAK
      * Program . . . . : RX600R
      * Beskrivelse . . : Kunde eksport informasjon - parameter
      *
      * Spesialversjon. :
      * Tilpasset for . :
      *
      * Ref.   Dato  Sign Endringsbeskrivelse
      * ----- ------ ---- -------------------------------------------------
8.xx  *       150925 bsa  Nytt program
      *
      *
      *
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     frkunl1    if   e           k disk    rename(rkunpfr:rkunl1r)
      *
     frx600d    cf   e             workstn
      *
      * Local data area
      *
     d                uds
     d l_firm                944    946  0
      *
      * Datastruktur for parameterliste -ut
      *
     d                 ds
     d d_list                       512
     d  d_firm                        3  0 overlay(d_list)
     d  d_kund                        6  0 overlay(d_list:4)
     d  d_txt1                       60    overlay(d_list:36)
     d  d_txt2                       60    overlay(d_list:96)
     d  d_txt3                       60    overlay(d_list:156)
     d  d_emal                       60    overlay(d_list:216)
     d  d_subj                       60    overlay(d_list:276)
     d  d_avse                       60    overlay(d_list:336)
     d  d_dumm                        1    overlay(d_list:512) inz('*')
      *
      * Definering av variable i nøkler
      *
     d rkunl1_kund     s                   like(rkkund)
      *
      * Definering av variable
      *
     d b_feil          s              1    inz(*off)
      *
     d w_udat          s               d   datfmt(*iso)
     d w_stmp          s               z
     d w_stmp_alf      s             26
      *
     d w_firm          s                   like(rkfirm)
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * B1 Behandle åpningsbildet
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
      * Behandling av skjermbilde
      *
     c     b1taga        tag
      *
     c                   exfmt     b1bld
      *
      * F3=Avslutt
      *
     c                   if        *inkc or *inkl
     c                   goto      avslutt
     c                   endif
      *
      * F4=Spørring
      *
     c                   if        *inkd = *on
     c                   exsr      spØrring
     c                   goto      b1taga
     c                   endif
      *
      * Sjekker input-felter
      *
     c                   exsr      sjekk_input
     c                   if        b_feil = *on
     c                   goto      b1taga
     c                   endif
      *
      * Kaller utskriftsprogram
      *
     c                   exsr      flytt_par
      *
     c*                  if        b1mail = 1
     c*                  call      'RX602R'
     c*                  parm                    d_list
     c*                  else
     c                   call      'RX601R'
     c                   parm                    d_list
     c*                  endif
      * Nullstiller felter før evnt neste eksport
     c                   eval      b1kund = 0
     c                   eval      b1knav = *blanks
     c*                  eval      b1mail = 0
     c                   eval      b1subj = *blanks
     c                   eval      b1txt1 = *blanks
     c                   eval      b1txt2 = *blanks
     c                   eval      b1txt3 = *blanks
     c                   eval      b1emal = *blanks
     c                   eval      b1avse = *blanks
      *
     c                   goto      b1taga
      *
      * Avslutt program
      *
     c     avslutt       tag
      *
     c                   eval      *inlr = *on
     c                   return
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for behandling av spørringer (FD)
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     spØrring      begsr
      *
      * Kunde
      *
     c                   if        w_afld = 'B1KUND'
      *
     c                   call      'RK500R'
     c                   parm                    w_firm
     c                   parm                    b1kund
     c                   parm                    b1knav
      *
     c                   leavesr
     c                   endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for sjekking av input-felter
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     sjekk_input   begsr
      *
     c                   eval      b_feil = *off
      *
     c                   eval      b1knav = *blank
      *
      * Kunde / kundeprosjekt
      *
     c                   if        b1kund <> 0
     c                   eval      rkunl1_kund = b1kund
     c     rkunl1_key    chain     rkunl1                             34
     c                   if        *in34 = *on
     c                   eval      b_feil = *on
     c                   leavesr
     c                   endif
     c                   eval      b1knav = rknavn
     c                   endif
      *
     c*                  if        b1mail = 1
      *
     c*                  if        %trim(b1emal) = *blanks
     c*                  eval      *in40 = *on
     c*                  eval      b_feil = *on
     c*                  leavesr
     c*                  endif
      *
     c*                  if        %trim(b1subj) = *blanks
     c*                  eval      *in41 = *on
     c*                  eval      b_feil = *on
     c*                  leavesr
     c*                  endif
      *
     c*                  if        %trim(b1avse) = *blanks
     c*                  eval      *in42 = *on
     c*                  eval      b_feil = *on
     c*                  leavesr
     c*                  endif
      *
     c*                  endif
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for flytting av felter til DS-parametre
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     flytt_par     begsr
      *
     c                   eval      d_firm = w_firm
      *
     c                   eval      d_kund = b1kund
     c                   eval      d_subj = b1subj
     c                   eval      d_txt1 = b1txt1
     c                   eval      d_txt2 = b1txt2
     c                   eval      d_txt3 = b1txt3
     c                   eval      d_emal = b1emal
     c                   eval      d_avse = b1avse
      *
      * Lager membernavn sammensatt av 'W' + timestamp
      *
     c                   time                    w_stmp
      *
     c                   move      w_stmp        w_stmp_alf
      *
     c                   endsr
      *
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      * Subrutine for initiering av program
      * - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
      *
     c     *inzsr        begsr
      *
      * Key for oppslag på kunde
      *
     c     rkunl1_key    klist
     c                   kfld                    w_firm
     c                   kfld                    rkunl1_kund
      *
      * Henter firma fra LDA
      *
     c                   eval      w_firm = l_firm
      *
      * Initiering av skjermfelter
      *
     c                   time                    w_udat                                      .
      *
     c                   endsr
