             PGM        PARM(&WACTLI &WACTPO &M1MLD1 &M1MLD2)

/*  Newlook liker ikke bilder som blir vist en stund og forsvinner av se selv.*/
/*              derfor     er bildet/melding fjernet i cloud                  */

/*              DCLF       FILE(AA006D)                                       */
             DCL        VAR(&WACTLI)   TYPE(*DEC) LEN(2) /* 7.xx */
             DCL        VAR(&WACTPO)   TYPE(*DEC) LEN(3) /* 7.xx */
             DCL        VAR(&M1MLD1)   TYPE(*CHAR) LEN(30)
             DCL        VAR(&M1MLD2)   TYPE(*CHAR) LEN(30)
/*           MONMSG     MSGID(CPF0000) EXEC(GOTO START)    */

             CALL       PGM(AA011C)  PARM(&WACTLI &WACTPO &M1MLD1 &M1MLD2)


/*  START:      SNDRCVF    RCDFMT(M1WIN) /* 7.xx */
/*  START:      SNDF       RCDFMT(M1WIN)                 */ /* 7.xx */

 ENDPGM:     ENDPGM
