             PGM        PARM(&BIBL)
             DCL        VAR(&JOBB)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BIBL)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&TEXT)     TYPE(*CHAR) LEN(30)
             DCL        VAR(&MELD)     TYPE(*CHAR) LEN(50)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERR))
             RTVJOBA    JOB(&JOBB)

/* Bygge opp variabler                                               */

             CHGVAR     VAR(%SST(&TEXT 23 6)) VALUE(&BIBL)
             CHGVAR     VAR(%SST(&TEXT 1 25)) VALUE('Databibliotek +
                          filegruppe ')

/* Bygge opp data-bibliotek dersom det ikke finnes                   */

             CRTLIB     LIB(&BIBL) TEXT(&TEXT)
             MONMSG     MSGID(CPF2111) EXEC(DO)
             CHGVAR     VAR(&MELD) VALUE('Dette bibliotek +
                          finnes allerede')
             CALL       PGM(AA005R) PARM(&MELD)
             GOTO       CMDLBL(END)
             ENDDO

             GOTO       CMDLBL(END)
 ERR:        SNDPGMMSG  MSG('Det oppstod en feil, se melding +
                          i jobbloggen !!!') TOMSGQ(&JOBB)

 END:        ENDPGM
