             PGM
             DCL        VAR(&JOBB)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&MELD)     TYPE(*CHAR) LEN(50)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERR))
             RTVJOBA    JOB(&JOBB)

/* Varsle når det ikke ble funnet tilgang for denne bruker           */

/*           CHGVAR     VAR(&MELD)     VALUE('Denne bruker har +     */
/*                        ikke tilgang til valgte funksjon')         */
             CHGVAR     VAR(&MELD)     VALUE('Valgte program +
                          finnes ikke i din biblioteksliste')
             CALL       PGM(AA005R)    PARM(&MELD)
             GOTO       CMDLBL(END)
/*                                                                   */
 ERR:        SNDPGMMSG  MSG('Det oppstod en feil, se melding +
                          i jobbloggen !!!') TOMSGQ(&JOBB)

 END:        ENDPGM
