             PGM        PARM(&BIBL &SFIR &FNAV)
             DCL        VAR(&BIBL)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&SFIR)     TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)

/* Override av firmatabell før oppkall av AA502R                     */

             OVRDBF     FILE(AFIRPF)   TOFILE(&BIBL/AFIRPF)
             OVRDBF     FILE(AFIRL1)   TOFILE(&BIBL/AFIRL1)

/* Kaller program for valg av firma                                  */

             CALL       PGM(AA502R)    PARM(&SFIR &FNAV)

/* Avslutt Override av firmatabell                                   */

             DLTOVR     FILE(AFIRPF AFIRL1)

 END:        ENDPGM
