             PGM        PARM(&BIBL)

             DCL        VAR(&BIBL)      TYPE(*CHAR) LEN(10)

             MONMSG     MSGID(CPF2103)  /*    Bibl finnes fra før    */
             MONMSG     MSGID(CPF2110)  /*    Bibl ble ikke funnet   */
             MONMSG     MSGID(CPF0000)  EXEC(GOTO CMDLBL(END))

/* Endre current library                                             */

             CHGCURLIB  CURLIB(&BIBL)


END:         ENDPGM
