
/* Dette program sletter AS400 brukerprofilen                        */

             PGM        PARM(&USER &OWNR)

             DCL        VAR(&USER)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&OWNR)     TYPE(*CHAR) LEN(10)

/* Sletter med overføring av eierskap                                */

             DLTUSRPRF  USRPRF(&USER) OWNOBJOPT(*CHGOWN &OWNR)
             MONMSG     MSGID(CPF2204) EXEC(GOTO CMDLBL(END))

END:         ENDPGM
