
/* Dette program varsler dersom brukerprofil finnes fra før          */

             PGM        PARM(&USER &SVAR)

             DCL        VAR(&USER)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&SVAR)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&MELD)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&USRCLS)   TYPE(*CHAR) LEN(10)

/* Sjekk om bruker er opprettet fra før                              */

             RTVUSRPRF  USRPRF(&USER)  USRCLS(&USRCLS)
             MONMSG     MSGID(CPF2204) EXEC(GOTO CMDLBL(END))

/* Bruker funnet, sett variabel til 1                                */

             CHGVAR     VAR(&SVAR)     VALUE('1')
             CHGVAR     VAR(&MELD)     VALUE('Denne brukerprofil +
                                       finnes allerede på systemet')

             CALL       PGM(AA005R)    PARM(&MELD)

END:         ENDPGM
