/*                                                                   */

             PGM        PARM(&l1 &l2)

             dcl        var(&l1)  type(*char) len(10)
             dcl        var(&l2)  type(*char) len(10)

             chkobj     obj(&l1)  objtype(*lib)
             monmsg     msgid(cpf9801) exec(do)
               chgvar   var(&l1)  value(&l2)
               chkobj   obj(&l1)  objtype(*lib)
               monmsg   msgid(cpf9801) exec(do)
                 goto   cmdlbl(endpgm)
               enddo
             enddo

             call       pgm(aadoklibr)  parm(&l1)

endpgm:      endpgm
