/*    Lister all source fra et bibliotek.                                                */
/*    &L1 og &L2 er for at comandoen kan benyttes fra bibliotek, objekt og source-member */
/*    Lister all source fra et bibliotek.                                                */

             PGM        PARM(&l1 &l2)

             dcl        var(&l1)  type(*char) len(10)
             dcl        var(&l2)  type(*char) len(10)

             chkobj     obj(&l1)  objtype(*lib)
             monmsg     msgid(cpf9801) exec(do)
               chgvar   var(&l1)  value(&l2)
               chkobj   obj(&l1)  objtype(*lib)
               monmsg   msgid(cpf9801) exec(do)
                 goto   cmdlbl(endpgm)
               enddo
             enddo

             dspfd      file(&l1/Q*) type(*mbrlist) output(*outfile) outfile(&l1/W_DSpfd)

             runqry     qry(*libl/aalstlibq) qryfile((&l1/w_dspfd))

endpgm:      endpgm
