/*                                                                   */
/*                                                                   */
/* 9.02       *     191004  Newlook liker ikke selvlukkende vindu    bk.*/
             PGM        PARM(&WACTLI &WACTPO &M1MLD1 &M1MLD2 &M1MLD3 +
                          &M1MLD4)
             DCLF       FILE(AD009D)
             DCL        VAR(&M1MLD1)   TYPE(*CHAR) LEN(30)
             DCL        VAR(&M1MLD2)   TYPE(*CHAR) LEN(30)
             DCL        VAR(&M1MLD3)   TYPE(*CHAR) LEN(30)
             DCL        VAR(&M1MLD4)   TYPE(*CHAR) LEN(30)
             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             RTVJOBA    TYPE(&TYPE)
             IF         COND(&TYPE *EQ '1') THEN(DO)
/*  START:      SNDF       RCDFMT(M1WIN)                                      */
 START:         SNDRCVF    RCDFMT(M1WIN)
             ENDDO
 ENDPGM:     ENDPGM
/*                                                                   */
