
             PGM        PARM(&LINK)

/* Definering av variable                                            */

             DCL        VAR(&LINK)    TYPE(*CHAR) LEN(128)

             MONMSG     MSGID(CPF0000)

/* Kaller program for selve visningen                                */

             CALL &LINK

 ENDPGM:     ENDPGM
