             PGM        PARM(&FIL &LIB)
             DCL        VAR(&FIL)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB)    TYPE(*CHAR) LEN(10)

             DCLF       FILE(*LIBL/SS_DSPFD)

/*   LESER FIL FOR Å FINNE ALLE MEMBER                               */

NYRCV:       RCVF
             MONMSG     MSGID(CPF0864) EXEC(DO)
                        GOTO CMDLBL(ENDPGM)
               ENDDO

             IF         COND(&MLNAME *NE &MLFILE) THEN(DO)
               RMVM     FILE(&MLLIB/&MLFILE) MBR(&MLNAME)
             ENDDO
             GOTO     CMDLBL(NYRCV)

 ENDPGM:     ENDPGM
/*                                                                   */
