             PGM        PARM(&FIL &LIB)
             DCL        VAR(&FIL)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB)    TYPE(*CHAR) LEN(10)

/*           DCLF       FILE(ADB/SS_DSPFD)                           */
/*                                                                   */
/* DISPLAY ALLE MEMBER I FILEN   LEGESS I ADB/SS_DSPFD               */
/*                                                                   */
             DSPFD      FILE(&LIB/&FIL) TYPE(*MBRlist) +
                          OUTPUT(*OUTFILE) +
                          FILEATR(*PF) OUTFILE(*CURLIB/SS_DSPFD)

             call  pgm(adltambrb) parm(&fil &lib)

/*   LESER FIL FOR Å FINNE ALLE MEMBER                               */
/*                                                                  */
/*  NYRCV:       RCVF                                               */
/*           MONMSG     MSGID(CPF0864) EXEC(DO)                     */
/*                      GOTO CMDLBL(ENDPGM)                         */
/*             ENDDO                                                */
/*                                                                  */
/*           IF         COND(&MLNAME *NE &MLFILE) THEN(DO)          */
/*             RMVM     FILE(&MLLIB/&MLFILE) MBR(&MLNAME)           */
/*             GOTO     CMDLBL(RCVF)                                */
/*           ENDDO                                                  */
/*                                                                  */
 ENDPGM:     ENDPGM
/*                                                                   */
