/*********************************************************************/
/*                                                                  */
/*_______________________________________________________________   */
/* ENDRINGER :                                                      */
/* DATO      INZ  UTFØRT                                            */
/* ---------------------------------------------------------------  */
/* 11.12.01  MHA  NYTT PROG                                         */
/*                                                                  */
/*****************************************************************  */

             PGM
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(50)

             CHKOBJ     OBJ(*CURLIB/AFTPPF) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             CHGVAR     VAR(&MLD1) VALUE('AFTPPF er ikke generert i *CURLIB')
             CALL       PGM(AA005R) PARM(&MLD1)
             GOTO       CMDLBL(END)
             ENDDO
             CHKOBJ     OBJ(*CURLIB/AFTPL1) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             CHGVAR     VAR(&MLD1) VALUE('AFTPL1 er ikke generert i *CURLIB')
             CALL       PGM(AA005R) PARM(&MLD1)
             GOTO       CMDLBL(END)
             ENDDO
             CHKOBJ     OBJ(*CURLIB/AFTPL2) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             CHGVAR     VAR(&MLD1) VALUE('AFTPL2 er ikke generert i *CURLIB')
             CALL       PGM(AA005R) PARM(&MLD1)
             GOTO       CMDLBL(END)
             ENDDO
             CHKOBJ     OBJ(*CURLIB/AFTPLR) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             CHGVAR     VAR(&MLD1) VALUE('AFTPLR er ikke generert i *CURLIB')
             CALL       PGM(AA005R) PARM(&MLD1)
             GOTO       CMDLBL(END)
             ENDDO
             CHKOBJ     OBJ(*CURLIB/AFTPLU) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             CHGVAR     VAR(&MLD1) VALUE('AFTPLU er ikke generert i *CURLIB')
             CALL       PGM(AA005R) PARM(&MLD1)
             GOTO       CMDLBL(END)
             ENDDO

             CALL       PGM(AF100R)

END:
             ENDPGM
