/*********************************************************************/
/*                                                                  */
/*_______________________________________________________________   */
/* ENDRINGER :                                                      */
/* DATO      INZ  UTFØRT                                            */
/* ---------------------------------------------------------------  */
/* 20.11.01  MHA  NYTT PROG                                         */
/*                                                                  */
/*****************************************************************  */

             PGM        PARM(&NAVN &STATUS &HYPPIG &FASTDAT +
                            &FASTDAG &FASTTID +
                            &LAGRENOYES)

             DCL        VAR(&NAVN)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&STATUS)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&HYPPIG)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&FASTDAT)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FASTDAG)  TYPE(*CHAR) LEN(5)
             DCL        VAR(&FASTTID)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&LAGRENOYES) TYPE(*CHAR) LEN(4)


             ADDJOBSCDE JOB(&NAVN) CMD(CALL PGM(AF700C) PARM(&NAVN +
                          &STATUS '                    ' '0')) +
                          FRQ(&HYPPIG) SCDDATE(&FASTDAT) +
                          SCDDAY(&FASTDAG) SCDTIME(&FASTTID) +
                          SAVE(&LAGRENOYES)
END:
             ENDPGM
