/*                                                                   */
/*-------------------------------------------------------------------*/
/* 261101 MHA:                                                       */
/*                                                                   */
             PGM       PARM(&SERV &TIL &FRA &FIL +
                         &TYPE &RENAME &SUBJ &TEXT &CONV)


             DCL       VAR(&SERV)     TYPE(*CHAR) LEN(35)
             DCL       VAR(&TIL)       TYPE(*CHAR) LEN(45)
             DCL       VAR(&FRA)    TYPE(*CHAR) LEN(45)
             DCL       VAR(&FIL)       TYPE(*CHAR) LEN(100)
             DCL       VAR(&TYPE)    TYPE(*CHAR) LEN(10)
             DCL       VAR(&RENAME)    TYPE(*CHAR) LEN(10)
             DCL       VAR(&SUBJ)     TYPE(*CHAR) LEN(250)
             DCL       VAR(&TEXT)    TYPE(*CHAR) LEN(250)
             DCL       VAR(&CONV)    TYPE(*CHAR) LEN(10)

             DCL       VAR(&SERV2)     TYPE(*CHAR) LEN(40)
             DCL       VAR(&TIL2)       TYPE(*CHAR) LEN(50)
             DCL       VAR(&FRA2)    TYPE(*CHAR) LEN(50)
             DCL       VAR(&FIL2)       TYPE(*CHAR) LEN(105)
             DCL       VAR(&TYPE2)    TYPE(*CHAR) LEN(15)
             DCL       VAR(&RENAME2)    TYPE(*CHAR) LEN(15)
             DCL       VAR(&SUBJ2)     TYPE(*CHAR) LEN(256)
             DCL       VAR(&TEXT2)    TYPE(*CHAR) LEN(256)
             DCL       VAR(&CONV2)    TYPE(*CHAR) LEN(15)


             CHGVAR     VAR(&SERV2) VALUE('-SVR' *CAT &SERV)
             CHGVAR     VAR(&TIL2) VALUE('-TO' *CAT &TIL)
             CHGVAR     VAR(&FRA2) VALUE('-FROM' *CAT &FRA)
             CHGVAR     VAR(&FIL2) VALUE('-FILE' *CAT &FIL)
             CHGVAR     VAR(&TYPE2) VALUE('-ATT' *CAT &TYPE)
             CHGVAR     VAR(&RENAME2) VALUE('-REN' *CAT &RENAME)
             CHGVAR     VAR(&SUBJ2) VALUE('-SUB' *CAT &SUBJ)
             CHGVAR     VAR(&TEXT2) VALUE('-TXT' *CAT &TEXT)
             CHGVAR     VAR(&CONV2) VALUE('-CON' *CAT &CONV)

             SBMJOB     CMD(JAVA CLASS(aspmail.MailSender) +
                          PARM(&SERV2 &TIL2 &FRA2 &FIL2 &TYPE2 +
                          &RENAME2 &SUBJ2 &TEXT2 &CONV2) +
                          CLASSPATH('/java')) JOB(EMAIL) LOGCLPGM(*NO)

 ENDPGM:     ENDPGM
