             PGM        parm(&lib &til &fra &subj  &inif)

/*   070819 BKV  Byttet til nytt mail program eg-mail (java)              */

             dcl        var(&lib)  type(*char) len(6)
             dcl        var(&til)  type(*char) len(50)
             dcl        var(&fra)  type(*char) len(50)
             dcl        var(&subj) type(*char) len(100)
             dcl        var(&inif) type(*char) len(250)

             DCL        VAR(&JAVA)   TYPE(*CHAR) LEN(1000)

             CHGVAR     VAR(&JAVA) VALUE('java -jar eg-mail.jar "-subject' +
                          *CAT &subj *CAT '" "-msg' *CAT &inif *CAT '"')

             CD         DIR('/java/asp/eg-mail')

             QSH        CMD(&JAVA)


/*              dcl        var(&lib3)  type(*char) len(3)                     */
/*              chgvar     var(&lib3)  value(%SST(&lib 4 3))                  */
/*                                                                            */
/*              CHGCURLIB  CURLIB(&lib)                                       */
/*                                                                            */
/*              CALL       PGM(AF732R) PARM(&lib3 &til &fra &subj &inif)      */

             ENDPGM

