
/*           Generere   Fylkes-register                              */
/*           -------------------------------                         */
/*           Nb! Selv om det her er definert file-gruppe,            */
/*           blir denne satt til blank da databiblioteket            */
/*           for disse filer er ADB.  Dette er gjort for             */
/*           å kunne benytte et felles oppkallsprogram.              */
/*           (Enten AG101C eller AG102C avhengig av                  */
/*           antall filer som benyttes).                             */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3) VALUE('   ')
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASPGPL')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('AFYLBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('AFYLPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('AFYLLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('AFYLL1')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG101C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLU &RGL1)

 ENDPGM:     ENDPGM
