
/*           Generere   Nettbutikk                                   */
/*           ---------------------------------------                 */
/*           Nb! Selv om det her er definert file-gruppe,            */
/*           blir denne satt til blank da databiblioteket            */
/*           for disse filer er ADB.  Dette er gjort for             */
/*           å kunne benytte et felles oppkallsprogram.              */
/*           (Enten AG101C eller AG102C avhengig av                  */
/*           antall filer som benyttes).                             */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3) VALUE('   ')
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASPGPL')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('ANBLBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('ANBLPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('ANBLLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('ANBLL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('ANBLL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('ANBLL3')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('ANBLLR')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG104C) PARM(&FGRP &NULL &DBIB &SBIB +
                             &RGBF &RGPF &RGLU &RGL1 &RGL2 &RGL3 +
                             &RGLR)

 ENDPGM:     ENDPGM
