
/*           Generere   Sikkerhets-gruppe-register                   */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3) VALUE('   ')
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASPGPL')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('ASGRBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('ASGRPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('ASGRLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('ASGRLR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('ASGRL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('ASGRL2')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG103C) PARM(&FGRP &NULL &DBIB &SBIB +
                          &RGBF &RGPF &RGLU &RGLR &RGL1 &RGL2)

 ENDPGM:     ENDPGM
