
/*           Generere   Jobblogging status                           */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3) VALUE('   ')
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASPGPL')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('AJLSBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('AJLSPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('AJLSLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('AJLSL1')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG101C) PARM(&FGRP &NULL &DBIB &SBIB +
                          &RGBF &RGPF &RGLU &RGL1)

 ENDPGM:     ENDPGM
