
/*           Generere   Rutinereg PDF parametere                     */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASPGPL')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('AFOPBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('AFOPPF')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('AFOPLR')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('AFOPLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('AFOPL1')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG102C) PARM(&FGRP &NULL &DBIB +
                             &SBIB &RGBF &RGPF &RGLR &RGLU +
                             &RGL1)

 ENDPGM:     ENDPGM
