/*                                                                   */
/*                                                                   */

             PGM        PARM(&FILE)

             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
             dclf       file(agdbrpf)

/* Finner ut hvilke bibliotek filen skal ligge                       */

             dspdbr     file(&file) output(*outfile) +
                          outfile(*curlib/agdbrpf)
             monmsg     msgid(cpf3012) exec(goto (end))

/* Setter databibliotek til current library                          */

rcvf:        rcvf
             monmsg     msgid(CPF0864) exec(do)
                        goto cmdlbl(end)
              enddo

             dltf       file(&whrefi)
             monmsg     msgid(cpf0000)

             goto       cmdlbl(rcvf)

 end:
             ENDPGM
