/*           Bare AG918C skal benyttes for *ST filer                       */

             PGM        PARM(&FILE &FGRP &GRP &NULL)

             DCL        VAR(&FILE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&GRP)  TYPE(*CHAR) LEN(7)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)

             call       pgm(AG918C)  Parm(&file &fgrp &grp &null)

             ENDPGM
