/*                                                                   */
 STRPGM:     PGM        PARM(&file &FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&file) TYPE(*CHAR) LEN(6)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&grpf) TYPE(*CHAR) LEN(10)
             DCL        VAR(&usr)  TYPE(*CHAR) LEN(10) value('ASP_')
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')

/*           Setter bibliotek til current                            */
             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGVAR     VAR(%SST(&usr  5 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Finner gruppeprofil for sikkerhet                       */
             rtvusrprf  usrprf(&usr) grpprf(&grpf)

/*           Kalle opp fellesprogram   PF                            */
             if         cond(%sst(&file 5 2) *EQ 'PF') then(do)
               call     PGM(AG916C) PARM(&File &fgrp &grpf &null)
             enddo
/*           Kalle opp fellesprogram   ST                            */
             if         cond(%sst(&file 5 2) *EQ 'ST') then(do)
               call     PGM(AG918C) PARM(&File &fgrp &grpf &null)
             enddo
 END:        ENDPGM
