/*                                                                   */
 STRPGM:     PGM        PARM(&file &ver)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&file) TYPE(*CHAR) LEN(6)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1) value(' ')
             DCL        VAR(&grpf) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ver)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&srv)  TYPE(*CHAR) LEN(85)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(10) VALUE('ADB400')
             DCL        VAR(&ofg)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&odl)  TYPE(*CHAR) LEN(10)
             DCLF       FILE(ADB/AFGRST)

             rtvneta    sysname(&srv)
             rtvdtaara  dtaara(*lda (931 3)) rtnvar(&ofg)
             rtvdtaara  dtaara(*lda (934 3)) rtnvar(&odl)

rcvf:        rcvf
             monmsg     msgid(cpf0864)  exec(goto cmdlbl(end))

             if         cond(&afgsrv *ne &srv  *or  +
                             &afgver *ne &ver) then(do)
               goto     cmdlbl(rcvf)
             enddo

             chgdtaara  dtaara(*lda (931 03)) value(&afgfgr)
             chgdtaara  dtaara(*lda (937 03)) value(&afgfgr)
             chgvar     var(&file)  value(%upper(&file))

             call       pgm(ag920c)  parm(&file &afgfgr &null)

             goto       cmdlbl(rcvf)

 END:
             chgdtaara  dtaara(*lda (931 03)) value(&ofg)
             chgdtaara  dtaara(*lda (934 10)) value(&odl)
             chgcurlib  curlib(&odl)
             ENDPGM
