/*                                                                   */
             PGM

             dcl        var(&lib)    type(*char) len(10)
             dclf       file(dspobjdf)

             call       pgm(sqldef)   /*  Oppd. gr.lag for triggere  */

             rtvjoba    curlib(&lib)

             dspobjd    obj(&lib/*all) objtype(*file) +
                          output(*outfile) outfile(&lib/dspbojdf)

             call       pgm(ag941c)   parm(&lib)
/* ______________________________________________________________________*/
 ENDPGM:     ENDPGM
