
/*           Generere   Jobblogging - status     r                   */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASPGPL')
             DCL        VAR(&CBIB) TYPE(*CHAR) LEN(10) VALUE('      ')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('ASBSBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('ASBSPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('ASBSLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('ASBSLR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('ASBSL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('ASBSL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('ASBSL3')

/*           Setter bibliotek til current                            */

             RTVJOBA    CURLIB(&CBIB)
             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE('   ')
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG104C) PARM(&FGRP &NULL &DBIB &SBIB +
                          &RGBF &RGPF &RGLU &RGLR &RGL1 &RGL2 &RGL3)
             CHGCURLIB  CURLIB(&CBIB)

 ENDPGM:     ENDPGM
