/*-------------------------------------------------------------------*/
/* ADBxxx                                                            */
/*            Dette programmet generer tabeller/indexer              */
/*  som ikke finnes i gitt bibliotek                                 */
/*                                                                   */
/* Programmet setter riktig grupperettigheter på tabell/index        */
/* Programmet starter journalføring av nye tabeller                  */
/*                                                                   */
/*-------------------------------------------------------------------*/

 STRPGM:     PGM        PARM(&FGRP &GRP &NULL)

             DCL        VAR(&FGRP)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&GRP)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&NULL)  TYPE(*CHAR) LEN(1)

             DCL        VAR(&LIB)   TYPE(*CHAR) LEN(50) VALUE('ADB')

             MONMSG     MSGID(CPF7030) /*  already being journaled  */

 /*          CHGVAR     VAR(%SST(&LIB 4 3)) VALUE(&FGRP)                  */


 /*ASYOST - Adminstrasjon oppsett                                         */
             CALL PGM(AG908C) PARM('ASYOST' &FGRP '*NONE' ' ')


 ENDPGM:     ENDPGM
