             PGM
             DCL        VAR(&WALI)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MELD)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&M1MLD1)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&M1MLD2)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&M1SVAR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPIN12)   TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             DCLF       FILE(AM70)
             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
/*           MONMSG     MSGID(CPF0000) EXEC(GOTO START)              */
/*           MONMSG     MSGID(CPF9999) EXEC(GOTO START)              */

 START:      CHGVAR     VAR(&VALG)     VALUE(0)
             RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(AN010C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(AN030C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(AN070R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4                                                            */
             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(AN060R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5                                                            */
             IF         COND(&VALG *EQ 5) THEN(DO)
             WRKJOBQ    JOBQ(ASPGPL/ASPBATCH)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6                                                            */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CLRJOBQ    JOBQ(ASPGPL/ASPBATCH)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7                                                            */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CHGVAR     VAR(&M1MLD1) VALUE('Det er bedt om manuell +
                                     backup av data.')
             CHGVAR     VAR(&M1MLD2) VALUE('Bekreft dersom dette +
                                     skal utføres...')
             CHGVAR     VAR(&M1SVAR) VALUE('J')
             CHGVAR     VAR(&WPIN12) VALUE('0')
             CALL       PGM(AA007R)  PARM(&M1MLD1 &M1MLD2 &M1SVAR +
                                          &WPIN12)
             IF         COND(&WPIN12 *EQ 1)   THEN(GOTO CMDLBL(START))
             IF         COND(&M1SVAR *EQ 'N') THEN(GOTO CMDLBL(START))
             CALL       PGM(ASPGPLK/ANBACK)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8                                                            */
             IF         COND(&VALG *EQ 8) THEN(DO)
             WRKJOBSCDE
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9                                                            */
             IF         COND(&VALG *EQ 9) THEN(DO)
                        STRSBS ASPSBS
             MONMSG     MSGID(CPF1010) EXEC(GOTO START)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
