             PGM        PARM(&VALG)

             DCL        VAR(&VALG)     TYPE(*CHAR) LEN(128)
             DCL        VAR(&SPES)     TYPE(*CHAR) LEN(10) +
                          VALUE('ANTAPE')
             DCL        VAR(&APTEXT)   TYPE(*CHAR) LEN(30) +
                                VALUE('Natt-rutine, Kontroll av tape')

/* Sjekk om program finnes fra før                                   */

             CHKOBJ     OBJ(ASPGPLK/QCLLESRC) OBJTYPE(*FILE) +
                          MBR(&SPES) AUT(*ALL)
             MONMSG     MSGID(CPF9815) EXEC(GOTO CMDLBL(START))
             RMVM       FILE(ASPGPLK/QCLLESRC) MBR(&SPES)

/* Bygge opp Cl-member                                               */

 START:      ADDPFM     FILE(ASPGPLK/QCLLESRC) MBR(&SPES) +
                          TEXT(&APTEXT) SRCTYPE(CLLE)
             OVRDBF     FILE(QCLLESRC) TOFILE(ASPGPLK/QCLLESRC) +
                          MBR(&SPES)

/* Call til RPG-program                                              */

             CALL       PGM(AN022R) PARM(&VALG)
             DLTOVR     FILE(QCLLESRC)

/* Create program                                                    */

             CRTBNDCL   PGM(ASPGPLK/&SPES) SRCFILE(ASPGPLK/QCLLESRC) +
                          TEXT(&APTEXT) OPTION(*NOXREF *NOSECLVL)

 END:        ENDPGM
