             PGM        PARM(&VALG)

             DCL        VAR(&VALG)     TYPE(*CHAR) LEN(128)
             DCL        VAR(&UDAG)     TYPE(*CHAR) LEN(04)
             DCL        VAR(&TIME)     TYPE(*CHAR) LEN(06) +
                                       VALUE('000000')
             DCL        VAR(&WIPL)     TYPE(*CHAR) LEN(10) +
                                       VALUE('ASPIPL')

/* Bygge opp variabler                                               */

             CHGVAR     VAR(&TIME)     VALUE(%SST(&VALG 01 6))
             CHGVAR     VAR(&UDAG)     VALUE(%SST(&VALG 07 4))

             RMVJOBSCDE JOB(&WIPL)     ENTRYNBR(*ONLY)
             MONMSG     MSGID(CPF1628)

             ADDJOBSCDE JOB(&WIPL)     CMD(CALL *LIBL/ASPIPL) +
                        FRQ(*WEEKLY)   SCDDATE(*NONE) +
                        SCDDAY(&UDAG)  SCDTIME(&TIME) +
                        JOBQ(ASPGPL/ASPBATCH) +
                        JOBD(*LIBL/ASNATT) +
                        USER(ASPNATT)

 END:        ENDPGM
