/*                                                                   */
/*-------------------------------------------------------------------*/
/* 310303 MHA: Setter miljø for nettbutikk RMI server                */
/*                                                                   */

             PGM

             DCL        VAR(&JAVA) TYPE(*CHAR) LEN(500)
             DCL        VAR(&MBR) TYPE(*CHAR) LEN(10) +
                          VALUE('NBSRMISRV')
             DCL        VAR(&HOST) TYPE(*CHAR) LEN(50) +
                          VALUE('146.192.177.114')
             DCL        VAR(&INIF) TYPE(*CHAR) LEN(100) +
                          VALUE('/java/no/logiq/setup.ini')


             CHGVAR     VAR(&JAVA) VALUE('java -classpath +
                          /java:/qibm/proddata/http/public/jt400/lib/+
                          jt400.jar -Djava.rmi.server.hostname=' +
                          *TCAT &HOST *BCAT +
                          'no.logiq.imarket.asp.rmi.server.StartRMISe+
                          rver' *BCAT &INIF)

             CHKOBJ     OBJ(ADB/ALOGPF) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             CRTPF      FILE(ADB/ALOGPF) RCDLEN(300) MBR(*NONE) +
                          TEXT('Loggfil') MAXMBRS(*NOMAX) SIZE(*NOMAX)
             ENDDO
             CLRPFM     FILE(ADB/ALOGPF) MBR(&MBR)
             MONMSG     MSGID(CPF0000) EXEC(DO)
             ADDPFM     FILE(ADB/ALOGPF) MBR(&MBR) TEXT('Logg +
                          for RMI server')
             ENDDO

             OVRDBF     FILE(STDOUT) TOFILE(ADB/ALOGPF) MBR(&MBR)
             QSH        CMD(&JAVA)
             DLTOVR     FILE(STDOUT)

/*                                                                   */
 ENDPGM:     ENDPGM
