             PGM
             DCL        VAR(&KODE)   TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&BIBL)   TYPE(*CHAR) LEN(10)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERR))
                                                               /* Ny */
/* Lage savefile for mapper i ADB.SAVF                            Ny */
                                                               /* Ny */
             CRTSAVF    FILE(ADB.SAVF/SAV_DLO)                 /* Ny */
             MONMSG     MSGID(CPF5813 CPF7302)                 /* Ny */
             CLRSAVF    FILE(ADB.SAVF/SAV_DLO)                 /* Ny */

/* Backup av alle mapper                                             */

             CHGVAR     VAR(&KODE)   VALUE(16)
             CALL       PGM(AN050R)  PARM(&KODE &BIBL)
/* Endr */   SAVDLO     DLO(*ALL) FLR(*ANY) DEV(*SAVF) +
/* Endr */              SAVF(ADB.SAVF/SAV_DLO)

             GOTO       CMDLBL(END)
 ERR:        CHGVAR     VAR(&KODE)   VALUE(17)
             CALL       PGM(AN050R)  PARM(&KODE &BIBL)

 END:        ENDPGM
