             PGM
             DCL       VAR(&KODE)   TYPE(*DEC)  LEN(2 0)
             DCL       VAR(&BIBL)   TYPE(*CHAR) LEN(10)

/* Det er lagt opp til at man skal kunne definere en sluttjobb som   */
/* kan tilpasses den enkelte kunde.  Det kan for eks. være behov     */
/* for å starte opp igjen egne subsystemer etter at backup er kjørt. */
/* Da kan dette programmet legges i ASPGPLK og kalles ANSLUT         */

/* Når man så i oppsett av nattrutiner sier at egen jobb skal        */
/* kjøres, kalles programmet ANSLUT fra ASPGPLK                      */
/* Dette program aktiveres helt til slutt i rutinen, det er bare     */
/* display av tapen som kommer etter dette program.                  */

/*  Oppdatere historikk med at egen rutine starter                   */

             CHGVAR    VAR(&KODE)     VALUE(23)
             CALL      PGM(AN050R)    PARM(&KODE &BIBL)

             ENDPGM
