             PGM
             DCL       VAR(&KODE)   TYPE(*DEC)  LEN(2 0)
             DCL       VAR(&BIBL)   TYPE(*CHAR) LEN(10)

/* Det er lagt opp til at man skal kunne definere en egen jobb som   */
/* kan tilpasses den enkelte kunde.  Det kan for eks. være behov     */
/* for å stoppe andre subsystemer enn QINTER og QBATCH.              */
/* Da kan dette programmet legges i ASPGPLK og kalles ANSTRT         */

/* Når man så i oppsett av nattrutiner sier at egen jobb skal        */
/* kjøres, kalles programmet ANSTRT fra ASPGPLK                      */
/* Dette program aktiveres etter at de øvrige subsystemer tas ned,   */
/* men før backupen settes igang.                                    */

/*  Oppdatere historikk med at egen rutine starter                   */

             CHGVAR    VAR(&KODE)     VALUE(22)
             CALL      PGM(AN050R)    PARM(&KODE &BIBL)

             ENDPGM
