             PGM        PARM(&file &stat)

             DCL        VAR(&file)      TYPE(*CHAR) LEN(256)
             DCL        VAR(&stat)      TYPE(*CHAR) LEN(1)
             DCL        VAR(&ifs)       TYPE(*CHAR) LEN(256)

             chgvar     var(&ifs) value(%trim(&FILE))
/*           WRKLNK OBJ(&ifs)                                  */
             monmsg msgid(CPFA0A9) exec(goto cmdlbl(end))

             chgvar     var(&stat) value('1')
             CHGATR     OBJ(&ifs) ATR(*CCSID) VALUE(819)

END:         ENDPGM
