             PGM        PARM(&field)

/*                                                                   */
/*           DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3) VALUE('0')   */
/*           DCL        VAR(&ORDRE) TYPE(*CHAR) LEN(6)             */
/*           DCL        VAR(&SUFFIX) TYPE(*CHAR) LEN(2)            */
/* SFTP  */
             DCL        VAR(&DTAQ) TYPE(*CHAR) LEN(10) VALUE(GEMDREQ)
             DCL        VAR(&DTAQLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FLDLEN) TYPE(*DEC) LEN(4 0) VALUE(1000)
             DCL        VAR(&FIELD) TYPE(*CHAR) LEN(1000)

             RTVJOBA    CURLIB(&DTAQLIB)

/*           CHGVAR     VAR(&FIELD) VALUE(&FIRM *TCAT ';' *TCAT +    */
/*                      &ORDRE *TCAT ';' *TCAT &SUFFIX *TCAT ';' +   */
/*                      *TCAT '550.40' *TCAT ';' *TCAT '54365347526')*/

             CALL       PGM(QSNDDTAQ) PARM(&DTAQ &DTAQLIB &FLDLEN +
                          &FIELD)

 ENDPGM:     ENDPGM
