
             PGM        PARM(&iotq &uotq)

/* Definering av variable                                            */

             DCL        VAR(&iotq)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&uotq)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&lusr)     TYPE(*CHAR) LEN(10)

/* Henter informasjon fra brukerprofil på lda bruker                 */

             RTVDTAARA  DTAARA(*LDA (911 10)) RTNVAR(&lusr)
             DSPUSRPRF  USRPRF(&LUSR) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/USRPRF)
             MONMSG     MSGID(CPF2204) EXEC(GOTO CMDLBL(ENDPGM))

/* Kaller program som henter utkø fra lda bruker - ikke systembruker */

             CALL       PGM(AP616C) PARM(&iotq &uotq)

 ENDPGM:     ENDPGM
