
             PGM        PARM(&LINK)

/* Definering av variable                                            */

             DCL        VAR(&LINK)    TYPE(*CHAR) LEN(256)

             MONMSG     MSGID(CPF0000)
             MONMSG     MSGID(IWS4010)
             STRPCO     PCTA(*NO)
/*           MONMSG     MSGID(IWS4010)                              */

/* Kaller program for selve visningen                                */

             CALL AP628R PARM(&LINK)

 ENDPGM:     ENDPGM
