
             PGM        PARM(&filg &xmlf)

/* Definering av variable                                            */

             DCL        VAR(&xmlf)     TYPE(*CHAR) LEN(256)
             DCL        VAR(&filg)     TYPE(*CHAR) LEN(10)

/* Legger inn en liten delay for spoolfiles                           */
             dlyjob     dly(2)

/* Sjekk om datakø finnes                                             */

             chkobj     obj(&filg/proadtaq) objtype(*dtaq)
             monmsg     msgid(cpf9801) exec(do)
             goto       cmdlbl(endpgm)
             enddo

             call       pgm(ap629r) parm(&filg &xmlf)


 ENDPGM:     ENDPGM
