             PGM

/* Definering av variable                                            */
             DCL        VAR(&clib) TYPE(*CHAR) LEN(10)

/* Henter current library                                            */
             RTVJOBA    CURLIB(&clib)

/* Starter trigging av innhenting av printerinfo                     */

             CALL       PGM(AP625R) PARM(&clib)

             ENDPGM
