
/* Sjekker om jobben kjører i batch                                  */
/* Dersom &SATS = 0  ( batch-jobb )                                  */
/* Dersom &SATS = 1  ( interaktiv jobb )                             */

             PGM        PARM(&SATS)

             DCL        VAR(&SATS)     TYPE(*CHAR) LEN(1)
             RTVJOBA    TYPE(&SATS)

 END:        ENDPGM
