             PGM
             DCL        VAR(&SAVF)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&MLD1)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&MLD2)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&SVAR)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN12)     TYPE(*DEC)  LEN(1 0)

/* Varsle at backup av programbibliotek settes igang                 */

             CHGVAR     VAR(&MLD1)     VALUE('Det er bedt om backup +
                                       av program-bibliotek, kode B ')
             CHGVAR     VAR(&MLD2)     VALUE('Bekreft dersom dette +
                                       skal utføres...')
             CHGVAR     VAR(&SVAR)     VALUE('N')
             CALL       PGM(AA007R)    PARM(&MLD1 &MLD2 &SVAR &IN12)

             IF         COND(&IN12 *EQ 1)   THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&SVAR *EQ 'N') THEN(GOTO CMDLBL(ENDPGM))

 /* Kopi av programbibliotek                                         */

             CHGVAR    VAR(&SAVF) VALUE(' ')
             CALL      PGM(AN026R)     PARM(&SAVF)

ENDPGM:      ENDPGM
