/*--------------------------------------------------------------------------*/
/*       130516 bkv  Koblet til kommandoen ASPCALL                          */
/*                   Gir mulighet til å kjøre CALL med begrenset bruker     */
/*                                                                          */
/*       CRTCMD CMD(ASKORR700/ASPCALL) PGM(*LIBL/ASPCALL)                   */
/*       SRCFILE(ASKORR700/QCMDSRC) ALWLMTUSR(*YES)                         */
/*                                                                          */
/*--------------------------------------------------------------------------*/

             PGM        parm(&PGMP)
             DCL        VAR(&PGMP)     TYPE(*CHAR) LEN(10)

/*           IF         COND(&PGMP *EQ 'WRKSPLF') THEN(DO)                  */
/*              WRKSPLF                                                     */
/*              GOTO       CMDLBL(ENDPGM)                                   */
/*           ENDDO                                                          */

             CALL       PGM(&PGMP)


 ENDPGM:     ENDPGM
