             PGM        parm(&P_DLTID &P_DLTVI &P_DLTTR &P_CRTID &P_CRTVI +
                          &P_CRTTR &FGRP_P &LVRB_P &ENVB_P &TBLE_P &VER_P)



 /* Parametre                                                         */
             DCL        VAR(&FGRP_P) TYPE(*CHAR) LEN(3)
             DCL        VAR(&LVRB_P) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ENVB_P) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TBLE_P) TYPE(*CHAR) LEN(10)
             DCL        VAR(&VER_P)  TYPE(*CHAR)  LEN(3)

             DCL        VAR(&P_DLTID)   TYPE(*DEC)   LEN(1 0)
             DCL        VAR(&P_DLTVI)   TYPE(*DEC)   LEN(1 0)
             DCL        VAR(&P_DLTTR)   TYPE(*DEC)   LEN(1 0)
             DCL        VAR(&P_CRTID)   TYPE(*DEC)   LEN(1 0)
             DCL        VAR(&P_CRTVI)   TYPE(*DEC)   LEN(1 0)
             DCL        VAR(&P_CRTTR)   TYPE(*DEC)   LEN(1 0)

             DCL        VAR(&PRIO)     TYPE(*CHAR) LEN(1) VALUE('9')

/*              DCL        VAR(&POSTFGRP) TYPE(*CHAR) LEN(3) VALUE('ADB')     */
/*              DCL        VAR(&PRETABL) TYPE(*CHAR) LEN(3) VALUE('%PF')      */
/*              DCL        VAR(&PRETABL2) TYPE(*CHAR) LEN(3) VALUE('%ST')     */
/*              DCL        &SQLSTMT TYPE(*CHAR) LEN(500)                      */

             IF         COND(&P_DLTTR *EQ 1) THEN(DO)
                SBMJOB     CMD(CALL PGM(TRGDLT) PARM(&FGRP_P &TBLE_P +
                             &VER_P)) JOBPTY(&PRIO) JOBQ(QGPL/EG_SQL) +
                             JOB(SQLDLTGDLT) CCSID(277)
             ENDDO

              IF         COND(&P_DLTID *EQ 1) THEN(DO)
                 SBMJOB     CMD(CALL PGM(IDXDLT) PARM(&FGRP_P &LVRB_P +
                              &ENVB_P &TBLE_P &VER_P)) JOBPTY(&PRIO) +
                              JOBQ(QGPL/EG_SQL) JOB(SQLDLIXDLT) CCSID(277)
              ENDDO

              IF         COND(&P_DLTVI *EQ 1) THEN(DO)
                 SBMJOB     CMD(CALL PGM(VIEWDLT) PARM(&FGRP_P &TBLE_P +
                              &VER_P)) JOBPTY(&PRIO) JOBQ(QGPL/EG_SQL) +
                              JOB(SQLDLVWDLT) CCSID(277)
              ENDDO

              IF         COND(&P_CRTTR *EQ 1) THEN(DO)
                 SBMJOB     CMD(CALL PGM(TRGCRT) PARM(&FGRP_P &TBLE_P +
                              &VER_P)) JOBPTY(&PRIO) JOBQ(QGPL/EG_SQL) +
                              JOB(SQLCRTGCRT) CCSID(277)

              ENDDO

              IF         COND(&P_CRTID *EQ 1) THEN(DO)
                 SBMJOB     CMD(CALL PGM(IDXCRT) PARM(&FGRP_P &LVRB_P +
                              &ENVB_P &TBLE_P  &VER_P)) JOBPTY(&PRIO) +
                              JOBQ(QGPL/EG_SQL) JOB(SQLCRIXCRT) CCSID(277)


/*                  CHGVAR     VAR(&SQLSTMT) VALUE('CALL +                    */
/*                              QSYS2.RESET_TABLE_INDEX_STATISTICS (''' *CAT +*/
/*                               &POSTFGRP  *CAT &FGRP_P *CAT ''',''' *CAT +  */
/*                               &PRETABL *CAT ''')')                         */
/*                  RUNSQL     SQL(&SQLSTMT) COMMIT(*NONE) NAMING(*SQL)       */
/*                                                                            */
/*                  CHGVAR     VAR(&SQLSTMT) VALUE('CALL +                    */
/*                              QSYS2.RESET_TABLE_INDEX_STATISTICS (''' *CAT +*/
/*                               &POSTFGRP  *CAT &FGRP_P *CAT ''',''' *CAT +  */
/*                               &PRETABL2 *CAT ''')')                        */
/*                  RUNSQL     SQL(&SQLSTMT) COMMIT(*NONE) NAMING(*SQL)       */


              ENDDO

              IF         COND(&P_CRTVI *EQ 1) THEN(DO)
                 SBMJOB     CMD(CALL PGM(VIEWCRT) PARM(&FGRP_P &LVRB_P +
                              &ENVB_P &TBLE_P &VER_P)) JOBPTY(&PRIO) +
                              JOBQ(QGPL/EG_SQL) JOB(SQLCRVWCRT) CCSID(277)
              ENDDO

/* Slutt                                                             */

 ENDPGM:     ENDPGM
