/*                                                                   */
/*-------------------------------------------------------------------*/
             PGM        PARM(&URL &REQFILE +
                         &RESFILE &USER &PW &AUTTYPE &STATUS)
             DCL        VAR(&URL) TYPE(*CHAR) LEN(200)
             DCL        VAR(&REQFILE) TYPE(*CHAR) LEN(100)
             DCL        VAR(&RESFILE) TYPE(*CHAR) LEN(100)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(20)
             DCL        VAR(&PW) TYPE(*CHAR) LEN(50)
             DCL        VAR(&AUTTYPE) TYPE(*CHAR) LEN(5)
             DCL        VAR(&STATUS) TYPE(*DEC) LEN(1 0) VALUE(0)

             CHDIR      DIR('/java/asp/nx-ws-client')
             JAVA       CLASS('appstarter-1.0.jar') PARM('-url' &URL +
                          'no.asp.as.setupFile=appstarter-soap.setup' +
                          '-request' &REQFILE '-response' &RESFILE +
                          '-authtype' &AUTTYPE '-username' &USER +
                          '-password' &PW) OPTIMIZE(30) +
                          PROP(('-Duser.dir' +
                          '/java/asp/nx-ws-client')) OUTPUT(*PRINT)
             MONMSG     MSGID(CPF0000) EXEC(CHGVAR VAR(&STATUS) +
                          VALUE(1))
             ENDPGM
