/*  Scriptet setter opp miljø for web service tjenester              */
/*  Rutinen kjæres pr. filgruppen, men mye er felles pr. server      */
/*  Det sjekkes om subsyst. mm er i gang før det genereres           */

             PGM

             DCL        VAR(&FGRP)     TYPE(*CHAR) LEN(3)  value(' ')

             if         cond(&fgrp *eq ' ') then(do)
               rtvdtaara  dtaara(*lda (931 3)) rtnvar(&fgrp)
             enddo

             CALL       PGM(AW710C)    PARM(&fgrp)

 ENDPGM:     ENDPGM
