             PGM
             DCLF       FILE(AZ050D)

/*  Legger ut skjermbilde med valg på bruker, biliotek og versjon    */


SEND:        SNDRCVF    RCDFMT(A1BLD)


/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&A1CMN *EQ 'X25') THEN(GOTO CMDLBL(X25))
             IF         COND(&A1CMN *EQ 'OPR') THEN(GOTO CMDLBL(OPR))
             CHGVAR     VAR(&A1MLD) VALUE('Velg kommunikasjonstype +
                          for generering!')
             GOTO       CMDLBL(SEND)

X25:
             CRTUSRPRF  USRPRF(ASPDIST) USRCLS(*PGMR) TEXT('Bruker +
                          for mottak av distribusjon fra ASP') +
                          SPCAUT(*ALLOBJ)
             MONMSG     MSGID(CPF2214)

             ADDDSTQ    DSTQ(ASP) RMTLOCNAME(NO608ASP) RMTNETID(*NONE)
             MONMSG     MSGID(CPD8838)
             MONMSG     MSGID(CPD8839)

             ADDDSTRTE  SYSNAME(NO608ASP) FAST(ASP) STATUS(ASP) +
                          DATAHIGH(ASP) DATALOW(ASP)
             MONMSG     MSGID(CPF8831)

             ADDDIRE    USRID(*ANY NO608ASP) USRD('Distribusjon til +
                          alle i ASP') SYSNAME(NO608ASP)
             MONMSG     MSGID(CPD8983)
             GOTO       CMDLBL(ENDPGM)


OPR:
             CRTUSRPRF  USRPRF(ASPDIST) USRCLS(*PGMR) TEXT('Bruker +
                          for mottak av distribusjon fra ASP') +
                          SPCAUT(*ALLOBJ)

             ADDDSTSYSN SYSNAME(ASPDISTR)
             MONMSG     MSGID(CPF8835)

             ADDDSTQ    DSTQ(ASP) RMTLOCNAME(ASP) RMTNETID(*NONE)
             MONMSG     MSGID(CPF9899)

             ADDDSTRTE  SYSNAME(NO608ASP) FAST(ASP) STATUS(ASP) +
                          DATAHIGH(ASP) DATALOW(ASP)
             MONMSG     MSGID(CPF8831)
             MONMSG     MSGID(CPF8802)

             ADDDIRE    USRID(*ANY NO608ASP) USRD('Distribusjon til +
                          alle i ASP') SYSNAME(NO608ASP)
             MONMSG     MSGID(CPD8983)
             MONMSG     MSGID(CPF9082)

             ADDDIRE    USRID(ASPDIST ASPDISTR) USRD('Distribusjon +
                          fra ASP') USER(ASPDIST) SYSNAME(*LCL) +
                          NETUSRID(ASPDIST)
             MONMSG     MSGID(CPD8983)
             MONMSG     MSGID(CPF9082)



 ENDPGM:     ENDPGM
