             PGM        PARM(&GLIN)
             DCL        VAR(&GLIN)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&GCTL)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&GDEV)     TYPE(*CHAR) LEN(10)

             MONMSG     MSGID(CPF2601 CPF2646 CPF2602 CPF2640 +
                          CPF2646 CPF2650 CPF2702)

             IF         COND(&GLIN *EQ 'ASPLIN    ') THEN(DO)
             CHGVAR     VAR(&GCTL)     VALUE(%SUBSTRING(&GLIN 1 3) *CAT +
                                             'CTL')
             CHGVAR     VAR(&GDEV)     VALUE(%SUBSTRING(&GLIN 1 3) *CAT +
                                             'DEV')
             ENDDO

             IF COND(%SUBSTRING(&GLIN 1 6) *EQ 'LINASP') THEN(DO)
               CHGVAR     VAR(&GCTL)  +
                          VALUE('CTL' *CAT %SUBSTRING(&GLIN 4 7))
               CHGVAR     VAR(&GDEV)  +
                          VALUE('DEV' *CAT %SUBSTRING(&GLIN 4 7))
             ENDDO

/*  Kobler fra dev,ctl og lin.                                       */

             VRYCFG     CFGOBJ(&GDEV) CFGTYPE(*DEV) STATUS(*OFF)
             VRYCFG     CFGOBJ(&GCTL) CFGTYPE(*CTL) STATUS(*OFF)
             VRYCFG     CFGOBJ(&GLIN) CFGTYPE(*LIN) STATUS(*OFF)

/*  Sletter beskrivelse av dev, ctl og lin.                          */

             DLTDEVD    DEVD(&GDEV)
             DLTCTLD    CTLD(&GCTL)
             DLTLIND    LIND(&GLIN)

ENDPGM
