             PGM        PARM(&LIN &GLIN &RES)
             DCL        VAR(&RES)      TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIN)      TYPE(*CHAR) LEN(10)
             DCL        VAR(&GLIN)     TYPE(*CHAR) LEN(10)

/*  Venter i 10 sek. for å gi tid til å avslutte                    */

             DLYJOB     DLY(000010)

/*  Slett evt. eksisterende konfigurasjon                            */

             IF         COND(&GLIN *NE '          ') THEN(DO)
             CALL       PGM(AZ112C)    PARM(&GLIN)
             ENDDO

/*  Bygger ny konfigurasjon og kobler opp                            */

                CALL       PGM(AZ114C) PARM(&LIN &RES)

 ENDPGM:     ENDPGM
