             PGM
/*                                                                   */
             DCLF       FILE(BASTDD)
/*                                                                   */
             SNDRCVF    RCDFMT(A1BLD)
/*                                                                   */
/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/*  Kaller opp program for danning av standardverdier                */
/*                                                                   */
             CALL       PGM(BASTDR) PARM(&A1VALG &A1KUND +
                          &A1VARE &A1KONT &A1SPES)
/*                                                                   */
 ENDPGM:     ENDPGM
