/*                                                                   */
/*           Generere   BONG HODE REGISTER                           */
/*                                                                   */
 STRPGM:     PGM        PARM(&FGRP &NULL)
/*                                                                   */
             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASSHOP'   )
/*                                                                   */
             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('BOHEBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('BOHEPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('BOHELU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('BOHEL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('BOHELA')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('BOHELD')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('BOHELO')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('BOHELV')
             DCL        VAR(&RGL6) TYPE(*CHAR) LEN(6) VALUE('BOHEL9')
             DCL        VAR(&RGLE) TYPE(*CHAR) LEN(6) VALUE('BOHELE')
             DCL        VAR(&RGLF) TYPE(*CHAR) LEN(6) VALUE('BOHELF')
             DCL        VAR(&RGLG) TYPE(*CHAR) LEN(6) VALUE('BOHEL2')
             DCL        VAR(&RGLH) TYPE(*CHAR) LEN(6) VALUE('BOHEL3')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG110C)  PARM(&FGRP &NULL &DBIB +
                        &SBIB &RGBF &RGPF &RGLU &RGL1 &RGL2 +
                        &RGL3 &RGL4 &RGL5 &RGL6 &RGLE &RGLF +
                        &RGLG &RGLH)

             STRJRNPF   FILE(BOHEPF) JRN(BUTIJRN) OMTJRNE(*OPNCLO)
/*                                                                   */
 ENDPGM:     ENDPGM
