/*                                                                   */
/*           Generere   BONG LINJE REGISTER                          */
/*                                                                   */
 STRPGM:     PGM        PARM(&FGRP &NULL)
/*                                                                   */
             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASSHOP'   )
/*                                                                   */
             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('BODTBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('BODTPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('BODTLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('BODTL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('BODTL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('BODTL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('BODTL4')
             DCL        VAR(&RGLQ) TYPE(*CHAR) LEN(6) VALUE('BODTLQ')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG105C)  PARM(&FGRP &NULL &DBIB +
                        &SBIB &RGBF &RGPF &RGLU &RGL1 &RGL2 +
                        &RGL3 &RGL4 &RGLQ)

             STRJRNPF   FILE(BODTPF) JRN(BUTIJRN) OMTJRNE(*OPNCLO)
/*                                                                   */
 ENDPGM:     ENDPGM
