
/*           Generere   Korttransaksjonsregister                     */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASSHOP')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('BOKKBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('BOKKPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('BOKKLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('BOKKLR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('BOKKL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('BOKKL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('BOKKL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('BOKKL4')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('BOKKL5')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG106C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLU &RGLR &RGL1 +
                          &RGL2 &RGL3 &RGL4 &RGL5)

 ENDPGM:     ENDPGM
