             PGM
             DCLF       FILE(BM99)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(FSETUP)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&LEVL)     VALUE('40')
             CHGVAR     VAR(&OKOK)     VALUE('  ')
             CALL       PGM(AA050C)    PARM(&LEVL &OKOK)
             IF         COND(&OKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01)    THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(BG001C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(BÅ900C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4                                                            */
             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(BASTDC)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
