             PGM
/*                                                                   */
/*           WPPARM=0, Sjekk i registreringsprogram                  */
/*           WPPARM=1, Sjekk i kontroll/avstemmings-liste            */
/*           WPPARM=2, Sjekk i journal-liste                         */
/*                                                                   */
             DCL        VAR(&WPPARM) TYPE(*CHAR) LEN(1) VALUE('1')
/*                                                                   */
/* Kontrollere skjerm/kasse/bruker -tilgang                          */
/*                                                                   */
             CALL       PGM(BOSJKR) PARM(&WPPARM)
/*           IF         COND(&WPPARM *EQ '9') THEN(DO)   */
/*           GOTO       CMDLBL(SLUTT)                    */
/*           ENDDO                                       */
/*                                                                   */
/* Kontrollere om filegruppe etc er lagt opp                         */
/*  Fjernet 011220  nxcloud                                          */
/*           CALL       PGM(BSJEKK) PARM(&WPPARM)                    */
/*           IF         COND(&WPPARM *EQ '9') THEN(DO)               */
/*           GOTO       CMDLBL(SLUTT)                                */
/*           ENDDO                                                   */
/*                                                                   */
/* Call til program for utskrift                                     */
/* av kontroll/avstemmingsliste                                      */
/*                                                                   */
             CALL       PGM(BO120R)
/*                                                                   */
 SLUTT:      ENDPGM
