             PGM        PARM(&MEBR &PARM)

/* Definering av parametere og variable                              */

             DCL        VAR(&MEBR)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(256)

             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)

/* Override parameterfilene/membrene                                 */

             OVRDBF     FILE(BPSOLA)   TOFILE(*FILE) MBR(&MEBR)
             OVRDBF     FILE(BPSOLB)   TOFILE(*FILE) MBR(&MEBR)

/* Kaller opp AP600R for printerstyring                              */

             CALL       PGM(AP600R)    PARM('BO125' '0' '0' &IN03 &BTCH)

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP601C)    PARM('BO125P' &BTCH)

/* Call av utskriftsprogram                                          */

             CALL       PGM(BO125R)    PARM(&PARM)

/* Override av printerfile oppheves                                  */

             CALL       PGM(AP606C)    PARM('BO125P')

/* Override av parametermembrene oppheves                            */

             DLTOVR     FILE(BPSOLA BPSOLB)

 END:        ENDPGM
