             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&FIRM) TYPE(*DEC) LEN(3 0) VALUE(200)
             DCL        VAR(&AARR) TYPE(*DEC) LEN(4) VALUE(2008)
             DCL        VAR(&KASS) TYPE(*CHAR) LEN(10) VALUE('B01')
             DCL        VAR(&BONG) TYPE(*CHAR) LEN(12) +
                          VALUE('B01-15345')
             DCL        VAR(&VERD) TYPE(*DEC) LEN(11 2) VALUE(370)
             CALL       PGM(BO710R) PARM(&FIRM &AARR &KASS &BONG +
                                         &VERD)

 END:        ENDPGM
