             PGM        PARM(&FIRM &REFN)

             DCL        VAR(&FIRM) TYPE(*DEC) LEN(3 0)
/*6.nu*/     DCL        VAR(&REFN) TYPE(*DEC) LEN(8 0)

/* Kalle program for sletting av håndterminalfil                     */

             CALL       PGM(HO400R) PARM(&FIRM &REFN)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(END))

 END:        ENDPGM
