             PGM        PARM(&FIRM &REFN &RETU)
/* Spes. utvidet med &RETU */

             DCL        VAR(&FIRM) TYPE(*DEC) LEN(3 0)
/*6.nu*/     DCL        VAR(&REFN) TYPE(*DEC) LEN(8 0)
             DCL        VAR(&RETU) TYPE(*CHAR) LEN(1)

/* Kalle program for henting av håndterminalfil                      */

/*           CALL       PGM(HO700C)                                  */
/*           MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(END))        */

/* Kalle program som henter inn BOHNHR                               */

             CALL       PGM(BO761R) PARM(&FIRM &REFN &RETU)

/* Kaller opp program for evt. overføring av ByggDok                 */
             CALL       PGM(FO788R)


 END:        ENDPGM
