 START:      PGM        PARM(&KODE &AARR &WSID &NUMM)

/* Definering av parametere for butikk bong                          */

             DCL        VAR(&KODE)     TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&AARR)     TYPE(*DEC)  LEN(4 0)
             DCL        VAR(&NUMM)     TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&WSID)     TYPE(*CHAR) LEN(10)

             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('BO930P' &BTCH)

/* Call av utskriftsprogram                                          */

             CALL       PGM(BO930R)    PARM(&AARR &WSID &NUMM +
                                            &KODE)

             CALL       PGM(AP606C)    PARM('BO930P')

 END:        ENDPGM
