             PGM        PARM(&DLIB &KASS &FIRM &DATO &TIME)

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KASS) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&DATO) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TIME) TYPE(*CHAR) LEN(8)

/* Definerer variable                                                */

             DCL        VAR(&BOFI) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOAV) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOLG) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOSE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOKU) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOKP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOKN) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOLH) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOLD) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOLT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOPK) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOVT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOVG) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOVA) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOVE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOVP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOTP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOVS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOEA) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BOMF) TYPE(*CHAR) LEN(10)

/*           MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(END))        */

/* Finner navn på kasse-spesifikke overføringsfiler                  */

             CHGVAR     VAR(&BOFI) VALUE('BOFIST' *TCAT &KASS)
             CHGVAR     VAR(&BOAV) VALUE('BOAVST' *TCAT &KASS)
             CHGVAR     VAR(&BOLG) VALUE('BOLGST' *TCAT &KASS)
             CHGVAR     VAR(&BOSE) VALUE('BOSEST' *TCAT &KASS)
             CHGVAR     VAR(&BOKU) VALUE('BOKUST' *TCAT &KASS)
             CHGVAR     VAR(&BOKP) VALUE('BOKPST' *TCAT &KASS)
             CHGVAR     VAR(&BOKN) VALUE('BOKNST' *TCAT &KASS)
             CHGVAR     VAR(&BOLH) VALUE('BOLHST' *TCAT &KASS)
             CHGVAR     VAR(&BOLD) VALUE('BOLDST' *TCAT &KASS)
             CHGVAR     VAR(&BOLT) VALUE('BOLTST' *TCAT &KASS)
             CHGVAR     VAR(&BOPK) VALUE('BOPKST' *TCAT &KASS)
             CHGVAR     VAR(&BOVT) VALUE('BOVTST' *TCAT &KASS)
             CHGVAR     VAR(&BOVG) VALUE('BOVGST' *TCAT &KASS)
             CHGVAR     VAR(&BOVA) VALUE('BOVAST' *TCAT &KASS)
             CHGVAR     VAR(&BOVE) VALUE('BOVEST' *TCAT &KASS)
             CHGVAR     VAR(&BOVP) VALUE('BOVPST' *TCAT &KASS)
             CHGVAR     VAR(&BOTP) VALUE('BOTPST' *TCAT &KASS)
             CHGVAR     VAR(&BOVS) VALUE('BOVSST' *TCAT &KASS)
             CHGVAR     VAR(&BOEA) VALUE('BOEAST' *TCAT &KASS)
             CHGVAR     VAR(&BOMF) VALUE('BOMFST' *TCAT &KASS)

/* Fjerner kasse-spesifikke overføringsfiler                         */

             DLTF       FILE(&BOFI)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOAV)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOLG)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOSE)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOKU)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOKP)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOKN)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOLH)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOLD)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOLT)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOPK)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOVT)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOVG)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOVA)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOVE)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOVP)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOTP)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOVS)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOEA)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(&BOMF)
             MONMSG     MSGID(CPF2105)

/* Oppretter kasse-spesifikke overføringsfiler                       */

             CPYF       FROMFILE(BOFIST) TOFILE(&DLIB/&BOFI) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOAVST) TOFILE(&DLIB/&BOAV) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOLGST) TOFILE(&DLIB/&BOLG) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOSEST) TOFILE(&DLIB/&BOSE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOKUST) TOFILE(&DLIB/&BOKU) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOKPST) TOFILE(&DLIB/&BOKP) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOKNST) TOFILE(&DLIB/&BOKN) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOLHST) TOFILE(&DLIB/&BOLH) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOLDST) TOFILE(&DLIB/&BOLD) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOLTST) TOFILE(&DLIB/&BOLT) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOPKST) TOFILE(&DLIB/&BOPK) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOVTST) TOFILE(&DLIB/&BOVT) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOVGST) TOFILE(&DLIB/&BOVG) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOVAST) TOFILE(&DLIB/&BOVA) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOVEST) TOFILE(&DLIB/&BOVE) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOVPST) TOFILE(&DLIB/&BOVP) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOTPST) TOFILE(&DLIB/&BOTP) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOVSST) TOFILE(&DLIB/&BOVS) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOEAST) TOFILE(&DLIB/&BOEA) +
                          CRTFILE(*YES)
             CPYF       FROMFILE(BOMFST) TOFILE(&DLIB/&BOMF) +
                          CRTFILE(*YES)

/* Overrider overføringsfilene til kasse-spesifikke overføringsfiler */

             OVRDBF     FILE(BOFIST) TOFILE(&BOFI) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOAVST) TOFILE(&BOAV) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOLGST) TOFILE(&BOLG) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOSEST) TOFILE(&BOSE) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOKUST) TOFILE(&BOKU) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOKPST) TOFILE(&BOKP) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOKNST) TOFILE(&BOKN) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOLHST) TOFILE(&BOLH) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOLDST) TOFILE(&BOLD) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOLTST) TOFILE(&BOLT) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOPKST) TOFILE(&BOPK) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOVTST) TOFILE(&BOVT) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOVGST) TOFILE(&BOVG) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOVAST) TOFILE(&BOVA) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOVEST) TOFILE(&BOVE) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOVPST) TOFILE(&BOVP) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOTPST) TOFILE(&BOTP) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOVSST) TOFILE(&BOVS) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOEAST) TOFILE(&BOEA) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BOMFST) TOFILE(&BOMF) OVRSCOPE(*CALLLVL)

/* Kaller eksportprogram                                             */

             CALL       PGM(BU700R) PARM(&FIRM &DATO &TIME &KASS)

/* Fjerner overstyring av overføringsfilene                          */

             DLTOVR     FILE(BOFIST)
             DLTOVR     FILE(BOAVST)
             DLTOVR     FILE(BOLGST)
             DLTOVR     FILE(BOSEST)
             DLTOVR     FILE(BOKUST)
             DLTOVR     FILE(BOKPST)
             DLTOVR     FILE(BOKNST)
             DLTOVR     FILE(BOLHST)
             DLTOVR     FILE(BOLDST)
             DLTOVR     FILE(BOLTST)
             DLTOVR     FILE(BOPKST)
             DLTOVR     FILE(BOVTST)
             DLTOVR     FILE(BOVGST)
             DLTOVR     FILE(BOVAST)
             DLTOVR     FILE(BOVEST)
             DLTOVR     FILE(BOVPST)
             DLTOVR     FILE(BOTPST)
             DLTOVR     FILE(BOVSST)
             DLTOVR     FILE(BOEAST)
             DLTOVR     FILE(BOMFST)

 END:        ENDPGM
