             PGM        PARM(&FIRM &VSOR)

             DCL        VAR(&FIRM) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&VSOR) TYPE(*CHAR) LEN(10)

/* Oppretter og overrider member i arbeidsfil                        */

             ADDPFM     FILE(VVAWPF) MBR(VAREVSORE)
             OVRDBF     FILE(VVAWPF) MBR(VAREVSORE) OVRSCOPE(*CALLLVL)

/* Kaller eksportprogram                                             */

             CALL       PGM(BU727R) PARM(&FIRM &VSOR)

/* Fjerner member i arbeidsfil                                       */

             RMVM       FILE(VVAWPF) MBR(VAREVSORE)

 END:        ENDPGM
