             PGM        PARM(&DLIB &FIRM &USER &KASS &STAT &KUND +
                          &KPRO &PINF)

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10)  /* Std input */
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KASS) TYPE(*CHAR) LEN(3)
             DCL        VAR(&STAT) TYPE(*CHAR) LEN(8)

             DCL        VAR(&KUND) TYPE(*DEC)  LEN(6 0) /* Input */
             DCL        VAR(&KPRO) TYPE(*DEC)  LEN(6 0)

             DCL        VAR(&PINF) TYPE(*CHAR) LEN(400) /* Output */

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)

/* Setter biblioteksliste                                            */

             CHGVAR     VAR(&FGRP) VALUE(%SUBSTRING(&DLIB 4 3))

             CALL       PGM(AA720C) PARM(&FGRP)

/* Initierer miljø                                                   */

             CALL       PGM(BINIT) PARM(&DLIB &KASS &FIRM &USER)

/* Kaller program                                                    */

             CALL       PGM(BU924R) PARM(&FIRM &KUND &KPRO &PINF)

 END:        ENDPGM
