             PGM        PARM(&DLIB &FIRM &USER &KASS &STAT &KUND +
                          &KPRO &SCAN &LETY &LAGE &AVDE +
                          &VARE &VINF &EINF &EANN +
                          &ANTA &OLET &KPRI &OPPR &SAPR &KOPR &RAB1 +
                          &RAB2 &KAMP &ALME &BRTY &BRR1 &BRR2 &KMVA)

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10)  /* Std input */
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KASS) TYPE(*CHAR) LEN(3)
             DCL        VAR(&STAT) TYPE(*CHAR) LEN(8)

             DCL        VAR(&KUND) TYPE(*DEC)  LEN(6 0) /* Input */
             DCL        VAR(&KPRO) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&SCAN) TYPE(*CHAR) LEN(50)
             DCL        VAR(&LETY) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&LAGE) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&AVDE) TYPE(*DEC)  LEN(4 0)

             DCL        VAR(&VARE) TYPE(*CHAR) LEN(15)  /* Output */
             DCL        VAR(&VINF) TYPE(*CHAR) LEN(240)
             DCL        VAR(&EINF) TYPE(*CHAR) LEN(96)
             DCL        VAR(&EANN) TYPE(*DEC)  LEN(14 0)
             DCL        VAR(&ANTA) TYPE(*DEC)  LEN(11 3)
             DCL        VAR(&OLET) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&KPRI) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OPPR) TYPE(*DEC)  LEN(9 2)
             DCL        VAR(&SAPR) TYPE(*DEC)  LEN(9 2)
             DCL        VAR(&KOPR) TYPE(*DEC)  LEN(9 2)
             DCL        VAR(&RAB1) TYPE(*DEC)  LEN(5 2)
             DCL        VAR(&RAB2) TYPE(*DEC)  LEN(5 2)
             DCL        VAR(&KAMP) TYPE(*CHAR) LEN(5)
             DCL        VAR(&ALME) TYPE(*DEC)  LEN(4 0)
             DCL        VAR(&BRTY) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&BRR1) TYPE(*DEC)  LEN(5 2)
             DCL        VAR(&BRR2) TYPE(*DEC)  LEN(5 2)
             DCL        VAR(&KMVA) TYPE(*CHAR) LEN(1)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)

/* Setter biblioteksliste                                            */

             CHGVAR     VAR(&FGRP) VALUE(%SUBSTRING(&DLIB 4 3))

             CALL       PGM(AA720C) PARM(&FGRP)

/* Initierer miljø                                                   */

             CALL       PGM(BINIT) PARM(&DLIB &KASS &FIRM &USER)

/* Kaller program                                                    */

             CALL       PGM(BU921R) PARM(&FIRM &KUND &KPRO &SCAN +
                          &LETY &LAGE &AVDE +
                          &VARE &VINF &EINF &EANN &ANTA &OLET +
                          &KPRI &OPPR &SAPR &KOPR &RAB1 &RAB2 &KAMP +
                          &ALME &BRTY &BRR1 &BRR2 &KMVA)

 END:        ENDPGM
