             PGM        PARM(&DLIB &FIRM &USER &KASS &STAT &KUND +
                          &KPRO &VARE &LETY &LAGR &AVDE +
                          &ENHE &PRIV &OLET &KPRI +
                          &OPPR &SAPR &KOPR &RAB1 &RAB2 &KAMP &ALME +
                          &BRTY &BRR1 &BRR2 &KMVA)
/* */
/*6.30 080318 bof : Utvidet med kundeklubb i paramliste til BU920R */
/* */



             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KASS) TYPE(*CHAR) LEN(3)
             DCL        VAR(&STAT) TYPE(*CHAR) LEN(8)

             DCL        VAR(&KUND) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&KPRO) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&VARE) TYPE(*CHAR) LEN(15)
             DCL        VAR(&LETY) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&LAGR) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&AVDE) TYPE(*DEC)  LEN(4 0)
             DCL        VAR(&ENHE) TYPE(*CHAR) LEN(3)
             DCL        VAR(&PRIV) TYPE(*DEC)  LEN(1 0)

             DCL        VAR(&OLET) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&KPRI) TYPE(*CHAR) LEN(1)
             DCL        VAR(&OPPR) TYPE(*DEC)  LEN(9 2)
             DCL        VAR(&SAPR) TYPE(*DEC)  LEN(9 2)
             DCL        VAR(&KOPR) TYPE(*DEC)  LEN(9 2)
             DCL        VAR(&RAB1) TYPE(*DEC)  LEN(5 2)
             DCL        VAR(&RAB2) TYPE(*DEC)  LEN(5 2)
             DCL        VAR(&KAMP) TYPE(*CHAR) LEN(5)
             DCL        VAR(&ALME) TYPE(*DEC)  LEN(4 0)
             DCL        VAR(&BRTY) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&BRR1) TYPE(*DEC)  LEN(5 2)
             DCL        VAR(&BRR2) TYPE(*DEC)  LEN(5 2)
             DCL        VAR(&KMVA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&KLUB) TYPE(*CHAR) LEN(1) VALUE(' ') /*6.30*/


             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)

/* Setter biblioteksliste                                            */

             CHGVAR     VAR(&FGRP) VALUE(%SUBSTRING(&DLIB 4 3))

             CALL       PGM(AA720C) PARM(&FGRP)

/* Initierer miljø                                                   */

             CALL       PGM(BINIT) PARM(&DLIB &KASS &FIRM &USER)

/* Kaller program                                                    */

             CALL       PGM(BU920R) PARM(&FIRM &KUND &KPRO &VARE &LETY +
                          &LAGR &AVDE &ENHE &PRIV &OLET &KPRI &OPPR &SAPR +
                          &KOPR &RAB1 &RAB2 &KAMP &ALME &BRTY &BRR1 &BRR2 +
                          &KMVA &KLUB) /*6.30*/

 END:        ENDPGM
