             PGM        PARM(&DLIB &FIRM &USER &KASS &STAT &VARE +
                          &LAGE &ENHE &BEHL &BBES &PAKK &DISP)

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KASS) TYPE(*CHAR) LEN(3)
             DCL        VAR(&STAT) TYPE(*CHAR) LEN(8)

             DCL        VAR(&VARE) TYPE(*CHAR) LEN(15)
             DCL        VAR(&LAGE) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&ENHE) TYPE(*CHAR) LEN(3)

             DCL        VAR(&BEHL) TYPE(*DEC)  LEN(11 3)
             DCL        VAR(&BBES) TYPE(*DEC)  LEN(11 3)
             DCL        VAR(&PAKK) TYPE(*DEC)  LEN(11 3)
             DCL        VAR(&DISP) TYPE(*DEC)  LEN(11 3)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)

/* Setter biblioteksliste                                            */

             CHGVAR     VAR(&FGRP) VALUE(%SUBSTRING(&DLIB 4 3))

             CALL       PGM(AA720C) PARM(&FGRP)

/* Initierer miljø                                                   */

             CALL       PGM(BINIT) PARM(&DLIB &KASS &FIRM &USER)

/* Kaller program                                                    */

             CALL       PGM(BU930R) PARM(&FIRM &VARE &LAGE &ENHE +
                          &BEHL &BBES &PAKK &DISP)

 END:        ENDPGM
