             PGM        PARM(&DLIB &FIRM &USER &KASS &STAT &OSUM +
                          &ORNR)

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KASS) TYPE(*CHAR) LEN(3)
             DCL        VAR(&STAT) TYPE(*CHAR) LEN(8)

             DCL        VAR(&OSUM) TYPE(*DEC)  LEN(11 2)

             DCL        VAR(&ORNR) TYPE(*DEC)  LEN(8 0)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)

/* Setter biblioteksliste                                            */

             CHGVAR     VAR(&FGRP) VALUE(%SUBSTRING(&DLIB 4 3))

             CALL       PGM(AA720C) PARM(&FGRP)

/* Initierer miljø                                                   */

             CALL       PGM(BINIT) PARM(&DLIB &KASS &FIRM &USER)

/* Kaller program                                                    */

             CALL       PGM(BU980R) PARM(&FIRM &OSUM &ORNR &STAT)

 END:        ENDPGM
