             PGM        PARM(&FIRA &BONG)

/* Definering av variable                                            */

             DCL        VAR(&FIRA) TYPE(*CHAR) LEN(3)
             DCL        VAR(&BONG) TYPE(*CHAR) LEN(10)

/* Legger overføringsprogram til jobbkø                              */

             SBMJOB     CMD(CALL PGM(ASXLKLU630/BU995R) PARM(&FIRA +
                          &BONG)) JOBD(ASXLKLUBB/OCULOSSUB) +
                          JOBQ(ASXLKLUBB/OCULOSSUB)

 END:        ENDPGM
