             PGM        PARM(&DLIB &FIRM &AVDE)

/* Initiering av parametre.                                          */

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&AVDE) TYPE(*CHAR) LEN(4)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(END))

/* Setter biblioteksliste                                            */

             CHGVAR     VAR(&FGRP) VALUE(%SUBSTRING(&DLIB 4 3))

             CALL       PGM(AA724C) PARM(&FGRP)

/* Setter current library                                            */

             CHGCURLIB  CURLIB(&DLIB)

/* Legger inn firma i DTAARA                                         */

             CHGDTAARA  DTAARA(*LDA (944 3)) VALUE(&FIRM)

/* Tømmer fil                                                        */

             CLRPFM     FILE(CEDIPF)

/* Kaller program                                                    */

             CALL       PGM(CE700R) PARM(&FIRM &AVDE)

 END:        ENDPGM
