             PGM
             DCLF       FILE(CM00)
             DCL        VAR(&APFNAV) TYPE(*CHAR) LEN(30)
             DCL        VAR(&ONUM)   TYPE(*DEC)  LEN(8)
             DCL        VAR(&LPRO)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&USER)   TYPE(*CHAR) LEN(10)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(LSETUP)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             RTVDTAARA  DTAARA(*LDA (911 10)) RTNVAR(&USER)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             if         cond(%sst(&user 1 5) *eq 'G0XEG') then(do)
               chgvar   var(&in41)   value('1')
             enddo
             if         cond(%sst(&user 1 5) *eq 'G01EG') then(do)
               chgvar   var(&in41)   value('1')
             enddo
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
/* F10                                                               */
/*           IF         COND(&IN10) THEN(CALL QCMD)                  */

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(CM05)
             ENDDO

/* Valg 6                                                            */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(XS100R)
             ENDDO

/* Valg 7                                                            */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(XK100R)
             ENDDO

/* Valg 8                                                            */
             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(XGTSLC)
             ENDDO

/* Valg 9                                                            */
             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(XGTKKC)
             ENDDO

/* Valg 10                                                           */
             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       CK002R
             ENDDO

/* Valg 11                                                           */
             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       CLN03R
             ENDDO

/* Valg 12                                                           */
             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       RF231R
             ENDDO

/* Valg 13                                                           */
             IF         COND(&VALG *EQ 13) THEN(DO)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 16                                                           */
             IF         COND(&VALG *EQ 16) THEN(DO)
             CALL       PGM(XGTLOC)
             ENDDO


/* Valg 20                                                           */
             IF         COND(&VALG *EQ 20) THEN(DO)
             CALL       CM001
             ENDDO
/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
