             PGM
             DCLF       FILE(CM01)
             DCL        VAR(&APFNAV) TYPE(*CHAR) LEN(30)
             DCL        VAR(&ONUM)   TYPE(*DEC)  LEN(8)
             DCL        VAR(&LPRO)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&USER)   TYPE(*CHAR) LEN(10)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(LSETUP)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             RTVDTAARA  DTAARA(*LDA (911 10)) RTNVAR(&USER)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
/* F10                                                               */
/*           IF         COND(&IN10) THEN(CALL QCMD)                  */

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg fil                                                          */
             IF         COND(&VLG001 *EQ '1') THEN(DO)
             CALL       CG001C
             ENDDO

             IF         COND(&VLG002 *EQ '1') THEN(DO)
             CALL       CG002C
             ENDDO

             IF         COND(&VLG003 *EQ '1') THEN(DO)
             CALL       CG003C
             ENDDO

             IF         COND(&VLG004 *EQ '1') THEN(DO)
             CALL       CG004C
             ENDDO

             IF         COND(&VLG005 *EQ '1') THEN(DO)
             CALL       CG009C
             ENDDO

             IF         COND(&VLG006 *EQ '1') THEN(DO)
             CALL       CG010C
             ENDDO

             IF         COND(&VLG007 *EQ '1') THEN(DO)
             CALL       CG011C
             ENDDO

             IF         COND(&VLG008 *EQ '1') THEN(DO)
             CALL       CG012C
             ENDDO

             IF         COND(&VLG009 *EQ '1') THEN(DO)
             CALL       CG005C
             ENDDO

             IF         COND(&VLG010 *EQ '1') THEN(DO)
             CALL       CG007C
             ENDDO

             IF         COND(&VLG011 *EQ '1') THEN(DO)
             CALL       CG008C
             ENDDO

             IF         COND(&VLG012 *EQ '1') THEN(DO)
             CALL       CG006C
             ENDDO


/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
