             PGM
             DCLF       FILE(CM05)
             DCL        VAR(&APFNAV) TYPE(*CHAR) LEN(30)
             DCL        VAR(&ONUM)   TYPE(*DEC)  LEN(8)
             DCL        VAR(&LPRO)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&USER)   TYPE(*CHAR) LEN(10)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(LSETUP)

             CHGVAR     VAR(&VLG001)   VALUE(' ')
             CHGVAR     VAR(&VLG002)   VALUE(' ')
             CHGVAR     VAR(&VLG003)   VALUE(' ')
             CHGVAR     VAR(&VLG004)   VALUE(' ')
             CHGVAR     VAR(&VLG005)   VALUE(' ')
             CHGVAR     VAR(&VLG006)   VALUE(' ')

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             RTVDTAARA  DTAARA(*LDA (911 10)) RTNVAR(&USER)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)

             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg fil                                                          */
             IF         COND(&VLG001 *EQ '1') THEN(DO)
             CALL       PGM(NM708C) PARM(' ')
             CHGVAR     VAR(&VLG001)   VALUE(' ')
             ENDDO

             IF         COND(&VLG002 *EQ '1') THEN(DO)
             CALL       PGM(NM705C) PARM(' ')
             CHGVAR     VAR(&VLG002)   VALUE(' ')
             ENDDO

             IF         COND(&VLG003 *EQ '1') THEN(DO)
             CALL       PGM(NM710C) PARM(' ')
             CHGVAR     VAR(&VLG003)   VALUE(' ')
             ENDDO

             IF         COND(&VLG004 *EQ '1') THEN(DO)
             CALL       PGM(NM704C) PARM(' ')
             CHGVAR     VAR(&VLG004)   VALUE(' ')
             ENDDO

             IF         COND(&VLG005 *EQ '1') THEN(DO)
             CALL       PGM(NM700C) PARM(' ')
             CHGVAR     VAR(&VLG005)   VALUE(' ')
             ENDDO

             IF         COND(&VLG006 *EQ '1') THEN(DO)
             CALL       PGM(NM707C) PARM(' ')
             CHGVAR     VAR(&VLG006)   VALUE(' ')
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
