             PGM       PARM(&L &N)
             DCL       VAR(&L) TYPE(*CHAR)  LEN(10)
             DCL       VAR(&N) TYPE(*CHAR)  LEN(10)
/*                                                       */
             crtprtf file(&L/&N) srcfile(&L/Qddpsrc) srcmbr(&N) +
                     pagesize(48 198) cpi(15) ovrflw(44)
/*                                                       */
SLUTT:       ENDPGM
