             PGM

             DCL        VAR(&GRPPRF)   TYPE(*CHAR) LEN(10)

             RTVUSRPRF  GRPPRF(&GRPPRF)

 RLEVLB:     CHKOBJ     OBJ(*LIBL/RLEVLB) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)

                CRTLF      FILE(*CURLIB/RLEVLB) SRCFILE(*LIBL/QDDFSRC) +
                             MAXMBRS(*NOMAX) SRTSEQ(*LANGIDUNQ) LANGID(NOR)

                CHGOBJOWN  OBJ(*CURLIB/RLEVLB) OBJTYPE(*FILE) NEWOWN(ASP)

                IF         COND(&GRPPRF *NE '*NONE') THEN(DO)
                   GRTOBJAUT  OBJ(*CURLIB/RLEVLB) OBJTYPE(*ALL) +
                                USER(&GRPPRF) AUT(*ALL) REPLACE(*YES)
                   GRTOBJAUT  OBJ(*CURLIB/RLEVLB) OBJTYPE(*ALL) +
                                USER(*PUBLIC) AUT(*EXCLUDE) REPLACE(*YES)
                ENDDO
             ENDDO
 NESTE1:

 ENDPGM:        ENDPGM

