             PGM        PARM(&firm &numm &suff &url_link)

/*----------------------------------------------------------------------------------*/
/* 8.xx 180124  bsa Nytt program                                                    */
/*                                                                                  */
/*                                                                                  */
/*                                                                                  */
/*                                                                                  */
/*----------------------------------------------------------------------------------*/

             DCL        VAR(&firm) TYPE(*dec) LEN(3 0)
             DCL        VAR(&numm) TYPE(*dec) LEN(8 0)
             DCL        VAR(&suff) TYPE(*dec) LEN(2 0)
             DCL        VAR(&url_link) TYPE(*CHAR) LEN(100)

             call       pgm(cs101r) parm(&firm &numm &suff)

             ENDPGM
