             PGM

             DCL        VAR(&MODU)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&DISP)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&STAT)     TYPE(*CHAR) LEN(1)


             CHGVAR     VAR(&MODU)     VALUE(ADRA)
             CHGVAR     VAR(&DISP)     VALUE(1)
             CHGVAR     VAR(&STAT)     VALUE(0)
             CALL       PGM(AX700R) PARM(&MODU &DISP &STAT)

             IF         COND(&STAT *EQ '1') THEN(DO)
                GOTO       CMDLBL(ENDPGM)
             ENDDO

             CALL       PGM(DADR2R)

/* Slutt                                                             */
 ENDPGM:     ENDPGM

