pgm          parm(&jobb &prog &sekv &text)

             dcl    var(&prog)    type(*char)  len(10)
             dcl    var(&sekv)    type(*char)  len(03)
             dcl    var(&text)    type(*char)  len(100)
             dcl    var(&jobb)    type(*char)  len(10)

/*           rtvjoba    job(&jobb)           */
/*           addlible   lib(nxc_distr)  position(*last)  */
/*           monmsg     msgid(cpf2103)    */

             call       pgm(EGD97R) parm(&jobb &prog &sekv &text)

endpgm:
