             PGM
/*   EGFILGEN splittet i EGFILGEN og EGFILGENFG                      */
/*                                                                   */

             DCL        VAR(&fgr)   TYPE(*CHAR) LEN(3)

             rtvdtaara  dtaara(*lda (931 03))  rtnvar(&fgr)
             call       pgm(egfilgenfg)        parm(&fgr)


 endpgm:     endpgm
