             PGM        PARM(&WJOB)

             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MLD)  TYPE(*CHAR) LEN(80)

/* Tøm arbeidsregister fra forrige kjøring                           */
             clrpfm     ebkspf

/* Kall til kalkulasjonsprogram                                      */

             CALL       PGM(EK141R)
             CHGVAR     VAR(&MLD) VALUE('Kalkulasjon av bonus +
                          for alle kunder er ferdig ')
             SNDBRKMSG  MSG(&MLD) TOMSGQ(&WJOB)

/* Kall til program for generering av kreditnotaer                   */

             CALL       PGM(EK143R)
             CHGVAR     VAR(&MLD) VALUE('Generering av kreditnotaer +
                          er ferdig ')
             SNDBRKMSG  MSG(&MLD) TOMSGQ(&WJOB)

 END:        ENDPGM
