             PGM

             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

/* Henter jobb-nummer                                                */

             RTVJOBA    JOB(&WJOB)

/* Submitter kall til kalkulasjonsprogram                            */

/*           SBMJOB     CMD(CALL PGM(EK141C) +                 */
/*Fjernet i test        PARM(&WJOB)) +                         */
/*                      JOB(KUNDEBONUS) MSGQ(*NONE)            */

             CALL PGM(EK141C) PARM(&WJOB)

 END:        ENDPGM
