             PGM

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&ALT1)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&ALT2)     TYPE(*CHAR) LEN(1)

/* Call av parameterprogram                                          */

             CALL       PGM(EK600R) PARM(&ALT1 &ALT2 &IN03)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Kall til summeringsliste                                          */
             IF         COND(&ALT1 *EQ '1') THEN(DO)
/* Program for printerstyring                                        */
             CALL       PGM(AP600R) PARM('EK600 ' '1' '0' &IN03 &BTCH)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))
             CALL       PGM(EK601C)
             ENDDO

/* Kall til program for kundebrev                                    */

             IF         COND(&ALT2 *EQ '1') THEN(DO)
/* Program for printerstyring                                        */
             CALL       PGM(AP600R) PARM('EK602 ' '1' '0' &IN03 &BTCH)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))
             CALL       PGM(EK604C)
             ENDDO

 END:        ENDPGM
