             PGM        PARM(&KUND &PAAR &ALT1 &BOTY)

             DCL        VAR(&KUND) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PAAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&ALT1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BOTY) TYPE(*CHAR) LEN(2)
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

/* Program for printerstyring                                       */

             CALL       PGM(AP600R) PARM('EK605 ' '1' '0' &IN03 &BTCH)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))
             CALL       PGM(AP601C)    PARM('EK605P' &BTCH)

/* Utskrift av kundebrev                                             */
             CALL PGM(EK605R) PARM(&KUND &PAAR &ALT1 &BOTY)

/* Reverser overstyring                                              */
             CALL       PGM(AP606C) PARM('EK605P')

 END:        ENDPGM
