             PGM        PARM(&FIRM &KUND &PAAR &BOTY &FPER &PERI &WJOB)

             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&KUND) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PAAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&INLR) TYPE(*CHAR) LEN(1) VALUE('0')
             DCL        VAR(&BOTY) TYPE(*CHAR) LEN(2)
             DCL        VAR(&FPER) TYPE(*CHAR) LEN(2)
             DCL        VAR(&PERI) TYPE(*CHAR) LEN(2)

             DCL        VAR(&MLD)  TYPE(*CHAR) LEN(80)

             CHGVAR     VAR(&MLD) VALUE('Kalkulasjon av bonus +
                          for kunde ' *CAT &KUND *CAT ' er ferdig ')

/* Kall til kalkulasjonsprogram (ekstra kall for å lukke filer)      */

             CHGVAR     VAR(&INLR) VALUE(' ')
             CALL       PGM(EK711R) PARM(&FIRM &KUND &PAAR &BOTY &FPER +
                                    &PERI &INLR)
             CHGVAR     VAR(&INLR) VALUE('1')
             CALL       PGM(EK711R) PARM(&FIRM &KUND &PAAR &BOTY &FPER -
                                    &PERI &INLR)

/* Ferdigmelding                                                     */

             SNDBRKMSG  MSG(&MLD) TOMSGQ(&WJOB)

 END:        ENDPGM
