             PGM        PARM(&FIRM &PAAR &ALT1 &ALT2 &ALT3 &BOTY &FPER &PERI)

             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&PAAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&ALT1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&ALT2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&ALT3) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BOTY) TYPE(*CHAR) LEN(2)
             DCL        VAR(&PERI) TYPE(*CHAR) LEN(2)
             DCL        VAR(&FPER) TYPE(*CHAR) LEN(2)

             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

/* Henter jobb-nummer                                                */

             RTVJOBA    JOB(&WJOB)

/* Submitter kall til kalkulasjonsprogram                            */

             SBMJOB     CMD(CALL PGM(EK721C) PARM(&FIRM &PAAR &ALT1 +
                          &ALT2 &ALT3 &BOTY &FPER &PERI &WJOB)) +
                          JOB(KUNDEBONUS) MSGQ(*NONE)

 END:        ENDPGM
