             PGM        PARM(&FIRM &PAAR &ALT1 &ALT2 &ALT3 &BOTY &FPER &PERI +
                            &WJOB)

             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&PAAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&ALT1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&ALT2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&ALT3) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BOTY) TYPE(*CHAR) LEN(2)
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&KFRA) TYPE(*CHAR) LEN(4)
             DCL        VAR(&KTIL) TYPE(*CHAR) LEN(4)
             DCL        VAR(&KNRF) TYPE(*CHAR) LEN(6)
             DCL        VAR(&KNRT) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PERI) TYPE(*CHAR) LEN(2)
             DCL        VAR(&FPER) TYPE(*CHAR) LEN(2)

             DCL        VAR(&MLD)  TYPE(*CHAR) LEN(80)

             CHGVAR     VAR(&KFRA) VALUE('0000')
             CHGVAR     VAR(&KTIL) VALUE('0000')
             CHGVAR     VAR(&KNRF) VALUE('0000')
             CHGVAR     VAR(&KNRT) VALUE('0000')


/* Kall til kalkulasjonsprogram                                      */

             IF         COND(&ALT1 *EQ '1') THEN(DO)
             CALL       PGM(EK721R) PARM(&FIRM &PAAR &ALT1 &BOTY &FPER &PERI)
             CHGVAR     VAR(&MLD) VALUE('Kalkulasjon av bonus +
                          for alle kunder er ferdig ')
             SNDBRKMSG  MSG(&MLD) TOMSGQ(&WJOB)
             ENDDO

/* Kall til program for kontrolliste                                 */

             IF         COND(&ALT2 *EQ '1') THEN(DO)
             CALL       PGM(EK601R)
             CHGVAR     VAR(&MLD) VALUE('Utskrift av kontrollliste +
                          er ferdig ')
             SNDBRKMSG  MSG(&MLD) TOMSGQ(&WJOB)
             ENDDO

/* Kall til program for utskrift av kundebrev                        */

             IF         COND(&ALT3 *EQ '1') THEN(DO)
             CALL       PGM(EK602R) PARM(&FIRM &PAAR &BOTY &KFRA &KTIL +
                        &KNRF &KNRT)
             CHGVAR     VAR(&MLD) VALUE('Utskrift av kundebrev +
                          er ferdig ')
             SNDBRKMSG  MSG(&MLD) TOMSGQ(&WJOB)
             ENDDO

 END:        ENDPGM
