             PGM        PARM(&FIRM &PAAR &BOTY &WJOB)

             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&PAAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&BOTY) TYPE(*CHAR) LEN(2)

             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MLD)  TYPE(*CHAR) LEN(80)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)

/* Program for utskriftsparametre.                                   */

             CALL       PGM(AP600R) PARM('EK723' '0' '0' &IN03 &BTCH)

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP601C) PARM('EK723P' &BTCH)

/* Kall til program for utskrift av sumskjema                        */

             CALL       PGM(EK723R) PARM(&FIRM &PAAR &BOTY)
             CHGVAR     VAR(&MLD) VALUE('Utskrift av kundebrev  +
                          for bonus er ferdig ')
             SNDBRKMSG  MSG(&MLD) TOMSGQ(&WJOB)

/* Program for å fjerne overstyring av printerfile                   */

             CALL       PGM(AP606C) PARM('EK723P')

 END:        ENDPGM
