
/*           Spørring på endringslogg                              */

 strpgm:     pgm

             dcl        var(&regi) type(*char) len(10) value(' ')
             dcl        var(&fore) type(*char) len(10) value(' ')
             dcl        var(&felt) type(*char) len(10) value(' ')

             call       pgm(el001r) PARM(&regi &fore &felt)

 ENDPGM:     ENDPGM
