             PGM

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)

/* Call av parameterprogram                                          */

             CALL       PGM(EL600R) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Beregner bonus                                                    */

             CALL       PGM(EL601R)


 END:        ENDPGM
