             PGM        PARM(&FIRM &LDOR &PAAR &WJOB)

             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&LDOR) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PAAR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

             DCL        VAR(&MLD)  TYPE(*CHAR) LEN(80)

             CHGVAR     VAR(&MLD) VALUE('Kalkulasjon av årsbonus for +
                          leverandør ' *CAT &LDOR *CAT ' er ferdig ')

/* Kall til kalkulasjonsprogram                                      */

             CALL       PGM(EL711R) PARM(&FIRM &LDOR &PAAR)

/* Ferdigmelding                                                     */

             SNDBRKMSG  MSG(&MLD) TOMSGQ(&WJOB)

 END:        ENDPGM
