/*                                                                 */
/*    Rydder opp i alle tomme membere i FPSOPF                     */
/*                                                                 */
      PGM        parm(&filg)

      dcl        var(&filg)   type(*char) len(6)
/*                                                                   */
      dclf       file(fpsom)

/* ----------------------------------------------------------------- */
/*   Ta ut status over jobbene                    QBATCH             */
/* ----------------------------------------------------------------- */

     dltf        file(&filg/fpsom)
      monmsg     msgid(cpf0000)
     dspfd       file(fpsopf) type(*mbrlist) output(*outfile) +
                 fileatr(*pf) outfile(&filg/fpsom)


/*   Les fil for å sjekk om den inneholder memeber som burde vært ryddet */
rcv:  rcvf
      monmsg     msgid(cpf0864) exec(goto endpgm)
      if         cond((&mlname *ne 'FPSOPF') *and (&mlnrcd *eq 0)) then(do)
                 rmvm file(fpsolu) mbr(&mlname)
                 monmsg msgid(cpf5815 cpf7310)
                 rmvm file(fpsol1) mbr(&mlname)
                 monmsg msgid(cpf5815 cpf7310)
                 rmvm file(fpsopf) mbr(&mlname)
                 monmsg msgid(cpf5815 cpf7310)
      enddo

      goto       cmdlbl(rcv)
/* ----------------------------------------------------------------- */
endpgm:          endpgm
