             PGM
             DCLF       FILE(FG006D)

             DCL        VAR(&VA01)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA02)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA04)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA05)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA06)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA07)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA08)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA09)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA10)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA11)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA12)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA13)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA14)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA15)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA16)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA17)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA18)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA19)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA20)     TYPE(*CHAR) LEN(1)

             DCL        VAR(&NULL)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&FGRP)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&LEVL)     VALUE('40')
             CHGVAR     VAR(&OKOK)     VALUE('  ')
             CALL       PGM(AA050C)    PARM(&LEVL &OKOK)
             IF         COND(&OKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             SNDRCVF    RCDFMT(A1BLD)

/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/*  Genererer de valgte registere                                    */

             IF         COND(&VA01 *EQ '1') THEN(DO)
             CALL       PGM(FG604C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA02 *EQ '1') THEN(DO)
             CALL       PGM(FG608C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA03 *EQ '1') THEN(DO)
             CALL       PGM(FG612C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA04 *EQ '1') THEN(DO)
             CALL       PGM(FG616C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA05 *EQ '1') THEN(DO)
             CALL       PGM(FG620C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA06 *EQ '1') THEN(DO)
             CALL       PGM(FG624C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA07 *EQ '1') THEN(DO)
             CALL       PGM(FG628C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA08 *EQ '1') THEN(DO)
             CALL       PGM(FG632C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA09 *EQ '1') THEN(DO)
             CALL       PGM(FG636C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA10 *EQ '1') THEN(DO)
             CALL       PGM(FG640C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA11 *EQ '1') THEN(DO)
             CALL       PGM(FG644C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA12 *EQ '1') THEN(DO)
             CALL       PGM(FG648C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA13 *EQ '1') THEN(DO)
             CALL       PGM(FG652C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA14 *EQ '1') THEN(DO)
             CALL       PGM(FG656C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA15 *EQ '1') THEN(DO)
             CALL       PGM(FG665C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA16 *EQ '1') THEN(DO)
             CALL       PGM(FG666C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA17 *EQ '1') THEN(DO)
             CALL       PGM(FG670C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA18 *EQ '1') THEN(DO)
             CALL       PGM(FG674C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA19 *EQ '1') THEN(DO)
             CALL       PGM(FG675C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA20 *EQ '1') THEN(DO)
                CALL       PGM(FG830C) PARM(&FGRP &NULL)
             ENDDO


 ENDPGM:     ENDPGM
