/* 060919 nho  Lagt inn kreering av sidereg til FODTPF(FOD2PF)       */
             PGM
             DCLF       FILE(FG002D)

             DCL        VAR(&VA01)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA02)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA04)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA05)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA06)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA07)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA08)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA09)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA10)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA11)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA12)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA13)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA14)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA15)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA16)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA17)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA18)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA20)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA21)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA22)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA23)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA24)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA25)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA28)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&NULL)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&FGRP)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&FILE)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&GRPPRF)   TYPE(*CHAR) LEN(10)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&LEVL)     VALUE('40')
             CHGVAR     VAR(&OKOK)     VALUE('  ')
             CALL       PGM(AA050C)    PARM(&LEVL &OKOK)
             IF         COND(&OKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO


             RTVUSRPRF  GRPPRF(&GRPPRF)

             SNDRCVF    RCDFMT(A1BLD)

/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/*  Genererer de valgte registere                                    */

             IF         COND(&VA01 *EQ '1') THEN(DO)
             CALL       PGM(FG204C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA02 *EQ '1') THEN(DO)
             CALL       PGM(FG208C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA03 *EQ '1') THEN(DO)
             CALL       PGM(FG212C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA04 *EQ '1') THEN(DO)
             CALL       PGM(FG216C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA05 *EQ '1') THEN(DO)
             CALL       PGM(FG220C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA06 *EQ '1') THEN(DO)
             CALL       PGM(FG224C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA07 *EQ '1') THEN(DO)
             CALL       PGM(FG228C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA08 *EQ '1') THEN(DO)
             CALL       PGM(FG232C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA09 *EQ '1') THEN(DO)
             CALL       PGM(FG234C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA10 *EQ '1') THEN(DO)
             CALL       PGM(FG236C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA11 *EQ '1') THEN(DO)
             CALL       PGM(FG240C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA12 *EQ '1') THEN(DO)
             CALL       PGM(FG244C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA13 *EQ '1') THEN(DO)
             CALL       PGM(FG248C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA14 *EQ '1') THEN(DO)
             CALL       PGM(FG252C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA15 *EQ '1') THEN(DO)
             CALL       PGM(FG256C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA16 *EQ '1') THEN(DO)
             CALL       PGM(FG260C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA17 *EQ '1') THEN(DO)
             CALL       PGM(FG264C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA18 *EQ '1') THEN(DO)
             CALL       PGM(FG268C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA20 *EQ '1') THEN(DO)
             CALL       PGM(FG274C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA21 *EQ '1') THEN(DO)
             CALL       PGM(FG276C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA22 *EQ '1') THEN(DO)
             CALL       PGM(FG280C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA23 *EQ '1') THEN(DO)
             CALL       PGM(FG284C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA24 *EQ '1') THEN(DO)
             CALL       PGM(FG288C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA25 *EQ '1') THEN(DO)
             CALL       PGM(FG292C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA27 *EQ '1') THEN(DO)
                CHGVAR     VAR(&FILE)  VALUE('FOH2PF')
                CALL       PGM(AG906C) PARM(&FILE &FGRP &GRPPRF &NULL)
             ENDDO

             IF         COND(&VA28 *EQ '1') THEN(DO)
                CHGVAR     VAR(&FILE)  VALUE('FOD2PF')
                CALL       PGM(AG906C) PARM(&FILE &FGRP &GRPPRF &NULL)
             ENDDO


 ENDPGM:     ENDPGM
