             PGM
             DCLF       FILE(FG001D)

             DCL        VAR(&VA01)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA02)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA05)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA05)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA06)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA07)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA08)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA09)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA10)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA11)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA12)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA13)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA14)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA15)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA16)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA17)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA18)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA19)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA20)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA21)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA22)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA23)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA24)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA25)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&NULL)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&FGRP)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&LEVL)     VALUE('40')
             CHGVAR     VAR(&OKOK)     VALUE('  ')
             CALL       PGM(AA050C)    PARM(&LEVL &OKOK)
             IF         COND(&OKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             SNDRCVF    RCDFMT(A1BLD)

/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/*  Genererer de valgte registere                                    */

             IF         COND(&VA01 *EQ '1') THEN(DO)
             CALL       PGM(FG104C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA02 *EQ '1') THEN(DO)
             CALL       PGM(FG108C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA03 *EQ '1') THEN(DO)
             CALL       PGM(FG112C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA05 *EQ '1') THEN(DO)
             CALL       PGM(FG120C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA06 *EQ '1') THEN(DO)
             CALL       PGM(FG124C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA07 *EQ '1') THEN(DO)
             CALL       PGM(FG128C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA08 *EQ '1') THEN(DO)
             CALL       PGM(FG132C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA09 *EQ '1') THEN(DO)
             CALL       PGM(FG136C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA10 *EQ '1') THEN(DO)
             CALL       PGM(FG140C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA11 *EQ '1') THEN(DO)
             CALL       PGM(FG144C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA12 *EQ '1') THEN(DO)
             CALL       PGM(FG148C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA13 *EQ '1') THEN(DO)
             CALL       PGM(FG152C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA04 *EQ '1') THEN(DO)
             CALL       PGM(FG153C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA14 *EQ '1') THEN(DO)
             CALL       PGM(FG156C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA15 *EQ '1') THEN(DO)
             CALL       PGM(FG160C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA16 *EQ '1') THEN(DO)
             CALL       PGM(FG164C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA17 *EQ '1') THEN(DO)
             CALL       PGM(FG168C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA18 *EQ '1') THEN(DO)
             CALL       PGM(FG172C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA19 *EQ '1') THEN(DO)
             CALL       PGM(FG176C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA20 *EQ '1') THEN(DO)
             CALL       PGM(FG180C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA21 *EQ '1') THEN(DO)
             CALL       PGM(FG184C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA22 *EQ '1') THEN(DO)
             CALL       PGM(FG188C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA23 *EQ '1') THEN(DO)
             CALL       PGM(FG192C) PARM(&FGRP &NULL)
             ENDDO
             IF         COND(&VA24 *EQ '1') THEN(DO)
             CALL       PGM(FG654C) PARM(&FGRP &NULL)
             ENDDO
             IF         COND(&VA25 *EQ '1') THEN(DO)
                CALL       PGM(FG142C) PARM(&FGRP &NULL)
             ENDDO

 ENDPGM:     ENDPGM
