             PGM
             DCLF       FILE(FG005D)

             DCL        VAR(&VA01)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA02)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA04)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA05)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA06)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA07)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA08)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA09)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA11)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA12)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA13)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA14)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA15)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA16)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA17)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA18)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA19)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA21)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VA22)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&NULL)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&FGRP)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&LEVL)     VALUE('40')
             CHGVAR     VAR(&OKOK)     VALUE('  ')
             CALL       PGM(AA050C)    PARM(&LEVL &OKOK)
             IF         COND(&OKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             SNDRCVF    RCDFMT(A1BLD)

/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/*  Genererer de valgte registere                                    */

             IF         COND(&VA01 *EQ '1') THEN(DO)
             CALL       PGM(FG504C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA02 *EQ '1') THEN(DO)
             CALL       PGM(FG508C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA03 *EQ '1') THEN(DO)
             CALL       PGM(FG512C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA04 *EQ '1') THEN(DO)
             CALL       PGM(FG516C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA05 *EQ '1') THEN(DO)
             CALL       PGM(FG520C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA06 *EQ '1') THEN(DO)
             CALL       PGM(FG524C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA07 *EQ '1') THEN(DO)
             CALL       PGM(FG528C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA08 *EQ '1') THEN(DO)
             CALL       PGM(FG532C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA09 *EQ '1') THEN(DO)
             CALL       PGM(FG536C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA11 *EQ '1') THEN(DO)
             CALL       PGM(FG540C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA12 *EQ '1') THEN(DO)
             CALL       PGM(FG544C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA13 *EQ '1') THEN(DO)
             CALL       PGM(FG548C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA14 *EQ '1') THEN(DO)
             CALL       PGM(FG552C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA15 *EQ '1') THEN(DO)
             CALL       PGM(FG556C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA16 *EQ '1') THEN(DO)
             CALL       PGM(FG560C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA17 *EQ '1') THEN(DO)
             CALL       PGM(FG564C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA18 *EQ '1') THEN(DO)
             CALL       PGM(FG553C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA19 *EQ '1') THEN(DO)
             CALL       PGM(FG557C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA20 *EQ '1') THEN(DO)
             CALL       PGM(FG521C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA21 *EQ '1') THEN(DO)
             CALL       PGM(FG899C) PARM(&FGRP &NULL)
             ENDDO

             IF         COND(&VA22 *EQ '1') THEN(DO)
             CALL       PGM(FG381C) PARM(&FGRP &NULL)
             ENDDO


 ENDPGM:     ENDPGM
