
/*           Generere   BRUKSRETT-KNYTNING                           */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOFAK')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('VBRKBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('VBRKPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('VBRKLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('VBRKLR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('VBRKL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('VBRKL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('VBRKL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('VBRKL4')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('VBRKL5')
             DCL        VAR(&RGL6) TYPE(*CHAR) LEN(6) VALUE('VBRKL6')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG107C) PARM(&FGRP &NULL &DBIB +
                             &SBIB &RGBF &RGPF &RGLU &RGLR +
                             &RGL1 &RGL2 &RGL3 &RGL4 &RGL5 +
                             &RGL6)

 ENDPGM:     ENDPGM
