
/*           Generere   VARE-ENHETS-REGISTER                         */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOFAK')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('VVENBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('VVENPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('VVENLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('VVENLR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('VVENL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('VVENL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('VVENL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('VVENL4')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('VVENL5')
             DCL        VAR(&RGL6) TYPE(*CHAR) LEN(6) VALUE('VVENL6')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG107C) PARM(&FGRP &NULL &DBIB +
                             &SBIB &RGBF &RGPF &RGLU &RGLR +
                             &RGL1 &RGL2 &RGL3 &RGL4 &RGL5 &RGL6)

 ENDPGM:     ENDPGM
