
/*           Generere   ORDRE-HODE-REGISTER                          */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOFAK')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('FOHEBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('FOHEPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('FOHELU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('FOHELR')
             DCL        VAR(&RGLA) TYPE(*CHAR) LEN(6) VALUE('FOHELA')
             DCL        VAR(&RGLB) TYPE(*CHAR) LEN(6) VALUE('FOHELB')
             DCL        VAR(&RGLC) TYPE(*CHAR) LEN(6) VALUE('FOHELC')
             DCL        VAR(&RGLD) TYPE(*CHAR) LEN(6) VALUE('FOHELD')
             DCL        VAR(&RGLE) TYPE(*CHAR) LEN(6) VALUE('FOHELE')
             DCL        VAR(&RGLF) TYPE(*CHAR) LEN(6) VALUE('FOHELF')
             DCL        VAR(&RGLG) TYPE(*CHAR) LEN(6) VALUE('FOHELG')
             DCL        VAR(&RGLK) TYPE(*CHAR) LEN(6) VALUE('FOHELK')
             DCL        VAR(&RGLL) TYPE(*CHAR) LEN(6) VALUE('FOHELL')
             DCL        VAR(&RGLM) TYPE(*CHAR) LEN(6) VALUE('FOHELM')
             DCL        VAR(&RGLN) TYPE(*CHAR) LEN(6) VALUE('FOHELN')
             DCL        VAR(&RGLO) TYPE(*CHAR) LEN(6) VALUE('FOHELO')
             DCL        VAR(&RGLP) TYPE(*CHAR) LEN(6) VALUE('FOHELP')
             DCL        VAR(&RGLQ) TYPE(*CHAR) LEN(6) VALUE('FOHELQ')
             DCL        VAR(&RGLV) TYPE(*CHAR) LEN(6) VALUE('FOHELV')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('FOHEL1')
             DCL        VAR(&RGL9) TYPE(*CHAR) LEN(6) VALUE('FOHEL9')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG118C) PARM(&FGRP &NULL &DBIB +
                             &SBIB &RGBF &RGPF &RGLU &RGLR +
                             &RGLA &RGLB &RGLC &RGLD &RGLE +
                             &RGLF &RGLG &RGLK &RGLL &RGLM +
                             &RGLO &RGLN &RGLP &RGLQ &RGLV +
                             &RGL1 &RGL9)

 ENDPGM:     ENDPGM
