
/*           Generere   ORDRE-TEKST-FAST                             */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOFAK')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('FFTXBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('FFTXPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('FFTXLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('FFTXLR')
             DCL        VAR(&RGLA) TYPE(*CHAR) LEN(6) VALUE('FFTXLA')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('FFTXL1')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG103C) PARM(&FGRP &NULL &DBIB +
                             &SBIB &RGBF &RGPF &RGLU &RGLR +
                             &RGLA &RGL1)

 ENDPGM:     ENDPGM
