
/*           Generere   RABATTMATRISE-REGISTER                       */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOFAK')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('FRABBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('FRABPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('FRABLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('FRABLR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('FRABL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('FRABL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('FRABL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('FRABL4')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('FRABL5')
             DCL        VAR(&RGL6) TYPE(*CHAR) LEN(6) VALUE('FRABL6')
             DCL        VAR(&RGL7) TYPE(*CHAR) LEN(6) VALUE('FRABL7')
             DCL        VAR(&RGL8) TYPE(*CHAR) LEN(6) VALUE('FRABL8')
             DCL        VAR(&RGL9) TYPE(*CHAR) LEN(6) VALUE('FRABL9')
             DCL        VAR(&RGLA) TYPE(*CHAR) LEN(6) VALUE('FRABLA')
             DCL        VAR(&RGLB) TYPE(*CHAR) LEN(6) VALUE('FRABLB')
             DCL        VAR(&RGLC) TYPE(*CHAR) LEN(6) VALUE('FRABLC')
             DCL        VAR(&RGLD) TYPE(*CHAR) LEN(6) VALUE('FRABLD')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG114C) PARM(&FGRP &NULL &DBIB +
                             &SBIB &RGBF &RGPF &RGLU &RGLR +
                             &RGL1 &RGL2 &RGL3 &RGL4 &RGL5 +
                             &RGL6 &RGL7 &RGL8 &RGL9 &RGLA +
                             &RGLB &RGLC &RGLD)

 ENDPGM:     ENDPGM
