
/*           Generere   SPESIALPRIS-REGISTER                         */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOFAK')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('FPRIBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('FPRIPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('FPRILU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('FPRILR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('FPRIL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('FPRIL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('FPRIL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('FPRIL4')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('FPRIL5')
             DCL        VAR(&RGL6) TYPE(*CHAR) LEN(6) VALUE('FPRIL6')
             DCL        VAR(&RGL7) TYPE(*CHAR) LEN(6) VALUE('FPRIL7')
             DCL        VAR(&RGL8) TYPE(*CHAR) LEN(6) VALUE('FPRIL8')
             DCL        VAR(&RGL9) TYPE(*CHAR) LEN(6) VALUE('FPRIL9')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG110C) PARM(&FGRP &NULL &DBIB +
                             &SBIB &RGBF &RGPF &RGLU &RGLR +
                             &RGL1 &RGL2 &RGL3 &RGL4 &RGL5 +
                             &RGL6 &RGL7 &RGL8 &RGL9)

 ENDPGM:     ENDPGM
