/*                                                                   */
/*           Generere   GEBYR-REGISTER                               */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOFAK')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('FGEBBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('FGEBPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('FGEBLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('FGEBLR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('FGEBL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('FGEBL2')
             DCL        VAR(&Rglv) TYPE(*CHAR) LEN(6) VALUE('FGEBLV')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG104C) PARM(&FGRP &NULL &DBIB +
                             &SBIB &RGBF &RGPF &RGLU &RGLR +
                             &RGL1 &rgl2 &Rglv)

 ENDPGM:     ENDPGM
