
/*           Generere   Fil for logging av ordreforløp               */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOFAK')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('FLOGBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('FLOGPF')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('FLOGL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('FLOGL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('FLOGL3')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('FLOGLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('FLOGLR')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG104C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGL1 &RGL2 &RGL3 +
                                            &RGLU &RGLR)

 ENDPGM:     ENDPGM
