
/*           Generere   Sync-fil ordre / bestilling                  */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOFAK')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('FWBOBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('FWBOPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('FWBOLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('FWBOLR')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG101C) PARM(&FGRP &NULL &DBIB +
                            &SBIB &RGBF &RGPF &RGLU &RGLR)

 ENDPGM:     ENDPGM
