
/*           Generere   FAKTURA-HODE-REGISTER                        */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOFAK')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('SOHEBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('SOHEPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('SOHELU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('SOHELR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('SOHEL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('SOHEL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('SOHEL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('SOHEL4')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('SOHEL5')
             DCL        VAR(&RGL6) TYPE(*CHAR) LEN(6) VALUE('SOHEL6')
             DCL        VAR(&RGLA) TYPE(*CHAR) LEN(6) VALUE('SOHELA')
             DCL        VAR(&RGLK) TYPE(*CHAR) LEN(6) VALUE('SOHELK')
             DCL        VAR(&RGL9) TYPE(*CHAR) LEN(6) VALUE('SOHEL9')
             DCL        VAR(&RGLE) TYPE(*CHAR) LEN(6) VALUE('SOHELE')
             DCL        VAR(&RGLF) TYPE(*CHAR) LEN(6) VALUE('SOHELF')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG112C) PARM(&FGRP &NULL &DBIB +
                             &SBIB &RGBF &RGPF &RGLU &RGLR +
                             &RGL1 &RGL2 &RGL3 &RGL4 &RGL5 +
                             &RGL6 &RGLA &RGLK &RGL9 &RGLE &RGLF)

 ENDPGM:     ENDPGM
