
/*           Generere   STRUKTUR-VARE                                */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOFAK')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('VSTRBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('VSTRPF')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('VSTRLR')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('VSTRLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('VSTRL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('VSTRL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('VSTRL3')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG104C) PARM(&FGRP &NULL &DBIB +
                             &SBIB &RGBF &RGPF &RGLR &RGLU +
                             &RGL1 &RGL2 &RGL3)

 ENDPGM:     ENDPGM
