
/*           Generere Ordre-depositum-register                       */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOFAK')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('SDEPBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('SDEPPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('SDEPLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('SDEPLR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('SDEPL1')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG102C) PARM(&FGRP &NULL &DBIB +
                             &SBIB &RGBF &RGPF &RGLU &RGLR +
                             &RGL1)

 ENDPGM:     ENDPGM
