
/*           Generere   Slipstream 1 tabell                         */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&LIBL)   TYPE(*CHAR) LEN(10)

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(&LIBL) VALUE('ADB' *CAT &FGRP)
             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Genererer                                               */

             CALL       PGM(AG902C) PARM('FXL1ST' &libl ' ')

 ENDPGM:     ENDPGM
