/*                                                                   */
/*-------------------------------------------------------------------*/
/* Program for å slette gamle data i NX tabeller                      */
/*  feks i logger                                                    */
/*                                                                   */

             PGM

             DCL        &SQLSTMT TYPE(*CHAR) LEN(1000)

             CHGVAR     VAR(&SQLSTMT) VALUE('CALL +
                          EG_DRIFT.SP_CLEAN_FILGRUPPE()')

             RUNSQL     SQL(&SQLSTMT) COMMIT(*NONE) NAMING(*SQL)


 END:        ENDPGM


