             PGM        PARM(&EROR &DATO)

             DCL        VAR(&EROR)     TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&DATO)     TYPE(*CHAR) LEN(10)

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERR))
             MONMSG     MSGID(CPF2103)

             CALL       PGM(LLSTSR)    PARM(&EROR &DATO)
             GOTO       CMDLBL(END)

 ERR:        CHGVAR     VAR(&EROR)     VALUE('F')
 END:        ENDPGM
/* ----------------------------------------------------------------- */
/* Kode 'F' legges inn i &EROR dersom programmet LLSTSR ikke ble     */
/*          funnet, det vil si ASLAGR var ikke i bibliotekslista.    */
/*          Dette for å unngå feilmeldinger.                         */
/* ----------------------------------------------------------------- */
