             PGM
             DCLF       FILE(FM10)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             DCL        VAR(&ONUM)     TYPE(*DEC) LEN(8)
             DCL        VAR(&LPRO)     TYPE(*CHAR) LEN(1)
/*------------------------------------------------------------------ */
/* 6.30 260214 Endret kall til FO580R                                */
/* 6.30 010414 Endret kall til FO500R                                */
/* 6.30 080814 Nytt menypunkt - kortordre FO530R                     */
/* 6.32 211114 Nytt menypunkt - betalte kortordre FO531R             */
/*------------------------------------------------------------------ */
             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(FSETUP)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CHGVAR     VAR(&ONUM) VALUE(0)
             CHGVAR     VAR(&LPRO) VALUE(' ')
             CALL       PGM(FO500C) PARM(&ONUM &LPRO)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(FO632C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(NO100C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4                                                           */
             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(FO580C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5                                                           */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(FO585R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 10                                                           */
             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(FO660C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 11                                                           */
             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       PGM(FO670C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 12                                                           */
             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(FO680C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 13                                                           */
/*6.30*/     IF         COND(&VALG *EQ 13) THEN(DO)
/*6.30*/     CALL       PGM(FO530R)
/*6.30*/     GOTO       CMDLBL(START)
/*6.30*/     ENDDO

/* Valg 14                                                           */
/*6.32*/     IF         COND(&VALG *EQ 14) THEN(DO)
/*6.32*/     CALL       PGM(FO531R)
/*6.32*/     GOTO       CMDLBL(START)
/*6.32*/     ENDDO

/* Valg 15                                                           */
             IF         COND(&VALG *EQ 15) THEN(DO)
             CALL       PGM(SO500R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 16                                                           */
             IF         COND(&VALG *EQ 16) THEN(DO)
             CALL       PGM(VV550R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 17                                                           */
             IF         COND(&VALG *EQ 17) THEN(DO)
             CALL       PGM(SF500R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 18                                                           */
             IF         COND(&VALG *EQ 18) THEN(DO)
             CALL       PGM(LO530R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 19                                                           */
             IF         COND(&VALG *EQ 19) THEN(DO)
             CALL       PGM(FO570R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 20                                                           */
             IF         COND(&VALG *EQ 20) THEN(DO)
             CALL       PGM(FO650C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 21                                                           */
             IF         COND(&VALG *EQ 21) THEN(DO)
             CALL       PGM(FM70)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
