/* 6.20 081113 bsa Omorginisering av menyen                        */
/*                                                                 */
             PGM
             DCLF       FILE(FM21)
             DCL        VAR(&APFNAV)   TYPE(*CHAR) LEN(30)
/*6.20*/     DCL        VAR(&MENU)   TYPE(*CHAR) LEN(10)
/*6.20*/     DCL        VAR(&STAT)   TYPE(*CHAR) LEN(1)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(FSETUP)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
/*6.20       IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))        */
/*6.20*/     IF         COND(&IN03) THEN(DO)
/*6.20*/     CHGVAR     VAR(&STAT) VALUE('0')
/*6.20*/     CHGVAR     VAR(&MENU) VALUE('FM21      ')
/*6.20*/     CALL       PGM(AX720R) PARM(&MENU &STAT)
/*6.20*/     IF         COND(&STAT *EQ '1') THEN(DO)
/*6.20*/     GOTO CMDLBL(START)
/*6.20*/     ENDDO
/*6.20*/     GOTO       CMDLBL(ENDPGM)
/*6.20*/     ENDDO

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(VA165R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(VA166R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(EK100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4                                                            */
/* 6.20      IF         COND(&VALG *EQ 4) THEN(DO)                   */
/* 6.20      CALL       PGM(EL100R)                                  */
/* 6.20      GOTO       CMDLBL(START)                                */
/* 6.20      ENDDO                                                   */

/* Valg 6                                                            */
/* 6.20      IF         COND(&VALG *EQ 6) THEN(DO)                  */
/* 6.20      CALL       PGM(EK715R)                                 */
/* 6.20      GOTO       CMDLBL(START)                               */
/* 6.20      ENDDO                                                  */

/* Valg 7                                                            */
/* 6.20      IF         COND(&VALG *EQ 7) THEN(DO)                  */
/* 6.20      CALL       PGM(EK716R)                                 */
/* 6.20      GOTO       CMDLBL(START)                               */
/* 6.20      ENDDO                                                  */

/* Valg 8 Beregning av bonus                                    6.20 */
             IF         COND(&VALG *EQ 8) THEN(DO)
/*6.20*/     CALL       PGM(EK715R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 15 Utskrift av bonus                                    6.20 */
/*6.20*/     IF         COND(&VALG *EQ 15) THEN(DO)
/*6.20*/     CALL       PGM(EK600C)
/*6.20*/     GOTO       CMDLBL(START)
/*6.20*/     ENDDO


/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
