             PGM
             DCLF       FILE(FM79)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(FSETUP)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(FV101R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(FV102R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(FV103R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4                                                            */
             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(FV104R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6                                                            */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(VA160R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7                                                            */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(VA180R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8                                                            */
             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(VA190R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9                                                            */
             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(VA185R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 10                                                           */
             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(VA195R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 11                                                           */
             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       PGM(VA150R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 12                                                           */
             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(VA140R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 13                                                           */
             IF         COND(&VALG *EQ 13) THEN(DO)
             CALL       PGM(VA110R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 14                                                           */
             IF         COND(&VALG *EQ 14) THEN(DO)
             CALL       PGM(VA170R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 15                                                           */
             IF         COND(&VALG *EQ 15) THEN(DO)
             CALL       PGM(VY100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 16                                                           */
             IF         COND(&VALG *EQ 16) THEN(DO)
             CALL       PGM(VA165R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 17                                                           */
             IF         COND(&VALG *EQ 17) THEN(DO)
             CALL       PGM(NK100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 20                                                           */
             IF         COND(&VALG *EQ 20) THEN(DO)
             CALL       PGM(FA120R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
