             PGM
/* 251016 bof : tillate å så sammen varer.       */
             DCLF       FILE(FM82)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)

             DCL        VAR(&MLD1)     TYPE(*CHAR) LEN(50) +
                          VALUE('Man kan ikke slå sammen to  +
                          varer.    ')

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(FSETUP)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(VV110R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(FO770R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5                                                            */
             IF         COND(&VALG *EQ 5) THEN(DO)
/* 251016 Nåer punktet åpnet igjen nxo131 */
             CALL       PGM(VV115R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
