             PGM

/* 6.30 080517 bsa Lagt inn punkt for kollietiketter                 */
/*                                                                   */
             DCLF       FILE(FM90)

             DCL        VAR(&FNAV) TYPE(*CHAR) LEN(30)
/*6.nu*/     DCL        VAR(&ONUM) TYPE(*DEC) LEN(8)
             DCL        VAR(&LPRO) TYPE(*CHAR) LEN(1)
/*6.30*/     DCL        VAR(&OSUF) TYPE(*DEC) LEN(2)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* ------------------------------------------------------------------*/
/* 010414 Endret kall på FO500R til FO500C                           */
/* ----------------------------------------------------------------- */

/* Sette opp driftsmiljø                                             */

             CALL       PGM(FSETUP)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(FO590R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(FO592R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(FO595R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5                                                            */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(FO570R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7                                                            */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CHGVAR     VAR(&ONUM) VALUE(0)
             CHGVAR     VAR(&LPRO) VALUE(' ')
             CALL       PGM(FO500C) PARM(&ONUM &LPRO)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8  Utksrift av kollietiketter     6.30                       */
             IF         COND(&VALG *EQ 8) THEN(DO)
             CHGVAR     VAR(&ONUM) VALUE(0)
             CHGVAR     VAR(&OSUF) VALUE(0)
             CALL       PGM(FP270R) PARM(&ONUM &OSUF)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
