             PGM
             DCLF       FILE(FN11)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)
/*6.nu*/     DCL        VAR(&ONUM)     TYPE(*DEC)  LEN(8)
             DCL        VAR(&LPRO)     TYPE(*CHAR) LEN(1)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* ------------------------------------------------------------------*/
/* 010414 Endret kall på FO500R til FO500C                           */
/* ----------------------------------------------------------------- */


/* Sette opp driftsmiljø                                             */

             CALL       PGM(FSETUP)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01)    THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F5                                                                */
             IF         COND(&IN05)    THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06)    THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD) /* 7.xx */

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CHGVAR     VAR(&ONUM)     VALUE(0)
             CHGVAR     VAR(&LPRO)     VALUE(' ')
             CALL       PGM(FO500C) PARM(&ONUM &LPRO)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(FO122R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(FO632C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4                                                            */
             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(FL100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5                                                            */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(NO100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6                                                            */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(RK501R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7                                                            */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(VV550R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8                                                            */
             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(SO500R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9                                                            */
             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(SF500R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 10                                                           */
             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(RL501R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 11                                                           */
             IF         COND(&VALG *EQ 11) THEN(DO)
                CALL       PGM(FO580C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 12                                                           */
             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(FO585R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 15                                                           */
             IF         COND(&VALG *EQ 15) THEN(DO)
/*6.20*/     CALL       PGM(FN15)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 16                                                           */
             IF         COND(&VALG *EQ 16) THEN(DO)
             CHGVAR     VAR(&ONUM)     VALUE(0)
             CHGVAR     VAR(&LPRO)     VALUE(' ')
             CALL       PGM(LO500R) PARM(&ONUM &LPRO)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 17                                                           */
             IF         COND(&VALG *EQ 17) THEN(DO)
             STRPASTHR  RMTLOCNAME(JERN400)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
