             PGM
             DCLF       FILE(FN15)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&W_MODU)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&W_DISP)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&W_STAT)   TYPE(*CHAR) LEN(1)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(FSETUP)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&LEVL)     VALUE('20')
             CHGVAR     VAR(&OKOK)     VALUE('  ')
             CALL       PGM(AA050C)    PARM(&LEVL &OKOK)
             IF         COND(&OKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1    Utskrift av etiketter                                   */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(FP210C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2    Utskrift av reklame-etiketter                           */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(FP225C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3    Utskrift av tall-etiketter                              */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(FP227C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4    Utskrift av automatiske etiketter                       */
             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(FP200C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5    Utskrift av varer med reoletiketter                     */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(FP280C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6    Elektronisk etiketter                                   */
             IF         COND(&VALG *EQ 6) THEN(DO)
/* Sjekker om gyldig tilgang                                         */

             CHGVAR     VAR(&W_MODU) VALUE('ELHY      ')
             CHGVAR     VAR(&W_DISP) VALUE('1')
             CALL       PGM(AX700R) PARM(&W_MODU &W_DISP &W_STAT)
             IF         COND(&W_STAT *EQ '1') THEN(DO)
             GOTO CMDLBL(START)
             ENDDO

             CALL       PGM(FP260C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7    Vedlikehold av faste tekster etiketter                  */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(FP410R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8    Vedlikehold av spesialkoder, varer                      */
             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(FP420R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9    Vedlikehold av spesialkoder,leverandører                */
             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(FP430R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
