             PGM
             DCLF       FILE(FN18)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&ONUM)     TYPE(*DEC)  LEN(8)
             DCL        VAR(&LPRO)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VARE)     TYPE(*CHAR) LEN(15) -
                        VALUE('               ')
             DCL        VAR(&LAGE)     TYPE(*DEC)  LEN(2)  -
                        VALUE(00)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(FSETUP)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01)    THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03)    THEN(DO)
             GOTO       CMDLBL(endpgm)
             ENDDO

/* F5                                                                */
             IF         COND(&IN05)    THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06)    THEN(DSPMSG)

/* Valg 1                                                           */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(FM31)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                           */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(LN20)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(LL100R) PARM('               ')
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4                                                            */
             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(LN43)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5                                                            */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(FN90)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6                                                            */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(FL100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7                                                            */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(LH100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8                                                            */
             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(LI100R) PARM('OBKR')
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9                                                            */
             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(FO783R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
