             PGM

             DCL        VAR(&HVA)   TYPE(*DEC)  LEN(2)
             DCL        VAR(&NUM)   TYPE(*DEC)  LEN(8)
             DCL        VAR(&SUF)   TYPE(*DEC)  LEN(2)

             CHGVAR     VAR(&HVA) VALUE(0)
             CHGVAR     VAR(&NUM) VALUE(0)
             CHGVAR     VAR(&SUF) VALUE(0)

             CALL       PGM(FO100R) PARM(&HVA &NUM &SUF)

             CALL       PGM(FO501C) PARM(&NUM)
             ENDPGM
