             PGM        PARM(&AARR &FATY &FNUM &TNUM +
                             &OMKJ &RAPP &ANTA &FEIL)

/* Initiering av parametre.                                          */

             DCL        VAR(&AARR)   TYPE(*DEC)  LEN(4)
             DCL        VAR(&FATY)   TYPE(*DEC)  LEN(2)
             DCL        VAR(&FNUM)   TYPE(*DEC)  LEN(8)
             DCL        VAR(&TNUM)   TYPE(*DEC)  LEN(8)
             DCL        VAR(&OMKJ)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&RAPP)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&ANTA)   TYPE(*DEC)  LEN(4)
             DCL        VAR(&FEIL)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&FILN)   TYPE(*CHAR) LEN(20)
             DCL        VAR(&SMSG)   TYPE(*CHAR) LEN(1) VALUE('1')
             DCL        VAR(&STAT)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&OVRF)   TYPE(*CHAR) LEN(10) +
                                     VALUE('LOGIQFAKT')
             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&FEIL) VALUE('0')

/* Tømmer aktuell fakturafil                                         */

             IF         COND(&FATY *EQ 20) THEN(CLRPFM FILE(FNEFPF))
             IF         COND(&FATY *EQ 21) THEN(CLRPFM FILE(FNEPPF))
             IF         COND(&FATY *EQ 22) THEN(CLRPFM FILE(FNEMPF))
             IF         COND(&FATY *EQ 25) THEN(CLRPFM FILE(FNEMPF))
             IF         COND(&FATY *EQ 26) THEN(CLRPFM FILE(FNEMPF))
             IF         COND(&FATY *EQ 23) THEN(CLRPFM FILE(FNECPF))

/* Program for utskriftsparametre.                                   */

             CALL       PGM(AP600R) PARM('FO181' '0' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP601C)    PARM('FO181P' &BTCH)

/* Kaller prog. for gen. av eFaktura                                 */

             CALL       PGM(FO181R) PARM(&AARR &FATY &FNUM &TNUM +
                          &OMKJ &RAPP &ANTA &FEIL)

/* Hvis feilkode fra prog. eller ingen fakturaer; avslutt            */

             IF         COND(&FEIL *EQ '1') THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&ANTA *EQ 0) THEN(GOTO CMDLBL(ENDPGM))

/* Tømmer overføringsfil og kopierer inn oppdat. fakturaer           */

             CLRPFM     FILE(FNLGPF)
             IF         COND(&FATY *EQ 20) THEN(DO)
             CPYF       FROMFILE(FNEFPF) TOFILE(FNLGPF) +
                          FROMMBR(FNEFPF) TOMBR(FNLGPF) +
                          MBROPT(*REPLACE) FMTOPT(*NOCHK)
             ENDDO
             IF         COND(&FATY *EQ 21) THEN(DO)
             CPYF       FROMFILE(FNEPPF) TOFILE(FNLGPF) +
                          FROMMBR(FNEPPF) TOMBR(FNLGPF) +
                          MBROPT(*REPLACE) FMTOPT(*NOCHK)
             ENDDO
             IF         COND(&FATY *EQ 22) THEN(DO)
             CPYF       FROMFILE(FNEMPF) TOFILE(FNLGPF) +
                          FROMMBR(FNEMPF) TOMBR(FNLGPF) +
                          MBROPT(*REPLACE) FMTOPT(*NOCHK)
             ENDDO
             IF         COND(&FATY *EQ 25) THEN(DO)
             CPYF       FROMFILE(FNEMPF) TOFILE(FNLGPF) +
                          FROMMBR(FNEMPF) TOMBR(FNLGPF) +
                          MBROPT(*REPLACE) FMTOPT(*NOCHK)
             ENDDO
             IF         COND(&FATY *EQ 26) THEN(DO)
             CPYF       FROMFILE(FNEMPF) TOFILE(FNLGPF) +
                          FROMMBR(FNEMPF) TOMBR(FNLGPF) +
                          MBROPT(*REPLACE) FMTOPT(*NOCHK)
             ENDDO
             IF         COND(&FATY *EQ 23) THEN(DO)
             CPYF       FROMFILE(FNECPF) TOFILE(FNLGPF) +
                          FROMMBR(FNECPF) TOMBR(FNLGPF) +
                          MBROPT(*REPLACE) FMTOPT(*NOCHK)
             ENDDO

/* Henter filnavn og sender fil                                      */

             CALL       PGM(LO762R) PARM(&FILN)

             CALL       PGM(AF700C) PARM(&OVRF &STAT &FILN &SMSG)

             IF         COND(&STAT *NE ' ') THEN(CHGVAR VAR(&FEIL) +
                          VALUE('1'))
 ENDPGM:
             CALL       PGM(AP606C)    PARM('FO181P')

 END:        ENDPGM
