/* 120911    NHO        Lagt inn 6 nye registere                    */
             PGM        PARM(&TFGR &TFIRX)
/*                                                                   */
             DCL        VAR(&TFGR)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&TFIRX)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&TFIR)   TYPE(*DEC) LEN(3 0)
             DCL        VAR(&FGRP)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRM)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&BIBL)   TYPE(*CHAR) LEN(06) VALUE('ADB   ')
             DCL        VAR(&MLD3)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&MLD4)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&SVAR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN12)   TYPE(*DEC)  LEN(1 0)
/*                                                                   */
             CHGVAR     VAR(%SST(&BIBL 4 3)) VALUE(&TFGR)
             CHGVAR     VAR(&TFIR) VALUE(&TFIRX)

/* Hente inn filgruppe / firma fra LDA                               */

             RTVDTAARA  DTAARA(*LDA (931 03)) RTNVAR(&FGRP)
             RTVDTAARA  DTAARA(*LDA (944 03)) RTNVAR(&FIRM)

/*           Overstyrer til-fil til til-bibliotek                    */

             OVRDBF     FILE(VAHGLU) TOFILE(&BIBL/VAHGLU)
             OVRDBF     FILE(VAUGLU) TOFILE(&BIBL/VAUGLU)
             OVRDBF     FILE(VEANLU) TOFILE(&BIBL/VEANLU)
             OVRDBF     FILE(VENHLU) TOFILE(&BIBL/VENHLU)
             OVRDBF     FILE(VETILU) TOFILE(&BIBL/VETILU)
             OVRDBF     FILE(VFASLU) TOFILE(&BIBL/VFASLU)
             OVRDBF     FILE(VHGRLU) TOFILE(&BIBL/VHGRLU)
             OVRDBF     FILE(VHISLU) TOFILE(&BIBL/VHISLU)
             OVRDBF     FILE(VINFLU) TOFILE(&BIBL/VINFLU)
             OVRDBF     FILE(VKHVLU) TOFILE(&BIBL/VKHVLU)
             OVRDBF     FILE(VLAGLU) TOFILE(&BIBL/VLAGLU)
             OVRDBF     FILE(VLTYLU) TOFILE(&BIBL/VLTYLU)
             OVRDBF     FILE(VLTPLU) TOFILE(&BIBL/VLTPLU)
             OVRDBF     FILE(VOGRLU) TOFILE(&BIBL/VOGRLU)
             OVRDBF     FILE(VOTYLU) TOFILE(&BIBL/VOTYLU)
             OVRDBF     FILE(VPARLU) TOFILE(&BIBL/VPARLU)
             OVRDBF     FILE(VPKOLU) TOFILE(&BIBL/VPKOLU)
             OVRDBF     FILE(VRGKLU) TOFILE(&BIBL/VRGKLU)
             OVRDBF     FILE(VRGRLU) TOFILE(&BIBL/VRGRLU)
             OVRDBF     FILE(VSDTLU) TOFILE(&BIBL/VSDTLU)
             OVRDBF     FILE(VSHELU) TOFILE(&BIBL/VSHELU)
             OVRDBF     FILE(VSOKLU) TOFILE(&BIBL/VSOKLU)
             OVRDBF     FILE(VTILLU) TOFILE(&BIBL/VTILLU)
             OVRDBF     FILE(VUGRLU) TOFILE(&BIBL/VUGRLU)
             OVRDBF     FILE(VVARLU) TOFILE(&BIBL/VVARLU)
             OVRDBF     FILE(VVASLU) TOFILE(&BIBL/VVASLU)
             OVRDBF     FILE(VVENLU) TOFILE(&BIBL/VVENLU)
             OVRDBF     FILE(VVPRLU) TOFILE(&BIBL/VVPRLU)
             OVRDBF     FILE(VVSOLU) TOFILE(&BIBL/VVSOLU)
             OVRDBF     FILE(VVTYLU) TOFILE(&BIBL/VVTYLU)
/*                                                                   */
             OVRDBF     FILE(VBLDLU) TOFILE(&BIBL/VBLDLU)
             OVRDBF     FILE(VVGKLU) TOFILE(&BIBL/VVGKLU)
             OVRDBF     FILE(VVEPLU) TOFILE(&BIBL/VVEPLU)
             OVRDBF     FILE(VSTRLU) TOFILE(&BIBL/VSTRLU)
             OVRDBF     FILE(VPHELU) TOFILE(&BIBL/VPHELU)
             OVRDBF     FILE(VPDTLU) TOFILE(&BIBL/VPDTLU)
/*                                                                   */
             CALL       PGM(FO405R) PARM(&TFIR)
/*                                                                   */
             OVRDBF     FILE(FDELLU) TOFILE(&BIBL/FDELLU)
             OVRDBF     FILE(FENKLU) TOFILE(&BIBL/FENKLU)
             OVRDBF     FILE(FFTXLU) TOFILE(&BIBL/FFTXLU)
             OVRDBF     FILE(FGEBLU) TOFILE(&BIBL/FGEBLU)
             OVRDBF     FILE(FJOBLU) TOFILE(&BIBL/FJOBLU)
             OVRDBF     FILE(FKDILU) TOFILE(&BIBL/FKDILU)
             OVRDBF     FILE(FKPRLU) TOFILE(&BIBL/FKPRLU)
             OVRDBF     FILE(FKPSLU) TOFILE(&BIBL/FKPSLU)
             OVRDBF     FILE(FLVALU) TOFILE(&BIBL/FLVALU)
             OVRDBF     FILE(FODTLU) TOFILE(&BIBL/FODTLU)
             OVRDBF     FILE(FOHELU) TOFILE(&BIBL/FOHELU)
             OVRDBF     FILE(FOTXLU) TOFILE(&BIBL/FOTXLU)
             OVRDBF     FILE(FPLLLU) TOFILE(&BIBL/FPLLLU)
             OVRDBF     FILE(FPLOLU) TOFILE(&BIBL/FPLOLU)
             OVRDBF     FILE(FPM1LU) TOFILE(&BIBL/FPM1LU)
             OVRDBF     FILE(FPM2LU) TOFILE(&BIBL/FPM2LU)
             OVRDBF     FILE(FPRCLU) TOFILE(&BIBL/FPRCLU)
             OVRDBF     FILE(FPRILU) TOFILE(&BIBL/FPRILU)
             OVRDBF     FILE(FPSOLU) TOFILE(&BIBL/FPSOLU)
             OVRDBF     FILE(FRABLU) TOFILE(&BIBL/FRABLU)
             OVRDBF     FILE(FSTSLU) TOFILE(&BIBL/FSTSLU)
             OVRDBF     FILE(FUSRLU) TOFILE(&BIBL/FUSRLU)
             OVRDBF     FILE(SODTLU) TOFILE(&BIBL/SODTLU)
             OVRDBF     FILE(SOHELU) TOFILE(&BIBL/SOHELU)
/*                                                                   */
             CALL       PGM(FO406R) PARM(&TFIR)
/*                                                                   */
 ENDPGM:     ENDPGM
