
             PGM        PARM(&AFIR &ADAT)

/* Definering av parametre                                           */

             DCL        VAR(&AFIR)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&ADAT)     TYPE(*CHAR) LEN(10)

/* Definering av variable                                            */

             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&LEVL)     VALUE('40')
             CHGVAR     VAR(&OKOK)     VALUE('  ')
             CALL       PGM(AA050C)    PARM(&LEVL &OKOK)
             IF         COND(&OKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(END)
             ENDDO

/* Kall av program som sletter poster i historisk fakturaregister    */

             CALL       PGM(FO441R) PARM(&AFIR &ADAT)

 END:        ENDPGM
