             PGM        parm(&ONUM &LPRO)
             DCL        VAR(&ONUM)     TYPE(*DEC) LEN(6)
             DCL        VAR(&LPRO)     TYPE(*CHAR) LEN(1)

/* Kaller tilbudsoppfølging */
             call       pgm(FO752R)

/* Kaller spørring ordre    */
             CALL       PGM(FO500R) PARM(&ONUM &LPRO)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
