             PGM        PARM(&ONUM_P)

             DCL        VAR(&ONUM_P)     TYPE(*DEC) LEN(8)
             DCL        VAR(&ONUM)     TYPE(*DEC) LEN(8)
             DCL        VAR(&LPRO)     TYPE(*CHAR) LEN(1)


             IF         COND(%ADDRESS(&ONUM_P) = *NULL) THEN(CHGVAR +
                          VAR(&ONUM) VALUE(0))
             ELSE       (CHGVAR VAR(&ONUM) VALUE(&ONUM_P) )


/*              CHGVAR     VAR(&ONUM) VALUE(0)                                */
             CHGVAR     VAR(&LPRO) VALUE(' ')
             CALL       PGM(FO500C) PARM(&ONUM &LPRO)

/* Slutt                                                             */
 ENDPGM:     ENDPGM


