             PGM
/*                                                                   */
             DCL        VAR(&AARR) TYPE(*DEC)  LEN(4)
             DCL        VAR(&PF03) TYPE(*DEC)  LEN(1)
             DCL        VAR(&A1FR) TYPE(*DEC)  LEN(6)
             DCL        VAR(&A1TI) TYPE(*DEC)  LEN(6)
/*                                                                   */
             CHGVAR     VAR(&PF03) VALUE(0)
/*                                                                   */
/* Kaller opp Parameter-program for utskrift                         */
/*                                                                   */
             CALL       PGM(fo560R) PARM(&AARR &A1FR +
                          &A1TI &pf03)
/*                                                                   */
/* Er det tatt F3 i parameter-bildet ?                               */
/*                                                                   */
             IF         COND(&PF03 *EQ 1) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/* Kaller opp Program for SOHEPF                                     */
/*                                                                   */
             CALL       PGM(fo561R) PARM(&AARR &A1FR &A1TI)
/*                                                                   */
ENDPGM:      ENDPGM
