             PGM        PARM(&FIRM &NUMM &SUFF &USER &FGRP)

             DCL        VAR(&FIRM)     TYPE(*DEC)  LEN(3 0)
/*6.nu*/     DCL        VAR(&NUMM)     TYPE(*DEC)  LEN(8 0)
             DCL        VAR(&SUFF)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&USER)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&FGRP)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&JAVA)     TYPE(*CHAR) LEN(1000)
             DCL        VAR(&FIRC)     TYPE(*CHAR) LEN(3)
/*6.nu*/     DCL        VAR(&NUMC)     TYPE(*CHAR) LEN(8)
             DCL        VAR(&SUFC)     TYPE(*CHAR) LEN(2)

             CHGVAR     VAR(&FIRC)     VALUE(&FIRM)
             CHGVAR     VAR(&NUMC)     VALUE(&NUMM)
             CHGVAR     VAR(&SUFC)     VALUE(&SUFF)

/* Kaller opp java-program                                           */

             CD         DIR('/java/asp/exceltilbud')
             CHGVAR     VAR(&JAVA) +
                          VALUE('/qopensys/QIBM/ProdData/JavaVM/jdk80/32bit/+
                          bin/java -jar +
                          /java/asp/exceltilbud/exceltilbud.jar -firmanr=' +
                          *TCAT &FIRC *BCAT '-ordrenr=' *TCAT &NUMC *BCAT +
                          '-suffix=' *TCAT &SUFC *BCAT '-bruker=' *TCAT +
                          &USER *BCAT '-filgruppe=ADB' *TCAT &FGRP)
             QSH        CMD(&JAVA)

             ENDPGM
