/*6.30*/     PGM        PARM(&FIRM &NUMM &SUFF &MEMB &USER &KOLI)

/* 300517 9.01 bsa Må håndtere  kollietiketter fra 2DP. Har ikke kontroll på */
/*                 hvilken suffix som blir generert.                         */
/*                                                                           */

             DCL        VAR(&KODE)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&ONOF)     TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&FIRM)     TYPE(*DEC)  LEN(3 0)
/*6.nu*/     DCL        VAR(&NUMM)     TYPE(*DEC)  LEN(8 0)
             DCL        VAR(&SUFF)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MEMB)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&USER)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&PROG)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&VLG1)     TYPE(*CHAR) LEN(01)
             DCL        VAR(&VLG2)     TYPE(*CHAR) LEN(01)
/*6.30*/     DCL        VAR(&KOLI)     TYPE(*CHAR) LEN(01)
/*6.30*/     DCL        VAR(&IN03)     TYPE(*CHAR) LEN(01)
/*6.30*/     DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(01)
/*6.30*/     DCL        VAR(&GSUF)     TYPE(*CHAR) LEN(02)
/*6.30*/     DCL        VAR(&NSUF)     TYPE(*DEC) LEN(2 0)

             DCL        VAR(&FILG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&CURL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QPGM) TYPE(*CHAR) LEN(10)
             RTVJOBA    CURLIB(&CURL)
             CHGVAR     VAR(&FILG) VALUE(%SST(&CURL 4 3))
             CHGVAR     VAR(&QPGM) VALUE('IQASP_' *TCAT &FILG *TCAT +
                          'Q')

             CALL       PGM(&QPGM) PARM(&USER)

             CHGDTAARA  DTAARA(*LDA (540 20)) +
                          VALUE('                    ')

             ADDPFM     FILE(FPSOPF)   MBR(&MEMB)
             ADDLFM     FILE(FPSOLU)   MBR(&MEMB) +
                          DTAMBRS((*CURRENT/FPSOPF (&MEMB)))
             ADDLFM     FILE(FPSOL1)   MBR(&MEMB) +
                          DTAMBRS((*CURRENT/FPSOPF (&MEMB)))

             OVRDBF     FILE(FPSOLU)   TOFILE(*FILE) MBR(&MEMB)
             OVRDBF     FILE(FPSOL1)   TOFILE(*FILE) MBR(&MEMB)

/* Kaller opp program                                                */

             CALL       PGM(FO619R) PARM(&FIRM &NUMM &SUFF)

/*6.30*/     RTVDTAARA  DTAARA(*LDA (538 02)) RTNVAR(&GSUF)
             RTVDTAARA  DTAARA(*LDA (540 01)) RTNVAR(&VLG1)
             RTVDTAARA  DTAARA(*LDA (541 01)) RTNVAR(&VLG2)
             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PROG)

/* Kaller opp program for utskrift   (Ikke Fakt/Kred)                */

             IF         COND(&VLG1 *EQ '1') THEN(DO)
             CALL       PGM(&PROG)     PARM(&MEMB)
             ENDDO

/* Kaller opp program for sletting av ordre etter utplukk/utskrift   */

             CALL       PGM(FO618R)

             DLTOVR     FILE(FPSOLU FPSOL1)

             RMVM       FILE(FPSOL1)   MBR(&MEMB)
             RMVM       FILE(FPSOLU)   MBR(&MEMB)
             RMVM       FILE(FPSOPF)   MBR(&MEMB)

/* Oppdater jobb-register med jobb-ferdig-flagg                      */

             CHGVAR     VAR(&KODE)     VALUE(01)
             CHGVAR     VAR(&ONOF)     VALUE(0)
             CALL       PGM(FA720R)    PARM(&KODE &ONOF)

/* Skal det skrives kollietiketter ??                                */

/*6.30*/     IF         COND(&KOLI *EQ '1') THEN(DO)
/*6.30*/     CHGVAR     VAR(&NSUF) VALUE(&GSUF)

/*6.30*/     call       pgm(ap600r) parm('FP27B' '0' '0' &in03 &btch)

/*6.30*/     CALL       PGM(FP271R)   PARM(&FIRM &NUMM &NSUF)
/*6.30*/     ENDDO

             ENDPGM
