             PGM        PARM(&PARM &MEMB)

/* 160614 bof : Enderet ihht. nummerutvidelse                   */
/*                                                              */

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(84)
             DCL        VAR(&MEMB)     TYPE(*CHAR) LEN(10)

/* Danner members for parameterfilene                                */

             ADDPFM     FILE(FPSOPF)   MBR(&MEMB)
             ADDLFM     FILE(FPSOLU)   MBR(&MEMB) +
                          DTAMBRS((*CURRENT/FPSOPF (&MEMB)))
             ADDLFM     FILE(FPSOL1) MBR(&MEMB) +
                          DTAMBRS((*CURRENT/FPSOPF (&MEMB)))

/* Override parameterfilene/membrene                                 */

             OVRDBF     FILE(FPSOLU)   TOFILE(*FILE) MBR(&MEMB)
             OVRDBF     FILE(FPSOL1)   TOFILE(*FILE) MBR(&MEMB)

/* Call til program for seleksjon                                    */

             CALL       PGM(FO634R)    PARM(&PARM)

/* Call til program for utskrift                                     */

             CALL       PGM(FO636C)    PARM(&PARM &MEMB)

/* Override av parametermembrene oppheves                            */

             DLTOVR     FILE(FPSOLU FPSOL1)

/* Parametermebrene slettes                                          */

             RMVM       FILE(FPSOL1)   MBR(&MEMB)
             RMVM       FILE(FPSOLU)   MBR(&MEMB)
             RMVM       FILE(FPSOPF)   MBR(&MEMB)

             ENDPGM
