             PGM        PARM(&PARM &MEMB)

/* 160614 bof : Enderet ihht. nummerutvidelse                   */
/*                                                              */

/* Initiering av parametere                                          */

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(84)
             DCL        VAR(&MEMB)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

/* Overstyring av file                                               */

             OVRDBF     FILE(FPSOL1)   TOFILE(*FILE) MBR(&MEMB)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('FO636P' &BTCH)

/* Kaller opp program for kontrolliste                               */

             CALL       PGM(FO636R)    PARM(&PARM)

             DLTOVR     FILE(FPSOL1)

             CALL       PGM(AP606C)    PARM('FO636P')
             ENDPGM
