             PGM        PARM(&PARM &MEMB)

/* Initiering av parametere                                          */

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(64)
             DCL        VAR(&MEMB)     TYPE(*CHAR) LEN(10)

             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

/* Overstyring av file                                               */

             OVRDBF     FILE(FPSOL1)   TOFILE(*FILE) MBR(&MEMB)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('FO647P' &BTCH)

/* Kaller opp program for kjøreliste - sammendrag                    */

             CALL       PGM(FO647R)    PARM(&PARM)

             DLTOVR     FILE(FPSOL1)

             CALL       PGM(AP606C)    PARM('FO647P')
             ENDPGM
