             PGM        PARM(&PARM &MEMB)

             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(64)
             DCL        VAR(&MEMB)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&VARI)     TYPE(*CHAR) LEN(1)

/* Danner members for parameterfilene                                */

             ADDPFM     FILE(FPSOPF) MBR(&MEMB)
             ADDLFM     FILE(FPSOLU) MBR(&MEMB) +
                          DTAMBRS((*CURRENT/FPSOPF (&MEMB)))
             ADDLFM     FILE(FPSOL1) MBR(&MEMB) +
                          DTAMBRS((*CURRENT/FPSOPF (&MEMB)))

/* Override parameterfilene/membrene                                 */

             OVRDBF     FILE(FPSOLU) TOFILE(*FILE) MBR(&MEMB)
             OVRDBF     FILE(FPSOL1) TOFILE(*FILE) MBR(&MEMB)

/* Call til program for seleksjon                                    */

             CALL       PGM(FO644R) PARM(&PARM)

/* Call til program for utskrift                                     */

             CHGVAR VAR(&VARI) VALUE(%SST(&PARM 35 1))

             IF         COND(&VARI *EQ '1') THEN(DO)
             CALL       PGM(FO646C) PARM(&PARM &MEMB)
             ENDDO

             IF         COND(&VARI *EQ '2') THEN(DO)
             CALL       PGM(FO647C) PARM(&PARM &MEMB)
             ENDDO

/* Override av parametermembrene oppheves                            */

             DLTOVR     FILE(FPSOLU FPSOL1)

/* Parametermebrene slettes                                          */

             RMVM       FILE(FPSOL1) MBR(&MEMB)
             RMVM       FILE(FPSOLU) MBR(&MEMB)
             RMVM       FILE(FPSOPF) MBR(&MEMB)

             ENDPGM
