             PGM        PARM(&PARM &MEMB &VLG1)

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(64)
             DCL        VAR(&MEMB)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&VLG1)     TYPE(*CHAR) LEN(1)

/* Kaller opp program for utskrift   (Direkte)                       */

             IF         COND(&VLG1 *NE '1') THEN(DO)
             CALL       PGM(FO644C) PARM(&PARM &MEMB)
             ENDDO

/* Kaller opp program for utskrift   (Via jobbkø)                    */

             IF         COND(&VLG1 *EQ '1') THEN(DO)
             SBMJOB     CMD(CALL PGM(FO644C) PARM(&PARM &MEMB)) +
                          JOB(KJOR_LISTE)
             ENDDO

             ENDPGM
