             PGM        PARM(&FIRM &NUMM &SUFF)

/* Initiering av parametere                                          */

             DCL        VAR(&FIRM)     TYPE(*DEC) LEN(3 0)
/*6.nu*/     DCL        VAR(&NUMM)     TYPE(*DEC) LEN(8 0)
             DCL        VAR(&SUFF)     TYPE(*DEC) LEN(2 0)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('FO657' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))


/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('FO657P' &BTCH)

/* Kaller opp program for kjøreliste - sammendrag                    */

             CALL       PGM(FO657R)    PARM(&FIRM &NUMM &SUFF)

             CALL       PGM(AP606C)    PARM('FO657P')
END:         ENDPGM
