             PGM        PARM(&FIRM &LAGE &KJOR &LDAT)

/* Initiering av parametere                                          */

             DCL        VAR(&FIRM)     TYPE(*DEC) LEN(3 0)
             DCL        VAR(&LAGE)     TYPE(*DEC) LEN(2 0)
             DCL        VAR(&KJOR)     TYPE(*DEC) LEN(2 0)
             DCL        VAR(&LDAT)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('FO658' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('FO658P' &BTCH)

/* Kaller opp program for kontrolliste                               */

             CALL       PGM(FO658R)    PARM(&FIRM &LAGE &KJOR &LDAT)

             CALL       PGM(AP606C)    PARM('FO658P')
END:         ENDPGM
