             PGM        PARM(&VALG &PARM)

             DCL        VAR(&VALG)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&PROG)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(35)

/*6.nu*/     CHGVAR VAR(&PROG) VALUE(%SST(&PARM 23 10))

/* Kaller opp program for utskrift   (Direkte)                       */

             IF         COND(&VALG *NE '1') THEN(DO)
             CALL       PGM(&PROG) PARM(&PARM)
             ENDDO

/* Kaller opp program for utskrift   (Via jobbkø)                    */

             IF         COND(&VALG *EQ '1') THEN(DO)
             SBMJOB     CMD(CALL PGM(&PROG) PARM(&PARM )) +
                          JOB(FAKT_KRED)
             ENDDO

             ENDPGM
