             PGM        PARM(&PARM)

/* Definering av parametere                                          */

/*6.nu*/     DCL        VAR(&PARM)     TYPE(*CHAR) LEN(33)

/* Definering av variable                                            */

             DCL        VAR(&IN03)     TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

/* Program for utskriftsparametre.                                   */

             CALL       PGM(AP600R) PARM('FO684' '0' '0' &IN03 &BTCH)

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP601C)    PARM('FO684P' &BTCH)


/* Program for faktura-journal kort/purchasing                       */

             CALL       PGM(FO684R)    PARM(&PARM)

             CALL       PGM(AP606C)    PARM('FO684P')
             ENDPGM
