             PGM

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(34)
             DCL        VAR(&IN03)     TYPE(*DEC)  LEN(1)
             DCL        VAR(&RUTI)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&PROG)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&IN03)     VALUE(0)

/* Parameter-program for utskrift  (Fakt/Kred)                       */

             CALL       PGM(FO682R)    PARM(&PARM &IN03)

/* Er det tatt F3 i parameter-bildet ?                               */

             IF         COND(&IN03 *EQ 1) THEN(GOTO CMDLBL(ENDPGM))

/* Kaller opp AP600R                                                 */

             RTVDTAARA  DTAARA(*LDA (800 10)) RTNVAR(&RUTI)
             CALL       PGM(AP600R) PARM(&RUTI '0' '0' &IN03 &BTCH)
             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PROG)

/* Kaller opp Program for utskrift  (Fakt/Kred)                      */

             CALL       PGM(&PROG)     PARM(&PARM)

ENDPGM:      ENDPGM
