             PGM        PARM(&FPPARM &FPMEBR &FPVLG1)

             DCL        VAR(&FPPARM) TYPE(*CHAR) LEN(64)
             DCL        VAR(&FPMEBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FPVLG1) TYPE(*CHAR) LEN(1)

             IF         COND(&FPVLG1 *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(FO697C) PARM(&FPPARM &FPMEBR)) +
                          JOB(PLAN_LISTE))

             IF         COND(&FPVLG1 *NE '1') THEN(CALL PGM(FO697C) +
                          PARM(&FPPARM &FPMEBR))

             ENDPGM
