             PGM        PARM(&PARM &MEMB)

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(64)
             DCL        VAR(&MEMB)     TYPE(*CHAR) LEN(10)

             ADDPFM     FILE(FPSOPF)   MBR(&MEMB)
             ADDLFM     FILE(FPSOLU)   MBR(&MEMB) +
                          DTAMBRS((*CURRENT/FPSOPF (&MEMB)))
             ADDLFM     FILE(FPSOL1) MBR(&MEMB) +
                          DTAMBRS((*CURRENT/FPSOPF (&MEMB)))

             OVRDBF     FILE(FPSOLU) TOFILE(*FILE) MBR(&MEMB)
             OVRDBF     FILE(FPSOL1) TOFILE(*FILE) MBR(&MEMB)

             CALL       PGM(FO697R)    PARM(&PARM)
             CALL       PGM(FO698C)    PARM(&PARM &MEMB)

             DLTOVR     FILE(FPSOLU FPSOL1)

             RMVM       FILE(FPSOL1)   MBR(&MEMB)
             RMVM       FILE(FPSOLU)   MBR(&MEMB)
             RMVM       FILE(FPSOPF)   MBR(&MEMB)

             ENDPGM
