             PGM        PARM(&PARM)

/* Definering av parametere                                          */

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(64)

/* Definering av variable                                            */

             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&SBIB)     TYPE(*CHAR) LEN(10)

/* Henter inn bibliotek                                              */

             RTVDTAARA  DTAARA(*LDA (934 10)) RTNVAR(&SBIB)

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP601C)    PARM('FO693P' &BTCH)

/* Kaller opp program                                                */

             CALL       PGM(FO693R)    PARM(&PARM)

             CALL       PGM(AP606C)    PARM('FO693P')
             ENDPGM
