             PGM        PARM(&PARM &MEMB)

/* Definering av parametere                                          */

             DCL        VAR(&PARM)   TYPE(*CHAR) LEN(64)
             DCL        VAR(&MEMB)   TYPE(*CHAR) LEN(10)

/* Definering av variable                                            */

             DCL        VAR(&BTCH)   TYPE(*CHAR) LEN(1)

/* Overstyring av file                                               */

             OVRDBF     FILE(FPSOL1) TOFILE(*FILE) MBR(&MEMB)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('FO698P' &BTCH)

/* Kaller opp program                                                */

             CALL       PGM(FO698R)    PARM(&PARM)

             DLTOVR     FILE(FPSOL1)

             CALL       PGM(AP606C)    PARM('FO698P')
             ENDPGM
