             PGM        PARM(&FIRM &VARE)

             DCL        VAR(&FIRM)     TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&VARE)     TYPE(*CHAR) LEN(15)
             DCL        VAR(&MELD)     TYPE(*CHAR) LEN(50)

/* Initierer melding                                                 */

             CHGVAR     VAR(&MELD)     VALUE('Program for +
                          produktinformasjon ble ikke funnet..')

/* Kaller program i ASLVAR                                           */

             CALL       PGM(JU510R)    PARM(&FIRM &VARE)

/* Varsle dersom program ikke ble funnet                             */

             MONMSG     MSGID(CPF0001) EXEC(DO)
             CALL       PGM(AA005R) PARM(&MELD)
             GOTO       CMDLBL(END)
             ENDDO

 END:        ENDPGM
