             PGM        PARM(&FIRM &KUND &KPRO &LETY)

             DCL        VAR(&FIRM)     TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&KUND)     TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&KPRO)     TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&LETY)     TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&MELD)     TYPE(*CHAR) LEN(50)

             CHGVAR     VAR(&MELD) VALUE('Program for overgang til +
                          LVR ble ikke funnet...')

             CALL       PGM(JV170R)    PARM(&FIRM &KUND &KPRO &LETY)
             MONMSG     MSGID(CPF0001) EXEC(DO)

/* Varsle når program for lokalt varegister ikke ble funnet          */

             CALL       PGM(AA005R)    PARM(&MELD)
             GOTO       CMDLBL(END)
             ENDDO

 END:        ENDPGM
