             PGM        PARM(&FIRM &MODN &MTE1)

             DCL        VAR(&FIRM)     TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&MODN)     TYPE(*DEC)  LEN(8 0)
             DCL        VAR(&MTE1)     TYPE(*CHAR) LEN(35)
             DCL        VAR(&MELD)     TYPE(*CHAR) LEN(50)

/* Kaller program i lokalt vareregister                              */

             CHGVAR     VAR(&MELD)     VALUE('Program for +
                        spørring på modul i LVR ble ikke funnet...')

             CALL       PGM(JU500R)    PARM(&FIRM &MODN &MTE1)

/* Melding dersom program ikke ble funnet                            */

             MONMSG     MSGID(CPF0001) EXEC(DO)
             CALL       PGM(AA005R) PARM(&MELD)
             GOTO       CMDLBL(END)
             ENDDO

 END:        ENDPGM
