             PGM        PARM(&FIRM &NOBB &EKOD)

             DCL        VAR(&FIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&NOBB) TYPE(*DEC)  LEN(8 0)
             DCL        VAR(&EKOD) TYPE(*CHAR) LEN(3)

/* Blanker retur-variabel                                            */

             CHGVAR     VAR(&EKOD) VALUE('   ')

/* Kaller program i lokalt NOBBregister                              */

             CALL       PGM(JW701R) PARM(&FIRM &NOBB &EKOD)
             MONMSG     MSGID(CPF0001)

 END:        ENDPGM
