             PGM        PARM(&FIRM &VARE_GML &VARE_NY)

             DCL        VAR(&FIRM)     TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&VARE_GML) TYPE(*CHAR) LEN(15)
             DCL        VAR(&VARE_NY)  TYPE(*CHAR) LEN(15)

/* Blanker retur-variabel                                            */

             CHGVAR     VAR(&VARE_NY)  VALUE('               ')

/* Kaller program i lokalt vareregister                              */

             CALL       PGM(JO761R) PARM(&FIRM &VARE_GML &VARE_NY)
             MONMSG     MSGID(CPF0001)

 END:        ENDPGM
