             PGM        PARM(&KUND &NUMM &SUFF &VALG)
             DCL        VAR(&MELD)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&KUND)     TYPE(*DEC)  LEN(6 0)
/*6.nu*/     DCL        VAR(&NUMM)     TYPE(*DEC)  LEN(8 0)
             DCL        VAR(&SUFF)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&VALG)     TYPE(*DEC)  LEN(2 0)

             CHGVAR     VAR(&MELD)     VALUE('Program for søk mot +
                        bestilling  ble ikke funnet...')

/* Varsle når program for bestilling ikke ble funnet                 */

             MONMSG     MSGID(CPF0001) EXEC(DO)
             CALL       PGM(AA005R)    PARM(&MELD)
             GOTO       CMDLBL(END)
             ENDDO

/* Kalle program for bestilling (Varelinjer)                         */

             IF         COND(&VALG *EQ 26)  THEN(DO)
             CALL       PGM(LD511R)    PARM(&KUND &NUMM &SUFF)
             ENDDO

/* Kalle program for bestilling (Datokontroll)                       */

             IF         COND(&VALG *EQ 27)  THEN(DO)
             CALL       PGM(LD512R)    PARM(&KUND &NUMM &SUFF)
             ENDDO

 END:        ENDPGM
