             PGM        PARM(&FIRM &VARG &VARN &INLR)

             DCL        VAR(&FIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&VARG) TYPE(*CHAR) LEN(15)
             DCL        VAR(&VARN) TYPE(*CHAR) LEN(15)
             DCL        VAR(&INLR) TYPE(*CHAR) LEN(1)

/* Kalle program for bytting av varenummer i LAGR                    */

             CALL       PGM(VL740R) PARM(&FIRM &VARG &VARN &INLR)
             MONMSG     MSGID(CPF0001)

 END:        ENDPGM
