             PGM

             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)

             CALL       PGM(FO762R)

             CHGVAR     VAR(&WALI) VALUE(14)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Rutinen er ferdig          ')
             CHGVAR     VAR(&MLD2) VALUE('                           ' )
             CALL       PGM(AA011C)  PARM(&WALI &WAPO &MLD1 &MLD2)

             ENDPGM
