             PGM        PARM(&mappf)

/* Initiering av parametre.                                          */
/* Denne skal ligge på kundens kundetilpasningsbibl. -               */
/* Med riktig versjon av aspgpl610                                   */

             DCL        VAR(&OVRF) TYPE(*CHAR) LEN(10) +
                          VALUE('BYGGDOK   ')
             DCL        VAR(&FILN)  TYPE(*CHAR) LEN(20)
             DCL        VAR(&STAT)  TYPE(*CHAR) LEN(1) value(' ')
             DCL        VAR(&SMSG)  TYPE(*CHAR) LEN(1) VALUE('0')
             DCL        VAR(&mappf) TYPE(*CHAR) LEN(25)


/* Henter meldinger via FTP fra IBM                                  */

             CALL       PGM(*LIBL/AF700C) PARM(&OVRF &STAT &FILN &SMSG)

/* Slett filer fra IFS området                                       */

             IF         COND(&STAT *EQ ' ') THEN(DO)
             DEL        OBJLNK(&mappf)
             ENDDO

             ENDPGM
