             PGM        PARM(&MEMB)

/* Definering av parametere og variable                              */

             DCL        VAR(&MEMB)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

/* Overstyring av fil                                                */

             OVRDBF     FILE(FPSOL1)   TOFILE(*FILE) MBR(&MEMB)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('FO825P' &BTCH)

/* Kaller opp program                                                */

             CALL       PGM(FO825R)

             DLTOVR     FILE(FPSOL1)

             CALL       PGM(AP606C)    PARM('FO825P')
             ENDPGM
