             PGM        PARM(&PARM)

/* Initiering av parametere                                          */

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(30)

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BGIR)     TYPE(*CHAR) LEN(1)

/* Henter verdier i fra LDA.                                         */

             RTVDTAARA  DTAARA(*LDA (881 1))  RTNVAR(&BGIR)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP602C)    PARM('FO945P' &BTCH)

/* Kaller opp program for faktura                                    */

             CALL       PGM(FO945R)    PARM(&PARM)
             CALL       PGM(AP606C)    PARM('FO945P')

/* Separat bankgiro ?                                                */

             IF         COND(&BGIR *EQ '1') THEN(DO)
             CALL       PGM(FO950C)    PARM(&PARM)
             ENDDO

 END:        ENDPGM
