             PGM        PARM(&PARM)

/* Initiering av parametere                                          */

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(30)

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('FO950' '0' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP602C)    PARM('FO950P' &BTCH)

/* Kaller opp program for separat bankgiro                           */

             CALL       PGM(FO950R)    PARM(&PARM)

             CALL       PGM(AP606C)    PARM('FO950P')
 END:        ENDPGM
