             PGM

/**************************************************************************/
/* K000 7.01 200520 bsa Fjernet infobilder, da dette bare skaper støy     */
/*                                                                        */
/*                                                                        */
/**************************************************************************/

             DCL        VAR(&RUTI) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PROG) TYPE(*CHAR) LEN(10)
             DCL        VAR(&RAPP) TYPE(*CHAR) LEN(10) VALUE('PRINTER   ')
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)

             RTVDTAARA  DTAARA(*LDA (911 10)) RTNVAR(&USER)

/* Hent standardverdier                                              */

             CALL       PGM(FP205R)

             RTVDTAARA  DTAARA(*LDA (800 10)) RTNVAR(&RUTI)

/*           Sjekk parameterregister                                 */

             CHKOBJ     OBJ(VPARPF) OBJTYPE(*FILE) MBR(&USER)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(VPARPF) MBR(&USER) TEXT('Parameter til +
                          FP212R')
             ENDDO

             CLRPFM     FILE(VPARPF) MBR(&USER)

/*           Sjekk arbeidsregister                                   */

             CHKOBJ     OBJ(VAW1PF) OBJTYPE(*FILE) MBR(&USER)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(VAW1PF) MBR(&USER) TEXT('Varer til +
                          FP212R')
             ENDDO

             CLRPFM     FILE(VAW1PF) MBR(&USER)

/*********************************************************************/
/*                                                                   */
/* Call av parameterprogram                                          */
/*                                                                   */
             OVRDBF     FILE(PARAM) TOFILE(VPARPF) MBR(&USER)
             CALL       PGM(FP210R) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Oppdaterer LDA med programnavn                                    */

             RTVDTAARA  DTAARA(*LDA (800 10)) RTNVAR(&RUTI)

/* Call av program for formularparametre.                            */


             CALL       PGM(AP600R) PARM(&RUTI '1' '0' &IN03 &BTCH)

/* Avslutt dersom F3/F12                                             */

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             CALL       PGM(FP207R)

             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PROG)

/* Varselbilde 1                                                     */

/* 7.01                                                                  */
/*           IF         COND(&BTCH *NE '1') THEN(DO)                     */
/*           CHGVAR     VAR(&WALI) VALUE(4)                              */
/*           CHGVAR     VAR(&WAPO) VALUE(40)                             */
/*           CHGVAR     VAR(&MLD1) VALUE('Utskrift av etiketter     ')   */
/*           CHGVAR     VAR(&MLD2) VALUE('***      ASOFAK       *** ')   */
/*           CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)       */
/*           ENDDO                                                       */

/* Call av utskriftsprogram til batch/demand                         */

/*           IF         COND(&BTCH *EQ '1') THEN(DO)        */
/*           SBMJOB     CMD(CALL PGM(FP212C)) JOB(&PROG)    */
/*           GOTO       CMDLBL(ENDPGM)                      */
/*           ENDDO                                          */

             CALL       PGM(FP212C)

             RMVM       FILE(VPARPF) MBR(&USER)
             RMVM       FILE(VAW1PF) MBR(&USER)

 ENDPGM:     ENDPGM
