             PGM

/**************************************************************************/
/* K000 7.01 200520 bsa Fjernet infobilder, da dette bare skaper støy     */
/*                                                                        */
/*                                                                        */
/**************************************************************************/

/* Initiering av parametre.                                          */


             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&RUTI)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&PROG)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&USER)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&WSID)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&OUTQ)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&FORM)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&HLDQ)     TYPE(*CHAR) LEN(4)
             DCL        VAR(&SAVE)     TYPE(*CHAR) LEN(4)
             DCL        VAR(&AKOPX)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&AKOP)     TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&TYPEX)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)     TYPE(*DEC) LEN(1 0)

             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)

             RTVDTAARA  DTAARA(*LDA (800 10)) RTNVAR(&RUTI)
             RTVDTAARA  DTAARA(*LDA (863 1))  RTNVAR(&BTCH)
             RTVDTAARA  DTAARA(*LDA (911 10)) RTNVAR(&USER)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)

/* Varselbilde 2                                                      */
/* 7.01                                                               */
/*           IF         COND(&BTCH *NE '1') THEN(DO)                  */
/*           CHGVAR     VAR(&WALI) VALUE(6)                           */
/*           CHGVAR     VAR(&WAPO) VALUE(38)                          */
/*           CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt .....') */
/*           CHGVAR     VAR(&MLD2) VALUE('Utplukk pågår ..........')  */
/*           CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)    */
/*           ENDDO                                                    */

/* Call av program, utplukk fra vareregister                         */

             OVRDBF     FILE(PARAM) TOFILE(VPARPF) MBR(&USER)
             OVRDBF     FILE(ETIKETT) TOFILE(VAW1PF) MBR(&USER)

             CALL       PGM(FP212R)

/* Varselbilde 3                                                     */
/*  7.01                                                               */
/*           IF         COND(&BTCH *NE '1') THEN(DO)                   */
/*           CHGVAR     VAR(&WALI) VALUE(8)                            */
/*           CHGVAR     VAR(&WAPO) VALUE(36)                           */
/*           CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt .....')  */
/*           CHGVAR     VAR(&MLD2) VALUE('Utskrift pågår ..........')  */
/*           CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)     */
/*           ENDDO                                                     */

/* Call av program for utskrift av etiketter                         */


             RTVDTAARA  DTAARA(*LDA (745 4))  RTNVAR(&SAVE)
             RTVDTAARA  DTAARA(*LDA (810 10)) RTNVAR(&OUTQ)
             RTVDTAARA  DTAARA(*LDA (820 10)) RTNVAR(&FORM)
             RTVDTAARA  DTAARA(*LDA (834 4))  RTNVAR(&HLDQ)
             RTVDTAARA  DTAARA(*LDA (838 6))  RTNVAR(&AKOPX)
             CHGVAR     VAR(&AKOP) VALUE(&AKOPX)

             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PROG)
             RTVDTAARA  DTAARA(*LDA (891 1)) RTNVAR(&TYPEX)
             CHGVAR     VAR(&TYPE) VALUE(&TYPEX)

             OVRDBF     FILE(VAW1PF) TOFILE(VAW1PF) MBR(&USER)

             IF         COND(&PROG *NE 'FP221R') THEN(DO)
             OVRPRTF    FILE(ETIKETT) TOFILE(QSYSPRT) DEV(&OUTQ) +
                          OUTQ(&OUTQ) FORMTYPE(&FORM) COPIES(&AKOP) +
                          HOLD(&HLDQ) SAVE(&SAVE)
             CALL       PGM(&PROG)
             ENDDO

             IF         COND(&PROG *EQ 'FP221R') THEN(DO)
             CALL       PGM(AP601C)    PARM('FP221P' &BTCH)
             CALL       PGM(FP221R)
             CALL       PGM(AP606C)    PARM('FP221P')
             ENDDO

             CLRPFM     FILE(VPARPF) MBR(&USER)
             CLRPFM     FILE(VAW1PF) MBR(&USER)

 END:        ENDPGM
