             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&DSRUTI)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DSPROG)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DSOUTQ)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DSFORM)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DSACPIX)  TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSACPI)   TYPE(*DEC)  LEN(4 0)
             DCL        VAR(&DSHLDQ)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSAKOPX)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSAKOP)   TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&DSOVRS)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSRAPP)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DSUSER)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DSALINX)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&DSALIN)   TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&DSPRTY)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSOFLW)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&DSBTCH)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSMEMBX)  TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSMEMB)   TYPE(*DEC)  LEN(5 0)
             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)

/* Henter verdier i fra LDA.                                         */

             RTVDTAARA  DTAARA(*LDA (800 10)) RTNVAR(&DSRUTI)
             RTVDTAARA  DTAARA(*LDA (810 10)) RTNVAR(&DSOUTQ)
             RTVDTAARA  DTAARA(*LDA (820 10)) RTNVAR(&DSFORM)
             RTVDTAARA  DTAARA(*LDA (830 4))  RTNVAR(&DSACPIX)
             RTVDTAARA  DTAARA(*LDA (834 4))  RTNVAR(&DSHLDQ)
             RTVDTAARA  DTAARA(*LDA (838 6))  RTNVAR(&DSAKOPX)
             RTVDTAARA  DTAARA(*LDA (845 1))  RTNVAR(&DSOVRS)
             RTVDTAARA  DTAARA(*LDA (846 10)) RTNVAR(&DSRAPP)
             RTVDTAARA  DTAARA(*LDA (856 3))  RTNVAR(&DSALINX)
             RTVDTAARA  DTAARA(*LDA (859 1))  RTNVAR(&DSPRTY)
             RTVDTAARA  DTAARA(*LDA (860 3))  RTNVAR(&DSOFLW)
             RTVDTAARA  DTAARA(*LDA (863 1))  RTNVAR(&DSBTCH)
             RTVDTAARA  DTAARA(*LDA (864 5))  RTNVAR(&DSMEMBX)
             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&DSPROG)
             RTVDTAARA  DTAARA(*LDA (911 10)) RTNVAR(&DSUSER)

             CHGVAR     VAR(&DSAKOP) VALUE(&DSAKOPX)
             CHGVAR     VAR(&DSACPI) VALUE(&DSACPIX)
             CHGVAR     VAR(&DSALIN) VALUE(&DSALINX)
             CHGVAR     VAR(&DSMEMB) VALUE(&DSMEMBX)

/* Varselbilde 2                                                     */

             IF         COND(&DSBTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(8)
             CHGVAR     VAR(&WAPO) VALUE(36)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt .....')
             CHGVAR     VAR(&MLD2) VALUE('Utskrift pågår ..........')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Call av program for utskrift av etiketter                         */

             OVRPRTF    FILE(ETIKETT) TOFILE(QSYSPRT) DEV(&DSOUTQ) +
                          PAGESIZE(&DSALIN 128) CPI(10) +
                          OVRFLW(&DSOFLW) OUTQ(&DSOUTQ) +
                          FORMTYPE(&DSFORM) COPIES(&DSAKOP) +
                          HOLD(&DSHLDQ) OUTPTY(&DSPRTY)

             OVRDBF     FILE(VPARPF) TOFILE(VPARPF) MBR(&DSUSER)

/*           CALL       PGM(&DSPROG)                               */
             CALL       PGM(FP228R)

             CLRPFM     FILE(VPARPF) MBR(&DSUSER)

 END:        ENDPGM
