             PGM        PARM(&PAR1 &TYPE &PRIS &PDAT &STAT)
/*********************************************************************/
/* Initiering av parametre.                                          */
/* 220617  bsa Utvider med dato i parameterlista + pristype 3        */

             DCL        VAR(&RUTI) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PROG) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PAR1) TYPE(*CHAR) LEN(15)
             DCL        VAR(&TYPE) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&PRIS) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&STAT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VARE) TYPE(*CHAR) LEN(15)
             DCL        VAR(&VSTA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WSID)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&OUTQ)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&FORM)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&HLDQ)     TYPE(*CHAR) LEN(4)
             DCL        VAR(&AKOPX)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&AKOP)     TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&TYPEX)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&PDAT) TYPE(*CHAR) LEN(8)

/* Avslutt                                                          */

             RTVDTAARA  DTAARA(*LDA (911 10)) RTNVAR(&USER)

/* Hent standardverdier                                             */

             CALL       PGM(FP205R)

             RTVDTAARA  DTAARA(*LDA (800 10)) RTNVAR(&RUTI)

/*           CALL       PGM(AP600R) PARM(&RUTI '0' '0' &IN03 &BTCH)  */

/*           Sjekk parameterregister                                 */

             CHKOBJ     OBJ(VPARPF) OBJTYPE(*FILE) MBR(&USER)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(VPARPF) MBR(&USER) TEXT('Parameter til +
                          FP212R')
             ENDDO

             CLRPFM     FILE(VPARPF) MBR(&USER)

/*           Sjekk arbeidsregister                                   */

             CHKOBJ     OBJ(VAW1PF) OBJTYPE(*FILE) MBR(&USER)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(VAW1PF) MBR(&USER) TEXT('Varer til +
                          FP212R')
             ENDDO

             CLRPFM     FILE(VAW1PF) MBR(&USER)

/*********************************************************************/
/*                                                                   */
/* Call av parameterprogram                                          */
/*                                                                   */
             OVRDBF     FILE(PARAM) TOFILE(VPARPF) MBR(&USER)
             CALL       PGM(FP256R) PARM(&PAR1 &TYPE &PRIS &pdat)

/*           IF         COND(&IN03 *EQ '1') THEN(DO)                 */
/*           GOTO       CMDLBL(ENDPGM)                               */
/*           ENDDO                                                   */

/* Oppdaterer LDA med programnavn                                    */

             RTVDTAARA  DTAARA(*LDA (800 10)) RTNVAR(&RUTI)

/* Call av program for formularparametre.                            */

             CALL       PGM(AP600R) PARM(&RUTI '0' '0' &IN03 &BTCH)

/* Avslutt dersom F3/F12                                             */

/*           IF         COND(&IN03 *EQ '1') THEN(DO)                  */
/*           GOTO       CMDLBL(ENDPGM)                                */
/*           ENDDO                                                    */

             CALL       PGM(FP207R)

             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PROG)

/* Call av utskriftsprogram. Flyttet ut fra FP252C og hit           */

/*           CALL       PGM(FP252C)                                 */
/* Koden som følger er samme som i FP252C                           */
/*           DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)           */
/*           DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)           */
/*           DCL        VAR(&RUTI)     TYPE(*CHAR) LEN(10)          */
/*           DCL        VAR(&PROG)     TYPE(*CHAR) LEN(10)          */
/*           DCL        VAR(&USER)     TYPE(*CHAR) LEN(10)          */
/*           DCL        VAR(&WSID)     TYPE(*CHAR) LEN(10)          */
/*           DCL        VAR(&OUTQ)     TYPE(*CHAR) LEN(10)          */
/*           DCL        VAR(&FORM)     TYPE(*CHAR) LEN(10)          */
/*           DCL        VAR(&HLDQ)     TYPE(*CHAR) LEN(4)           */
/*           DCL        VAR(&AKOPX)    TYPE(*CHAR) LEN(6)           */
/*           DCL        VAR(&AKOP)     TYPE(*DEC)  LEN(6 0)         */
/*           DCL        VAR(&TYPEX)    TYPE(*CHAR) LEN(1)           */
/*           DCL        VAR(&TYPE)     TYPE(*DEC) LEN(1 0)          */

/*           DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)             */
/*           DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)             */

             RTVDTAARA  DTAARA(*LDA (800 10)) RTNVAR(&RUTI)
             RTVDTAARA  DTAARA(*LDA (863 1))  RTNVAR(&BTCH)
             RTVDTAARA  DTAARA(*LDA (911 10)) RTNVAR(&USER)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)

/* Call av program, utplukk fra vareregister                         */

             OVRDBF     FILE(PARAM) TOFILE(VPARPF) MBR(&USER)
             OVRDBF     FILE(ETIKETT) TOFILE(VAW1PF) MBR(&USER)

/*           CALL       PGM(FP252R)                              */
             CALL       PGM(FP253R)

/* Call av program for utskrift av etiketter                         */

             RTVDTAARA  DTAARA(*LDA (810 10)) RTNVAR(&OUTQ)
             RTVDTAARA  DTAARA(*LDA (820 10)) RTNVAR(&FORM)
             RTVDTAARA  DTAARA(*LDA (834 4))  RTNVAR(&HLDQ)
             RTVDTAARA  DTAARA(*LDA (838 6))  RTNVAR(&AKOPX)
             CHGVAR     VAR(&AKOP) VALUE(&AKOPX)

             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PROG)
             RTVDTAARA  DTAARA(*LDA (891 1)) RTNVAR(&TYPEX)
             CHGVAR     VAR(&TYPE) VALUE(&TYPEX)

             OVRDBF     FILE(VAW1PF) TOFILE(VAW1PF) MBR(&USER)
             OVRPRTF    FILE(ETIKETT) TOFILE(QSYSPRT) DEV(&OUTQ) +
                          OUTQ(&OUTQ) FORMTYPE(&FORM) COPIES(&AKOP) +
                          HOLD(&HLDQ)

             CALL       PGM(&PROG)

  /*         CLRPFM     FILE(VPARPF) MBR(&USER)        */
  /*         CLRPFM     FILE(VAW1PF) MBR(&USER)        */

             CHGVAR     VAR(&STAT) VALUE('1')

 ENDPGM:     ENDPGM
