             PGM

/* Initiering av parametere                                          */

             DCL        VAR(&LAGR)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&ALLE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&MAPP)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&MEMB) TYPE(*CHAR) LEN(10) +
                          VALUE('AUTOHYLLE')
             DCL        VAR(&OVRF) TYPE(*CHAR) LEN(10) +
                          VALUE('SESESLSJEK')
             DCL        VAR(&FNA1)  TYPE(*CHAR) LEN(20)
             DCL        VAR(&FNA2)  TYPE(*CHAR) LEN(20)
             DCL        VAR(&TOFI)  TYPE(*CHAR) LEN(35)
             DCL        VAR(&STAT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&SMSG)  TYPE(*CHAR) LEN(1) VALUE('1')


/* Starter FTP overføring til ESL server                             */

 FTP:        CALL       PGM(AF700C) PARM(&OVRF &STAT &FNA1 &SMSG)
             GOTO       CMDLBL(END)


 END:

             ENDPGM
