             PGM

/* Initiering av parametere                                          */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&LAGR)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&etik)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&fide)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&ovfa)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&filg)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&firm)     TYPE(*dec)  LEN(3 0)
             DCL        VAR(&ALLE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&MAPP)     TYPE(*CHAR) LEN(10)
/*7.01*/     dcl        var(&full)     type(*dec) len(1 0)
             DCL        VAR(&W_MODU)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&W_DISP)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&W_STAT)   TYPE(*CHAR) LEN(1)

/* Sjekker om gyldig tilgang                                         */

             CHGVAR     VAR(&W_MODU) VALUE('ELHY      ')
             CHGVAR     VAR(&W_DISP) VALUE('1')
             CALL       PGM(AX700R) PARM(&W_MODU &W_DISP &W_STAT)
             IF         COND(&W_STAT *EQ '1') THEN(DO)
                GOTO       CMDLBL(END)
             ENDDO

 START:      CALL       PGM(FP260R) PARM(&IN03 &etik &fide &ovfa &filg +
/*7.01*/                                 &firm &lagr &ALLE &MAPP &full)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Call av utplukksprogram                                           */

/*7.01*/     CALL PGM(FP261C) PARM(&etik &fide &ovfa &filg &firm &lagr +
/*7.01*/                           &alle &mapp &full)
             GOTO CMDLBL(START)

 END:        ENDPGM
