             pgm        parm()

             DCL        VAR(&ONUM) TYPE(*DEC) LEN(8) /*9.01*/
             DCL        VAR(&OSUF) TYPE(*DEC) LEN(2) /*9.01*/

             CHGVAR     VAR(&ONUM) VALUE(0)
             CHGVAR     VAR(&OSUF) VALUE(0)
             CALL       PGM(FP270R) PARM(&ONUM &OSUF)


end:         ENDPGM
