             PGM        PARM(&FILE &FLDR)

/* Spesialprogram utviklet for Skattum                               */

/* Initiering av parametre.                                          */

             DCL        VAR(&FILE)     TYPE(*CHAR) LEN(12)
             DCL        VAR(&FLDR)     TYPE(*CHAR) LEN(20)

             DCL        VAR(&FEIL)     TYPE(*CHAR) LEN(1)

             MONMSG     MSGID(CPF8A00) EXEC(GOTO CMDLBL(FEIL))
             MONMSG     MSGID(IWS1611) EXEC(GOTO CMDLBL(FEIL))

/* Kaller program for henting av innlesingsfil                       */

             CALL       PGM(FP750C) PARM(&FLDR &FILE &FEIL)
             IF         COND(&FEIL *EQ '1') THEN(GOTO CMDLBL(FEIL))

/* Kaller innlesingsprogram                                          */

             CALL       PGM(FP760R)

 FEIL:       CHGVAR     VAR(&FEIL) VALUE('1')

 END:        ENDPGM
