             PGM        PARM(&SJEK &OUTQ)

             DCL        VAR(&SJEK)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&OUTQ)     TYPE(*CHAR) LEN(10)

/* Hent inn attributter fra                                          */

             RTVOBJD    OBJ(&OUTQ) OBJTYPE(*OUTQ)
             MONMSG     MSGID(CPF0000) EXEC(GOTO FEIL)

/* Utkø funnet, avslutt                                              */

             GOTO       CMDLBL(ENDPGM)

/* Legger inn kode for at dette ikke er lovlig utkø                  */

 FEIL:       CHGVAR     VAR(&SJEK) VALUE('1')

 ENDPGM:     ENDPGM
