             PGM        PARM(&FIRM &FGRP &RKAF &KUNF &RKAT &KUNT)

/* Initiering av parametre.                                          */

             DCL        VAR(&FIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&RKAF) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&KUNF) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&RKAT) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&KUNT) TYPE(*DEC)  LEN(6 0)

             DCL        VAR(&LIBL) TYPE(*CHAR) LEN(6) VALUE('ADBxxx')

/* Overrider rabattmatrise og spesialpris det skal kopieres til      */

             IF         COND(&FGRP *NE '   ') THEN(DO)

             CHGVAR     VAR(%SST(&LIBL 4 3)) VALUE(&FGRP)

             OVRDBF     FILE(FRABLU) TOFILE(&LIBL/FRABLU) +
                          OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(FPRILU) TOFILE(&LIBL/FPRILU) +
                          OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(FPRNLU) TOFILE(&LIBL/FPRNLU) +
                          OVRSCOPE(*CALLLVL)

             ENDDO

/* Kaller program for kopiering av avtale                           */

             CALL       PGM(FR196R) PARM(&FIRM &RKAF &KUNF &RKAT &KUNT)

 END:        ENDPGM
