             PGM        PARM(&FIRM &FGRP &KUND &FEIL)

/* Initiering av parametre.                                          */

             DCL        VAR(&FIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&KUND) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&FEIL) TYPE(*CHAR) LEN(1)

             DCL        VAR(&LIBL) TYPE(*CHAR) LEN(6) VALUE('ADBxxx')

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERR))

/* Overrider kunderegister                                           */

             CHGVAR     VAR(%SST(&LIBL 4 3)) VALUE(&FGRP)

             CHKOBJ     OBJ(&LIBL/RKUNL1) OBJTYPE(*FILE)

             OVRDBF     FILE(RKUNL1) TOFILE(&LIBL/RKUNL1) +
                          OVRSCOPE(*CALLLVL)

/* Sjekker om kunde finnes                                           */

             CALL       PGM(FR194R) PARM(&FIRM &KUND &FEIL)

             GOTO       CMDLBL(END)

 ERR:        CHGVAR     VAR(&FEIL) VALUE('1')

 END:        ENDPGM
