             PGM        PARM(&FIRM &FGRP &KUND &NAVN)

/* Initiering av parametre.                                          */

             DCL        VAR(&FIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&KUND) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&NAVN) TYPE(*CHAR) LEN(30)

             DCL        VAR(&LIBL) TYPE(*CHAR) LEN(6) VALUE('ADBxxx')

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(END))

/* Overrider kunderegister                                           */

             CHGVAR     VAR(%SST(&LIBL 4 3)) VALUE(&FGRP)

             CHKOBJ     OBJ(&LIBL/RKSOPF) OBJTYPE(*FILE)

             OVRDBF     FILE(RKSOPF) TOFILE(&LIBL/RKSOPF) +
                          OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(RKSOI1) TOFILE(&LIBL/RKSOI1) +
                          OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(RKUNL1) TOFILE(&LIBL/RKUNL1) +
                          OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(RKUNL2) TOFILE(&LIBL/RKUNL2) +
                          OVRSCOPE(*CALLLVL)

/* Kaller spørring på kunde                                          */

             CALL       PGM(RK500R) PARM(&FIRM &KUND &NAVN)

 END:        ENDPGM
