             PGM        PARM(&FIRM &FGRP &RKAT &KUNT)

/* Initiering av parametre.                                          */

             DCL        VAR(&FIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&RKAT) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&KUNT) TYPE(*DEC)  LEN(6 0)

             DCL        VAR(&LIBL) TYPE(*CHAR) LEN(6) VALUE('ADBxxx')

/* Overrider rabattmatrise og spesialpris det skal slettes fra       */

             IF         COND(&FGRP *NE '   ') THEN(DO)

             CHGVAR     VAR(%SST(&LIBL 4 3)) VALUE(&FGRP)

             OVRDBF     FILE(FRABLD) TOFILE(&LIBL/FRABLD) +
                          OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(FRABL3) TOFILE(&LIBL/FRABL3) +
                          OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(FPRILU) TOFILE(&LIBL/FPRILU) +
                          OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(FPRIL3) TOFILE(&LIBL/FPRIL3) +
                          OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(FPRNLU) TOFILE(&LIBL/FPRNLU) +
                          OVRSCOPE(*CALLLVL)

             ENDDO

/* Kaller program for sletting av gammel avtale                     */

             CALL       PGM(FR410R) PARM(&FIRM &RKAT &KUNT)

             CALL       PGM(FP409R) PARM(&FIRM &RKAT &KUNT)

 END:        ENDPGM
