             PGM        PARM(&PARM)

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(64)

/* Call til program for seleksjon                                    */

             CALL       PGM(FU114R)    PARM(&PARM)

             ENDPGM
