             PGM        PARM(&PFILE &PFLDR &PFEIL)
/* Kjøres fra FM41,1                                                 */
/* Initiering av parametre.                                          */

             DCL        VAR(&PFILE)    TYPE(*CHAR) LEN(12)
             DCL        VAR(&PFLDR)    TYPE(*CHAR) LEN(20)
             DCL        VAR(&PFEIL)    TYPE(*CHAR) LEN(1)

             dcl        var(&fradoc) type(*char) len(30)
             dcl        var(&framap) type(*char) len(30)
             dcl        var(&tillib) type(*char) len(10)
             dcl        var(&tilfil) type(*char) len(10)
             dcl        var(&tilmbr) type(*char) len(10)
             dcl        var(&fgr)    type(*char) len(3)
             dcl        var(&sts)    type(*char) len(8)

/* Initierer feil-flagg                                              */

             CHGVAR     VAR(&PFEIL)    VALUE('0')

/* Tømmer arbeidsfil                                                 */

             CLRPFM     FILE(FLVWPF)

/* Kopierer leverandør-fil til arbeidsfil                            */

             IF         COND(&PFLDR *NE ' ') THEN(DO)
/*           CPYFRMPCD  FROMFLR(&PFLDR) TOFILE(FLVWPF) +      */
/*                        FROMDOC(&PFILE) MBROPT(*ADD)        */
             rtvdtaara  dtaara(*lda (931 03)) rtnvar(&fgr)
             chgvar     var(&framap)  value('/ASP/' *cat +
                                             &fgr   *cat +
                                             '/' *cat &pfldr)
             chgvar     var(&fradoc)  value(&pfile)
             chgvar     var(&tillib)  value('*LIBL')
             chgvar     var(&tilfil)  value('FLVWPF')
             chgvar     var(&tilmbr)  value('FLVWPF')
             chgvar     var(&sts)     value(' ')
             call       pgm(aspfrstmf) parm(+
                            &fradoc +
                            &framap +
                            &tillib +
                            &tilfil +
                            &tilmbr +
                            &sts)
             if         cond(&sts *ne ' ') then(goto cmdlbl(feil))
   /*        MONMSG     MSGID(IWS1603)                          */
   /*        MONMSG     MSGID(CPF8A00) EXEC(GOTO CMDLBL(FEIL))  */
   /*        MONMSG     MSGID(IWS1611) EXEC(GOTO CMDLBL(FEIL))  */
             ENDDO
             ELSE       CMD(DO)
             CPYF       FROMFILE(&PFILE) TOFILE(FLVWPF) MBROPT(*ADD) +
                          FMTOPT(*NOCHK)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(FEIL))
             ENDDO

             GOTO       CMDLBL(END)

 FEIL:       CHGVAR     VAR(&PFEIL) VALUE('1')

 END:        ENDPGM
