             PGM        PARM(&LIST)

/* 130916 BOF :  Utvidet plist                                  */
/* Initiering av parametre.                                          */

             DCL        VAR(&LIST)     TYPE(*CHAR) LEN(74)
             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&RAPP)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&RAPP)     VALUE('FW601P')

/* Oppdaterer LDA med navn på printfile                              */

             CHGDTAARA  DTAARA(*LDA (846 10)) VALUE(&RAPP)

/* Oppkall av utskriftsparametre.                                    */

             CALL       PGM(AP600R)    PARM('FW601' '1' '0' &IN03 &BTCH)

/* Dersom F3 eller F12 skal ikke rapporten skrives                   */

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Henter opplysning om utskriften skal kjøres i batch fra LDA       */

             RTVDTAARA  DTAARA(*LDA (863 1)) RTNVAR(&BTCH)

/* Utskrift                                                          */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(FW601C) PARM(&LIST)) +
                          JOB(UTSKR_LVAR) MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/FW601C) PARM(&LIST))

 END:        ENDPGM
