             PGM        PARM(&LDOR)

/* Initiering av parametre.                                          */

             DCL        VAR(&LDOR)   TYPE(*DEC) LEN(6 0)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID) TYPE(*CHAR) LEN(10)


            RTVDTAARA  DTAARA(*LDA (863 1))  RTNVAR(&BTCH)

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP601C) PARM('FW727P' &BTCH)


/* Utskrift.                                                         */

             CALL       PGM(FW727R) PARM(&LDOR)

/* Sender melding dersom bakgrunnsjobb                               */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDBRKMSG  MSG('ASOFAK: Oppretting av nye varer fra +
                          leverandør er ferdig') TOMSGQ(&WSID)
             ENDDO

      /* Program for å fjerne overstyring av printerfile */

             CALL       PGM(AP606C) PARM('Fw727P')

 END:        ENDPGM
