             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID) TYPE(*CHAR) LEN(10)


            RTVDTAARA  DTAARA(*LDA (863 1))  RTNVAR(&BTCH)

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP601C) PARM('FW729P' '0')


/* Utskrift.                                                         */

             CALL       PGM(FW729R)

/* Sender melding dersom bakgrunnsjobb                               */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDBRKMSG  MSG('ASOFAK: Kontroll liste INTEG.dat er +
                           ferdig') TOMSGQ(&WSID)
             ENDDO

      /* Program for å fjerne overstyring av printerfile */

             CALL       PGM(AP606C) PARM('FW729P')

 END:        ENDPGM
