             PGM

/* Initiering av parametere                                          */

             DCL        VAR(&AARR)   TYPE(*DEC)  LEN(4) VALUE(0)
             DCL        VAR(&FATY)   TYPE(*DEC)  LEN(2) VALUE(30)
             DCL        VAR(&FNUM)   TYPE(*DEC)  LEN(6) VALUE(0)
             DCL        VAR(&TNUM)   TYPE(*DEC)  LEN(6) VALUE(999999)
             DCL        VAR(&OMKJ)   TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&RAPP)   TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&ANTA)   TYPE(*DEC)  LEN(4) VALUE(0)
             DCL        VAR(&FEIL)   TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&PYEAR)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&PYRNM)  TYPE(*DEC)  LEN(2)

/* Kaller opp program for oppsett av biblioteksliste                 */

             CALL       PGM(ASPINI/AA722C)    PARM('GRO53X    ')
             MONMSG     MSGID(CPF0000)

/* Henter inneværende år fra systemet                                */

             RTVSYSVAL  SYSVAL(QYEAR) RTNVAR(&PYEAR)

             CHGVAR     VAR(&PYRNM)    VALUE(&PYEAR)
             CHGVAR     VAR(&AARR)     VALUE(2000 + &PYRNM)

             CALL PGM(FO183R) PARM(&AARR &FATY &FNUM &TNUM +
                                   &OMKJ &RAPP &ANTA &FEIL)

             ENDPGM
