             PGM

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)


             DLTF       FILE(&DLIB/VVENL5)
             MONMSG     MSGID(CPF2105)
/*                                                                   */
             DLTF       FILE(&DLIB/VVENL4)
             MONMSG     MSGID(CPF2105)
/*                                                                   */
             DLTF       FILE(&DLIB/VVENL3)
             MONMSG     MSGID(CPF2105)
/*                                                                   */
             DLTF       FILE(&DLIB/VVENL2)
             MONMSG     MSGID(CPF2105)
/*                                                                   */
             DLTF       FILE(&DLIB/VVENLU)
             MONMSG     MSGID(CPF2105)
/*                                                                   */
             DLTF       FILE(&DLIB/VVENLR)
             MONMSG     MSGID(CPF2105)
/*                                                                   */
             RNMOBJ     OBJ(&DLIB/VVENL1) OBJTYPE(*FILE) +
                          NEWOBJ(VVENL1_560)
/*                                                                   */
             RNMOBJ      OBJ(&DLIB/VVENPF) OBJTYPE(*FILE) +
                            NEWOBJ(VVENPF_560)

             CALL       PGM(FG152C) PARM(&DLIB &NULL)
             CALL       PGM(FG153C) PARM(&DLIB &NULL)


             CALL       PGM(FX894R)  /* Felt fraa VVENPF til VVEPPF*/


/* kopierer fra ver. 5.60 til 6.10 for 2 filer */

             CPYF       FROMFILE(&DLIB/VVENPF_560) +
                          TOFILE(&DLIB/VVENPF) MBROPT(*ADD) +
                          FMTOPT(*MAP *DROP)


 ENDPGM:     ENDPGM
