             PGM        PARM(&FGRP)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&CLIB) TYPE(*CHAR) LEN(6) VALUE('ADBnnn')

             CALL       PGM(AA720C) PARM(&FGRP)

             CHGVAR     VAR(&CLIB) VALUE(%SUBSTRING(&CLIB 1 3) *TCAT +
                          &FGRP)

             CHGCURLIB  CURLIB(&CLIB)

/* Sletter gammel backup fil                                */
             DLTF       FILE(&CLIB/VEANPF.BOF)
             MONMSG     MSGID(CPF0000)

/* Kopierer VEANPF                                           */
             CPYF       FROMFILE(&CLIB/VEANPF) +
                          TOFILE(&CLIB/VEANPF.BOF) MBROPT(*ADD) +
                          CRTFILE(*YES)

/* Kaller opp program for danner ean-nr i EVR ut fra VA              */

             CALL       PGM(FX892R)
             MONMSG     MSGID(CPF0000)

             ENDPGM
