/*                                                                   */
/*           Kopierer over filer fra versjon 2.04 til versjon 3.00   */
/*           -----------------------------------------------------   */
/*                                                                   */
 STRPGM:     PGM        PARM(&FBIB &TBIB &FFIL &TFIL)
/*                                                                   */
             DCL        VAR(&FBIB) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TBIB) TYPE(*CHAR) LEN(6)
             DCL        VAR(&FFIL) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TFIL) TYPE(*CHAR) LEN(6)
/*                                                                   */
/*           Tøm register som det skal kopieres til                  */
/*                                                                   */
             CLRPFM     FILE(&TBIB/&TFIL)
/*                                                                   */
/*           Kopierer fra gammelt til nytt register                  */
/*                                                                   */
             CPYF       FROMFILE(&FBIB/&FFIL) +
                          TOFILE(&TBIB/&TFIL) FROMMBR(*ALL) +
                          TOMBR(*FROMMBR) MBROPT(*ADD) FMTOPT(*MAP +
                          *DROP)
/*                                                                   */
 ENDPGM:     ENDPGM
