             PGM        PARM(&PARM &VLG1)

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(64)
             DCL        VAR(&VLG1)     TYPE(*CHAR) LEN(1)

/* Kaller opp program for utskrift   (Direkte)                       */

             IF         COND(&VLG1 *NE '1') THEN(DO)
             CALL       PGM(FY612C)    PARM(&PARM)
             ENDDO

/* Kaller opp program for utskrift   (Via jobbkø)                    */

             IF         COND(&VLG1 *EQ '1') THEN(DO)
             SBMJOB     CMD(CALL PGM(FY612C) PARM(&PARM)) +
                          JOB(SLETT_ORD)
             ENDDO

             ENDPGM
