
/*           Generere   kortfiler                                    */

 STRPGM:     PGM        parm(&fgrp &null)


             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             dcl        var(&grp)  type(*char) len(7) Value('GRP_xxx')

 /*          Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)
             chgvar     var(%sst(&grp 5 3)) value(&fgrp)

 /*          Genererer                                               */
             CALL       PGM(AG908C) PARM('BOKOST' &fgrp &grp ' ')
             CALL       PGM(AG908C) PARM('BBBLST' &fgrp &grp ' ')
             call       pgm(ag906c) parm('BREFPF' &fgrp &grp ' ')

 ENDPGM:     ENDPGM
