
             PGM        parm(&fgr &kjede)

             DCL        VAR(&kjede)       TYPE(*CHAR) LEN(3)
             DCL        VAR(&serv)        TYPE(*CHAR) LEN(10)
             DCL        VAR(&fgr)         TYPE(*CHAR) LEN(3)
             dclf       afgrst

             rtvneta    sysname(&serv)

rcvf:        rcvf
             monmsg     msgid(CPF0864) exec(goto (end))

             if         cond(&afgsrv *eq &serv *and +
                             &afgfgr *eq &fgr) then(do)
               chgvar   var(&kjede)  value(&afgkjd)
               goto     cmdlbl(end)
             enddo
             goto       cmdlbl(rcvf)

 END:        ENDPGM
