
             PGM        parm(&date &cymdat &dattim &dayofw)

             DCL        VAR(&date)        TYPE(*CHAR) LEN(6)
             DCL        VAR(&cymdat)      TYPE(*CHAR) LEN(7)
             DCL        VAR(&dattim)      TYPE(*CHAR) LEN(20)
             DCL        VAR(&dayofw)      TYPE(*CHAR) LEN(4)

             RTVJOBA    DATE(&DATE) CYMDDATE(&CYMDAT) +
                          DATETIME(&DATTIM) DAYOFWEEK(&DAYOFW)

 END:        ENDPGM
