             PGM        parm(&fgr &mil)
/*                                                                         */
/*                                                                         */
             dcl        var(&fgr)  type(*char)   len(3)
             dcl        var(&sys)  type(*char)   len(10)
             dcl        var(&mil)  type(*char)   len(10)

             dclf       file(*libl/afgrst) alwnull(*yes)

start:
      rtvneta  sysname(&sys)

/*   Les fil med filgruppe / Miljø                          */
rcv:  rcvf
      monmsg     msgid(cpf0864) exec(goto endpgm)
      if         cond(&afgsrv *ne &sys) then(do)
        goto      cmdlbl(rcv)
      enddo
      if         cond(&afgfgr *ne &fgr) then(do)
        goto      cmdlbl(rcv)
      enddo
      chgvar     var(&mil)  value(&afgmil)

      if         cond(&mil *eq '   ') then(do)
        chgvar   var(&mil)  value(&fgr)
      enddo


 ENDPGM:     ENDPGM
