             PGM

             DCLF       FILE(GG001D)

             DCL        VAR(&BIBL) TYPE(*CHAR) LEN(6) VALUE('ADB')
             DCL        VAR(&A1VA01) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA02) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA04) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA05) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA06) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA07) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA09) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA10) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA11) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA12) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA13) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA14) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA15) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA16) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA17) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA18) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA19) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA20) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA21) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA22) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA23) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&APLEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK) TYPE(*CHAR) LEN(2)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&APLEVL) VALUE('40')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             SNDRCVF    RCDFMT(A1BLD)

/* F3 + F12                                                          */

             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/*  Genererer Faste data                                             */

             IF         COND(&A1VA01 *EQ '1') THEN(DO)
             CALL       PGM(GGFASC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Avtaleregister                                         */

             IF         COND(&A1VA02 *EQ '1') THEN(DO)
             CALL       PGM(GGAVTC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Deklarasjonskoder                                      */

             IF         COND(&A1VA03 *EQ '1') THEN(DO)
             CALL       PGM(GGUDKC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Utbetalingsforslag                                     */

             IF         COND(&A1VA04 *EQ '1') THEN(DO)
             CALL       PGM(GGUBFC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Utbetalingsforslag kopi ved 2. gangs retur             */

             IF         COND(&A1VA05 *EQ '1') THEN(DO)
             CALL       PGM(GGKBFC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Overføring av lønn til utbetalingsforslag              */

             IF         COND(&A1VA06 *EQ '1') THEN(DO)
             CALL       PGM(GGLONC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Returfiler GRETPF og GSTRPF:   */

             IF         COND(&A1VA07 *EQ '1') THEN(DO)

/*             gretpf:                         */
               CALL       PGM(GGRETC) PARM(&A1FGRP &A1NULL)

/*             gstrpf:                         */
               CHGVAR     VAR(%SST(&bibl 4 3)) VALUE(&A1FGRP)
               CRTPF      FILE(&bibl/GSTRPF) RCDLEN(160) +
                          MAXMBRS(*NOMAX) SIZE(*NOMAX)
               MONMSG     MSGID(CPF0000)

             ENDDO

/*  Genererer Retur fra banken kopi                                  */

             IF         COND(&A1VA08 *EQ '1') THEN(DO)
             CALL       PGM(GGBTRC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Retur lønn, Feil- 1. og 2. gang                        */

             IF         COND(&A1VA09 *EQ '1') THEN(DO)
             CALL       PGM(GGULFC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGUL1C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGUL2C) PARM(&A1FGRP &A1NULL)
             ENDDO

/*    Feil, 1. og 2. gangs kvittering                                */

             IF         COND(&A1VA10 *EQ '1') THEN(DO)
             CALL       PGM(GGURFC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGUR1C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGUR2C) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Retur kontoavstemming                                  */

             IF         COND(&A1VA11 *EQ '1') THEN(DO)
             CALL       PGM(GGKTIC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGKTOC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGKTUC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Retur telegiro etter splitting                         */

             IF         COND(&A1VA12 *EQ '1') THEN(DO)
             CALL       PGM(GGTGIC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Returdata for valgt ut til oppdatering                 */

             IF         COND(&A1VA13 *EQ '1') THEN(DO)
             CALL       PGM(GGTRTC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Retur OCR etter splitting                              */

             IF         COND(&A1VA14 *EQ '1') THEN(DO)
             CALL       PGM(GGOCRC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer OCR valgt ut til oppdatering                           */

             IF         COND(&A1VA15 *EQ '1') THEN(DO)
             CALL       PGM(GGORTC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Retur eksterne transaksjoner                           */

             IF         COND(&A1VA16 *EQ '1') THEN(DO)
             CALL       PGM(GGATRC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Retur inkasso                                          */

             IF         COND(&A1VA17 *EQ '1') THEN(DO)
             CALL       PGM(GGINKC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGISOC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Felles sekvensteller                                   */

             IF         COND(&A1VA18 *EQ '1') THEN(DO)
             CALL       PGM(GGUSTC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Kontrollfil                                            */

             IF         COND(&A1VA19 *EQ '1') THEN(DO)
             CALL       PGM(GGAKTC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer Remittering til bank                                   */

             IF         COND(&A1VA20 *EQ '1') THEN(DO)
             CALL       PGM(GGREMC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer BETFOR_transaksjoner                                   */

             IF         COND(&A1VA21 *EQ '1') THEN(DO)
             CALL       PGM(GGU00C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGU01C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGU02C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGU03C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGU04C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGU21C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGU22C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGU23C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGU99C) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Genererer BETFOR-overstyring                                     */

             IF         COND(&A1VA22 *EQ '1') THEN(DO)
             CALL       PGM(GGX00C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGX01C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGX02C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGX03C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGX04C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGX21C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGX22C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGX23C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(GGX99C) PARM(&A1FGRP &A1NULL)
             ENDDO

/*    Feil, mottakskvittering,                                       */

             IF         COND(&A1VA23 *EQ '1') THEN(DO)
             CALL       PGM(GGURMC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*    PC-filer                                                       */

             IF         COND(&A1VA24 *EQ '1') THEN(DO)
             CALL       PGM(GGFPFC) PARM(&A1FGRP &A1NULL)
             ENDDO

 ENDPGM:     ENDPGM
