
/*           Generere   STATUS 000001                                */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASTELE')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('GU22BF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('GU22PF')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('GU22L1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('GU22L2')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG101C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGL1 &RGL2)

 ENDPGM:     ENDPGM
