
/*           Generere   STATUS 000001                                */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASTELE')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('GUBFBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('GUBFPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('GUBFLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('GUBFL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('GUBFL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('GUBFL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('GUBFL4')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('GUBFL5')
             DCL        VAR(&RGL6) TYPE(*CHAR) LEN(6) VALUE('GUBFL6')
             DCL        VAR(&RGL7) TYPE(*CHAR) LEN(6) VALUE('GUBFL7')
             DCL        VAR(&RGL8) TYPE(*CHAR) LEN(6) +
                          VALUE('GUBFL8') /* N5.00 */

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG108C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLU &RGL1 +
                          &RGL2 &RGL3 &RGL4 &RGL5 &RGL6 +
                          &RGL7 &RGL8) /* E5.00 */

 ENDPGM:     ENDPGM
