
/*           Generere tabeller for gjennomsnittlig kostpris    */

             PGM        parm(&FGRP)

             DCL        VAR(&FILE)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&FGRP)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&LIBL)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&NULL)   TYPE(*CHAR) LEN(1)

/*           Setter bibliotek til current og henter gruppeprofil     */

             CHGVAR     VAR(&LIBL) VALUE('ADB' *CAT &FGRP)
             CHGCURLIB  CURLIB(&LIBL)

/*           Starter å opprette filer                                */

             CHGVAR     VAR(&FILE) VALUE('VGKFST')
             CALL       PGM(AG902C) PARM(&FILE &LIBL *NULL)

             CHGVAR     VAR(&FILE) VALUE('VGKKST')
             CALL       PGM(AG902C) PARM(&FILE &LIBL &NULL)

             CHGVAR     VAR(&FILE) VALUE('VGKPST')
             CALL       PGM(AG902C) PARM(&FILE &LIBL &NULL)

             CHGVAR     VAR(&FILE) VALUE('VGKTST')
             CALL       PGM(AG902C) PARM(&FILE &LIBL &NULL)

 ENDPGM:     ENDPGM
