/* VEDLIKEHOLD AV UTBETALINGSFORSLAG.                                */

             PGM        PARM(&BFNR)

/* Initiering av parametre.                                          */

/*  &PROG = Programnavnet som brukes i formularfile.               */
/*  &RAPP = Navnet på rapporten i utskriftsprogram.                */
/*  &VALG = Verdi "1" dersom skjermbilde for vedlikehold av        */
/*            formularer skal vises.  Verdi "0" dersom bildet        */
/*            ikke skal vises.                                       */

             DCL        VAR(&BFNR) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&PROG) TYPE(*CHAR) LEN(10) +
                          VALUE('GL102R')

             DCL        VAR(&RAPP) TYPE(*CHAR) LEN(10) +
                          VALUE('GL102P')

             DCL        VAR(&VALG) TYPE(*CHAR) LEN(1) VALUE('1')

/* Oppdaterer LDA med navn på printfile og kode for om formular-     */
/* parametere skal endres.                                           */

             CHGDTAARA  DTAARA(*LDA (800 10)) VALUE(&PROG)
             CHGDTAARA  DTAARA(*LDA (844 1)) VALUE(&VALG)
             CHGDTAARA  DTAARA(*LDA (846 10)) VALUE(&RAPP)

/* Kaller opp vedlikeholdsprogram.                                   */

             CALL       PGM(GL104R) PARM(&BFNR)

 END:        ENDPGM
