             PGM        PARM(&FGRP &FIRM &RIDE &BFNR &VALG +
                          &IN12 &SEKV &DAGL &DATO &TIME)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRM) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&RIDE) TYPE(*CHAR) LEN(4)
             DCL        VAR(&BFNR) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&VALG) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN12) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&SEKV) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&DAGL) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&DATO) TYPE(*DEC) LEN(8 0)
             DCL        VAR(&TIME) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&BIBL) TYPE(*CHAR) LEN(10)

/* Henter hele *CURLIB, og "redigerer" deretter det nye:             */

             RTVDTAARA  DTAARA(*LDA (934 10)) RTNVAR(&BIBL)
             CHGVAR     VAR(%SST(&BIBL 4 3)) VALUE(&FGRP)

/* Overstyrer databasefile til riktig filegruppe:                    */

             OVRDBF     FILE(GUBFPF) TOFILE(&BIBL/GUBFPF)
             OVRDBF     FILE(RLTRLU) TOFILE(&BIBL/RLTRLU)
             OVRDBF     FILE(GFASPF) TOFILE(&BIBL/GFASPF)

/* Oversikt over filer til remittering.                              */

             CALL       PGM(GL107R) PARM(&FGRP &FIRM &RIDE +
                          &BFNR &VALG &IN12 &SEKV &DAGL +
                          &DATO &TIME)

