             PGM        PARM(&FGRP &FIRM &FNAV &BGIR &PGIR)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRM) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&FNAV) TYPE(*CHAR) LEN(30)
             DCL        VAR(&BIBL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BGIR) TYPE(*DEC) LEN(11 0)
             DCL        VAR(&PGIR) TYPE(*DEC) LEN(11 0)

/* Henter hele *CURLIB, og "redigerer" deretter det nye:             */

             RTVDTAARA  DTAARA(*LDA (934 10)) RTNVAR(&BIBL)
             CHGVAR     VAR(%SST(&BIBL 4 3)) VALUE(&FGRP)

/* Overstyrer databasefile:                                          */

             OVRDBF     FILE(AFIRL1) TOFILE(&BIBL/AFIRL1)

/* Oppdaterer returfilene:                                           */

             CALL       PGM(GL117R) PARM(&FIRM &FNAV &BGIR +
                          &PGIR)

