             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&KOMM) TYPE(*CHAR) LEN(4)
             DCL        VAR(&IN03) TYPE(*DEC) LEN(1 0)

/* Henter fra faste opplsyninger på firma, type kommunikasjon:       */

             CALL       PGM(GL119R) PARM(&KOMM &IN03)

/* Tester på om program skal avsluttes.                              */

                   IF         COND(&IN03 *EQ 1) THEN(DO)
                   GOTO       CMDLBL(END)
                   ENDDO

/* Starter ICF-kommunikasjonsprogram:                                */

             CALL       PGM(GL702R) PARM(&IN03)

 END:        ENDPGM
