             PGM

/* Kaller opp program.                                               */

             DCL        VAR(&V1) TYPE(*DEC) LEN(11 0) +
                          VALUE(12345678901)
             DCL        VAR(&V2) TYPE(*DEC) LEN(1 0) VALUE(0)

             CALL       PGM(GL121R) PARM(&V1 &V2)

 END:        ENDPGM
