             PGM

/* Definerer parametre:                                              */

             DCL        VAR(&MBER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FIRM)  TYPE(*CHAR) LEN(3)

/* Bygger membernøkkel:                                              */

             RTVDTAARA  DTAARA(*LDA (944 3)) RTNVAR(&FIRM)
             CHGVAR     VAR(%SST(&MBER 1 4)) VALUE('TELE')
             CHGVAR     VAR(%SST(&MBER 5 3)) VALUE(&FIRM)

/* Sletter member:                                                   */
             CALL       PGM(RF704R) PARM(&MBER)  /* RBUNLU */

             CALL       PGM(RF703R) PARM(&MBER)  /* RTRALU */

 ENDPGM:     ENDPGM
