
/* Tømmer arbeidsregister returoppdatering                           */
/* 110713 NHO Sletter GORTPF                                         */

             PGM

             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)

             CLRPFM     FILE(GTRTPF)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(GURFPF)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(GUR1PF)
             MONMSG     MSGID(CPF0040)

             CLRPFM     FILE(GUR2PF)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(GURMPF)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(GULFPF)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(GUL1PF)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(GUL2PF)
             MONMSG     MSGID(CPF0000)

             CLRPFM     FILE(GORTPF)
             MONMSG     MSGID(CPF0000)

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Tømmer arbeidsregister retur')
             CHGVAR     VAR(&MLD2) VALUE('Ferdig')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

 END:        ENDPGM
