
/* Sletter kontrollmember for samlefil                               */

             PGM

             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)

             RMVM       FILE(*LIBL/GAKTPF) MBR(GL106C) /* Fjerner +
                          member som indikerer overføring av +
                          samlefile. */
             MONMSG     MSGID(CPF0000)
             RMVM       FILE(*LIBL/GAKTPF) MBR(BANK) /* Fjerner +
                          member som indikerer bankoverføring */
             MONMSG     MSGID(CPF0000)

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Sletter kontrollmember samlefil')
             CHGVAR     VAR(&MLD2) VALUE('Ferdig')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

 END:        ENDPGM
