             PGM

             DCL        VAR(&WPBFNR) TYPE(*DEC) LEN(3 0)
             CALL       PGM(GL104C) PARM(&WPBFNR)

/* Slutt                                                             */
 ENDPGM:     ENDPGM

