/* NHO 180910   Fjernet member for klienten                          */
/* Sletter kontrollmember for returdata                              */
             PGM

             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)

             CALL       PGM(GL229R)

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Sletter historiske bankreturer')
             CHGVAR     VAR(&MLD2) VALUE('Ferdig')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

 END:        ENDPGM
