             PGM        PARM(&FILG &FIRM &FREM &FMOT &FAVR &FOCR +
                          &FKTO &FINK &FTFF)

/* Definer variabler                                                 */

             DCL        VAR(&FILG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRM) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&FREM) TYPE(*CHAR) LEN(20)
             DCL        VAR(&FMOT) TYPE(*CHAR) LEN(20)
             DCL        VAR(&FAVR) TYPE(*CHAR) LEN(20)
             DCL        VAR(&FOCR) TYPE(*CHAR) LEN(20)
             DCL        VAR(&FKTO) TYPE(*CHAR) LEN(20)
             DCL        VAR(&FINK) TYPE(*CHAR) LEN(20)
             DCL        VAR(&FTFF) TYPE(*CHAR) LEN(20)

/* Bygger GPCFPF dersom file ikke finnes i ADBxxx:                   */

             CHKOBJ     OBJ(GPCFPF) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             CRTPF      FILE(&FILG/GPCFPF) SRCFILE(*LIBL/QDDFSRC)
             ENDDO

             CALL       PGM(GL320R) PARM(&FILG &FIRM &FREM &FMOT +
                          &FAVR &FOCR &FKTO &FINK &FTFF)

 ENDPGM:     ENDPGM
