             PGM        PARM(&TFGR &TFIRX)
/*                                                                   */
             DCL        VAR(&TFGR)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&TFIRX)    TYPE(*CHAR) LEN(3)
             DCL        VAR(&TFIR)     TYPE(*DEC) LEN(3 0)
             DCL        VAR(&FGRP)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRM)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&BIBL)   TYPE(*CHAR) LEN(06) VALUE('ADB   ')
             DCL        VAR(&MLD3)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&MLD4)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&SVAR)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN12)     TYPE(*DEC)  LEN(1 0)
/*                                                                   */
             CHGVAR     VAR(%SST(&BIBL 4 3)) VALUE(&TFGR)
             CHGVAR     VAR(&TFIR) VALUE(&TFIRX)

/* Hente inn filgruppe / firma fra LDA                               */

             RTVDTAARA  DTAARA(*LDA (931 03)) RTNVAR(&FGRP)
             RTVDTAARA  DTAARA(*LDA (944 03)) RTNVAR(&FIRM)

/*           Overstyrer til-fil til til-bibliotek                    */

             OVRDBF     FILE(GFASLU) TOFILE(&BIBL/GFASLU)
             OVRDBF     FILE(GLONLU) TOFILE(&BIBL/GLONLU)
             OVRDBF     FILE(GTRTLU) TOFILE(&BIBL/GTRTLU)
             OVRDBF     FILE(GUBFLU) TOFILE(&BIBL/GUBFLU)
             OVRDBF     FILE(GULFPF) TOFILE(&BIBL/GULFPF)
             OVRDBF     FILE(GUL1L1) TOFILE(&BIBL/GUL1L1)
             OVRDBF     FILE(GUL2L1) TOFILE(&BIBL/GUL2L1)
             OVRDBF     FILE(GURFLU) TOFILE(&BIBL/GURFLU)
             OVRDBF     FILE(GUR1L1) TOFILE(&BIBL/GUR1L1)
             OVRDBF     FILE(GUR2L1) TOFILE(&BIBL/GUR2L1)
/*                                                                   */
             CALL       PGM(GL405R) PARM(&TFIR)
/*                                                                   */
 ENDPGM:     ENDPGM
