/* ICF-SEND TIL BANK  */

             PGM        PARM(&BANK)

             DCL        VAR(&BANK) TYPE(*CHAR) LEN(2)

             CLRPFM     FILE(DIRUIE)

             CPYF       FROMFILE(QS36F/DIRREM) TOFILE(DIRIIE) +
                          MBROPT(*REPLACE) FMTOPT(*NOCHK)

             CALL       PGM(GL700R) PARM(&BANK)

             RCLRSC
ENDPGM
