/* FTP-SEND TIL BANK  */

             PGM        PARM(&BANK)

             DCL        VAR(&BANK) TYPE(*CHAR) LEN(2)
             DCL        VAR(&FILN)   TYPE(*CHAR) LEN(30)
             DCL        VAR(&FEIL) TYPE(*CHAR) LEN(1) VALUE('0')
             DCL        VAR(&STAT)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&SMSG)  TYPE(*CHAR) LEN(1) VALUE('1')
             DCL        VAR(&OVRF) TYPE(*CHAR) LEN(10) +
                          VALUE('IBMBNKSND ')

             CLRPFM     FILE(DIRUIE)

             CALL       PGM(GL710R) PARM(&BANK)
             CALL       PGM(GL715R) PARM(&FILN)

/* Sender fil med valgt member til IBM                               */

             CALL       PGM(AF700C) PARM(&OVRF &STAT &FILN &SMSG)

             IF         COND(&STAT *NE ' ') THEN(CHGVAR VAR(&FEIL) +
                          VALUE('1'))
ENDPGM
