      PGM        parm(&fil &lib &mbr)
      DCL        VAR(&fil)  TYPE(*char) LEN(10)
      DCL        VAR(&lib)  TYPE(*char) LEN(10)
      DCL        VAR(&mbr)  TYPE(*char) LEN(20)
      DCL        VAR(&ban)  TYPE(*CHAR) LEN(60)
      DCL        VAR(&utf)  TYPE(*CHAR) LEN(60)
/*                                                                   */
      call       pgm(hentifs) parm(&fil &lib &mbr &ban &utf)
end:  ENDPGM
