      PGM        parm(&par)

      dcl        var(&par)  type(*char) len(60)
/*                                                                   */
      dspf       stmf(&par)

end:  ENDPGM
