             PGM
/*                                                             */
/* 051214 BOF: hindre at bruker logger på flere ganger         */
/*                                                             */
             DCLF       FILE(HMRT)
             DCL        VAR(&APFNAV) TYPE(*CHAR) LEN(20)
             DCL        VAR(&USER)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&POK)    TYPE(*CHAR) LEN(1)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(LSETUP)

/* Sjekker om bruker er pålogget fra før, ikke tillatt               */
             RTVJOBA    USER(&USER)
             CALL       PGM(AA099C) PARM(&USER &POK)

/* Sender velkomst-bildet for tvungen posisjonering                  */

             SNDRCVF    RCDFMT(A1INF)

/* Start                                                             */

 START:      RTVDTAARA  DTAARA(*LDA (951 20)) RTNVAR(&APFNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(HR100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(VV590R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(HR110R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4                                                            */
             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(HR150R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5                                                            */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(HR120R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6                                                            */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(HR130R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7                                                            */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(HR140R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO
/* Valg 99                                                           */
             IF         COND(&VALG *EQ 99) THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             CHGVAR     VAR(&VALG) VALUE(0)

/* Gå til start                                                      */

             GOTO       CMDLBL(START)

/* Feilmelding                                                       */
 FEIL:       SNDRCVF    RCDFMT(A1ERR)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
