             PGM        PARM(&TIME &NUMM &STAT)

             DCL        VAR(&TIME)     TYPE(*CHAR) LEN(26)
             DCL        VAR(&NUMM)     TYPE(*DEC) LEN(6 0)
             DCL        VAR(&STAT)     TYPE(*CHAR) LEN(1)

/* Kaller opp program for oppdatering                                */

             CALL       PGM(HR701R) PARM(&TIME &NUMM &STAT)

             ENDPGM
