             PGM        PARM(&TIME &STAT)

             DCL        VAR(&TIME)     TYPE(*CHAR) LEN(26)
             DCL        VAR(&STAT)     TYPE(*CHAR) LEN(1)

/* Kaller opp program for oppdatering                                */

             CALL       PGM(HR721R) PARM(&TIME &STAT)

END:         ENDPGM
