             PGM        PARM(&FIRM &BNUM &BSUF &USER &STAT)

             DCL        VAR(&FIRM)     TYPE(*DEC) LEN(3 0)
/*6.nu*/     DCL        VAR(&BNUM)     TYPE(*DEC) LEN(8 0)
             DCL        VAR(&BSUF)     TYPE(*DEC) LEN(2 0)
             DCL        VAR(&USER)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&STAT)     TYPE(*CHAR) LEN(1)

/* Kaller opp program for oppdatering                                */

             CALL       PGM(HR731R) +
                        PARM(&FIRM &BNUM &BSUF &USER &STAT)

END:         ENDPGM
