             PGM        PARM(&PFEIL &PVALG)

/* Initiering av parametre                                           */

             DCL        VAR(&PFEIL)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&PVALG)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&LGRP)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&LFIR)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&LLAG)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&FFLR)   TYPE(*CHAR) LEN(10)

             dcl        var(&fradoc) type(*char) len(30)
             dcl        var(&framap) type(*char) len(30)
             dcl        var(&tillib) type(*char) len(10)
             dcl        var(&tilfil) type(*char) len(10)
             dcl        var(&tilmbr) type(*char) len(10)
             dcl        var(&fgr)    type(*char) len(3)
             dcl        var(&sts)    type(*char) len(8)

/* Bygger opp mappenavn av filgruppe,firma og lager                  */

             RTVDTAARA  DTAARA(*LDA (931 3))   RTNVAR(&LGRP)
             RTVDTAARA  DTAARA(*LDA (944 3))   RTNVAR(&LFIR)
             RTVDTAARA  DTAARA(*LDA (1001 2))  RTNVAR(&LLAG)
             CHGVAR     VAR(&FFLR) VALUE(&LGRP *CAT &LFIR  +
                            *CAT &LLAG *CAT '.I')

/* Initierer feil-flagg                                              */

             CHGVAR     VAR(&PFEIL) VALUE('0')

/* Tømmer håndterminalfil                                            */

             CLRPFM     FILE(HBTEPF)

/* Kopierer ekstern fil til håndterminalfil                          */

/*           CPYFRMPCD  FROMFLR(&FFLR) TOFILE(HBTEPF) +         */
/*                        FROMDOC(TELLING.TXT) MBROPT(*ADD)     */
/*           MONMSG     MSGID(CPF8A00) EXEC(GOTO CMDLBL(FEIL))  */
/*           MONMSG     MSGID(IWS1611) EXEC(GOTO CMDLBL(FEIL))  */
/*           MONMSG     MSGID(IWS1603)                          */
             rtvdtaara  dtaara(*lda (931 03)) rtnvar(&fgr)
             chgvar     var(&framap)  value('/ASP/' *cat +
                                             &fgr   *cat +
                                             '/' *cat &fflr)
             chgvar     var(&fradoc)  value('TELLING.TXT')
             chgvar     var(&tillib)  value('*LIBL')
             chgvar     var(&tilfil)  value('HBTEPF')
             chgvar     var(&tilmbr)  value('HBTEPF')
             chgvar     var(&sts)     value(' ')
             call       pgm(aspfrstmf) parm(+
                            &fradoc +
                            &framap +
                            &tillib +
                            &tilfil +
                            &tilmbr +
                            &sts)
             if         cond(&sts *ne ' ') then(goto cmdlbl(feil))
             DLTDLO     DLO(TELLING.TXT) FLR(&Framap)


/* Starter program avhengig av håndterminal                          */

             CALL       PGM(HT700R) PARM(&PVALG)

             GOTO       CMDLBL(END)

 FEIL:       CHGVAR     VAR(&PFEIL) VALUE('1')

 END:        ENDPGM
