             PGM        PARM(&P_FIRM &P_VSOR &P_DATO &P_KAT1 &P_KAT2 +
                             &P_KAT3 &P_KAT4 &P_KAT5 &MEMB &P_LAGE)

/* Initiering av parametre.                                          */

             DCL        VAR(&P_FIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P_VSOR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P_LAGE) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&P_DATO) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P_KAT1) TYPE(*DEC)  LEN(2)
             DCL        VAR(&P_KAT2) TYPE(*DEC)  LEN(2)
             DCL        VAR(&P_KAT3) TYPE(*DEC)  LEN(2)
             DCL        VAR(&P_KAT4) TYPE(*DEC)  LEN(2)
             DCL        VAR(&P_KAT5) TYPE(*DEC)  LEN(2)
             DCL        VAR(&WALI)   TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)   TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)   TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)   TYPE(*CHAR) LEN(40)
             DCL        VAR(&MEMB)   TYPE(*CHAR) LEN(10)

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(34)
             CHGVAR     VAR(&MLD1) VALUE('Rutinen finnes ikke!     ')
             CHGVAR     VAR(&MLD2) VALUE('Kontakt ASP for tilpasning.')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

             DLYJOB     DLY(000005)

 END:        ENDPGM
