/*                                                                   */
/*-------------------------------------------------------------------*/
/* Program for å lage indexer FOR byggmakk                           */
/*                                                                   */
             PGM

             DCL        VAR(&DLTID)   TYPE(*DEC)   LEN(1 0) VALUE(0)
             DCL        VAR(&DLTVI)   TYPE(*DEC)   LEN(1 0) VALUE(0)
             DCL        VAR(&DLTTR)   TYPE(*DEC)   LEN(1 0) VALUE(0)
             DCL        VAR(&CRTTR)   TYPE(*DEC)   LEN(1 0) VALUE(0)
             DCL        VAR(&CRTID)   TYPE(*DEC)   LEN(1 0) VALUE(1)
             DCL        VAR(&CRTVI)   TYPE(*DEC)   LEN(1 0) VALUE(0)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&LVRB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ENVB) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TBLE) TYPE(*CHAR) LEN(10)  VALUE(' ')


             CHGVAR     VAR(&ENVB) VALUE('A02')
             CHGVAR     VAR(&FGRP) VALUE('ADBA02')
             CHGVAR     VAR(&LVRB) VALUE('A02LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A04')
             CHGVAR     VAR(&FGRP) VALUE('ADBA04')
             CHGVAR     VAR(&LVRB) VALUE('A04LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A04')
             CHGVAR     VAR(&FGRP) VALUE('ADBA46')
             CHGVAR     VAR(&LVRB) VALUE('A04LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A05')
             CHGVAR     VAR(&FGRP) VALUE('ADBA05')
             CHGVAR     VAR(&LVRB) VALUE('A04LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A10')
             CHGVAR     VAR(&FGRP) VALUE('ADBA10')
             CHGVAR     VAR(&LVRB) VALUE('A10LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A19')
             CHGVAR     VAR(&FGRP) VALUE('ADBA19')
             CHGVAR     VAR(&LVRB) VALUE('A19LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A22')
             CHGVAR     VAR(&FGRP) VALUE('ADBA22')
             CHGVAR     VAR(&LVRB) VALUE('A22LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A26')
             CHGVAR     VAR(&FGRP) VALUE('ADBA26')
             CHGVAR     VAR(&LVRB) VALUE('A26LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A27')
             CHGVAR     VAR(&FGRP) VALUE('ADBA12')
             CHGVAR     VAR(&LVRB) VALUE('A27LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A27')
             CHGVAR     VAR(&FGRP) VALUE('ADBA24')
             CHGVAR     VAR(&LVRB) VALUE('A27LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A27')
             CHGVAR     VAR(&FGRP) VALUE('ADBA27')
             CHGVAR     VAR(&LVRB) VALUE('A27LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A27')
             CHGVAR     VAR(&FGRP) VALUE('ADBA28')
             CHGVAR     VAR(&LVRB) VALUE('A27LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A27')
             CHGVAR     VAR(&FGRP) VALUE('ADBA29')
             CHGVAR     VAR(&LVRB) VALUE('A27LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A31')
             CHGVAR     VAR(&FGRP) VALUE('ADBA31')
             CHGVAR     VAR(&LVRB) VALUE('A31LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A33')
             CHGVAR     VAR(&FGRP) VALUE('ADBA33')
             CHGVAR     VAR(&LVRB) VALUE('A33LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A33')
             CHGVAR     VAR(&FGRP) VALUE('ADBA33')
             CHGVAR     VAR(&LVRB) VALUE('A32LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A34')
             CHGVAR     VAR(&FGRP) VALUE('ADBA34')
             CHGVAR     VAR(&LVRB) VALUE('A34LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A36')
             CHGVAR     VAR(&FGRP) VALUE('ADBA36')
             CHGVAR     VAR(&LVRB) VALUE('A36LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A37')
             CHGVAR     VAR(&FGRP) VALUE('ADBA37')
             CHGVAR     VAR(&LVRB) VALUE('A37LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A38')
             CHGVAR     VAR(&FGRP) VALUE('ADBA38')
             CHGVAR     VAR(&LVRB) VALUE('A38LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A38')
             CHGVAR     VAR(&FGRP) VALUE('ADBA39')
             CHGVAR     VAR(&LVRB) VALUE('A38LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A38')
             CHGVAR     VAR(&FGRP) VALUE('ADBA40')
             CHGVAR     VAR(&LVRB) VALUE('A38LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A38')
             CHGVAR     VAR(&FGRP) VALUE('ADBA41')
             CHGVAR     VAR(&LVRB) VALUE('A38LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A38')
             CHGVAR     VAR(&FGRP) VALUE('ADBA42')
             CHGVAR     VAR(&LVRB) VALUE('A38LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A43')
             CHGVAR     VAR(&FGRP) VALUE('ADBA43')
             CHGVAR     VAR(&LVRB) VALUE('A43LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A43')
             CHGVAR     VAR(&FGRP) VALUE('ADBA44')
             CHGVAR     VAR(&LVRB) VALUE('A43LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A43')
             CHGVAR     VAR(&FGRP) VALUE('ADBA45')
             CHGVAR     VAR(&LVRB) VALUE('A43LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

             CHGVAR     VAR(&ENVB) VALUE('A50')
             CHGVAR     VAR(&FGRP) VALUE('ADBN50')
             CHGVAR     VAR(&LVRB) VALUE('N50LVR')
             CALL       PGM(AV121C) PARM(&DLTID &DLTVI &CRTTR &CRTID +
                          &CRTVI &DLTTR &FGRP &LVRB &ENVB &TBLE)

 END:        ENDPGM

