/*                                                                   */
/*-------------------------------------------------------------------*/
/* Program for å lage indexer                                        */
/*                                                                   */
/* angi filgrupppe og/eller lvrfilgruppe og/eller miljø              */
/*      og/eller tabell og/eller hva                                 */
/*                                                                   */
/* for mer info, se:                                                 */
/*    https://confluence.egretail.no/display/AS400/DBA+NX+indekser   */
/*                                                                   */
/* eks: CALL ASPGPLU630/IDXCRT PARM('630' 'ADBLVR630' 'A40')         */
/* eks: CALL ASPGPLU630/IDXCRT PARM('630' 'ADBLVR630' 'A40' 'VVARPF')*/
/* eks: CALL ASPGPLU630/IDXCRT PARM('630' 'ADBLVR630' 'A40' '*ALL')  */
/*                                                                   */
/*   hva:                                                            */
/*        (blank):  samme som 0                                      */
/*        0:  gjør 1 + 3                                             */
/*        1:  opprett SP                                             */
/*        2:  slett SP                                               */
/*        3:  kjør SP                                                */

             PGM        parm(&FGRP_P &LVRB_P &ENVB_P &TBLE_P &VER_P)

 /* Parametre                                                         */
             DCL        VAR(&FGRP_P)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&LVRB_P)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&ENVB_P)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&TBLE_P)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&DBIB)    TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&VER_P)   TYPE(*CHAR)  LEN(3)

             DCL        VAR(&VER)       TYPE(*DEC) LEN(3 0)
             DCL        VAR(&ENVB)      TYPE(*CHAR) LEN(3)

             IF         COND(&TBLE_P *EQ ' ') THEN(DO)
                CHGVAR     VAR(&TBLE_P) VALUE('*ALL')
             ENDDO

             IF         COND(&VER_P *EQ ' ') THEN(DO)
                RTVDTAARA  DTAARA(*LDA (1003 3)) RTNVAR(&ENVB)
                call       pgm(AR700R) parm(&ENVB &VER)
                CHGVAR     VAR(&VER_P) VALUE(%CHAR(&VER))
             ENDDO


 /* FGR  */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP_P)
             CHGCURLIB  CURLIB(&DBIB)

             RUNSQL     SQL('CALL ADB.SP_NEXSTEP_CREATE_IX_' *CAT &VER_P +
                          *CAT '(''' *cat &DBIB *bcat ''',''' *cat &TBLE_P +
                          *bcat ''')') COMMIT(*NONE) NAMING(*SYS) +
                          DECMPT(*COMMA) SRTSEQ(*LANGIDUNQ) LANGID(NOR)

      /* 2DP  */
                /* Har filgruppen 2DP ? */
             CHKOBJ     OBJ(BOSERVERS) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
                GOTO       CMDLBL(LVR)
             ENDDO

             RUNSQL     SQL('CALL ADB.SP_NEXSTEP_CREATE_2DP_IX_' *CAT +
                          &VER_P *CAT '(''' *cat &DBIB *bcat ''',''' *cat +
                          &TBLE_P *bcat ''')') COMMIT(*NONE) NAMING(*SYS) +
                          DECMPT(*COMMA) SRTSEQ(*LANGIDUNQ) LANGID(NOR)


 /* LVR  */
 LVR:
             IF         COND(&LVRB_P *EQ ' ') THEN(DO)
                GOTO       CMDLBL(ENV)
             ENDDO


             CHGCURLIB  CURLIB(&LVRB_P)
             ADDLIBLE   &DBIB
             MONMSG     MSGID(CPF2103)

             RUNSQL     SQL('CALL ADB.SP_NEXSTEP_CREATE_LVR_IX_' *CAT +
                          &VER_P *CAT '(''' *cat &LVRB_P *bcat ''',''' +
                          *cat &TBLE_P *bcat ''')') COMMIT(*NONE) +
                          NAMING(*SYS) DECMPT(*COMMA) SRTSEQ(*LANGIDUNQ) +
                          LANGID(NOR)

             CHGCURLIB  CURLIB(&DBIB)
             ADDLIBLE   &LVRB_P
             MONMSG     MSGID(CPF2103)

 /* ENV  */
 ENV:
             IF         COND(&ENVB_P *EQ ' ') THEN(DO)
                GOTO       CMDLBL(END)
             ENDDO

             CHGCURLIB  CURLIB(&ENVB_P)
             ADDLIBLE   &DBIB
             MONMSG     MSGID(CPF2103)

             RUNSQL     SQL('CALL ADB.SP_NEXSTEP_CREATE_ENV_IX_' *CAT +
                          &VER_P *CAT '(''' *cat &ENVB *bcat ''',''' *cat +
                          &TBLE_P *bcat ''')') COMMIT(*NONE) NAMING(*SYS) +
                          DECMPT(*COMMA) SRTSEQ(*LANGIDUNQ) LANGID(NOR)

             CHGCURLIB  CURLIB(&DBIB)
             ADDLIBLE   &ENVB_P
             MONMSG     MSGID(CPF2103)


 END:        ENDPGM

