             PGM
             DCLF       FILE(IG096D)
             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             DCL        VAR(&FGRP)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL)     TYPE(*CHAR) LEN(1)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             RTVDTAARA  DTAARA(*LDA (931 3))  RTNVAR(&FGRP)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1BLD)

/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/*  Generer de valgte registere                                      */

             IF         COND(&VA01 *EQ '1') THEN(DO)
                CALL       PGM(AG908C) PARM('IORDST' &FGRP '*NONE' &NULL)
             ENDDO

             IF         COND(&VA02 *EQ '1') THEN(DO)
                CALL       PGM(AG908C) PARM('IBUTST' &FGRP '*NONE' &NULL)
             ENDDO

             IF         COND(&VA03 *EQ '1') THEN(DO)
                CALL       PGM(AG908C) PARM('IINKST' &FGRP '*NONE' &NULL)
             ENDDO

             IF         COND(&VA09 *EQ '1') THEN(DO)
                CALL       PGM(AG908C) PARM('IKONST' &FGRP '*NONE' &NULL)
             ENDDO

 ENDPGM:     ENDPGM
