             PGM
             DCLF       FILE(IG093D)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&NAVK)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&STAT)     TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&DROP)     TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&SVAR)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&MLD1)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&MLD2)     TYPE(*CHAR) LEN(50)

             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sjekker om NAV kode er satt og Nexstep økonomi skal droppes       */

 SJEKK:      CALL       PGM(IG098R) PARM(&STAT &DROP)
             IF         COND(&STAT *EQ 1) THEN(DO)
             CHGVAR     VAR(&IN40) VALUE('1')
             ENDDO
             IF         COND(&STAT *EQ 0) THEN(DO)
             CHGVAR     VAR(&IN40) VALUE('0')
             ENDDO
             IF         COND(&DROP *EQ 1) THEN(DO)
             CHGVAR     VAR(&IN41) VALUE('1')
             ENDDO
             IF         COND(&DROP *EQ 0) THEN(DO)
             CHGVAR     VAR(&IN41) VALUE('0')
             ENDDO

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&LEVL)     VALUE('30')
             CHGVAR     VAR(&OKOK)     VALUE('  ')
             CALL       PGM(AA050C)    PARM(&LEVL &OKOK)
             IF         COND(&OKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(IG120R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(IG121R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(IG122R)
             GOTO       CMDLBL(START)
             ENDDO


/* Valg 4                                                            */
             IF         COND(&VALG *EQ 4) THEN(DO)
             WRKACTJOB  SBS(NAVSYNC)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5                                                            */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(IG100C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6                                                            */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(IG103C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7                                                            */
             IF         COND(&VALG *EQ 7) THEN(DO)
                WRKJOBSCDE JOB(NAVSYNC*)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8                                                            */
             IF         COND(&VALG *EQ 8) THEN(DO)
                CALL       PGM(IG101C)
                GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
