             PGM
             DCLF       FILE(IG094D)
             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1BLD)

/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/*  Replikerer de valgte registere                                   */

             IF         COND(&VA01 *EQ '1') THEN(DO)
             CALL       PGM(IT010R)
             ENDDO

             IF         COND(&VA02 *EQ '1') THEN(DO)
             CALL       PGM(IT011R)
             ENDDO

             IF         COND(&VA03 *EQ '1') THEN(DO)
             CALL       PGM(IT012R)
             ENDDO

             IF         COND(&VA04 *EQ '1') THEN(DO)
             CALL       PGM(IT013R)
             ENDDO

             IF         COND(&VA05 *EQ '1') THEN(DO)
             CALL       PGM(IT014R)
             ENDDO

             IF         COND(&VA06 *EQ '1') THEN(DO)
             CALL       PGM(IT015R)
             ENDDO

             IF         COND(&VA07 *EQ '1') THEN(DO)
             CALL       PGM(IT016R)
             ENDDO

             IF         COND(&VA08 *EQ '1') THEN(DO)
             CALL       PGM(IT017R)
             ENDDO

             IF         COND(&VA09 *EQ '1') THEN(DO)
             CALL       PGM(IT019R)
             ENDDO

             IF         COND(&VA10 *EQ '1') THEN(DO)
             CALL       PGM(IT025R)
             ENDDO

 ENDPGM:     ENDPGM
