             PGM

             DCL        VAR(&FIG) TYPE(*CHAR) LEN(3)
             RTVDTAARA  DTAARA(*LDA (931 3)) RTNVAR(&FIG)

             CALL       PGM(AW710C) PARM(&FIG)

 ENDPGM:     ENDPGM
