             PGM

             DCL        VAR(&FIG) TYPE(*CHAR) LEN(3)
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)

             RTVDTAARA  DTAARA(*LDA (931 3)) RTNVAR(&FIG)
             CHGVAR     VAR(&JOB) VALUE('NAVSYNC' *CAT &FIG)

             SBMJOB     CMD(CALL PGM(IT100C) PARM(&FIG)) JOB(&JOB) +
                          JOBD(*LIBL/NAVSYNC) +
                          JOBQ(*LIBL/NAVSYNC) JOBPTY(4)

             ENDPGM
