/*                                                                   */
/*           Generere   Fil for perioder lønn til prosjekt           */
/*                      ILKAPF                                       */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(10) VALUE('*LIBL')
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('ILKABF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('ILKAPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('ILKALU')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('ILKAL1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('ILKAL2')
             DCL        VAR(&WPRGL3) TYPE(*CHAR) LEN(6) VALUE('ILKALR')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG103C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU +
                          &wprgl1 &wprgl2 &wprgl3)
/*                                                                   */
/*                                                                   */
 ENDPGM:     ENDPGM
