/*                                                                   */
/*           Generere   TRANSFILE REGISTRERING LØNN MDS              */
/*                      ILTRPF                                       */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(10) VALUE('*LIBL')
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('ILTRBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('ILTRPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('ILTRLU')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('ILTRL1')
/* Utgår     DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('ILTRL2') */
/* Utgår     DCL        VAR(&WPRGL3) TYPE(*CHAR) LEN(6) VALUE('ILTRL3') */
             DCL        VAR(&WPRGL4) TYPE(*CHAR) LEN(6) VALUE('ILTRL4')
             DCL        VAR(&WPRGL5) TYPE(*CHAR) LEN(6) VALUE('ILTRL5')
             DCL        VAR(&WPRGL6) TYPE(*CHAR) LEN(6) VALUE('ILTRL6')
             DCL        VAR(&WPRGL7) TYPE(*CHAR) LEN(6) VALUE('ILTRL7')
             DCL        VAR(&WPRGL8) TYPE(*CHAR) LEN(6) VALUE('ILTRL8')
             DCL        VAR(&WPRGL9) TYPE(*CHAR) LEN(6) VALUE('ILTRL9')
             DCL        VAR(&WPRGLA) TYPE(*CHAR) LEN(6) VALUE('ILTRLA')
             DCL        VAR(&WPRGLB) TYPE(*CHAR) LEN(6) VALUE('ILTRLB')
             DCL        VAR(&WPRGLC) TYPE(*CHAR) LEN(6) VALUE('ILTRLC')
             DCL        VAR(&WPRGLD) TYPE(*CHAR) LEN(6) VALUE('ILTRLD')
             DCL        VAR(&WPTXPF) TYPE(*CHAR) LEN(50) +
VALUE('Registrert lønn til ordre/lønn  PF                ')
             DCL        VAR(&WPTXLU) TYPE(*CHAR) LEN(50) +
VALUE('Registrert lønn til ordre/lønn  LU                ')
             DCL        VAR(&WPTXL1) TYPE(*CHAR) LEN(50) +
VALUE('Registrert lønn til ordre/lønn  L1                ')
             DCL        VAR(&WPTXL2) TYPE(*CHAR) LEN(50) +
VALUE('Registrert lønn til ordre/lønn  Lønnr. onr, linje')
             DCL        VAR(&WPTXL3) TYPE(*CHAR) LEN(50) +
VALUE('Registrert lønn til ordre/lønn  Klient, onr, art')
             DCL        VAR(&WPTXL4) TYPE(*CHAR) LEN(50) +
VALUE('Registrert lønn til ordre/lønn  Linje.          ')
             DCL        VAR(&WPTXL5) TYPE(*CHAR) LEN(50) +
VALUE('Registrert lønn Lønnsnr./periode/dato.          ')
             DCL        VAR(&WPTXL6) TYPE(*CHAR) LEN(50) +
VALUE('Registrert lønn Ordrenr./periode/dato.          ')
             DCL        VAR(&WPTXL7) TYPE(*CHAR) LEN(50) +
VALUE('Registrert lønn Oppd.L/O, Klient, Lønnsnr, Linje')
             DCL        VAR(&WPTXL8) TYPE(*CHAR) LEN(50) +
VALUE('Registrert lønn Klient, Per.,Lnr, Fra Dato      ')
             DCL        VAR(&WPTXL9) TYPE(*CHAR) LEN(50) +
VALUE('Registrert lønn Klient, Onr.,Art,               ')
             DCL        VAR(&WPTXLA) TYPE(*CHAR) LEN(50) +
VALUE('Registrert Onr, HM-Linje                        ')
             DCL        VAR(&WPTXLB) TYPE(*CHAR) LEN(50) +
VALUE('Registrert Per, Onr, Lnr, Lin  Bare til oppdat  ')
             DCL        VAR(&WPTXLC) TYPE(*CHAR) LEN(50) +
VALUE('Registrert Sporings-Linjenr                     ')
             DCL        VAR(&WPTXLD) TYPE(*CHAR) LEN(50) +
VALUE('Registrert lønn, timeliste attestering         ')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG111C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +
                          &WPRGL4 &WPRGL5 &WPRGL6 +
                          &WPRGL7 &WPRGL8 &WPRGL9 &WPRGLA &wprglb +
                          &WPRGLC &WPRGLD)
/*                                                                   */
/*           CALL       PGM(IG113C) PARM(&WPFGRP &WPNULL &WPDBIB +   */
/*                        &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +  */
/*                        &WPRGL2 &WPRGL3 &WPRGL4 &WPRGL5 &WPRGL6 +  */
/*                        &WPRGL7 &WPRGL8 &WPRGL9 &WPRGLA &wprglb +  */
/*                        &WPRGLC &WPRGLD +                          */
/*                        &WPTXPF &WPTXLU &WPTXL1 &WPTXL2 &WPTXL3 +  */
/*                        &WPTXL4 &WPTXL5 &WPTXL6 &WPTXL7 &WPTXL8 +  */
/*                        &WPTXL9 &WPTXLA &wptxlb &wptxlc &wptxld)   */
/*                                                                   */
/*                                                                   */
 ENDPGM:     ENDPGM
