             PGM        PARM(&LIST)

/* Initiering av parametre.                                          */

             DCL        VAR(&LIST) TYPE(*CHAR) LEN(64)

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&RAPP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&RAPP) VALUE('JH601P')

/* Oppdaterer LDA med navn på printfile                              */

             CHGDTAARA  DTAARA(*LDA (846 10)) VALUE(&RAPP)

/* Oppkall av utskriftsparametre.                                    */

             CALL       PGM(AP600R) PARM('JH601R' '1' '0' &IN03 &BTCH)

/* Dersom F3 skal ikke rapporten skrives                             */

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift av rapport                                               */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(JH601C) PARM(&LIST)) JOB(UTSKR_AVT) +
                          MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/JH601C) PARM(&LIST))

 END:        ENDPGM
