
/*           logistikkvare                                        */

 STRPGM:     PGM

             DCL        VAR(&DLDO) TYPE(*DEC) LEN(6)

             /* legg inn default logistikk leverandør  */
             /* sett den evt til 0, hvis ikke valgt    */
             CHGVAR     VAR(&DLDO) VALUE(900010)
/*              CHGVAR     VAR(&DLDO) VALUE(0)                                */

             CALL       PGM(JK100R) PARM(&DLDO)

 ENDPGM:     ENDPGM
