             PGM
             DCLF       FILE(JM06)
             DCL        VAR(&APFNAV) TYPE(*CHAR) LEN(30)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)
/*                                                                   */
/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)
/*                                                                   */
/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/* F22                                                               */
             IF         COND(&IN22) THEN(DO)
             CALL       PGM(FINFO)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(JV100R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(JL100R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 4                                                            */
             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(JO100R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 6                                                            */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(JO600R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 7                                                            */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(JO610R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 9                                                            */
             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(JO700R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 11                                                           */
             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       PGM(JO730R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 12                                                           */
             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(JO720R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 13                                                           */
             IF         COND(&VALG *EQ 13) THEN(DO)
             CALL       PGM(JO710R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 15                                                           */
             IF         COND(&VALG *EQ 15) THEN(DO)
             CALL       PGM(JO712R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 16                                                           */
             IF         COND(&VALG *EQ 16) THEN(DO)
             CALL       PGM(JO714R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 19                                                           */
             IF         COND(&VALG *EQ 19) THEN(DO)
             CALL       PGM(JO650R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 20                                                           */
             IF         COND(&VALG *EQ 20) THEN(DO)
             CALL       PGM(JO750R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 21                                                           */
             IF         COND(&VALG *EQ 21) THEN(DO)
             CALL       PGM(JM21)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO
/*                                                                   */
/* Gå til start                                                      */
             GOTO       CMDLBL(START)
/*                                                                   */
 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)
/*                                                                   */
/* Slutt                                                             */
 ENDPGM:     ENDPGM
