             PGM        PARM(&LIST)

/*8.01 PRG2 060722 bof : utvidet prisgruppe fra 1 til 2 posisjoner        */
/* Initiering av parametre.                                          */

             DCL        VAR(&LIST) TYPE(*CHAR) LEN(55) /*8.01*/

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&RAPP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&RAPP) VALUE('JM621P')

/* Oppdaterer LDA med navn på printfile                              */

             CHGDTAARA  DTAARA(*LDA (846 10)) VALUE(&RAPP)

/* Oppkall av utskriftsparametre.                                    */

             CALL       PGM(AP600R) PARM('JM621' '1' '0' &IN03 &BTCH)

/* Dersom F3 skal ikke rapporten skrives                             */

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(JM621C) PARM(&LIST)) JOB(KAMPANJE) +
                          MSGQ(*NONE))
             ELSE       CMD(CALL PGM(JM621C) PARM(&LIST))

 END:        ENDPGM
