             PGM        PARM(&FLDR &FEIL)

/* Initiering av parametre.                                          */

             DCL        VAR(&FLDR) TYPE(*CHAR) LEN(20)
             DCL        VAR(&FEIL) TYPE(*CHAR) LEN(1)

/* Parametre som brukes for å hente data fra IFS området             */

             dcl        var(&fradoc) type(*char) len(30)
             dcl        var(&framap) type(*char) len(30)
             dcl        var(&tillib) type(*char) len(10)
             dcl        var(&tilfil) type(*char) len(10)
             dcl        var(&tilmbr) type(*char) len(10)
             dcl        var(&fgr)    type(*char) len(3)
             dcl        var(&sts)    type(*char) len(8)

             MONMSG     MSGID(CPF8A00) EXEC(GOTO CMDLBL(FEIL))
             MONMSG     MSGID(IWS1611) EXEC(GOTO CMDLBL(FEIL))

/* Initierer feil-flagg                                              */

             CHGVAR     VAR(&FEIL) VALUE('0')

/* Tømmer pc-overførte tabeller på AS/400                            */

             CLRPFM     FILE(PCBETPF)
             CLRPFM     FILE(PCRAEPF)

/* Tømmer fil for endringslogg                                       */
             CLRPFM     FILE(JWRKPF)

/* Kopierer innhold fra PC-fil i mappe over til AS/400-filer         */

/*           CPYFRMPCD  FROMFLR(&FLDR) TOFILE(PCBETPF) +      */
/*                        FROMDOC(REGLER.TXT)                 */
             rtvdtaara  dtaara(*lda (931 03)) rtnvar(&fgr)
             chgvar     var(&framap)  value('/ASP' *cat +
                                             '/' *cat &fldr)
/*    lå forann forrige linje                &fgr   *cat +   */
             chgvar     var(&fradoc)  value('REGLER.TXT')
             chgvar     var(&tillib)  value(&fgr *cat 'LVR')
             chgvar     var(&tilfil)  value('PCBETPF')
             chgvar     var(&tilmbr)  value('PCBETPF')
             chgvar     var(&sts)     value(' ')  /* 'A' dersom *Add */
             call       pgm(aspfrstmf) parm(+
                            &fradoc +
                            &framap +
                            &tillib +
                            &tilfil +
                            &tilmbr +
                            &sts)
             if         cond(&sts *ne ' ') then(goto cmdlbl(feil))

/*           CPYFRMPCD  FROMFLR(&FLDR) TOFILE(PCRAEPF) +     */
/*                        FROMDOC(ELEMENT.TXT)               */
             chgvar     var(&fradoc)  value('ELEMENT.TXT')
             chgvar     var(&tillib)  value(&fgr *cat 'LVR')
/*           chgvar     var(&tillib)  value('*LIBL')         */
             chgvar     var(&tilfil)  value('PCRAEPF')
             chgvar     var(&tilmbr)  value('PCRAEPF')
             chgvar     var(&sts)     value(' ')  /* 'A' dersom *Add */
             call       pgm(aspfrstmf) parm(+
                            &fradoc +
                            &framap +
                            &tillib +
                            &tilfil +
                            &tilmbr +
                            &sts)
             if         cond(&sts *ne ' ') then(goto cmdlbl(feil))

/* Kopiere JRAEPF til JRAWPF for å sammenligne i nytt og gammelt    */
             CPYF       FROMFILE(*LIBL/JRAEPF) TOFILE(*LIBL/JRAWPF) +
                          MBROPT(*REPLACE)

/* Kopiere JBETPF til JBEWPF for å sammenligne i nytt og gammelt    */
             CPYF       FROMFILE(*LIBL/JBETPF) TOFILE(*LIBL/JBEWPF) +
                          MBROPT(*REPLACE)


             GOTO       CMDLBL(END)

 FEIL:       CHGVAR     VAR(&FEIL) VALUE('1')

 END:        ENDPGM
