             PGM        PARM(&FGRT)

/* Initiering av parametre.                                          */

             DCL        VAR(&FGRT) TYPE(*CHAR) LEN(3)
             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10) VALUE('ADBxxx')

             MONMSG     MSGID(CPF2981) EXEC(GOTO CMDLBL(END))
/* Overrider oppdateringsindekser mot filgruppe som skal behandles   */

             CHGVAR     VAR(%SST(&DLIB 4 3)) VALUE(&FGRT)

             OVRDBF     FILE(JBETL1) TOFILE(&DLIB/JBETL1) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(JBETLA) TOFILE(&DLIB/JBETLA) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(JBETLU) TOFILE(&DLIB/JBETLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(JRAELU) TOFILE(&DLIB/JRAELU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)

/* Kopiere JRAEPF til JRAWPF for å sammenligne i nytt og gammelt    */
             CPYF       FROMFILE(&DLIB/JRAEPF) TOFILE(&DLIB/JRAWPF) +
                          MBROPT(*REPLACE)

             OVRDBF     FILE(JRAWL1) TOFILE(&DLIB/JRAWL1) +
                          MBR(*FIRST) OVRSCOPE(*JOB)


             CALL       PGM(JP701R)

 END:        ENDPGM
