/*----------------------------------------------------------------------------*/
/* 140617 ARENG: Behandler NOBB kontrakter i XML-format                       */
/*                                                                            */
/* Beskrivelse av parametre:                                                  */
/* FILENAME=Navnet på XML fil som skal behandles                              */
/* LENGDE=Lengde på filnavn som skal behandles                                */
/*                                                                            */
/* Eksempel på kall:                                                          */
/* CALL PGM(ASUTVK_MPO/JP742C) PARM('/home/ASP_MPO/avtxml/rockwool.XML' ' ')  */
/*                                                                            */
/*  status :                                                                  */
/*  '  ' = ok                                                                 */
/*             'F'        = generell feil                                     */
/*             'C'        = feil karakter i filen                             */
/*             'N'        = filen ikke funnet                                 */
/*                          funnet                                            */
/*                                                                            */
/*----------------------------------------------------------------------------*/

             PGM        PARM(&FILENAME &STAT &LDORARRAY)

 /* Parametre                                                         */
             DCL        VAR(&FILENAME)  TYPE(*CHAR) LEN(255)
 /*status -retur fra program.  */
             DCL        VAR(&STAT)      TYPE(*CHAR) LEN(1)

/*  array for retur av opptil 2000 leverandørnumre   */
             DCL        VAR(&LDORARRAY) TYPE(*CHAR) LEN(12000)

/* antall leverandører som returneres */
             dcl        VAR(&NUMLDORS)  type(*DEC)  len(4)

/* clear av JBEIPF / JRAIPF */
/*           CLRPFM     FILE(JBEIPF)      */
/*           CLRPFM     FILE(JRAIPF)      */

             CALL       PGM(JP742R) PARM(&FILENAME &LDORARRAY &NUMLDORS +
                          &STAT)


 END:        ENDPGM
