             PGM        parm(&fgr)
             dcl        var(&fgr)   type(*char)   len(3)
             dcl        var(&lib)   type(*char)   len(10)  value('ADB')

/* Endre XXX i parm til rette filgruppe */
             CALL       PGM(AA724C) PARM(&fgr)

/* Endre XXX her også, AA720C gir ikke alltid riktig filgruppe */
             chgvar     %sst(&lib 4 3)  value(&fgr)
             CHGCURLIB  CURLIB(&lib)

/*           DLYJOB     DLY(5)    */

/* Program som danner all eksport av std.betingelser/påslag */

             CALL       PGM(JP785R)
/* Program som importerer prisforslag fra mgpris       */
             CALL       PGM(MG162C)


 END:        ENDPGM
