             PGM        PARM(&LIST &WJOB)

             DCL        VAR(&LIST) TYPE(*CHAR) LEN(32)
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

/* Kall til styreprogram                                             */

             CALL       PGM(JR153R) PARM(&LIST)

/* Ferdigmelding                                                     */

             SNDBRKMSG  MSG('ASVADM: Varer/priser er lest inn fra +
                          rapportør') TOMSGQ(&WJOB)

 END:        ENDPGM
