             PGM        PARM(&navn &fldr)

             DCL        VAR(&navn) TYPE(*CHAR) LEN(12)
             DCL        VAR(&fldr) TYPE(*CHAR) LEN(20)
             DCL        VAR(&tild)  TYPE(*CHAR) LEN(25)
             DCL        VAR(&tilm)  TYPE(*CHAR) LEN(20)

/*           CPYTOPCD   FROMFILE(JWRKPF) TOFLR(&fldr) TODOC(&NAVN) + */
/*                        REPLACE(*YES)                              */
             chgvar     var(&tild) value(&navn)
             chgvar     var(&tilm) value(&fldr)
             call       pgm(asptostmf) +
                        parm('JWRKPF    ' +
                             'JWRKPF    ' +
                             &tilm +
                             &tild   +
                             '   ')

 END:        ENDPGM
