             PGM        PARM(&LIST &WJOB)

             DCL        VAR(&LIST) TYPE(*CHAR) LEN(20)
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

/* Kall til styreprogram                                             */

             CALL       PGM(JV411R) PARM(&LIST)

/* Ferdigmelding                                                     */

             SNDBRKMSG  MSG('ASVADM: Sletting av utgåtte varer er +
                          ferdig') TOMSGQ(&WJOB)

 END:        ENDPGM
