             PGM        PARM(&LIST)

             DCL        VAR(&LIST) TYPE(*CHAR) LEN(20)

             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

/* Henter jobb-nummer                                                */

             RTVJOBA    JOB(&WJOB)

/* Submitter kall til slette-program                                 */

             SBMJOB     CMD(CALL PGM(JV411C) PARM(&LIST &WJOB)) +
                          JOB(SLETT_VARE) MSGQ(*NONE)

 END:        ENDPGM
