/*7.01*/     PGM        PARM(&LIST &VARE &VUTS)

/* Initiering av parametre.                                          */

             DCL        VAR(&LIST) TYPE(*CHAR) LEN(50)
             DCL        VAR(&VARE) TYPE(*CHAR) LEN(15)

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&RAPP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
/*6.30*/     dcl        var(&excl) type(*char) len(1)
/*6.30*/     dcl        var(&skje) type(*char) len(1)
/*6.30*/     dcl        var(&mail) type(*char) len(1)
/*7.01*/     dcl        var(&vuts) type(*char) len(1)

             CHGVAR     VAR(&RAPP) VALUE('JV621P')

/* Oppdaterer LDA med navn på printfile                              */

             CHGDTAARA  DTAARA(*LDA (846 10)) VALUE(&RAPP)

/* Oppkall av utskriftsparametre.                                    */

             CALL       PGM(AP600R) PARM('JV621R' '1' '0' &IN03 &BTCH)

/* Dersom F3 skal ikke rapporten skrives                             */

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Henter opplysning om utskriften skal kjøres i batch fra LDA       */

/*6.30*/     rtvdtaara  dtaara(*lda (639 1)) rtnvar(&excl)
/*6.30*/     rtvdtaara  dtaara(*lda (640 1)) rtnvar(&mail)
/*6.30*/     rtvdtaara  dtaara(*lda (637 1)) rtnvar(&skje)

/*6.30*/     if         cond(&excl *eq '1') then(chgvar +
/*6.30*/                    var(&btch) value('0'))
/*6.30*/     if         cond(&mail *eq '1') then(chgvar +
/*6.30*/                    var(&btch) value('0'))
/*6.30*/     if         cond(&skje *eq '1') then(chgvar +
/*6.30*/                    var(&btch) value('0'))

/*6.30*/     strpco     pcta(*no)
/*6.30*/     monmsg msgid(iws4010)

/* Utskrift                                                          */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
/*7.01*/                  PGM(JV621C) PARM(&LIST &VARE &VUTS)) +
/*7.01*/                  JOB(NYE_EVR) MSGQ(*NONE))
/*7.01*/     ELSE       CMD(CALL PGM(*LIBL/JV621C) PARM(&LIST &VARE &VUTS))

 END:        ENDPGM
