             PGM        PARM(&FORM)

/* Initiering av parametre.                                          */

             DCL        VAR(&FORM) TYPE(*CHAR) LEN(1)

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&RAPP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&RAPP) VALUE('JV681P')

/* Oppdaterer LDA med navn på printfile                              */

             CHGDTAARA  DTAARA(*LDA (846 10)) VALUE(&RAPP)

/* Oppkall av utskriftsparametre.                                    */

             CALL       PGM(AP600R) PARM('JV681' '1' '0' &IN03 &BTCH)

/* Dersom F3 skal ikke rapporten skrives                             */

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(JV681C) PARM(&FORM)) JOB(UTSKR_PRIS) +
                          MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/JV681C) PARM(&FORM))
 END:        ENDPGM
