             PGM        PARM(&FGRM &MFIR &FGRT &TFIR &VSOR)
/*                                                                   */
             DCL        VAR(&FGRM)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&MFIR)  TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&FGRT)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&TFIR)  TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&VSOR)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&MFGRP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TFGRP) TYPE(*CHAR) LEN(10)

/* Setter filgrupper for master og filgruppe til                     */
             CHGVAR     VAR(&MFGRP) VALUE('ADB' *CAT &FGRM)
             CHGVAR     VAR(&TFGRP) VALUE('ADB' *CAT &FGRT)


/* Override parameterfilene/membrene                                 */

/* master                                                            */
             OVRDBF     FILE(VEANL1) TOFILE(&MFGRP/VEANL1)
             OVRDBF     FILE(VVARL1) TOFILE(&MFGRP/VVARL1)
/* til filgr.                                                        */
             OVRDBF     FILE(VSDTLU) TOFILE(&TFGRP/VSDTLU)
             OVRDBF     FILE(JVSCL1) TOFILE(&TFGRP/JVSCL1)
             OVRDBF     FILE(JVSCLU) TOFILE(&TFGRP/JVSCLU)
             OVRDBF     FILE(JVDTLU) TOFILE(&TFGRP/JVDTLU)

/*                                                                   */
             CALL PGM(JV873R) PARM(&MFIR &TFIR &VSOR)
/*                                                                   */
/* Override av parametermembrene oppheves                            */
/*                                                                   */
             DLTOVR     FILE(VVARL1)
             DLTOVR     FILE(VEANL1)
             DLTOVR     FILE(VSDTLU)
             DLTOVR     FILE(JVSCLU)
             DLTOVR     FILE(JVSCL1)
             DLTOVR     FILE(JVDTLU)
/*                                                                   */

/*                                                                   */
             ENDPGM
