             PGM        PARM(&LIST)

             DCL        VAR(&LIST) TYPE(*CHAR) LEN(20)

             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

/* Henter jobb-nummer                                                */

             RTVJOBA    JOB(&WJOB)

/* Submitter kall til slette-program                                 */

             SBMJOB     CMD(CALL PGM(JX431C) PARM(&LIST &WJOB)) +
                          JOB(SLETT_PRIS) MSGQ(*NONE)
/*           CALL PGM(JX431C) PARM(&LIST &WJOB)                    */

 END:        ENDPGM
