             PGM        PARM(&FILE &FLDR &FEIL)

/* Initiering av parametre.                                          */

             DCL        VAR(&FILE)     TYPE(*CHAR) LEN(12)
             DCL        VAR(&FLDR)     TYPE(*CHAR) LEN(20)
             DCL        VAR(&FEIL)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&tild)     TYPE(*CHAR) LEN(25)
             DCL        VAR(&tilm)     TYPE(*CHAR) LEN(20)

             MONMSG     MSGID(CPF8A00) EXEC(GOTO CMDLBL(FEIL))
             MONMSG     MSGID(IWS1611) EXEC(GOTO CMDLBL(FEIL))

/* Initierer feil-flagg                                              */

             CHGVAR     VAR(&FEIL) VALUE('0')

/* Tømmer pc-overført  tabell på AS/400                              */

             CLRPFM     FILE(lwexpf)

/* Kopierer innhold fra PC-fil i mappe over til AS/400-filer         */

/*              CPYTOPCD   FROMFILE(LWEXPF) TOFLR(&FLDR) TODOC(&FILE) +       */
/*                           REPLACE(*YES)                                    */

             chgvar     var(&tilm) value(&FLDR)
             chgvar     var(&tild) value(&FILE)
             call       pgm(asptostmf) parm('LWEXPF    ' 'LWEXPF    ' +
                          &tilm &tild '   ')

             GOTO       CMDLBL(END)

 FEIL:       CHGVAR     VAR(&FEIL) VALUE('1')

 END:        ENDPGM
