             PGM        PARM(&FILE &FLDR &WJOB)
/* 210820 BOF : rettelse vedr. qdls og IFS     */
             DCL        VAR(&FILE)  TYPE(*CHAR) LEN(12)
             DCL        VAR(&FLDR)  TYPE(*CHAR) LEN(20)
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FEIL) TYPE(*CHAR) LEN(1) +
                        VALUE(' ')
             DCL        VAR(&tild)     TYPE(*CHAR) LEN(25)
             DCL        VAR(&tilm)     TYPE(*CHAR) LEN(20)

/* Kall til sletteprogram                                           */

             CALL       PGM(JX481R)

             IF         COND(&FLDR *EQ ' ') THEN(DO)
             GOTO CMDLBL(FEIL)
             ENDDO

/* Kopiere til qdls                                                */

/*              CPYTOPCD   FROMFILE(LWEXPF) TOFLR(&FLDR)    +                 */
/*                          TODOC(&FILE) REPLACE(*YES)                        */
             chgvar     var(&tilm) value(&FLDR)
             chgvar     var(&tild) value(&FILE)
             call       pgm(asptostmf) parm('LWEXPF    ' 'LWEXPF    ' +
                          &tilm &tild '   ')


/* Ferdigmelding                                                     */
 FERDIG:
             SNDBRKMSG  MSG('ASVADM: Priser er slettet/listet')  +
                        TOMSGQ(&WJOB)
             GOTO CMDLBL(END)

 FEIL:
             SNDBRKMSG  MSG('ASVADM: Feil ved slette/listing') +
                          TOMSGQ(&WJOB)

 END:        ENDPGM
