             PGM        PARM(&FILE &FLDR)

             DCL        VAR(&FILE)  TYPE(*CHAR) LEN(12)
             DCL        VAR(&FLDR)  TYPE(*CHAR) LEN(20)
             DCL        VAR(&WJOB)  TYPE(*CHAR) LEN(10)
/* Henter jobb-nummer                                                */

             RTVJOBA    JOB(&WJOB)


/*                                                                   */
             CLRPFM     FILE(LWEXPF)
/*                                                                   */
/* Submitter kall til styreprogram listing                           */

           SBMJOB CMD(CALL PGM(JX484C)  PARM(&FILE &FLDR &WJOB)) +
                          JOB(LIST_PRIS) MSGQ(*NONE)
             MONMSG     MSGID(CPF0000)
/*                                                                   */

/*                                                                   */
 ENDPGM:     ENDPGM
