             PGM        PARM(&FGRP)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)

             CALL       PGM(BG100C) PARM(&FGRP &NULL)
             CALL       PGM(RGUKRC) PARM(&FGRP &NULL)
             CALL       PGM(BÅ910C) PARM('BBKKST' &FGRP &NULL)


 ENDPGM:     ENDPGM
