/*                                                                   */
/*           KONVERTERE HOVEDGRUPPEREGISTER                          */
/*                                                                   */
             PGM        PARM(&FPGRUP)
             DCL        VAR(&FPGRUP) TYPE(*CHAR) LEN(03)
             DCL        VAR(&KODER) TYPE(*CHAR) LEN(8) VALUE('Rxxx.RA0')
/*********************************************************************/
/*                                                                   */
/* Initiering av parametre.                                          */
/*                                                                   */
             DCL        VAR(&WALI)   TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)   TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)   TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)   TYPE(*CHAR) LEN(40)
/*                                                                   */
/* Varselbilde                                                       */
/*                                                                   */
             CHGVAR     VAR(&WALI) VALUE(11)
             CHGVAR     VAR(&WAPO) VALUE(30)
             CHGVAR     VAR(&MLD1) VALUE('Konvertering pågår for .... ')
             CHGVAR     VAR(&MLD2) VALUE('**** RABATTGUPPEREGISTER ****')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
/*                                                                   */
/* Henter verdier i fra LDA.                                         */
/*                                                                   */
             CHGVAR VAR(%SST(&KODER 2 3)) VALUE(&FPGRUP)
/*                                                                   */
/* Blanker filen                                                     */
/*                                                                   */
             CLRPFM     FILE(FRGRPF)
/*                                                                   */
             OVRDBF     FILE(KODER) TOFILE(QS36F/&KODER) MBR(*FIRST)
             CALL       PGM(KV290R)
/*                                                                   */
 ENDPGM:     ENDPGM
