/*                                                                   */
/*           KONVERTERE FAST TEKST ETIKETTER                         */
/*                                                                   */
             PGM        PARM(&FPGRUP)
             DCL        VAR(&FPGRUP) TYPE(*CHAR) LEN(03)
             DCL        VAR(&FASTX) TYPE(*CHAR) LEN(8) VALUE('Cxxx.FAS')
/*********************************************************************/
/*                                                                   */
/* Initiering av parametre.                                          */
/*                                                                   */
             DCL        VAR(&WALI)   TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)   TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)   TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)   TYPE(*CHAR) LEN(40)
/*                                                                   */
/* Varselbilde                                                       */
/*                                                                   */
             CHGVAR     VAR(&WALI) VALUE(11)
             CHGVAR     VAR(&WAPO) VALUE(30)
             CHGVAR     VAR(&MLD1) VALUE('Konvertering pågår for .... ')
             CHGVAR     VAR(&MLD2) VALUE('****  FASTE TEKSTER    **** ')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
/*                                                                   */
/* Henter verdier i fra LDA.                                         */
/*                                                                   */
             CHGVAR VAR(%SST(&FASTX 2 3)) VALUE(&FPGRUP)
/*                                                                   */
/* Blanker filen                                                     */
/*                                                                   */
             CLRPFM     FILE(VFASPF)
/*                                                                   */
             OVRDBF     FILE(FASTX) TOFILE(QS36F/&FASTX) MBR(*FIRST)
             CALL       PGM(KV300R)
/*                                                                   */
 ENDPGM:     ENDPGM
