             PGM

             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&A1FIGR) TYPE(*CHAR) LEN(3) VALUE('531')

/* Generer filer som er nødvendige                                   */

             CALL       PGM(LG010C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG090C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG100C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG410C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG420C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG890C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG900C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG901C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG902C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG910C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG911C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG912C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG913C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG914C) PARM(&A1FIGR &A1NULL)

 ENDPGM:     ENDPGM
