             PGM

             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&A1FIGR) TYPE(*CHAR) LEN(3) VALUE('540')

/* Generer filer som er nødvendige                                   */

             CALL       PGM(LG010C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG020C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG060C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG100C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG170C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG911C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG913C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG914C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG915C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG917C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG918C) PARM(&A1FIGR &A1NULL)

 ENDPGM:     ENDPGM
