             PGM

             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&A1FIGR) TYPE(*CHAR) LEN(3) VALUE('550')

/* Generer filer som er nødvendige                                   */

             CALL       PGM(LG010C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG050C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG060C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG090C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG100C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG510C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG520C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG760C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG912C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG915C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG919C) PARM(&A1FIGR &A1NULL)
             CALL       PGM(LG920C) PARM(&A1FIGR &A1NULL)

 ENDPGM:     ENDPGM
