             PGM        PARM(&TFGR &TFIRX)
/*                                                                   */
             DCL        VAR(&TFGR)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&TFIRX)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&TFIR)   TYPE(*DEC) LEN(3 0)
             DCL        VAR(&FGRP)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRM)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&BIBL)   TYPE(*CHAR) LEN(06) VALUE('ADB   ')
             DCL        VAR(&MLD3)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&MLD4)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&SVAR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN12)   TYPE(*DEC)  LEN(1 0)
/*                                                                   */
             CHGVAR     VAR(%SST(&BIBL 4 3)) VALUE(&TFGR)
             CHGVAR     VAR(&TFIR) VALUE(&TFIRX)

/* Hente inn filgruppe / firma fra LDA                               */

             RTVDTAARA  DTAARA(*LDA (931 03)) RTNVAR(&FGRP)
             RTVDTAARA  DTAARA(*LDA (944 03)) RTNVAR(&FIRM)

/*           Overstyrer til-fil til til-bibliotek                    */

             OVRDBF     FILE(LLOGLU) TOFILE(&BIBL/LLOGLU)
             OVRDBF     FILE(LBCHLU) TOFILE(&BIBL/LBCHLU)
             OVRDBF     FILE(LBDTLU) TOFILE(&BIBL/LBDTLU)
             OVRDBF     FILE(LBHELU) TOFILE(&BIBL/LBHELU)
             OVRDBF     FILE(LDELLU) TOFILE(&BIBL/LDELLU)
             OVRDBF     FILE(LFDTLU) TOFILE(&BIBL/LFDTLU)
             OVRDBF     FILE(LFHELU) TOFILE(&BIBL/LFHELU)
             OVRDBF     FILE(LFTXLU) TOFILE(&BIBL/LFTXLU)
             OVRDBF     FILE(LLDILU) TOFILE(&BIBL/LLDILU)
             OVRDBF     FILE(LLDTLU) TOFILE(&BIBL/LLDTLU)
             OVRDBF     FILE(LLHELU) TOFILE(&BIBL/LLHELU)
             OVRDBF     FILE(LODTLU) TOFILE(&BIBL/LODTLU)
             OVRDBF     FILE(LOHELU) TOFILE(&BIBL/LOHELU)
             OVRDBF     FILE(LOTXLU) TOFILE(&BIBL/LOTXLU)
             OVRDBF     FILE(LPLLLU) TOFILE(&BIBL/LPLLLU)
             OVRDBF     FILE(LPLOLU) TOFILE(&BIBL/LPLOLU)
             OVRDBF     FILE(LPM1LU) TOFILE(&BIBL/LPM1LU)
             OVRDBF     FILE(LPM2LU) TOFILE(&BIBL/LPM2LU)
             OVRDBF     FILE(LPSOLU) TOFILE(&BIBL/LPSOLU)
             OVRDBF     FILE(LSTSLU) TOFILE(&BIBL/LSTSLU)
             OVRDBF     FILE(LTELLU) TOFILE(&BIBL/LTELLU)
             OVRDBF     FILE(LUSRLU) TOFILE(&BIBL/LUSRLU)
             OVRDBF     FILE(SIDTLU) TOFILE(&BIBL/SIDTLU)
             OVRDBF     FILE(SIHELU) TOFILE(&BIBL/SIHELU)
/*                                                                   */
             CALL       PGM(LA405R) PARM(&TFIR)
/*                                                                   */
 ENDPGM:     ENDPGM
