             PGM        PARM(&LPARAM)
/*                                                                   */
             DCL        VAR(&LPARAM) TYPE(*CHAR) LEN(18)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID) TYPE(*CHAR) LEN(10)

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP601C) PARM('LA681P' &BTCH)

/* Call til program for behandling og utskrift                       */

             CALL       PGM(LA681R) PARM(&LPARAM)

/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDBRKMSG  MSG('ASLAGR: Utskrift av beholdnings-sjekk +
                          er ferdig') TOMSGQ(&WSID)
             ENDDO

/* Program for å fjerne overstyring av printerfile                   */

             CALL       PGM(AP606C) PARM('LA681P')

/*                                                                   */
             ENDPGM
