/* 060919  nho Lagt inn call til nytt program som leser poster FØR  */
/*             inneværende år */
             PGM        PARM(&LPPARM &LPVLG2 &LPVLG3)
/*                                                                   */
             DCL        VAR(&LPPARM) TYPE(*CHAR) LEN(64)
             DCL        VAR(&WPTYPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPVLG2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPVLG3) TYPE(*CHAR) LEN(1)
/*                                                                   */
/* Call til program for seleksjon                                    */
/*                                                                   */
             IF         COND(&LPVLG2 *EQ '1') THEN(DO)
             CALL       PGM(LA914R) PARM(&LPPARM)
             ENDDO
/*                                                                   */
/* Kaller opp program for oppdatering av lager utfra hbok            */
/*                                                                   */
             IF         COND(&LPVLG3 *EQ '1') THEN(DO)
             CALL       PGM(LA963R) PARM(&LPPARM)
             CALL       PGM(LA964R) PARM(&LPPARM)
             ENDDO
/*                                                                   */
             ENDPGM
