             PGM        PARM(&LPPARM &LPVLG1 &LPVLG2 &LPVLG3)
/*                                                                   */
             DCL        VAR(&LPPARM) TYPE(*CHAR) LEN(64)
             DCL        VAR(&LPVLG1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPVLG2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPVLG3) TYPE(*CHAR) LEN(1)
/*                                                                   */
/* Kaller opp program for utskrift   (Direkte)                       */
/*                                                                   */
             IF         COND(&LPVLG1 *NE '1') THEN(DO)
             CALL       PGM(LA914C) PARM(&LPPARM &LPVLG2 &LPVLG3)
             ENDDO
/*                                                                   */
/* Kaller opp program for utskrift   (Via jobbkø)                    */
/*                                                                   */
             IF         COND(&LPVLG1 *EQ '1') THEN(DO)
             SBMJOB     CMD(CALL PGM(LA914C) PARM(&LPPARM &LPVLG2 +
                          &LPVLG3)) JOB(OPPD.LAGER)
             ENDDO
/*                                                                   */
             ENDPGM
