             PGM        parm(&fgr &firm)

/*  7.02 080221 sst : Erstatter alle LA930C_xxx                         */
/*                    Filgruppe og firma settes som parameter i jobscde */
/** 7.01 110620 bof : Endret til kall FO760R pga.skjermbilde i C   ***/
/*                                                                   */
             DCL        VAR(&FIRm) TYPE(*CHAR) LEN(3)
             DCL        VAR(&Fgr)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&lib)  TYPE(*CHAR) LEN(10)  value('ADBxxx')
             DCL        VAR(&usr)  TYPE(*CHAR) LEN(10)  value('ASP_xxx')

             chgvar     var(%sst(&lib 4 3))   value(&fgr)
             chgvar     var(%sst(&usr 5 3))   value(&fgr)
/*                                                                   */
/* Setter biblioteksliste og current library                         */

             CALL       PGM(AA722C) PARM(&usr)
/* */
             CHGCURLIB  CURLIB(&lib)
/* */
/* Starter Oppdatering av lager-register utfra ordre-register        */
             CALL       PGM(FO764R)
             CALL       PGM(FO760R)  /*7.01*/
/* Starter Oppdatering av memosaldo utfra ordre-registerister        */
             CALL       PGM(FO762R)  /*7.01*/

/* Starter Oppdatering av best-linjer fra best-hode -register        */
             CALL       PGM(LA940RNAT)
/* Starter Oppdatering av lager-register utfra bestillingster        */
             CALL       PGM(LA920RNAT)

ENDPGM:     ENDPGM
