             PGM        PARM(&LPPARM &LPMEMB)

             DCL        VAR(&LPPARM) TYPE(*CHAR) LEN(128)
             DCL        VAR(&LPMEMB) TYPE(*CHAR) LEN(10)

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('LE600' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Videre behandling                                                 */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(LE602C) PARM(&LPPARM &LPMEMB))  +
                          JOB(TELLELISTE) MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/LE602C) +
                         PARM(&LPPARM &LPMEMB))

 END:        ENDPGM
