             PGM        PARM(&LPPARM &LPMEMB)

/*----------------------------------------------------------------------------------*/
/* 8.01 031022  bsa Laget ny versjon for å skrive til coolspool eller vanlig. Styres*/
/* 8.01             av switch.                                                      */
/*                                                                                  */
/*                                                                                  */
/*                                                                                  */
/*----------------------------------------------------------------------------------*/

             DCL        VAR(&LPPARM) TYPE(*CHAR) LEN(64)
             DCL        VAR(&LPMEMB) TYPE(*CHAR) LEN(10)

/*8.01*/     DCL        VAR(&CO402_KEY) TYPE(*CHAR) LEN(50)
/*8.01*/     DCL        VAR(&CO402_V1)  TYPE(*CHAR) LEN(1)
/*8.01*/     DCL        VAR(&CO402_V2)  TYPE(*CHAR) LEN(2048)
/*8.01*/     dcl        var(&fgr)       type(*char) len(3)
/*8.01*/     dcl        var(&fix)       type(*char) len(3)
/*8.01*/     dcl        var(&fir)       type(*dec)  len(3 0) value(0)
/*8.01*/     dcl        var(&lag)       type(*dec)  len(3 0) value(0)

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

/*8.01*/     chgvar     var(&CO402_KEY) value('PROA_VERSJON_AVVIKSLISTE')
/*8.01*/     rtvdtaara  dtaara(*lda (931 3)) rtnvar(&fgr)
/*8.01*/     rtvdtaara  dtaara(*lda (944 3)) rtnvar(&fix)
/*8.01*/     chgvar     var(&fir)   value(&fix)
/*8.01*/     CALL       PGM(CO402R) PARM(&FGR &FIR &LAG &CO402_KEY +
/*8.01*/                  &CO402_V1 &CO402_V2)

/* Program for printerstyring                                        */

/*8.01*/     IF         COND(&CO402_V1 *EQ '1') THEN(do)
             CALL       PGM(AP600R) PARM('LE610' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))
/*8.01*/     enddo
/*8.01*/     else    do
/*8.01*/     CALL       PGM(AP605R) PARM('LE610' '1' '0' &IN03 &BTCH)
/*8.01*/     IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))
/*8.01*/     enddo

/*6.30*/     STRPCO     PCTA(*NO)
/*6.30*/     MONMSG     MSGID(IWS4010)

/* Videre behandling                                                 */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(LE611C) PARM(&LPPARM &LPMEMB))  +
                          JOB(AVVIKLISTE) MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/LE611C) +
                         PARM(&LPPARM &LPMEMB))

 END:        ENDPGM
