             PGM
             DCLF       FILE(LG001D)
/*                                                                   */
             DCL        VAR(&A1VA01) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA02) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA04) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA05) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA06) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA07) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA08) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA09) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA10) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA11) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA12) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA13) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA14) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA15) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA16) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA17) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA18) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA19) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA22) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA23) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA24) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA25) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA26) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&APLEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK) TYPE(*CHAR) LEN(2)
             DCL        VAR(&L_FNAV) TYPE(*CHAR) LEN(30)
/*                                                                   */
/* Kontrollere brukertilgang                                         */
/*                                                                   */
             CHGVAR     VAR(&APLEVL) VALUE('40')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO
/*                                                                   */
             RTVDTAARA  DTAARA(*LDA (951 30))   RTNVAR(&L_FNAV)
/*                                                                   */
             SNDRCVF    RCDFMT(A1BLD)
/*                                                                   */
/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&A1FGRP *EQ '   ') THEN(GOTO +
                          CMDLBL(ENDPGM))
/*                                                                   */
/*  Genererer de valgte registere                                    */
/*                                                                   */
             IF         COND(&A1VA01 *EQ '1') THEN(DO)
             CALL       PGM(LG010C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA02 *EQ '1') THEN(DO)
             CALL       PGM(LG020C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA03 *EQ '1') THEN(DO)
             CALL       PGM(LG030C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA04 *EQ '1') THEN(DO)
             CALL       PGM(LG040C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA05 *EQ '1') THEN(DO)
             CALL       PGM(LG050C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA06 *EQ '1') THEN(DO)
             CALL       PGM(LG060C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA07 *EQ '1') THEN(DO)
             CALL       PGM(LG070C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA08 *EQ '1') THEN(DO)
             CALL       PGM(LG918C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA09 *EQ '1') THEN(DO)
             CALL       PGM(LG090C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA10 *EQ '1') THEN(DO)
             CALL       PGM(LG100C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA11 *EQ '1') THEN(DO)
             CALL       PGM(LG110C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA12 *EQ '1') THEN(DO)
             CALL       PGM(LG120C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA13 *EQ '1') THEN(DO)
             CALL       PGM(LG130C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA14 *EQ '1') THEN(DO)
             CALL       PGM(LG140C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA15 *EQ '1') THEN(DO)
             CALL       PGM(LG150C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA16 *EQ '1') THEN(DO)
             CALL       PGM(LG160C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA17 *EQ '1') THEN(DO)
             CALL       PGM(LG919C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA18 *EQ '1') THEN(DO)
             CALL       PGM(LG300C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA19 *EQ '1') THEN(DO)
             CALL       PGM(LG170C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA22 *EQ '1') THEN(DO)
             CALL       PGM(LG310C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA23 *EQ '1') THEN(DO)
             CALL       PGM(LG510C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA24 *EQ '1') THEN(DO)
             CALL       PGM(LG520C) PARM(&A1FGRP &A1NULL)
             ENDDO
/* 6.20                                                              */
             IF         COND(&A1VA25 *EQ '1') THEN(DO)
             CALL       PGM(LG180C) PARM(&A1FGRP &A1NULL)
             ENDDO
/* 6.30                                                              */
             IF         COND(&A1VA26 *EQ '1') THEN(DO)
             CALL       PGM(LG190C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
 ENDPGM:     ENDPGM
