             PGM
             DCLF       FILE(LG008D)
/*                                                                   */
/* 7.xx 081119 bsa Nye tabeller                                      */
/*                                                                   */
             DCL        VAR(&A1VA01) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA02) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA04) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&APLEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK) TYPE(*CHAR) LEN(2)
             DCL        VAR(&L_FNAV) TYPE(*CHAR) LEN(30)
/*                                                                   */
/* Kontrollere brukertilgang                                         */
/*                                                                   */
             CHGVAR     VAR(&APLEVL) VALUE('40')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO
/*                                                                   */
             RTVDTAARA  DTAARA(*LDA (951 30))   RTNVAR(&L_FNAV)
/*                                                                   */
             SNDRCVF    RCDFMT(A1BLD)
/*                                                                   */
/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&A1FGRP *EQ '   ') THEN(GOTO +
                          CMDLBL(ENDPGM))
/*                                                                   */
/*  Genererer de valgte registere                                    */
/*                                                                   */
             IF         COND(&A1VA01 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('LPHOST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA02 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('LPKOST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA03 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('LPKLST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA04 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('LPPAST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA05 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('LLPAST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA06 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('LBHOST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA07 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('LBLIST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA08 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('XPHOST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA09 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('XPKOST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA10 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('XPKLST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA11 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('XPPAST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA16 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('VGKPST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA17 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('VGKTST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA18 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('VGKFST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA19 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('VGKKST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA20 *EQ '1') THEN(DO)
             CALL       PGM(AG920C) PARM('GJKIPF' &A1FGRP &A1NULL)
             ENDDO


 ENDPGM:     ENDPGM
