             PGM
             DCLF       FILE(LG003D)
/* 250913 bof Valg 17 kaller AG9X1C istf. AG901C                     */
/*                                                                   */
/*                                                                   */
             DCL        VAR(&A1VA01) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA02) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA04) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&A1DLIB) TYPE(*CHAR) LEN(6)
             DCL        VAR(&APLEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK) TYPE(*CHAR) LEN(2)
             DCL        VAR(&L_FNAV) TYPE(*CHAR) LEN(30)
/*                                                                   */
/* Kontrollere brukertilgang                                         */
/*                                                                   */
             CHGVAR     VAR(&APLEVL) VALUE('40')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO
/*                                                                   */
             RTVDTAARA  DTAARA(*LDA (951 30))   RTNVAR(&L_FNAV)
/*                                                                   */
             SNDRCVF    RCDFMT(A1BLD)
/*                                                                   */
/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&A1FGRP *EQ '   ') THEN(GOTO +
                          CMDLBL(ENDPGM))
             CHGVAR     VAR(&A1DLIB) VALUE('ADB' *TCAT &A1FGRP)
/*                                                                   */
/*  Genererer de valgte registere                                    */
/*                                                                   */
             IF         COND(&A1VA01 *EQ '1') THEN(DO)
             CALL       PGM(LG700C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA02 *EQ '1') THEN(DO)
             CALL       PGM(LG931C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA03 *EQ '1') THEN(DO)
             CALL       PGM(LG701C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA05 *EQ '1') THEN(DO)
             CALL       PGM(LG702C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA07 *EQ '1') THEN(DO)
             CALL       PGM(LG710C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA09 *EQ '1') THEN(DO)
             CALL       PGM(LG720C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA11 *EQ '1') THEN(DO)
             CALL       PGM(LG730C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA12 *EQ '1') THEN(DO)
             CALL       PGM(LG740C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA13 *EQ '1') THEN(DO)
             CALL       PGM(LG750C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA14 *EQ '1') THEN(DO)
             CALL       PGM(LG760C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA15 *EQ '1') THEN(DO)
             CALL       PGM(LG770C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA16 *EQ '1') THEN(DO)
             CALL       PGM(LG891C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA17 *EQ '1') THEN(DO)
             CALL       PGM(AG9X1C) PARM('HOHXPF' &A1DLIB &A1NULL)
             ENDDO
/*                                                                   */
 ENDPGM:     ENDPGM
