             PGM
             DCLF       FILE(LG002D)
/*                                                                   */
             DCL        VAR(&A1VA01) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA02) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA04) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA05) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA06) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA07) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&APLEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK) TYPE(*CHAR) LEN(2)
             DCL        VAR(&L_FNAV) TYPE(*CHAR) LEN(30)
/*                                                                   */
/* Kontrollere brukertilgang                                         */
/*                                                                   */
             CHGVAR     VAR(&APLEVL) VALUE('40')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO
/*                                                                   */
             RTVDTAARA  DTAARA(*LDA (951 30))   RTNVAR(&L_FNAV)
/*                                                                   */
             SNDRCVF    RCDFMT(A1BLD)
/*                                                                   */
/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&A1FGRP *EQ '   ') THEN(GOTO +
                          CMDLBL(ENDPGM))
/*                                                                   */
/*  Genererer de valgte registere                                    */
/*                                                                   */
             IF         COND(&A1VA01 *EQ '1') THEN(DO)
             CALL       PGM(LG610C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA02 *EQ '1') THEN(DO)
             CALL       PGM(LG620C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA03 *EQ '1') THEN(DO)
             CALL       PGM(LG630C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA04 *EQ '1') THEN(DO)
             CALL       PGM(LG640C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA05 *EQ '1') THEN(DO)
             CALL       PGM(LG650C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA06 *EQ '1') THEN(DO)
             CALL       PGM(LG660C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA08 *EQ '1') THEN(DO)
             CALL       PGM(LG320C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA09 *EQ '1') THEN(DO)
             CALL       PGM(LG324C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA10 *EQ '1') THEN(DO)
             CALL       PGM(LG328C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA11 *EQ '1') THEN(DO)
             CALL       PGM(LG890C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA12 *EQ '1') THEN(DO)
             CALL       PGM(LG930C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA13 *EQ '1') THEN(DO)
             CALL       PGM(LG932C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
 ENDPGM:     ENDPGM
