             PGM
             DCLF       FILE(LG004D)
/*                                                                   */
/* 7.xx 081119 bsa Nye tabeller                                      */
/*                                                                   */
             DCL        VAR(&A1VA01) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA02) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA04) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&APLEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK) TYPE(*CHAR) LEN(2)
             DCL        VAR(&L_FNAV) TYPE(*CHAR) LEN(30)
/*                                                                   */
/* Kontrollere brukertilgang                                         */
/*                                                                   */
             CHGVAR     VAR(&APLEVL) VALUE('40')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO
/*                                                                   */
             RTVDTAARA  DTAARA(*LDA (951 30))   RTNVAR(&L_FNAV)
/*                                                                   */
             SNDRCVF    RCDFMT(A1BLD)
/*                                                                   */
/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&A1FGRP *EQ '   ') THEN(GOTO +
                          CMDLBL(ENDPGM))
/*                                                                   */
/*  Genererer de valgte registere                                    */
/*                                                                   */
             IF         COND(&A1VA02 *EQ '1') THEN(DO)
             CALL       PGM(LG800C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA04 *EQ '1') THEN(DO)
             CALL       PGM(LG810C) PARM(&A1FGRP &A1NULL)
             ENDDO
/* 7.01 LWEBPF                                                       */
             IF         COND(&A1VA05 *EQ '1') THEN(DO)
             CALL       PGM(AG920C) PARM('LWEBPF' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA06 *EQ '1') THEN(DO)
             CALL       PGM(LG815C) PARM(&A1FGRP &A1NULL)
             ENDDO
/* 7.01 EDHEPF                                                       */
             IF         COND(&A1VA07 *EQ '1') THEN(DO)
             CALL       PGM(AG920C) PARM('EDHEPF' &A1FGRP &A1NULL)
             ENDDO
/* 7.01 EDDTPF                                                       */
             IF         COND(&A1VA11 *EQ '1') THEN(DO)
             CALL       PGM(AG920C) PARM('EDDTPF' &A1FGRP &A1NULL)
             ENDDO
/* 7.01 EDTXPF                                                       */
             IF         COND(&A1VA12 *EQ '1') THEN(DO)
             CALL       PGM(AG920C) PARM('EDTXPF' &A1FGRP &A1NULL)
             ENDDO
/* 7.01 XOTXPF                                                       */
             IF         COND(&A1VA13 *EQ '1') THEN(DO)
             CALL       PGM(AG920C) PARM('XOTXPF' &A1FGRP &A1NULL)
             ENDDO
/* 7.02 NOWHST                                                       */
             IF         COND(&A1VA14 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('NOWHST' &A1FGRP &A1NULL)
             ENDDO
/* 7.02 NOWLST                                                       */
             IF         COND(&A1VA15 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('NOWLST' &A1FGRP &A1NULL)
             ENDDO
/* 7.02 NOWCST                                                       */
             IF         COND(&A1VA26 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('NOWCST' &A1FGRP &A1NULL)
             ENDDO
/* 7.02 WIMPST                                                       */
             IF         COND(&A1VA27 *EQ '1') THEN(DO)
             CALL       PGM(AG921C) PARM('WIMPST' &A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA08 *EQ '1') THEN(DO)
             CALL       PGM(LG820C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA10 *EQ '1') THEN(DO)
             CALL       PGM(LG830C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA16 *EQ '1') THEN(DO)
             CALL       PGM(LG850C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA17 *EQ '1') THEN(DO)
             CALL       PGM(LG860C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA18 *EQ '1') THEN(DO)
             CALL       PGM(LG840C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA19 *EQ '1') THEN(DO)
             CALL       PGM(LG816C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA20 *EQ '1') THEN(DO)
             CALL       PGM(LG817C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA21 *EQ '1') THEN(DO)
             CALL       PGM(LG818C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA22 *EQ '1') THEN(DO)
             CALL       PGM(LG870C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA23 *EQ '1') THEN(DO)
             CALL       PGM(LG880C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA24 *EQ '1') THEN(DO)
             CALL       PGM(LG101C) PARM(&A1FGRP &A1NULL)
             ENDDO
/* Loggfile EDI                                                      */
/*6.30*/     IF         COND(&A1VA25 *EQ '1') THEN(DO)
/*6.30*/     CALL       PGM(LG811C) PARM(&A1FGRP &A1NULL)
/*6.30*/     ENDDO
/*                                                                   */
 ENDPGM:     ENDPGM
