/*                                                                   */
/*           Generere   BESTILLING-HODE-REGISTER                     */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASLAGR' )
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('LOHEBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('LOHEPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('LOHELU')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('LOHEL1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('LOHELA')
             DCL        VAR(&WPRGL3) TYPE(*CHAR) LEN(6) VALUE('LOHELC')
             DCL        VAR(&WPRGL4) TYPE(*CHAR) LEN(6) VALUE('LOHELK')
             DCL        VAR(&WPRGL5) TYPE(*CHAR) LEN(6) VALUE('LOHELO')
             DCL        VAR(&WPRGL6) TYPE(*CHAR) LEN(6) VALUE('LOHELV')
             DCL        VAR(&WPRGL7) TYPE(*CHAR) LEN(6) VALUE('LOHELD')
             DCL        VAR(&WPRGL8) TYPE(*CHAR) LEN(6) VALUE('LOHELL')
             DCL        VAR(&WPRGL9) TYPE(*CHAR) LEN(6) VALUE('LOHELR')
             DCL        VAR(&WPRGLA) TYPE(*CHAR) LEN(6) VALUE('LOHELB')
             DCL        VAR(&WPRGLB) TYPE(*CHAR) LEN(6) VALUE('LOHEL2')
             DCL        VAR(&WPRGLC) TYPE(*CHAR) LEN(6) VALUE('LOHEL3')
             DCL        VAR(&WPRGLD) TYPE(*CHAR) LEN(6) VALUE('LOHEL4')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG113C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +
                          &WPRGL2 &WPRGL3 &WPRGL4 &WPRGL5 &WPRGL6 +
                          &WPRGL7 &WPRGL8 &WPRGL9 &WPRGLA &WPRGLB +
                          &WPRGLC &WPRGLD)
/*                                                                   */
 ENDPGM:     ENDPGM
