/*                                                                   */
/*           Generere   BESTILLING-LINJE-REGISTER                    */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASLAGR' )
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('LODTBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('LODTPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('LODTLU')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('LODTL1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('LODTLV')
             DCL        VAR(&WPRGL3) TYPE(*CHAR) LEN(6) VALUE('LODTLK')
             DCL        VAR(&WPRGL4) TYPE(*CHAR) LEN(6) VALUE('LODTLL')
             DCL        VAR(&WPRGL5) TYPE(*CHAR) LEN(6) VALUE('LODTLC')
             DCL        VAR(&WPRGL6) TYPE(*CHAR) LEN(6) VALUE('LODTLR')
             DCL        VAR(&WPRGL7) TYPE(*CHAR) LEN(6) VALUE('LODTLX')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG107C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +
                          &WPRGL2 &WPRGL3 &WPRGL4 &WPRGL5 &WPRGL6 +
                          &WPRGL7)
/*                                                                   */
 ENDPGM:     ENDPGM
