/*                                                                   */
/*           Generere   LAGER-AKKUMULERING-DATO-REGISTER             */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASLAGR' )
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('LLOKBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('LLOKPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('LLOKLU')
             DCL        VAR(&WPRGLR) TYPE(*CHAR) LEN(6) VALUE('LLOKLR')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('LLOKL1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('LLOKL2')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG103C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGLR +
                          &WPRGL1 &WPRGL2)
/*                                                                   */
 ENDPGM:     ENDPGM
