/*                                                                   */
/*           Generere   BESTILLING-FORSLAG-LINJE-REGISTER            */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASLAGR' )
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('LFDTBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('LFDTPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('LFDTLU')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('LFDTL1')
             DCL        VAR(&WPRGLR) TYPE(*CHAR) LEN(6) VALUE('LFDTLR')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('LFDTL2')
             DCL        VAR(&WPRGL3) TYPE(*CHAR) LEN(6) VALUE('LFDTL3')
             DCL        VAR(&WPRGL4) TYPE(*CHAR) LEN(6) VALUE('LFDTL4')
             DCL        VAR(&WPRGL5) TYPE(*CHAR) LEN(6) VALUE('LFDTL5')
             DCL        VAR(&WPRGL6) TYPE(*CHAR) LEN(6) VALUE('LFDTL6')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Sletter utgåtte logiske filer                           */
/*                                                                   */
             DLTF       FILE(LFDTLG)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(LFDTLL)
             MONMSG     MSGID(CPF2105)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG107C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGLR +
                          &WPRGL1 &WPRGL2 &WPRGL3 &WPRGL4 &WPRGL5 +
                          &WPRGL6)
/*                                                                   */
 ENDPGM:     ENDPGM
