/*                                                                   */
/*           Generere   RADIOTERMINAL TRANSAKSJONSFIL                */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASLAGR' )
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('HRTRBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('HRTRPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('HRTRLU')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('HRTRL1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('HRTRL2')
             DCL        VAR(&WPRGL3) TYPE(*CHAR) LEN(6) VALUE('HRTRL3')
             DCL        VAR(&WPRGL4) TYPE(*CHAR) LEN(6) VALUE('HRTRLR')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG104C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +
                          &WPRGL2 &WPRGL3 &WPRGL4)
/*                                                                   */
 ENDPGM:     ENDPGM
