
/*           Generere   Loggfil ved EDI innlesing                    */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASLAGR')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('ELOGBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('ELOGPF')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('ELOGLR')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('ELOGLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('ELOGL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('ELOGL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('ELOGL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('ELOGL4')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG105C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLR &RGLU  +
                          &RGL1 &RGL2 &RGL3 &RGL4)

 ENDPGM:     ENDPGM
