/*                                                                   */
/*           Generere   EDI-melding felles returfil                  */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASLAGR' )
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('LEDIBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('LEDIPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('LEDILU')
             DCL        VAR(&WPRGLR) TYPE(*CHAR) LEN(6) VALUE('LEDILR')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('LEDIL1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('LEDIL2')
             DCL        VAR(&WPRGL3) TYPE(*CHAR) LEN(6) VALUE('LEDIL3')
             DCL        VAR(&WPRGL4) TYPE(*CHAR) LEN(6) VALUE('LEDIL4')
             DCL        VAR(&WPRGL5) TYPE(*CHAR) LEN(6) VALUE('LEDIL5')
             DCL        VAR(&WPRGL6) TYPE(*CHAR) LEN(6) VALUE('LEDIL6')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG107C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +
                          &WPRGLR &WPRGL2 &WPRGL3 &WPRGL4 &WPRGL5 +
                          &WPRGL6)
/*                                                                   */
 ENDPGM:     ENDPGM
