/*                                                                   */
/*           Generere   PAKKEINFORMASJONS-REGISTER                   */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASLAGR' )
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('MTPABF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('MTPAPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('MTPALU')
             DCL        VAR(&WPRGLR) TYPE(*CHAR) LEN(6) VALUE('MTPALR')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('MTPAL1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('MTPAL2')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG103C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +
                          &WPRGL2 &WPRGLR)
/*                                                                   */
 ENDPGM:     ENDPGM
