/*                                                                   */
/*           Generere   Matrise Best.mengde /Best.punkt              */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASLOGI' )
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('MLTIBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('MLTIPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('MLTILU')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('MLTIL1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('MLTIL2')
             DCL        VAR(&WPRGL3) TYPE(*CHAR) LEN(6) VALUE('MLTIL3')
             DCL        VAR(&WPRGL4) TYPE(*CHAR) LEN(6) VALUE('MLTIL4')
             DCL        VAR(&WPRGL5) TYPE(*CHAR) LEN(6) VALUE('MLTIL5')
             DCL        VAR(&WPRGLR) TYPE(*CHAR) LEN(6) VALUE('MLTILR')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG106C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +
                          &WPRGL2 &WPRGL3 &WPRGL4 &WPRGL5 &WPRGLR)
/*                                                                   */
 ENDPGM:     ENDPGM
