/*                                                                   */
/*           Generere   prognose register og tilsv. register for     */
/*                      simulering                                   */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASLAGR')
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('MPROBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('MPROPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('MPROLU')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('MPROL1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('MPROL2')
             DCL        VAR(&WPRGL3) TYPE(*CHAR) LEN(6) VALUE('MPROL3')
             DCL        VAR(&WPRGL4) TYPE(*CHAR) LEN(6) VALUE('MPROL4')
             DCL        VAR(&WPRGL5) TYPE(*CHAR) LEN(6) VALUE('MPROL5')
             DCL        VAR(&WPRGL6) TYPE(*CHAR) LEN(6) VALUE('MPROL6')
             DCL        VAR(&WPRGL7) TYPE(*CHAR) LEN(6) VALUE('MPROL7')
             DCL        VAR(&WPRGL8) TYPE(*CHAR) LEN(6) VALUE('MPROL8')
             DCL        VAR(&WPRGLR) TYPE(*CHAR) LEN(6) VALUE('MPROLR')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG109C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +
                          &WPRGL2 &WPRGL3 &WPRGL4 &WPRGL5 &WPRGL6 +
                          &WPRGL7 &WPRGL8 &WPRGLR)
/*                                                                   */
/* Genererer register for simulering                                 */
/*                                                                   */
             CHGVAR        VAR(&WPRGBF) VALUE('MPRWBF')
             CHGVAR        VAR(&WPRGPF) VALUE('MPRWPF')
             CHGVAR        VAR(&WPRGLU) VALUE('MPRWLU')
             CHGVAR        VAR(&WPRGL1) VALUE('MPRWL1')
             CHGVAR        VAR(&WPRGL2) VALUE('MPRWL2')
             CHGVAR        VAR(&WPRGL3) VALUE('MPRWL3')
             CHGVAR        VAR(&WPRGL4) VALUE('MPRWL4')
             CHGVAR        VAR(&WPRGL5) VALUE('MPRWL5')
             CHGVAR        VAR(&WPRGL6) VALUE('MPRWL6')
             CHGVAR        VAR(&WPRGL7) VALUE('MPRWL7')
             CHGVAR        VAR(&WPRGL8) VALUE('MPRWL8')
             CHGVAR        VAR(&WPRGLR) VALUE('MPRWLR')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG109C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +
                          &WPRGL2 &WPRGL3 &WPRGL4 &WPRGL5 &WPRGL6 +
                          &WPRGL7 &WPRGL8 &WPRGLR)
/*                                                                   */
 ENDPGM:     ENDPGM
