/*                                                                   */
/*           Generere   ABC ANALYSE DETALJER                         */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASLOGI' )
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('MABDBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('MABDPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('MABDLU')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('MABDL1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('MABDL2')
             DCL        VAR(&WPRGL3) TYPE(*CHAR) LEN(6) VALUE('MABDL3')
             DCL        VAR(&WPRGL4) TYPE(*CHAR) LEN(6) VALUE('MABDL4')
             DCL        VAR(&WPRGL5) TYPE(*CHAR) LEN(6) VALUE('MABDL5')
             DCL        VAR(&WPRGL6) TYPE(*CHAR) LEN(6) VALUE('MABDL6')
             DCL        VAR(&WPRGL7) TYPE(*CHAR) LEN(6) VALUE('MABDL7')
             DCL        VAR(&WPRGL8) TYPE(*CHAR) LEN(6) VALUE('MABDL8')
             DCL        VAR(&WPRGL9) TYPE(*CHAR) LEN(6) VALUE('MABDL9')
             DCL        VAR(&WPRGLR) TYPE(*CHAR) LEN(6) VALUE('MABDLR')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG110C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +
                          &WPRGL2 &WPRGL3 &WPRGL4 &WPRGL5 &WPRGL6 +
                          &WPRGL7 &WPRGL8 &WPRGL9 &WPRGLR)
/*                                                                   */
 ENDPGM:     ENDPGM
