/*                                                                   */
/*           Generere   arbeidssregister prognose                    */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASLAGR' )
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('LWB1BF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('LWB1PF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('LWB1LU')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('LWB1L1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('LWB1L2')
             DCL        VAR(&WPRGL3) TYPE(*CHAR) LEN(6) VALUE('LWB1L3')
             DCL        VAR(&WPRGL4) TYPE(*CHAR) LEN(6) VALUE('LWB1L4')
             DCL        VAR(&WPRGL5) TYPE(*CHAR) LEN(6) VALUE('LWB1L5')
             DCL        VAR(&WPRGL6) TYPE(*CHAR) LEN(6) VALUE('LWB1L6')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG106C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +
                          &WPRGL2 &WPRGL3 &WPRGL4 &WPRGL5 &WPRGL6)
/*                                                                   */
 ENDPGM:     ENDPGM
