/*                                                                   */
/*           Generere   Overvåking lagerstyring                      */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASLOGI' )
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('LWHBBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('LWHBPF')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('LWHBL1')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('LWHBLU')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG101C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGL1 &WPRGLU)
/*                                                                   */
 ENDPGM:     ENDPGM
