             PGM        PARM(&PARM)

/* 260514 bof utvidet ihht. nummerutvidelse */

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(17)

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('LH600' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(LH601C) PARM(&PARM)) JOB(UTSKR_BET) +
                          MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/LH601C) PARM(&PARM))

 END:        ENDPGM
