             PGM        PARM(&PARM)

/* 260514 bof utvidet ihht. nummerutvidelse */

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(17)

             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID) TYPE(*CHAR) LEN(10)

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP601C) PARM('LH601P' &BTCH)

/* Utskrift                                                          */

             CALL       PGM(LH601R) PARM(&PARM)

/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDBRKMSG  MSG('ASLAGR: Utskrift av bestillingsfor +
                          slag er ferdig') TOMSGQ(&WSID)
             ENDDO

/* Program for å fjerne overstyring av printerfile                   */

             CALL       PGM(AP606C) PARM('LH601P')

 END:        ENDPGM
