             PGM        PARM(&LPPARM &TIL &FRA &SUBJ)
/*                                                                   */
             DCL        VAR(&LPPARM) TYPE(*CHAR) LEN(256)
             DCL        VAR(&TIL)    TYPE(*CHAR) LEN(50)
             DCL        VAR(&FRA)    TYPE(*CHAR) LEN(50)
             DCL        VAR(&SUBJ)   TYPE(*CHAR) LEN(250)
             DCL        VAR(&SUBX)   TYPE(*CHAR) LEN(250)
             DCL        VAR(&NUMM)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DANNET) TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&BTCH)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSHEX1) TYPE(*CHAR) LEN(20)
             DCL        VAR(&DSHEX2) TYPE(*CHAR) LEN(20)
             DCL        VAR(&INIF) TYPE(*CHAR) LEN(100)

/* Finner riktig inifil for hvor Mail-bekreftelse skal sendes        */
             call     PGM(AP600R)    PARM('LH600M' '0' '0' &IN03 &BTCH)
             RTVDTAARA  DTAARA(*LDA (760 20)) RTNVAR(&DSHEX1)
             RTVDTAARA  DTAARA(*LDA (780 20)) RTNVAR(&DSHEX2)
             CHGVAR     VAR(&INIF) VALUE(&DSHEX1 *TCAT &DSHEX2)

/* Kaller opp program for generering                                 */

             CALL       PGM(LH702R) PARM(&LPPARM &NUMM &DANNET)

/* Hvis mail - så dannes den her. Mottaker må finnes og best.forslag */
/*                                må ha blitt dannet.                */
/*                                                                   */
             IF         COND(&TIL *NE '          ') THEN(DO)
/* legger til best.f.nummer                                          */
             CHGVAR     VAR(&SUBX) VALUE(%SUBSTRING(&SUBJ 1 19) *TCAT +
              ' ' *TCAT &NUMM *TCAT ' ' *TCAT %SUBSTRING(&SUBJ 27 100))
/*                                                                   */
             IF         COND(&DANNET *EQ '1') THEN(DO)
             CALL       PGM(MP703C) PARM(&TIL &FRA &SUBX &INIF)
             ENDDO
             ENDDO
/*                                                                   */
 ENDPGM:     ENDPGM
