             PGM        PARM(&LPMEBR)
/*                                                                   */
             DCL        VAR(&LPMEBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LPAEBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&VG1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VG2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VG3) TYPE(*CHAR) LEN(1)
/*                                                                   */
/*  Blanker Dataara etter pga. omkjøring etc.                        */
/*                                                                   */
             CHGDTAARA  DTAARA(*LDA (599 01)) VALUE(' ')
/*                                                                   */
/*  Endrer variabel, Denne gjøres bare en gang                       */
/*                                                                   */
             CHGVAR     VAR(&LPAEBR) VALUE(&LPMEBR)
/*                                                                   */
/*  Endrer variabel, Denne gjøres for hver nytt alternativ           */
/*                                                                   */
 START:      CHGVAR     VAR(&LPMEBR) VALUE(&LPAEBR)
/*                                                                   */
/*  Blanker Dataara etter henting av variabel, pga. omkjøring etc.   */
/*                                                                   */
             CHGDTAARA  DTAARA(*LDA (500 12)) VALUE('            ')
/*                                                                   */
/*  Legger til records i parameter-registeret                        */
/*                                                                   */
             ADDPFM     FILE(LPM2PF) MBR(&LPMEBR)
             ADDLFM     FILE(LPM2LU) MBR(&LPMEBR) +
                          DTAMBRS((*CURRENT/LPM2PF (&LPMEBR)))
/*                                                                   */
/*  Override den valgte file til programfilen                        */
/*                                                                   */
             OVRDBF     FILE(LPM2LU) TOFILE(*FILE) MBR(&LPMEBR) +
                          SHARE(*YES)
/*                                                                   */
/*  Kaller opp program for start  av utskrift                        */
/*                                                                   */
             CALL       PGM(LO112R)
/*                                                                   */
             DLTOVR     FILE(LPM2LU)
/*                                                                   */
             RTVDTAARA  DTAARA(*LDA (500 01)) RTNVAR(&VG1)
             RTVDTAARA  DTAARA(*LDA (501 01)) RTNVAR(&VG2)
             RTVDTAARA  DTAARA(*LDA (599 01)) RTNVAR(&VG3)
             RTVDTAARA  DTAARA(*LDA (502 10)) RTNVAR(&LPAEBR)
/*                                                                   */
             CALL PGM(LI303C) PARM(&LPMEBR)
/*                                                                   */
             IF         COND(&VG2 *EQ '1') THEN(GOTO CMDLBL(START))
/*                                                                   */
             IF         COND(&VG3 *EQ '1') THEN(DO)
             RMVM       FILE(LPM2LU) MBR(&LPMEBR)
             MONMSG     MSGID(CPF7310)
             RMVM       FILE(LPM2PF) MBR(&LPMEBR)
             MONMSG     MSGID(CPF7310)
             ENDDO
/*                                                                   */
             ENDPGM
