     pgm

     dcl        var(&firm)     type(*dec)  len(3 0) value(0)
     dcl        var(&sscc)     type(*char) len(18)  value('370432232921041238')
     dcl        var(&numm)     type(*dec)  len(8 0) value(99919683)
     dcl        var(&suff)     type(*dec)  len(2 0) value(0)
     dcl        var(&paid)     type(*char) len(17)  value('1987231         ')
     dcl        var(&pver)     type(*dec)  len(3 0) value(1)
     dcl        var(&aarr)     type(*dec)  len(4 0) value(2020)
/*??*/       dcl        var(&stat)     type(*char) len(1)

/* Kaller opp program for oppdatering                                */

      CALL       PGM(LI310R) parm(&firm &sscc &numm &suff &paid +
                               &pver &aarr)

     ENDPGM
