             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&OVRF) TYPE(*CHAR) LEN(10) +
                          VALUE('IBMEDIHNT ')
             DCL        VAR(&FILN)  TYPE(*CHAR) LEN(20)
             DCL        VAR(&STAT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&SMSG)  TYPE(*CHAR) LEN(1) VALUE('1')

/* Klargjør filer før mottak                                         */

             CRTPF      FILE(*CURLIB/LEDITMP) RCDLEN(80) SIZE(*NOMAX)
             MONMSG     MSGID(CPF7302) EXEC(DO)
             CLRPFM     FILE(LEDITMP)
             ENDDO
             MONMSG     MSGID(CPF5813) EXEC(DO)
             CLRPFM     FILE(LEDITMP)
             ENDDO

/* Henter meldinger via FTP fra IBM                                  */

             CALL       PGM(AF700C) PARM(&OVRF &STAT &FILN &SMSG)

/* Kopierer temporær fil til mottaksfil og sletter den               */

             CPYF       FROMFILE(*LIBL/LEDITMP) TOFILE(LWERPF) +
                          MBROPT(*ADD) FMTOPT(*NOCHK)
             MONMSG     MSGID(CPF2869)
             MONMSG     MSGID(CPF2817)

             DLTF       FILE(LEDITMP)

 END:
             ENDPGM
