             PGM        parm(&stat)

             DCL        VAR(&STAT) TYPE(*CHAR) LEN(1)

/* Klargjør filer før mottak                                         */

             CLRPFM     FILE(LWERPF)
             CLRPFM     FILE(LWEFPF)
             CLRPFM     FILE(LWEOPF)
             CLRPFM     FILE(LWEPPF)
             CLRPFM     FILE(LWEBPF)

/* Call til program for kommunikasjon  IBM + NBS                     */

/*           CALL       PGM(LI702C)                                  */
             CALL       PGM(LI703CB)

/* Call til program for oppdatering                                  */

             CALL       PGM(LI700R) parm(&stat)

             ENDPGM
