             PGM  parm(&filg)

             dcl        var(&filg) type(*char) len(3)
             dcl        var(&dbib) type(*CHAR) len(6) value('ADBxxx')
             dcl        var(&t)    type(*char) len(20)

/* Endre i parm til rette filgruppe */
             CALL       PGM(AA720C) PARM(&filg)

/* Endre her også, AA720C gir ikke alltid riktig filgruppe */
             chgvar     var(%sst(&dbib 4 3)) value(&filg)
             chgcurlib  curlib(&dbib)

             DLYJOB     DLY(10)

ny_sjekk:    CALL PGM(LI800C)

/* Avslutter ikke før kl 2100 - kjøres på nytt etter 1 minutt       */

             rtvsysval  sysval(qtime) rtnvar(&t)
             if         cond(%substring(&T 1 4) *lt '2100') then(do)
                        dlyjob     dly(60)
                        goto  cmdlbl(ny_sjekk)
             enddo


END: ENDPGM
