             PGM

             dcl        var(&in03) type(*char) len(1)

/* Hent godkjente pakksedler                                         */
             call       pgm(li800r)

/* Legg de inn i bestillingstabeller                                 */
             call       pgm(li810r)


 END:        ENDPGM
