             PGM        PARM(&PARM)

/*---------------------------------------------------------------------------*/
/* 8.01 210922  bsa Laget ny versjon for å skrive til coolspool eller vanlig.*/
/* 8.01             av switch.                                               */
/* 8.02 301024  ask Lagt inn direktetilgang fra lagertelling batch           */
/* 8.03 030125  bsa Hvis coolspool, skal vi ikke drive med AP601C            */
/*                                                                           */
/*                                                                           */
/*                                                                           */
/*---------------------------------------------------------------------------*/

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(128)

/*8.01*/     DCL        VAR(&CO402_KEY) TYPE(*CHAR) LEN(50)
/*8.01*/     DCL        VAR(&CO402_V1)  TYPE(*CHAR) LEN(1)
/*8.01*/     DCL        VAR(&CO402_V2)  TYPE(*CHAR) LEN(2048)
/*8.01*/     dcl        var(&fgr)       type(*char) len(3)
/*8.01*/     dcl        var(&fix)       type(*char) len(3)
/*8.01*/     dcl        var(&fir)       type(*dec)  len(3 0) value(0)
/*8.01*/     dcl        var(&lag)       type(*dec)  len(3 0) value(0)

             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&WMM1)  TYPE(*CHAR) LEN(10) VALUE('LL605    ')
             DCL        VAR(&MEMBX)  TYPE(*CHAR) LEN(5)
             DCL        VAR(&MEMB)   TYPE(*DEC)  LEN(5 0)

             RTVDTAARA  DTAARA(*LDA (864 5))  RTNVAR(&MEMBX)
             CHGVAR     VAR(&MEMB) VALUE(&MEMBX)
             CHGVAR     VAR(%SST(&WMM1 6 5)) VALUE(&MEMB)

/* Henter verdier i fra LDA.                                         */

             RTVDTAARA  DTAARA(*LDA (863 1))  RTNVAR(&BTCH)
             RTVDTAARA  DTAARA(*LDA (300 1))  RTNVAR(&TYPE)
             RTVDTAARA  DTAARA(*LDA (1016 1)) RTNVAR(&TYPE)

/* Varselbilde 2                                                     */
             IF         COND(&BTCH *NE '1') THEN(DO)
/*   Newlook liker ikke AA006C                                                */
/*              CHGVAR     VAR(&WALI) VALUE(6)                                */
/*              CHGVAR     VAR(&WAPO) VALUE(30)                               */
/*              CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')      */
/*              CHGVAR     VAR(&MLD2) VALUE('Utplukk pågår ...........')      */
/*              CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)         */
             ENDDO
/*                                                                   */
/* Utplukking av poster                                              */
/*                                                                   */
             CLRPFM     FILE(LWA1PF) MBR(&WMM1)
             MONMSG     MSGID(CPF3100)
/*                                                                   */
/* Bygger membere dersom de ikke finnes                              */
/*                                                                   */
             CHKOBJ     OBJ(LWA1PF) OBJTYPE(*FILE) MBR(&WMM1)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(LWA1PF) MBR(&WMM1) TEXT('Poster til +
                          lagerverdiliste LL608R')
             ADDLFM     FILE(LWA1LU) MBR(&WMM1) +
                          DTAMBRS((*CURRENT/LWA1PF (&WMM1)))
             ADDLFM     FILE(LWA1L1) MBR(&WMM1) +
                          DTAMBRS((*CURRENT/LWA1PF (&WMM1)))
             ENDDO
/*                                                                   */
             OVRDBF     FILE(LWA1LU) TOFILE(*FILE) MBR(&WMM1)
             OVRDBF     FILE(LWA1L1) TOFILE(*FILE) MBR(&WMM1)

/*                                                                   */
/* Les lagerregister                                                 */
/*                                                                   */
             IF         COND(&TYPE *NE '2') THEN(DO)
             CALL       PGM(LL607R) PARM(&PARM)
             ENDDO
/*                                                                   */
/* Les telleregister                                                 */
/*                                                                   */
             IF         COND(&TYPE *EQ '2') THEN(DO)
             CALL       PGM(LL608R) PARM(&PARM)
             ENDDO

/* Varselbilde 2                                                     */
             IF         COND(&BTCH *NE '1') THEN(DO)
/*   Newlook liker ikke AA006C                                                */
/*              CHGVAR     VAR(&WALI) VALUE(8)                                */
/*              CHGVAR     VAR(&WAPO) VALUE(26)                               */
/*              CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')      */
/*              CHGVAR     VAR(&MLD2) VALUE('Utskrift pågår...........')      */
/*              CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)         */
             ENDDO


/*8.01*/     chgvar     var(&CO402_KEY) value('PROA_VERSJON_LAGERVERDI')
/*8.01*/     rtvdtaara  dtaara(*lda (931 3)) rtnvar(&fgr)
/*8.01*/     rtvdtaara  dtaara(*lda (944 3)) rtnvar(&fix)
/*8.01*/     chgvar     var(&fir)   value(&fix)
/*8.01*/     CALL       PGM(CO402R) PARM(&FGR &FIR &LAG &CO402_KEY +
/*8.01*/                  &CO402_V1 &CO402_V2)

/* Utskrift                                                          */

/*8.01*/     IF         COND(&CO402_V1 *EQ '1') THEN(do)
/*8.03  Program for overstyring av printerfile - flyttet             */
/*8.03*/     CALL       PGM(AP601C) PARM('LL609P' &BTCH)

             CALL       PGM(LL609R) PARM(&PARM)
/*8.01*/     enddo
/*8.01*/     else    do
/*8.01*/     call       pgm(ll699r) parm(&parm)
/*8.01*/     enddo

/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDBRKMSG  MSG('ASLAGR: Utskrift av lagerverdi+
                          liste er ferdig') TOMSGQ(&WSID)
             ENDDO

/* Program for å fjerne overstyring av printerfile                   */

             CALL       PGM(AP606C) PARM('LL609P')
/*                                                                   */
             RMVM       FILE(LWA1LU) MBR(&WMM1)
             MONMSG     MSGID(CPF7310)
             RMVM       FILE(LWA1L1) MBR(&WMM1)
             MONMSG     MSGID(CPF7310)
             RMVM       FILE(LWA1PF) MBR(&WMM1)
             MONMSG     MSGID(CPF7310)

 END:        ENDPGM
