             PGM

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(128)

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

             CALL       PGM(LL635R) PARM(&IN03 &PARM)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('LL635' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(LL636C) PARM(&PARM)) JOB(UTSKR_HIST) +
                          MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/LL636C) PARM(&PARM))

 END:        ENDPGM
