             PGM        PARM(&LPPARM &LPVLG1)
/*                                                                   */
             DCL        VAR(&LPPARM) TYPE(*CHAR) LEN(64)
             DCL        VAR(&LPVLG1) TYPE(*CHAR) LEN(1)
/*                                                                   */
/* Kaller opp program for utskrift   (Direkte)                       */
/*                                                                   */
             IF         COND(&LPVLG1 *NE '1') THEN(DO)
             CALL       PGM(LL824C) PARM(&LPPARM)
             ENDDO
/*                                                                   */
/* Kaller opp program for utskrift   (Via jobbkø)                    */
/*                                                                   */
             IF         COND(&LPVLG1 *EQ '1') THEN(DO)
             SBMJOB     CMD(CALL PGM(LL824C) PARM(&LPPARM)) +
                          JOB(SLETTVARER)
             ENDDO
/*                                                                   */
             ENDPGM
