             PGM
/*                                                                   */
             DCL        VAR(&MLD3)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&MLD4)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&SVAR)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN12)     TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&TOMT)     TYPE(*CHAR) LEN(1)
/*                                                                   */
/* Melding om at rutinen ikke er i bruk lenger                     */
/*                                                                   */

             CHGVAR     VAR(&MLD3) +
                        VALUE('Rutinen er ikke i bruk lenger.       ')
             CHGVAR     VAR(&MLD4) +
                        VALUE('Kontakt support@eg.no ')
             CALL       PGM(AA007R)    PARM(&MLD3 &MLD4 &SVAR &IN12)


/*                                                                   */
             ENDPGM
