             PGM        PARM(&LPPARM)
/*                                                                   */
             DCL        VAR(&WPTYPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPPARM) TYPE(*CHAR) LEN(64)
/*                                                                   */
/* Call til program for oppdatering                                  */
/*                                                                   */
             CALL       PGM(LL844R) PARM(&LPPARM)
             CALL       PGM(LL846R) PARM(&LPPARM)
/*                                                                   */
             ENDPGM
