             PGM       (&SCAN &TEXT)

/* Initiering av parametere                                          */

             DCL        VAR(&SCAN)     TYPE(*CHAR) LEN(26)
             DCL        VAR(&TEXT)     TYPE(*CHAR) LEN(30)


/*           Sjekk om  VA brukes                                  */

             CHKOBJ     OBJ(JVARPF) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             GOTO       CMDLBL(END)
             ENDDO

/* Call av utplukksprogram                                           */

             CALL       PGM(JV871R) PARM(&SCAN &TEXT)

 END:        ENDPGM
