             PGM
             DCLF       FILE(LM19)
             DCL        VAR(&APFNAV) TYPE(*CHAR) LEN(30)
             DCL        VAR(&ONUM)   TYPE(*DEC)  LEN(8)
             DCL        VAR(&LPRO)   TYPE(*CHAR) LEN(1)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(LSETUP)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(START))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(START))

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(LI150R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CHGVAR     VAR(&ONUM)     VALUE(0)
             CHGVAR     VAR(&LPRO)     VALUE(' ')
             CALL       PGM(FO500R) PARM(&ONUM &LPRO)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CHGVAR     VAR(&ONUM)     VALUE(0)
             CHGVAR     VAR(&LPRO)     VALUE(' ')
             CALL       PGM(LO500R) PARM(&ONUM &LPRO)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4                                                            */
             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(RM12)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5                                                            */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(RM00)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6                                                           */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(FO175R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7                                                            */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(BO120C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8                                                            */
             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(LO670C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 19                                                           */
             IF         COND(&VALG *EQ 19) THEN(DO)
             CALL       PGM(LM18)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 20                                                           */
             IF         COND(&VALG *EQ 20) THEN(DO)
             CALL       PGM(RK501R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 21                                                           */
             IF         COND(&VALG *EQ 21) THEN(DO)
             CALL       PGM(RL501R)
             GOTO       CMDLBL(START)
             ENDDO
/* Valg 22                                                           */
             IF         COND(&VALG *EQ 22) THEN(DO)
             CALL       PGM(SO500R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 23                                                           */
             IF         COND(&VALG *EQ 23) THEN(DO)
             CALL       PGM(SH400R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 24                                                           */
             IF         COND(&VALG *EQ 24) THEN(DO)
             CALL       PGM(VV550R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
