/*---------------------------------------------------------------------------*/
/* 7.xx  220316 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS     */
/*                                                                           */
/*---------------------------------------------------------------------------*/
             PGM
             DCLF       FILE(LM20)
             DCL        VAR(&APFNAV) TYPE(*CHAR) LEN(30)
/*                                                                   */
             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)
/*                                                                   */
/* Sette opp driftsmiljø                                             */
/*                                                                   */
             CALL       PGM(LSETUP)
/*                                                                   */
 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             SNDRCVF    RCDFMT(A1MNU)
/*                                                                   */
/* Tester på funksjonstaster                                         */
/*                                                                   */
/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)
/*                                                                   */
/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)
/*                                                                   */
/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(LO800R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(FP290C)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(VV550R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 5                                                            */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(LO540R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 6                                                            */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(FM31)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 20                                                           */
             IF         COND(&VALG *EQ 20) THEN(DO)
             CALL       PGM(LM70)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO
/*                                                                   */
/* Gå til start                                                      */
             GOTO       CMDLBL(START)
/*                                                                   */
 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)
/*                                                                   */
/* Slutt                                                             */
 ENDPGM:     ENDPGM
