/*---------------------------------------------------------------------------*/
/* 7.xx  160316 bsa  Endringer reltart til ny GUI. NB Kan kun gjelde DDS     */
/*                                                                           */
/*---------------------------------------------------------------------------*/
             PGM
             DCLF       FILE(LM70)
             DCL        VAR(&APFNAV)   TYPE(*CHAR) LEN(30)
             DCL        VAR(&APLEVL)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK)   TYPE(*CHAR) LEN(2)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(LSETUP)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&APLEVL) VALUE('20')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(VV100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(VE520R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(VG100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4                                                            */
             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(VU100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5                                                            */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(MD100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6                                                            */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(LL100R) PARM('               ')
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7                                                            */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(LJ100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8                                                            */
             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(LP100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9                                                            */
             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(MT100R)
             GOTO       CMDLBL(START)
             ENDDO
/* Valg 10                                                           */
             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(MJ100R)
             GOTO       CMDLBL(START)
             ENDDO


/* Valg 11                                                           */
             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       PGM(RA100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 12                                                           */
             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(RL100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 13                                                           */
             IF         COND(&VALG *EQ 13) THEN(DO)
             CALL       PGM(RH100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 14                                                           */
             IF         COND(&VALG *EQ 14) THEN(DO)
             CALL       PGM(VA120R)
             GOTO       CMDLBL(START)
             ENDDO

 /* Valg 15                                                          */
             IF         COND(&VALG *EQ 15) THEN(DO)
             CALL       PGM(MC100R)
             GOTO       CMDLBL(START)
             ENDDO

 /* Valg 16                                                          */
             IF         COND(&VALG *EQ 16) THEN(DO)
             CALL       PGM(LA107R)
             GOTO       CMDLBL(START)
             ENDDO

 /* Valg 17                                                          */
             IF         COND(&VALG *EQ 17) THEN(DO)
             CALL       PGM(LP105R)
             GOTO       CMDLBL(START)
             ENDDO

 /* Valg 20                                                          */
             IF         COND(&VALG *EQ 20) THEN(DO)
             CALL       PGM(LM71)
             GOTO       CMDLBL(START)
             ENDDO

 /* Valg 21                                                          */
             IF         COND(&VALG *EQ 21) THEN(DO)
             CALL       PGM(LM50)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
