/* 7.01  231120 bsa  Fjernet menypkt for Multisupport.                       */
/*                                                                           */
/*                                                                           */
/*---------------------------------------------------------------------------*/
             PGM
             DCLF       FILE(LM80)
             DCL        VAR(&APFNAV)   TYPE(*CHAR) LEN(30)

             DCL        VAR(&FIRM)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&WWFIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&FILG)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&LAGE)   TYPE(*DEC)  LEN(3 0)  VALUE(0)
             DCL        VAR(&CO402_KEY) TYPE(*CHAR) LEN(50)
             DCL        VAR(&CO402_V1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&CO402_V2) TYPE(*CHAR) LEN(2048)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(LSETUP)

/* Henter filgruppe og firmanummer:                                  */
             RTVDTAARA  DTAARA(*LDA (931 3)) RTNVAR(&FILG)
             RTVDTAARA  DTAARA(*LDA (944 3)) RTNVAR(&FIRM)
             CHGVAR     VAR(&WWFIRM) VALUE(&FIRM)

/*  sjekk om "41.Innlesing lagerinfo. CSV" er aktiv                   */
             CHGVAR     VAR(&CO402_KEY) VALUE('LM80_INNL_LAGER_INFO')
             CALL       PGM(CO402R) PARM(&FILG &WWFIRM &LAGE &CO402_KEY +
                          &CO402_V1 &CO402_V2)
             IF         COND(&CO402_V1 *EQ '1') THEN(CHGVAR VAR(&IN41) +
                          VALUE('1'))

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(LA940R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(LA920R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(LA960R)
             GOTO       CMDLBL(START)
             ENDDO
/* Valg 5                                                            */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(LL840R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6                                                            */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(LO405R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 10                                                           */
             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(LA680R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 11                                                           */
             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       PGM(LM81)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 12                                                           */
             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(LL850R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 20                                                           */
             IF         COND(&VALG *EQ 20) THEN(DO)
             CALL       PGM(LA910R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 31                                                           */
/*7.01       IF         COND(&VALG *EQ 31) THEN(DO)               */
/*7.01       CALL       PGM(LK910C)                               */
/*7.01       GOTO       CMDLBL(START)                             */
/*7.01       ENDDO                                                */

/* Valg 32                                                        */
/*7.01       IF         COND(&VALG *EQ 32) THEN(DO)               */
/*7.01       CALL       PGM(LK920C)                               */
/*7.01       GOTO       CMDLBL(START)                             */
/*7.01       ENDDO                                                */

/*   sjekk tilgang                                                            */
             IF         COND(&IN41 *EQ '1') THEN(DO)
/* Valg 40                                                         */
                IF         COND(&VALG *EQ 40) THEN(DO)
                   CALL       PGM(LX740R)
                   GOTO       CMDLBL(START)
                ENDDO

/* Valg 41                                                         */
                IF         COND(&VALG *EQ 41) THEN(DO)
                   CALL       PGM(LX744R)
                   GOTO       CMDLBL(START)
                ENDDO

/* Valg 42                                                         */
                IF         COND(&VALG *EQ 42) THEN(DO)
                   CALL       PGM(LX745R)
                   GOTO       CMDLBL(START)
                ENDDO
             ENDDO

/* Valg 33                                                           */
/*7.01       IF         COND(&VALG *EQ 33) THEN(DO)                  */
/*7.01       CALL       PGM(LK930C)                                  */
/*7.01       GOTO       CMDLBL(START)                                */
/*7.01       ENDDO                                                   */

/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
