             PGM        PARM(&MEMB)

/* Initiering av parametere                                          */

             DCL        VAR(&MEMB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PROG) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PARM) TYPE(*CHAR) LEN(28)

/* Hente inn fra LDA                                                 */

             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PROG)

/* Override parameterfilene/membrene                                 */

             OVRDBF     FILE(LPSOL1) TOFILE(*FILE) MBR(&MEMB)

/* Call av oppdateringsprogram                                       */

             CALL       PGM(LO116R) PARM(&PARM)

/* Override av parametermembrene oppheves                            */

             DLTOVR     FILE(LPSOL1)

/* Kaller opp oppdateringsprogram                                    */

             CALL       PGM(LO117R) PARM(&PARM)

             ENDPGM
