             PGM        PARM(&WPVALG &WPPARM)
/*                                                                   */
             DCL        VAR(&WPVALG) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPPROG) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WPPARM) TYPE(*CHAR) LEN(28)
/*                                                                   */
             CHGVAR VAR(&WPPROG) VALUE(%SST(&WPPARM 19 10))
/*                                                                   */
/* Kaller opp program for utskrift   (Direkte)                       */
/*                                                                   */
             IF         COND(&WPVALG *NE '1') THEN(DO)
             CALL       PGM(&WPPROG) PARM(&WPPARM)
             ENDDO
/*                                                                   */
/* Kaller opp program for utskrift   (Via jobbkø)                    */
/*                                                                   */
             IF         COND(&WPVALG *EQ '1') THEN(DO)
             SBMJOB     CMD(CALL PGM(&WPPROG) PARM(&WPPARM )) +
                          JOB(INNG_FAKT)
             ENDDO
/*                                                                   */
             ENDPGM
