             PGM        PARM(&PARM)

             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(30)

/* Call av program for utskriftsparametre.                           */

             CALL       PGM(AP600R)    PARM('LO174' '0' '0' &IN03 &BTCH)

/* Program for overstyring av printfile                              */

             CALL       PGM(AP601C)    PARM('LO174P' &BTCH)

/* Kaller opp program for faktura-journal                            */

             CALL       PGM(LO174R)    PARM(&PARM)

             CALL       PGM(AP606C)    PARM('LO174P')

             ENDPGM
