             PGM        PARM(&PARM &RUTI)

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(28)
             DCL        VAR(&RUTI) TYPE(*CHAR) LEN(10)

             DCL        VAR(&PF03) TYPE(*DEC)  LEN(1)
             DCL        VAR(&PF12) TYPE(*DEC)  LEN(1)
             DCL        VAR(&PROG) TYPE(*CHAR) LEN(10)

/* Oppdaterer LDA med rutinenavn                                     */

             CHGDTAARA  DTAARA(*LDA (800 10)) VALUE(&RUTI)

/* Kaller opp AP100R                                                 */

             CALL       PGM(AP100R) PARM(&PF03 &PF12)

/* Hente programnavn fra LDA                                         */

             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PROG)

/* Kaller opp program for utskrift av faktura/kreditnota             */

             CALL       PGM(&PROG) PARM(&PARM)

ENDPGM:      ENDPGM
