             PGM        PARM(&PARM &BTCH)

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(64)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

/* Kaller opp program for direkte eller via batch                    */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(LO406C) PARM(&PARM &BTCH)) +
                          JOB(SLET_BEST) MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/LO406C) PARM(&PARM &BTCH))

             ENDPGM
