             PGM        PARM(&PARM &BTCH)

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(64)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID) TYPE(*CHAR) LEN(10)

/* Call til program for oppdatering                                  */

             CALL       PGM(LO406R) PARM(&PARM)

/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDBRKMSG  MSG('ASLAGR: Sletterutine for bestillinger +
                          er ferdig') TOMSGQ(&WSID)
             ENDDO

             ENDPGM
