             PGM
/*                                                                   */
/* 300514 bof : utvidelse mtp. nummerserieutvidelse                  */
/*                                                                   */
             DCL        VAR(&AARR) TYPE(*DEC)  LEN(4)
             DCL        VAR(&PF03) TYPE(*DEC)  LEN(1)
             DCL        VAR(&A1FR) TYPE(*DEC)  LEN(8)
             DCL        VAR(&A1TI) TYPE(*DEC)  LEN(8)
/*                                                                   */
             CHGVAR     VAR(&PF03) VALUE(0)
/*                                                                   */
/* Kaller opp Parameter-program for utskrift                         */
/*                                                                   */
             CALL       PGM(LO583R) PARM(&AARR &A1FR +
                          &A1TI &PF03)
/*                                                                   */
/* Er det tatt F3 i parameter-bildet ?                               */
/*                                                                   */
             IF         COND(&PF03 *EQ 1) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/* Kaller opp Program for hull i nummerserie for ordrenr             */
/*                                                                   */
             IF         COND(&A1FR *GT 0) THEN(DO)
             CALL       PGM(LO584R) PARM(&AARR &A1FR &A1TI +
                                         &PF03)

             ENDDO
/*                                                                   */
ENDPGM:      ENDPGM
