             PGM        (&ornr &orsu &emai &emne &txt1 &txt2 &txt3 +
                        &txt4 &pers &kopi)
/*                                                                   */
/* 300514 bof : utvidelse mtp. nummerserieutvidelse                  */
/*                                                                   */
             dcl        var(&ornr) type(*dec)   len(8)
             dcl        var(&orsu) type(*dec)   len(2)
             dcl        var(&emai) type(*char)  len(50)
             dcl        var(&emne) type(*char)  len(50)
             dcl        var(&txt1) type(*char)  len(50)
             dcl        var(&txt2) type(*char)  len(50)
             dcl        var(&txt3) type(*char)  len(50)
             dcl        var(&txt4) type(*char)  len(50)
             dcl        var(&pers) type(*char)  len(50)
             dcl        var(&kopi) type(*char)  len(50)
/*                                                                   */
             OVRPRTF    FILE(LO581P) OUTQ(PDFPRINT) HOLD(*YES)
/*                                                                   */
/* Kaller opp program for utskrift                                   */
/*                                                                   */
             call       pgm(lo581r) parm(&ornr &orsu &emai &emne +
                        &txt1 &txt2 &txt3 &txt4 &pers &kopi)

ENDPGM:      ENDPGM
