             PGM        PARM(&LDOR &DATO &DAGR &ONBE &LAGE)

/* Definering av parametere og variable                              */

             DCL        VAR(&LDOR)     TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&DATO)     TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&DAGR)     TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&ONBE)     TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&LAGE)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

/* Program for utskriftsparametere                                   */

             CALL       PGM(AP600R)    PARM('LO614' '0' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('LO614P' &BTCH)

/* Kaller opp program                                                */

             CALL       PGM(LO614R)    PARM(&LDOR &DATO &DAGR &ONBE &LAGE)

             CALL       PGM(AP606C)    PARM('LO614P')
 END:        ENDPGM
