             PGM        PARM(&LPPARM &LPMEBR &LPVLG1)
/*                                                                   */
             DCL        VAR(&LPPARM) TYPE(*CHAR) LEN(64)
             DCL        VAR(&LPMEBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LPVLG1) TYPE(*CHAR) LEN(1)
/*                                                                   */
/* Kaller opp program for utskrift   (Direkte)                       */
/*                                                                   */
             IF         COND(&LPVLG1 *NE '1') THEN(DO)
             CALL       PGM(LO634C) PARM(&LPPARM &LPMEBR)
             ENDDO
/*                                                                   */
/* Kaller opp program for utskrift   (Via jobbk¦)                    */
/*                                                                   */
             IF         COND(&LPVLG1 *EQ '1') THEN(DO)
             SBMJOB     CMD(CALL PGM(LO634C) PARM(&LPPARM &LPMEBR)) +
                          JOB(BEST_KONTR)
             ENDDO
/*                                                                   */
             ENDPGM
