             PGM        PARM(&LPPARM &LPMEBR)
/*                                                                   */
             DCL        VAR(&WPTYPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LPPARM) TYPE(*CHAR) LEN(64)
             DCL        VAR(&LPMEBR) TYPE(*CHAR) LEN(10)
/*                                                                   */
/* Danner members for parameterfilene                                */
/*                                                                   */
             ADDPFM     FILE(LPSOPF) MBR(&LPMEBR)
             ADDLFM     FILE(LPSOLU) MBR(&LPMEBR) +
                          DTAMBRS((*CURRENT/LPSOPF (&LPMEBR)))
             ADDLFM     FILE(LPSOL1) MBR(&LPMEBR) +
                          DTAMBRS((*CURRENT/LPSOPF (&LPMEBR)))
/*                                                                   */
/* Override parameterfilene/membrene                                 */
/*                                                                   */
             OVRDBF     FILE(LPSOLU) TOFILE(*FILE) MBR(&LPMEBR)
             OVRDBF     FILE(LPSOL1) TOFILE(*FILE) MBR(&LPMEBR)
/*                                                                   */
/* Call til program for seleksjon                                    */
/*                                                                   */
             CALL       PGM(LO634R) PARM(&LPPARM)
/*                                                                   */
/* Call til program for utskrift                                     */
/*                                                                   */
             CALL       PGM(LO636C) PARM(&LPPARM &LPMEBR)
/*                                                                   */
/* Override av parametermembrene oppheves                            */
/*                                                                   */
             DLTOVR     FILE(LPSOLU LPSOL1)
/*                                                                   */
/* Parametermembrene slettes                                         */
/*                                                                   */
             RMVM       FILE(LPSOL1) MBR(&LPMEBR)
             RMVM       FILE(LPSOLU) MBR(&LPMEBR)
             RMVM       FILE(LPSOPF) MBR(&LPMEBR)
/*                                                                   */
             ENDPGM
