             PGM
/*                                                                   */
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&ANTA) TYPE(*DEC) LEN(6)
             DCL        VAR(&GRNS) TYPE(*DEC) LEN(2)
             DCL        VAR(&OTYP) TYPE(*CHAR) LEN(12)

/* Call til program for parameter og kontroll                        */

             CALL       PGM(LO670R) PARM(&GRNS &ANTA &OTYP)
             IF         COND(&ANTA *LT 1) THEN(GOTO CMDLBL(END))

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP600R) PARM('LO670 ' '0' '0' &IN03 &BTCH)

/* Call til program for overstyring av printerfile                   */

             CALL       PGM(AP601C) PARM('LO670P' &BTCH)

/* Call til program for behandling og utskrift                       */

             CALL       PGM(LO671R) PARM(&GRNS &OTYP)

/* Program for å fjerne overstyring av printerfile                   */

             CALL       PGM(AP606C) PARM('LO670P')

/*                                                                   */
END:         ENDPGM
