             PGM        PARM(&PARM &RUTI)

/*6.nu*/     DCL        VAR(&PARM)     TYPE(*CHAR) LEN(34)
             DCL        VAR(&RUTI)     TYPE(*CHAR) LEN(10)

             DCL        VAR(&IN03)     TYPE(*DEC)  LEN(1)
             DCL        VAR(&BTCH)     TYPE(*DEC)  LEN(1)
             DCL        VAR(&PROG)     TYPE(*CHAR) LEN(10)

/* Oppdaterer LDA med rutinenavn                                     */

             CHGDTAARA  DTAARA(*LDA (800 10)) VALUE(&RUTI)

/* Kaller opp AP600R                                                 */

             CALL       PGM(AP600R) PARM(&RUTI '0' '0' &IN03 &BTCH)

/* Hente programnavn fra LDA                                         */

             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PROG)

/* Kaller opp program for utskrift av faktura/kreditnota             */

             CALL       PGM(&PROG)     PARM(&PARM)

ENDPGM:      ENDPGM
