             PGM        PARM(&MEMBR &ONUMM &OSUFF)
/*                                                                   */
/* Initiering av parametre.                                          */
/*                                                                   */
             DCL        VAR(&MEMBR)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&ONUMM)    TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&OSUFF)    TYPE(*DEC)  LEN(2 0)
/*                                                                   */
/* Bygger member og overstyrer                                       */
/*                                                                   */
             CHKOBJ     OBJ(LWEDPF) OBJTYPE(*FILE) MBR(&MEMBR)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(LWEDPF) MBR(&MEMBR) TEXT('Bestilling +
                          i EDI-format')
             ENDDO
             OVRDBF     FILE(LWEDPF) TOFILE(LWEDPF) MBR(&MEMBR)
/*                                                                   */
/* Kaller genereringsprogram                                         */
/*                                                                   */
             CALL       PGM(LO760R) PARM(&ONUMM &OSUFF)
             DLTOVR     FILE(LWEDPF)
/*                                                                   */
 END:        ENDPGM
