             PGM        PARM(&MEMBR &ONUMM &OSUFF)

/* Initiering av parametre.                                          */

             DCL        VAR(&MEMBR)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&ONUMM)    TYPE(*DEC)  LEN(8 0)
             DCL        VAR(&OSUFF)    TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&PDIST)    TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&STAT)     TYPE(*CHAR) LEN(1)

/* Bygger member og overstyrer                                       */

             CHKOBJ     OBJ(LWEDPF) OBJTYPE(*FILE) MBR(&MEMBR)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(LWEDPF) MBR(&MEMBR) TEXT('Bestilling +
                          i EDI-format')
             ENDDO
             OVRDBF     FILE(LWEDPF) TOFILE(LWEDPF) MBR(&MEMBR)

/* Kaller genereringsprogram                                         */

             CHGVAR     VAR(&PDIST) VALUE(0)

             CALL       PGM(LO768R) PARM(&ONUMM &OSUFF &PDIST)
             DLTOVR     FILE(LWEDPF)

/* Overfører kopi til distribusjonssenter hvis funnet                */

             IF         COND(&PDIST = 1) THEN(CALL PGM(LO767C) PARM(&MEMBR +
                          &STAT))

 END:        ENDPGM
