             PGM        PARM(&BNUMM &MEMBR &LKNR &FEIL)

/* Initiering av parametre.                                          */

/*6.nu*/     DCL        VAR(&BNUMM)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&MEMBR)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FILN)   TYPE(*CHAR) LEN(30)
             DCL        VAR(&LKNR)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&STAT)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&SMSG)  TYPE(*CHAR) LEN(1) VALUE('1')
             DCL        VAR(&FEIL) TYPE(*CHAR) LEN(1) VALUE('0')
             DCL        VAR(&OVRF) TYPE(*CHAR) LEN(10) +
                          VALUE('FARVERING ')

             CHGVAR     VAR(&FILN) VALUE('O' *CAT &BNUMM *CAT '.BST')
             RNMM       FILE(LWFRPF) MBR(&MEMBR) NEWMBR(WUT)

/* Sender fil med valgt member til Farveringen                       */

             CALL       PGM(AF700C) PARM(&OVRF &STAT &FILN &SMSG)

             IF         COND(&STAT *NE ' ') THEN(CHGVAR VAR(&FEIL) +
                          VALUE('1'))

/* Sletter member etter overføring                                   */

             RMVM       FILE(LWFRPF) MBR(WUT)

 END:        ENDPGM
