             PGM        parm(&dta &p1 &p2 &p3 &p4 &avs)

             DCL        VAR(&p1)    TYPE(*CHAR) LEN(35)
             DCL        VAR(&p2)    TYPE(*CHAR) LEN(35)
             DCL        VAR(&p3)    TYPE(*CHAR) LEN(35)
             DCL        VAR(&p4)    TYPE(*CHAR) LEN(35)
             DCL        VAR(&avs)   TYPE(*CHAR) LEN(11)
             DCL        VAR(&d)     TYPE(*CHAR) LEN(200)
             DCL        VAR(&dta)   TYPE(*CHAR) LEN(10)
/*                                                                   */
/*    Hent data-area fra *curlib                                     */
/*                                                                   */
             rtvdtaara  dtaara(&dta) rtnvar(&d)
             monmsg     msgid(cpf1015) exec(do)
               crtdtaara  dtaara(&dta) type(*char) len(200) +
                          value('         ') text('Faste +
                          linjer til sms-meld vedr varemottak')
             enddo
             if         cond(&p1 *eq '   ') then(do)
               chgvar     var(&p1)  value(%sst(&d   1 35))
               chgvar     var(&p2)  value(%sst(&d  36 35))
               chgvar     var(&p3)  value(%sst(&d  71 35))
               chgvar     var(&p4)  value(%sst(&d 106 35))
               chgvar     var(&avs) value(%sst(&d 141 11))
               goto       cmdlbl(end)
             enddo
/*                                                                   */
 end:        endpgm
