             PGM        PARM(&MEMB)

/* 120614 bof : Endring ihht. nummerutvidelse                        */
/*                                                                   */
/* Initiering av parametere                                          */

             DCL        VAR(&MEMB)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&MAIL)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&KULE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&KUND)     TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&KPRO)     TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&NUMM)     TYPE(*DEC)  LEN(8 0)
             DCL        VAR(&SELG)     TYPE(*DEC)  LEN(4 0)

/* Overstyring av fil                                                */

             OVRDBF     FILE(LPSOL1)   TOFILE(*FILE) MBR(&MEMB)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('LO920P' &BTCH)

/* Kaller opp program                                                */

             CALL       PGM(LO920R)    PARM(&MAIL &KUND &NUMM &SELG)

             DLTOVR     FILE(LPSOL1)

             CALL       PGM(AP606C)    PARM('LO920P')

/* Skal dette sendes som e-mail ?                                    */

             IF         COND(&MAIL *EQ 'J') THEN(DO)
             CHGVAR     VAR(&KULE)     VALUE('L')
             CALL       PGM(FO798C)    PARM(&KULE &KUND &KPRO +
                                         'LO920P' &NUMM &SELG)
             ENDDO

             ENDPGM
