             pgm        parm(&numm &suff &stat)

/* Definering av parametere og variable                              */

             dcl        var(&numm)     type(*dec)  len(8 0)
             dcl        var(&suff)     type(*dec)  len(2 0)
             dcl        var(&stat)     type(*char) len(1)

             chgdtaara  dtaara(*lda (584 1))  value('1')
             chgdtaara  dtaara(*lda (750 1))  value('1')
             chgdtaara  dtaara(*lda (800 10)) value('LBEST')
             chgdtaara  dtaara(*lda (810 10)) value('E MAIL ASP')
             chgdtaara  dtaara(*lda (871 10)) value(LO928C)

/* Starter program for mailsending                           */

             call       pgm(lo928r)    parm(&numm &suff &stat)

ENDPGM:      ENDPGM
