             PGM        PARM(&PARM)

/* Definering av parametere                                          */
/* 6.nu 030614 Utvidelse vedr. nummerutvidelse                       */
/* Definering av parametere                                          */

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(35)
             DCL        VAR(&PRTF) TYPE(*CHAR) LEN(10) VALUE(LO960P)

             DCL        VAR(&IN03) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

/* Program for utskriftsparametre.                                   */

             CALL       PGM(AP600R) PARM('LO960' '0' '0' &IN03 &BTCH)

/* Oppkall av utskriftsparametre.                                    */

             CALL       PGM(AP601C) PARM(&PRTF &BTCH)

/* Program for utskrift av etikett                                   */

             CALL       PGM(LO960R) PARM(&PARM)
             CALL       PGM(AP606C) PARM(&PRTF)

             ENDPGM
