             PGM        PARM(&PREC)

/* Initiering av parametere                                          */

             DCL        VAR(&PREC) TYPE(*CHAR) LEN(64)
/*           DCL        VAR(&MBOK) TYPE(*CHAR) LEN(10)               */
             DCL        VAR(&PROG) TYPE(*CHAR) LEN(10)
/*           DCL        VAR(&PARM) TYPE(*CHAR) LEN(28)               */

/* Hente inn fra LDA                                                 */

             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PROG)

/* Call av oppdateringsprogram                                       */

             CALL       PGM(LQ705R) PARM(&PREC)

/* Override av parametermembrene oppheves                            */

/*           DLTOVR     FILE(LOVFPF)                                 */

             ENDPGM
