             PGM        PARM(&WPSJEK &WPOUTQ)
/*                                                                   */
             DCL        VAR(&WPSJEK) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPOUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WPATTR) TYPE(*CHAR) LEN(10)
/*                                                                   */
/* Hent inn attributter fra                                          */
/*                                                                   */
             RTVOBJD    OBJ(&WPOUTQ) OBJTYPE(*DEVD) OBJATR(&WPATTR)
             MONMSG     MSGID(CPF0000) EXEC(GOTO FEIL)
/*                                                                   */
/* Sjekk om dette er en skriver                                      */
/*                                                                   */
             IF         COND(&WPATTR *EQ 'PRTLCL') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO
/*                                                                   */
             IF         COND(&WPATTR *EQ 'PRTVRT') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO
/*                                                                   */
             IF         COND(&WPATTR *EQ 'PRTRMT') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO
/*                                                                   */
/* G} til start                                                      */
/*                                                                   */
             GOTO       CMDLBL(ENDPGM)
/*                                                                   */
/* Legger inn kode for at dette ikke er lovlig skriver               */
/*                                                                   */
 FEIL:       CHGVAR     VAR(&WPSJEK) VALUE('1')
/*                                                                   */
 ENDPGM:     ENDPGM
