             PGM
             DCL        VAR(&JOBB)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&OKOK)     TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&USER)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&SBIB)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             DCL        VAR(&MELD)     TYPE(*CHAR) LEN(50)
             MONMSG     MSGID(CPF2103) /*    Bibl finnes fra før     */
             MONMSG     MSGID(CPF2110) /*    Bibl ble ikke funnet    */
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERR))
             RTVJOBA    JOB(&JOBB)     USER(&USER)
/*                                                                   */
/* Call til bruker-file                                              */
/*                                                                   */
             CALL       PGM(AA000R)    PARM(&OKOK &USER &JOBB)
/*                                                                   */
/* Sjekk om bruker ble funnet                                        */
/*                                                                   */
             IF         COND(&OKOK *EQ 1) THEN(DO)
             CHGVAR     VAR(&MELD) VALUE('Denne bruker ble ikke +
                          funnet i brukerregister')
             CALL       PGM(AA005R)    PARM(&MELD)
             GOTO       CMDLBL(END)
             ENDDO
/*                                                                   */
/* Endre biblioteksliste                                             */
/*                                                                   */
             RTVDTAARA  DTAARA(*LDA (934 10)) RTNVAR(&SBIB)
             IF         COND(&SBIB *NE ' ') THEN(DO)
             CHGCURLIB  CURLIB(&SBIB)
             ENDDO
/*                                                                   */
/* Hente inn firmanavn                                        */
/*                                                                   */
             RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
/*                                                                   */
             GOTO       CMDLBL(END)
 ERR:        SNDPGMMSG  MSG('Det oppstod feil i tilordning av +
                          biblioteksliste!!!') TOMSGQ(&JOBB)
 END:        ENDPGM
