             PGM        PARM(&LPPARM &LKODE)

             DCL        VAR(&LPPARM) TYPE(*CHAR) LEN(20)
             DCL        VAR(&LKODE)  TYPE(*CHAR) LEN(1)

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('LV602' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Videre behandling                                                 */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(LV602C) PARM(&LPPARM &LKODE))  +
                          JOB(TELLEBUNT) MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/LV602C) +
                         PARM(&LPPARM &LKODE))

 END:        ENDPGM
