             PGM        PARM(&LPPARM &LKODE)
/*                                                                   */
             DCL        VAR(&LPPARM) TYPE(*CHAR) LEN(20)
             DCL        VAR(&LKODE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID) TYPE(*CHAR) LEN(10)

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP601C) PARM('LV602P' &BTCH)

/* Call til program for utskrift                                     */

             CALL       PGM(LV602R) PARM(&LPPARM &LKODE)

/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDBRKMSG  MSG('ASLAGR: Utskrift av tellebunt +
                          er ferdig') TOMSGQ(&WSID)
             ENDDO

/* Program for å fjerne overstyring av printerfile                   */

             CALL       PGM(AP606C) PARM('LV602P')

/*                                                                   */
             ENDPGM
