        PGM  parm(&filg)

        dcl        var(&filg)   type(*char) len(3)
        dcl        var(&grpprf) type(*char) len(10)
        dcl        var(&null)   type(*char) len(1) value(' ')


/*           Finner gruppeprofil for sikkerhet                       */
        rtvusrprf  grpprf(&grpprf)

/* Oppretter nødvendige filer                                   */

        call       pgm(ag906c) parm('LEDIPF' &filg &grpprf &null)  /*LEDIPF*/
        call       pgm(ag906c) parm('GEDGPF' &filg &grpprf &null)  /*GEDGPF*/
        call       pgm(ag906c) parm('LEDLPF' &filg &grpprf &null)  /*LEDLPF*/

/* Kjører oppgradering av LEDIPF                                */

        call       pgm(lx110r)

END: ENDPGM
