             PGM        PARM(&FILE &FLDR &FEIL)

/* Initiering av parametre.                                          */

             DCL        VAR(&FILE)     TYPE(*CHAR) LEN(12)
             DCL        VAR(&FLDR)     TYPE(*CHAR) LEN(20)
             DCL        VAR(&FEIL)     TYPE(*CHAR) LEN(1)

/* Parametre som brukes for å hente data fra IFS området             */

             dcl        var(&fradoc) type(*char) len(30)
             dcl        var(&framap) type(*char) len(30)
             dcl        var(&tillib) type(*char) len(10)
             dcl        var(&tilfil) type(*char) len(10)
             dcl        var(&tilmbr) type(*char) len(10)
             dcl        var(&fgr)    type(*char) len(3)
             dcl        var(&sts)    type(*char) len(8)

             MONMSG     MSGID(CPF8A00) EXEC(GOTO CMDLBL(FEIL))
             MONMSG     MSGID(IWS1611) EXEC(GOTO CMDLBL(FEIL))

/* Initierer feil-flagg                                              */

             CHGVAR     VAR(&FEIL) VALUE('0')

/* Tømmer pc-overført  tabell på AS/400                              */

             CLRPFM     FILE(lwexPF)

/* Kopierer innhold fra PC-fil i mappe over til AS/400-filer         */

             rtvdtaara  dtaara(*lda (931 03)) rtnvar(&fgr)
             chgvar     var(&framap)  value('/ASP/' *cat &fgr   *cat '/' +
                          *cat &fldr)
             chgvar     var(&fradoc)  value(&FILE)
             chgvar     var(&tillib)  value('ADB' *cat &fgr )
             chgvar     var(&tilfil)  value('LWEXPF')
             chgvar     var(&tilmbr)  value('LWEXPF')
             chgvar     var(&sts)     value(' ') /* 'A' dersom *Add */
             call       pgm(aspfrstmf) parm(&fradoc &framap &tillib +
                          &tilfil &tilmbr &sts)
             if         cond(&sts *ne ' ') then(goto cmdlbl(feil))

             GOTO       CMDLBL(END)

 FEIL:       CHGVAR     VAR(&FEIL) VALUE('1')

 END:        ENDPGM
