             PGM        PARM(&PARM)

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(128)
             DCL        VAR(&MBR)  TYPE(*CHAR) LEN(10) +
                                   VALUE('ASLOGI    ')
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)
/*                                                                   */
/* Sjekker om member for ASLOGI ligger på fila                       */
/*                                                                   */
             CHKOBJ     OBJ(*LIBL/LWB1PF) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
 MSG:        SNDUSRMSG  MSG('Arbeidsfile for ABC-analyse +
                             finnes ikke. Kontakt systemansvarlig.+
                                ')
             GOTO       CMDLBL(ENDPGM)
             ENDDO
/*                                                                   */
/* Sjekker om member for ASLOGI ligger på fila                       */
/*                                                                   */
             CHKOBJ     OBJ(*LIBL/LWB1PF) OBJTYPE(*FILE) MBR(&MBR)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(*LIBL/LWB1PF) MBR(&MBR) TEXT('Member for +
                          ASLOGI')
                        ENDDO
             CHKOBJ     OBJ(*LIBL/LWB1LU) OBJTYPE(*FILE) MBR(&MBR)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDLFM     FILE(*LIBL/LWB1LU) MBR(&MBR) +
                          DTAMBRS((*CURRENT/LWB1PF (&MBR)))
                        ENDDO
             CHKOBJ     OBJ(*LIBL/LWB1L1) OBJTYPE(*FILE) MBR(&MBR)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDLFM     FILE(*LIBL/LWB1L1) MBR(&MBR) +
                          DTAMBRS((*CURRENT/LWB1PF (&MBR)))
                        ENDDO
             CHKOBJ     OBJ(*LIBL/LWB1L2) OBJTYPE(*FILE) MBR(&MBR)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDLFM     FILE(*LIBL/LWB1L2) MBR(&MBR) +
                          DTAMBRS((*CURRENT/LWB1PF (&MBR)))
                        ENDDO
             CHKOBJ     OBJ(*LIBL/LWB1L3) OBJTYPE(*FILE) MBR(&MBR)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDLFM     FILE(*LIBL/LWB1L3) MBR(&MBR) +
                          DTAMBRS((*CURRENT/LWB1PF (&MBR)))
                        ENDDO
             CHKOBJ     OBJ(*LIBL/LWB1L4) OBJTYPE(*FILE) MBR(&MBR)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDLFM     FILE(*LIBL/LWB1L4) MBR(&MBR) +
                          DTAMBRS((*CURRENT/LWB1PF (&MBR)))
                        ENDDO
             CHKOBJ     OBJ(*LIBL/LWB1L5) OBJTYPE(*FILE) MBR(&MBR)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDLFM     FILE(*LIBL/LWB1L5) MBR(&MBR) +
                          DTAMBRS((*CURRENT/LWB1PF (&MBR)))
                        ENDDO
             CHKOBJ     OBJ(*LIBL/LWB1L6) OBJTYPE(*FILE) MBR(&MBR)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDLFM     FILE(*LIBL/LWB1L6) MBR(&MBR) +
                          DTAMBRS((*CURRENT/LWB1PF (&MBR)))
                        ENDDO

             RTVJOBA    JOB(&WJOB)

             SBMJOB     CMD(CALL PGM(MB701C) PARM(&PARM &WJOB)) +
                          JOB(ABC_ANALYS) MSGQ(*NONE)


 ENDPGM:     ENDPGM
