
             PGM        PARM(&MEMB)

             DCL        VAR(&MEMB) TYPE(*CHAR) LEN(10)

             RMVM       FILE(*LIBL/RBUNL1) MBR(&MEMB)
             MONMSG     MSGID(CPF0000)

             RMVM       FILE(*LIBL/RBUNLU) MBR(&MEMB)
             MONMSG     MSGID(CPF0000)

             RMVM       FILE(*LIBL/RBUNPF) MBR(&MEMB)
             MONMSG     MSGID(CPF0000)

             RMVM       FILE(*LIBL/RTRAL1) MBR(&MEMB)
             MONMSG     MSGID(CPF0000)

             RMVM       FILE(*LIBL/RTRALU) MBR(&MEMB)
             MONMSG     MSGID(CPF0000)

             RMVM       FILE(*LIBL/RTRAPF) MBR(&MEMB)
             MONMSG     MSGID(CPF0000)

             ENDPGM
