             PGM        PARM(&PARM)

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(128)

             SBMJOB     CMD(CALL PGM(MM700R) PARM(&PARM))


 ENDPGM:     ENDPGM
