             PGM        PARM(&PARM)

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(128)
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

             RTVJOBA    JOB(&WJOB)

             SBMJOB     CMD(CALL PGM(MM732C) PARM(&PARM &WJOB)) +
                          JOB(PROG_UKE) MSGQ(*NONE)
/*           CALL PGM(MM732C) PARM(&PARM &WJOB)          */


 ENDPGM:     ENDPGM
