             PGM        PARM(&PARM &WJOB)

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(128)
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

             CALL PGM(MM732R) PARM(&PARM)

/* Ferdigmelding                                                     */

             SNDBRKMSG  MSG('ASLAGR: Prognose pr. uke er ferdig') +
                           TOMSGQ(&WJOB)



 ENDPGM:     ENDPGM
