             PGM        PARM(&PARM)

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(128)
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

             RTVJOBA    JOB(&WJOB)

             SBMJOB     CMD(CALL PGM(MM739C) PARM(&PARM &WJOB)) +
                          JOB(PROGNOSE) MSGQ(*NONE)
/*           CALL PGM(MM739C) PARM(&PARM &WJOB)            */


 ENDPGM:     ENDPGM
