             PGM        PARM(&PARM &WJOB)

             DCL        VAR(&PARM) TYPE(*CHAR) LEN(128)
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

/* Sletter innhold av MPRWPF */
             CALL       PGM(MM402R)

             OVRDBF     FILE(MPROLU) TOFILE(*LIBL/MPRWLU)
             OVRDBF     FILE(MPROPF) TOFILE(*LIBL/MPRWPF)

             CALL PGM(MM734R) PARM(&PARM)

             DLTOVR     FILE(MPROLU)
             DLTOVR     FILE(MPROPF)

             SNDBRKMSG  MSG('ASLAGR: Prognose innkjøps-parm er -  +
                        ferdig')   TOMSGQ(&WJOB)


 ENDPGM:     ENDPGM
