             PGM
             DCLF       FILE(MN00)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(FSETUP)


 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
/*           CHGVAR     VAR(&VALG)     VALUE(0)       */
/*           CHGVAR     VAR(&A1FNAV)   VALUE(&FNAV)   */
             SNDRCVF    RCDFMT(A1MNU)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
