
/*           Endre start dato og tid for neste sending av bestilling  */

 STRPGM:     PGM        PARM(&p_jobb &p_dato &p_kl)

             DCL        VAR(&p_jobb) TYPE(*CHAR) LEN(10)
             DCL        VAR(&p_dato) TYPE(*CHAR) LEN(10)
             DCL        VAR(&p_kl)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&fgr)    TYPE(*CHAR) LEN(3)
             DCL        VAR(&usr)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&txt)    TYPE(*CHAR) LEN(50)
             DCL        VAR(&cmd)    TYPE(*CHAR) LEN(70)

             CHGJOBSCDE JOB(&P_JOBB) SCDDATE(&P_DATO) SCDTIME(&p_KL)

             monmsg     msgid(cpf1620) exec(do)
               rtvdtaara dtaara(*lda (931 3)) rtnvar(&fgr)
               chgvar    var(&cmd)  value('call pgm(nxcloud/mp700c) +
                                          parm(' *cat &fgr  *cat ')')
               chgvar    var(&usr)  value('ASP_' *cat &fgr)
               chgvar    var(&txt)  value('Bestillingsforslag ' *cat +
                          &fgr *cat ', Neste klokkeslett')
               addjobscde job(&p_jobb) cmd(call vxcloud/mp700c parm(&fgr)) +
                          frq(*once) scddate(&p_dato) +
                          scdtime(&p_kl) save(*yes) user(&usr) +
                          text(&txt)
             enddo

 ENDPGM:     ENDPGM
