             PGM        parm(&fgr)
             dcl        var(&fgr)  type(*char)   len(3)
             dcl        var(&lib)  type(*char)   len(10)

             CALL       PGM(AA720C) PARM(&fgr)

             chgvar     var(&lib)   value('ADB' *tcat &fgr)
             CHGCURLIB  CURLIB(&lib)

/*           DLYJOB     DLY(10)                   */

             CALL PGM(MP700R)

END: ENDPGM
