             pgm        parm(&til &fra &subj &inif)

 /* Programmet er helt omskrevet ifbm bruk av PROA som ny mailmetode    */

             dcl        var(&til)  type(*char) len(50)
             dcl        var(&fra)  type(*char) len(50)
             dcl        var(&subj) type(*char) len(250)
             dcl        var(&inif) type(*char) len(100)

 /* Kaller program for å lage mail                                    */
             call       pgm(af727r) parm(&til &fra &subj &inif)

/* Avslutter programmet.                                                     */

             endpgm
