             PGM        PARM(&LPPARM)

             DCL        VAR(&LPPARM) TYPE(*CHAR) LEN(256)

             DCL        VAR(&NUMM)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DANNET) TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('MP710' '0' '0' &IN03 &BTCH)

             CHGVAR     VAR(&BTCH) VALUE('0')

/* Generering                                                        */

/*           IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +   */
/*                        PGM(MP712C) PARM(&LPPARM)) +               */
/*                        JOB(BES_VARSEL) MSGQ(*NONE))               */
/*           ELSE       CMD(CALL PGM(*LIBL/MP712C) PARM(&LPPARM))    */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(LH702R) PARM(&LPPARM &NUMM &DANNET)) +
                          JOB(BES_VARSEL) MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/LH702R) PARM(&LPPARM &NUMM &DANNET))

 END:        ENDPGM
