             PGM

/* FDIR = Fra dir. Mappe på IFS, f.eks. /home/asp/mappe1             */+
/* TDIR = Til dir. Mappe på IFS.                                     */
/* DELE = Slette etter henting? 1=Ja, 0=Nei.                         */
/* REXT = Nytt etternavn etter kopi til backup mappe.                */
/* BIBL = Bibliotek der AS400 filen ligger.                          */
/* FILE = Navn på AS400 filen.                                       */
/* MEMB = Navn på member i AS400 filen.                              */
/* PATT = Mønster for hvilke filer som skal hentes. Eks. *.*         */
/* STAT = Status på jobb. Blank betyr OK.                            */

/* Initiering av parametre.                                          */

             DCL        VAR(&FDIR) TYPE(*CHAR) LEN(50)
             DCL        VAR(&TDIR) TYPE(*CHAR) LEN(50)
             DCL        VAR(&DELE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&REXT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BIBL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MEMB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PATT) TYPE(*CHAR) LEN(20)
             DCL        VAR(&STAT) TYPE(*CHAR) LEN(1)

/* Klargjør filer før mottak                                         */

             CLRPFM     FILE(LWPAPF)

/* Kopierer fil fra integrert filsystem                              */

             CHGVAR     VAR(&FDIR) VALUE('/home/Tredata')
             CHGVAR     VAR(&TDIR) VALUE('/home/Tredata/Trebac')
             CHGVAR     VAR(&DELE) VALUE('1')
             CHGVAR     VAR(&REXT) VALUE('bac       ')
             CHGVAR     VAR(&BIBL) VALUE('ADB630    ')
             CHGVAR     VAR(&FILE) VALUE('LWPAPF    ')
             CHGVAR     VAR(&MEMB) VALUE('LWPAPF    ')
             CHGVAR     VAR(&PATT) VALUE('*.TXT               ')
             CHGVAR     VAR(&STAT) VALUE('1')

             CALL       PGM(MT701C) PARM(&FDIR &TDIR &DELE &REXT +
                                         &BIBL &FILE &MEMB &PATT &STAT)

/* Call til program for oppdatering                                  */

  /*         CALL       PGM(MT700R)     */

             ENDPGM
