/*********************************************************************/
/*                                                                  */
/*_______________________________________________________________   */
/* ENDRINGER :                                                      */
/* DATO      INZ  UTFØRT                                            */
/* ---------------------------------------------------------------  */
/* 15.11.01  MHA  NYTT PROG                                         */
/* 25.10.13  MHA  Proxy til AF770C med utvidet xnavn                */
/*                                                                  */
/*****************************************************************  */

             PGM        PARM(&NAVN &STATUS &XNAVN2 &SHWMSG)

             DCL        VAR(&NAVN)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&STATUS)   TYPE(*CHAR) LEN(1)

             DCL        VAR(&XNAVN2)   TYPE(*CHAR) LEN(20)
             DCL        VAR(&XNAVN)    TYPE(*CHAR) LEN(64)
             DCL        VAR(&SHWMSG)   TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&XNAVN) VALUE(&XNAVN2)

             CALL       PGM(NG770C) PARM(&NAVN &STATUS +
                         &XNAVN &SHWMSG)
/* Avslutter programmet.                                                     */
SLUTT:       ENDPGM
