             PGM
/*                                                                   */
/* 25.05.11 Utvidet med knytte leverandører             bof          */
/*                                                                   */
/* 31.03.14 Lagt inn mulighet for å vedlikeholde prosjekt nho  6.20  */
/* 07.11.17 Endret på kall til VE540R til VE540C          bof        */
             DCLF       FILE(NL30)
             DCL        VAR(&APFNAV)   TYPE(*CHAR) LEN(30)
             DCL        VAR(&APLEVL)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK)   TYPE(*CHAR) LEN(2)

             DCL        VAR(&FIRM_ALF) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRM)     TYPE(*DEC)  LEN(3 0)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

/* Sette opp driftsmiljø                                             */

             CALL       PGM(FSETUP)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&APLEVL) VALUE('20')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             SNDRCVF    RCDFMT(A1MNU)

             RTVDTAARA  DTAARA(*LDA (944 3)) RTNVAR(&FIRM_ALF)
             CHGVAR     VAR(&FIRM)     VALUE(&FIRM_ALF)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
/*           IF         COND(&IN01) THEN(DO)                         */
/*           CALL       PGM(AA001C)                                  */
/*           GOTO       CMDLBL(START)                                */
/*           ENDDO                                                   */

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
/*           IF         COND(&IN06) THEN(DSPMSG)                     */

/* F10                                                               */
/*           IF         COND(&IN10) THEN(CALL QCMD)                  */

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1  Varer                                                     */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(VV100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2   GTIN nummer                                              */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(VE540C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3  Gebyr/påslag                                              */
             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(FG100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4  Prisoppdatering                                           */
             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(FW100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5  Tilbudspriser                                             */
             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(VT100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6  Etiketter                                                 */
             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(FP210C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7  Etikettkoder, leverandører                                */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(FP430R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8  Rabattmatrise                                             */
             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(FR100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9  Rabattkategori                                            */
             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(RA106R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 10 Varegrupper                                               */
             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(VG100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 21  Kunder                                                   */
             IF         COND(&VALG *EQ 21) THEN(DO)
             CALL       PGM(RK100R) PARM(&FIRM)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 22  Kundeprosjekt                                            */
             IF         COND(&VALG *EQ 22) THEN(DO)
             CALL       PGM(FL100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 23  Leverandører                                             */
             IF         COND(&VALG *EQ 23) THEN(DO)
             CALL       PGM(RL100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 24  Selger                                                   */
             IF         COND(&VALG *EQ 24) THEN(DO)
             CALL       PGM(RA109R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 25  Knytte                                                   */
             IF         COND(&VALG *EQ 25) THEN(DO)
             CALL       PGM(JL100R)
             GOTO       CMDLBL(START)
             ENDDO


/* Valg 26 - Vedlikehold av prosjekt 6.20                            */

             IF         COND(&VALG *EQ 26) THEN(DO)
             CALL       PGM(RP100R)
             GOTO       CMDLBL(START)
             ENDDO
/* Valg 31                                                           */
             IF         COND(&VALG *EQ 31) THEN(DO)
             CALL       PGM(VT734R)
             GOTO       CMDLBL(START)
             ENDDO


/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
