/*-------------------------------------------------------------------*/
/* 081221  bsa Nytt program                                          */
/* NB Data fra denne jobben må være lest inn i datahuben til MGR     */
/*    før kl 05. Jeg setter denn til å gå 22 dagen før, noe som      */
/*    bør være tilstrekkelig.                                        */
/*                                                                   */
/* 020622  bsa Lagt til program for oppdatering av akkumulator på    */
/* 020622      lager basert på bestillinger.   *9.01*                */
/* 280622  bsa Lagt til program for Open Orders *9.02*               */
/*                                                                   */
/*                                                                   */
/*-------------------------------------------------------------------*/
             PGM

/* Definering av parametere og variable                              */

             dcl        var(&memb)  type(*char) len(10)

/* Eksport av daglig salg (invoice daily)                           */
/* Kjøres først, da den jobben ikke bør gå over på ny dato          */
             call       pgm(nm723r) parm(&memb)

/* Eksport av historisk salg (demand history)                       */
/*           call       pgm(nm725r) parm(&memb)                     */

/* Eksport av vareinformasjon (item/sources)                        */
             call       pgm(nm720r) parm(&memb)

/* Starter Oppdatering av lager-register utfra bestillingster        */
/*9.01*/     CALL       PGM(LA920RNAT)

/* Eksport av lagerbeholdning (stock)                               */
             call       pgm(nm722r) parm(&memb)

/* Eksport av åpne bestillinger (Open Orders)                       */
             call       pgm(nm726r) parm(&memb)

             ENDPGM
