             PGM        PARM(&KUND)

             DCL        VAR(&KUND) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&LAGE) TYPE(*CHAR) LEN(2)
             DCL        VAR(&AVDE) TYPE(*CHAR) LEN(4)

/* Henter lagernummer fra kunde                                     */

             CALL       PGM(NN899R) PARM(&KUND &LAGE &AVDE)
             CHGDTAARA  DTAARA(*LDA (1001 2)) VALUE(&LAGE)
             CHGDTAARA  DTAARA(*LDA (947 4)) VALUE(&AVDE)

 END:        ENDPGM
