             pgm

             dcl        var(&p_kode)  type(*char) len(3)    value(' ')
             dcl        var(&p_pros)  type(*char) len(6)    value(' ')
             dcl        var(&p_upro)  type(*char) len(6)    value(' ')
             dcl        var(&p_akti)  type(*char) len(6)    value(' ')
             dcl        var(&p_kpro)  type(*dec)  len(6 0)  value(0)

             call       no100r  parm(&p_kode &p_pros &p_upro &p_akti &p_kpro)

 endpgm:     endpgm
