             pgm        parm(&filg &fira &ekstkey &lager &avdel &status)

             dcl        var(&filg)    type(*char) len(3)
             dcl        var(&bibl)    type(*char) len(6)
             dcl        var(&fira)    type(*char) len(3)
             dcl        var(&firm)    type(*dec)  len(3 0)
             dcl        var(&ekstkey) type(*char) len(30)
             dcl        var(&lager)   type(*char) len(2)
             dcl        var(&avdel)   type(*dec)  len(4 0)
             dcl        var(&status)  type(*dec)  len(1 0)

             chgvar     var(&firm) value(%dec(&fira))

/* Setter riktig miljø for kjøring av rutine                         */

             chgvar     var(&bibl) value('ADB' *cat &filg)

             call       pgm(aa720c) parm(&filg)

             chgcurlib  curlib(&bibl)

/* Setter staus for vellykket oppdatering                            */

             chgvar     var(&status) value(1)

/* Oppdaterer Winner innlesningsfiler                                */

             call       pgm(no880r) parm(&firm &ekstkey &lager &avdel +
                          &status)


 endpgm:     endpgm
