             PGM        parm(&FGRP)

             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)  VALUE(' ')
             DCL        VAR(&usr)  TYPE(*CHAR) LEN(10) value('ASP_')
             DCL        VAR(&fgrp)  TYPE(*char) len(3)
             DCL        VAR(&GRPF)  TYPE(*char) len(10)
             dcl        var(&dir)  type(*char) len(40) +
                          Value('/asp/xxx/nobbxml')


             CHGVAR     VAR(%SST(&usr  5 3)) VALUE(&FGRP)
/*           Finner gruppeprofil for sikkerhet                       */
             rtvusrprf  usrprf(&usr) grpprf(&grpf)


             call       PGM(AG906C) PARM('JBEIPF' &fgrp &grpf &null)
             call       PGM(AG906C) PARM('JRAIPF' &fgrp &grpf &null)

/* danner ny ifs-mappe */
             chgvar     var(%sst(&dir 6 3)) value(&fgrp)
             CRTDIR     DIR(&DIR)
             monmsg     msgid(cpfa0a0)
             CHGATR     OBJ(&dir) ATR(*CCSID) VALUE(1252)

/* danner forekomst i anumpf BETING */
             call       pgm(jp991r) parm(&fgrp)

 END:        ENDPGM
