        pgm        parm(&filg)

/*8.01 PRG2 230224 bsa : Tar backup av tabeller                           */

        dcl        var(&ftab) type(*char) len(10)
        dcl        var(&ttab) type(*char) len(10)
        dcl        var(&filg) type(*char) len(3)
        dcl        var(&grpf) type(*char) len(10) value('GRP_XXX')

        chgvar     var(%sst(&grpf 5 3)) value(&filg)

/* Start backup                                                      */

             chgvar     var(&ftab) value('fdespf')   /*Slettet ordre*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('fodtpf')   /*Ordrelinjer*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('fpripf')   /*Spesialpris*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('fprwpf')   /*Spesialpris-work*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('frabpf')   /*Rabattmatrise*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('frawpf')   /*Rabattmatrise-work*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jbeipf')   /*Betingelse innlest*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jbetpf')   /*Betingelse*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jbeupf')   /*Betingelse eksp xlbygg*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jbewpf')   /*Betingelse*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jfbepf')   /*Fraktbetingelse*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jkahpf')   /*Kampanje-hode*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jkavpf')   /*Kampanje-vare*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jpfapf')   /*Påslag*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jpfupf')   /*Påslag eksport XLBYGG*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jraepf')   /*Rabattelement*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jraipf')   /*Rabattelement*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jraupf')   /*Rabattelem. eks XLBYG*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('jrawpf')   /*Rabattelement*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('ra07pf')   /*Avdelinger*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('ra30pf')   /*Prisgrupper*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('sodtpf')   /*Fakturalinje*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('sstxpf')   /*Kunde statistikk - BM*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('vklupf')   /*Kundeklubb*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('vpdtpf')   /*Påslag linje*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('vpgrpf')   /*Prisgruppe tilknytning*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('vtilpf')   /*Tilbudspriser*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('vti2pf')   /*Tilbudspriser*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('vvaqpf')   /*Vare query*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('vvprpf')   /*Vare-pris*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('fxl1st')   /*Vare-pris*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('mgk1st')   /*VA kampanje MG pris*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

             chgvar     var(&ftab) value('mgk2st')   /*VA kampanje MG pris*/
             chgvar     var(&ttab) value(&ftab *tcat &filg)
             CPYF       FROMFILE(&ftab) +
                          TOFILE(OPPGR_PR2/&ttab) MBROPT(*REPLACE) +
                          CRTFILE(*YES)
             monmsg     msgid(cpf2802 cpf2817)

        endpgm
