             PGM        PARM(&numm &suff &acti &stat)

             DCL        VAR(&numm)     TYPE(*DEC)  LEN(8 0)
             DCL        VAR(&suff)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&acti)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&stat)     TYPE(*CHAR) LEN(1)


/* Kaller opp program                                                */

             CALL       PGM(QO601R) PARM(&numm &suff &acti &stat)

             ENDPGM
