             PGM        parm(&f &n)

/* Initiering av parametre.                                          */

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&F)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&N)    TYPE(*CHAR) LEN(10)
/*           monmsg     msgid(MCH3601)                               */
/*           wrkmbrpdm  file(*libl/radbpf) MBR(*all)                 */
             if         cond(&f *eq ' ') then(goto cmdlbl(endpgm))
/* Oppgi parameter, periode for oppdatering av innbetaløinger        */

             CALL       PGM(Ra201r) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Varselbilde 1                                                     */

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Innlesing av poster    **')
             CHGVAR     VAR(&MLD2) VALUE('** Eksterne systemer  ***')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

/* Call av utskriftsprogram til batch/demand                         */

/*  Adra-Innbetalinger        */

             CALL       PGM(Ra200C) parm('MBR' &F &N)

 ENDPGM:     ENDPGM
