             PGM

             dcl        var(&filin) type(*char) len(50)
             dcl        var(&filut) type(*char) len(50)
             dcl        var(&clib)  type(*char) len(10)

             call       aspgplk/ipasp_g01
             clrpfm     file(adrkund)
             monmsg     msgid(cpf3142) exec(do)
               crtpf    file(adrkund) rcdlen(256) size(*nomax) +
                        text('Ovf. av kunder til Adra Match')
             enddo

             call       pgm(Ra210r)   parm('G01')

             rtvjoba    curlib(&clib)
             chgvar     var(&filin) value('/qsys.lib/' *tcat +
                          &clib *tcat +
                          '.lib/adrkuns.file/adrkuns.mbr')
             chgvar     var(&filut) value('/asp/Bankfiler' +
                          *tcat '/adrkuns')
             clrpfm     file(adrkuns)
             monmsg     msgid(cpf3142) exec(do)
               crtpf    file(*curlib/adrkuns) rcdlen(256) size(*nomax) +
                          text('Kunder til Adra Match')
             enddo
             cpyf       fromfile(adrkund) tofile(adrkuns) +
                          mbropt(*add) fmtopt(*nochk)
             cpytostmf  frommbr(&filin) tostmf(&filut) +
                          stmfopt(*replace)

 ENDPGM:     ENDPGM
