             PGM        PARM(&IN03 &TYPE &EDAT)

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&EDAT)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RC601 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(RC601C) PARM(&TYPE &EDAT)) JOB(SLETT_SAK ) +
                          MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/RC601C) PARM(&TYPE &EDAT))

 END:        ENDPGM
