             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&FIRM)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&BTCH)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD3) TYPE(*CHAR) LEN(50)
             DCL        VAR(&MLD4) TYPE(*CHAR) LEN(50)
             DCL        VAR(&WMM1)  TYPE(*CHAR) LEN(10) VALUE('INKA   ')
             DCL        VAR(&WANP)  TYPE(*DEC) LEN(1 0) VALUE(0)
             DCL        VAR(&IN12)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&SVAR)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&pskr)  TYPE(*CHAR) LEN(1)
/* Henter verdier i fra LDA.                                         */

             RTVDTAARA  DTAARA(*LDA (863 1))  RTNVAR(&BTCH)
             RTVDTAARA  DTAARA(*LDA (944 3))  RTNVAR(&FIRM)
             RTVDTAARA  DTAARA(*LDA (469 1))  RTNVAR(&pskr)

             CHGVAR     VAR(%SST(&WMM1 5 3)) VALUE(&FIRM)

             IF COND(&pskr *eq 'J') THEN(DO)
              CHGDTAARA DTAARA(*LDA (464 1)) VALUE(J)
              CALL PGM(RC653C)
             enddo

             OVRDBF     FILE(RKWAPF) MBR(&WMM1)
             OVRDBF     FILE(RKWBPF) MBR(&WMM1)
             OVRDBF     FILE(RKWBLU) MBR(&WMM1)

             CALL       PGM(RC655R)  parm(&wanp)

             IF COND(&WANP *NE 1) THEN(DO)
              CHGVAR VAR(&MLD3) VALUE('Ingen poster lagt ut for overføring')
              CHGVAR VAR(&MLD4) VALUE('  Venligst bekreft.        ')
              CALL PGM(AA007R) PARM(&MLD3 &MLD4 &SVAR &IN12)
              GOTO CMDLBL(rydd)
             ENDDO

             call       pgm(rc656r)

rydd:        DLTOVR     FILE(RKWAPF)
             DLTOVR     FILE(RKWBLU)
             DLTOVR     FILE(RKWBPF)

             RMVM       FILE(*LIBL/RKWAPF) MBR(&WMM1)
             MONMSG     MSGID(CPF3200 cpf7310)
             RMVM       FILE(*LIBL/RKWBL1) MBR(&WMM1)
             MONMSG     MSGID(CPF3200 cpf7310)
             RMVM       FILE(*LIBL/RKWBLU) MBR(&WMM1)
             MONMSG     MSGID(CPF3200 cpf7310)
             RMVM       FILE(*LIBL/RKWBLR) MBR(&WMM1)
             MONMSG     MSGID(CPF3200 cpf7310)
             RMVM       FILE(*LIBL/RKWBPF) MBR(&WMM1)
             MONMSG     MSGID(CPF3200 cpf7310)

 ENDPGM:     ENDPGM
