             PGM        PARM(&SYST)

/* Initiering av parametre.                                          */

             DCL        VAR(&SYST) TYPE(*CHAR) LEN(4)
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)

/* Call av parameterprogram, saldobalanse til PC                     */

             CALL       PGM(RE600R) PARM(&SYST &IN03)

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Varselbilde 1                                                     */

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Klargjøring for PC  *****')
             CHGVAR     VAR(&MLD2) VALUE('**** SALDOBALANSE   *****')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

/* Call av utskriftsprogram                                          */


             IF         COND(&SYST *EQ 'PC  ') THEN(DO)
             CALL       PGM(RE601C)
             ENDDO

             IF         COND(&SYST *EQ 'FINA') THEN(DO)
             CALL       PGM(RE607C)
             ENDDO

             IF         COND(&SYST *EQ 'TOTA') THEN(DO)
             CALL       PGM(RE609C)
             ENDDO

             IF         COND(&SYST *EQ 'MAX ') THEN(DO)
             CALL       PGM(RE611C)
             ENDDO

             IF         COND(&SYST *EQ 'MAES') THEN(DO)
             CALL       PGM(RE613C)
             ENDDO

             IF         COND(&SYST *EQ 'AKEL') THEN(DO)
             CALL       PGM(RE615C)
             ENDDO

 ENDPGM:     ENDPGM
