             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)

/* Call av parameterprogram, saldobalanse til PC                     */

             CALL       PGM(RE602R) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Varselbilde 1                                                     */

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Klargjøring for PC  *****')
             CHGVAR     VAR(&MLD2) VALUE('**** SALDOBALANSE   *****')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

/* Call av utskriftsprogram                                          */

             CALL       PGM(RE603C)

 ENDPGM:     ENDPGM
