             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FFIR) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FAVD) TYPE(*CHAR) LEN(4)
             DCL        VAR(&MEMB) TYPE(*CHAR) LEN(10) VALUE('KLI   ')
             DCL        VAR(&tild)  TYPE(*CHAR) LEN(25)

/* Henter verdier i fra LDA.                                         */

             RTVDTAARA  DTAARA(*LDA (944 03)) RTNVAR(&FFIR)
             RTVDTAARA  DTAARA(*LDA (357 04)) RTNVAR(&FAVD)
             CHGVAR     VAR(%SST(&MEMB 4 3)) VALUE(&FFIR)

/* Varselbilde 2                                                     */

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt .....')
             CHGVAR     VAR(&MLD2) VALUE('Utplukk pågår ...........')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

/* Bygger membere dersom de ikke finnes                              */

             CHKOBJ     OBJ(RE08PF) OBJTYPE(*FILE) MBR(&MEMB)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(RE08PF) MBR(&MEMB) TEXT('Saldobalanse +
                          til AKELIUS for PC')
             ENDDO

             CLRPFM     FILE(RE08PF) MBR(&MEMB)
             MONMSG     MSGID(CPF3100)

/* Utplukking av poster                                              */

             OVRDBF     FILE(RE08PF) MBR(&MEMB)

             CALL       PGM(RE615R)

             DLTOVR     FILE(RE08PF)

/* Utvekslingsfile legges ut i DIR: PCAKELIS (I:)                    */

/*           CPYTOPCD   FROMFILE(*LIBL/RE08PF) TOFLR(PCAKELIS) +    */
/*                      FROMMBR(&MEMB) TODOC(&MEMB) REPLACE(*YES) + */
                          /* Saldobalanse fra AS Økonomi */
             chgvar     var(&tild) value(&memb)
             call       pgm(asptostmf) +
                        parm('RE08PF    ' +
                             &memb   +
                             'PCAKELIS            ' +
                             &tild   +
                             '   ')

               MONMSG     MSGID(CPF0000)

 END:        ENDPGM
