             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&WALI)   TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)   TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)   TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)   TYPE(*CHAR) LEN(40)
             DCL        VAR(&FFIR)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&FAVD)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&MEMB) TYPE(*CHAR) LEN(10) VALUE('K     ')
             DCL        VAR(&tild)  TYPE(*CHAR) LEN(25)

/* Henter verdier i fra LDA.                                         */

             RTVDTAARA  DTAARA(*LDA (944 03)) RTNVAR(&FFIR)
             RTVDTAARA  DTAARA(*LDA (357 04)) RTNVAR(&FAVD)
             CHGVAR     VAR(%SST(&MEMB 2 3)) VALUE(&FFIR)
             CHGVAR     VAR(%SST(&MEMB 5 4)) VALUE(&FAVD)

/* Varselbilde 2                                                     */

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt .....')
             CHGVAR     VAR(&MLD2) VALUE('Utplukk pågår ...........')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

/* Bygger membere dersom de ikke finnes                              */

             CHKOBJ     OBJ(RE02PF) OBJTYPE(*FILE) MBR(&MEMB)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(RE02PF) MBR(&MEMB) TEXT('Poster til +
                          rapport-register for PC')
             ENDDO

             CLRPFM     FILE(RE02PF) MBR(&MEMB)
             MONMSG     MSGID(CPF3100)

/* Utplukking av poster                                              */

             OVRDBF     FILE(RE02PF) MBR(&MEMB)

             CALL       PGM(RE621R)

             DLTOVR     FILE(RE02PF)

/* Utvekslingsfile legges ut i DIR: PCRAPP (I:)                      */

/*           CPYTOPCD   FROMFILE(*LIBL/RE02PF) TOFLR(PCRAPP) +      */
/*                      FROMMBR(&MEMB) TODOC(&MEMB) REPLACE(*YES) + */
                          /* Resultatrapport fra AS Økonomi */
             chgvar     var(&tild) value(&memb)
             call       pgm(asptostmf) +
                        parm('RE02PF    ' +
                             &memb   +
                             'PCRAPP              ' +
                             &tild   +
                             '   ')
             MONMSG     MSGID(CPF0000)

 END:        ENDPGM
