             PGM        PARM(&SYST)

/* Initiering av parametre.                                          */

             DCL        VAR(&SYST) TYPE(*CHAR) LEN(4)
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1) /* E5.01 +
                          29.9.03: IN03 er char. */
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&RRAX) TYPE(*CHAR) LEN(2)
             DCL        VAR(&RRAP) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&RPEX) TYPE(*CHAR) LEN(2)
             DCL        VAR(&RPER) TYPE(*DEC)  LEN(2 0)

/* Call av parameterprogram                                          */

             CALL       PGM(RE620R) PARM(&SYST &IN03) /* E5.01 Lagt +
                          inn param. SYST 29.9.03 HFL */

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Varselbilde 1                                                     */

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Klargjøring for PC  *****')
             CHGVAR     VAR(&MLD2) VALUE('Rapport-register    *****')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

             RTVDTAARA  DTAARA(*LDA (355 2))  RTNVAR(&RPEX)
             CHGVAR     VAR(&RPER) VALUE(&RPEX)

             RTVDTAARA  DTAARA(*LDA (365 2))  RTNVAR(&RRAX)
             CHGVAR     VAR(&RRAP) VALUE(&RRAX)

/* Varselbilde 2                                                     */

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')
             CHGVAR     VAR(&MLD2) VALUE('Beregning pågår..........')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

             CALL       PGM(RR109R) PARM(&RRAP &RPER)

/* Call av utskriftsprogram                                          */

             IF         COND(&SYST *EQ 'PC  ') THEN(DO)
             CALL       PGM(RE621C)
             ENDDO

             IF         COND(&SYST *EQ 'AKEL') THEN(DO)
             CALL       PGM(RE623C)
             ENDDO

 ENDPGM:     ENDPGM
