             PGM

/* Initiering av parametere                                          */

             DCL        VAR(&KODE) TYPE(*CHAR) LEN(01)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)

/* Sjekk om bruker finnes                                            */

             CALL       PGM(RE633R) PARM(&KODE &USER)
             IF         COND(&KODE *EQ '1') THEN(GOTO CMDLBL(ENDPGM))

/* Legger opp jobb                                                   */

             RMVJOBSCDE JOB(MULTIKONTO) ENTRYNBR(*ALL)
             MONMSG     MSGID(CPF1645)
             ADDJOBSCDE JOB(MULTIKONTO) CMD(CALL PGM(*LIBL/RE634C) +
                          PARM(&USER)) FRQ(*WEEKLY) SCDDATE(*NONE) +
                          SCDDAY(*ALL) SCDTIME(060000)

 ENDPGM:     ENDPGM
