             PGM

/* Initiering av parametere                                          */

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(03)
             DCL        VAR(&LIBL) TYPE(*CHAR) LEN(09) +
                          VALUE('MLTARCXXX')

             RTVDTAARA  DTAARA(*LDA (931 03)) RTNVAR(&FGRP)
             CHGVAR     VAR(%SST(&LIBL 7 3)) VALUE(&FGRP)

             ADDLIBLE   LIB(&LIBL) POSITION(*LAST)
             MONMSG     MSGID(CPF2103)

             CALL       PGM(RE636R)

             ENDPGM
