             PGM
             DCL        VAR(&MODU)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&DISP)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&STAT)     TYPE(*CHAR) LEN(1)

/* Sjekker om gyldig tilgang                                         */

             CHGVAR     VAR(&MODU)     VALUE('MSN_MENU  ')
             CHGVAR     VAR(&DISP)     VALUE('1')
             CALL       PGM(AX700R)    PARM(&MODU &DISP &STAT)
             IF         COND(&STAT *EQ '1') THEN(DO)
             GOTO CMDLBL(ENDPGM)
             ENDDO

/* Kall opp program for menysystem Multisupport                      */

             CALL       PGM(MSNASP/MENUSTART)

 ENDPGM:     ENDPGM
