 STRPGM:     PGM        PARM(&FIRM &RAAR &BILN)

/* Definering av parametere                                          */

             DCL        VAR(&FIRM) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&RAAR) TYPE(*DEC) LEN(4 0)
/*6.NU*/     DCL        VAR(&BILN) TYPE(*DEC) LEN(8 0)
             DCL        VAR(&PRTF) TYPE(*CHAR) LEN(10) VALUE(RF011P)

             DCL        VAR(&IN03) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

/* Program for utskriftsparametre.                                   */

             CALL       PGM(AP600R) PARM('RF011' '0' '0' &IN03 &BTCH)

/* Oppkall av utskriftsparametre.                                    */

             CALL       PGM(AP601C) PARM(&PRTF &BTCH)

/* Program for utskrift av etikett                                   */

             CALL       PGM(RF011R) PARM(&FIRM &RAAR &BILN)
             CALL       PGM(AP606C) PARM(&PRTF)

             ENDPGM
