             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&WPFIRM) TYPE(*DEC) LEN(3 0) VALUE(999)
             DCL        VAR(&WPSYST) TYPE(*CHAR) LEN(1) VALUE('H')
             DCL        VAR(&WPPROS) TYPE(*DEC) LEN(6 0) VALUE(000000)
             DCL        VAR(&WPAKTI) TYPE(*CHAR) LEN(3) VALUE('   ')
             DCL        VAR(&WPF001) TYPE(*CHAR) LEN(3) VALUE('   ')
             DCL        VAR(&WPKONT) TYPE(*DEC) LEN(6 0) VALUE(888888)
             DCL        VAR(&WPSPES) TYPE(*DEC) LEN(2 0) VALUE(77)
             DCL        VAR(&WPAVDE) TYPE(*DEC) LEN(4 0) VALUE(6666)

             CALL       PGM(RF020R) PARM(&WPFIRM &WPSYST &WPPROS +
                          &WPAKTI &WPF001 &WPKONT &WPSPES &WPAVDE)

 END:        ENDPGM
