             PGM        PARM(&MEMB &FEIL &TELL)

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&MEMB)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FEIL)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&TELL)  TYPE(*DEC)  LEN(7 0)
             DCL        VAR(&STAT)  TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&JKEY)  TYPE(*CHAR) LEN(41)
             DCL        VAR(&JSTA)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&JMLD)  TYPE(*CHAR) LEN(200)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RF104 ' '0' '0' &IN03 &BTCH)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('RF104P' &BTCH)

/* Utskrift                                                          */


/* Legger inn status = 0 som sier at dette kjøres fra Nexstep        */
             chgvar     var(&stat)  value(0)

             CALL       PGM(RF104R) PARM(&MEMB &FEIL &TELL &jkey &stat)

             CALL       PGM(AP606C)    PARM('RF104P')

 END:        ENDPGM
