             PGM        PARM(&MEMB)

             DCL        VAR(&MEMB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FIRM)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&MLD3)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&MLD4)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&SVAR)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN12)     TYPE(*DEC)  LEN(1 0)

/* Varselbilde med bekreftelse på om jobb skal settes i gang         */

             CHGVAR     VAR(&MLD3) VALUE('Ønsker du å slette alle +
                          posteringer til regnskap?')

             CHGVAR     VAR(&MLD4) +
                        VALUE('Bekreft at dette ønskes...')

             CALL       PGM(AA007R)    PARM(&MLD3 &MLD4 &SVAR &IN12)

             IF         COND(&IN12 *EQ 1) THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             IF         COND(&SVAR *EQ ' ' *OR &SVAR *EQ 'J') +
                          THEN(GOTO CMDLBL(VIDERE))
             ELSE       CMD(GOTO CMDLBL(ENDPGM))

VIDERE:


             RTVDTAARA  DTAARA(*LDA (944 3))  RTNVAR(&FIRM)
             CHGVAR     VAR(%SST(&MEMB 5 3)) VALUE(&FIRM)

/* Fjerner membere dersom de finnes                                  */
             CALL       PGM(RF703R) PARM(&MEMB)  /* RTRALU */

             CALL       PGM(RF704R) PARM(&MEMB)  /* RBUNLU */

 ENDPGM:     ENDPGM
