             PGM        PARM(&MEMB)

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&MEMB)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FEIL)  TYPE(*CHAR) LEN(1)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RF115 ' '0' '0' &IN03 &BTCH)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('RF115P' &BTCH)

/* Utskrift                                                          */

             CALL       PGM(RF115R) PARM(&MEMB)

             CALL       PGM(AP606C)    PARM('RF115P')

 END:        ENDPGM
