             PGM

             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)

             CALL       PGM(RF1TRANS) PARM(SHOP)

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Overføring fra butikk')
             CHGVAR     VAR(&MLD2) VALUE('Ferdig')
             CALL       PGM(AA011C)  PARM(&WALI &WAPO &MLD1 &MLD2)


/* Slutt                                                             */
 ENDPGM:     ENDPGM

