             PGM

             DCL        VAR(&MODU)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&DISP)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&STAT)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&jsta)     TYPE(*dec)  LEN(1 0) value(0)
             DCL        VAR(&jkey)     TYPE(*CHAR) LEN(41)  value(' ')
             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)

             CHGVAR     VAR(&MODU)     VALUE(CMP)
             CHGVAR     VAR(&DISP)     VALUE(1)
             CHGVAR     VAR(&STAT)     VALUE(0)
             CALL       PGM(AX700R) PARM(&MODU &DISP &STAT)
             IF         COND(&STAT *EQ '1') THEN(DO)
                GOTO       CMDLBL(ENDPGM)
             ENDDO
             CALL       PGM(RF1TCOMP) PARM('COMP' &jkey &jsta)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Overføre poster fra Compello')
             CHGVAR     VAR(&MLD2) VALUE('Ferdig')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             GOTO       CMDLBL(ENDPGM)

/* Slutt                                                             */
 ENDPGM:     ENDPGM

