             PGM        PARM(&TFGR &TFIRX)
/*                                                                   */
             DCL        VAR(&TFGR)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&TFIRX)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&TFIR)   TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&FGRP)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRM)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&BIBL)   TYPE(*CHAR) LEN(06) VALUE('ADB   ')
             DCL        VAR(&MLD3)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&MLD4)   TYPE(*CHAR) LEN(50)
             DCL        VAR(&SVAR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN12)   TYPE(*DEC)  LEN(1 0)
/*                                                                   */
             CHGVAR     VAR(%SST(&BIBL 4 3)) VALUE(&TFGR)
             CHGVAR     VAR(&TFIR) VALUE(&TFIRX)

/* Hente inn filgruppe / firma fra LDA                               */

             RTVDTAARA  DTAARA(*LDA (931 03)) RTNVAR(&FGRP)
             RTVDTAARA  DTAARA(*LDA (944 03)) RTNVAR(&FIRM)

/*           Overstyrer til-fil til til-bibliotek                    */

             OVRDBF     FILE(RAA1LU) TOFILE(&BIBL/RAA1LU)
             OVRDBF     FILE(RAA2LU) TOFILE(&BIBL/RAA2LU)
             OVRDBF     FILE(RAA3LU) TOFILE(&BIBL/RAA3LU)
             OVRDBF     FILE(RAA4LU) TOFILE(&BIBL/RAA4LU)
             OVRDBF     FILE(RAA5LU) TOFILE(&BIBL/RAA5LU)
             OVRDBF     FILE(RAA6LU) TOFILE(&BIBL/RAA6LU)
             OVRDBF     FILE(RAA7LU) TOFILE(&BIBL/RAA7LU)
             OVRDBF     FILE(RAA8LU) TOFILE(&BIBL/RAA8LU)
/*                                                                   */
             OVRDBF     FILE(RA01LU) TOFILE(&BIBL/RA01LU)
             OVRDBF     FILE(RA02LU) TOFILE(&BIBL/RA02LU)
             OVRDBF     FILE(RA03LU) TOFILE(&BIBL/RA03LU)
             OVRDBF     FILE(RA04LU) TOFILE(&BIBL/RA04LU)
             OVRDBF     FILE(RA05LU) TOFILE(&BIBL/RA05LU)
             OVRDBF     FILE(RA06LU) TOFILE(&BIBL/RA06LU)
             OVRDBF     FILE(RA07LU) TOFILE(&BIBL/RA07LU)
             OVRDBF     FILE(RA08LU) TOFILE(&BIBL/RA08LU)
             OVRDBF     FILE(RA09LU) TOFILE(&BIBL/RA09LU)
             OVRDBF     FILE(RA10LU) TOFILE(&BIBL/RA10LU)
             OVRDBF     FILE(RA11LU) TOFILE(&BIBL/RA11LU)
             OVRDBF     FILE(RA12LU) TOFILE(&BIBL/RA12LU)
             OVRDBF     FILE(RA13LU) TOFILE(&BIBL/RA13LU)
             OVRDBF     FILE(RA14LU) TOFILE(&BIBL/RA14LU)
             OVRDBF     FILE(RA15LU) TOFILE(&BIBL/RA15LU)
             OVRDBF     FILE(RA16LU) TOFILE(&BIBL/RA16LU)
             OVRDBF     FILE(RA17LU) TOFILE(&BIBL/RA17LU)
             OVRDBF     FILE(RA18LU) TOFILE(&BIBL/RA18LU)
             OVRDBF     FILE(RA19LU) TOFILE(&BIBL/RA19LU)
             OVRDBF     FILE(RA20LU) TOFILE(&BIBL/RA20LU)
             OVRDBF     FILE(RA21LU) TOFILE(&BIBL/RA21LU)
             OVRDBF     FILE(RA22LU) TOFILE(&BIBL/RA22LU)
             OVRDBF     FILE(RA23LU) TOFILE(&BIBL/RA23LU)
             OVRDBF     FILE(RA24LU) TOFILE(&BIBL/RA24LU)
             OVRDBF     FILE(RA25LU) TOFILE(&BIBL/RA25LU)
             OVRDBF     FILE(RA26LU) TOFILE(&BIBL/RA26LU)
             OVRDBF     FILE(RA27LU) TOFILE(&BIBL/RA27LU)
             OVRDBF     FILE(RA28LU) TOFILE(&BIBL/RA28LU)
             OVRDBF     FILE(RA70LU) TOFILE(&BIBL/RA70LU)
/*                                                                   */
             CALL       PGM(RF405R) PARM(&TFIR)
/*                                                                   */
             OVRDBF     FILE(RHOVLU) TOFILE(&BIBL/RHOVLU)
             OVRDBF     FILE(RHSALU) TOFILE(&BIBL/RHSALU)
             OVRDBF     FILE(RHTRLU) TOFILE(&BIBL/RHTRLU)
             OVRDBF     FILE(RZUMLU) TOFILE(&BIBL/RZUMLU)
             OVRDBF     FILE(RFOBLU) TOFILE(&BIBL/RFOBLU)
             OVRDBF     FILE(RFORLU) TOFILE(&BIBL/RFORLU)
             OVRDBF     FILE(RFOSLU) TOFILE(&BIBL/RFOSLU)
/*                                                                   */
             OVRDBF     FILE(RKUNLU) TOFILE(&BIBL/RKUNLU)
             OVRDBF     FILE(RKTRLU) TOFILE(&BIBL/RKTRLU)
             OVRDBF     FILE(RKSOLU) TOFILE(&BIBL/RKSOLU)
             OVRDBF     FILE(RKSALU) TOFILE(&BIBL/RKSALU)
/*                                                                   */
             OVRDBF     FILE(RLEVLU) TOFILE(&BIBL/RLEVLU)
             OVRDBF     FILE(RLTRLU) TOFILE(&BIBL/RLTRLU)
             OVRDBF     FILE(RLSOLU) TOFILE(&BIBL/RLSOLU)
             OVRDBF     FILE(RLBALU) TOFILE(&BIBL/RLBALU)
/*                                                                   */
             OVRDBF     FILE(RPROLU) TOFILE(&BIBL/RPROLU)
             OVRDBF     FILE(RPSALU) TOFILE(&BIBL/RPSALU)
             OVRDBF     FILE(RPTRLU) TOFILE(&BIBL/RPTRLU)
             OVRDBF     FILE(RPRHLU) TOFILE(&BIBL/RPRHLU)
             OVRDBF     FILE(RPRLLU) TOFILE(&BIBL/RPRLLU)
             OVRDBF     FILE(RPRXLU) TOFILE(&BIBL/RPRXLU)
/*                                                                   */
             OVRDBF     FILE(RKLALU) TOFILE(&BIBL/RKLALU)
/*                                                                   */
             OVRDBF     FILE(RRF0LU) TOFILE(&BIBL/RRF0LU)
             OVRDBF     FILE(RRF5LU) TOFILE(&BIBL/RRF5LU)
             OVRDBF     FILE(RRF8LU) TOFILE(&BIBL/RRF8LU)
             OVRDBF     FILE(RRF9LU) TOFILE(&BIBL/RRF9LU)
             OVRDBF     FILE(RCA0LU) TOFILE(&BIBL/RCA0LU)
             OVRDBF     FILE(RCNFLU) TOFILE(&BIBL/RCNFLU)
/*                                                                   */
             CALL       PGM(RF406R) PARM(&TFIR)
/*                                                                   */
 ENDPGM:     ENDPGM
