             PGM        PARM(&FGRP &FIRM)

             DCL        VAR(&VALG) TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&JOBB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FBIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TFIR) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&TBIB) TYPE(*CHAR) LEN(06) VALUE('ADB   '  )
             DCL        VAR(&SW12) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK) TYPE(*CHAR) LEN(2)
             DCL        VAR(&WIN03) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&WIN12) TYPE(*DEC)  LEN(1 0)

             CHGVAR     VAR(%SST(&TBIB 4 3)) VALUE(&FGRP)
             CHGVAR     VAR(&TFIR) VALUE(&FIRM)

/* Oppdaterer LDA med programnavn og kode for om formularparametre   */
/* skal endres.                                                      */

             CHGDTAARA  DTAARA(*LDA (844 1))  VALUE(&VALG)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&LEVL) VALUE('40')
             CHGVAR     VAR(&OKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&LEVL &OKOK)
             IF         COND(&OKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Hente inn fra LDA                                                 */

             RTVDTAARA  DTAARA(*LDA (934 10)) RTNVAR(&FBIB)
             RTVDTAARA  DTAARA(*LDA (984 1))  RTNVAR(&SW12)

/*  Vedlikekold m/kopiering av koder                                 */

             OVRDBF     FILE(AFIRL1) TOFILE(&TBIB/AFIRL1)
             OVRDBF     FILE(RA01LU) TOFILE(&TBIB/RA01LU)
             OVRDBF     FILE(RA02LU) TOFILE(&TBIB/RA02LU)
             OVRDBF     FILE(RA03LU) TOFILE(&TBIB/RA03LU)
             OVRDBF     FILE(RA04LU) TOFILE(&TBIB/RA04LU)
             OVRDBF     FILE(RA05LU) TOFILE(&TBIB/RA05LU)
             OVRDBF     FILE(RA06LU) TOFILE(&TBIB/RA06LU)
             OVRDBF     FILE(RA07LU) TOFILE(&TBIB/RA07LU)
             OVRDBF     FILE(RA08LU) TOFILE(&TBIB/RA08LU)
             OVRDBF     FILE(RA09LU) TOFILE(&TBIB/RA09LU)
             OVRDBF     FILE(RA10LU) TOFILE(&TBIB/RA10LU)
             OVRDBF     FILE(RA11LU) TOFILE(&TBIB/RA11LU)
             OVRDBF     FILE(RA12LU) TOFILE(&TBIB/RA12LU)
             OVRDBF     FILE(RA13LU) TOFILE(&TBIB/RA13LU)
             OVRDBF     FILE(RA14LU) TOFILE(&TBIB/RA14LU)
             OVRDBF     FILE(RA15LU) TOFILE(&TBIB/RA15LU)
             OVRDBF     FILE(RA16LU) TOFILE(&TBIB/RA16LU)
             OVRDBF     FILE(RA17LU) TOFILE(&TBIB/RA17LU)
             OVRDBF     FILE(RA18LU) TOFILE(&TBIB/RA18LU)
             OVRDBF     FILE(RA19LU) TOFILE(&TBIB/RA19LU)
             OVRDBF     FILE(RA20LU) TOFILE(&TBIB/RA20LU)
             OVRDBF     FILE(RA21LU) TOFILE(&TBIB/RA21LU)
             OVRDBF     FILE(RA22LU) TOFILE(&TBIB/RA22LU)
             OVRDBF     FILE(RA23LU) TOFILE(&TBIB/RA23LU)
             OVRDBF     FILE(RA24LU) TOFILE(&TBIB/RA24LU)
             OVRDBF     FILE(RA25LU) TOFILE(&TBIB/RA25LU)
             OVRDBF     FILE(RA26LU) TOFILE(&TBIB/RA26LU)
             OVRDBF     FILE(RA27LU) TOFILE(&TBIB/RA27LU)
             OVRDBF     FILE(RA28LU) TOFILE(&TBIB/RA28LU)

             CALL       PGM(RF412R) PARM(&SW12 &TFIR)

 ENDPGM:     ENDPGM
