/*                                                                   */
             pgm        parm(&firm &kidi &bilk)
/*-----------------------------------------------------------  */
/* 260117 bof :  Sjekker om depositum kan oppdateres           */
/*-----------------------------------------------------------  */

             dcl        var(&firm)   TYPE(*DEC)  LEN(3 0)
             dcl        var(&kidi)   TYPE(*char) LEN(25)
             dcl        var(&bilk)   TYPE(*dec)  LEN(2 0)


/* Test om arbeidsfiler finnes                                     */

             CHKOBJ     OBJ(*LIBL/SDEPPF) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
                GOTO       CMDLBL(endpgm)
             ENDDO


/* Sjekker om det finnes depositum og gir bilagskode */

             CALL       PGM(fo755r) parm(&firm &kidi &bilk)

 ENDPGM:     ENDPGM
