/*                                                                   */
             pgm        parm(&firm &kidi &belo &bilk)
/*-----------------------------------------------------------  */
/* 260117 bof :  Sjekker om depositum kan oppdateres           */
/*-----------------------------------------------------------  */

             dcl        var(&firm)   TYPE(*DEC)  LEN(3 0)
             dcl        var(&belo)   TYPE(*DEC)  LEN(11 2)
             dcl        var(&kidi)   TYPE(*char) LEN(25)
             dcl        var(&bilk)   TYPE(*dec)  LEN(2 0)


/* Test om arbeidsfiler finnes                                     */

             CHKOBJ     OBJ(*LIBL/SDEPPF) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
                GOTO       CMDLBL(endpgm)
             ENDDO


/* Danner postering fra ILTRPF                                      */

             CALL       PGM(fo754r) parm(&firm &kidi &belo &bilk)

 ENDPGM:     ENDPGM
