             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&KTYP) TYPE(*DEC)  LEN(2 0)

/* Hent inn filnavn og systemkode                                 */
             CALL       PGM(RF810R) PARM(&KTYP &IN03)

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO


 ENDPGM:     ENDPGM
