             PGM        PARM(&FILE &FLDR &FEIL)

/* Initiering av parametre.                                          */

             DCL        VAR(&FILE) TYPE(*CHAR) LEN(12)
             DCL        VAR(&FLDR) TYPE(*CHAR) LEN(20)
             DCL        VAR(&FEIL) TYPE(*CHAR) LEN(1)

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(FEIL))

/* Initierer feil-flagg                                              */

             CHGVAR     VAR(&FEIL) VALUE('0')

/* Tømmer fil                                                        */

/*           CLRPFM     FILE(SONOPF)                                 */
             CLRPFM     FILE(GEMONBPF)

/* Kopierer innhold til PC-fil i mappe                               */

/*           CPYTOPCD   FROMFILE(SONOPF) TOFLR(&FLDR) TODOC(&FILE) + */
/*                        REPLACE(*YES)                              */

             GOTO       CMDLBL(END)

 FEIL:       CHGVAR     VAR(&FEIL) VALUE('1')

 END:        ENDPGM
