             PGM        PARM(&BMID &STAT)

/* Initiering av parametre.                                          */

             DCL        VAR(&BMID)  TYPE(*CHAR) LEN(15)
             DCL        VAR(&OVRF) TYPE(*CHAR) LEN(10) +
                          VALUE('LOGDNBKORT')
             DCL        VAR(&FILN)  TYPE(*CHAR) LEN(30)
             DCL        VAR(&PRFX)  TYPE(*CHAR) LEN(28)
             DCL        VAR(&STAT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&SMSG)  TYPE(*CHAR) LEN(1) VALUE('1')
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)

/* Flytter til member for sending med activ-sjekk                    */

/*  RNM:        RNMM       FILE(LWEDPF) MBR(&MEMBR) NEWMBR(LWEDUT)   */
/*           MONMSG     MSGID(CPF3178) EXEC(DO)                      */
/*           DLYJOB     DLY(10)                                      */
/*           GOTO       CMDLBL(RNM)                                  */
/*           ENDDO                                                   */

/* Utlegging av bestillingsfil                                       */

             CHGVAR     VAR(&WALI) VALUE(6)
             CHGVAR     VAR(&WAPO) VALUE(30)
             CHGVAR     VAR(&MLD1) VALUE('Overfører til logiq ')
             CHGVAR     VAR(&MLD2) VALUE('                 ')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

/* Sender bestilling via FTP til NBS                                 */

             CALL       PGM(RF827R) PARM(&bmid &prfx)

             CHGVAR     VAR(&filn) VALUE(&prfx *tcat ' ')

             CALL       PGM(RF850C) PARM(&OVRF &STAT &FILN &SMSG)

/* Tømmer overføringsfile for poster                                 */

             IF         COND(&STAT *EQ ' ') THEN(CHGVAR VAR(&STAT) +
                          VALUE('0'))

 END:        ENDPGM
