
/*   Felles, årsrutiner                                              */

             PGM

             DCL        VAR(&FGRP)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&BIBL)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&FIRM)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             DCL        VAR(&MLD1)     TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)     TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD3)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&MLD4)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&VALG) TYPE(*CHAR) LEN(4) VALUE('    ')
             DCL        VAR(&SVAR)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN12)     TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&WALI)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)     TYPE(*DEC)  LEN(2 0)

/* Hente inn filgruppe/ databibliotek fra LDA                        */

             RTVDTAARA  DTAARA(*LDA (931 03)) RTNVAR(&FGRP)
             RTVDTAARA  DTAARA(*LDA (934  6)) RTNVAR(&BIBL)
             RTVDTAARA  DTAARA(*LDA (944  3)) RTNVAR(&FIRM)
             RTVDTAARA  DTAARA(*LDA (951  30)) RTNVAR(&FNAV)

/* Varselbilde med bekreftelse på om jobb skal settes i gang         */

             CALL       PGM(RF926R)    PARM(&VALG &SVAR &IN12)

             IF         COND(&IN12 *EQ 1 ) +
                          THEN(GOTO CMDLBL(ENDPGM))

             IF         COND(&SVAR *EQ ' ' *OR &SVAR *EQ 'J') +
                          THEN(GOTO CMDLBL(VIDERE))
             ELSE       CMD(GOTO CMDLBL(ENDPGM))

VIDERE:


/*   START av program for oppdatering                                */
/*   ----------------------------------------                        */


/* Varselbilde 1                                                     */

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(34)
             CHGVAR     VAR(&MLD1) VALUE('Kjører årsrutine        ')
             CHGVAR     VAR(&MLD2) VALUE('**** REGNSKAP       **** ')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

/* Call av oppdateringprogram                                        */

             CALL       PGM(RK920C)
             CALL       PGM(RL920C)

 ENDPGM:     ENDPGM
