             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)

/* Varselbilde 2                                                     */

             CHGVAR     VAR(&WALI) VALUE(6)
             CHGVAR     VAR(&WAPO) VALUE(32)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')
             CHGVAR     VAR(&MLD2) VALUE('Fjerning av POSTER pågår.')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

             CALL       PGM(RF951R)

 ENDPGM:     ENDPGM
