             PGM
             DCLF       FILE(RG008D)
/*                                                                   */
             DCL        VAR(&A1VALL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&APLEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK) TYPE(*CHAR) LEN(2)
/*                                                                   */
/* Kontrollere brukertilgang                                         */
/*                                                                   */
             CHGVAR     VAR(&APLEVL) VALUE('40')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO
/*                                                                   */
/*                                                                   */
             SNDRCVF    RCDFMT(A1BLD)
/*                                                                   */
/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/*  Genererer de valgte registere                                    */
/*                                                                   */
             IF         COND(&A1VALL *EQ '1') THEN(DO)
             CALL       PGM(RGAA1C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGAA2C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGAA3C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGAA4C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGAA5C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGAA6C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGAA7C) PARM(&A1FGRP &A1NULL)
/*                                                                   */
             CALL       PGM(RGA01C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA02C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA03C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA04C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA05C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA06C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA07C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA08C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA09C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA10C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA11C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA12C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA13C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA14C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA15C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA16C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA17C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA18C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA19C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA20C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA21C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA22C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA23C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA25C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA35C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA36C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGA70C) PARM(&A1FGRP &A1NULL)
/*                                                                   */
             CALL       PGM(RGHOVC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGHSAC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGHTRC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGZUMC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGFORC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGKUNC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGKTRC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGKSAC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGLEVC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGLTRC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGLBAC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGKLAC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGPROC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGPSAC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGPTRC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGRF0C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGRF5C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGRF8C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGRF9C) PARM(&A1FGRP &A1NULL)
/*                                                                   */
             CALL       PGM(RGBUNC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGTRAC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGJOUC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGTW1C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGHW1C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGHW2C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGHW3C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGHJOC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGGIRC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGKW1C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGKW2C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGKW3C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGKWAC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGKWBC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGLW1C) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGPARC) PARM(&A1FGRP &A1NULL)
/*                                                                   */
             ENDDO
/*                                                                   */
 ENDPGM:     ENDPGM
