/* 6.10 190112 Lagt inn 2 nye filer for Java                    NHO  */
             PGM

             DCLF       FILE(RG004D)

             DCL        VAR(&A1VBUN) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VTRA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VJOU) TYPE(*CHAR) LEN(1)
 /*6.10*/
             DCL        VAR(&A1VTRX) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VTRZ) TYPE(*CHAR) LEN(1)
 /*6.10*/
             DCL        VAR(&A1VHWA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VHW1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VHW2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VHJO) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VTOT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKW1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKW2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKW4) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKW5) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKWA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKWB) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKWC) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKWD) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VLW1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&APLEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK) TYPE(*CHAR) LEN(2)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&APLEVL) VALUE('40')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             SNDRCVF    RCDFMT(A1BLD)

/* F3 + F12                                                          */

             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/*  Registreringsfiler - bunt                                        */

             IF         COND(&A1VBUN *EQ '1') THEN(DO)
             CALL       PGM(RGBUNC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Registeringsviler - trans                                        */

             IF         COND(&A1VTRA *EQ '1') THEN(DO)
             CALL       PGM(RGTRAC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Journalfile                                                      */

             IF         COND(&A1VJOU *EQ '1') THEN(DO)
             CALL       PGM(RGJOUC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* 6.10 feil kontrolliste/Java                                       */

             IF         COND(&A1VTRX *EQ '1') THEN(DO)
             CALL       PGM(RGTRXC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* 6.10 feil journalliste/Java                                       */

             IF         COND(&A1VTRZ *EQ '1') THEN(DO)
             CALL       PGM(RGTRZC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil - hovedbok                                            */

             IF         COND(&A1VHWA *EQ '1') THEN(DO)
             CALL       PGM(RGHWAC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil - spesifisert hovedbok                                */

             IF         COND(&A1VHW1 *EQ '1') THEN(DO)
             CALL       PGM(RGHW1C) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil - hovedbok revisjonsjournal                           */

             IF         COND(&A1VHW2 *EQ '1') THEN(DO)
             CALL       PGM(RGHW2C) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil - hovedbok revisjonsjournal                           */

             IF         COND(&A1VHJO *EQ '1') THEN(DO)
             CALL       PGM(RGHJOC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil - hovedbok total kontoplan                            */

             IF         COND(&A1VTOT *EQ '1') THEN(DO)
             CALL       PGM(RGTOTC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil kundereskontro                                        */

             IF         COND(&A1VKW1 *EQ '1') THEN(DO)
             CALL       PGM(RGKW1C) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil kundereskontro                                        */

             IF         COND(&A1VKW2 *EQ '1') THEN(DO)
             CALL       PGM(RGKW2C) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil kundereskontro                                        */

             IF         COND(&A1VKW4 *EQ '1') THEN(DO)
             CALL       PGM(RGKW4C) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil kundereskontro                                        */

             IF         COND(&A1VKW5 *EQ '1') THEN(DO)
             CALL       PGM(RGKW5C) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil kundereskontro                                        */

             IF         COND(&A1VKWA *EQ '1') THEN(DO)
             CALL       PGM(RGKWAC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil kundereskontro                                        */

             IF         COND(&A1VKWB *EQ '1') THEN(DO)
             CALL       PGM(RGKWBC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil kundereskontro                                        */

             IF         COND(&A1VKWC *EQ '1') THEN(DO)
             CALL       PGM(RGKWCC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil kundereskontro                                        */

             IF         COND(&A1VKWD *EQ '1') THEN(DO)
             CALL       PGM(RGKWDC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil leverandørreskontro                                   */

             IF         COND(&A1VLW1 *EQ '1') THEN(DO)
             CALL       PGM(RGLW1C) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil notatark reorganisering                               */

             IF         COND(&A1VKLW *EQ '1') THEN(DO)
             CALL       PGM(RGKLWC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Arbeidsfil bankgiroutskrift                                      */

             IF         COND(&A1VGIR *EQ '1') THEN(DO)
             CALL       PGM(RGGIRC) PARM(&A1FGRP &A1NULL)
             ENDDO

 ENDPGM:     ENDPGM
