/* 6.13 R6.13 200803 NHO  Ny fil  i forb.med sporingsref og avkr.ref.*/
/* 6.14 R6.14 040511 NHO  Ny fil  i forb.med sperreing av jobb       */
/* 6.20 R6.20 070611 bof  Ny fil  kunde memosaldo                    */
/* 6.33 R6.20 160512 NHO  Ny fil  avkr.ref for rente og spørringer   */
/* 7.01  7.00 270120 bof  Ny indeks på RLEVPF                        */
/* 7.02  7.00 180220 bof  Hente gruppeprofil for bruk AG906C       */
/**/
             PGM

             DCLF       FILE(RG003D)

             DCL        VAR(&A1VHOV) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VHSA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VHTR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VZUM) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VFOR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKUN) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKSA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKSO) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKTR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VLEV) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VLTR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VLBA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VLSO) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VKLA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VPRO) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VPSA) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VPTR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VPRH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VPRL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VPRX) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VRF0) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VRF5) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VRF8) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VRF9) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VUKP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VUKR) TYPE(*CHAR) LEN(1)
/*6.13*/     DCL        VAR(&A1SPOR) TYPE(*CHAR) LEN(1)
/*6.14*/     DCL        VAR(&A1JOBF) TYPE(*CHAR) LEN(1)
/*6.20*/     DCL        VAR(&A1KMEM) TYPE(*CHAR) LEN(1)
/*6.33*/     DCL        VAR(&A1AVKR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&APLEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK) TYPE(*CHAR) LEN(2)
             DCL        VAR(&GRPPRF) TYPE(*CHAR) LEN(10)  /*7.02*/

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&APLEVL) VALUE('40')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             SNDRCVF    RCDFMT(A1BLD)

/* F3 + F12                                                          */

             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* henter gruppeprofil  7.02 */
             RTVUSRPRF  GRPPRF(&GRPPRF)
/* Hovedbok kontoplan                                                */

             IF         COND(&A1VHOV *EQ '1') THEN(DO)
             CALL       PGM(RGHOVC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Hovedbok saldo                                                    */

             IF         COND(&A1VHSA *EQ '1') THEN(DO)
             CALL       PGM(RGHSAC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Hovedbok posteringer                                              */

             IF         COND(&A1VHTR *EQ '1') THEN(DO)
             CALL       PGM(RGHTRC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Hovedbok sumposter                                                */

             IF         COND(&A1VZUM *EQ '1') THEN(DO)
             CALL       PGM(RGZUMC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Kunder                                                            */

             IF         COND(&A1VKUN *EQ '1') THEN(DO)
             CALL       PGM(RGKUNC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Kunder spesialavtale                                              */

             IF         COND(&A1VKSA *EQ '1') THEN(DO)
             CALL       PGM(RGKSAC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Kunder søketekst                                                  */

             IF         COND(&A1VKSO *EQ '1') THEN(DO)
             CALL       PGM(RGKSOC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Kunder posteringer                                                */

             IF         COND(&A1VKTR *EQ '1') THEN(DO)
             CALL       PGM(RGKTRC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Leverandører                                                      */

             IF         COND(&A1VLEV *EQ '1') THEN(DO)
                CALL       PGM(AG906C) PARM('RLEVPF' &A1FGRP &GRPPRF +
                             &A1NULL) /*7.02*/
             ENDDO

/* Leverandører posteringer                                          */

             IF         COND(&A1VLTR *EQ '1') THEN(DO)
             CALL       PGM(RGLTRC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Leverandør bankinformasjon                                        */

             IF         COND(&A1VLBA *EQ '1') THEN(DO)
             CALL       PGM(RGLBAC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Leverandør søketekst                                              */

             IF         COND(&A1VLSO *EQ '1') THEN(DO)
             CALL       PGM(RGLSOC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Fordelings-parametre                                             */

             IF         COND(&A1VFOR *EQ '1') THEN(DO)
             CALL       PGM(RGFORC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGFOBC) PARM(&A1FGRP &A1NULL)
             CALL       PGM(RGFOSC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Kladdeblokk                                                      */

             IF         COND(&A1VKLA *EQ '1') THEN(DO)
             CALL       PGM(RGKLAC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Prosjekt                                                         */

             IF         COND(&A1VPRO *EQ '1') THEN(DO)
             CALL       PGM(RGPROC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Prosjekt - Saldomatrise                                          */

             IF         COND(&A1VPSA *EQ '1') THEN(DO)
             CALL       PGM(RGPSAC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Prosjekt - Poster                                                */

             IF         COND(&A1VPTR *EQ '1') THEN(DO)
             CALL       PGM(RGPTRC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Prosjekt - Malheader                                             */

             IF         COND(&A1VPRH *EQ '1') THEN(DO)
             CALL       PGM(RGPRHC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Prosjekt - Mallinjer                                             */

             IF         COND(&A1VPRL *EQ '1') THEN(DO)
             CALL       PGM(RGPRLC) PARM(&A1FGRP &A1NULL)
             ENDDO

/*  Prosjekt - Malakkumulator-register                               */

             IF         COND(&A1VPRX *EQ '1') THEN(DO)
             CALL       PGM(RGPRXC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Resultatrapporter heading                                         */

             IF         COND(&A1VRF0 *EQ '1') THEN(DO)
             CALL       PGM(RGRF0C) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Resultatrapporter linjer                                          */

             IF         COND(&A1VRF5 *EQ '1') THEN(DO)
             CALL       PGM(RGRF5C) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Resultatrapporter fra-til                                         */

             IF         COND(&A1VRF8 *EQ '1') THEN(DO)
             CALL       PGM(RGRF8C) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Resultatrapporter summer                                          */

             IF         COND(&A1VRF9 *EQ '1') THEN(DO)
             CALL       PGM(RGRF9C) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Kontaktpersonregister                                             */

             IF         COND(&A1VUKP *EQ '1') THEN(DO)
             CALL       PGM(RGUKPC) PARM(&A1FGRP &A1NULL)
             ENDDO

/* Kortregister                                                      */

             IF         COND(&A1VUKR *EQ '1') THEN(DO)
             CALL       PGM(RGUKRC) PARM(&A1FGRP &A1NULL)
             ENDDO
/* Sporingsregferanse register                                       */

/*6.13*/     IF         COND(&A1SPOR *EQ '1') THEN(DO)
/*6.13*/     CALL       PGM(RGSPOC) PARM(&A1FGRP &A1NULL)
/*6.13*/     ENDDO

/* Sperre/jobb register                                              */

/*6.14*/     IF         COND(&A1JOBF *EQ '1') THEN(DO)
/*6.13*/     CALL       PGM(RGJOBC) PARM(&A1FGRP &A1NULL)
/*6.13*/     ENDDO

/* Kunde memosaldo                                                   */

/*6.20*/     IF         COND(&A1KMEM  *EQ '1') THEN(DO)
/*6.20*/     CALL       PGM(RGKMEC) PARM(&A1FGRP &A1NULL)
/*6.20*/     ENDDO

/* Avkr.ref for renter og spørringer                                 */

/*6.33*/     IF         COND(&A1AVKR *EQ '1') THEN(DO)
/*6.33*/     CALL       PGM(RGAVKC) PARM(&A1FGRP &A1NULL)
/*6.33*/     ENDDO


 ENDPGM:     ENDPGM
