             PGM

             DCLF       FILE(RG016D)

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(6) VALUE('ADBnnn')

             DCL        VAR(&VDOH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VDOL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VDPR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VDRH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VDUT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VEDD) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VEDU) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VREC) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VREF) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VREH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VRER) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VRES) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VSCL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VSCR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VSLS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VSQC) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VSQT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VSQW) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VSQY) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VSRR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VSIM) TYPE(*CHAR) LEN(1)

             DCL        VAR(&CLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&LEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK) TYPE(*CHAR) LEN(2)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&LEVL) VALUE('40')
             CHGVAR     VAR(&OKOK) VALUE('  ')
             CALL       PGM(AA050C) PARM(&LEVL &OKOK)
             IF         COND(&OKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Utleder foreslått filgruppe utifra current-library                */

             RTVJOBA    CURLIB(&CLIB)
             CHGVAR     VAR(&FGRP) VALUE(%SUBSTRING(&CLIB 4 3))

/* Viser skjermbilde                                                 */

             SNDRCVF    RCDFMT(A1BLD)

/* F3/F12                                                            */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Avbryter dersom filgruppe ikke er valgt                           */

             IF         COND(&FGRP *EQ '   ') THEN(GOTO CMDLBL(ENDPGM))

/* Utleder  databibliotek fra filgruppe                              */

             CHGVAR     VAR(&DLIB) VALUE(%SUBSTRING(&DLIB 1 3) *TCAT +
                          &FGRP)

/* Genererer de valgte tabellene                                     */

             IF         COND(&RP5R *EQ '1') THEN(DO)
             CALL       PGM(AG901C) PARM('RP5RST' &DLIB &NULL)
             ENDDO

             IF         COND(&ILFI *EQ '1') THEN(DO)
             CALL       PGM(AG901C) PARM('ILFIST' &DLIB &NULL)
             ENDDO

             IF         COND(&RRPD *EQ '1') THEN(DO)
             CALL       PGM(AG901C) PARM('RRPDST' &DLIB &NULL)
             ENDDO

             IF         COND(&RRPR *EQ '1') THEN(DO)
             CALL       PGM(AG901C) PARM('RRPRST' &DLIB &NULL)
             ENDDO

             IF         COND(&RRPL *EQ '1') THEN(DO)
             CALL       PGM(AG901C) PARM('RRPLST' &DLIB &NULL)
             ENDDO


 ENDPGM:     ENDPGM
