/*           Generere   Overføringsfil Regnskap                      */
/* 6.30 21.08.15  Nye filer vedr. summering av Visma Business Butikk */
/* 7.00 R7.00 120320 NHO  Lagt inn ny fil FOVIL2 pga avdeling       */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASSHOP')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('BQBWBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('BQBWPF')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('BQBWL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('BQBWL2')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG101C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGL1 &RGL2)

 ENDPGM:     ENDPGM
