
/*           Generere   BUNTFILE REGISTRERING                        */

 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)

             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('RBUNBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('RBUNPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('RBUNLU')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('RBUNL1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('RBUNL2')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG102C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1 +
                          &WPRGL2)

 ENDPGM:     ENDPGM
