
/*           Generere   POSTER-Grunnlag for oppdatering fra          */
/*                      Compello     - Preregistrering               */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB   ')
             DCL        VAR(&BBIB) TYPE(*CHAR) LEN(10) VALUE('curlib')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('rcmrBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('rcmrPF')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('rcmrL1')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('rcmrLu')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             RTVJOBA    CURLIB(&BBIB)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG101C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGL1 &rglu)

/*   Sett tilbake til opprinnelig curlib                      */
             CHGCURLIB  CURLIB(&BBIB)

 ENDPGM:     ENDPGM
