
/*           Generere UTVEKSLINGSFILE FOR SALDOBALANSE               */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('RE03BF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('RE03PF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('RE03LU')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG100C) PARM(&FGRP &NULL &DBIB &SBIB +
                          &RGBF &RGPF &RGLU)

 ENDPGM:     ENDPGM
