
/*           Generere   FORDELINGSPARAMETERE                         */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('RFORBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('RFORPF')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('RFORLR')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('RFORLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('RFORL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('RFORL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('RFORL3')
             DCL        VAR(&RGLS) TYPE(*CHAR) LEN(6) VALUE('RFOSLR')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/* NB RFOSLR er bygget over fila. Slett denne først                  */
/* Finner ikke denne brukt, så den bygges ikke på nytt               */
             DLTF       FILE(&DBIB/&RGLS)
             MONMSG     MSGID(CPF2105)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG104C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLR &RGLU +
                          &RGL1 &RGL2 &RGL3)

 ENDPGM:     ENDPGM
