
/*           Generere   ARBEIDSFILE GIROUTSKRIFT                     */

 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)

             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('RGIRBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('RGIRPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('RGIRLU')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG100C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU)

 ENDPGM:     ENDPGM
