
/*           Generere   Standard Kontoplan  SAF_T                    */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')
             DCL        VAR(&clib) TYPE(*CHAR) LEN(10)

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('RHSTBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('RHSTPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('RHSTLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('RHSTLR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('RHSTL1')

/*           Setter bibliotek til current                            */

             rtvjoba    curlib(&clib)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG102C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLU &RGLR +
                          &RGL1)
             chgcurlib  curlib(&clib)

 ENDPGM:     ENDPGM
