
/*           Generere   REGISTRERTE POSTER                           */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('RJOUBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('RJOUPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('RJOULU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('RJOUL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('RJOUL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('RJOUL3')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG103C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLU &RGL1 &RGL2 +
                          &rgl3)
 ENDPGM:     ENDPGM
