
/* 6.30      260815 nho  Lagt inn skap av ny fil RKTRLD              */
/*           Generere   KUNDER TRANSAKSJONER                         */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('RKTRBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('RKTRPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('RKTRLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('RKTRL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('RKTRL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('RKTRL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('RKTRL4')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('RKTRL5')
             DCL        VAR(&RGL6) TYPE(*CHAR) LEN(6) VALUE('RKTRL6')
             DCL        VAR(&RGL7) TYPE(*CHAR) LEN(6) VALUE('RKTRL7')
             DCL        VAR(&RGL8) TYPE(*CHAR) LEN(6) VALUE('RKTRL8')
             DCL        VAR(&RGL9) TYPE(*CHAR) LEN(6) VALUE('RKTRL9')
             DCL        VAR(&RGLA) TYPE(*CHAR) LEN(6) VALUE('RKTRLA')
             DCL        VAR(&RGLB) TYPE(*CHAR) LEN(6) VALUE('RKTRLB')
             DCL        VAR(&RGLC) TYPE(*CHAR) LEN(6) VALUE('RKTRLC')
             DCL        VAR(&RGLD) TYPE(*CHAR) LEN(6) VALUE('RKTRLD')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG113C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLU &RGL1 +
                          &RGL2 &RGL3 &RGL4 &RGL5 &RGL6 +
                          &RGL7 &RGL8 &RGL9 &RGLA &RGLB +
                          &RGLC &RGLD)

 ENDPGM:     ENDPGM
