
/*           Generere   KUNDER                                       */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('RKUNBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('RKUNPF')
             DCL        VAR(&RGLA) TYPE(*CHAR) LEN(6) VALUE('RKUNLA')
             DCL        VAR(&RGLB) TYPE(*CHAR) LEN(6) VALUE('RKUNLB')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('RKUNLR')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('RKUNLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('RKUNL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('RKUNL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('RKUNL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('RKUNL4')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('RKUNL5')
             DCL        VAR(&RGL6) TYPE(*CHAR) LEN(6) VALUE('RKUNL6')
             DCL        VAR(&RGL7) TYPE(*CHAR) LEN(6) VALUE('RKUNL7')
             DCL        VAR(&RGL8) TYPE(*CHAR) LEN(6) VALUE('RKUNL8')
             DCL        VAR(&RGL9) TYPE(*CHAR) LEN(6) VALUE('RKUNL9')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG112C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLA &RGLB &RGLR +
                          &RGLU &RGL1 &RGL2 &RGL3 &RGL4 &RGL5 +
                          &RGL6 &RGL7 &RGL8 &RGL9)

 ENDPGM:     ENDPGM
