
/*           Generere   KUNDER WORKFILE B - purring/rente            */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('RKWBBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('RKWBPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('RKWBLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('RKWBLR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('RKWBL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('RKWBL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('RKWBL3')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG104C) PARM(&FGRP &NULL &DBIB &SBIB +
                          &RGBF &RGPF &RGLU &RGLR &RGL1 &RGL2 &RGL3)

 ENDPGM:     ENDPGM
