
/*           Generere   LEVERANDØRER                                 */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('RLEVBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('RLEVPF')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('RLEVLR')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('RLEVLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('RLEVL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('RLEVL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('RLEVL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('RLEVL4')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('RLEVL5')
             DCL        VAR(&RGL6) TYPE(*CHAR) LEN(6) VALUE('RLEVL6')
             DCL        VAR(&RGL7) TYPE(*CHAR) LEN(6) VALUE('RLEVL7')
             DCL        VAR(&RGL8) TYPE(*CHAR) LEN(6) VALUE('RLEVL8')
             DCL        VAR(&RGL9) TYPE(*CHAR) LEN(6) VALUE('RLEVL9')
             DCL        VAR(&RGLA) TYPE(*CHAR) LEN(6) VALUE('RLEVLA')
             DCL        VAR(&RGLB) TYPE(*CHAR) LEN(6) VALUE('RLEVLB')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG112C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLR &RGLU +
                          &RGL1 &RGL2 &RGL3 &RGL4 &RGL5 +
                          &RGL6 &RGL7 &RGL8 &RGL9 &RGLA &RGLB)

 ENDPGM:     ENDPGM
