
/*           Generere   Søketekst leverandører                       */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('RLSOBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('RLSOPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('RLSOLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('RLSOL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('RLSOL2')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('RLSOLR')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG103C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLU &RGL1 &RGL2 +
                          &RGLR)

 ENDPGM:     ENDPGM
