
/* 6.30      260815 nho  Lagt inn skap av ny fil RLTRLG              */
/*           Generere   LEVERANDØRER TRANSAKSJONER                   */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('RLTRBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('RLTRPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('RLTRLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('RLTRL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('RLTRL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('RLTRL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('RLTRL4')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('RLTRL5')
             DCL        VAR(&RGL6) TYPE(*CHAR) LEN(6) VALUE('RLTRL6')
             DCL        VAR(&RGL7) TYPE(*CHAR) LEN(6) VALUE('RLTRL7')
             DCL        VAR(&RGL8) TYPE(*CHAR) LEN(6) VALUE('RLTRL8')
             DCL        VAR(&RGL9) TYPE(*CHAR) LEN(6) VALUE('RLTRL9')
             DCL        VAR(&RGLA) TYPE(*CHAR) LEN(6) VALUE('RLTRLA')
             DCL        VAR(&RGLB) TYPE(*CHAR) LEN(6) VALUE('RLTRLB')
             DCL        VAR(&RGLC) TYPE(*CHAR) LEN(6) VALUE('RLTRLC')
             DCL        VAR(&RGLD) TYPE(*CHAR) LEN(6) VALUE('RLTRLD')
             DCL        VAR(&RGLE) TYPE(*CHAR) LEN(6) VALUE('RLTRLE')
             DCL        VAR(&RGLF) TYPE(*CHAR) LEN(6) VALUE('RLTRLF')
             DCL        VAR(&RGLG) TYPE(*CHAR) LEN(6) VALUE('RLTRLG')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG116C) PARM(&FGRP &NULL &DBIB +
                         &SBIB &RGBF &RGPF &RGLU &RGL1 +
                         &RGL2 &RGL3 &RGL4 &RGL5 &RGL6 +
                         &RGL7 &RGL8 &RGL9 &RGLA &RGLB +
                         &RGLC &RGLD &RGLE &RGLF &RGLG)

 ENDPGM:     ENDPGM
