
/*           Generere   PROSJEKT                                     */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('rp4OBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('rp4OPF')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('rp4OLR')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('rp4OLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('rp4OL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('rp4OL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('rp4OL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('rp4OL4')
             DCL        VAR(&RGL5) TYPE(*CHAR) LEN(6) VALUE('rp4OL5')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG106C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLR &RGLU +
                          &RGL1 &RGL2 &RGL3 &RGL4 &rgl5)

 ENDPGM:     ENDPGM
