
/* 6.33 R6.20 060912 BOF  DI-SYS/Visma summert - arbeidsfil for summ*/
/*                        ering.                                    */
/* 7.00 R7.00 120320 NHO  Lagt inn ny fil BQVWL2 pga avdeling       */
/**/

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('BQVWBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('BQVWPF')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('BQVWL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('BQVWL2')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG101C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGL1 &RGL2)

 ENDPGM:     ENDPGM
