
/*           Generere   Standard Kontoplan  SAF_T                    */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')
             DCL        VAR(&clib) TYPE(*CHAR) LEN(10)

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('rat5BF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('rat5PF')

/*           Setter bibliotek til current                            */

             rtvjoba    curlib(&clib)
             CHGCURLIB  CURLIB(&DBIB)

             CHKOBJ     OBJ(&dbib/&RGBF) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(GOTO TAG002)
             DLTF       FILE(&dbib/&RGBF)

/*          Sletter indexer / Legger tilside registeret              */

 TAG002:     CHKOBJ     OBJ(&DBIB/&RGPF) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(GOTO TAG003)

             RNMOBJ     OBJ(&DBIB/&RGPF) OBJTYPE(*FILE) +
                          NEWOBJ(&RGBF)

/*           Start danning av registre                               */

/* PF:PF                                                             */

 TAG003:     CRTPF      FILE(&dbib/&RGPF) +
                          SRCFILE(*LIBL/QDDFSRC) SRCMBR(*FILE) +
                          MAXMBRS(*NOMAX) SIZE(*NOMAX) +
                          REUSEDLT(*YES)  SRTSEQ(*LANGIDUNQ) +
                          LANGID(NOR)
             MONMSG     MSGID(CPF7302)

             chgcurlib  curlib(&clib)

 ENDPGM:     ENDPGM
