
/*           Generere   REGISTRERTE POSTER                           */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(10) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(10) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(10) VALUE('rxmlBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(10) VALUE('rxmlPF')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(10) VALUE('rxmlL1')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG100C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGL1)

 ENDPGM:     ENDPGM
