
/*           Generere   KUNDE, Trigger                               */

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('slogBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('slogPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('slogLU')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('slogLR')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('slogL1')
             DCL        VAR(&RGL2) TYPE(*CHAR) LEN(6) VALUE('slogL2')
             DCL        VAR(&RGL3) TYPE(*CHAR) LEN(6) VALUE('slogL3')
             DCL        VAR(&RGL4) TYPE(*CHAR) LEN(6) VALUE('slogL4')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG105C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLU +
                          &RGLR &RGL1 &RGL2 &RGL3 +
                          &RGL4)
 ENDPGM:     ENDPGM
