
/*           Generere   STATUS 000004                                */
/* 6.13 R6.13 200803 NHO  Ny fil  i forb.med sporingsref og avkr.ref.*/
/**/

 STRPGM:     PGM        PARM(&FGRP &NULL)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&SBIB) TYPE(*CHAR) LEN(6) VALUE('ASOKON')

             DCL        VAR(&RGBF) TYPE(*CHAR) LEN(6) VALUE('DSTRBF')
             DCL        VAR(&RGPF) TYPE(*CHAR) LEN(6) VALUE('DSTRPF')
             DCL        VAR(&RGLU) TYPE(*CHAR) LEN(6) VALUE('DSTRLU')
             DCL        VAR(&RGL1) TYPE(*CHAR) LEN(6) VALUE('DSTRL1')
             DCL        VAR(&RGLR) TYPE(*CHAR) LEN(6) VALUE('DSTRLR')

/*           Setter bibliotek til current                            */

             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP)
             CHGCURLIB  CURLIB(&DBIB)

/*           Kalle opp fellesprogram                                 */

             CALL       PGM(AG102C) PARM(&FGRP &NULL &DBIB +
                          &SBIB &RGBF &RGPF &RGLU &RGL1 &RGLR)

 ENDPGM:     ENDPGM
