             PGM
             DCLF       FILE(RGU01D)

             DCL        VAR(&A1VEIE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VOMR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&APLEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK) TYPE(*CHAR) LEN(2)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&APLEVL) VALUE('40')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             SNDRCVF    RCDFMT(A1BLD)

/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/*  Genererer de valgte registere                                    */


             IF         COND(&A1VEIE *EQ '1') THEN(DO)
             CALL       PGM(RGEIEC) PARM(&A1FGRP &A1NULL)
             ENDDO

             IF         COND(&A1VOMR *EQ '1') THEN(DO)
             CALL       PGM(RGOMRC) PARM(&A1FGRP &A1NULL)
             ENDDO

 ENDPGM:     ENDPGM
