             PGM

             DCL        VAR(&FIRM)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&MEMBX)  TYPE(*CHAR) LEN(5)
             DCL        VAR(&MEMB)   TYPE(*DEC)  LEN(5 0)
             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&WMM1)  TYPE(*CHAR) LEN(10) VALUE('WBEV     ')
             DCL        VAR(&WMMA)  TYPE(*CHAR) LEN(10) VALUE('WBEV   ')

/* Henter verdier i fra LDA.                                         */

             RTVDTAARA  DTAARA(*LDA (944 03)) RTNVAR(&FIRM)

             CHGVAR     VAR(%SST(&WMM1 4 5)) VALUE(&MEMB)
             CHGVAR     VAR(%SST(&WMMA 5 3)) VALUE(&FIRM)

/* Saldooverføring                                                   */

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')
             CHGVAR     VAR(&MLD2) VALUE('FORDELINGER PÅGÅR........')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

/* Bygger membere dersom de ikke finnes                              */

/*  Poster som grunnlag til fordeling utfra fordelings-parametre     */

             CALL       PGM(RH191R) PARM(&WMM1)



/* Call av fordelings-parametre                                      */

             CALL       PGM(RH192R) PARM(&WMM1 &WMMA)


             CALL       PGM(RF704R) PARM(&WMM1)  /* RBUNLU */
             CALL       PGM(RF703R) PARM(&WMM1)  /* RTRALU */
 ENDPGM:     ENDPGM
