             PGM

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN12) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)

/* Call av parameterprogram                                          */

             CALL       PGM(RH190R) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Varselbilde 1                                                     */

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Fordeling utfra saldo    ')
             CHGVAR     VAR(&MLD2) VALUE('****    REGNSKAP     ****')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

             CALL       PGM(RH191C)

 ENDPGM:     ENDPGM
