             PGM

/* Definere parametere og variabler                                  */

             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&MEMBX)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&MEMB)     TYPE(*DEC)  LEN(5 0)
             DCL        VAR(&WALI)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)     TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)     TYPE(*CHAR) LEN(40)
             DCL        VAR(&WMM1)     TYPE(*CHAR) LEN(10) VALUE('RHA   ')

             RTVDTAARA  DTAARA(*LDA (864 5))  RTNVAR(&MEMBX)

             CHGVAR     VAR(&MEMB) VALUE(&MEMBX)
             CHGVAR     VAR(%SST(&WMM1 4 5)) VALUE(&MEMB)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('RH631P' &BTCH)

/* Varselbilde 2                                                     */
             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')
             CHGVAR     VAR(&MLD2) VALUE('Utplukk pågår ...........')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO
/*                                                                   */
/* Bygger membere dersom de ikke finnes                              */
/*                                                                   */
             CHKOBJ     OBJ(RHW1PF) OBJTYPE(*FILE) MBR(&WMM1)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(RHW1PF) MBR(&WMM1) TEXT('Poster til +
                          spes.hovedbok  (RH633R')
             ENDDO

/* Utplukking av poster                                              */

             CLRPFM     FILE(RHW1PF) MBR(&WMM1)
             MONMSG     MSGID(CPF3100)

             OVRDBF     FILE(RHW1PF) MBR(&WMM1)
             CALL       PGM(RH633R)

/* Varselbilde 2                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(6)
             CHGVAR     VAR(&WAPO) VALUE(40)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')
             CHGVAR     VAR(&MLD2) VALUE('Utskrift pågår...........')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Utskrift                                                          */

             OVRDBF     FILE(RTRHL1) TOFILE(RHW1PF) MBR(&WMM1)
             CALL       PGM(RH631R)
/*                                                                   */
             DLTOVR     FILE(RHW1PF)
             RMVM       FILE(*LIBL/RHW1PF) MBR(&WMM1)
             MONMSG     MSGID(CPF3200)

/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDMSG     MSG('ASOKON  Rutinen for utskrift av spes.+
                        hovedbok er ferdig') TOMSGQ(&WSID)
             ENDDO

             CALL       PGM(AP606C)    PARM('RH631P')
 END:        ENDPGM
