             PGM

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
/*6.30*/     DCL        VAR(&excl)     TYPE(*CHAR) LEN(1)
/*6.30*/     DCL        VAR(&skje)     TYPE(*CHAR) LEN(1)
/*6.30*/     DCL        VAR(&mail)     TYPE(*CHAR) LEN(1)

/* Call av parameterprogram                                          */

             CALL       PGM(RH632R) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RH632 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Henter opplysning om utskriften skal kjøres i batch fra LDA       */

/*6.30*/     rtvdtaara  dtaara(*lda (639 1)) rtnvar(&excl)
/*6.30*/     rtvdtaara  dtaara(*lda (640 1)) rtnvar(&mail)
/*6.30*/     rtvdtaara  dtaara(*lda (637 1)) rtnvar(&skje)

/*6.30*/     if         cond(&excl *eq '1') then(chgvar +
/*6.30*/                    var(&btch) value('0'))
/*6.30*/     if         cond(&mail *eq '1') then(chgvar +
/*6.30*/                    var(&btch) value('0'))
/*6.30*/     if         cond(&skje *eq '1') then(chgvar +
/*6.30*/                    var(&btch) value('0'))

/*6.30*/     strpco     pcta(*no)
/*6.30*/     monmsg msgid(iws4010)

/* Utskrift                                                          */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(RH633C)) JOB(LIST_HOVBK) MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/RH633C))

 END:        ENDPGM
