             PGM

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&MEMBX)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&MEMB)     TYPE(*DEC)  LEN(5 0)
             DCL        VAR(&WMM1)     TYPE(*CHAR) LEN(10) VALUE('RHA   ')
/*6.30*/     DCL        VAR(&excl)     TYPE(*CHAR) LEN(1)
/*6.30*/     DCL        VAR(&skje)     TYPE(*CHAR) LEN(1)
/*6.30*/     DCL        VAR(&mail)     TYPE(*CHAR) LEN(1)

/* Call av parameterprogram                                          */

             CALL       PGM(RH630R) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RH631 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

             RTVDTAARA  DTAARA(*LDA (864 5))  RTNVAR(&MEMBX)

             CHGVAR     VAR(&MEMB) VALUE(&MEMBX)
             CHGVAR     VAR(%SST(&WMM1 4 5)) VALUE(&MEMB)

/* Henter opplysning om utskriften skal kjøres i batch fra LDA       */

/*6.30*/     rtvdtaara  dtaara(*lda (639 1)) rtnvar(&excl)
/*6.30*/     rtvdtaara  dtaara(*lda (640 1)) rtnvar(&mail)
/*6.30*/     rtvdtaara  dtaara(*lda (637 1)) rtnvar(&skje)

/*6.30*/     if         cond(&excl *eq '1') then(chgvar +
/*6.30*/                    var(&btch) value('0'))
/*6.30*/     if         cond(&mail *eq '1') then(chgvar +
/*6.30*/                    var(&btch) value('0'))
/*6.30*/     if         cond(&skje *eq '1') then(chgvar +
/*6.30*/                    var(&btch) value('0'))

/*6.30*/     strpco     pcta(*no)
/*6.30*/     monmsg msgid(iws4010)

/* Bygger membere dersom de ikke finnes                              */

             CHKOBJ     OBJ(RHW1PF) OBJTYPE(*FILE) MBR(&WMM1)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(RHW1PF) MBR(&WMM1) TEXT('Poster til +
                          spes.hovedbok  (RH633R')
             ENDDO

/* Utplukking av poster                                              */

             CLRPFM     FILE(RHW1PF) MBR(&WMM1)
             MONMSG     MSGID(CPF3100)

             OVRDBF     FILE(RHW1PF) MBR(&WMM1)
             CALL       PGM(RH634R)
/* Utskrift                                                          */

             IF         COND(&BTCH *EQ '1') THEN+
                         (SBMJOB CMD(CALL PGM(RH631C) PARM(&WMM1)) +
                          JOB(LIST_HOVBK) MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/RH631C) PARM(&WMM1))

 END:        ENDPGM
