             PGM

/* Definere parametere og variabler                                  */

             DCL        VAR(&BTCH)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('RH656P' &BTCH)

/* Varselbilde                                                       */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')
             CHGVAR     VAR(&MLD2) VALUE('Utskrift pågår...........')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Utskrift                                                          */

             CALL       PGM(RH656R)

/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDMSG     MSG('ASOKON  Rutinen for utskrift av tabell+
                        arisk er ferdig') TOMSGQ(&WSID)
             ENDDO

             CALL       PGM(AP606C)    PARM('RH656P')
 END:        ENDPGM
