             PGM

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)

/* Bygge område for lagring av Beskirvelse til SAF-t oppgave         */
             crtdtaara  dtaara(SAFT_MVA) type(*char) len(100) +
                          text('Beskrivelse til SAFT-MVA oppgave +
                          (xml)')
             monmsg     msgid(cpf1023)

/* Call av parameterprogram, utskrift av mva-oppgave                 */

             CALL       PGM(RH660R) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Nullstille grunnlagsfil for xml rapport                           */

             clrpfm     file(rmvxpf)
             monmsg     msgid(cpf0000)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RH661 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))

/* Varselbilde 1                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('MVA-oppgjør............ ')
             CHGVAR     VAR(&MLD2) VALUE('**** REGNSKAP       **** ')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Call av utskriftsprogram til batch/demand                         */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(RH661C)) JOB(MVA_OPPGAV) MSGQ(*NONE))

             ELSE       CMD(CALL PGM(*LIBL/RH661C))

 ENDPGM:     ENDPGM
