             PGM

             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN12) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)

/* Call av parameterprogram, saldooverføring                         */

             CALL       PGM(RH690R) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RH691 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))

             RTVDTAARA  DTAARA(*LDA (863 1)) RTNVAR(&BTCH)

/* Varselbilde 1                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Saldooverføring........ ')
             CHGVAR     VAR(&MLD2) VALUE('**** REGNSKAP       **** ')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Call av oppdateringprogram til batch/demand                       */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             SBMJOB     CMD(CALL PGM(RH691C)) JOB(SALDO_OVF)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             CALL       PGM(RH691C)

 ENDPGM:     ENDPGM
