             PGM

             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)

/* Henter verdier i fra LDA.                                         */

             RTVDTAARA  DTAARA(*LDA (863 1))  RTNVAR(&BTCH)

/* Fjerning av MVA-merke                                             */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(6)
             CHGVAR     VAR(&WAPO) VALUE(32)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')
             CHGVAR     VAR(&MLD2) VALUE('Fjerning av MVA-merke....')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

             CALL       PGM(RH961R)

 ENDPGM:     ENDPGM
