             PGM

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)

/* Call av parameterprogram, utskrift av journal                     */

             CALL       PGM(RH964R) PARM(&IN03)
/*                                                                   */
             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RH966 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))


/* Varselbilde 1                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE(' Hovedbok pr. journal-nr.  ')
             CHGVAR     VAR(&MLD2) VALUE(' ****  H O V E D B O K *** ')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Call av utskriftsprogram til batch/demand                         */


             IF         COND(&BTCH *EQ '1') THEN(SBMJOB +
                        CMD(CALL PGM(RH965C)) JOB(NYJOUR) MSGQ(*NONE)  )

             ELSE       CMD(CALL PGM(RH965C))
/*                                                                   */
 ENDPGM:     ENDPGM
