             PGM        PARM(&FIRM &KALL &FATY &BESK)

             DCL        VAR(&FIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&KALL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FATY) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&BESK) TYPE(*CHAR) LEN(20)

/*           Sjekk om program for ASOFAK finnes                      */

             CHKOBJ     OBJ(*LIBL/FM510R) OBJTYPE(*PGM)
             MONMSG     MSGID(CPF9801) EXEC(GOTO ENDPGM)

             IF         COND(&KALL *EQ '1') THEN(CALL PGM(FM511R) +
                          PARM(&FIRM &FATY &BESK))
             IF         COND(&KALL *NE '1') THEN(CALL PGM(FM510R) +
                          PARM(&FIRM &FATY &BESK))

 ENDPGM:     ENDPGM
