
/* Programmet benytte for å finne riktig program                     */
/* for spørring på historisk fakturaregister                         */
/* Lagt inn kunde som parameter    V5.30                             */

 STRPGM:     PGM        PARM(&FIRM &RAAR &KUND &BILN)

             DCL        VAR(&FIRM) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&RAAR) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&KUND) TYPE(*DEC) LEN(6 0)
/*6.NU*/     DCL        VAR(&BILN) TYPE(*DEC) LEN(8 0)

/*           Sjekk om program for ASOFAK finnes                      */

             CHKOBJ     OBJ(*LIBL/SO510R) OBJTYPE(*PGM)
             MONMSG     MSGID(CPF9801) EXEC(GOTO ASSERV)

             CALL       PGM(SO510R)    PARM(&FIRM &RAAR &KUND &BILN)
             GOTO       ENDPGM

 ASSERV:

/*           Sjekk om program for ASSERV finnes                      */

             CHKOBJ     OBJ(*LIBL/IH000R) OBJTYPE(*PGM)
             MONMSG     MSGID(CPF9801) EXEC(GOTO ENDPGM)

             CALL       PGM(IH000R)    PARM(&FIRM &RAAR &BILN)

 ENDPGM:     ENDPGM
