             PGM        PARM(&PFIR &PKUN &PPRO &PKPN &PTYP &PTSQ &OPER)

             DCL        VAR(&PFIR) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&PKUN) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&PPRO) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&PKPN) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&PTYP) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&PTSQ) TYPE(*DEC)  LEN(4 0)
             DCL        VAR(&OPER) TYPE(*CHAR) LEN(1)

/*           Sjekk om program for ASOFAK finnes                      */

             CHKOBJ     OBJ(*LIBL/FM101R) OBJTYPE(*PGM)
             MONMSG     MSGID(CPF9801) EXEC(GOTO ENDPGM)

             CALL PGM(FM101R) +
                  PARM(&PFIR &PKUN &PPRO &PKPN &PTYP &PTSQ &OPER)

 ENDPGM:     ENDPGM
