             PGM

/* Definere parametere og variabler                                  */

             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID)     TYPE(*CHAR) LEN(10)

/* Oppdater kunderegister                                            */

             CALL       PGM(RK405R)

/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDBRKMSG  MSG('ASPGPL: Rutinen for oppdatering av kunder +
                        er ferdig') TOMSGQ(&WSID)
             ENDDO

 END:        ENDPGM
