             PGM

/* Initiering av parametre.                                          */

             DCL        VAR(&IN03)  TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&BTCH)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&MEMBX) TYPE(*CHAR) LEN(5)
             DCL        VAR(&MEMB)  TYPE(*DEC)  LEN(5 0)
             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&WMM1)  TYPE(*CHAR) LEN(10) VALUE('RKA      ')
             DCL        VAR(&OCRK)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&BGIR)  TYPE(*CHAR) LEN(1)

             RTVDTAARA  DTAARA(*LDA (863 1))  RTNVAR(&BTCH)
             RTVDTAARA  DTAARA(*LDA (864 5))  RTNVAR(&MEMBX)
             CHGVAR     VAR(&MEMB) VALUE(&MEMBX)
             CHGVAR     VAR(%SST(&WMM1 4 5)) VALUE(&MEMB)

/* Call av program for formularparametre.                            */

             CALL       PGM(AP600R) PARM('RK617 ' '0' '0' &IN03 &BTCH)

/* Program for overstyring av printerfile                            */

             CALL       PGM(AP602C) PARM('RK617P' '0')

/* Program for utskrift av bankgiro                                  */

             CALL       PGM(RK617R)

             CALL       PGM(AP606C) PARM('RK617P')

 END:        ENDPGM
