             PGM        PARM(&KUNR &VALG)

/* Definere parametere og variabler                                  */

             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&KUNR)     TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&VALG)     TYPE(*CHAR) LEN(1)

/* Utskrift                                                          */

             CALL       PGM(AP601C)    PARM('RK637P' &BTCH)

             CALL       PGM(RK637R)    PARM(&KUNR &VALG)

             CALL       PGM(AP606C)    PARM('RK637P')

 END:        ENDPGM
