             PGM        PARM(&PARM)

/* Initiering av parametere                                          */

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(64)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('RK635P' &BTCH)

/* Kaller opp program for bruksrettytelser                           */

             CALL       PGM(RK635R)    PARM(&PARM)

             CALL       PGM(AP606C)    PARM('RK635P')
             ENDPGM
