             PGM        PARM(&KUNR &VALG &MAIL)

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VALG)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&MAIL)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&KUNR)     TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&KULE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&PRTF)     TYPE(*CHAR) LEN(10)

/* Null-stilling                                                     */

             CHGDTAARA  DTAARA(*LDA (810 10)) VALUE('          ')
             CHGDTAARA  DTAARA(*LDA (899 1))  VALUE(' ')

/* Er det valgt mail ?                                               */

             IF         COND(&MAIL *EQ '1') THEN(DO)
             GOTO       CMDLBL(XMAIL)
             ENDDO

/* Skriv kundeinformasjon                                            */

             IF         COND(&VALG *EQ '1') THEN(DO)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RK637 ' '1' '0' &IN03 &BTCH)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             CALL       PGM(RK637C) PARM(&KUNR &VALG)
             GOTO       CMDLBL(END)

             ENDDO

/* Behandling av mail                                                */

 XMAIL:
             CHGDTAARA  DTAARA(*LDA (810 10)) VALUE('E_MAIL_ASP')
             CHGDTAARA  DTAARA(*LDA (899 1))  VALUE('1')
             CHGVAR     VAR(&KULE)     VALUE('K')

/* Skriv kundeinformasjon                                            */

             IF         COND(&VALG *EQ '1') THEN(DO)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RK637_M' '1' '0' &IN03 &BTCH)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             CALL       PGM(RK637C) PARM(&KUNR &VALG)

/* Program for mailadresse                                           */

             CHGVAR     VAR(&PRTF)     VALUE('RK637P')

             CALL       PGM(RÅ798C) PARM(&KULE &KUNR &PRTF)

             ENDDO

 END:        ENDPGM
