             PGM
/* AP600 kalles to ganger. Nå kjøres kun RK654,  endret til å kun kjøre */
/* en gang. bsa 07.11.12                                                */

             DCL        VAR(&PROG) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&WMM1) TYPE(*CHAR) LEN(10) VALUE('RENT    ')
             DCL        VAR(&PSKR)  TYPE(*CHAR) LEN(1)

             RTVDTAARA  DTAARA(*LDA (944 03)) RTNVAR(&FIRM)
             CHGVAR     VAR(%SST(&WMM1 5 3)) VALUE(&FIRM)


/* Sjekk om det finnes poster for vedlikehold av renteposter         */

             CHKOBJ     OBJ(RKWBPF) OBJTYPE(*FILE) MBR(&WMM1)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             CHGVAR     VAR(&WALI) VALUE(14)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Det finnes ingen renteposter')
             CHGVAR     VAR(&MLD2) VALUE('Rutinen avsluttes!!    ****')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             DLYJOB     DLY(10)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Hent inn parameter fra siste kjøring av forslag                   */

             OVRDBF     FILE(RKWAPF) MBR(&WMM1)
             CALL       PGM(RK665R)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RK664 ' '0' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))

             RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PROG)

             IF         COND(&PROG *EQ ' ') THEN(DO)
             CHGVAR     VAR(&PROG) VALUE(RK664)
             ENDDO

/*           CALL       PGM(AP600R) PARM(&PROG '1' '0' &IN03 &BTCH)  */

/*           IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))*/

/* Varselbilde 1                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Skriver ut rentenota       ')
             CHGVAR     VAR(&MLD2) VALUE(' ****  KUNDERESKONTRO **** ')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Call av utskriftsprogram til batch/demand                         */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB +
                        CMD(CALL PGM(RK664C) PARM(&PROG)) +
                        JOB(RENTENOTA) MSGQ(*NONE))

             ELSE       CMD(CALL PGM(RK664C) PARM(&PROG))

 ENDPGM:     ENDPGM
