             PGM

             DCL        VAR(&FIRM)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&WMM1) TYPE(*CHAR) LEN(10) VALUE('RENT    ')

             RTVDTAARA  DTAARA(*LDA (944 3)) RTNVAR(&FIRM)
             CHGVAR     VAR(%SST(&WMM1 5 3)) VALUE(&FIRM)

/* Bygger membere dersom de ikke finnes                              */

             CHKOBJ     OBJ(RKWAPF) OBJTYPE(*FILE) MBR(&WMM1)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(RKWAPF) MBR(&WMM1) TEXT('Parameter for +
                          rentenota (RK660R)')
             ENDDO

/* Call av parameterprogram, utskrift av rentenota                   */

             OVRDBF     FILE(RKWAPF) MBR(&WMM1)
             CALL       PGM(RK660R) PARM(&IN03)
/*                                                                   */
             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO
/*                                                                   */
/* Call av program for formularparametre.                            */
/*                                                                   */

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RK662 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))

/*                                                                   */
/* Varselbilde 1                                                     */
/*                                                                   */
             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Rentenota - forslag .......')
             CHGVAR     VAR(&MLD2) VALUE(' ****  KUNDERESKONTRO **** ')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO
/*                                                                   */
/* Call av utskriftsprogram til batch/demand                         */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB +
                        CMD(CALL PGM(RK661C)) JOB(BETVARSL) MSGQ(*NONE))

             ELSE       CMD(CALL PGM(RK661C))
/*                                                                   */
 ENDPGM:     ENDPGM
