             PGM        PARM(&TYPE &EDAT)

/* Definere parametere og variabler                                  */

             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&EDAT)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&WSID)     TYPE(*CHAR) LEN(10)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('RK673P' &BTCH)

/* Utskrift                                                          */

             CALL       PGM(RK673R) PARM(&TYPE &EDAT)

/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDBRKMSG  MSG('ASOKON: Rutinen for utskrift av kunder +
                        som er utelatt fra purring/renter +
                        er ferdig') TOMSGQ(&WSID)
             ENDDO

             CALL       PGM(AP606C)    PARM('RK673P')
 END:        ENDPGM
