             PGM        PARM(&IN03 &TYPE)

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&TYPE *EQ 'A') THEN(GOTO CMDLBL(ALMENN))

/* Vanlig kredittgrense                                              */
/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RK677 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))

/* Varselbilde 1                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Kundereskontro ..........')
             CHGVAR     VAR(&MLD2) VALUE('utskrift av +
                          kreditt-overskridelse')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('RK677P' &BTCH)

/* Utskrift                                                          */

             CALL       PGM(RK677R) PARM(&TYPE)

             CALL       PGM(AP606C)    PARM('RK677P')
             GOTO       CMDLBL(ENDPGM)

 ALMENN:

/* Kredittgrense almenning                                           */
/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RK678 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))

/* Varselbilde 1                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Almenning ...............')
             CHGVAR     VAR(&MLD2) VALUE('utskrift av +
                          beløps-overskridelse')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('RK678P' &BTCH)

/* Utskrift                                                          */

             CALL       PGM(RK678R) PARM(&TYPE)

             CALL       PGM(AP606C)    PARM('RK678P')
 ENDPGM:     ENDPGM
