             PGM

             DCL        VAR(&PROG) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)
             DCL        VAR(&WMM1) TYPE(*CHAR) LEN(10) VALUE('FACT    ')
             DCL        VAR(&TELL) TYPE(*DEC)  LEN(7 0)

             RTVDTAARA  DTAARA(*LDA (944 03)) RTNVAR(&FIRM)
             CHGVAR     VAR(%SST(&WMM1 5 3)) VALUE(&FIRM)


/* Sjekk om det finnes poster for vedlikehold av forslag-factoring   */

             CHKOBJ     OBJ(RKWBPF) OBJTYPE(*FILE) MBR(&WMM1)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             CHGVAR     VAR(&WALI) VALUE(10)
             CHGVAR     VAR(&WAPO) VALUE(35)
             CHGVAR     VAR(&MLD1) VALUE('Factoringposter finnes ikke')
             CHGVAR     VAR(&MLD2) VALUE('Rutinen avsluttes!!    ****')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             DLYJOB     DLY(10)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Sjekk om filen er tom                                             */

             CHGVAR     VAR(&TELL)     VALUE(0)
             OVRDBF     FILE(RKWBPF)   MBR(&WMM1)
             CALL       PGM(RK710R)    PARM(&TELL)
             DLTOVR     FILE(RKWBPF)

             IF         COND(&TELL *EQ 0)   THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(10)
             CHGVAR     VAR(&WAPO) VALUE(35)
             CHGVAR     VAR(&MLD1) VALUE('Factoringposter finnes ikke')
             CHGVAR     VAR(&MLD2) VALUE('Rutinen avsluttes!!    ****')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             DLYJOB     DLY(10)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Call av parameterprogram, overføring av factoringposter           */

             CALL       PGM(RK683R) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Varselbilde 1                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Genererer factoringposter  ')
             CHGVAR     VAR(&MLD2) VALUE(' ****  KUNDERESKONTRO **** ')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Call av utskriftsprogram til batch/demand                         */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB +
                        CMD(CALL PGM(RK684C) PARM(&PROG)) +
                            JOB(FACTORING) MSGQ(*NONE))

             ELSE       CMD(CALL PGM(RK684C) PARM(&PROG))

/* Tøm filer                                                         */

             CLRPFM     FILE(RKWBPF)   MBR(&WMM1)




 ENDPGM:     ENDPGM
