             PGM

             DCL        VAR(&IN03) TYPE(*CHAR)  LEN(1)

/* Call av parameterprogram, sletting av samlefakturanr.             */

             CALL       PGM(RK698R) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Call av program, sletting av samlefakturanr.                      */

             OVRPRTF    FILE(LISTE) TOFILE(QSYSPRT)
             CALL       PGM(RK699R)

 ENDPGM:     ENDPGM
