             PGM
/*-------------------------------------------------------------------*/
/* 6.20 151113 bsa Overstyrer rutine for å hente program i batch. Kun*/
/*                 RK692 som gjelder.                                */
/*                                                                   */
/*                                                                   */
/*                                                                   */
/*                                                                   */
/*-------------------------------------------------------------------*/



             DCL        VAR(&PROG) TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)

/* Call av parameterprogram, utskrift av generalnota                 */

             CALL       PGM(RK690R) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* Program for printerstyring                                        */

/*6.20      CALL       PGM(AP600R) PARM('RK692 ' '0' '0' &IN03 &BTCH)*/

/*6.20       RTVDTAARA  DTAARA(*LDA (871 10)) RTNVAR(&PROG)          */

/*6.20       IF         COND(&PROG *EQ ' ') THEN(DO)                 */
             CHGVAR     VAR(&PROG) VALUE(RK692)
/*6.20       ENDDO                                                   */

             CALL       PGM(AP600R) PARM(&PROG '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))

/* Varselbilde 1                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Generalnota - utplukk .....')
             CHGVAR     VAR(&MLD2) VALUE(' ****  KUNDERESKONTRO **** ')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Call av utskriftsprogram til batch/demand                         */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB +
                        CMD(CALL PGM(RK691C) PARM(&PROG)) +
                            JOB(GENERALN) MSGQ(*NONE))

             ELSE       CMD(CALL PGM(RK691C) PARM(&PROG))

 ENDPGM:     ENDPGM
