             PGM        PARM(&LPARAM)

             DCL        VAR(&LPARAM) TYPE(*CHAR) LEN(120)

             DCL        VAR(&IN03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH) TYPE(*CHAR) LEN(1)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RK813' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Videre behandling                                                 */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(RK812C) PARM(&LPARAM)) JOB(AUTOGIRO) +
                          MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/RK812C) +
                         PARM(&LPARAM))

 END:        ENDPGM
