             PGM

             DCL        VAR(&tild)  TYPE(*CHAR) LEN(25)
/* Prøver å opprette mappe for AUTOGIRO                              */

/*           CRTFLR     FLR(AUTOGIRO) TEXT('Mappe for AUTOGIRO')     */
/*           MONMSG     MSGID(CPF8A85)                               */
/*           MONMSG     MSGID(CPF8A18)                               */

/* Kopierer til QDLS                                                 */

/*           CPYTOPCD   FROMFILE(RAUTPF) TOFLR(PCFILER) +   */
/*                        TODOC(AUTOG.BBS) REPLACE(*YES) +  */
/*                        TRNTBL(*DFT) TRNFMT(*TEXT)        */
             chgvar     var(&tild) value('AUTOG.BBS')
             call       pgm(asptostmf) +
                        parm('RAUTPF    ' +
                             'RAUTPF    ' +
                             'PCFILER             ' +
                             &tild   +
                             '   ')

 END:        ENDPGM
