             PGM

             DCL        VAR(&IN03) TYPE(*CHAR)  LEN(1)
             DCL        VAR(&IN12) TYPE(*CHAR)  LEN(1)
             DCL        VAR(&WALI) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2) TYPE(*CHAR) LEN(40)

/* Call av parameterprogram, Test av uttrekk til Visma, Zirius etc   */

             CALL       PGM(RK985R) PARM(&IN03)

             IF         COND(&IN03 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             IF         COND(&IN12 *EQ '1') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO


/* Call av oppdateringsprogram                                       */

/*           CALL       PGM(RK973R)                                  */

 ENDPGM:     ENDPGM
