
/*   Kunder, reorganisering av spesialavtale                     */

             PGM

             DCL        VAR(&MLD1)     TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)     TYPE(*CHAR) LEN(40)
             DCL        VAR(&WALI)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)     TYPE(*DEC)  LEN(2 0)

/* Varselbilde 1                                                     */

             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(2)
             CHGVAR     VAR(&MLD1) VALUE('Reorganisering av +
                          spesialavtale kunder, ')
             CHGVAR     VAR(&MLD2) VALUE('oppdatering pågår          ')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)

/*   Reorganiserer spesialavtale og setter merke            */

             CALL       PGM(RK981R)

ENDPGM:      ENDPGM
