             PGM        PARM(&FIRM &FGRT &FIRT &LEVR &OPPR)

/* Initiering av parametre.                                          */

             DCL        VAR(&FIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&FGRT) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRT) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&LEVR) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&OPPR) TYPE(*CHAR) LEN(1)

             DCL        VAR(&LIBL) TYPE(*CHAR) LEN(6) VALUE('ADBxxx')

/* Overrider tabeller det skal kopieres til                          */

             CHGVAR     VAR(%SST(&LIBL 4 3)) VALUE(&FGRT)

             OVRDBF     FILE(RLEVLU) TOFILE(&LIBL/RLEVLU) +
                          OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(RLSOLU) TOFILE(&LIBL/RLSOLU) +
                          OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(RLBALU) TOFILE(&LIBL/RLBALU) +
                          OVRSCOPE(*CALLLVL)

/* Kaller program for kopiering av avtale                            */

             CALL       PGM(RL191R) PARM(&FIRM &LEVR &FIRT &OPPR)

 END:        ENDPGM
