/* Endret 23.4.03 merket x5.00: Ny parameter                         */
             PGM        PARM(&IN03 &TYPE &EDAT &NDAT) /* E5.00 +
                          Leverandører lagt inn etter .. */

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&EDAT)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&NDAT) TYPE(*CHAR) LEN(10) /* T5.00 */
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RL401 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(RL401C) PARM(&TYPE &EDAT &NDAT)) +
                          JOB(SLETT_LEVR) MSGQ(*NONE)) /* E5.00 */

             ELSE       CMD(CALL PGM(*LIBL/RL401C) PARM(&TYPE &EDAT +
                          &NDAT)) /* E5.00 */

 END:        ENDPGM
