             PGM        PARM(&KUNR)

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&VALG)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&MAIL)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&KUNR)     TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&KULE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&PRTF)     TYPE(*CHAR) LEN(10)

/* Null-stilling                                                     */

             CHGDTAARA  DTAARA(*LDA (810 10)) VALUE('          ')
             CHGDTAARA  DTAARA(*LDA (899 1))  VALUE(' ')

/* Call av parameterprogram                                          */

             CALL       PGM(RL643R) PARM(&IN03 &KUNR &VALG &MAIL)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Er det valgt mail ?                                               */

             IF         COND(&MAIL *EQ '1') THEN(DO)
             GOTO       CMDLBL(XMAIL)
             ENDDO

/* Skriv kontoutdrag                                                 */

             IF         COND(&VALG *EQ '1') THEN(DO)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RL642 ' '1' '0' &IN03 &BTCH)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             CALL       PGM(RL641C)
             GOTO       CMDLBL(END)

             ENDDO

/* Skriv åpne poster                                                 */

             IF         COND(&VALG *EQ '2') THEN(DO)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RL636 ' '1' '0' &IN03 &BTCH)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             CALL       PGM(RL636C) PARM(&KUNR)
             GOTO       CMDLBL(END)

             ENDDO

/* Behandling av mail                                                */

 XMAIL:
             CHGDTAARA  DTAARA(*LDA (810 10)) VALUE('E_MAIL_ASP')
             CHGDTAARA  DTAARA(*LDA (899 1))  VALUE('1')
             CHGVAR     VAR(&KULE)     VALUE('L')

/* Skriv kontoutdrag                                                 */

             IF         COND(&VALG *EQ '1') THEN(DO)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RL642_M' '1' '0' &IN03 &BTCH)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             CALL       PGM(RL641C)

/* Program for mailadresse                                           */

             CHGVAR     VAR(&PRTF)     VALUE('RL642P')

             CALL       PGM(RÅ798C) PARM(&KULE &KUNR &PRTF)

             ENDDO

/* Skriv åpne poster                                                 */

             IF         COND(&VALG *EQ '2') THEN(DO)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RL636_M' '1' '0' &IN03 &BTCH)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             CALL       PGM(RL636C) PARM(&KUNR)

/* Program for mailadresse                                           */

             CHGVAR     VAR(&PRTF)     VALUE('RL636P')

             CALL       PGM(RÅ798C) PARM(&KULE &KUNR &PRTF)

             ENDDO

 END:        ENDPGM
