             PGM        PARM(&IN03 &TYPE)

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RL675 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))

/* Varselbilde 1                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(4)
             CHGVAR     VAR(&WAPO) VALUE(44)
             CHGVAR     VAR(&MLD1) VALUE('Leverandørreskontro .....')
             CHGVAR     VAR(&MLD2) VALUE('utskrift av reklamasjoner')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('RL675P' &BTCH)

/* Utskrift                                                          */

             CALL       PGM(RL675R) PARM(&TYPE)

             CALL       PGM(AP606C)    PARM('RL675P')

 ENDPGM:     ENDPGM
