
/*           Generere tabeller for logging av regnskapstranser    */

             PGM        parm(&FGRP)

             DCL        VAR(&FGRP)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&LIBL)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&NULL)   TYPE(*CHAR) LEN(1)

/*           Setter bibliotek til current og henter gruppeprofil     */

             CHGVAR     VAR(&LIBL) VALUE('ADB' *CAT &FGRP)
             CHGCURLIB  CURLIB(&LIBL)

/*           Starter å opprette filer                                */

             CALL       PGM(AG908C) PARM('RLOHST' &FGRP '*NONE' &NULL)

             CALL       PGM(AG908C) PARM('RLODST' &FGRP '*NONE' &NULL)

 ENDPGM:     ENDPGM
