             PGM
             DCLF       FILE(RM00)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
/*6.20*/     dcl        var(&menu)     type(*char) len(10)
/*6.20*/     dcl        var(&stat)     type(*char) len(1)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)


 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&L_FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
/*6.20       IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))        */
/*6.20*/     if         cond(&in03) then(do)
/*6.20*/     chgvar     var(&stat)  value('0')
/*6.20*/     chgvar     var(&menu)  value('RM00      ')
/*6.20*/     call       pgm(ax720r) parm(&menu &stat)
/*6.20*/     if         cond(&stat *eq '1') then(do)
/*6.20*/     goto cmdlbl(start)
/*6.20*/     enddo
/*6.20*/     goto       cmdlbl(endpgm)
/*6.20*/     enddo

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1 - Registrering                                             */

             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(RM10)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2 - Rapporter                                                */

             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(RM20)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3  - Spørring                                                */

             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(RM90)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4 - Registervedlikehold                                      */

             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(RM80)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5 - Utskrift av registre'                                    */

             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(RM81)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6 - Hjelperutiner avstemming mm                              */

             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(RM19)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7 - Årsrutiner                                               */

             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(RM14)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8 - Hovedbok                                                 */

             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(RM60)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9 - Kundereskontro                                           */

             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(RM40)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 10 - Leverandørreskontro                                     */

             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(RM50)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 11 - Prosjektregnskap                                        */

             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       PGM(RM70)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 12 - Overføring fra Lønn                                  */

             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(RM13)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 13 - Overføring til PC-filer                                 */

             IF         COND(&VALG *EQ 13) THEN(DO)
             CALL       PGM(RM15)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 18 - Altinn                                                  */

             IF         COND(&VALG *EQ 18) THEN(DO)
             CALL       PGM(RM35)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 19 - Regnskapslogg     8.01                                  */

             IF         COND(&VALG *EQ 19) THEN(DO)
                CALL       PGM(RF500R)
                GOTO       CMDLBL(START)
             ENDDO

/* Valg 20 - Masterdatalog     8.01                                  */

             IF         COND(&VALG *EQ 20) THEN(DO)
                CALL       PGM(RF520R)
                GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */

             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */

             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
