             PGM
             DCLF       FILE(RM11)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&L_FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1 - Generere posteringer fra saldo                           */

             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(RH190C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2 - Registrering/Justering                                   */

             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(RF010C) PARM(WBEV)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3 - Kontrolliste                                             */

             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(RF1KONTR) PARM(WBEV)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4  - Journalliste                                            */

             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(RF1JOURN) PARM(WBEV)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5  - Vedlikehold                                             */

             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(RF03SC)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6 - Generere posteringer fra budsjett                        */

             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(RH195C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7 - Registrering/Justering                                   */

             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(RF010C) PARM(WBUD)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8 - Kontrolliste                                             */

             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(RF1KONTR) PARM(WBUD)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9  - Journalliste                                            */

             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(RF1JOURN) PARM(WBUD)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 10 - Vedlikehold                                            */

             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(RF03BC)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 13 - Memberoversikt - poster til journal                     */

             IF         COND(&VALG *EQ 13) THEN(DO)
             CALL       PGM(RH970C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 14 - Flytter member til B_user                               */

             IF         COND(&VALG *EQ 14) THEN(DO)
             CALL       PGM(RH971C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 15 - Omkjøring av journalliste                               */

             IF         COND(&VALG *EQ 15) THEN(DO)
             CALL       PGM(RH964C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 16 - Journaler med differanse                                */

             IF         COND(&VALG *EQ 16) THEN(DO)
             CALL       PGM(RH967C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 17 - Ny utskrift av mva-oppgjør                              */

             IF         COND(&VALG *EQ 17) THEN(DO)
             CALL       PGM(RH662C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 18 - Ny utskrift av generalnota                              */

             IF         COND(&VALG *EQ 18) THEN(DO)
             CALL       PGM(RK695C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */

             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */

             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
