             PGM
             DCLF       FILE(RM12)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)

             DCL        VAR(&MODU)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&DISP)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&STAT)     TYPE(*CHAR) LEN(1)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&L_FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1 - Overføring av posteringer fra butikk                     */

             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(RF1TRANS) PARM(SHOP)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2 - Registrering/Justering                                   */

             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(RF010C) PARM(SHOP)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3 - Kontrolliste                                             */

             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(RF1KONTR) PARM(SHOP)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4  - Journalliste                                            */

             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(RF1JOURN) PARM(SHOP)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5 - Overføring av posteringer fra fakturering                */

             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(RF1TRANS) PARM(FAKT)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6 - Registrering/Justering                                   */

             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(RF010C) PARM(FAKT)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7 - Kontrolliste                                             */

             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(RF1KONTR) PARM(FAKT)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8  - Journalliste                                            */

             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(RF1JOURN) PARM(FAKT)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9 - Overføring av posteringer fra lager/innkjøp              */

             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(RF1TRANS) PARM(LAGR)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 10 - Registrering/Justering                                  */

             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(RF010C) PARM(LAGR)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 11 - Kontrolliste                                            */

             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       PGM(RF1KONTR) PARM(LAGR)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 12  - Journalliste                                           */

             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(RF1JOURN) PARM(LAGR)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 13  - Meny for Multisupport                                  */

             IF         COND(&VALG *EQ 13) THEN(DO)
             CALL       PGM(RM16)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 14  - Meny for Compello                                      */

             IF         COND(&VALG *EQ 14) THEN(DO)
             CALL       PGM(RM17)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */

             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */

             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */

 ENDPGM:     ENDPGM
