             PGM
             DCLF       FILE(RM15)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&L_FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1 - Overføring av saldobalanse                               */

             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(RE600C) PARM(PC  )
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2 - Overføring av resultatrapport                            */

             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(RE620C) PARM(PC) /* Lagt inn param. SYST +
                          29.9.03 HFL */
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3 - Overføring til Trioplan                                  */

             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(RE602C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4 - Overføring til Finale                                    */

             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(RE600C) PARM(FINA)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5 - Overføring til Total                                     */

             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(RE600C) PARM(TOTA)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6 - Overføring til Maestro                                   */

             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(RE600C) PARM(MAES)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7 - Overføring til Max                                       */

             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(RE600C) PARM(MAX )
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8 - Overføring til Akelius                                   */

             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(RE600C) PARM(AKEL)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9 - Overføring fra eksterne systemer                         */

             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(RE120C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 10 - Overføring fra PC Super                                 */

             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(RE121C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 11 - Overføring fra Rubicon                                  */

             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       PGM(RE120C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 12 - Overføring fra Q-Free                                   */

             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(RE123C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 13 - Overføring fra Ergosoft Lønn                            */

             IF         COND(&VALG *EQ 13) THEN(DO)
             CALL       PGM(RE124C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 14 - Overføring fra .-sepparert fil                          */

             IF         COND(&VALG *EQ 14) THEN(DO)
             CALL       PGM(RE125C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 17 - Registrering/Justering                                  */

             IF         COND(&VALG *EQ 17) THEN(DO)
             CALL       PGM(RF010C) PARM(PCIN)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 18 - Kontrolliste                                            */

             IF         COND(&VALG *EQ 18) THEN(DO)
             CALL       PGM(RF1KONTR) PARM(PCIN)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 19  - Journalliste                                           */

             IF         COND(&VALG *EQ 19) THEN(DO)
             CALL       PGM(RF1JOURN) PARM(PCIN)
             GOTO       CMDLBL(START)
             ENDDO
/* Valg 90                                                           */

             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */

             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
