             PGM
             DCLF       FILE(RM17)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             dcl        var(&fgr)      type(*char) len(3)
             dcl        var(&frm)      type(*char) len(3)
             dcl        var(&lib)      type(*char) len(10) value('ADB')
             dcl        var(&sts)      type(*char) len(1)
             dcl        var(&aspusr)   type(*char) len(10)

             DCL        VAR(&MODU)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&DISP)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&STAT)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&jsta)     TYPE(*dec)  LEN(1 0) value(0)
             DCL        VAR(&jkey)     TYPE(*CHAR) LEN(41)  value(' ')
             DCL        VAR(&asp)      TYPE(*CHAR) LEN(1)

             MONMSG     MSGID(CPD0170) EXEC(GOTO MELDE2)
             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)

 /*      Sjekk om figruppe og firma har feiltranser fra Compello  */
             rtvdtaara  dtaara(*lda (931 3))  rtnvar(&fgr)
             rtvdtaara  dtaara(*lda (944 3))  rtnvar(&frm)
             chgvar     var(%substring(&lib 4 3)) value(&fgr)
             ovrdbf     file(rcoml2)  tofile(&lib/rcoml2)
             call       pgm(xc050r) parm(&frm &sts)
             chgvar     var(&in41) value('0')
             if         cond(&sts = 'F') then(do)
               chgvar   var(&in41) value('1')
             enddo

 /*      Dersom ASP-bruker kan valg 9 benyttes                   */
             rtvdtaara  dtaara(*lda (911 3))  rtnvar(&aspusr)
             if         cond(&aspusr = 'ASP') then(do)
               chgvar   var(&asp) value('1')
             enddo
             if         cond(&aspusr = 'SST') then(do)
               chgvar   var(&asp) value('1')
             enddo
             if         cond(&aspusr = 'TME') then(do)
               chgvar   var(&asp) value('1')
             enddo

             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&L_FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))


/* Valg  1 - Se på poster fra Compello                               */

             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(XC070R)
             GOTO       CMDLBL(START)
             ENDDO
/* Valg  2 - Overføring av posteringer fra Compello - Scanning   */

             IF         COND(&VALG *EQ 2) THEN(DO)
             CHGVAR     VAR(&MODU)     VALUE(CMP)
             CHGVAR     VAR(&DISP)     VALUE(1)
             CHGVAR     VAR(&STAT)     VALUE(0)
             CALL       PGM(AX700R) PARM(&MODU &DISP &STAT)
             IF         COND(&STAT *EQ '1') THEN(DO)
             GOTO       CMDLBL(START)
             ENDDO
             CALL       PGM(RF1TCOMP) PARM('COMP' &jkey &jsta)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg  3 - Registrering/Justering                                  */

             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(RF010C) PARM(COMP)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg  4 - Kontrolliste                                            */

             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(RF1KONTR) PARM(COMP)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg  5  - Journalliste                                           */

             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(RF1JOURN) PARM(COMP)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg  6  - Justere feiltranser fra Compello                       */

             IF         COND(&VALG *EQ 6) THEN(DO)
             ovrdbf     file(rcoml1)  tofile(&lib/rcoml1)
             ovrdbf     file(rcomlr)  tofile(&lib/rcomlr)
             ovrdbf     file(rcomlu)  tofile(&lib/rcomlu)
             CALL       PGM(xc060r)
             CALL       PGM(RF1TCOMP) PARM('COMP' &jkey &jsta)
             GOTO       CMDLBL(START)
             ENDDO


/* Valg  9  - Gå til meny for konsulenter                            */

             if         cond(&valg *eq  9) then(do)
              if         cond(&asp *eq '1') then(do)
               call       pgm(rm27)
              enddo
             goto       cmdlbl(start)
             enddo

/* Valg 90                                                           */

             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */

             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

 MELDE2:     CALL       PGM(AA00SC)
             GOTO       CMDLBL(START)

/* Slutt                                                             */

 ENDPGM:     ENDPGM
