             PGM
             DCLF       FILE(RM18)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)

             DCL        VAR(&MODU)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&DISP)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&STAT)     TYPE(*CHAR) LEN(1)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&L_FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg  1 - Utskrift av rapport RF115P - Journal                    */

             IF         COND(&VALG *EQ 1) THEN(DO)
             CHGVAR     VAR(&MODU)     VALUE(MSA)
             CHGVAR     VAR(&DISP)     VALUE(1)
             CHGVAR     VAR(&STAT)     VALUE(0)
             CALL       PGM(AX700R) PARM(&MODU &DISP &STAT)
             IF         COND(&STAT *EQ '1') THEN(DO)
             GOTO       CMDLBL(START)
             ENDDO

             CALL       PGM(RF114PC)
             GOTO       CMDLBL(START)

             ENDDO

/* Valg  2 - Utskrift av rapport BO124P - Kasseoppgjør               */

             IF         COND(&VALG *EQ 2) THEN(DO)
             CHGVAR     VAR(&MODU)     VALUE(MSA)
             CHGVAR     VAR(&DISP)     VALUE(1)
             CHGVAR     VAR(&STAT)     VALUE(0)
             CALL       PGM(AX700R) PARM(&MODU &DISP &STAT)
             IF         COND(&STAT *EQ '1') THEN(DO)
             GOTO       CMDLBL(START)
             ENDDO

             CALL       PGM(BO124PC)
             GOTO       CMDLBL(START)

             ENDDO

/* Valg  3 - Utskrift av rapport BO125P - Kasseoppgjør               */

             IF         COND(&VALG *EQ 3) THEN(DO)
             CHGVAR     VAR(&MODU)     VALUE(MSA)
             CHGVAR     VAR(&DISP)     VALUE(1)
             CHGVAR     VAR(&STAT)     VALUE(0)
             CALL       PGM(AX700R) PARM(&MODU &DISP &STAT)
             IF         COND(&STAT *EQ '1') THEN(DO)
             GOTO       CMDLBL(START)
             ENDDO

             CALL       PGM(BO125PC)
             GOTO       CMDLBL(START)

             ENDDO

/* Valg  3 - Utskrift av rapport BO126P - Kasseoppgjør               */

             IF         COND(&VALG *EQ 3) THEN(DO)
             CHGVAR     VAR(&MODU)     VALUE(MSA)
             CHGVAR     VAR(&DISP)     VALUE(1)
             CHGVAR     VAR(&STAT)     VALUE(0)
             CALL       PGM(AX700R) PARM(&MODU &DISP &STAT)
             IF         COND(&STAT *EQ '1') THEN(DO)
             GOTO       CMDLBL(START)
             ENDDO

             CALL       PGM(BO126PC)
             GOTO       CMDLBL(START)

             ENDDO

/* Valg 20 - Utskrift av etiketter                                   */

             IF         COND(&VALG *EQ 20) THEN(DO)
             CHGVAR     VAR(&MODU)     VALUE(MSA)
             CHGVAR     VAR(&DISP)     VALUE(1)
             CHGVAR     VAR(&STAT)     VALUE(0)
             CALL       PGM(AX700R) PARM(&MODU &DISP &STAT)
             IF         COND(&STAT *EQ '1') THEN(DO)
             GOTO       CMDLBL(START)
             ENDDO

             CALL       PGM(RE632R)
             GOTO       CMDLBL(START)

             ENDDO


/* Valg 30   Start MultiArkiv                                        */
/**                                                     **/
/**          IF         COND(&VALG *EQ 30) THEN(DO)     **/
/**          MLTARC400/STRMLTARC                        **/
/**          GOTO       CMDLBL(START)                   **/
/**          ENDDO                                      **/
/**                                                     **/
/* Valg 90                                                           */

             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */

             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */

 ENDPGM:     ENDPGM
