             PGM
             DCLF       FILE(RM19)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&L_FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1 - Avstemming kundereskontro                                */

             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(RK789C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2 - Oppdatere saldo/kjøp fra posteringer                     */

             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(RK970C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3 - Flytting av kunder                                       */

             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(RK108R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4 - Sletting av kundposteringer                              */

             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(RK402R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5 - Sletting av kunder                                       */

             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(RK400R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6 - Merk passive kunder                                      */

             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(RK974C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7 - Avstemming leverandørposteringer                         */

             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(RL789C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 8 - Oppdatere saldo/kjøp fra posteringer                     */

             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(RL970C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 9 - Flytting av leverandører                                 */

             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(RL108R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 10 - Sletting av leverandørposteringer                       */

             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(RL402R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 11 - Sletting av leverandører                                */

             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       PGM(RL400R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 12 - Merk passive leverandører                               */

             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(RL974C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 13 - Oppdatere saldo hovedbok fra posteringer                */

             IF         COND(&VALG *EQ 13) THEN(DO)
             CALL       PGM(RH290C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 14 - Flytting av konti                                       */

             IF         COND(&VALG *EQ 14) THEN(DO)
             CALL       PGM(RH108R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 15 - Sletting av hovedboksposteringer/saldi                  */

             IF         COND(&VALG *EQ 15) THEN(DO)
             CALL       PGM(RH400C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 16 - Oppdatere saldo prosjekt fra posteringer                */

             IF         COND(&VALG *EQ 16) THEN(DO)
             CALL       PGM(RP290C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 17 - Sletting av prosjektsposteringer                        */

             IF         COND(&VALG *EQ 17) THEN(DO)
             CALL       PGM(RP400C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 18 - Sletting av prosjekter                                  */

             IF         COND(&VALG *EQ 18) THEN(DO)
             CALL       PGM(RP402C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 19 - Endre firmanummer i filgruppe                           */

             IF         COND(&VALG *EQ 19) THEN(DO)
             CALL       PGM(RF400C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 20 - Slette firmanummer i filgruppe                          */

             IF         COND(&VALG *EQ 20) THEN(DO)
             CALL       PGM(RF402C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 21 - Kopiere firma til ny filgruppe                          */

             IF         COND(&VALG *EQ 21) THEN(DO)
             CALL       PGM(RF403C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 22 - Kopiere koder, kontoplan og resultatrapporter           */

             IF         COND(&VALG *EQ 22) THEN(DO)
             CALL       PGM(RF410C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 23 - Oppdater kunder fra kundekategori                       */

             IF         COND(&VALG *EQ 23) THEN(DO)
             CALL       PGM(RK404C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 25 - Endring av postnummer                                   */

             IF         COND(&VALG *EQ 25) THEN(DO)
             CALL       PGM(RF960R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */

             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */

             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
