             PGM
             DCLF       FILE(RM30)
             DCL        VAR(&FNAV)   TYPE(*CHAR) LEN(30)
             DCL        VAR(&WPBFNR) TYPE(*DEC) LEN(3 0)

             DCL        VAR(&MODU)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&DISP)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&STAT)     TYPE(*CHAR) LEN(1)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&L_FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1 - Kjør utbetalingsforslag                                  */

             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(GL100C) PARM('R')
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2 - Hent lønnstransaksjoner                                  */

             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(GL100C) PARM('L')
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3 - Vedlikehold av forslag                                   */

             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(GL104C) PARM(&WPBFNR)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4 - Overfør samlefil                                         */

             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(GL106C) PARM('   ' 000 000)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5 - Oppkobling mot bank                                     */

             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(GL123C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6 - Forfallsregister                                         */

             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(GL130R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7 - ADRA                                                    */

             IF         COND(&VALG *EQ 7) THEN(DO)

             CHGVAR     VAR(&MODU)     VALUE(ADRA)
             CHGVAR     VAR(&DISP)     VALUE(1)
             CHGVAR     VAR(&STAT)     VALUE(0)
             CALL       PGM(AX700R) PARM(&MODU &DISP &STAT)

             IF         COND(&STAT *EQ '1') THEN(DO)
             GOTO       CMDLBL(START)
             ENDDO

             CALL       PGM(DADR2R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7 - Hovedrutine bankavstemming                               */

/*           IF         COND(&VALG *EQ 7) THEN(DO)                   */
/*           CALL       PGM(DB100R)                                  */
/*           GOTO       CMDLBL(START)                                */
/*           ENDDO                                                   */
/*                                                                   */
/* Valg 8 - Spørring på kontoinformasjon                             */
/*                                                                   */
/*           IF         COND(&VALG *EQ 8) THEN(DO)                   */
/*           CALL       PGM(DB500C)                                  */
/*           GOTO       CMDLBL(START)                                */
/*           ENDDO                                                   */
/*                                                                   */
/* Valg 8  - Spørring på hovedbokskonto                              */

             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(RH520R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 10 - Hent returdata                                          */

             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(GL109C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 11 - Oppdater returdata                                      */

             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       PGM(GL118C)
             GOTO       CMDLBL(START)
             ENDDO


/* Valg 12 - Justering av posteringer                                */

             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(RF010C) PARM(TELE)
             GOTO       CMDLBL(START)
             ENDDO
/* Valg 13 - Kjør kontrolliste                                       */

             IF         COND(&VALG *EQ 13) THEN(DO)
             CALL       PGM(RF1KONTR) PARM(TELE)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 14 - Kjør journalliste                                       */

             IF         COND(&VALG *EQ 14) THEN(DO)
             CALL       PGM(RF1JOURN) PARM(TELE)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 15 - Faste data                                              */

             IF         COND(&VALG *EQ 15) THEN(DO)
             CALL       PGM(GL120R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 16 - Sletter kontrollmember bank                             */

             IF         COND(&VALG *EQ 16) THEN(DO)
             CALL       PGM(DM90)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 17 - Sletter kontrollmember samlefil                         */

             IF         COND(&VALG *EQ 17) THEN(DO)
             CALL       PGM(GL130C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 18 - Sletter kontrollmember retur                            */

             IF         COND(&VALG *EQ 18) THEN(DO)
             CALL       PGM(GL131C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 19 - Tømmer arbeidsregister - retur                          */

             IF         COND(&VALG *EQ 19) THEN(DO)
             CALL       PGM(GL132C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 20 - Sletter historiske bankreturer                          */

             IF         COND(&VALG *EQ 20) THEN(DO)
             CALL       PGM(GL229R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */

             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */

             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
