             PGM
             DCLF       FILE(RM41)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
             DCL        VAR(&selskap)  TYPE(*CHAR) LEN(30)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&L_FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg  1 - Kjør forslag                                            */

             IF         COND(&VALG *EQ  1) THEN(DO)
             CALL       PGM(RC650C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg  2 - Vedlikehold forslag                                     */

             IF         COND(&VALG *EQ  2) THEN(DO)
             CALL       PGM(RK521C) PARM(INKA)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg  3 - Utskrift av nytt forslag                                */

             IF         COND(&VALG *EQ  3) THEN(DO)
             CALL       PGM(RC652C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg  4 - Overføring til inkassobyrå                              */

             IF         COND(&VALG *EQ  4) THEN(DO)
             CALL       PGM(RC654C)
             call       pgm(aa005r) Parm('Utlegging av nye saker er kjørt')
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5    Overføring faktura                                      */

             IF         COND(&VALG *EQ 5) THEN(DO)
/*           CALL       PGM(RC321C) Erstattes da Lindorf går ut  */
             CALL       PGM(RC771FC)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 95   Se på orverført fil                                     */

             IF         COND(&VALG *EQ 95) THEN(DO)
             wrklnk     '\asp\g01\svea\inkasso\ut\Backup\*'
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6    Legge ut Innbetalinger                                  */

             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(RC658C)
             call       pgm(aa005r)  Parm('Innbetalinger er lagt ut +
                                           for overføring m/SFTP')
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 96   Se etter fil å lese                                     */

             IF         COND(&VALG *EQ 96) THEN(DO)
             wrklnk     '\asp\c36\svea\inkasso\inn\*'
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7    Overføring innbetalinger                                */

             IF         COND(&VALG *EQ 7) THEN(DO)
                 call   PGM(RC772C)    /* hvis Lindorff kjører rc772c rc322c */
                 call   pgm(aa005r)  Parm('Innbetalinger er overført +
                                           til inkassobyrå m/ftp')
                 goto   cmdlbl(start)
             ENDDO

/* Valg 8    Henter returer fra Inkassoselskap                       */

             IF         COND(&VALG *EQ 8) THEN(DO)
                 call   PGM(RC720C)
               GOTO     CMDLBL(START)
             ENDDO

/* Valg 10   Vedlikehold av status                                   */

             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(RC100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 11   Vedlikehold av saksregister                             */

             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       PGM(RC110R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 12   Sletting av saksregister                                */

             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(RC400R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 15   Vedlikehold regnskapstransaksjoner                      */

             IF         COND(&VALG *EQ 15) THEN(DO)
             CALL       PGM(RF010C) PARM(INKA)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 16   Kontrolliste                                            */

             IF         COND(&VALG *EQ 16) THEN(DO)
             CALL       PGM(RF1KONTR) PARM(INKA)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 17   Journalliste                                            */

             IF         COND(&VALG *EQ 17) THEN(DO)
             CALL       PGM(RF1JOURN) PARM(INKA)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 23   Saker hos Lindorff AS                                   */

             IF         COND(&VALG *EQ 23) THEN(DO)
             CALL       PGM(RC600R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 24   Kunder med rentekode = 2 (Utelatte)                     */

             IF         COND(&VALG *EQ 24) THEN(DO)
             CALL       PGM(RK672R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 25   Poster med reklamasjon                                  */

             IF         COND(&VALG *EQ 25) THEN(DO)
             CALL       PGM(RK674R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */

             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */

             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */

 ENDPGM:     ENDPGM
