             PGM
             DCLF       FILE(RM49)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)
/*                                                                   */
             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)
/*                                                                   */
 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&L_FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1    Vedlikehold av kortinformasjon                          */

             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(RF225R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2    Eksport av kortinformasjon                              */

             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(RF810C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3    Kobling mellom avdeling og kasse                        */

             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(RF226R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */

             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */
             GOTO       CMDLBL(START)
/*                                                                   */
 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)
/*                                                                   */
/* Slutt                                                             */
 ENDPGM:     ENDPGM
