             PGM
             DCLF       FILE(RM60)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&L_FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1 - MVA-Oppgjør                                              */

             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(RH660C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2 - Hovedbok                                                 */

             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(RH630C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3 - Spesifisert hovedbok                                     */

             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(RH632C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4 - Revisjonsjournal                                         */

             IF         COND(&VALG *EQ 4) THEN(DO)
             CALL       PGM(RH650C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5 - Saldobalanse                                             */

             IF         COND(&VALG *EQ 5) THEN(DO)
             CALL       PGM(RH620C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6 - Utskrift av saldo/budsjett                               */

             IF         COND(&VALG *EQ 6) THEN(DO)
             CALL       PGM(RH623C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7 - Resultatrapporter                                        */

             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(RR500R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg  8 Utskrift stikkprøve revisjon                              */

             IF         COND(&VALG *EQ 8) THEN(DO)
             CALL       PGM(RH653C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg  9 Utskrift tabellarisk saldobalanse                         */

             IF         COND(&VALG *EQ 9) THEN(DO)
             CALL       PGM(RH655C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 10 Vedlikehold av kontoplan                                  */

             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(RH100R)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 12  Utskrift av MVA-spesifikasjon                            */

             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(RH672C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */

             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */

             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
