             PGM
             DCLF       FILE(RM99)
             DCL        VAR(&FNAV)     TYPE(*CHAR) LEN(30)

             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)

 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&FNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&L_FNAV)   VALUE(&FNAV)
             SNDRCVF    RCDFMT(A1MNU)

/* Tester på funksjonstaster                                         */

/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO

/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO

/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)

/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)

/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

/* Valg 1    Generer databasefiler for statuskoder                   */

             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(RG001C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 2    Generer databasefiler for kodeinformasjon               */

             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(RG002C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 3    Generer databasefiler for faste registre                */

             IF         COND(&VALG *EQ 3) THEN(DO)
             CALL       PGM(RG003C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 4    Generer databasefiler for faste registre 2              */

             IF         COND(&VALG *EQ 4) THEN(DO)
/*6.30*/     CALL       PGM(RG007C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 5    Generer databasefiler for arbeidsregistre  (6.30)       */

             IF         COND(&VALG *EQ 5) THEN(DO)
/*6.30*/     CALL       PGM(RG004C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 6    Generer databasefiler for eksterne systemer (6.30)      */

             IF         COND(&VALG *EQ 6) THEN(DO)
/*6.30*/     CALL       PGM(RG005C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 7    Generer databasefiler for Visma   (6.30)                */

/*6.30*/     IF         COND(&VALG *EQ 7) THEN(DO)
/*6.30*/     CALL       PGM(RG006C)
/*6.30*/     GOTO       CMDLBL(START)
/*6.30*/     ENDDO

/* Valg 10   Bankrutiner                                             */

             IF         COND(&VALG *EQ 10) THEN(DO)
             CALL       PGM(GG000C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 11   Generer databasefiler for Almenninger                   */

             IF         COND(&VALG *EQ 11) THEN(DO)
             CALL       PGM(RGM01C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 12   Generer databasefiler for Autogiro                      */

             IF         COND(&VALG *EQ 12) THEN(DO)
             CALL       PGM(RGC02C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 13   Generer databasefiler for Factoring                     */

             IF         COND(&VALG *EQ 13) THEN(DO)
             CALL       PGM(RGC03C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 14   Generer databasefiler for Festeavgift                   */

             IF         COND(&VALG *EQ 14) THEN(DO)
             CALL       PGM(RGU01C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 15   Generer databasefiler for Sql-tabeller RA               */

             IF         COND(&VALG *EQ 15) THEN(DO)
             CALL       PGM(RG015C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 16   Generer databasefiler for Økonomiklienten               */

             IF         COND(&VALG *EQ 16) THEN(DO)
             CALL       PGM(RG016C)
             GOTO       CMDLBL(START)
             ENDDO

/* Valg 90                                                           */

             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO

/* Gå til start                                                      */

             GOTO       CMDLBL(START)

 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)

 ENDPGM:     ENDPGM
