pgm          parm(&jobb &prog &sekv &text &c_comm &c_stat &c_errt)

             dcl    var(&prog)    type(*char)  len(10)
             dcl    var(&sekv)    type(*char)  len(03)
             dcl    var(&text)    type(*char)  len(200)
             dcl    var(&jobb)    type(*char)  len(10)

             dcl    var(&c_comm)  type(*char)  len(1)
             dcl    var(&c_stat)  type(*char)  len(8)
             dcl    var(&c_errt)  type(*char)  len(120)

/*           rtvjoba    job(&jobb)           */
/*           addlible   lib(nxc_distr)       */
/*           monmsg     msgid(cpf2103)       */

             call       pgm(rmp97R) parm(&jobb &prog &sekv &text +
                                          &c_comm &c_stat &c_errt)

endpgm:
