/*---------------------------------------------------------------------------*/
/* CL for å få inn parameter til rpg-program fra grafisk                     */
/*                                                                           */
/*---------------------------------------------------------------------------*/
             PGM
             DCL        VAR(&P_fdat)    TYPE(*dec)  LEN(6 0)
             DCL        VAR(&p_tdat)    TYPE(*dec)  LEN(6 0)
             DCL        VAR(&p_knav)    TYPE(*CHAR) LEN(30)
             DCL        VAR(&p_selg)    TYPE(*dec)  LEN(4 0)
             DCL        VAR(&p_kunf)    TYPE(*dec)  LEN(6 0)
             DCL        VAR(&p_pros)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&p_kpro)    TYPE(*dec)  LEN(6 0)

             CALL       PGM(RP100r) PARM(&P_FDAT &P_TDAT &P_KNAV +
                                 &p_selg &P_KUNF &P_PROS &P_KPRO)

/* Slutt                                                             */
 ENDPGM:     ENDPGM
