             PGM  parm(+
                  &filg +
                  &firm +
                  &frap +
                  &trap +
                  &sts)

/* Definere parametere og variabler                                  */

             DCL        VAR(&filg)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&firm)     TYPE(*dec)  LEN(3 0)
             DCL        VAR(&frap)     TYPE(*dec)  LEN(4 0)
             DCL        VAR(&trap)     TYPE(*dec)  LEN(4 0)
             DCL        VAR(&sts)      TYPE(*CHAR) LEN(3)
             DCL        VAR(&tlib)     TYPE(*CHAR) LEN(10)

             chgvar     var(&tlib) value('ADB' *cat &filg)
             chkobj     obj(&tlib/RPRRLU) objtype(*file)
             monmsg     msgid(cpf9801 cpf9810) exec(do)
               goto     cmdlbl(end)
             enddo
             ovrdbf     file(rprrlu) tofile(&tlib/rprrlu)
             call       pgm(rp201r) parm(&filg &firm &frap &trap &sts)

 END:        ENDPGM
