             PGM  parm(+
                  &fper +
                  &tper +
                  &fpro +
                  &tpro +
                  &rapx +
                  &avde +
                  &prol +
                  &sts  +
                  &hit)

/* Definere parametere og variabler                                  */

             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&fper)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&tper)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&fpro)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&tpro)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&rapx)     TYPE(*CHAR) LEN(4)
             DCL        VAR(&sts)      TYPE(*CHAR) LEN(1)
             DCL        VAR(&avde)     TYPE(*CHAR) LEN(4)
             DCL        VAR(&prol)     TYPE(*CHAR) LEN(4)
             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&hit)      TYPE(*CHAR) LEN(1)

             CALL       PGM(AP600R) PARM('RP802 ' '1' '0' &IN03 &BTCH)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))
/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('RP802P' &BTCH)

/* Utskrift                                                          */

             CALL      PGM(RP802R) PARM(&fper &tper &fpro &tpro &rapx +
                                         &avde &prol &sts &hit)
/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDBRKMSG  MSG('ASPGPL: Rutinen for utskrift av prosjekt +
                        rapport er ferdig') TOMSGQ(&WSID)
             ENDDO

             CALL       PGM(AP606C)    PARM('RP802P')
 END:        ENDPGM
