             PGM        PARM(&RAPP)

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&RAPP)     TYPE(*DEC)  LEN(2 0)

/* Call av parameterprogram                                          */

             CALL       PGM(RR621R) PARM(&IN03 &RAPP)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('RR622 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Utskrift                                                          */

             IF         COND(&BTCH *EQ '1') THEN(SBMJOB CMD(CALL +
                          PGM(RR622C)) JOB(LIST_RESRA) MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/RR622C))

 END:        ENDPGM
