             PGM

/* Definere parametere og variabler                                  */

             DCL        VAR(&BTCH)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&BTCH)  TYPE(*CHAR) LEN(1)

             DCL        VAR(&RAPX)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&RAPP)  TYPE(*DEC) LEN(2 0)
             DCL        VAR(&RPEX)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&RPER)  TYPE(*DEC) LEN(2 0)

/* Henter verdier i fra LDA.                                         */

             RTVDTAARA  DTAARA(*LDA (863 1))  RTNVAR(&BTCH)
             RTVDTAARA  DTAARA(*LDA (300 2))  RTNVAR(&RAPX)
             RTVDTAARA  DTAARA(*LDA (312 2))  RTNVAR(&RPEX)
             CHGVAR     VAR(&RAPP) VALUE(&RAPX)
             CHGVAR     VAR(&RPER) VALUE(&RPEX)

/* Varselbilde 2                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(8)
             CHGVAR     VAR(&WAPO) VALUE(26)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')
             CHGVAR     VAR(&MLD2) VALUE('Beregning pågår..........')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

             CALL       PGM(RR109R) PARM(&RAPP &RPER)

/* Varselbilde 3                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(12)
             CHGVAR     VAR(&WAPO) VALUE(18)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')
             CHGVAR     VAR(&MLD2) VALUE('Utskrift pågår...........')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('RR628P' &BTCH)

/* Utskrift                                                          */

             CALL       PGM(RR628R)

/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDBRKMSG  MSG('ASOKON: Rutinen for utskrift av resultat +
                        rapport er ferdig') TOMSGQ(&WSID)
             ENDDO

             CALL       PGM(AP606C)    PARM('RR628P')

 END:        ENDPGM
