             PGM        PARM(&FIRM &STDK)

             DCL        VAR(&FIRM) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&STDK) TYPE(*DEC) LEN(6 0)

/* Test om PROFF-kunde                                               */

             CHKOBJ     OBJ(*LIBL/IKODPF) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/* NB! Programmet RS205R ligger i ASSERV */

             CALL       PGM(RS250R) PARM(&FIRM &STDK) /* Slår opp i +
                          IKODPF for å finne std.kunde */

 ENDPGM:     ENDPGM
