/* ***************************************************************** */
/*   RT002C                                                          */
/*                                                                   */
/*   Start danne total kontoplan DEL 2 - JOBBKØ                      */
/*                                                                   */
/*********************************************************************/
                                                                  /**/
             PGM
/*------------------------------------------------------------------*/
                                                                 /**/
/*           DCL        VAR(&WWANTK) TYPE(*CHAR) LEN(2)             */
/*           CHGVAR     VAR(&WWANTK) VALUE(%SST(*LDA 137 2))        */
             CLRPFM     FILE(RTOTPF)
             CALL       PGM(RT005R)
             CALL       PGM(RT010R)
             CALL       PGM(RT015R)
             CALL       PGM(RT020R)
 END:        ENDPGM
