/* ***************************************************************** */
/*                                                                   */
/*   Start danne total kontoplan                                     */
/*                                                                   */
/*********************************************************************/
                                                                   /**/
             PGM
/*------------------------------------------------------------------*/
/*                                                                   */
             DCL        VAR(&WWANTK) TYPE(*CHAR) LEN(2)
/*           DCL        VAR(&BRUKER) TYPE(*CHAR) LEN(10)            */
             DCL        VAR(&WWSID) TYPE(*CHAR) LEN(10)
/*           RTVJOBA    JOB(&WWSID) USER(&BRUKER)                   */
/*           CHGDTAARA  DTAARA(*LDA (543 10)) VALUE(&BRUKER)        */
             CHGDTAARA  DTAARA(*LDA (35 10)) VALUE(&WWSID)
/*                                                                   */
             CALL       PGM(rt001R)
             IF         COND(%SST(*LDA 801 1) *EQ '1') THEN(GOTO +
                          CMDLBL(END)) /* Avslutt */
/*                                                                   */
             GOTO       CMDLBL(OK)
/*------------------------------------------------------------------*/
 MSG:        SNDPGMMSG  MSG('Feil i program RT001C, kontakt +
                          systemansvarlig.')
             GOTO       CMDLBL(END)
                                                                 /**/
 OK:         SBMJOB     CMD(CALL PGM(RT002C)) JOB(TOTALKPLAN) +
                          JOBD(*LIBL/QBATCH) JOBQ(QS36EVOKE) HOLD(*NO)
             SNDPGMMSG  MSG('Danne total kontoplan sendt til jobbkø')
             GOTO       CMDLBL(END)
                                                                   /**/
 END:        ENDPGM
