/* __________________________________________________________________ */
/* Denne jobben skal kjøre IP-program og kalle RX001C fra  bibl.liste */
/*                                                                    */
/* __________________________________________________________________ */

             PGM        parm(&fgr &firm)
             dcl        var(&fgr)    type(*char) len(3)
             dcl        var(&firm)   type(*char) len(3)
             dcl        var(&usr)    type(*char) len(10)
             dcl        var(&ipp)    type(*char) len(10)
             dcl        var(&fil)    type(*char) len(20)
             dcl        var(&bane)   type(*char) len(70)
             dcl        var(&job)    type(*char) len(10)
             dcl        var(&min)    type(*char) len(3)

             chgvar     var(&usr)    value('ASP_' *cat &fgr)
             chgvar     var(&ipp)    value('IP' *cat &usr)
             addlible   lib(aspgplk)
             monmsg     msgid(cpf2103)
             call       pgm(&ipp)
             chgdtaara  dtaara(*lda (931 3)) value(&fgr)
             chgdtaara  dtaara(*lda (944 3)) value(&firm)

             call       pgm(rx000r) parm(&fil &bane &firm &job)
             CALL       PGM(RX001C) PARM(&fil &bane)

/*   SJekk om jobben skal gjenntas og ev. sett opp neste sending i jobscde  */

             CALL       PGM(RX002R) PARM(&firm &MIN)
             if         cond(&min *ne ' ') then(do)
               call     pgm(rx002c) parm(&fgr &min)
             enddo
END:
             ENDPGM
