             PGM

             DCLF       FILE(RY899D)

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10)

             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

             RTVJOBA    JOB(&WJOB)

/* Viser bilde                                                       */

 BILDE:      SNDRCVF    RCDFMT(A1BLD)

/* F3/F12                                                            */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

             IF         COND(&DLIB *EQ ' ') THEN(GOTO CMDLBL(BILDE))

/* Oppdaterer database fra 5.40 til 5.50                             */

             CHGCURLIB  CURLIB(&DLIB)

             DLTF       FILE(&DLIB/JVPKL3)
             MONMSG     MSGID(CPF2105)

             CRTLF      FILE(&DLIB/JVPKL3) SRCFILE(QDDFSRC) +
                          SRTSEQ(*LANGIDUNQ) LANGID(NOR)

             DLTF       FILE(&DLIB/JVPRL4)
             MONMSG     MSGID(CPF2105)

             CRTLF      FILE(&DLIB/JVPRL4) SRCFILE(QDDFSRC) +
                          SRTSEQ(*LANGIDUNQ) LANGID(NOR)

             CALL       PGM(AG905C) PARM('JEANPF' &DLIB &NULL)

/* Melding                                                           */

             SNDBRKMSG  MSG('Oppdateringen til VA versjon 5.50 er +
                          ferdig') TOMSGQ(&WJOB)

 ENDPGM:     ENDPGM
