             PGM

             DCLF       FILE(RY892D)

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10)

             DCL        VAR(&NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

             RTVJOBA    JOB(&WJOB)

/* Viser bilde                                                       */

 BILDE:      SNDRCVF    RCDFMT(A1BLD)

/* F3/F12                                                            */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

             IF         COND(&DLIB *EQ ' ') THEN(GOTO CMDLBL(BILDE))

/* Oppdaterer database fra 5.60 til 6.10                             */

             CHGCURLIB  CURLIB(&DLIB)

/*           DLTF       FILE(&DLIB/JVPKL3)                           */
/*           MONMSG     MSGID(CPF2105)                               */
/*                                                                   */
/*           CRTLF      FILE(&DLIB/JVPKL3) SRCFILE(QDDFSRC) +        */
/*                        SRTSEQ(*LANGIDUNQ) LANGID(NOR)             */
/*                                                                   */
/*                                                                   */
             DLTF       FILE(&DLIB/JLEVL3)
             MONMSG     MSGID(CPF2105)
/*                                                                   */
             DLTF       FILE(&DLIB/JLEVL2)
             MONMSG     MSGID(CPF2105)
/*                                                                   */
             DLTF       FILE(&DLIB/JLEVLU)
             MONMSG     MSGID(CPF2105)
/*                                                                   */
             DLTF       FILE(&DLIB/JLEVLR)
             MONMSG     MSGID(CPF2105)
/*                                                                   */
             RNMOBJ     OBJ(&DLIB/JLEVL1) OBJTYPE(*FILE) +
                          NEWOBJ(JLEVL1_560)
/*                                                                   */
             RNMOBJ      OBJ(&DLIB/JLEVPF) OBJTYPE(*FILE) +
                            NEWOBJ(JLEVPF_560)


             CALL       PGM(AG905C) PARM('JLEVPF' &DLIB &NULL)
             CALL       PGM(AG905C) PARM('JLKPPF' &DLIB &NULL)
             CALL       PGM(AG905C) PARM('JPFAPF' &DLIB &NULL)

             CALL       PGM(RY836R)  /* Feleter fraa JLEVPF til JLKPPF*/


/* kopierer fra ver. 5.60 til 6.10 for 2 filer */

             CPYF       FROMFILE(&DLIB/JLEVPF_560) +
                          TOFILE(&DLIB/JLEVPF) MBROPT(*ADD) +
                          FMTOPT(*MAP *DROP)

/* Melding                                                           */

             SNDBRKMSG  MSG('Oppdateringen til VA versjon 6.10 er +
                          ferdig') TOMSGQ(&WJOB)

 ENDPGM:     ENDPGM
