             PGM

             DCLF       FILE(RY994D)

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ELIB) TYPE(*CHAR) LEN(10)

             RTVJOBA    CURLIB(&ELIB)

/* Viser bilde                                                       */

 BILDE:      SNDRCVF    RCDFMT(A1BLD)

/* F3/F12                                                            */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

             IF         COND(&ELIB *EQ ' ') THEN(GOTO CMDLBL(BILDE))

/* Submitter kall av konverteringsjobb                               */

             SBMJOB     CMD(CALL PGM(RY995C) PARM(&DLIB &ELIB)) +
                          JOB(VA_540) JOBPTY(6) OUTPTY(6)

 ENDPGM:     ENDPGM
