             PGM        PARM(&PARM)

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(64)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&MEMBX)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&MEMB)     TYPE(*DEC)  LEN(5 0)
             DCL        VAR(&WMM1)     TYPE(*CHAR) LEN(10) VALUE('SFA   ')

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('SB611 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Behandling starter                                                */

             IF         COND(&BTCH *EQ '1') THEN+
                         (SBMJOB CMD(CALL PGM(SB611C) PARM(&PARM)      ) +
                          JOB(BUDSJETT) MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/SB611C) PARM(&PARM))

 END:        ENDPGM
