             PGM        PARM(&WSPARM)

/* Initiering av parametre.                                          */

             DCL        VAR(&WSPARM) TYPE(*CHAR) LEN(64)
/*                                                                   */
/* Kaller opp program for overføring av budsjett                     */
/*                                                                   */
             CALL       PGM(SBOVFR)  PARM(&WSPARM)
/*                                                                   */
 END:        ENDPGM
