             PGM        PARM(&TYPE &WMM1)

/* Definere parametere og variabler                                  */

             DCL        VAR(&BTCH)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&KODE)  TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&WSID)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&WALI)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&WAPO)  TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&MLD1)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&MLD2)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&WMM1)  TYPE(*CHAR) LEN(10)

/* Henter verdier i fra LDA.                                         */

             RTVDTAARA  DTAARA(*LDA (863 1))  RTNVAR(&BTCH)

/* Varselbilde                                                       */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(6)
             CHGVAR     VAR(&WAPO) VALUE(30)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')
             CHGVAR     VAR(&MLD2) VALUE('Utplukk pågår ...........')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('SF600P' &BTCH)

/* Plukk ut poster                                                   */

             OVRDBF     FILE(SKWWPF) MBR(&WMM1)
             OVRDBF     FILE(SKPWPF) MBR(&WMM1)
             CALL       PGM(SF600R) PARM(&TYPE &KODE)

             CALL       PGM(AP606C)    PARM('SF600P')

/* Varselbilde 2                                                     */

             IF         COND(&BTCH *NE '1') THEN(DO)
             CHGVAR     VAR(&WALI) VALUE(8)
             CHGVAR     VAR(&WAPO) VALUE(26)
             CHGVAR     VAR(&MLD1) VALUE('Vennligst vent litt......')
             CHGVAR     VAR(&MLD2) VALUE('Utskrift pågår...........')
             CALL       PGM(AA006C)  PARM(&WALI &WAPO &MLD1 &MLD2)
             ENDDO

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('SF611P' &BTCH)

/* Utskrift                                                          */

             OVRDBF     FILE(SKWWPF) MBR(&WMM1)
             CALL       PGM(SF611R) PARM(&TYPE)

             CALL       PGM(AP606C)    PARM('SF611P')

/* Slett ?                                                           */

             CALL       PGM(SF699R) PARM(&TYPE)
/*                                                                   */
             DLTOVR     FILE(SKWWPF)
             RMVM       FILE(SKWWPF) MBR(&WMM1)
             MONMSG     MSGID(CPF3200)
/*                                                                   */
             DLTOVR     FILE(SKPWPF)
             RMVM       FILE(SKPWPF) MBR(&WMM1)
             MONMSG     MSGID(CPF3200)

/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDMSG     MSG('ASSTAT  Rutinen for utskrift av stati+
                        stikk er ferdig') TOMSGQ(&WSID)
             ENDDO
 END:        ENDPGM
