             PGM        PARM(&PARM)

             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(64)
             DCL        VAR(&VARI)     TYPE(*CHAR) LEN(1)

/* Call til program for utskrift                                     */

             CHGVAR VAR(&VARI) VALUE(%SST(&PARM 35 1))

             IF         COND(&VARI *EQ '2') THEN(DO)
             CALL       PGM(SF653C) PARM(&PARM)
             ENDDO

             IF         COND(&VARI *EQ '1') THEN(DO)
             CALL       PGM(SF654C) PARM(&PARM)
             ENDDO

             ENDPGM
