             PGM        PARM(&PARM)

/* Initiering av parametere                                          */

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(64)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('SF653P' &BTCH)

/* Kaller opp program for kontrolliste                               */

             CALL       PGM(SF653R)    PARM(&PARM)

             CALL       PGM(AP606C)    PARM('SF653P')
             ENDPGM
