             PGM        PARM(&TYPE)

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&MEMBX)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&MEMB)     TYPE(*DEC)  LEN(5 0)
             DCL        VAR(&WMM1)     TYPE(*CHAR) LEN(10) VALUE('SFA   ')

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('SF661 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

             RTVDTAARA  DTAARA(*LDA (864 5))  RTNVAR(&MEMBX)

             CHGVAR     VAR(&MEMB) VALUE(&MEMBX)
             CHGVAR     VAR(%SST(&WMM1 4 5)) VALUE(&MEMB)

/* Behandling starter                                                */

             IF         COND(&BTCH *EQ '1') THEN+
                         (SBMJOB CMD(CALL PGM(SF661C) PARM(&TYPE &WMM1)) +
                          JOB(STAT_PC) MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/SF661C) PARM(&TYPE &WMM1))

 END:        ENDPGM
