             PGM        PARM(&LIST &FILE &FGRP)

/* Initiering av parametre.                                          */

             DCL        VAR(&LIST) TYPE(*CHAR) LEN(40)
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(12)
             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(20)

/* Kaller styreprogram                                               */

             SBMJOB     CMD(CALL PGM(SF852C) PARM(&LIST &FILE +
                          &FGRP)) JOB(STATFIL) MSGQ(*NONE)

 END:        ENDPGM
