             PGM        PARM(&FILE &FLDR &FEIL)

/* Initiering av parametre.                                          */

             DCL        VAR(&FILE) TYPE(*CHAR) LEN(12)
             DCL        VAR(&FLDR) TYPE(*CHAR) LEN(20)
             DCL        VAR(&FEIL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&tild)  TYPE(*CHAR) LEN(25)

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(FEIL))

/* Initierer feil-flagg                                              */

             CHGVAR     VAR(&FEIL) VALUE('0')

/* Tømmer fil                                                        */

             CLRPFM     FILE(SONOPF)

/* Kopierer innhold til PC-fil i mappe                               */

/*           CPYTOPCD   FROMFILE(SONOPF) TOFLR(&FLDR) TODOC(&FILE) + */
/*                        REPLACE(*YES)                              */
             chgvar     var(&tild) value(&file)
             call       pgm(asptostmf) +
                        parm('SONOPF    ' +
                             'SONOPF    ' +
                             &FLDR +
                             &tild   +
                             '   ')

             GOTO       CMDLBL(END)

 FEIL:       CHGVAR     VAR(&FEIL) VALUE('1')

 END:        ENDPGM
