             PGM        PARM(&FGRP &FIRM)

/* Definering av parametre                                           */

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)

/* Definering av variable                                            */

             DCL        VAR(&CURL) TYPE(*CHAR) LEN(10)

/* Setter current library                                            */

             CHGVAR     VAR(&CURL) VALUE('ADB' *CAT &FGRP)

             CHGCURLIB  CURLIB(&CURL)

/* Utgår!   Overstyrer til innsamlingsfil i ADBKMM                            */

/*           OVRDBF     FILE(SOS1PF) TOFILE(ADBKMM/SOS1PF)                    */
             OVRDBF     FILE(SOS1PF) TOFILE(ADBS01/SOS1PF)
/*           OVRDBF     FILE(SOS1L1) TOFILE(ADBKMM/SOS1L1)                    */
             OVRDBF     FILE(SOS1L1) TOFILE(ADBS01/SOS1L1)

/* Kaller innsamlingsprogram                                         */

/*           CALL       PGM(NXC_KMM/SF872R) PARM(&FGRP &FIRM)              */
             CALL       PGM(SF872R) PARM(&FGRP &FIRM)

 END:        ENDPGM
