             PGM        PARM(&FGRP &FIRM)

/* Definering av parametre                                           */

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FIRM) TYPE(*CHAR) LEN(3)

/* Definering av variable                                            */

             DCL        VAR(&CURL) TYPE(*CHAR) LEN(10)

/* Setter biblioteksliste                                            */

             CALL       PGM(AA724C) PARM(&FGRP)

/* Setter current library                                            */

             CHGVAR     VAR(&CURL) VALUE('ADB' *CAT &FGRP)

             CHGCURLIB  CURLIB(&CURL)

/* Kaller innsamlingsprogram                                         */

             CALL       PGM(SF871R) PARM(&FGRP &FIRM)

 END:        ENDPGM
