             PGM
/*                                                                   */
/* 120215 BOF : utvidet med BM Skyggestatistikk                      */
/*                                                                   */
             DCLF       FILE(SG001D)
/*                                                                   */
             DCL        VAR(&A1VA01) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA02) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA04) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA05) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA06) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA07) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA08) TYPE(*CHAR) LEN(1)
/*                                                                   */
             DCL        VAR(&A1VA11) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA12) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA13) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA14) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA15) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA16) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1VA17) TYPE(*CHAR) LEN(1)
/*                                                                   */
             DCL        VAR(&A1NULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&A1FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&APLEVL) TYPE(*CHAR) LEN(2)
             DCL        VAR(&APOKOK) TYPE(*CHAR) LEN(2)
/*                                                                   */
/* Kontrollere brukertilgang                                         */
/*                                                                   */
             CHGVAR     VAR(&APLEVL) VALUE('40')
             CHGVAR     VAR(&APOKOK) VALUE('  ')
             CALL       PGM(AA050C)  PARM(&APLEVL &APOKOK)
             IF         COND(&APOKOK *NE 'OK') THEN(DO)
             CALL       PGM(AA004C)
             GOTO       CMDLBL(ENDPGM)
             ENDDO
/*                                                                   */
/*                                                                   */
             SNDRCVF    RCDFMT(A1BLD)
/*                                                                   */
/* F3 + F12                                                          */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/* Genererer de valgte registere                                     */
/*                                                                   */
             IF         COND(&A1VA01 *EQ '1') THEN(DO)
             CALL       PGM(SG110C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA02 *EQ '1') THEN(DO)
             CALL       PGM(SG120C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA03 *EQ '1') THEN(DO)
             CALL       PGM(SG130C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA04 *EQ '1') THEN(DO)
             CALL       PGM(SG140C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA05 *EQ '1') THEN(DO)
             CALL       PGM(SG150C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA06 *EQ '1') THEN(DO)
             CALL       PGM(SG160C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA07 *EQ '1') THEN(DO)
             CALL       PGM(SG170C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA08 *EQ '1') THEN(DO)
             CALL       PGM(SG180C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA09 *EQ '1') THEN(DO)
             CALL       PGM(SG190C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA10 *EQ '1') THEN(DO)
             CALL       PGM(SG290C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA11 *EQ '1') THEN(DO)
             CALL       PGM(SG210C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA12 *EQ '1') THEN(DO)
             CALL       PGM(SG220C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA13 *EQ '1') THEN(DO)
             CALL       PGM(SG230C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA14 *EQ '1') THEN(DO)
             CALL       PGM(SG240C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA15 *EQ '1') THEN(DO)
             CALL       PGM(SG250C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA16 *EQ '1') THEN(DO)
             CALL       PGM(SG260C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
             IF         COND(&A1VA17 *EQ '1') THEN(DO)
             CALL       PGM(SG314C) PARM(&A1FGRP &A1NULL)
             ENDDO
/*                                                                   */
 ENDPGM:     ENDPGM
