/*                                                                   */
/*           Generere   KUNDE-STATISTIKK-REGISTER                    */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)

             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASSTAT')

             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('SSTABF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('SSTAPF')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('SSTAL1')
             DCL        VAR(&WPRGL2) TYPE(*CHAR) LEN(6) VALUE('SSTAL2')
             DCL        VAR(&WPRGL3) TYPE(*CHAR) LEN(6) VALUE('SSTAL3')
             DCL        VAR(&WPRGL4) TYPE(*CHAR) LEN(6) VALUE('SSTAL4')
             DCL        VAR(&WPRGL5) TYPE(*CHAR) LEN(6) VALUE('SSTAL5')
             DCL        VAR(&WPRGL6) TYPE(*CHAR) LEN(6) VALUE('SSTAL6')
             DCL        VAR(&WPRGL7) TYPE(*CHAR) LEN(6) VALUE('SSTAL7')
             DCL        VAR(&WPRGL8) TYPE(*CHAR) LEN(6) VALUE('SSTAL8')
             DCL        VAR(&WPRGL9) TYPE(*CHAR) LEN(6) VALUE('SSTAL9')
             DCL        VAR(&WPRGLA) TYPE(*CHAR) LEN(6) VALUE('SSTALA')
             DCL        VAR(&WPRGLB) TYPE(*CHAR) LEN(6) VALUE('SSTALB')
             DCL        VAR(&WPRGLC) TYPE(*CHAR) LEN(6) VALUE('SSTALC')
             DCL        VAR(&WPRGLD) TYPE(*CHAR) LEN(6) VALUE('SSTALD')
             DCL        VAR(&WPRGLE) TYPE(*CHAR) LEN(6) VALUE('SSTALE')
             DCL        VAR(&WPRGLF) TYPE(*CHAR) LEN(6) VALUE('SSTALF')
             DCL        VAR(&WPRGLG) TYPE(*CHAR) LEN(6) VALUE('SSTALG')
             DCL        VAR(&WPRGLH) TYPE(*CHAR) LEN(6) VALUE('SSTALH')
             DCL        VAR(&WPRGLI) TYPE(*CHAR) LEN(6) VALUE('SSTALI')
             DCL        VAR(&WPRGLJ) TYPE(*CHAR) LEN(6) VALUE('SSTALJ')
             DCL        VAR(&WPRGLK) TYPE(*CHAR) LEN(6) VALUE('SSTALK')
             DCL        VAR(&WPRGLL) TYPE(*CHAR) LEN(6) VALUE('SSTALL')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('SSTALU')
             DCL        VAR(&WPRGLX) TYPE(*CHAR) LEN(6) VALUE('SSTALX')

/* Setter bibliotek til current                                      */

             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)

/* Kalle opp fellesprogram                                           */

             CALL       PGM(AG122C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGL1 &WPRGL2 +
                          &WPRGL3 &WPRGL4 &WPRGL5 &WPRGL6 &WPRGL7 +
                          &WPRGL8 &WPRGL9 &WPRGLA &WPRGLB &WPRGLC +
                          &WPRGLD &WPRGLE &WPRGLF &WPRGLG &WPRGLH +
                          &WPRGLI &WPRGLJ &WPRGLK &WPRGLL &WPRGLU +
                          &WPRGLX)

 ENDPGM:     ENDPGM
