/*                                                                   */
/*           Generere   KUNDE-BUDSJETTNIVÅ-REGISTER                  */
/*                                                                   */
 STRPGM:     PGM        PARM(&WPFGRP &WPNULL)
/*                                                                   */
             DCL        VAR(&WPFGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPNULL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WPDBIB) TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&WPSBIB) TYPE(*CHAR) LEN(6) VALUE('ASSTAT' )
/*                                                                   */
             DCL        VAR(&WPRGBF) TYPE(*CHAR) LEN(6) VALUE('SKNIBF')
             DCL        VAR(&WPRGPF) TYPE(*CHAR) LEN(6) VALUE('SKNIPF')
             DCL        VAR(&WPRGLU) TYPE(*CHAR) LEN(6) VALUE('SKNILU')
             DCL        VAR(&WPRGL1) TYPE(*CHAR) LEN(6) VALUE('SKNIL1')
/*                                                                   */
/*           Setter bibliotek til current                            */
/*                                                                   */
             CHGVAR     VAR(%SST(&WPDBIB 4 3)) VALUE(&WPFGRP)
             CHGCURLIB  CURLIB(&WPDBIB)
/*                                                                   */
/*           Kalle opp fellesprogram                                 */
/*                                                                   */
             CALL       PGM(AG101C) PARM(&WPFGRP &WPNULL &WPDBIB +
                          &WPSBIB &WPRGBF &WPRGPF &WPRGLU &WPRGL1)
/*                                                                   */
 ENDPGM:     ENDPGM
