             PGM        PARM(&PARM &JOBQ)

             DCL        VAR(&JOBQ)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(96)

/* Kaller opp program for oppdatering (Direkte)                      */

             IF         COND(&JOBQ *NE '1') THEN(DO)
             CALL       PGM(SI528R) PARM(&PARM)
             ENDDO

/* Kaller opp program for oppdatering (Via jobbkø)                   */

             IF         COND(&JOBQ *EQ '1') THEN(DO)
             SBMJOB     CMD(CALL PGM(SI528R) PARM(&PARM)) +
                          JOB(ENDR_STAT)
             ENDDO

             ENDPGM
