             PGM        PARM(&TYPE)

/* Definere parametere og variabler                                  */

             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&TYPE)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&MEMBX)    TYPE(*CHAR) LEN(5)
             DCL        VAR(&MEMB)     TYPE(*DEC)  LEN(5 0)
             DCL        VAR(&WMM1)     TYPE(*CHAR) LEN(10) VALUE('FSA   ')

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('SI611 ' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

             RTVDTAARA  DTAARA(*LDA (864 5))  RTNVAR(&MEMBX)

             CHGVAR     VAR(&MEMB) VALUE(&MEMBX)
             CHGVAR     VAR(%SST(&WMM1 4 5)) VALUE(&MEMB)

/* Tømm arbeidsfiler                                                 */

             CLRPFM     FILE(SLWWPF) MBR(&WMM1)
             MONMSG     MSGID(CPF3100)

             CLRPFM     FILE(SLPWPF) MBR(&WMM1)
             MONMSG     MSGID(CPF3100)

/* Bygger membere dersom de ikke finnes                              */

             CHKOBJ     OBJ(SLWWPF) OBJTYPE(*FILE) MBR(&WMM1)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(SLWWPF) MBR(&WMM1) TEXT('Poster til +
                          statistikk')
             ENDDO

             CHKOBJ     OBJ(SLPWPF) OBJTYPE(*FILE) MBR(&WMM1)
             MONMSG     MSGID(CPF9815) EXEC(DO)
             ADDPFM     FILE(SLPWPF) MBR(&WMM1) TEXT('Parameter +
                          statistikk')
             ENDDO

/* Kopier parameter                                                  */

             OVRDBF     FILE(SLPWPF) MBR(&WMM1)
             CALL       PGM(SI610R) PARM(&TYPE)

/* Behandling starter                                                */

             IF         COND(&BTCH *EQ '1') THEN+
                         (SBMJOB CMD(CALL PGM(SI611C) PARM(&TYPE &WMM1)) +
                          JOB(STATISTIKK) MSGQ(*NONE))
             ELSE       CMD(CALL PGM(*LIBL/SI611C) PARM(&TYPE &WMM1))

 END:        ENDPGM
