             PGM        parm(&fil &pf)

/*                                                                   */

             DCL        VAR(&fil)   TYPE(*char)  LEN(10)
             DCL        VAR(&tfil)  TYPE(*char)  LEN(10)
             DCL        VAR(&wfil)  TYPE(*char)  LEN(10)
             DCL        VAR(&pf)    TYPE(*char)  LEN(2)

             dclf       file(*libl/genfst)

             chgvar     var(&pf)    value(' ')
             chgvar     var(&wfil)  value(%sst(&fil 1 4) *cat 'PF')
rcv:         rcvf
             monmsg     msgid(cpf0864) exec(goto endpgm)
             chgvar     var(&tfil)   value(%sst(&table 1 6))
             if         cond(&tfil *eq &wfil) then(do)
               chgvar   var(&pf)    value('PF')
               goto     cmdlbl(endpgm)
             enddo

             goto       cmdlbl(rcv)

 endpgm:
             endpgm
