             PGM        PARM(&STAT)

/* Initiering av parametre.                                          */

             DCL        VAR(&STAT) TYPE(*CHAR) LEN(1)

/* Sjekker om switch register finnes og setter status              */

             CHKOBJ     OBJ(SKTIST) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9801) EXEC(DO)
                CHGVAR     VAR(&STAT) VALUE('1')
             ENDDO

/* Sjekker tilgang på switch register og setter status              */

             ALCOBJ     OBJ((SKTIST *FILE *SHRRD))
             MONMSG     MSGID(CPF1085) EXEC(DO)
                CHGVAR     VAR(&STAT) VALUE('1')
             ENDDO

 END:        ENDPGM
