             PGM
             DCLF       FILE(SM00)
             DCL        VAR(&APFNAV) TYPE(*CHAR) LEN(30)
/*6.20*/     dcl        var(&menu)     type(*char) len(10)
/*6.20*/     dcl        var(&stat)     type(*char) len(1)
/*                                                                   */
             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)
/*                                                                   */
/* Sette opp driftsmiljø                                             */
/*                                                                   */
             CALL       PGM(SSETUP)
/*                                                                   */
 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             SNDRCVF    RCDFMT(A1MNU)
/*                                                                   */
/* Tester på funksjonstaster                                         */
/*                                                                   */
/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* F3                                                                */
/*6.20       IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))        */
/*6.20*/     if         cond(&in03) then(do)
/*6.20*/     chgvar     var(&stat)  value('0')
/*6.20*/     chgvar     var(&menu)  value('SM00      ')
/*6.20*/     call       pgm(ax720r) parm(&menu &stat)
/*6.20*/     if         cond(&stat *eq '1') then(do)
/*6.20*/     goto cmdlbl(start)
/*6.20*/     enddo
/*6.20*/     goto       cmdlbl(endpgm)
/*6.20*/     enddo

/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)
/*                                                                   */
/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)
/*                                                                   */
/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/* F22                                                               */
             IF         COND(&IN22) THEN(DO)
             CALL       PGM(FINFO)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
             CALL       PGM(SM10)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(SM20)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 7                                                            */
             IF         COND(&VALG *EQ 7) THEN(DO)
             CALL       PGM(FM70)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO
/*                                                                   */
/* Gå til start                                                      */
             GOTO       CMDLBL(START)
/*                                                                   */
 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)
/*                                                                   */
/* Slutt                                                             */
 ENDPGM:     ENDPGM
