/*                                                                   */
/*-------------------------------------------------------------------*/
/* Program for å slette alt SQL, dvs trigger, index osv            */
/*                                                                   */
/* eks: CALL SQLDLT PARM('630' 'ADBLVR630' 'A40' 'VVARPF' '3')       */
/*                                                                   */
/*   hva:                                                            */
/*        0:  gjør alt: opprett SP, kjør, slett SP                   */
/*        1:  opprett SP                                             */
/*        2:  slett SP                                               */
/*        3:  kjør SP                                                */


             PGM        parm(&FGRP_P &LVRB_P &ENVB_P &TBLE_P &HVA_P)

 /* Parametre                                                         */
             DCL        VAR(&FGRP_P) TYPE(*CHAR) LEN(3)
             DCL        VAR(&LVRB_P) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ENVB_P) TYPE(*CHAR) LEN(3)
             DCL        VAR(&TBLE_P) TYPE(*CHAR) LEN(10)
             DCL        VAR(&HVA_P)  TYPE(*CHAR) LEN(1)

             SBMJOB     CMD( CALL PGM(IDXDLT) PARM(&FGRP_P &LVRB_P &ENVB_P +
                          &TBLE_P &HVA_P) ) JOBPTY(3) JOBQ(QGPL/EG_SQL) +
                          JOB(SQLIXDLALL)

             SBMJOB     CMD( CALL PGM(TRGDLT) PARM(&FGRP_P &TBLE_P &HVA_P) +
                          ) JOBPTY(3) JOBQ(QGPL/EG_SQL) JOB(SQLTGDLALL)

             SBMJOB     CMD( CALL PGM(VIEWDLT) PARM(&FGRP_P  &TBLE_P +
                          &HVA_P) ) JOBPTY(3) JOBQ(QGPL/EG_SQL) +
                          JOB(SQLVWDLALL)

 END:        ENDPGM

