             PGM        PARM(&WACTLI &WACTPO &M1MLD1 &M1MLD2)

             DCLF       FILE(ss006D)
             DCL        VAR(&M1MLD1)   TYPE(*CHAR) LEN(30)
             DCL        VAR(&M1MLD2)   TYPE(*CHAR) LEN(30)
             DCL        VAR(&wactli)   TYPE(*dec)  LEN(2 0)
             DCL        VAR(&wactpo)   TYPE(*dec)  LEN(2 0)
/*           MONMSG     MSGID(CPF0000) EXEC(GOTO START)    */

 START:      SNDF       RCDFMT(M1WIN)

 ENDPGM:     ENDPGM
