
             PGM        PARM(&STOP)

/* Definering av parametre                                           */

             DCL        VAR(&STOP)     TYPE(*CHAR) LEN(1)

/* Definering av variable                                            */

             DCL        VAR(&LEVL)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&OKOK)     TYPE(*CHAR) LEN(2)

/* Kontrollere brukertilgang                                         */

             CHGVAR     VAR(&LEVL)     VALUE('40')
             CHGVAR     VAR(&OKOK)     VALUE('  ')
             CALL       PGM(AA050C)    PARM(&LEVL &OKOK)
             IF         COND(&OKOK *NE 'OK') THEN(DO)
             CHGVAR     VAR(&STOP)     VALUE('1')
             CALL       PGM(AA004C)
             GOTO       CMDLBL(END)
             ENDDO

 END:        ENDPGM
