             PGM        parm(&svar &rutine)

/* Initiering av parametre.                                          */

             DCL        VAR(&FIRM)      TYPE(*CHAR) LEN(3)
             DCL        VAR(&SVAR)      TYPE(*CHAR) LEN(1)
             DCL        VAR(&rutine)    TYPE(*CHAR) LEN(50)
             DCL        VAR(&CO402_KEY) TYPE(*CHAR) LEN(50)
             DCL        VAR(&CO402_V1)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&CO402_V2)  TYPE(*CHAR) LEN(2048)
             DCL        VAR(&fgr)       TYPE(*CHAR) LEN(3)
             DCL        VAR(&fir)       TYPE(*dec)  LEN(3 0)
             DCL        VAR(&lag)       TYPE(*dec)  LEN(3 0)  value(0)

             RTVDTAARA  DTAARA(*LDA (944 3)) RTNVAR(&FIRM)
             CHGVAR     VAR(&CO402_KEY) VALUE(&rutine)
             rtvdtaara  dtaara(*lda (931 3)) rtnvar(&fgr)
             chgvar     var(&fir)       VALUE(&firm)
             CALL       PGM(CO402R) PARM(&FGR &fir &LAG &CO402_KEY +
                          &CO402_V1 &CO402_V2)

             CHGVAR     VAR(&svar) VALUE(&co402_v1)

 ENDPGM:     ENDPGM
