/*                                                                   */
/*-------------------------------------------------------------------*/
/* Program for å opprette triggere                                   */
/*                                                                   */
/* angi filgrupppe og *ALL eller tabellnavn og hva                   */
/*                                                                   */
/* eks: CALL TRGCRT PARM('630')                                      */
/* eks: CALL TRGCRT PARM('630' 'VVARPF')                             */
/* eks: CALL TRGCRT PARM('630' '*ALL')                               */
/* eks: CALL TRGCRT PARM('630' '*ALL' '3')                           */
/* eks: CALL TRGCRT PARM('630' '' '3')                               */
/*                                                                   */


             PGM        parm(&FGRP_P &TBLE_P &VER_P)

 /* Parametre                                                         */
             DCL        VAR(&FGRP_P)    TYPE(*CHAR) LEN(3)
             DCL        VAR(&TBLE_P)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&VER_P)     TYPE(*CHAR)  LEN(3)

             DCL        VAR(&DBIB)      TYPE(*CHAR) LEN(6) VALUE('ADB400')
             DCL        VAR(&VER)       TYPE(*DEC) LEN(3 0)
             DCL        VAR(&ENVB)      TYPE(*CHAR) LEN(3)

 /* Sjekk Parametre                                                    */
             IF         COND(&TBLE_P *EQ ' ') THEN(DO)
                CHGVAR     VAR(&TBLE_P) VALUE('*ALL')
             ENDDO

             IF         COND(&VER_P *EQ ' ') THEN(DO)
                RTVDTAARA  DTAARA(*LDA (1003 3)) RTNVAR(&ENVB)
                call       pgm(AR700R) parm(&ENVB &VER)
                CHGVAR     VAR(&VER_P) VALUE(%CHAR(&VER))
             ENDDO

 /* FGR  */
             CHGVAR     VAR(%SST(&DBIB 4 3)) VALUE(&FGRP_P)
             CHGCURLIB  CURLIB(&DBIB)

             RUNSQL     SQL('CALL ADB.SP_NEXSTEP_CREATE_TRG_' *CAT &VER_P +
                          *BCAT '(''' *cat &DBIB *bcat ''',''' *cat +
                          &TBLE_P *bcat ''')') COMMIT(*NONE) NAMING(*SYS)

 END:        ENDPGM

