
/* backup av ADBXXX filer ved varegruppe konvertering                */

             PGM

             DCL        VAR(&FGRP)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&BIBL)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&MLD3)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&MLD4)     TYPE(*CHAR) LEN(50)
             DCL        VAR(&SVAR)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN12)     TYPE(*DEC)  LEN(1 0)

/* Hente inn filgruppe/ databibliotek fra LDA                        */

             RTVDTAARA  DTAARA(*LDA (931 03)) RTNVAR(&FGRP)
             RTVDTAARA  DTAARA(*LDA (934  6)) RTNVAR(&BIBL)

/* Varselbilde med bekreftelse på om jobb skal settes i gang         */

             CHGVAR     VAR(&MLD3) +
                        VALUE('       er valgt som databibliotek      (Felles)')
             CHGVAR     VAR(&MLD4) +
                        VALUE('       Bekreft at dette er riktig !')
             CHGVAR     VAR(%SST(&MLD3 1 6)) VALUE(&BIBL)

             CALL       PGM(AA007R)    PARM(&MLD3 &MLD4 &SVAR &IN12)

             IF         COND(&IN12 *EQ 1 ) +
                          THEN(GOTO CMDLBL(ENDPGM))

             IF         COND(&SVAR *EQ ' ' *OR &SVAR *EQ 'J') +
                          THEN(GOTO CMDLBL(VIDERE))
             ELSE       CMD(GOTO CMDLBL(ENDPGM))

VIDERE:

             IF         COND(&FGRP *EQ '   ') THEN(DO)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

/*   START av ønskede rutiner pr. file-gruppe                        */
/*   ----------------------------------------                        */

/* Kaller opp felles underprogram                                    */

             CALL       PGM(TS802C) PARM(&FGRP)


ENDPGM:      ENDPGM
