             PGM

             DCLF       FILE(TS804D)

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10)

             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

             RTVJOBA    JOB(&WJOB)

/* Viser bilde                                                       */

 BILDE:      SNDRCVF    RCDFMT(A1BLD)

/* F3/F12                                                            */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

             IF         COND(&DLIB *EQ ' ') THEN(GOTO CMDLBL(BILDE))

/* BACKUP                                                            */


             CALL       PGM(TS805C) PARM(&DLIB)


 ENDPGM:     ENDPGM
