             PGM   parm(&LVRL)
/*                                                                   */
             DCL        VAR(&LVRL) TYPE(*CHAR) LEN(10)
/*                                                                   */
/*                                                                   */
/* Danner member i savfile                                         */
             CRTSAVF    FILE(TLS2_SAVF/&LVRL) TEXT(*BLANK)
/*                                                                   */
/* Backup av JVARPF                                                */
/*                                                                   */
             SAVOBJ     OBJ(JVARPF JBETPF JRAEPF JPFAPF JFORPF JFBEPF +
                          JVPKPF JVPRPF JVLEPF) LIB(&LVRL) DEV(*SAVF) +
                          SAVF(TLS2_SAVF/&LVRL)
             MONMSG     MSGID(CPF9812)

 ENDPGM:     ENDPGM
