             PGM   parm(&FGRP)
/*                                                                   */
             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10) VALUE('ADBxxx')
/*                                                                   */
             CHGVAR     VAR(%SST(&DLIB 4 3)) VALUE(&FGRP)
/*                                                                   */
/* Danner member i savfile                                         */
             CRTSAVF    FILE(VGRP_SAVF/&DLIB) TEXT(*BLANK)
/*                                                                   */
/* Backup av alle berørte filer   ADBXXX                           */
/*                                                                   */
             SAVOBJ     OBJ(FRABPF JPFAPF VVARPF VVASPF FODTPF +
                          SODTPF VVSOPF FDESPF FLVAPF VOTYPF VVGKPF +
                          VSDTPF LFDTPF LODTPF LBDTPF LTELPF LPSTPF +
                          SIDTPF SSTAPF SISTPF JBETPF JRAEPF BODTPF +
                          JFORPF) LIB(&DLIB) DEV(*SAVF) +
                          SAVF(VGRP_SAVF/&DLIB)
             MONMSG     MSGID(CPF9812)
             MONMSG     MSGID(CPF3701)

 ENDPGM:     ENDPGM
