             PGM   parm(&FGRP)
/*                                                                   */
             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10) VALUE('ADBxxx')
/*                                                                   */
             CHGVAR     VAR(%SST(&DLIB 4 3)) VALUE(&FGRP)
/*                                                                   */
/*                                                                   */
/* restore   alle berørte filer   ADBXXX                           */
/*                                                                   */

             RSTOBJ     OBJ(FRABPF JPFAPF VVARPF VVASPF FODTPF +
                          SODTPF VVSOPF FDESPF FLVAPF VOTYPF VVGKPF +
                          VSDTPF LFDTPF LODTPF LBDTPF LTELPF LPSTPF +
                          SIDTPF SSTAPF SISTPF JBETPF JRAEPF) +
                          SAVLIB(&DLIB) DEV(*SAVF) +
                          SAVF(VGRP_SAVF/&DLIB)
             monmsg     msgid(CPF3773)

 ENDPGM:     ENDPGM
