             PGM
             DCLF       FILE(TSM00)
             DCL        VAR(&APFNAV) TYPE(*CHAR) LEN(30)
/*                                                                   */
             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)
/*                                                                   */
/* Sette opp driftsmiljø                                             */
/*                                                                   */
             CALL       PGM(FSETUP)
/*                                                                   */
 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             SNDRCVF    RCDFMT(A1MNU)
/*                                                                   */
/* Tester på funksjonstaster                                         */
/*                                                                   */
/* F1                                                                */
             IF         COND(&IN01) THEN(DO)
             CALL       PGM(AA001C)
             CALL       PGM(FRMDØC)         /* MDØKON */
             CALL       PGM(FRMDOC)         /* MDOFAK */
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/* F5                                                                */
             IF         COND(&IN05) THEN(DO)
             CALL       PGM(AM80)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* F6                                                                */
             IF         COND(&IN06) THEN(DSPMSG)
/*                                                                   */
/* F10                                                               */
             IF         COND(&IN10) THEN(CALL QCMD)
/*                                                                   */
/* F12                                                               */
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/* F22                                                               */
             IF         COND(&IN22) THEN(DO)
             CALL       PGM(FINFO)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
                CALL       PGM(TS801C)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
                CALL       PGM(TS831C)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
                call       pgm(LKONV1)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 10                                                           */
             IF         COND(&VALG *EQ 10) THEN(DO)
                CALL       PGM(JK700R)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 11                                                           */
             IF         COND(&VALG *EQ 11) THEN(DO)
                CALL       PGM(LKONVLOG)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 12                                                           */
             IF         COND(&VALG *EQ 12) THEN(DO)
                CALL       PGM(TS804C)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 13                                                           */
             IF         COND(&VALG *EQ 13) THEN(DO)
                CALL       PGM(LKONVBET)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 14                                                           */
             IF         COND(&VALG *EQ 14) THEN(DO)
                CALL       PGM(TS845R)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 15                                                           */
             IF         COND(&VALG *EQ 15) THEN(DO)
                CALL       PGM(LKONVFRAKT)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 16                                                           */
             IF         COND(&VALG *EQ 16) THEN(DO)
                CALL       PGM(LKONVPASL)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 17                                                           */
             IF         COND(&VALG *EQ 17) THEN(DO)
                CALL       PGM(TS841C)
                GOTO       CMDLBL(START)
             ENDDO

/*                                                                   */
/* Valg 18                                                           */
             IF         COND(&VALG *EQ 18) THEN(DO)
                CALL       PGM(TS851C)
                GOTO       CMDLBL(START)
             ENDDO

/*                                                                   */
/* Valg 19                                                           */
             IF         COND(&VALG *EQ 19) THEN(DO)
                CALL       PGM(LKONVVALEV)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 20                                                           */
             IF         COND(&VALG *EQ 20) THEN(DO)
                CALL       PGM(JK703R)
                GOTO       CMDLBL(START)
             ENDDO

/*                                                                   */
/* Valg 21                                                           */
             IF         COND(&VALG *EQ 21) THEN(DO)
                CALL       PGM(LKONVBYT)
                GOTO       CMDLBL(START)
             ENDDO

/*                                                                   */
/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO
/*                                                                   */
/* Gå til start                                                      */
             GOTO       CMDLBL(START)
/*                                                                   */
 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)
/*                                                                   */
/* Slutt                                                             */
 ENDPGM:     ENDPGM
