             PGM

             dcl        var(&m1)   type(*char)   len(50) +
                        value('Disabler alle brukere i miljøet unntatt ASP*')
             dcl        var(&m2)   type(*char)   len(50) +
                        value('Svar -N- dersom du ønsker å avbryte kkjøring')
             dcl        var(&av)   type(*dec)    len(1 0)
             dcl        var(&sv)   type(*char)   len(1)

             DCLF       FILE(ausrpf)
             call       pgm(aa007r) +
                        parm(&m1 &m2 +
                              &sv &av)
             if       cond(&sv *eq 'N') then(do)
               goto    endpgm
             enddo

lesf:        rcvf
             monmsg   msgid(cpf0864)  exec(goto cmdlbl(endpgm))

             if       cond(%sst(&abuser 1 3) *ne 'ASP') then(do)
             chgusrprf  usrprf(&abuser) status(*disabled)
             monmsg   msgid(cpf2204)  exec(goto cmdlbl(lesf))
             enddo

             goto     cmdlbl(lesf)

 ENDPGM:     ENDPGM
