             PGM        PARM(&FIRM &lage &type)

/* Initiering av parametere                                          */

             DCL        VAR(&FIRM)     TYPE(*DEC) LEN(3 0)
             DCL        VAR(&lage)     TYPE(*DEC) LEN(2 0)
             DCL        VAR(&type)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)

/* Program for printerstyring                                        */

             CALL       PGM(AP600R) PARM('VD601' '1' '0' &IN03 &BTCH)

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('VD601P' &BTCH)

/* Kaller opp program for kontrolliste                               */

             CALL       PGM(VD601R)    PARM(&FIRM &LAGE &TYPE)

             CALL       PGM(AP606C)    PARM('VD601P')
END:         ENDPGM
