             PGM        PARM(&LIST &FGRP &FEIL)

/* Initiering av parametre.                                          */

             DCL        VAR(&LIST) TYPE(*CHAR) LEN(48)
             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FEIL) TYPE(*CHAR) LEN(1)

             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10) VALUE('ADBxxx')

/* Initierer feil-flagg                                              */

             CHGVAR     VAR(&FEIL) VALUE('0')

/* Overrider vareregister til valgt filgruppe                        */

             CHGVAR     VAR(%SST(&DLIB 4 3)) VALUE(&FGRP)

             CHKOBJ     OBJ(&DLIB/VVSCL1) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF9800) EXEC(GOTO CMDLBL(FEIL))

             OVRDBF     FILE(VVSCL1) TOFILE(&DLIB/VVSCL1) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)

/* Kaller oppdateringsprogram                                        */

             CALL       PGM(VD756R) PARM(&LIST)

             GOTO       CMDLBL(END)

 FEIL:       CHGVAR     VAR(&FEIL) VALUE('1')

 END:        ENDPGM
