             PGM
             DCLF       FILE(VG00)
             DCL        VAR(&APFNAV) TYPE(*CHAR) LEN(30)
             DCL        VAR(&APFGRP) TYPE(*CHAR) LEN(3)
/*                                                                   */
             MONMSG     MSGID(CPF0001) EXEC(GOTO MELDE)
             MONMSG     MSGID(CPA0701) EXEC(GOTO START)
             MONMSG     MSGID(CPF0000) EXEC(GOTO START)
             MONMSG     MSGID(CPF9999) EXEC(GOTO START)
/*                                                                   */
/* Sette opp driftsmiljø                                             */
/*                                                                   */
             CALL       PGM(LSETUP)
/*                                                                   */
 START:      RTVDTAARA  DTAARA(*LDA (951 30)) RTNVAR(&APFNAV)
             RTVDTAARA  DTAARA(*LDA (931 3))  RTNVAR(&APFGRP)
             CHGVAR     VAR(&VALG)     VALUE(0)
             CHGVAR     VAR(&A1FNAV)   VALUE(&APFNAV)
             SNDRCVF    RCDFMT(A1MNU)
/*                                                                   */
/* Tester på funksjonstaster                                         */
/*                                                                   */
/* F3                                                                */
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
/*                                                                   */
/* Valg 1                                                            */
             IF         COND(&VALG *EQ 1) THEN(DO)
                CALL       PGM(VG200R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 2                                                            */
             IF         COND(&VALG *EQ 2) THEN(DO)
             CALL       PGM(VG220R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 3                                                            */
             IF         COND(&VALG *EQ 3) THEN(DO)
                CALL       PGM(VG210R)
             GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 4                                                            */
             IF         COND(&VALG *EQ 4) THEN(DO)
                CALL       PGM(VG205R)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 10                                                           */
             IF         COND(&VALG *EQ 10) THEN(DO)
                CALL       PGM(VG705C)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 10                                                           */
             IF         COND(&VALG *EQ 11) THEN(DO)
                CALL       PGM(VG704R)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 12                                                           */
             IF         COND(&VALG *EQ 12) THEN(DO)
                CALL       PGM(VG810R)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 13                                                           */
             IF         COND(&VALG *EQ 13) THEN(DO)
                CALL       PGM(VG812R)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 14                                                           */
             IF         COND(&VALG *EQ 14) THEN(DO)
                CALL       PGM(VG715R)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/* Valg 20                                                           */
             IF         COND(&VALG *EQ 20) THEN(DO)
                CALL       PGM(VG99) PARM(&APFGRP)
                GOTO       CMDLBL(START)
             ENDDO
/*                                                                   */
/*                                                                   */
/* Valg 90                                                           */
             IF         COND(&VALG *EQ 90) THEN(DO)
             SIGNOFF
             ENDDO
/*                                                                   */
/* Gå til start                                                      */
             GOTO       CMDLBL(START)
/*                                                                   */
 MELDE:      CALL       PGM(AA004C)
             GOTO       CMDLBL(START)
/*                                                                   */
/* Slutt                                                             */
 ENDPGM:     ENDPGM
