             PGM        parm(&fgrf &fgrt &firt)

             DCL        VAR(&SQLSTMT)  TYPE(*CHAR) LEN(2000)
             DCL        VAR(&fgrf)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&fgrt)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&firt)     TYPE(*dec) LEN(3 0)
             DCL        VAR(&firtx)    TYPE(*char) LEN(3)
             DCL        VAR(&flib)     TYPE(*CHAR) LEN(6) VALUE('ADBxxx')
             DCL        VAR(&tlib)     TYPE(*CHAR) LEN(6) VALUE('ADBxxx')

             CHGVAR     VAR(%SST(&FLIB 4 3)) VALUE(&FGRF)
             CHGVAR     VAR(%SST(&TLIB 4 3)) VALUE(&FGRT)
             CHGVAR     VAR(&FIRTX) VALUE(&FIRT)

/* rydder overgruppe, kopierer overgruppe */

             CHGVAR     VAR(&SQLSTMT) VALUE('DELETE FROM ' *CAT &TLIB *CAT +
                          '.VOGRPF WHERE VGOFIR = ' *CAT &FIRTX)
             RUNSQL     SQL(&sqlstmt) COMMIT(*NONE)
             CHGVAR     VAR(&SQLSTMT) VALUE('insert into ' *cat &TLIB *cat +
                          '.VOGRPF select * from ' *cat &fLIB *cat +
                          '.VOGRPF where vgofir =  ' *cat &firtx)
             RUNSQL     SQL(&sqlstmt) COMMIT(*NONE)
/* rydder hovedgruppe, kopierer hovedgruppe */

             CHGVAR     VAR(&SQLSTMT) VALUE('DELETE FROM ' *CAT &TLIB *CAT +
                          '.VHGRPF WHERE VGHFIR = ' *CAT &FIRTX)
             RUNSQL     SQL(&sqlstmt) COMMIT(*NONE)
             CHGVAR     VAR(&SQLSTMT) VALUE('insert into ' *cat &TLIB *cat +
                          '.VHGRPF select * from ' *cat &fLIB *cat +
                          '.VHGRPF where vghfir =  ' *cat &firtx)
             RUNSQL     SQL(&sqlstmt) COMMIT(*NONE)
/* rydder undergruppe, kopierer undergruppe */

             CHGVAR     VAR(&SQLSTMT) VALUE('DELETE FROM ' *CAT &TLIB *CAT +
                          '.VUGRPF WHERE VGUFIR = ' *CAT &FIRTX)
             RUNSQL     SQL(&sqlstmt) COMMIT(*NONE)
             CHGVAR     VAR(&SQLSTMT) VALUE('insert into ' *cat &TLIB *cat +
                          '.VUGRPF select * from ' *cat &fLIB *cat +
                          '.VUGRPF where vgufir =  ' *cat &firtx)
             RUNSQL     SQL(&sqlstmt) COMMIT(*NONE)


 END:        ENDPGM
