
/*           Generere tabeller for gjennomsnittlig kostpris    */

             PGM        parm(&FGRP)
             DCL        VAR(&FGRP)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&LIBL)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&NULL)   TYPE(*CHAR) LEN(1)
             DCLF       FILE(VG99D)

/*           Setter bibliotek til current og henter gruppeprofil     */

             CHGVAR     VAR(&LIBL) VALUE('ADB' *CAT &FGRP)
             CHGCURLIB  CURLIB(&LIBL)

/*           Starter å opprette filer                                */
             SNDRCVF    RCDFMT(A1BLD)
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&IN12) THEN(GOTO CMDLBL(ENDPGM))

 /*  Generer de valgte registere          */

             IF         COND(&VA01 *EQ '1') THEN(DO)
                CALL       PGM(AG908C) PARM('VGKPST' &FGRP '*NONE' &NULL)

             ENDDO

             IF         COND(&VA02 *EQ '1') THEN(DO)
                CALL       PGM(AG908C) PARM('VGKFST' &FGRP '*NONE' &NULL)
             ENDDO

             IF         COND(&VA03 *EQ '1') THEN(DO)
                CALL       PGM(AG908C) PARM('VGKTST' &FGRP '*NONE' &NULL)
             ENDDO

             IF         COND(&VA04 *EQ '1') THEN(DO)
                CALL       PGM(AG908C) PARM('VGKKST' &FGRP '*NONE' &NULL)
             ENDDO


 ENDPGM:     ENDPGM
