
/* Kaller program i ASLAGR for å vise beholdingstallene for vare i   */
/* alle lager                                                        */

             PGM        PARM(&FIRM &VARE)

             DCL        VAR(&FIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&VARE) TYPE(*CHAR) LEN(15)

             DCL        VAR(&RECT) TYPE(*CHAR) LEN(1) VALUE(' ')
             DCL        VAR(&MELD) TYPE(*CHAR) LEN(50)

/* Initierer melding                                                 */

             CHGVAR     VAR(&MELD) VALUE('Program for å vise +
                          beholdingstall ble ikke funnet...')

/* Kaller program i ASLAGR                                           */

             CALL       PGM(LL502R) PARM(&FIRM &VARE)

/* Melding dersom program ikke ble funnet                            */

             MONMSG     MSGID(CPF0001) EXEC(DO)
             CALL       PGM(AA005R) PARM(&MELD)
             GOTO       CMDLBL(END)
             ENDDO

 END:        ENDPGM
