             PGM    parm(&memb)

             DCL        VAR(&memb) TYPE(*CHAR) LEN(10)
/* memberstyring                                                  */



             OVRDBF     FILE(lwexpf) TOFILE(*LIBL/lwexpf) MBR(&MEMB)
/* leser inn i indeksert arbeidsbibl.                              */
             CALL       PGM(VP411R)
             MONMSG     MSGID(CPF0000)
             DLTOVR     file(lwexpf)

/*                                                                   */
 ENDPGM:     ENDPGM
