             PGM        PARM(&FIRM &KUND &KPRO &VSOR &OGRP &HGRP +
                          &UGRP &LDOR &SVAL &TVAL &XVAL &RVAL &LVAL +
                          &LETY &DATO &BTIS &lage &memb)

/* Initiering av parametre                                           */

             DCL        VAR(&FIRM) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&KUND) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&KPRO) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&VSOR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&OGRP) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&HGRP) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&UGRP) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&LDOR) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&SVAL) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&TVAL) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&XVAL) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&RVAL) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&LVAL) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&LETY) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&DATO) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTIS) TYPE(*CHAR) LEN(26)
             DCL        VAR(&MEMB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&lage) TYPE(*DEC)  LEN(2 0)

/* Oppretter og overrider member i arbeidsfil                        */

             ADDPFM     FILE(VVAWPF) MBR(&MEMB)
             OVRDBF     FILE(VVAWPF) MBR(&MEMB) OVRSCOPE(*CALLLVL)

/* Utskrift                                                          */

             CALL       PGM(VP612R) PARM(&FIRM &KUND &KPRO &VSOR +
                          &OGRP &HGRP &UGRP &LDOR &SVAL &TVAL &XVAL +
                          &RVAL &LVAL &LETY &DATO &BTIS &LAGE)

/* Fjerner member i arbeidsfil                                       */

             RMVM       FILE(VVAWPF) MBR(&MEMB)

 END:        ENDPGM
