             PGM        PARM(&LIST &FLDR)
/* 7.01 bof 220617 - utvidet parameter  */


             DCL        VAR(&LIST) TYPE(*CHAR) LEN(82) /*9.01 */
             DCL        VAR(&FLDR) TYPE(*CHAR) LEN(12)
             DCL        VAR(&JOBA) TYPE(*CHAR) LEN(10)

/* Henter jobb-nummer                                                */

             RTVJOBA    JOB(&JOBA)

/* Submitter kall til styreprogram                                   */

             SBMJOB     CMD(CALL PGM(VP681C) PARM(&LIST &FLDR +
                          &JOBA)) JOB(PRISFIL) MSGQ(*NONE)

 END:        ENDPGM
