             PGM        PARM(&BUTID &FIRMA &KUNDE &KPROS &STAT)

             DCL        VAR(&BUTID) TYPE(*CHAR) LEN(15)
             DCL        VAR(&FIRMA) TYPE(*CHAR) LEN(3)
             DCL        VAR(&KUNDE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&KPROS) TYPE(*CHAR) LEN(6)
             DCL        VAR(&RFMT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&OVRF) TYPE(*CHAR) LEN(10) VALUE('NBSPRISL')
             DCL        VAR(&STAT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&FILN) TYPE(*CHAR) LEN(64)
             DCL        VAR(&SMSG) TYPE(*CHAR) LEN(1)  VALUE('0')

/* Bygger parameterliste og danner prisliste                         */

             CALL       PGM(VP691R) PARM(&FIRMA &KUNDE &KPROS &RFMT +
                          &STAT)


/* Danner unikt filnavn og starter FTP overføring til Logiq          */

             CALL       PGM(VP695R) PARM(&BUTID &FIRMA &KUNDE &KPROS +
                          &RFMT &FILN)

             CALL       PGM(AF770C) PARM(&OVRF &STAT &FILN &SMSG)

 END:        ENDPGM
