             PGM        PARM(&PARM)

/* Definere parametere og variabler                                  */

             DCL        VAR(&PARM)     TYPE(*CHAR) LEN(32)

             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&WSID)     TYPE(*CHAR) LEN(10)

/* Overstyring av printerfile                                        */

             CALL       PGM(AP601C)    PARM('VV631P' &BTCH)

/* Utskrift                                                          */

             CALL       PGM(VV631R)    PARM(&PARM)

/* Melding dersom bakgrunnsjobb                                      */

             IF         COND(&BTCH *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (901 10)) RTNVAR(&WSID)
             SNDBRKMSG  MSG('ASPGPL: Utskrift av varer uten EAN-nr.  er +
                          ferdig') TOMSGQ(&WSID)
             ENDDO

             CALL       PGM(AP606C)    PARM('VV631P')
 END:        ENDPGM
