             PGM        PARM(&LIST &MEMB)

/* Initiering av parametre.                                          */

             DCL        VAR(&LIST)     TYPE(*CHAR) LEN(80)
             DCL        VAR(&MEMB)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN03)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&RAPP)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&BTCH)     TYPE(*CHAR) LEN(1)
/*6.30*/     DCL        VAR(&excl)     TYPE(*CHAR) LEN(1)
/*6.30*/     DCL        VAR(&skje)     TYPE(*CHAR) LEN(1)
/*6.30*/     DCL        VAR(&mail)     TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&RAPP)     VALUE('VV682P')

/* Oppdaterer LDA med navn på printfile                              */

             CHGDTAARA  DTAARA(*LDA (846 10)) VALUE(&RAPP)

/* Oppkall av utskriftsparametre.                                    */

             CALL       PGM(AP600R)    PARM('VV682' '1' '1' &IN03 &BTCH)

/* Dersom F3 eller F12 skal ikke rapporten skrives                   */

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(END))

/* Henter opplysning om utskriften skal kjøres i batch fra LDA       */

             RTVDTAARA  DTAARA(*LDA (863 1)) RTNVAR(&BTCH)
/*6.30*/     rtvdtaara  dtaara(*lda (639 1)) rtnvar(&excl)
/*6.30*/     rtvdtaara  dtaara(*lda (640 1)) rtnvar(&mail)
/*6.30*/     rtvdtaara  dtaara(*lda (637 1)) rtnvar(&skje)

/*6.30*/     if         cond(&excl *eq '1') then(chgvar +
/*6.30*/                    var(&btch) value('0'))
/*6.30*/     if         cond(&mail *eq '1') then(chgvar +
/*6.30*/                    var(&btch) value('0'))
/*6.30*/     if         cond(&skje *eq '1') then(chgvar +
/*6.30*/                    var(&btch) value('0'))

/*6.30*/     strpco     pcta(*no)
/*6.30*/     monmsg msgid(iws4010)

/* Utskrift/sletting                                                 */

/*6.30       SBMJOB     CMD(CALL PGM(VV681C) PARM(&LIST &MEMB)) +    */
/*6.30                    JOB(SLETT_VARE) MSGQ(*NONE)                */

/*6.30*/     if         cond(&btch *eq '1') then(sbmjob cmd(call +
/*6.30*/                  pgm(vv681c) parm(&list &memb)) +
/*6.30*/                  job(SLETT_VARE) msgq(*none))
/*6.30*/     else       cmd(call pgm(*libl/vv681c) parm(&list &memb))

 END:        ENDPGM
