             PGM        parm(&firm &batc &numm &oppd)

             DCL        VAR(&FGRP) TYPE(*CHAR) LEN(3)
             DCL        VAR(&BANE) TYPE(*CHAR) LEN(12)
             DCL        VAR(&firm) TYPE(*dec)  LEN(3 0)
             DCL        VAR(&batc) TYPE(*char) LEN(10)
             DCL        VAR(&numm) TYPE(*dec)  LEN(6 0)
             DCL        VAR(&oppd) TYPE(*char) LEN(1)
             DCL        VAR(&tild)  TYPE(*CHAR) LEN(25) +
                          VALUE('VaretypeS.xls')
             DCL        VAR(&tilm)  TYPE(*CHAR) LEN(20)


             RTVDTAARA  DTAARA(*LDA (931 03)) RTNVAR(&FGRP)
             CHGVAR     VAR(&BANE) VALUE('PCFILER')
             CLRPFM     FILE(*LIBL/LWEXPF)

/* Kaller varetype rette program                                     */

             CALL       PGM(VV773R) parm(&firm &batc &numm &oppd)

             chgvar     var(&tilm) value(&bane)
             call       pgm(asptostmf) parm('LWEXPF    ' 'LWEXPF    ' +
                          &tilm &tild '   ')

 END:        ENDPGM
