             PGM        PARM(&PLIST &PLIST2)

/* Initiering av parametre.                                          */

             DCL        VAR(&PLIST)  TYPE(*CHAR) LEN(260)
             DCL        VAR(&PLIST2) TYPE(*CHAR) LEN(8)

             DCL        VAR(&FGRT) TYPE(*CHAR) LEN(3)
             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10) VALUE('ADBxxx')

/* Henter variable fra parameterliste                                */

             CHGVAR     VAR(&FGRT) VALUE(%SST(&PLIST2 1 3))

/* Overrider oppdateringsindekser mot filgruppe det skal             */
/* slettes fra                                                       */

/* Overrider også indekser som benyttes i VV490R, LL765R og VV400R   */

             CHGVAR     VAR(%SST(&DLIB 4 3)) VALUE(&FGRT)

             OVRDBF     FILE(VVARLU) TOFILE(&DLIB/VVARLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VVASLU) TOFILE(&DLIB/VVASLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(SSTAL2) TOFILE(&DLIB/SSTAL2) +
                          MBR(*FIRST) OVRSCOPE(*JOB)

             OVRDBF     FILE(FODTLV) TOFILE(&DLIB/FODTLV) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(LODTLV) TOFILE(&DLIB/LODTLV) MBR(*FIRST) +
                          OVRSCOPE(*JOB)
             OVRDBF     FILE(FOHEL1) TOFILE(&DLIB/FOHEL1) MBR(*FIRST) +
                          OVRSCOPE(*JOB)
             OVRDBF     FILE(LOHEL1) TOFILE(&DLIB/LOHEL1) MBR(*FIRST) +
                          OVRSCOPE(*JOB)
             OVRDBF     FILE(FSTSL1) TOFILE(&DLIB/FSTSL1) MBR(*FIRST) +
                          OVRSCOPE(*JOB)
             OVRDBF     FILE(VOTYL1) TOFILE(&DLIB/VOTYL1) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(BSTSL1) TOFILE(&DLIB/BSTSL1) +
                          MBR(*FIRST) OVRSCOPE(*JOB)

             OVRDBF     FILE(VSDTL7) TOFILE(&DLIB/VSDTL7) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VPDTLA) TOFILE(&DLIB/VPDTLA) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VBRKL6) TOFILE(&DLIB/VBRKL6) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(FPRIL5) TOFILE(&DLIB/FPRIL5) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(FRABLA) TOFILE(&DLIB/FRABLA) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VVENLU) TOFILE(&DLIB/VVENLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VVEPLU) TOFILE(&DLIB/VVEPLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VVPRLU) TOFILE(&DLIB/VVPRLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VVSOLU) TOFILE(&DLIB/VVSOLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VSOKLU) TOFILE(&DLIB/VSOKLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VTILLU) TOFILE(&DLIB/VTILLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VETILU) TOFILE(&DLIB/VETILU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VEANL2) TOFILE(&DLIB/VEANL2) +
                          MBR(*FIRST) OVRSCOPE(*JOB)

             OVRDBF     FILE(VLAGL1) TOFILE(&DLIB/VLAGL1) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VLAGLU) TOFILE(&DLIB/VLAGLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VHISLU) TOFILE(&DLIB/VHISLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)

             OVRDBF     FILE(ANOTLU) TOFILE(&DLIB/ANOTLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)

/* Kaller sletteprogram                                              */

             CALL       PGM(VV788R) PARM(&PLIST &PLIST2)

 END:        ENDPGM
