             PGM        PARM(&LIST2 &GVAR &VARE)

/* Initiering av parametre.                                          */

             DCL        VAR(&LIST2)  TYPE(*CHAR) LEN(40)
             DCL        VAR(&GVAR)   TYPE(*CHAR) LEN(15)
             DCL        VAR(&VARE)   TYPE(*CHAR) LEN(15)

             DCL        VAR(&WFGRT)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&WFIRTA) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WFIRT)  TYPE(*DEC)  LEN(3 0)

             DCL        VAR(&INLR)   TYPE(*CHAR) LEN(1) VALUE('0')

             DCL        VAR(&WDLIB) TYPE(*CHAR) LEN(10) VALUE('ADBxxx')

/* Henter variable fra parameterliste                                */

             CHGVAR     VAR(&WFGRT) VALUE(%SST(&LIST2 1 3))

/* Overrider alle indekser som benyttes i program for bytting av     */
/* varenummer i filgruppen/firmaet det skal kopieres til             */

/* Overridingen gjelder kun for jobben som kalles !!!!!              */

             CHGVAR     VAR(%SST(&WDLIB 4 3)) VALUE(&WFGRT)

             OVRDBF     FILE(VVENLU) TOFILE(&WDLIB/VVENLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VVEPLU) TOFILE(&WDLIB/VVEPLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VVPRLU) TOFILE(&WDLIB/VVPRLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VVSOLU) TOFILE(&WDLIB/VVSOLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VSOKLU) TOFILE(&WDLIB/VSOKLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VTILLU) TOFILE(&WDLIB/VTILLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VETILU) TOFILE(&WDLIB/VETILU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VEANL2) TOFILE(&WDLIB/VEANL2) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VSDTL7) TOFILE(&WDLIB/VSDTL7) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VPDTLA) TOFILE(&WDLIB/VPDTLA) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VBRKL6) TOFILE(&WDLIB/VBRKL6) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VVAAL2) TOFILE(&WDLIB/VVAAL2) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VVERLU) TOFILE(&WDLIB/VVERLU) +
                          MBR(*FIRST) OVRSCOPE(*JOB)
             OVRDBF     FILE(VVERL2) TOFILE(&WDLIB/VVERL2) +
                          MBR(*FIRST) OVRSCOPE(*JOB)

             OVRDBF     FILE(VLAGLU) TOFILE(&WDLIB/VLAGLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VHISL3) TOFILE(&WDLIB/VHISL3) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(FRABLA) TOFILE(&WDLIB/FRABLA) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(FPRIL5) TOFILE(&WDLIB/FPRIL5) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(FPRNL2) TOFILE(&WDLIB/FPRNL2) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(FGEBLV) TOFILE(&WDLIB/FGEBLV) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(FODTLV) TOFILE(&WDLIB/FODTLV) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(NODTL4) TOFILE(&WDLIB/NODTL4) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(SODTLV) TOFILE(&WDLIB/SODTLV) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(BODTL2) TOFILE(&WDLIB/BODTL2) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(SSTAL2) TOFILE(&WDLIB/SSTAL2) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(ANOTLU) TOFILE(&WDLIB/ANOTLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(LTELL3) TOFILE(&WDLIB/LTELL3) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(LAKKLU) TOFILE(&WDLIB/LAKKLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(LODTLV) TOFILE(&WDLIB/LODTLV) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(LFDTL3) TOFILE(&WDLIB/LFDTL3) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(LLDTL3) TOFILE(&WDLIB/LLDTL3) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(LBDTL3) TOFILE(&WDLIB/LBDTL3) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(HODTL2) TOFILE(&WDLIB/HODTL2) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(MABDL9) TOFILE(&WDLIB/MABDL9) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(MPROLU) TOFILE(&WDLIB/MPROLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(MMATL5) TOFILE(&WDLIB/MMATL5) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(MPRULU) TOFILE(&WDLIB/MPRULU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(MLTIL2) TOFILE(&WDLIB/MLTIL2) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(SIDTLV) TOFILE(&WDLIB/SIDTLV) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(SISTL2) TOFILE(&WDLIB/SISTL2) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)

/* Kaller program for bytting av varenummer i alle tabeller          */

             CHGVAR     VAR(&WFIRTA) VALUE(%SST(&LIST2 4 3))
             CHGVAR     VAR(&WFIRT)  VALUE(&WFIRTA)

             CALL       PGM(VV740R) PARM(&WFIRT &GVAR &VARE &INLR)
             CALL       PGM(FO740C) PARM(&WFIRT &GVAR &VARE &INLR)

 END:        ENDPGM
