             PGM        PARM(&PLIST)

/* Initiering av parametre.                                          */

             DCL        VAR(&PLIST) TYPE(*CHAR) LEN(260)

             DCL        VAR(&WJOB)  TYPE(*CHAR) LEN(10)

/* Henter jobb-nummer                                                */

             RTVJOBA    JOB(&WJOB)

/* Kjører program i batch                                           */

             SBMJOB     CMD(CALL PGM(VV781C) PARM(&PLIST &WJOB)) +
                          JOB(FILKOPI) MSGQ(*NONE)

 END:        ENDPGM
