             PGM        PARM(&PLIST)

/* Initiering av parametre.                                          */

             DCL        VAR(&PLIST) TYPE(*CHAR) LEN(260)

/* Kjører program i batch                                            */

             SBMJOB     CMD(CALL PGM(VV786C) PARM(&PLIST)) +
                          JOB(FILKOPI) JOBPTY(6)

 END:        ENDPGM
