             PGM        PARM(&PLIST &PJOB)

/* Initiering av parametre.                                          */

             DCL        VAR(&PLIST) TYPE(*CHAR) LEN(260)
             DCL        VAR(&PJOB)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&NATT)  TYPE(*CHAR) LEN(1) VALUE('0')

/* Kaller oppdateringsprogram.                                       */

             CALL       PGM(VV781R) PARM(&PLIST &NATT)

/* Ferdigmelding                                                     */

             SNDBRKMSG  MSG('ASOFAK: Kopiering av varer til andre +
                          filgrupper/firma er ferdig') TOMSGQ(&PJOB)

 END:        ENDPGM
