             PGM        PARM(&LIST)

/* Initiering av parametre.                                          */

             DCL        VAR(&LIST) TYPE(*CHAR) LEN(40)

             DCL        VAR(&FGRT) TYPE(*CHAR) LEN(3)
             DCL        VAR(&DLIB) TYPE(*CHAR) LEN(10) VALUE('ADBxxx')

/* Henter variable fra parameterliste                                */

             CHGVAR     VAR(&FGRT) VALUE(%SST(&LIST 1 3))

/* Overrider oppdateringsindekser mot filgruppe det skal byttes      */
/* enhet i                                                           */

             CHGVAR     VAR(%SST(&DLIB 4 3)) VALUE(&FGRT)

             OVRDBF     FILE(VVARLU) TOFILE(&DLIB/VVARLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VVENLU) TOFILE(&DLIB/VVENLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VVEPLU) TOFILE(&DLIB/VVEPLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VVPRLU) TOFILE(&DLIB/VVPRLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VTILLU) TOFILE(&DLIB/VTILLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VETILU) TOFILE(&DLIB/VETILU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(FRABLA) TOFILE(&DLIB/FRABLA) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(FPRIL5) TOFILE(&DLIB/FPRIL5) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(FODTLV) TOFILE(&DLIB/FODTLV) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(NODTL4) TOFILE(&DLIB/NODTL4) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(SODTLV) TOFILE(&DLIB/SODTLV) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(VLAGLU) TOFILE(&DLIB/VLAGLU) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(VHISL3) TOFILE(&DLIB/VHISL3) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(LODTLV) TOFILE(&DLIB/LODTLV) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(LFDTL3) TOFILE(&DLIB/LFDTL3) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(LTELL3) TOFILE(&DLIB/LTELL3) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(LBDTL3) TOFILE(&DLIB/LBDTL3) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(LLDTL3) TOFILE(&DLIB/LLDTL3) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(SIDTLV) TOFILE(&DLIB/SIDTLV) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(BODTL2) TOFILE(&DLIB/BODTL2) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)

             OVRDBF     FILE(SSTAL2) TOFILE(&DLIB/SSTAL2) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)
             OVRDBF     FILE(SISTL2) TOFILE(&DLIB/SISTL2) +
                          MBR(*FIRST) OVRSCOPE(*CALLLVL)

/* Kaller bytte-program                                              */

             CALL       PGM(VV791R) PARM(&LIST)

 END:        ENDPGM
