             PGM        PARM(&WJOB)

             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

 /* Tømmer vare-query-fil                                            */

             CLRPFM     FILE(VVAQPF)

 /* Kaller program for oppretting av vare-query-fil                  */

             CALL       PGM(VV951R)

/* Ferdigmelding                                                     */

             SNDBRKMSG  MSG('ASOFAK: Vare-query-fil er opprettet') +
                          TOMSGQ(&WJOB)

 END:        ENDPGM
