             PGM

             DCL        VAR(&WJOB) TYPE(*CHAR) LEN(10)

/* Henter jobb-nummer                                                */

             RTVJOBA    JOB(&WJOB)

/* Submitter kall til behandlende program                            */

             SBMJOB     CMD(CALL PGM(VV951C) PARM(&WJOB)) +
                          JOB(VVAQPF) MSGQ(*NONE)

 END:        ENDPGM
