/*                                                                   */
/*                                                                   */
             PGM        parm(&secx)
/*                                                                   */
             dcl        var(&secx)    type(*char)   len(3)
             dcl        var(&sec)     type(*dec)    len(3 0)
             chgvar     var(&sec)     value(&secx)
/*                                                                   */
             dlyjob     dly(&sec)
 endpgm:     endpgm
/*                                                                   */
