/*******************************************************************/
/*                                                                 */
/*                                                                 */
/*                                                            */
/*                                                            */
/*                                                            */
/*                                                            */
/*                                                            */
/*                                                            */
/*                                                            */
/*                                                            */
/*                                                                 */
/*       M  U  L  T  I  -  S  U  P  P  O  R  T     A  /  S       */
/*                                                               */
/*                                                               */
/*  S p e s i a l t i l p a s n i n g e r   N e x s t e p        */
/*                                                                 */
/*******************************************************************/

             PGM        PARM(&WRESNR &WFREFPO &WLKID &WBELOPV +
                          &WVALKOD &WPROSNR &WKRDAAR &WKRDMND +
                          &WKRDDAG &WFFDAAR &WFFDMND &WFFDDAG +
                          &WBILKOD &WUSER &WPERAAR &WPERNR &WUVALKU +
                          &WUBILAG &WUTEXT &WIBENR)

             DCL        VAR(&WRESNR) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&WIBENR) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&WFREFPO) TYPE(*CHAR) LEN(20)
             DCL        VAR(&WLKID) TYPE(*CHAR) LEN(25)
             DCL        VAR(&WBELOPV) TYPE(*DEC) LEN(9 2)
             DCL        VAR(&WVALKOD) TYPE(*CHAR) LEN(3)
             DCL        VAR(&WPROSNR) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&WKRDAAR) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&WKRDMND) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&WKRDDAG) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&WFFDAAR) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&WFFDMND) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&WFFDDAG) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&WBILKOD) TYPE(*CHAR) LEN(2)
             DCL        VAR(&WUSER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WPERAAR) TYPE(*DEC) LEN(4 0)
             DCL        VAR(&WPERNR) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&WUVALKU) TYPE(*DEC) LEN(9 5)
             DCL        VAR(&WUBILAG) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&WUTEXT) TYPE(*CHAR) LEN(20)

             DCL        VAR(&ASP2LDA) TYPE(*CHAR) LEN(1024)
             DCL        VAR(&LDA) TYPE(*CHAR) LEN(1024)

             RTVDTAARA  DTAARA(*LDA) RTNVAR(&LDA)

             CRTDTAARA  DTAARA(QTEMP/ASP2LDA) TYPE(*CHAR) LEN(1024) +
                          VALUE(&LDA)
             MONMSG     MSGID(CPF1023)

             RTVDTAARA  DTAARA(QTEMP/ASPLDA) RTNVAR(&LDA)
             CHGDTAARA  DTAARA(*LDA (1 1024)) VALUE(&LDA)

             CALL       PGM(RE127R) PARM(&WRESNR &WFREFPO &WLKID +
                          &WBELOPV &WVALKOD &WPROSNR &WKRDAAR +
                          &WKRDMND &WKRDDAG &WFFDAAR &WFFDMND +
                          &WFFDDAG &WBILKOD &WUSER &WPERAAR &WPERNR +
                          &WUVALKU &WUBILAG &WUTEXT &WIBENR)


             RTVDTAARA  DTAARA(QTEMP/ASP2LDA) RTNVAR(&LDA)
             CHGDTAARA  DTAARA(*LDA (1 1024)) VALUE(&LDA)
             DLTDTAARA  DTAARA(QTEMP/ASP2LDA)

             ENDPGM
