             PGM        parm(&fgr &firm &sts)

             DCL        VAR(&fgr)    TYPE(*CHAR) LEN(3)
             DCL        VAR(&firm)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&sts)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&lib)    TYPE(*CHAR) LEN(10) value('ADB ')
/*                                                                   */
             chgvar     var(%substring(&lib 4 3)) value(&fgr)
             CHKOBJ     OBJ(&LIB/AFIRL1) OBJTYPE(*FILE)
             monmsg     msgid(cpf9810) exec(do)
               chgvar     var(&sts) value('F')
               goto       cmdlbl(endpgm)
             enddo
             OVRDBF     FILE(AFIRL1) TOFILE(&LIB/AFIRL1)
             CALL       PGM(XC003R) PARM(&firm &sts)
/*                                                                   */
/* Slutt                                                             */
 ENDPGM:     ENDPGM
