             pgm        parm(&fgr &rec &sts)

             dcl        var(&fgr)    TYPE(*char) len(3)
             dcl        var(&rec)    TYPE(*char) len(347)
             dcl        var(&sts)    TYPE(*char) len(1)
             dcl        var(&lib)    TYPE(*char) len(10) value('ADB ')
/*                                                                   */
             chgvar     var(%substring(&lib 4 3)) value(&fgr)
             chkobj     obj(&lib/rcmplu) objtype(*file)
             monmsg     msgid(cpf9810) exec(do)
               chgvar     var(&sts) value('F')
               goto       cmdlbl(endpgm)
             enddo
             ovrdbf     file(rcmplu) tofile(&lib/rcmplu)
             call       pgm(xc100r)  parm(&fgr &rec &sts)
/*                          xc100r bruker bare &sts som første par???*/
/* Slutt                                                             */
 endpgm:     endpgm
