/*********************************************************************/
/* ENDRINGER :                                                      */
/* DATO      INZ  UTFØRT                                            */
/* ---------------------------------------------------------------  */
/* 14.09.15  bsa  Nytt program                                      */
/*                                                                  */
/*****************************************************************  */

             pgm        parm(&bsta)

             dcl        var(&bsta)   type(*char) len(1)
             dcl        var(&status) type(*char) len(1)
             dcl        var(&ovrf)   type(*char) len(10)

             chgvar     var(&bsta)   value('0')

/*  Sjekker om denne overføringen er opptatt. Hvis den er        */
/*  opptatt eller hvis noe går galt så avsluttes overføringen.   */

/*  Ordrebekreftelse                                             */
             chgvar     var(&ovrf)   value('NBSEDIHNTB')
             chgvar     var(&status) value('B')
             call       pgm(xf703r) parm(&ovrf &status)
             if         cond(&status *eq 'L') then(do)
             chgvar     var(&bsta) value('1')
             goto       cmdlbl(slutt)
             enddo
             if         cond(&status *eq 'N') then(do)
             chgvar     var(&status) value('1')
             goto       cmdlbl(slutt)
             enddo

/*  Faktura                                                      */
             chgvar     var(&ovrf)   value('NBSEDIHNT ')
             chgvar     var(&status) value('B')
             call       pgm(xf703r) parm(&ovrf &status)
             if         cond(&status *eq 'L') then(do)
             chgvar     var(&bsta) value('1')
             goto       cmdlbl(slutt)
             enddo
             if         cond(&status *eq 'N') then(do)
             chgvar     var(&status) value('1')
             goto       cmdlbl(slutt)
             enddo

/* Avslutter programmet.                                                     */
slutt:       ENDPGM
