             PGM parm(&stat)

/* Initiering av parametre.                                          */

             DCL        VAR(&stat) TYPE(*CHAR) LEN(1)

/* Bygger temporær fil for mottak - avbryter om den allerede finnes  */

             CRTPF      FILE(*CURLIB/LEDITMP) RCDLEN(80) SIZE(*NOMAX)
             MONMSG     MSGID(CPF7302) EXEC(DO)
             CHGVAR     VAR(&stat) VALUE('1')
             GOTO       CMDLBL(END)
             ENDDO

/* Sletter temporær fil vi klarte å lage                             */

             DLTF       FILE(LEDITMP)

 END:        ENDPGM
