/*                                                                  */
             PGM        PARM(&FILG)

             DCL        VAR(&FILG) TYPE(*CHAR) LEN(10)

             DCLF       FILE(XPIPST)

/* Leser fra database fil. Finner hvilken IP og port 2DPOINT serveren */
/* lytter på for den bestemte filgruppen.                             */

LESFIL:      RCVF
             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(END)) /* +
                          Hvis ingen adresse er definert for +
                          filgruppen så hopper vi ut uten å lage +
                          oppstyr. Andre feil bør logges! */

             IF         COND(&XIFILG *EQ &FILG) THEN(DO)
/* Filgruppe har triggere, SLÅR AV DISSE                              */

             RMVPFTRG   FILE(&FILG/FOHEPF) TRGTIME(*ALL) TRG(*ALL) +
                          /* Hvis filgruppen ikke finnes i XPIPST +
                          så skal trigger evt. SLÅS AV. */
             MONMSG     MSGID(CPF0000)

             RMVPFTRG   FILE(&FILG/LOHEPF) TRGTIME(*ALL) TRG(*ALL) +
                          /* Hvis filgruppen ikke finnes i XPIPST +
                          så skal trigger evt. SLÅS AV. */
             MONMSG     MSGID(CPF0000)

             RMVPFTRG   FILE(&FILG/VVENPF) TRGTIME(*ALL) TRG(*ALL) +
                          /* Hvis filgruppen ikke finnes i XPIPST +
                          så skal trigger evt. SLÅS AV. */
             MONMSG     MSGID(CPF0000)

             RMVPFTRG   FILE(&FILG/RUKPPF) TRGTIME(*ALL) TRG(*ALL) +
                          /* Hvis filgruppen ikke finnes i XPIPST +
                          så skal trigger evt. SLÅS AV. */
             MONMSG     MSGID(CPF0000)

             RMVPFTRG   FILE(&FILG/RKUNPF) TRGTIME(*ALL) TRG(*ALL) +
                          /* Hvis filgruppen ikke finnes i XPIPST +
                          så skal trigger evt. SLÅS AV. */
             MONMSG     MSGID(CPF0000)

             RMVPFTRG   FILE(&FILG/FKPRPF) TRGTIME(*ALL) TRG(*ALL) +
                          /* Hvis filgruppen ikke finnes i XPIPST +
                          så skal trigger evt. SLÅS AV. */
             MONMSG     MSGID(CPF0000)

             RMVPFTRG   FILE(&FILG/RLEVPF) TRGTIME(*ALL) TRG(*ALL) +
                          /* Hvis filgruppen ikke finnes i XPIPST +
                          så skal trigger evt. SLÅS AV. */
             MONMSG     MSGID(CPF0000)

             RMVPFTRG   FILE(&FILG/VVPRPF) TRGTIME(*ALL) TRG(*ALL) +
                          /* Hvis filgruppen ikke finnes i XPIPST +
                          så skal trigger evt. SLÅS AV. */
             MONMSG     MSGID(CPF0000)

             RMVPFTRG   FILE(&FILG/VEANPF) TRGTIME(*ALL) TRG(*ALL) +
                          /* Hvis filgruppen ikke finnes i XPIPST +
                          så skal trigger evt. SLÅS AV. */
             MONMSG     MSGID(CPF0000)
/* Ferdig, gå til avslutt                                             */
             GOTO       CMDLBL(END)
             ENDDO

             GOTO       CMDLBL(LESFIL)
END:
             ENDPGM
